; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]apps--libapps.a/[inter]apps--libapps-lib-app_rand.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]apps--libapps.a/[inter]apps--libapps-lib-app_rand.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bio_st = type opaque
%struct.conf_st = type { %struct.conf_method_st*, i8*, %struct.lhash_st_CONF_VALUE* }
%struct.conf_method_st = type { i8*, %struct.conf_st* (%struct.conf_method_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*, %struct.bio_st*, i64*)*, i32 (%struct.conf_st*, %struct.bio_st*)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8*, i64*)* }
%struct.lhash_st_CONF_VALUE = type { %union.lh_CONF_VALUE_dummy }
%union.lh_CONF_VALUE_dummy = type { i8* }

@.str = private unnamed_addr constant [9 x i8] c"RANDFILE\00", align 1
@bio_err = external global %struct.bio_st*, align 8
@.str.1 = private unnamed_addr constant [24 x i8] c"Can't load %s into RNG\0A\00", align 1
@save_rand_file = internal global i8* null, align 8
@.str.2 = private unnamed_addr constant [16 x i8] c"apps/app_rand.c\00", align 1
@.str.3 = private unnamed_addr constant [28 x i8] c"Cannot write random bytes:\0A\00", align 1

; Function Attrs: nounwind uwtable
define void @app_RAND_load_conf(%struct.conf_st* %c, i8* %section) #0 !dbg !19 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !10, globals: !12)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]apps--libapps.a/[inter]apps--libapps-lib-app_rand.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]apps--libapps.a")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "r_range", file: !4, line: 76, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "apps/app_rand.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]apps--libapps.a")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "OPT_R__FIRST", value: 1500)
!7 = !DIEnumerator(name: "OPT_R_RAND", value: 1501)
!8 = !DIEnumerator(name: "OPT_R_WRITERAND", value: 1502)
!9 = !DIEnumerator(name: "OPT_R__LAST", value: 1503)
!10 = !{!11, !3}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !{!13}
!13 = distinct !DIGlobalVariable(name: "save_rand_file", scope: !0, file: !4, line: 16, type: !14, isLocal: true, isDefinition: true, variable: i8** @save_rand_file)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!16 = !{i32 2, !"Dwarf Version", i32 4}
!17 = !{i32 2, !"Debug Info Version", i32 3}
!18 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!19 = distinct !DISubprogram(name: "app_RAND_load_conf", scope: !4, file: !4, line: 18, type: !20, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !83)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22, !34}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF", file: !24, line: 144, baseType: !25)
!24 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]apps--libapps.a")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_st", file: !26, line: 103, size: 192, align: 64, elements: !27)
!26 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]apps--libapps.a")
!27 = !{!28, !71, !72}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !25, file: !26, line: 104, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_METHOD", file: !26, line: 35, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_method_st", file: !26, line: 37, size: 640, align: 64, elements: !32)
!32 = !{!33, !36, !40, !45, !46, !47, !56, !62, !66, !67}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !31, file: !26, line: 38, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !31, file: !26, line: 39, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!22, !29}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !31, file: !26, line: 40, baseType: !41, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !22}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !31, file: !26, line: 41, baseType: !41, size: 64, align: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_data", scope: !31, file: !26, line: 42, baseType: !41, size: 64, align: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "load_bio", scope: !31, file: !26, line: 43, baseType: !48, size: 64, align: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!44, !22, !51, !54}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !24, line: 79, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !24, line: 79, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !31, file: !26, line: 44, baseType: !57, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!44, !60, !51}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "is_number", scope: !31, file: !26, line: 45, baseType: !63, size: 64, align: 64, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!44, !60, !15}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "to_int", scope: !31, file: !26, line: 46, baseType: !63, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !31, file: !26, line: 47, baseType: !68, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!44, !22, !34, !54}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "meth_data", scope: !25, file: !26, line: 105, baseType: !11, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !25, file: !26, line: 106, baseType: !73, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st_CONF_VALUE", file: !26, line: 31, size: 64, align: 64, elements: !75)
!75 = !{!76}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !74, file: !26, line: 31, baseType: !77, size: 64, align: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "lh_CONF_VALUE_dummy", file: !26, line: 31, size: 64, align: 64, elements: !78)
!78 = !{!79, !80, !82}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !77, file: !26, line: 31, baseType: !11, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !77, file: !26, line: 31, baseType: !81, size: 64, align: 64)
!81 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !77, file: !26, line: 31, baseType: !44, size: 32, align: 32)
!83 = !{}
!84 = !DILocalVariable(name: "c", arg: 1, scope: !19, file: !4, line: 18, type: !22)
!85 = !DIExpression()
!86 = !DILocation(line: 18, column: 31, scope: !19)
!87 = !DILocalVariable(name: "section", arg: 2, scope: !19, file: !4, line: 18, type: !34)
!88 = !DILocation(line: 18, column: 46, scope: !19)
!89 = !DILocalVariable(name: "randfile", scope: !19, file: !4, line: 20, type: !34)
!90 = !DILocation(line: 20, column: 17, scope: !19)
!91 = !DILocation(line: 20, column: 45, scope: !19)
!92 = !DILocation(line: 20, column: 48, scope: !19)
!93 = !DILocation(line: 20, column: 28, scope: !19)
!94 = !DILocation(line: 22, column: 9, scope: !95)
!95 = distinct !DILexicalBlock(scope: !19, file: !4, line: 22, column: 9)
!96 = !DILocation(line: 22, column: 18, scope: !95)
!97 = !DILocation(line: 22, column: 9, scope: !19)
!98 = !DILocation(line: 23, column: 9, scope: !99)
!99 = distinct !DILexicalBlock(scope: !95, file: !4, line: 22, column: 26)
!100 = !DILocation(line: 24, column: 9, scope: !99)
!101 = !DILocation(line: 26, column: 24, scope: !102)
!102 = distinct !DILexicalBlock(scope: !19, file: !4, line: 26, column: 9)
!103 = !DILocation(line: 26, column: 9, scope: !102)
!104 = !DILocation(line: 26, column: 38, scope: !102)
!105 = !DILocation(line: 26, column: 9, scope: !19)
!106 = !DILocation(line: 27, column: 20, scope: !107)
!107 = distinct !DILexicalBlock(scope: !102, file: !4, line: 26, column: 43)
!108 = !DILocation(line: 27, column: 57, scope: !107)
!109 = !DILocation(line: 27, column: 9, scope: !107)
!110 = !DILocation(line: 28, column: 26, scope: !107)
!111 = !DILocation(line: 28, column: 9, scope: !107)
!112 = !DILocation(line: 29, column: 5, scope: !107)
!113 = !DILocation(line: 30, column: 9, scope: !114)
!114 = distinct !DILexicalBlock(scope: !19, file: !4, line: 30, column: 9)
!115 = !DILocation(line: 30, column: 24, scope: !114)
!116 = !DILocation(line: 30, column: 9, scope: !19)
!117 = !DILocation(line: 31, column: 40, scope: !114)
!118 = !DILocation(line: 31, column: 26, scope: !114)
!119 = !DILocation(line: 31, column: 24, scope: !114)
!120 = !DILocation(line: 31, column: 9, scope: !114)
!121 = !DILocation(line: 32, column: 1, scope: !19)
!122 = distinct !DISubprogram(name: "app_RAND_write", scope: !4, file: !4, line: 60, type: !123, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !83)
!123 = !DISubroutineType(types: !124)
!124 = !{null}
!125 = !DILocation(line: 62, column: 9, scope: !126)
!126 = distinct !DILexicalBlock(scope: !122, file: !4, line: 62, column: 9)
!127 = !DILocation(line: 62, column: 24, scope: !126)
!128 = !DILocation(line: 62, column: 9, scope: !122)
!129 = !DILocation(line: 63, column: 9, scope: !126)
!130 = !DILocation(line: 64, column: 25, scope: !131)
!131 = distinct !DILexicalBlock(scope: !122, file: !4, line: 64, column: 9)
