; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--bntest/[inter]test--bntest-bin-bntest.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--bntest/[inter]test--bntest-bin-bntest.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.options_st = type { i8*, i32, i32, i8* }
%struct.bignum_ctx = type opaque
%struct.mpitest_st = type { i8*, i8*, i64 }
%struct.filetest_st = type { i8*, i32 (%struct.stanza_st*)* }
%struct.stanza_st = type { i8*, %struct.bio_st*, i32, i32, i32, i32, i32, i32, [20 x %struct.pair_st], %struct.bio_st*, [4096 x i8] }
%struct.pair_st = type { i8*, i8* }
%struct.bio_st = type opaque
%struct.bignum_st = type opaque
%struct.bn_recp_ctx_st = type opaque
%struct.bn_mont_ctx_st = type opaque
%struct.bn_gencb_st = type opaque


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !7)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--bntest/[inter]test--bntest-bin-bntest.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--bntest")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!6 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!7 = !{!8, !29, !34, !36, !37, !42, !46, !51, !52, !56, !57, !70, !72, !74, !78, !82, !83}
!8 = distinct !DIGlobalVariable(name: "test_options", scope: !9, file: !10, line: 2267, type: !26, isLocal: true, isDefinition: true, variable: [10 x %struct.options_st]* @test_get_options.test_options)
!9 = distinct !DISubprogram(name: "test_get_options", scope: !10, file: !10, line: 2264, type: !11, isLocal: false, isDefinition: true, scopeLine: 2265, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!10 = !DIFile(filename: "test/bntest.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--bntest")
!11 = !DISubroutineType(types: !12)
!12 = !{!13}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPTIONS", file: !16, line: 280, baseType: !17)
!16 = !DIFile(filename: "apps/include/opt.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--bntest")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "options_st", file: !16, line: 269, size: 192, align: 64, elements: !18)
!18 = !{!19, !23, !24, !25}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !17, file: !16, line: 270, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !17, file: !16, line: 271, baseType: !4, size: 32, align: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "valtype", scope: !17, file: !16, line: 278, baseType: !4, size: 32, align: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "helpstr", scope: !17, file: !16, line: 279, baseType: !20, size: 64, align: 64, offset: 128)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 1920, align: 64, elements: !27)
!27 = !{!28}
!28 = !DISubrange(count: 10)
!29 = distinct !DIGlobalVariable(name: "ctx", scope: !0, file: !10, line: 46, type: !30, isLocal: true, isDefinition: true, variable: %struct.bignum_ctx** @ctx)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_CTX", file: !32, line: 81, baseType: !33)
!32 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--bntest")
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_ctx", file: !32, line: 81, flags: DIFlagFwdDecl)
!34 = distinct !DIGlobalVariable(name: "NUM0", scope: !0, file: !10, line: 44, type: !35, isLocal: true, isDefinition: true, variable: i32 100)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!36 = distinct !DIGlobalVariable(name: "NUM1", scope: !0, file: !10, line: 45, type: !35, isLocal: true, isDefinition: true, variable: i32 50)
!37 = distinct !DIGlobalVariable(name: "neg", scope: !38, file: !10, line: 147, type: !41, isLocal: true, isDefinition: true, variable: i32* @rand_neg.neg)
!38 = distinct !DISubprogram(name: "rand_neg", scope: !10, file: !10, line: 145, type: !39, isLocal: true, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!39 = !DISubroutineType(types: !40)
!40 = !{!4}
!41 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!42 = distinct !DIGlobalVariable(name: "sign", scope: !38, file: !10, line: 148, type: !43, isLocal: true, isDefinition: true, variable: [8 x i32]* @rand_neg.sign)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, align: 32, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 8)
!46 = distinct !DIGlobalVariable(name: "ahex", scope: !47, file: !10, line: 446, type: !48, isLocal: true, isDefinition: true, variable: [13 x i8*]* @test_modexp_mont5.ahex)
!47 = distinct !DISubprogram(name: "test_modexp_mont5", scope: !10, file: !10, line: 384, type: !39, isLocal: true, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 832, align: 64, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 13)
!51 = distinct !DIGlobalVariable(name: "nhex", scope: !47, file: !10, line: 461, type: !48, isLocal: true, isDefinition: true, variable: [13 x i8*]* @test_modexp_mont5.nhex)
!52 = distinct !DIGlobalVariable(name: "bn1strings", scope: !0, file: !10, line: 340, type: !53, isLocal: true, isDefinition: true, variable: [17 x i8*]* @bn1strings)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1088, align: 64, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 17)
!56 = distinct !DIGlobalVariable(name: "bn2strings", scope: !0, file: !10, line: 360, type: !53, isLocal: true, isDefinition: true, variable: [17 x i8*]* @bn2strings)
!57 = distinct !DIGlobalVariable(name: "kMPITests", scope: !0, file: !10, line: 1853, type: !58, isLocal: true, isDefinition: true, variable: [6 x %struct.mpitest_st]* @kMPITests)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 1152, align: 64, elements: !68)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPITEST", file: !10, line: 42, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpitest_st", file: !10, line: 38, size: 192, align: 64, elements: !62)
!62 = !{!63, !64, !65}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "base10", scope: !61, file: !10, line: 39, baseType: !20, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "mpi", scope: !61, file: !10, line: 40, baseType: !20, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "mpi_len", scope: !61, file: !10, line: 41, baseType: !66, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !67, line: 216, baseType: !6)
!67 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--bntest")
!68 = !{!69}
!69 = !DISubrange(count: 6)
!70 = distinct !DIGlobalVariable(name: "kBits", scope: !71, file: !10, line: 2140, type: !35, isLocal: true, isDefinition: true, variable: i32* @test_smallprime.kBits)
!71 = distinct !DISubprogram(name: "test_smallprime", scope: !10, file: !10, line: 2138, type: !39, isLocal: true, isDefinition: true, scopeLine: 2139, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!72 = distinct !DIGlobalVariable(name: "p0", scope: !0, file: !10, line: 52, type: !73, isLocal: true, isDefinition: true, variable: [6 x i32]* @p0)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, align: 32, elements: !68)
!74 = distinct !DIGlobalVariable(name: "p1", scope: !0, file: !10, line: 53, type: !75, isLocal: true, isDefinition: true, variable: [4 x i32]* @p1)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, align: 32, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 4)
!78 = distinct !DIGlobalVariable(name: "primes", scope: !0, file: !10, line: 2156, type: !79, isLocal: true, isDefinition: true, variable: [5 x i32]* @primes)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, align: 32, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 5)
!82 = distinct !DIGlobalVariable(name: "not_primes", scope: !0, file: !10, line: 2180, type: !75, isLocal: true, isDefinition: true, variable: [4 x i32]* @not_primes)
!83 = distinct !DIGlobalVariable(name: "filetests", scope: !84, file: !10, line: 2205, type: !118, isLocal: true, isDefinition: true, variable: [11 x %struct.filetest_st]* @file_test_run.filetests)
!84 = distinct !DISubprogram(name: "file_test_run", scope: !10, file: !10, line: 2203, type: !85, isLocal: true, isDefinition: true, scopeLine: 2204, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!85 = !DISubroutineType(types: !86)
!86 = !{!4, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "STANZA", file: !89, line: 498, baseType: !90)
!89 = !DIFile(filename: "test/testutil.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--bntest")
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stanza_st", file: !89, line: 486, size: 35712, align: 64, elements: !91)
!91 = !{!92, !93, !97, !98, !99, !100, !101, !102, !103, !113, !114}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "test_file", scope: !90, file: !89, line: 487, baseType: !20, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !90, file: !89, line: 488, baseType: !94, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !32, line: 79, baseType: !96)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !32, line: 79, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !90, file: !89, line: 489, baseType: !4, size: 32, align: 32, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !90, file: !89, line: 490, baseType: !4, size: 32, align: 32, offset: 160)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !90, file: !89, line: 491, baseType: !4, size: 32, align: 32, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "numtests", scope: !90, file: !89, line: 492, baseType: !4, size: 32, align: 32, offset: 224)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "numskip", scope: !90, file: !89, line: 493, baseType: !4, size: 32, align: 32, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "numpairs", scope: !90, file: !89, line: 494, baseType: !4, size: 32, align: 32, offset: 288)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pairs", scope: !90, file: !89, line: 495, baseType: !104, size: 2560, align: 64, offset: 320)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 2560, align: 64, elements: !111)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PAIR", file: !89, line: 484, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair_st", file: !89, line: 481, size: 128, align: 64, elements: !107)
!107 = !{!108, !110}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !106, file: !89, line: 482, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !106, file: !89, line: 483, baseType: !109, size: 64, align: 64, offset: 64)
!111 = !{!112}
!112 = !DISubrange(count: 20)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !90, file: !89, line: 496, baseType: !94, size: 64, align: 64, offset: 2880)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !90, file: !89, line: 497, baseType: !115, size: 32768, align: 8, offset: 2944)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 32768, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 4096)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 1408, align: 64, elements: !126)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILETEST", file: !10, line: 36, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filetest_st", file: !10, line: 33, size: 128, align: 64, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !10, line: 34, baseType: !20, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !121, file: !10, line: 35, baseType: !125, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!126 = !{!127}
!127 = !DISubrange(count: 11)
!128 = !{i32 2, !"Dwarf Version", i32 4}
!129 = !{i32 2, !"Debug Info Version", i32 3}
!130 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!131 = !DILocation(line: 2273, column: 5, scope: !9)
!132 = distinct !DISubprogram(name: "setup_tests", scope: !10, file: !10, line: 2276, type: !39, isLocal: false, isDefinition: true, scopeLine: 2277, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!133 = !DILocalVariable(name: "n", scope: !132, file: !10, line: 2278, type: !4)
!134 = !DIExpression()
!135 = !DILocation(line: 2278, column: 9, scope: !132)
!136 = !DILocation(line: 2278, column: 13, scope: !132)
!137 = !DILocation(line: 2280, column: 70, scope: !138)
!138 = distinct !DILexicalBlock(scope: !132, file: !10, line: 2280, column: 9)
!139 = !DILocation(line: 2280, column: 68, scope: !138)
!140 = !DILocation(line: 2280, column: 64, scope: !138)
!141 = !DILocation(line: 2280, column: 10, scope: !142)
!142 = !DILexicalBlockFile(scope: !138, file: !10, discriminator: 1)
!143 = !DILocation(line: 2280, column: 10, scope: !138)
!144 = !DILocation(line: 2280, column: 9, scope: !132)
!145 = !DILocation(line: 2281, column: 9, scope: !138)
!146 = !DILocation(line: 2283, column: 9, scope: !147)
!147 = distinct !DILexicalBlock(scope: !132, file: !10, line: 2283, column: 9)
!148 = !DILocation(line: 2283, column: 11, scope: !147)
!149 = !DILocation(line: 2283, column: 9, scope: !132)
!150 = !DILocation(line: 2284, column: 9, scope: !151)
!151 = distinct !DILexicalBlock(scope: !147, file: !10, line: 2283, column: 17)
!152 = !DILocation(line: 2285, column: 9, scope: !151)
!153 = !DILocation(line: 2286, column: 9, scope: !151)
!154 = !DILocation(line: 2287, column: 9, scope: !151)
!155 = !DILocation(line: 2288, column: 9, scope: !151)
!156 = !DILocation(line: 2289, column: 9, scope: !151)
!157 = !DILocation(line: 2290, column: 9, scope: !151)
!158 = !DILocation(line: 2291, column: 9, scope: !151)
!159 = !DILocation(line: 2292, column: 9, scope: !151)
!160 = !DILocation(line: 2293, column: 9, scope: !151)
!161 = !DILocation(line: 2294, column: 9, scope: !151)
!162 = !DILocation(line: 2295, column: 9, scope: !151)
!163 = !DILocation(line: 2296, column: 9, scope: !151)
!164 = !DILocation(line: 2297, column: 9, scope: !151)
!165 = !DILocation(line: 2298, column: 9, scope: !151)
!166 = !DILocation(line: 2299, column: 9, scope: !151)
!167 = !DILocation(line: 2300, column: 9, scope: !151)
!168 = !DILocation(line: 2302, column: 9, scope: !151)
!169 = !DILocation(line: 2303, column: 9, scope: !151)
!170 = !DILocation(line: 2304, column: 9, scope: !151)
!171 = !DILocation(line: 2305, column: 9, scope: !151)
!172 = !DILocation(line: 2306, column: 9, scope: !151)
!173 = !DILocation(line: 2307, column: 9, scope: !151)
!174 = !DILocation(line: 2308, column: 9, scope: !151)
!175 = !DILocation(line: 2309, column: 9, scope: !151)
!176 = !DILocation(line: 2310, column: 9, scope: !151)
!177 = !DILocation(line: 2312, column: 9, scope: !151)
!178 = !DILocation(line: 2313, column: 9, scope: !151)
!179 = !DILocation(line: 2314, column: 5, scope: !151)
!180 = !DILocation(line: 2315, column: 57, scope: !181)
!181 = distinct !DILexicalBlock(scope: !147, file: !10, line: 2314, column: 12)
!182 = !DILocation(line: 2315, column: 9, scope: !181)
!183 = !DILocation(line: 2317, column: 5, scope: !132)
!184 = !DILocation(line: 2318, column: 1, scope: !132)
!185 = distinct !DISubprogram(name: "test_sub", scope: !10, file: !10, line: 226, type: !39, isLocal: true, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!186 = !DILocalVariable(name: "a", scope: !185, file: !10, line: 228, type: !187)
