; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--avienc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--avienc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVLangCodespace", file: !939, line: 30, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "./libavformat/avlanguage.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!940 = !{!941, !942, !943}
!941 = !DIEnumerator(name: "AV_LANG_ISO639_2_BIBL", value: 0)
!942 = !DIEnumerator(name: "AV_LANG_ISO639_2_TERM", value: 1)
!943 = !DIEnumerator(name: "AV_LANG_ISO639_1", value: 2)
!944 = !{!945, !946, !947, !949, !950, !952, !953, !955}
!945 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!946 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !948, line: 51, baseType: !949)
!948 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!949 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !948, line: 119, baseType: !954)
!954 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !948, line: 40, baseType: !954)
!956 = !{!957, !2256, !2257}
!957 = distinct !DIGlobalVariable(name: "ff_avi_muxer", scope: !0, file: !958, line: 993, type: !959, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_avi_muxer)
!958 = !DIFile(filename: "libavformat/avienc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !961)
!961 = !{!962, !965, !966, !967, !968, !969, !970, !971, !972, !982, !1060, !1062, !1063, !2221, !2222, !2223, !2227, !2231, !2235, !2236, !2241, !2242, !2243, !2244, !2245, !2246, !2250}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !960, file: !919, line: 498, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !960, file: !919, line: 504, baseType: !963, size: 64, align: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !960, file: !919, line: 505, baseType: !963, size: 64, align: 64, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !960, file: !919, line: 506, baseType: !963, size: 64, align: 64, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !960, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !960, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !960, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !960, file: !919, line: 517, baseType: !946, size: 32, align: 32, offset: 352)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !960, file: !919, line: 523, baseType: !973, size: 64, align: 64, offset: 384)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !978, line: 44, size: 64, align: 32, elements: !979)
!978 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !977, file: !978, line: 45, baseType: !3, size: 32, align: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !977, file: !978, line: 46, baseType: !949, size: 32, align: 32, offset: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !960, file: !919, line: 526, baseType: !983, size: 64, align: 64, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !987)
!987 = !{!988, !989, !993, !1019, !1020, !1021, !1022, !1026, !1032, !1034, !1038}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !986, file: !486, line: 72, baseType: !963, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !986, file: !486, line: 78, baseType: !990, size: 64, align: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!963, !952}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !986, file: !486, line: 85, baseType: !994, size: 64, align: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1015, !1016, !1017, !1018}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !996, file: !464, line: 247, baseType: !963, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !996, file: !464, line: 253, baseType: !963, size: 64, align: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !996, file: !464, line: 259, baseType: !946, size: 32, align: 32, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !996, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !996, file: !464, line: 271, baseType: !1003, size: 64, align: 64, offset: 192)
!1003 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !996, file: !464, line: 265, size: 64, align: 64, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1003, file: !464, line: 266, baseType: !955, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1003, file: !464, line: 267, baseType: !945, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1003, file: !464, line: 268, baseType: !963, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1003, file: !464, line: 270, baseType: !1009, size: 64, align: 32)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1010, line: 61, baseType: !1011)
!1010 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1010, line: 58, size: 64, align: 32, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1011, file: !1010, line: 59, baseType: !946, size: 32, align: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1011, file: !1010, line: 60, baseType: !946, size: 32, align: 32, offset: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !996, file: !464, line: 272, baseType: !945, size: 64, align: 64, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !996, file: !464, line: 273, baseType: !945, size: 64, align: 64, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !996, file: !464, line: 275, baseType: !946, size: 32, align: 32, offset: 384)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !996, file: !464, line: 300, baseType: !963, size: 64, align: 64, offset: 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !986, file: !486, line: 93, baseType: !946, size: 32, align: 32, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !986, file: !486, line: 99, baseType: !946, size: 32, align: 32, offset: 224)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !986, file: !486, line: 108, baseType: !946, size: 32, align: 32, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !986, file: !486, line: 113, baseType: !1023, size: 64, align: 64, offset: 320)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!952, !952, !952}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !986, file: !486, line: 123, baseType: !1027, size: 64, align: 64, offset: 384)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!1030, !1030}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !986, file: !486, line: 130, baseType: !1033, size: 32, align: 32, offset: 448)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !986, file: !486, line: 136, baseType: !1035, size: 64, align: 64, offset: 512)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!1033, !952}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !986, file: !486, line: 142, baseType: !1039, size: 64, align: 64, offset: 576)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!946, !1042, !952, !963, !946}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1045)
!1045 = !{!1046, !1058, !1059}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1044, file: !464, line: 360, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1051)
!1051 = !{!1052, !1053, !1054, !1055, !1056, !1057}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1050, file: !464, line: 307, baseType: !963, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1050, file: !464, line: 313, baseType: !945, size: 64, align: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1050, file: !464, line: 313, baseType: !945, size: 64, align: 64, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1050, file: !464, line: 318, baseType: !945, size: 64, align: 64, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1050, file: !464, line: 318, baseType: !945, size: 64, align: 64, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1050, file: !464, line: 323, baseType: !946, size: 32, align: 32, offset: 320)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1044, file: !464, line: 364, baseType: !946, size: 32, align: 32, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1044, file: !464, line: 368, baseType: !946, size: 32, align: 32, offset: 96)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !960, file: !919, line: 535, baseType: !1061, size: 64, align: 64, offset: 512)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !960, file: !919, line: 539, baseType: !946, size: 32, align: 32, offset: 576)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !960, file: !919, line: 541, baseType: !1064, size: 64, align: 64, offset: 640)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!946, !1067}
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1069)
!1069 = !{!1070, !1071, !1169, !1170, !1171, !1237, !1238, !1239, !2075, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2129, !2130, !2131, !2132, !2133, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2184, !2185, !2188, !2189, !2190, !2191, !2192, !2193, !2198, !2199, !2200, !2201, !2209, !2210, !2214, !2218, !2219, !2220}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1068, file: !919, line: 1342, baseType: !983, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1068, file: !919, line: 1349, baseType: !1072, size: 64, align: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1099, !1100, !1140, !1141, !1145, !1150, !1151, !1152, !1156, !1162, !1168}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1073, file: !919, line: 638, baseType: !963, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1073, file: !919, line: 645, baseType: !963, size: 64, align: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1073, file: !919, line: 652, baseType: !946, size: 32, align: 32, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1073, file: !919, line: 659, baseType: !963, size: 64, align: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1073, file: !919, line: 661, baseType: !973, size: 64, align: 64, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1073, file: !919, line: 663, baseType: !983, size: 64, align: 64, offset: 320)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1073, file: !919, line: 670, baseType: !963, size: 64, align: 64, offset: 384)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1073, file: !919, line: 679, baseType: !1072, size: 64, align: 64, offset: 448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1073, file: !919, line: 684, baseType: !946, size: 32, align: 32, offset: 512)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1073, file: !919, line: 689, baseType: !946, size: 32, align: 32, offset: 544)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1073, file: !919, line: 696, baseType: !1086, size: 64, align: 64, offset: 576)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!946, !1089}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1092)
!1092 = !{!1093, !1094, !1097, !1098}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1091, file: !919, line: 449, baseType: !963, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1091, file: !919, line: 450, baseType: !1095, size: 64, align: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1091, file: !919, line: 451, baseType: !946, size: 32, align: 32, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1091, file: !919, line: 452, baseType: !963, size: 64, align: 64, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1073, file: !919, line: 703, baseType: !1064, size: 64, align: 64, offset: 640)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1073, file: !919, line: 714, baseType: !1101, size: 64, align: 64, offset: 704)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!946, !1067, !1104}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1107)
!1107 = !{!1108, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1136, !1137, !1138, !1139}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1106, file: !4, line: 1451, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1111, line: 94, baseType: !1112)
!1111 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1111, line: 81, size: 192, align: 64, elements: !1113)
!1113 = !{!1114, !1118, !1121}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1112, file: !1111, line: 82, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1111, line: 73, baseType: !1117)
!1117 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1111, line: 73, flags: DIFlagFwdDecl)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1112, file: !1111, line: 89, baseType: !1119, size: 64, align: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !948, line: 48, baseType: !1096)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1112, file: !1111, line: 93, baseType: !946, size: 32, align: 32, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1106, file: !4, line: 1461, baseType: !955, size: 64, align: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1106, file: !4, line: 1467, baseType: !955, size: 64, align: 64, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1106, file: !4, line: 1468, baseType: !1119, size: 64, align: 64, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1106, file: !4, line: 1469, baseType: !946, size: 32, align: 32, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1106, file: !4, line: 1470, baseType: !946, size: 32, align: 32, offset: 288)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1106, file: !4, line: 1474, baseType: !946, size: 32, align: 32, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1106, file: !4, line: 1479, baseType: !1129, size: 64, align: 64, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1132)
!1132 = !{!1133, !1134, !1135}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1131, file: !4, line: 1412, baseType: !1119, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1131, file: !4, line: 1413, baseType: !946, size: 32, align: 32, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1131, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1106, file: !4, line: 1480, baseType: !946, size: 32, align: 32, offset: 448)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1106, file: !4, line: 1486, baseType: !955, size: 64, align: 64, offset: 512)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1106, file: !4, line: 1488, baseType: !955, size: 64, align: 64, offset: 576)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1106, file: !4, line: 1497, baseType: !955, size: 64, align: 64, offset: 640)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1073, file: !919, line: 720, baseType: !1064, size: 64, align: 64, offset: 768)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1073, file: !919, line: 730, baseType: !1142, size: 64, align: 64, offset: 832)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!946, !1067, !946, !955, !946}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1073, file: !919, line: 737, baseType: !1146, size: 64, align: 64, offset: 896)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!955, !1067, !946, !1149, !955}
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1073, file: !919, line: 744, baseType: !1064, size: 64, align: 64, offset: 960)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1073, file: !919, line: 750, baseType: !1064, size: 64, align: 64, offset: 1024)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1073, file: !919, line: 758, baseType: !1153, size: 64, align: 64, offset: 1088)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!946, !1067, !946, !955, !955, !955, !946}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1073, file: !919, line: 764, baseType: !1157, size: 64, align: 64, offset: 1152)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!946, !1067, !1160}
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1073, file: !919, line: 770, baseType: !1163, size: 64, align: 64, offset: 1216)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!946, !1067, !1166}
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1073, file: !919, line: 776, baseType: !1163, size: 64, align: 64, offset: 1280)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1068, file: !919, line: 1356, baseType: !1061, size: 64, align: 64, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1068, file: !919, line: 1365, baseType: !952, size: 64, align: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1068, file: !919, line: 1379, baseType: !1172, size: 64, align: 64, offset: 256)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1175)
!1175 = !{!1176, !1177, !1178, !1179, !1180, !1181, !1182, !1186, !1187, !1191, !1192, !1193, !1194, !1195, !1197, !1198, !1204, !1205, !1209, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1227, !1228, !1229, !1230, !1234, !1235, !1236}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1174, file: !537, line: 174, baseType: !983, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1174, file: !537, line: 226, baseType: !1095, size: 64, align: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1174, file: !537, line: 227, baseType: !946, size: 32, align: 32, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1174, file: !537, line: 228, baseType: !1095, size: 64, align: 64, offset: 192)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1174, file: !537, line: 229, baseType: !1095, size: 64, align: 64, offset: 256)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1174, file: !537, line: 233, baseType: !952, size: 64, align: 64, offset: 320)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1174, file: !537, line: 235, baseType: !1183, size: 64, align: 64, offset: 384)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!946, !952, !1119, !946}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1174, file: !537, line: 236, baseType: !1183, size: 64, align: 64, offset: 448)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1174, file: !537, line: 237, baseType: !1188, size: 64, align: 64, offset: 512)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{!955, !952, !955, !946}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1174, file: !537, line: 238, baseType: !955, size: 64, align: 64, offset: 576)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1174, file: !537, line: 239, baseType: !946, size: 32, align: 32, offset: 640)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1174, file: !537, line: 240, baseType: !946, size: 32, align: 32, offset: 672)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1174, file: !537, line: 241, baseType: !946, size: 32, align: 32, offset: 704)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1174, file: !537, line: 242, baseType: !1196, size: 64, align: 64, offset: 768)
!1196 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1174, file: !537, line: 243, baseType: !1095, size: 64, align: 64, offset: 832)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1174, file: !537, line: 244, baseType: !1199, size: 64, align: 64, offset: 896)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!1196, !1196, !1202, !949}
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1174, file: !537, line: 245, baseType: !946, size: 32, align: 32, offset: 960)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1174, file: !537, line: 249, baseType: !1206, size: 64, align: 64, offset: 1024)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!946, !952, !946}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1174, file: !537, line: 255, baseType: !1210, size: 64, align: 64, offset: 1088)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!955, !952, !946, !955, !946}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1174, file: !537, line: 260, baseType: !946, size: 32, align: 32, offset: 1152)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1174, file: !537, line: 266, baseType: !955, size: 64, align: 64, offset: 1216)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1174, file: !537, line: 273, baseType: !946, size: 32, align: 32, offset: 1280)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1174, file: !537, line: 279, baseType: !955, size: 64, align: 64, offset: 1344)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1174, file: !537, line: 285, baseType: !946, size: 32, align: 32, offset: 1408)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1174, file: !537, line: 291, baseType: !946, size: 32, align: 32, offset: 1440)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1174, file: !537, line: 298, baseType: !946, size: 32, align: 32, offset: 1472)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1174, file: !537, line: 304, baseType: !946, size: 32, align: 32, offset: 1504)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1174, file: !537, line: 309, baseType: !963, size: 64, align: 64, offset: 1536)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1174, file: !537, line: 314, baseType: !963, size: 64, align: 64, offset: 1600)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1174, file: !537, line: 319, baseType: !1224, size: 64, align: 64, offset: 1664)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!946, !952, !1119, !946, !536, !955}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1174, file: !537, line: 326, baseType: !946, size: 32, align: 32, offset: 1728)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1174, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1174, file: !537, line: 332, baseType: !955, size: 64, align: 64, offset: 1792)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1174, file: !537, line: 338, baseType: !1231, size: 64, align: 64, offset: 1856)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!946, !952}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1174, file: !537, line: 340, baseType: !955, size: 64, align: 64, offset: 1920)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1174, file: !537, line: 346, baseType: !1095, size: 64, align: 64, offset: 1984)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1174, file: !537, line: 351, baseType: !946, size: 32, align: 32, offset: 2048)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1068, file: !919, line: 1386, baseType: !946, size: 32, align: 32, offset: 320)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1068, file: !919, line: 1393, baseType: !949, size: 32, align: 32, offset: 352)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1068, file: !919, line: 1405, baseType: !1240, size: 64, align: 64, offset: 384)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1243)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1244)
!1244 = !{!1245, !1246, !1247, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !2000, !2006, !2007, !2011, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2043, !2044, !2045, !2046, !2047, !2048}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1243, file: !919, line: 866, baseType: !946, size: 32, align: 32)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1243, file: !919, line: 872, baseType: !946, size: 32, align: 32, offset: 32)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1243, file: !919, line: 878, baseType: !1248, size: 64, align: 64, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1250)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1251)
!1251 = !{!1252, !1253, !1254, !1255, !1481, !1482, !1483, !1484, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1637, !1641, !1642, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1821, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1250, file: !4, line: 1561, baseType: !983, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1250, file: !4, line: 1562, baseType: !946, size: 32, align: 32, offset: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1250, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1250, file: !4, line: 1565, baseType: !1256, size: 64, align: 64, offset: 128)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1258)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1259)
!1259 = !{!1260, !1261, !1262, !1263, !1264, !1265, !1268, !1271, !1274, !1277, !1281, !1282, !1283, !1291, !1292, !1293, !1295, !1299, !1305, !1314, !1318, !1319, !1365, !1452, !1456, !1457, !1461, !1465, !1470, !1474, !1475, !1476}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1258, file: !4, line: 3475, baseType: !963, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1258, file: !4, line: 3480, baseType: !963, size: 64, align: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1258, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1258, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1258, file: !4, line: 3487, baseType: !946, size: 32, align: 32, offset: 192)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1258, file: !4, line: 3488, baseType: !1266, size: 64, align: 64, offset: 256)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1258, file: !4, line: 3489, baseType: !1269, size: 64, align: 64, offset: 320)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1258, file: !4, line: 3490, baseType: !1272, size: 64, align: 64, offset: 384)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1258, file: !4, line: 3491, baseType: !1275, size: 64, align: 64, offset: 448)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1258, file: !4, line: 3492, baseType: !1278, size: 64, align: 64, offset: 512)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1280)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !948, line: 55, baseType: !1196)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1258, file: !4, line: 3493, baseType: !1120, size: 8, align: 8, offset: 576)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1258, file: !4, line: 3494, baseType: !983, size: 64, align: 64, offset: 640)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1258, file: !4, line: 3495, baseType: !1284, size: 64, align: 64, offset: 704)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1286)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1287)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1288)
!1288 = !{!1289, !1290}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1287, file: !4, line: 3402, baseType: !946, size: 32, align: 32)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1287, file: !4, line: 3403, baseType: !963, size: 64, align: 64, offset: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1258, file: !4, line: 3507, baseType: !963, size: 64, align: 64, offset: 768)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1258, file: !4, line: 3516, baseType: !946, size: 32, align: 32, offset: 832)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1258, file: !4, line: 3517, baseType: !1294, size: 64, align: 64, offset: 896)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1258, file: !4, line: 3527, baseType: !1296, size: 64, align: 64, offset: 960)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!946, !1248}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1258, file: !4, line: 3535, baseType: !1300, size: 64, align: 64, offset: 1024)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!946, !1248, !1303}
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1249)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1258, file: !4, line: 3541, baseType: !1306, size: 64, align: 64, offset: 1088)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1308)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1309)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1310, line: 223, size: 128, align: 64, elements: !1311)
!1310 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1311 = !{!1312, !1313}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1309, file: !1310, line: 224, baseType: !1202, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1309, file: !1310, line: 225, baseType: !1202, size: 64, align: 64, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1258, file: !4, line: 3549, baseType: !1315, size: 64, align: 64, offset: 1152)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{null, !1294}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1258, file: !4, line: 3551, baseType: !1296, size: 64, align: 64, offset: 1216)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1258, file: !4, line: 3552, baseType: !1320, size: 64, align: 64, offset: 1280)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!946, !1248, !1119, !946, !1323}
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1325)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1326)
!1326 = !{!1327, !1330, !1331, !1332, !1333, !1364}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1325, file: !4, line: 3921, baseType: !1328, size: 16, align: 16)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !948, line: 49, baseType: !1329)
!1329 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1325, file: !4, line: 3922, baseType: !947, size: 32, align: 32, offset: 32)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1325, file: !4, line: 3923, baseType: !947, size: 32, align: 32, offset: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1325, file: !4, line: 3924, baseType: !949, size: 32, align: 32, offset: 96)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1325, file: !4, line: 3925, baseType: !1334, size: 64, align: 64, offset: 128)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1337)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1338)
!1338 = !{!1339, !1340, !1341, !1342, !1343, !1344, !1354, !1358, !1360, !1361, !1362, !1363}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1337, file: !4, line: 3886, baseType: !946, size: 32, align: 32)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1337, file: !4, line: 3887, baseType: !946, size: 32, align: 32, offset: 32)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1337, file: !4, line: 3888, baseType: !946, size: 32, align: 32, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1337, file: !4, line: 3889, baseType: !946, size: 32, align: 32, offset: 96)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1337, file: !4, line: 3890, baseType: !946, size: 32, align: 32, offset: 128)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1337, file: !4, line: 3897, baseType: !1345, size: 768, align: 64, offset: 192)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1346)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1347)
!1347 = !{!1348, !1352}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1346, file: !4, line: 3855, baseType: !1349, size: 512, align: 64)
!1349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1119, size: 512, align: 64, elements: !1350)
!1350 = !{!1351}
!1351 = !DISubrange(count: 8)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1346, file: !4, line: 3857, baseType: !1353, size: 256, align: 32, offset: 512)
!1353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 256, align: 32, elements: !1350)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1337, file: !4, line: 3903, baseType: !1355, size: 256, align: 64, offset: 960)
!1355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1119, size: 256, align: 64, elements: !1356)
!1356 = !{!1357}
!1357 = !DISubrange(count: 4)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1337, file: !4, line: 3904, baseType: !1359, size: 128, align: 32, offset: 1216)
!1359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 128, align: 32, elements: !1356)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1337, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1337, file: !4, line: 3908, baseType: !950, size: 64, align: 64, offset: 1408)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1337, file: !4, line: 3915, baseType: !950, size: 64, align: 64, offset: 1472)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1337, file: !4, line: 3917, baseType: !946, size: 32, align: 32, offset: 1536)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1325, file: !4, line: 3926, baseType: !955, size: 64, align: 64, offset: 192)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1258, file: !4, line: 3564, baseType: !1366, size: 64, align: 64, offset: 1344)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{!946, !1248, !1104, !1369, !1451}
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1371)
!1371 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1372)
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1373)
!1373 = !{!1374, !1375, !1376, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1403, !1405, !1406, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1439, !1440, !1441, !1442, !1443, !1444, !1447, !1448, !1449, !1450}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1372, file: !789, line: 282, baseType: !1349, size: 512, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1372, file: !789, line: 299, baseType: !1353, size: 256, align: 32, offset: 512)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1372, file: !789, line: 315, baseType: !1377, size: 64, align: 64, offset: 768)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1372, file: !789, line: 326, baseType: !946, size: 32, align: 32, offset: 832)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1372, file: !789, line: 326, baseType: !946, size: 32, align: 32, offset: 864)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1372, file: !789, line: 334, baseType: !946, size: 32, align: 32, offset: 896)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1372, file: !789, line: 341, baseType: !946, size: 32, align: 32, offset: 928)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1372, file: !789, line: 346, baseType: !946, size: 32, align: 32, offset: 960)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1372, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1372, file: !789, line: 356, baseType: !1009, size: 64, align: 32, offset: 1024)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1372, file: !789, line: 361, baseType: !955, size: 64, align: 64, offset: 1088)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1372, file: !789, line: 369, baseType: !955, size: 64, align: 64, offset: 1152)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1372, file: !789, line: 377, baseType: !955, size: 64, align: 64, offset: 1216)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1372, file: !789, line: 382, baseType: !946, size: 32, align: 32, offset: 1280)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1372, file: !789, line: 386, baseType: !946, size: 32, align: 32, offset: 1312)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1372, file: !789, line: 391, baseType: !946, size: 32, align: 32, offset: 1344)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1372, file: !789, line: 396, baseType: !952, size: 64, align: 64, offset: 1408)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1372, file: !789, line: 403, baseType: !1393, size: 512, align: 64, offset: 1472)
!1393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1280, size: 512, align: 64, elements: !1350)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1372, file: !789, line: 410, baseType: !946, size: 32, align: 32, offset: 1984)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1372, file: !789, line: 415, baseType: !946, size: 32, align: 32, offset: 2016)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1372, file: !789, line: 420, baseType: !946, size: 32, align: 32, offset: 2048)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1372, file: !789, line: 425, baseType: !946, size: 32, align: 32, offset: 2080)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1372, file: !789, line: 435, baseType: !955, size: 64, align: 64, offset: 2112)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1372, file: !789, line: 440, baseType: !946, size: 32, align: 32, offset: 2176)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1372, file: !789, line: 445, baseType: !1280, size: 64, align: 64, offset: 2240)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1372, file: !789, line: 459, baseType: !1402, size: 512, align: 64, offset: 2304)
!1402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1109, size: 512, align: 64, elements: !1350)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1372, file: !789, line: 473, baseType: !1404, size: 64, align: 64, offset: 2816)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1372, file: !789, line: 477, baseType: !946, size: 32, align: 32, offset: 2880)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1372, file: !789, line: 479, baseType: !1407, size: 64, align: 64, offset: 2944)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1410)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1411)
!1411 = !{!1412, !1413, !1414, !1415, !1420}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1410, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1410, file: !789, line: 203, baseType: !1119, size: 64, align: 64, offset: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1410, file: !789, line: 204, baseType: !946, size: 32, align: 32, offset: 128)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1410, file: !789, line: 205, baseType: !1416, size: 64, align: 64, offset: 192)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1418, line: 86, baseType: !1419)
!1418 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1419 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1418, line: 86, flags: DIFlagFwdDecl)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1410, file: !789, line: 206, baseType: !1109, size: 64, align: 64, offset: 256)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1372, file: !789, line: 480, baseType: !946, size: 32, align: 32, offset: 3008)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1372, file: !789, line: 505, baseType: !946, size: 32, align: 32, offset: 3040)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1372, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1372, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1372, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1372, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1372, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1372, file: !789, line: 532, baseType: !955, size: 64, align: 64, offset: 3264)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1372, file: !789, line: 539, baseType: !955, size: 64, align: 64, offset: 3328)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1372, file: !789, line: 547, baseType: !955, size: 64, align: 64, offset: 3392)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1372, file: !789, line: 554, baseType: !1416, size: 64, align: 64, offset: 3456)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1372, file: !789, line: 563, baseType: !946, size: 32, align: 32, offset: 3520)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1372, file: !789, line: 572, baseType: !946, size: 32, align: 32, offset: 3552)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1372, file: !789, line: 581, baseType: !946, size: 32, align: 32, offset: 3584)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1372, file: !789, line: 588, baseType: !1436, size: 64, align: 64, offset: 3648)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !948, line: 36, baseType: !1438)
!1438 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1372, file: !789, line: 593, baseType: !946, size: 32, align: 32, offset: 3712)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1372, file: !789, line: 596, baseType: !946, size: 32, align: 32, offset: 3744)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1372, file: !789, line: 599, baseType: !1109, size: 64, align: 64, offset: 3776)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1372, file: !789, line: 605, baseType: !1109, size: 64, align: 64, offset: 3840)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1372, file: !789, line: 616, baseType: !1109, size: 64, align: 64, offset: 3904)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1372, file: !789, line: 626, baseType: !1445, size: 64, align: 64, offset: 3968)
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1446, line: 216, baseType: !1196)
!1446 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1372, file: !789, line: 627, baseType: !1445, size: 64, align: 64, offset: 4032)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1372, file: !789, line: 628, baseType: !1445, size: 64, align: 64, offset: 4096)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1372, file: !789, line: 629, baseType: !1445, size: 64, align: 64, offset: 4160)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1372, file: !789, line: 645, baseType: !1109, size: 64, align: 64, offset: 4224)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1258, file: !4, line: 3566, baseType: !1453, size: 64, align: 64, offset: 1408)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{!946, !1248, !952, !1451, !1104}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1258, file: !4, line: 3567, baseType: !1296, size: 64, align: 64, offset: 1472)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1258, file: !4, line: 3576, baseType: !1458, size: 64, align: 64, offset: 1536)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{!946, !1248, !1369}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1258, file: !4, line: 3577, baseType: !1462, size: 64, align: 64, offset: 1600)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{!946, !1248, !1104}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1258, file: !4, line: 3584, baseType: !1466, size: 64, align: 64, offset: 1664)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{!946, !1248, !1469}
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1258, file: !4, line: 3589, baseType: !1471, size: 64, align: 64, offset: 1728)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{null, !1248}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1258, file: !4, line: 3594, baseType: !946, size: 32, align: 32, offset: 1792)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1258, file: !4, line: 3600, baseType: !963, size: 64, align: 64, offset: 1856)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1258, file: !4, line: 3609, baseType: !1477, size: 64, align: 64, offset: 1920)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1480)
!1480 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1250, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1250, file: !4, line: 1581, baseType: !949, size: 32, align: 32, offset: 224)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1250, file: !4, line: 1583, baseType: !952, size: 64, align: 64, offset: 256)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1250, file: !4, line: 1591, baseType: !1485, size: 64, align: 64, offset: 320)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1310, line: 129, size: 1664, align: 64, elements: !1487)
!1487 = !{!1488, !1489, !1490, !1491, !1492, !1510, !1511, !1517, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1486, file: !1310, line: 136, baseType: !946, size: 32, align: 32)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1486, file: !1310, line: 151, baseType: !946, size: 32, align: 32, offset: 32)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1486, file: !1310, line: 157, baseType: !946, size: 32, align: 32, offset: 64)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1486, file: !1310, line: 159, baseType: !1469, size: 64, align: 64, offset: 128)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1486, file: !1310, line: 161, baseType: !1493, size: 64, align: 64, offset: 192)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1310, line: 117, baseType: !1495)
!1495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1310, line: 100, size: 832, align: 64, elements: !1496)
!1496 = !{!1497, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509}
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1495, file: !1310, line: 105, baseType: !1498, size: 256, align: 64)
!1498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1499, size: 256, align: 64, elements: !1356)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1111, line: 238, baseType: !1501)
!1501 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1111, line: 238, flags: DIFlagFwdDecl)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1495, file: !1310, line: 110, baseType: !946, size: 32, align: 32, offset: 256)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1495, file: !1310, line: 111, baseType: !946, size: 32, align: 32, offset: 288)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1495, file: !1310, line: 111, baseType: !946, size: 32, align: 32, offset: 320)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1495, file: !1310, line: 112, baseType: !1353, size: 256, align: 32, offset: 352)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1495, file: !1310, line: 113, baseType: !1359, size: 128, align: 32, offset: 608)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1495, file: !1310, line: 114, baseType: !946, size: 32, align: 32, offset: 736)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1495, file: !1310, line: 115, baseType: !946, size: 32, align: 32, offset: 768)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1495, file: !1310, line: 116, baseType: !946, size: 32, align: 32, offset: 800)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1486, file: !1310, line: 163, baseType: !952, size: 64, align: 64, offset: 256)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1486, file: !1310, line: 165, baseType: !1512, size: 128, align: 64, offset: 320)
!1512 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1310, line: 122, baseType: !1513)
!1513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1310, line: 119, size: 128, align: 64, elements: !1514)
!1514 = !{!1515, !1516}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1513, file: !1310, line: 120, baseType: !1104, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1513, file: !1310, line: 121, baseType: !1469, size: 64, align: 64, offset: 64)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1486, file: !1310, line: 166, baseType: !1518, size: 128, align: 64, offset: 448)
!1518 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1310, line: 127, baseType: !1519)
!1519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1310, line: 124, size: 128, align: 64, elements: !1520)
!1520 = !{!1521, !1594}
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1519, file: !1310, line: 125, baseType: !1522, size: 64, align: 64)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1525)
!1525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1526)
!1526 = !{!1527, !1528, !1552, !1556, !1557, !1591, !1592, !1593}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1525, file: !4, line: 5751, baseType: !983, size: 64, align: 64)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1525, file: !4, line: 5756, baseType: !1529, size: 64, align: 64, offset: 64)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1531)
!1531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1532)
!1532 = !{!1533, !1534, !1537, !1538, !1539, !1543, !1547, !1551}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1531, file: !4, line: 5797, baseType: !963, size: 64, align: 64)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1531, file: !4, line: 5804, baseType: !1535, size: 64, align: 64, offset: 64)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1531, file: !4, line: 5815, baseType: !983, size: 64, align: 64, offset: 128)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1531, file: !4, line: 5825, baseType: !946, size: 32, align: 32, offset: 192)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1531, file: !4, line: 5826, baseType: !1540, size: 64, align: 64, offset: 256)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DISubroutineType(types: !1542)
!1542 = !{!946, !1523}
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1531, file: !4, line: 5827, baseType: !1544, size: 64, align: 64, offset: 320)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DISubroutineType(types: !1546)
!1546 = !{!946, !1523, !1104}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1531, file: !4, line: 5828, baseType: !1548, size: 64, align: 64, offset: 384)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DISubroutineType(types: !1550)
!1550 = !{null, !1523}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1531, file: !4, line: 5829, baseType: !1548, size: 64, align: 64, offset: 448)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1525, file: !4, line: 5762, baseType: !1553, size: 64, align: 64, offset: 128)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1555)
!1555 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1525, file: !4, line: 5768, baseType: !952, size: 64, align: 64, offset: 192)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1525, file: !4, line: 5775, baseType: !1558, size: 64, align: 64, offset: 256)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1560)
!1560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1561)
!1561 = !{!1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1560, file: !4, line: 3940, baseType: !545, size: 32, align: 32)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1560, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1560, file: !4, line: 3948, baseType: !947, size: 32, align: 32, offset: 64)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1560, file: !4, line: 3958, baseType: !1119, size: 64, align: 64, offset: 128)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1560, file: !4, line: 3962, baseType: !946, size: 32, align: 32, offset: 192)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1560, file: !4, line: 3968, baseType: !946, size: 32, align: 32, offset: 224)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1560, file: !4, line: 3973, baseType: !955, size: 64, align: 64, offset: 256)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1560, file: !4, line: 3986, baseType: !946, size: 32, align: 32, offset: 320)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1560, file: !4, line: 3999, baseType: !946, size: 32, align: 32, offset: 352)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1560, file: !4, line: 4004, baseType: !946, size: 32, align: 32, offset: 384)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1560, file: !4, line: 4005, baseType: !946, size: 32, align: 32, offset: 416)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1560, file: !4, line: 4010, baseType: !946, size: 32, align: 32, offset: 448)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1560, file: !4, line: 4011, baseType: !946, size: 32, align: 32, offset: 480)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1560, file: !4, line: 4020, baseType: !1009, size: 64, align: 32, offset: 512)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1560, file: !4, line: 4025, baseType: !889, size: 32, align: 32, offset: 576)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1560, file: !4, line: 4030, baseType: !812, size: 32, align: 32, offset: 608)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1560, file: !4, line: 4031, baseType: !818, size: 32, align: 32, offset: 640)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1560, file: !4, line: 4032, baseType: !836, size: 32, align: 32, offset: 672)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1560, file: !4, line: 4033, baseType: !860, size: 32, align: 32, offset: 704)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1560, file: !4, line: 4034, baseType: !879, size: 32, align: 32, offset: 736)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1560, file: !4, line: 4039, baseType: !946, size: 32, align: 32, offset: 768)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1560, file: !4, line: 4046, baseType: !1280, size: 64, align: 64, offset: 832)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1560, file: !4, line: 4050, baseType: !946, size: 32, align: 32, offset: 896)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1560, file: !4, line: 4054, baseType: !946, size: 32, align: 32, offset: 928)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1560, file: !4, line: 4061, baseType: !946, size: 32, align: 32, offset: 960)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1560, file: !4, line: 4065, baseType: !946, size: 32, align: 32, offset: 992)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1560, file: !4, line: 4073, baseType: !946, size: 32, align: 32, offset: 1024)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1560, file: !4, line: 4080, baseType: !946, size: 32, align: 32, offset: 1056)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1560, file: !4, line: 4084, baseType: !946, size: 32, align: 32, offset: 1088)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1525, file: !4, line: 5781, baseType: !1558, size: 64, align: 64, offset: 320)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1525, file: !4, line: 5787, baseType: !1009, size: 64, align: 32, offset: 384)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1525, file: !4, line: 5793, baseType: !1009, size: 64, align: 32, offset: 448)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1519, file: !1310, line: 126, baseType: !946, size: 32, align: 32, offset: 64)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1486, file: !1310, line: 172, baseType: !1104, size: 64, align: 64, offset: 576)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1486, file: !1310, line: 177, baseType: !1119, size: 64, align: 64, offset: 640)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1486, file: !1310, line: 178, baseType: !949, size: 32, align: 32, offset: 704)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1486, file: !1310, line: 180, baseType: !952, size: 64, align: 64, offset: 768)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1486, file: !1310, line: 185, baseType: !946, size: 32, align: 32, offset: 832)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1486, file: !1310, line: 190, baseType: !952, size: 64, align: 64, offset: 896)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1486, file: !1310, line: 195, baseType: !946, size: 32, align: 32, offset: 960)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1486, file: !1310, line: 200, baseType: !1104, size: 64, align: 64, offset: 1024)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1486, file: !1310, line: 201, baseType: !946, size: 32, align: 32, offset: 1088)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1486, file: !1310, line: 202, baseType: !1469, size: 64, align: 64, offset: 1152)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1486, file: !1310, line: 203, baseType: !946, size: 32, align: 32, offset: 1216)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1486, file: !1310, line: 205, baseType: !946, size: 32, align: 32, offset: 1248)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1486, file: !1310, line: 206, baseType: !946, size: 32, align: 32, offset: 1280)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1486, file: !1310, line: 209, baseType: !1445, size: 64, align: 64, offset: 1344)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1486, file: !1310, line: 212, baseType: !1445, size: 64, align: 64, offset: 1408)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1486, file: !1310, line: 213, baseType: !1469, size: 64, align: 64, offset: 1472)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1486, file: !1310, line: 215, baseType: !946, size: 32, align: 32, offset: 1536)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1486, file: !1310, line: 217, baseType: !946, size: 32, align: 32, offset: 1568)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1486, file: !1310, line: 220, baseType: !946, size: 32, align: 32, offset: 1600)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1250, file: !4, line: 1598, baseType: !952, size: 64, align: 64, offset: 384)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1250, file: !4, line: 1606, baseType: !955, size: 64, align: 64, offset: 448)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1250, file: !4, line: 1614, baseType: !946, size: 32, align: 32, offset: 512)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1250, file: !4, line: 1622, baseType: !946, size: 32, align: 32, offset: 544)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1250, file: !4, line: 1628, baseType: !946, size: 32, align: 32, offset: 576)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1250, file: !4, line: 1636, baseType: !946, size: 32, align: 32, offset: 608)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1250, file: !4, line: 1643, baseType: !946, size: 32, align: 32, offset: 640)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1250, file: !4, line: 1657, baseType: !1119, size: 64, align: 64, offset: 704)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1250, file: !4, line: 1658, baseType: !946, size: 32, align: 32, offset: 768)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1250, file: !4, line: 1679, baseType: !1009, size: 64, align: 32, offset: 800)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1250, file: !4, line: 1688, baseType: !946, size: 32, align: 32, offset: 864)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1250, file: !4, line: 1712, baseType: !946, size: 32, align: 32, offset: 896)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1250, file: !4, line: 1729, baseType: !946, size: 32, align: 32, offset: 928)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1250, file: !4, line: 1729, baseType: !946, size: 32, align: 32, offset: 960)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1250, file: !4, line: 1744, baseType: !946, size: 32, align: 32, offset: 992)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1250, file: !4, line: 1744, baseType: !946, size: 32, align: 32, offset: 1024)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1250, file: !4, line: 1751, baseType: !946, size: 32, align: 32, offset: 1056)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1250, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1250, file: !4, line: 1791, baseType: !1633, size: 64, align: 64, offset: 1152)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DISubroutineType(types: !1635)
!1635 = !{null, !1636, !1369, !1451, !946, !946, !946}
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1250, file: !4, line: 1808, baseType: !1638, size: 64, align: 64, offset: 1216)
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DISubroutineType(types: !1640)
!1640 = !{!555, !1636, !1269}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1250, file: !4, line: 1816, baseType: !946, size: 32, align: 32, offset: 1280)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1250, file: !4, line: 1825, baseType: !1643, size: 32, align: 32, offset: 1312)
!1643 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1250, file: !4, line: 1830, baseType: !946, size: 32, align: 32, offset: 1344)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1250, file: !4, line: 1838, baseType: !1643, size: 32, align: 32, offset: 1376)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1250, file: !4, line: 1846, baseType: !946, size: 32, align: 32, offset: 1408)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1250, file: !4, line: 1851, baseType: !946, size: 32, align: 32, offset: 1440)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1250, file: !4, line: 1861, baseType: !1643, size: 32, align: 32, offset: 1472)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1250, file: !4, line: 1868, baseType: !1643, size: 32, align: 32, offset: 1504)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1250, file: !4, line: 1875, baseType: !1643, size: 32, align: 32, offset: 1536)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1250, file: !4, line: 1882, baseType: !1643, size: 32, align: 32, offset: 1568)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1250, file: !4, line: 1889, baseType: !1643, size: 32, align: 32, offset: 1600)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1250, file: !4, line: 1896, baseType: !1643, size: 32, align: 32, offset: 1632)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1250, file: !4, line: 1903, baseType: !1643, size: 32, align: 32, offset: 1664)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1250, file: !4, line: 1910, baseType: !946, size: 32, align: 32, offset: 1696)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1250, file: !4, line: 1915, baseType: !946, size: 32, align: 32, offset: 1728)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1250, file: !4, line: 1926, baseType: !1451, size: 64, align: 64, offset: 1792)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1250, file: !4, line: 1935, baseType: !1009, size: 64, align: 32, offset: 1856)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1250, file: !4, line: 1942, baseType: !946, size: 32, align: 32, offset: 1920)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1250, file: !4, line: 1948, baseType: !946, size: 32, align: 32, offset: 1952)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1250, file: !4, line: 1954, baseType: !946, size: 32, align: 32, offset: 1984)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1250, file: !4, line: 1960, baseType: !946, size: 32, align: 32, offset: 2016)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1250, file: !4, line: 1984, baseType: !946, size: 32, align: 32, offset: 2048)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1250, file: !4, line: 1991, baseType: !946, size: 32, align: 32, offset: 2080)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1250, file: !4, line: 1996, baseType: !946, size: 32, align: 32, offset: 2112)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1250, file: !4, line: 2004, baseType: !946, size: 32, align: 32, offset: 2144)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1250, file: !4, line: 2011, baseType: !946, size: 32, align: 32, offset: 2176)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1250, file: !4, line: 2018, baseType: !946, size: 32, align: 32, offset: 2208)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1250, file: !4, line: 2027, baseType: !946, size: 32, align: 32, offset: 2240)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1250, file: !4, line: 2034, baseType: !946, size: 32, align: 32, offset: 2272)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1250, file: !4, line: 2044, baseType: !946, size: 32, align: 32, offset: 2304)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1250, file: !4, line: 2054, baseType: !1673, size: 64, align: 64, offset: 2368)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1250, file: !4, line: 2061, baseType: !1673, size: 64, align: 64, offset: 2432)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1250, file: !4, line: 2066, baseType: !946, size: 32, align: 32, offset: 2496)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1250, file: !4, line: 2070, baseType: !946, size: 32, align: 32, offset: 2528)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1250, file: !4, line: 2078, baseType: !946, size: 32, align: 32, offset: 2560)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1250, file: !4, line: 2085, baseType: !946, size: 32, align: 32, offset: 2592)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1250, file: !4, line: 2092, baseType: !946, size: 32, align: 32, offset: 2624)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1250, file: !4, line: 2099, baseType: !946, size: 32, align: 32, offset: 2656)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1250, file: !4, line: 2106, baseType: !946, size: 32, align: 32, offset: 2688)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1250, file: !4, line: 2113, baseType: !946, size: 32, align: 32, offset: 2720)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1250, file: !4, line: 2120, baseType: !946, size: 32, align: 32, offset: 2752)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1250, file: !4, line: 2125, baseType: !946, size: 32, align: 32, offset: 2784)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1250, file: !4, line: 2133, baseType: !946, size: 32, align: 32, offset: 2816)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1250, file: !4, line: 2140, baseType: !946, size: 32, align: 32, offset: 2848)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1250, file: !4, line: 2145, baseType: !946, size: 32, align: 32, offset: 2880)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1250, file: !4, line: 2153, baseType: !946, size: 32, align: 32, offset: 2912)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1250, file: !4, line: 2158, baseType: !946, size: 32, align: 32, offset: 2944)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1250, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1250, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1250, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1250, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1250, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1250, file: !4, line: 2203, baseType: !946, size: 32, align: 32, offset: 3136)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1250, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1250, file: !4, line: 2212, baseType: !946, size: 32, align: 32, offset: 3200)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1250, file: !4, line: 2213, baseType: !946, size: 32, align: 32, offset: 3232)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1250, file: !4, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1250, file: !4, line: 2232, baseType: !946, size: 32, align: 32, offset: 3296)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1250, file: !4, line: 2243, baseType: !946, size: 32, align: 32, offset: 3328)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1250, file: !4, line: 2249, baseType: !946, size: 32, align: 32, offset: 3360)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1250, file: !4, line: 2256, baseType: !946, size: 32, align: 32, offset: 3392)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1250, file: !4, line: 2263, baseType: !1280, size: 64, align: 64, offset: 3456)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1250, file: !4, line: 2270, baseType: !1280, size: 64, align: 64, offset: 3520)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1250, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1250, file: !4, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1250, file: !4, line: 2367, baseType: !1709, size: 64, align: 64, offset: 3648)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DISubroutineType(types: !1711)
!1711 = !{!946, !1636, !1469, !946}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1250, file: !4, line: 2383, baseType: !946, size: 32, align: 32, offset: 3712)
