; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--http.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--http.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !59, globals: !402)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--http.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!2 = !{!3, !25, !46, !53}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !4, line: 221, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!6 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!7 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!8 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!9 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!10 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!11 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!12 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!13 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!14 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!15 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!16 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!17 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!18 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!19 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!20 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!21 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!22 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!23 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!24 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 29, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!28 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!29 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!30 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!31 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!32 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!33 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!34 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!35 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!36 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!37 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!38 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!39 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!40 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!41 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!42 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!43 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!44 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!45 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 54, size: 32, align: 32, elements: !48)
!47 = !DIFile(filename: "libavformat/http.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!48 = !{!49, !50, !51, !52}
!49 = !DIEnumerator(name: "LOWER_PROTO", value: 0)
!50 = !DIEnumerator(name: "READ_HEADERS", value: 1)
!51 = !DIEnumerator(name: "WRITE_REPLY_HEADERS", value: 2)
!52 = !DIEnumerator(name: "FINISH", value: 3)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HTTPAuthType", file: !54, line: 28, size: 32, align: 32, elements: !55)
!54 = !DIFile(filename: "libavformat/httpauth.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!55 = !{!56, !57, !58}
!56 = !DIEnumerator(name: "HTTP_AUTH_NONE", value: 0)
!57 = !DIEnumerator(name: "HTTP_AUTH_BASIC", value: 1)
!58 = !DIEnumerator(name: "HTTP_AUTH_DIGEST", value: 2)
!59 = !{!60, !87, !361, !78}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "HTTPContext", file: !47, line: 128, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HTTPContext", file: !47, line: 61, size: 50304, align: 64, elements: !63)
!63 = !{!64, !151, !272, !276, !277, !278, !279, !280, !284, !285, !286, !287, !288, !289, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !401}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !62, file: !47, line: 62, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !69)
!69 = !{!70, !74, !79, !110, !111, !112, !113, !117, !123, !125, !129}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !68, file: !26, line: 72, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!73 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !68, file: !26, line: 78, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!71, !78}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !68, file: !26, line: 85, baseType: !80, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !83)
!83 = !{!84, !85, !86, !88, !89, !106, !107, !108, !109}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !82, file: !4, line: 247, baseType: !71, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !82, file: !4, line: 253, baseType: !71, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !82, file: !4, line: 259, baseType: !87, size: 32, align: 32, offset: 128)
!87 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !82, file: !4, line: 271, baseType: !90, size: 64, align: 64, offset: 192)
!90 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !82, file: !4, line: 265, size: 64, align: 64, elements: !91)
!91 = !{!92, !96, !98, !99}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !90, file: !4, line: 266, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !94, line: 197, baseType: !95)
!94 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!95 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !90, file: !4, line: 267, baseType: !97, size: 64, align: 64)
!97 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !90, file: !4, line: 268, baseType: !71, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !90, file: !4, line: 270, baseType: !100, size: 64, align: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !101, line: 61, baseType: !102)
!101 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !101, line: 58, size: 64, align: 32, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !102, file: !101, line: 59, baseType: !87, size: 32, align: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !102, file: !101, line: 60, baseType: !87, size: 32, align: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !82, file: !4, line: 272, baseType: !97, size: 64, align: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !82, file: !4, line: 273, baseType: !97, size: 64, align: 64, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !82, file: !4, line: 275, baseType: !87, size: 32, align: 32, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !82, file: !4, line: 300, baseType: !71, size: 64, align: 64, offset: 448)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !68, file: !26, line: 93, baseType: !87, size: 32, align: 32, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !68, file: !26, line: 99, baseType: !87, size: 32, align: 32, offset: 224)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !68, file: !26, line: 108, baseType: !87, size: 32, align: 32, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !68, file: !26, line: 113, baseType: !114, size: 64, align: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!78, !78, !78}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !68, file: !26, line: 123, baseType: !118, size: 64, align: 64, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!121, !121}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !68, file: !26, line: 130, baseType: !124, size: 32, align: 32, offset: 448)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !68, file: !26, line: 136, baseType: !126, size: 64, align: 64, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!124, !78}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !68, file: !26, line: 142, baseType: !130, size: 64, align: 64, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!87, !133, !78, !71, !87}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !136)
!136 = !{!137, !149, !150}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !135, file: !4, line: 360, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !142)
!142 = !{!143, !144, !145, !146, !147, !148}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !141, file: !4, line: 307, baseType: !71, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !141, file: !4, line: 313, baseType: !97, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !141, file: !4, line: 313, baseType: !97, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !141, file: !4, line: 318, baseType: !97, size: 64, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !141, file: !4, line: 318, baseType: !97, size: 64, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !141, file: !4, line: 323, baseType: !87, size: 32, align: 32, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !135, file: !4, line: 364, baseType: !87, size: 32, align: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !135, file: !4, line: 368, baseType: !87, size: 32, align: 32, offset: 96)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "hd", scope: !62, file: !47, line: 63, baseType: !152, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !154, line: 52, baseType: !155)
!154 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !154, line: 38, size: 768, align: 64, elements: !156)
!156 = !{!157, !158, !253, !254, !255, !256, !257, !258, !259, !268, !269, !270, !271}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !155, file: !154, line: 39, baseType: !65, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !155, file: !154, line: 40, baseType: !159, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !154, line: 54, size: 1600, align: 64, elements: !162)
!162 = !{!163, !164, !168, !177, !182, !186, !192, !198, !202, !203, !207, !211, !212, !218, !219, !220, !221, !222, !223, !224, !225, !246, !247, !248, !252}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !161, file: !154, line: 55, baseType: !71, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !161, file: !154, line: 56, baseType: !165, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!87, !152, !71, !87}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !161, file: !154, line: 62, baseType: !169, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!87, !152, !71, !87, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !175, line: 86, baseType: !176)
!175 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !175, line: 86, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !161, file: !154, line: 63, baseType: !178, size: 64, align: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!87, !152, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !161, file: !154, line: 64, baseType: !183, size: 64, align: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!87, !152}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !161, file: !154, line: 78, baseType: !187, size: 64, align: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!87, !152, !190, !87}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !161, file: !154, line: 79, baseType: !193, size: 64, align: 64, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!87, !152, !196, !87}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !161, file: !154, line: 80, baseType: !199, size: 64, align: 64, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!93, !152, !93, !87}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !161, file: !154, line: 81, baseType: !183, size: 64, align: 64, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !161, file: !154, line: 82, baseType: !204, size: 64, align: 64, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!87, !152, !87}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !161, file: !154, line: 83, baseType: !208, size: 64, align: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!93, !152, !87, !93, !87}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !161, file: !154, line: 85, baseType: !183, size: 64, align: 64, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !161, file: !154, line: 86, baseType: !213, size: 64, align: 64, offset: 768)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!87, !152, !216, !217}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !161, file: !154, line: 88, baseType: !183, size: 64, align: 64, offset: 832)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !161, file: !154, line: 89, baseType: !204, size: 64, align: 64, offset: 896)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !161, file: !154, line: 90, baseType: !87, size: 32, align: 32, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !161, file: !154, line: 91, baseType: !65, size: 64, align: 64, offset: 1024)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !161, file: !154, line: 92, baseType: !87, size: 32, align: 32, offset: 1088)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !161, file: !154, line: 93, baseType: !204, size: 64, align: 64, offset: 1152)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !161, file: !154, line: 94, baseType: !183, size: 64, align: 64, offset: 1216)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !161, file: !154, line: 95, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!87, !152, !229}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !232, line: 101, baseType: !233)
!232 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !232, line: 86, size: 576, align: 64, elements: !234)
!234 = !{!235, !237, !238, !239, !240, !241, !242, !243, !244, !245}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !232, line: 87, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !233, file: !232, line: 88, baseType: !87, size: 32, align: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !233, file: !232, line: 89, baseType: !87, size: 32, align: 32, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !233, file: !232, line: 91, baseType: !93, size: 64, align: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !233, file: !232, line: 92, baseType: !93, size: 64, align: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !233, file: !232, line: 94, baseType: !93, size: 64, align: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !233, file: !232, line: 96, baseType: !93, size: 64, align: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !233, file: !232, line: 98, baseType: !93, size: 64, align: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !233, file: !232, line: 99, baseType: !93, size: 64, align: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !233, file: !232, line: 100, baseType: !93, size: 64, align: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !161, file: !154, line: 96, baseType: !183, size: 64, align: 64, offset: 1344)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !161, file: !154, line: 97, baseType: !183, size: 64, align: 64, offset: 1408)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !161, file: !154, line: 98, baseType: !249, size: 64, align: 64, offset: 1472)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!87, !152, !152}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !161, file: !154, line: 99, baseType: !71, size: 64, align: 64, offset: 1536)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !155, file: !154, line: 41, baseType: !78, size: 64, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !155, file: !154, line: 42, baseType: !236, size: 64, align: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !155, file: !154, line: 43, baseType: !87, size: 32, align: 32, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !155, file: !154, line: 44, baseType: !87, size: 32, align: 32, offset: 288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !155, file: !154, line: 45, baseType: !87, size: 32, align: 32, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !155, file: !154, line: 46, baseType: !87, size: 32, align: 32, offset: 352)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !155, file: !154, line: 47, baseType: !260, size: 128, align: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !232, line: 61, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !232, line: 58, size: 128, align: 64, elements: !262)
!262 = !{!263, !267}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !261, file: !232, line: 59, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!87, !78}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !261, file: !232, line: 60, baseType: !78, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !155, file: !154, line: 48, baseType: !93, size: 64, align: 64, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !155, file: !154, line: 49, baseType: !71, size: 64, align: 64, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !155, file: !154, line: 50, baseType: !71, size: 64, align: 64, offset: 640)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !155, file: !154, line: 51, baseType: !87, size: 32, align: 32, offset: 704)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !62, file: !47, line: 64, baseType: !273, size: 32768, align: 8, offset: 128)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 32768, align: 8, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 4096)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !62, file: !47, line: 64, baseType: !190, size: 64, align: 64, offset: 32896)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !62, file: !47, line: 64, baseType: !190, size: 64, align: 64, offset: 32960)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "line_count", scope: !62, file: !47, line: 65, baseType: !87, size: 32, align: 32, offset: 33024)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "http_code", scope: !62, file: !47, line: 66, baseType: !87, size: 32, align: 32, offset: 33056)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !62, file: !47, line: 68, baseType: !281, size: 64, align: 64, offset: 33088)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !282, line: 55, baseType: !283)
!282 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!283 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "chunkend", scope: !62, file: !47, line: 69, baseType: !87, size: 32, align: 32, offset: 33152)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !62, file: !47, line: 70, baseType: !281, size: 64, align: 64, offset: 33216)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "end_off", scope: !62, file: !47, line: 70, baseType: !281, size: 64, align: 64, offset: 33280)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "filesize", scope: !62, file: !47, line: 70, baseType: !281, size: 64, align: 64, offset: 33344)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !62, file: !47, line: 71, baseType: !236, size: 64, align: 64, offset: 33408)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "auth_state", scope: !62, file: !47, line: 72, baseType: !290, size: 6912, align: 32, offset: 33472)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "HTTPAuthState", file: !54, line: 72, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HTTPAuthState", file: !54, line: 55, size: 6912, align: 32, elements: !292)
!292 = !{!293, !294, !298, !317}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "auth_type", scope: !291, file: !54, line: 59, baseType: !87, size: 32, align: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !291, file: !54, line: 63, baseType: !295, size: 1600, align: 8, offset: 32)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 1600, align: 8, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 200)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "digest_params", scope: !291, file: !54, line: 67, baseType: !299, size: 5248, align: 32, offset: 1632)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "DigestParams", file: !54, line: 49, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DigestParams", file: !54, line: 35, size: 5248, align: 32, elements: !301)
!301 = !{!302, !306, !310, !314, !315, !316}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !300, file: !54, line: 36, baseType: !303, size: 2400, align: 8)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 2400, align: 8, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 300)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !300, file: !54, line: 37, baseType: !307, size: 80, align: 8, offset: 2400)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 80, align: 8, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 10)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "qop", scope: !300, file: !54, line: 38, baseType: !311, size: 240, align: 8, offset: 2480)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 240, align: 8, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 30)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !300, file: !54, line: 41, baseType: !303, size: 2400, align: 8, offset: 2720)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "stale", scope: !300, file: !54, line: 44, baseType: !307, size: 80, align: 8, offset: 5120)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !300, file: !54, line: 47, baseType: !87, size: 32, align: 32, offset: 5216)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "stale", scope: !291, file: !54, line: 71, baseType: !87, size: 32, align: 32, offset: 6880)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_auth_state", scope: !62, file: !47, line: 73, baseType: !290, size: 6912, align: 32, offset: 40384)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "http_proxy", scope: !62, file: !47, line: 74, baseType: !236, size: 64, align: 64, offset: 47296)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !62, file: !47, line: 75, baseType: !236, size: 64, align: 64, offset: 47360)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !62, file: !47, line: 76, baseType: !236, size: 64, align: 64, offset: 47424)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "http_version", scope: !62, file: !47, line: 77, baseType: !236, size: 64, align: 64, offset: 47488)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !62, file: !47, line: 78, baseType: !236, size: 64, align: 64, offset: 47552)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !62, file: !47, line: 79, baseType: !236, size: 64, align: 64, offset: 47616)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_deprecated", scope: !62, file: !47, line: 81, baseType: !236, size: 64, align: 64, offset: 47680)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !62, file: !47, line: 83, baseType: !236, size: 64, align: 64, offset: 47744)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "willclose", scope: !62, file: !47, line: 86, baseType: !87, size: 32, align: 32, offset: 47808)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !62, file: !47, line: 87, baseType: !87, size: 32, align: 32, offset: 47840)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "chunked_post", scope: !62, file: !47, line: 88, baseType: !87, size: 32, align: 32, offset: 47872)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "end_chunked_post", scope: !62, file: !47, line: 90, baseType: !87, size: 32, align: 32, offset: 47904)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "end_header", scope: !62, file: !47, line: 92, baseType: !87, size: 32, align: 32, offset: 47936)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "multiple_requests", scope: !62, file: !47, line: 94, baseType: !87, size: 32, align: 32, offset: 47968)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "post_data", scope: !62, file: !47, line: 95, baseType: !334, size: 64, align: 64, offset: 48000)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !282, line: 48, baseType: !191)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "post_datalen", scope: !62, file: !47, line: 96, baseType: !87, size: 32, align: 32, offset: 48064)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "is_akamai", scope: !62, file: !47, line: 97, baseType: !87, size: 32, align: 32, offset: 48096)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "is_mediagateway", scope: !62, file: !47, line: 98, baseType: !87, size: 32, align: 32, offset: 48128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "cookies", scope: !62, file: !47, line: 99, baseType: !236, size: 64, align: 64, offset: 48192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_dict", scope: !62, file: !47, line: 101, baseType: !173, size: 64, align: 64, offset: 48256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "icy", scope: !62, file: !47, line: 102, baseType: !87, size: 32, align: 32, offset: 48320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "icy_data_read", scope: !62, file: !47, line: 104, baseType: !281, size: 64, align: 64, offset: 48384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "icy_metaint", scope: !62, file: !47, line: 106, baseType: !281, size: 64, align: 64, offset: 48448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "icy_metadata_headers", scope: !62, file: !47, line: 107, baseType: !236, size: 64, align: 64, offset: 48512)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "icy_metadata_packet", scope: !62, file: !47, line: 108, baseType: !236, size: 64, align: 64, offset: 48576)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !62, file: !47, line: 109, baseType: !173, size: 64, align: 64, offset: 48640)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !62, file: !47, line: 111, baseType: !87, size: 32, align: 32, offset: 48704)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "inflate_stream", scope: !62, file: !47, line: 112, baseType: !349, size: 896, align: 64, offset: 48768)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !350, line: 106, baseType: !351)
!350 = !DIFile(filename: "/usr/local/include/zlib.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !350, line: 86, size: 896, align: 64, elements: !352)
!352 = !{!353, !359, !362, !364, !366, !367, !368, !369, !372, !378, !383, !384, !385, !386}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !351, file: !350, line: 87, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !357, line: 400, baseType: !358)
!357 = !DIFile(filename: "/usr/local/include/zconf.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !357, line: 391, baseType: !191)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !351, file: !350, line: 88, baseType: !360, size: 32, align: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !357, line: 393, baseType: !361)
!361 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !351, file: !350, line: 89, baseType: !363, size: 64, align: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !357, line: 394, baseType: !283)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !351, file: !350, line: 91, baseType: !365, size: 64, align: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !351, file: !350, line: 92, baseType: !360, size: 32, align: 32, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !351, file: !350, line: 93, baseType: !363, size: 64, align: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !351, file: !350, line: 95, baseType: !71, size: 64, align: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !351, file: !350, line: 96, baseType: !370, size: 64, align: 64, offset: 448)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !350, line: 84, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !351, file: !350, line: 98, baseType: !373, size: 64, align: 64, offset: 512)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !350, line: 81, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!377, !377, !360, !360}
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !357, line: 409, baseType: !78)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !351, file: !350, line: 99, baseType: !379, size: 64, align: 64, offset: 576)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !350, line: 82, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !377, !377}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !351, file: !350, line: 100, baseType: !377, size: 64, align: 64, offset: 640)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !351, file: !350, line: 102, baseType: !87, size: 32, align: 32, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !351, file: !350, line: 104, baseType: !363, size: 64, align: 64, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !351, file: !350, line: 105, baseType: !363, size: 64, align: 64, offset: 832)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "inflate_buffer", scope: !62, file: !47, line: 113, baseType: !334, size: 64, align: 64, offset: 49664)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "chained_options", scope: !62, file: !47, line: 115, baseType: !173, size: 64, align: 64, offset: 49728)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "send_expect_100", scope: !62, file: !47, line: 116, baseType: !87, size: 32, align: 32, offset: 49792)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !62, file: !47, line: 117, baseType: !236, size: 64, align: 64, offset: 49856)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect", scope: !62, file: !47, line: 118, baseType: !87, size: 32, align: 32, offset: 49920)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_at_eof", scope: !62, file: !47, line: 119, baseType: !87, size: 32, align: 32, offset: 49952)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_streamed", scope: !62, file: !47, line: 120, baseType: !87, size: 32, align: 32, offset: 49984)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_delay_max", scope: !62, file: !47, line: 121, baseType: !87, size: 32, align: 32, offset: 50016)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !62, file: !47, line: 122, baseType: !87, size: 32, align: 32, offset: 50048)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "resource", scope: !62, file: !47, line: 123, baseType: !236, size: 64, align: 64, offset: 50112)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "reply_code", scope: !62, file: !47, line: 124, baseType: !87, size: 32, align: 32, offset: 50176)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "is_multi_client", scope: !62, file: !47, line: 125, baseType: !87, size: 32, align: 32, offset: 50208)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_step", scope: !62, file: !47, line: 126, baseType: !400, size: 32, align: 32, offset: 50240)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "HandshakeState", file: !47, line: 59, baseType: !46)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected_server", scope: !62, file: !47, line: 127, baseType: !87, size: 32, align: 32, offset: 50272)
!402 = !{!403, !406, !407, !408}
!403 = distinct !DIGlobalVariable(name: "ff_http_protocol", scope: !0, file: !47, line: 1742, type: !404, isLocal: false, isDefinition: true, variable: %struct.URLProtocol* @ff_http_protocol)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !154, line: 100, baseType: !161)
!406 = distinct !DIGlobalVariable(name: "ff_httpproxy_protocol", scope: !0, file: !47, line: 1880, type: !404, isLocal: false, isDefinition: true, variable: %struct.URLProtocol* @ff_httpproxy_protocol)
!407 = distinct !DIGlobalVariable(name: "http_context_class", scope: !0, file: !47, line: 1740, type: !66, isLocal: true, isDefinition: true, variable: %struct.AVClass* @http_context_class)
!408 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !47, line: 135, type: !409, isLocal: true, isDefinition: true, variable: <{ %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption }>* @options)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 16896, align: 64, elements: !412)
!410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !82)
!412 = !{!413}
!413 = !DISubrange(count: 33)
!414 = !{i32 2, !"Dwarf Version", i32 4}
!415 = !{i32 2, !"Debug Info Version", i32 3}
!416 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!417 = distinct !DISubprogram(name: "ff_http_init_auth_state", scope: !47, file: !47, line: 179, type: !418, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !422)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !152, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!422 = !{}
!423 = !DILocalVariable(name: "dest", arg: 1, scope: !417, file: !47, line: 179, type: !152)
!424 = !DIExpression()
!425 = !DILocation(line: 179, column: 42, scope: !417)
!426 = !DILocalVariable(name: "src", arg: 2, scope: !417, file: !47, line: 179, type: !420)
!427 = !DILocation(line: 179, column: 66, scope: !417)
!428 = !DILocation(line: 181, column: 29, scope: !417)
!429 = !DILocation(line: 181, column: 35, scope: !417)
!430 = !DILocation(line: 181, column: 14, scope: !417)
!431 = !DILocation(line: 181, column: 47, scope: !417)
!432 = !DILocation(line: 181, column: 5, scope: !417)
!433 = !DILocation(line: 182, column: 29, scope: !417)
!434 = !DILocation(line: 182, column: 34, scope: !417)
!435 = !DILocation(line: 182, column: 14, scope: !417)
!436 = !DILocation(line: 182, column: 46, scope: !417)
!437 = !DILocation(line: 184, column: 29, scope: !417)
!438 = !DILocation(line: 184, column: 35, scope: !417)
!439 = !DILocation(line: 184, column: 14, scope: !417)
!440 = !DILocation(line: 184, column: 47, scope: !417)
!441 = !DILocation(line: 184, column: 5, scope: !417)
!442 = !DILocation(line: 185, column: 29, scope: !417)
!443 = !DILocation(line: 185, column: 34, scope: !417)
!444 = !DILocation(line: 185, column: 14, scope: !417)
!445 = !DILocation(line: 185, column: 46, scope: !417)
!446 = !DILocation(line: 187, column: 1, scope: !417)
!447 = distinct !DISubprogram(name: "ff_http_do_new_request", scope: !47, file: !47, line: 307, type: !448, isLocal: false, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !422)
!448 = !DISubroutineType(types: !449)
!449 = !{!87, !152, !71}
!450 = !DILocalVariable(name: "h", arg: 1, scope: !447, file: !47, line: 307, type: !152)
!451 = !DILocation(line: 307, column: 40, scope: !447)
!452 = !DILocalVariable(name: "uri", arg: 2, scope: !447, file: !47, line: 307, type: !71)
!453 = !DILocation(line: 307, column: 55, scope: !447)
!454 = !DILocalVariable(name: "s", scope: !447, file: !47, line: 309, type: !60)
!455 = !DILocation(line: 309, column: 18, scope: !447)
!456 = !DILocation(line: 309, column: 22, scope: !447)
!457 = !DILocation(line: 309, column: 25, scope: !447)
!458 = !DILocalVariable(name: "options", scope: !447, file: !47, line: 310, type: !173)
!459 = !DILocation(line: 310, column: 19, scope: !447)
!460 = !DILocalVariable(name: "ret", scope: !447, file: !47, line: 311, type: !87)
!461 = !DILocation(line: 311, column: 9, scope: !447)
!462 = !DILocalVariable(name: "hostname1", scope: !447, file: !47, line: 312, type: !463)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 8192, align: 8, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 1024)
!466 = !DILocation(line: 312, column: 10, scope: !447)
!467 = !DILocalVariable(name: "hostname2", scope: !447, file: !47, line: 312, type: !463)
!468 = !DILocation(line: 312, column: 27, scope: !447)
!469 = !DILocalVariable(name: "proto1", scope: !447, file: !47, line: 312, type: !307)
!470 = !DILocation(line: 312, column: 44, scope: !447)
!471 = !DILocalVariable(name: "proto2", scope: !447, file: !47, line: 312, type: !307)
!472 = !DILocation(line: 312, column: 56, scope: !447)
!473 = !DILocalVariable(name: "port1", scope: !447, file: !47, line: 313, type: !87)
!474 = !DILocation(line: 313, column: 9, scope: !447)
!475 = !DILocalVariable(name: "port2", scope: !447, file: !47, line: 313, type: !87)
!476 = !DILocation(line: 313, column: 16, scope: !447)
!477 = !DILocation(line: 315, column: 10, scope: !478)
!478 = distinct !DILexicalBlock(scope: !447, file: !47, line: 315, column: 9)
!479 = !DILocation(line: 315, column: 13, scope: !478)
!480 = !DILocation(line: 315, column: 18, scope: !478)
!481 = !DILocation(line: 316, column: 19, scope: !478)
!482 = !DILocation(line: 316, column: 22, scope: !478)
!483 = !DILocation(line: 316, column: 28, scope: !478)
!484 = !DILocation(line: 316, column: 12, scope: !478)
!485 = !DILocation(line: 316, column: 42, scope: !478)
!486 = !DILocation(line: 317, column: 19, scope: !478)
!487 = !DILocation(line: 317, column: 22, scope: !478)
!488 = !DILocation(line: 317, column: 28, scope: !478)
!489 = !DILocation(line: 317, column: 12, scope: !478)
!490 = !DILocation(line: 315, column: 9, scope: !491)
!491 = !DILexicalBlockFile(scope: !447, file: !47, discriminator: 1)
!492 = !DILocation(line: 318, column: 9, scope: !478)
!493 = !DILocation(line: 320, column: 18, scope: !447)
!494 = !DILocation(line: 321, column: 18, scope: !447)
!495 = !DILocation(line: 322, column: 26, scope: !447)
!496 = !DILocation(line: 322, column: 29, scope: !447)
!497 = !DILocation(line: 320, column: 5, scope: !447)
!498 = !DILocation(line: 323, column: 18, scope: !447)
!499 = !DILocation(line: 324, column: 18, scope: !447)
!500 = !DILocation(line: 325, column: 26, scope: !447)
!501 = !DILocation(line: 323, column: 5, scope: !447)
!502 = !DILocation(line: 326, column: 9, scope: !503)
!503 = distinct !DILexicalBlock(scope: !447, file: !47, line: 326, column: 9)
!504 = !DILocation(line: 326, column: 18, scope: !503)
!505 = !DILocation(line: 326, column: 15, scope: !503)
!506 = !DILocation(line: 326, column: 24, scope: !503)
!507 = !DILocation(line: 326, column: 35, scope: !508)
!508 = !DILexicalBlockFile(scope: !503, file: !47, discriminator: 1)
!509 = !DILocation(line: 326, column: 46, scope: !508)
!510 = !DILocation(line: 326, column: 27, scope: !508)
!511 = !DILocation(line: 326, column: 76, scope: !508)
!512 = !DILocation(line: 326, column: 9, scope: !508)
!513 = !DILocation(line: 327, column: 16, scope: !514)
!514 = distinct !DILexicalBlock(scope: !503, file: !47, line: 326, column: 82)
!515 = !DILocation(line: 328, column: 13, scope: !514)
!516 = !DILocation(line: 328, column: 24, scope: !514)
!517 = !DILocation(line: 329, column: 13, scope: !514)
!518 = !DILocation(line: 329, column: 24, scope: !514)
!519 = !DILocation(line: 327, column: 9, scope: !514)
!520 = !DILocation(line: 331, column: 9, scope: !514)
!521 = !DILocation(line: 334, column: 10, scope: !522)
!522 = distinct !DILexicalBlock(scope: !447, file: !47, line: 334, column: 9)
!523 = !DILocation(line: 334, column: 13, scope: !522)
!524 = !DILocation(line: 334, column: 9, scope: !447)
!525 = !DILocation(line: 335, column: 29, scope: !526)
!526 = distinct !DILexicalBlock(scope: !522, file: !47, line: 334, column: 31)
!527 = !DILocation(line: 335, column: 32, scope: !526)
!528 = !DILocation(line: 335, column: 35, scope: !526)
!529 = !DILocation(line: 335, column: 15, scope: !526)
!530 = !DILocation(line: 335, column: 13, scope: !526)
!531 = !DILocation(line: 336, column: 13, scope: !532)
!532 = distinct !DILexicalBlock(scope: !526, file: !47, line: 336, column: 13)
!533 = !DILocation(line: 336, column: 17, scope: !532)
!534 = !DILocation(line: 336, column: 13, scope: !526)
!535 = !DILocation(line: 337, column: 20, scope: !532)
!536 = !DILocation(line: 337, column: 13, scope: !532)
!537 = !DILocation(line: 338, column: 5, scope: !526)
!538 = !DILocation(line: 340, column: 9, scope: !539)
!539 = distinct !DILexicalBlock(scope: !447, file: !47, line: 340, column: 9)
!540 = !DILocation(line: 340, column: 12, scope: !539)
!541 = !DILocation(line: 340, column: 9, scope: !447)
!542 = !DILocation(line: 341, column: 9, scope: !539)
!543 = !DILocation(line: 343, column: 5, scope: !447)
!544 = !DILocation(line: 343, column: 8, scope: !447)
!545 = !DILocation(line: 343, column: 25, scope: !447)
!546 = !DILocation(line: 344, column: 5, scope: !447)
!547 = !DILocation(line: 344, column: 8, scope: !447)
!548 = !DILocation(line: 344, column: 17, scope: !447)
!549 = !DILocation(line: 345, column: 5, scope: !447)
!550 = !DILocation(line: 345, column: 8, scope: !447)
!551 = !DILocation(line: 345, column: 12, scope: !447)
!552 = !DILocation(line: 346, column: 5, scope: !447)
!553 = !DILocation(line: 346, column: 8, scope: !447)
!554 = !DILocation(line: 346, column: 22, scope: !447)
!555 = !DILocation(line: 347, column: 13, scope: !447)
!556 = !DILocation(line: 347, column: 16, scope: !447)
!557 = !DILocation(line: 347, column: 5, scope: !447)
!558 = !DILocation(line: 348, column: 29, scope: !447)
!559 = !DILocation(line: 348, column: 19, scope: !447)
!560 = !DILocation(line: 348, column: 5, scope: !447)
!561 = !DILocation(line: 348, column: 8, scope: !447)
!562 = !DILocation(line: 348, column: 17, scope: !447)
!563 = !DILocation(line: 349, column: 10, scope: !564)
!564 = distinct !DILexicalBlock(scope: !447, file: !47, line: 349, column: 9)
!565 = !DILocation(line: 349, column: 13, scope: !564)
!566 = !DILocation(line: 349, column: 9, scope: !447)
!567 = !DILocation(line: 350, column: 9, scope: !564)
!568 = !DILocation(line: 352, column: 12, scope: !447)
!569 = !DILocation(line: 352, column: 46, scope: !447)
!570 = !DILocation(line: 352, column: 51, scope: !447)
!571 = !DILocation(line: 352, column: 54, scope: !447)
!572 = !DILocation(line: 352, column: 60, scope: !447)
!573 = !DILocation(line: 352, column: 5, scope: !447)
!574 = !DILocation(line: 353, column: 25, scope: !447)
!575 = !DILocation(line: 353, column: 11, scope: !447)
!576 = !DILocation(line: 353, column: 9, scope: !447)
!577 = !DILocation(line: 354, column: 5, scope: !447)
!578 = !DILocation(line: 355, column: 12, scope: !447)
!579 = !DILocation(line: 355, column: 5, scope: !447)
!580 = !DILocation(line: 356, column: 1, scope: !447)
!581 = distinct !DISubprogram(name: "http_shutdown", scope: !47, file: !47, line: 1614, type: !205, isLocal: true, isDefinition: true, scopeLine: 1615, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !422)
!582 = !DILocalVariable(name: "h", arg: 1, scope: !581, file: !47, line: 1614, type: !152)
!583 = !DILocation(line: 1614, column: 38, scope: !581)
!584 = !DILocalVariable(name: "flags", arg: 2, scope: !581, file: !47, line: 1614, type: !87)
!585 = !DILocation(line: 1614, column: 45, scope: !581)
!586 = !DILocalVariable(name: "ret", scope: !581, file: !47, line: 1616, type: !87)
!587 = !DILocation(line: 1616, column: 9, scope: !581)
!588 = !DILocalVariable(name: "footer", scope: !581, file: !47, line: 1617, type: !589)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 48, align: 8, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: 6)
!592 = !DILocation(line: 1617, column: 10, scope: !581)
!593 = !DILocalVariable(name: "s", scope: !581, file: !47, line: 1618, type: !60)
!594 = !DILocation(line: 1618, column: 18, scope: !581)
!595 = !DILocation(line: 1618, column: 22, scope: !581)
!596 = !DILocation(line: 1618, column: 25, scope: !581)
!597 = !DILocation(line: 1621, column: 11, scope: !598)
!598 = distinct !DILexicalBlock(scope: !581, file: !47, line: 1621, column: 9)
!599 = !DILocation(line: 1621, column: 17, scope: !598)
!600 = !DILocation(line: 1621, column: 22, scope: !598)
!601 = !DILocation(line: 1621, column: 25, scope: !602)
!602 = !DILexicalBlockFile(scope: !598, file: !47, discriminator: 1)
!603 = !DILocation(line: 1621, column: 28, scope: !602)
!604 = !DILocation(line: 1621, column: 42, scope: !602)
!605 = !DILocation(line: 1622, column: 11, scope: !598)
!606 = !DILocation(line: 1622, column: 17, scope: !598)
!607 = !DILocation(line: 1622, column: 22, scope: !598)
!608 = !DILocation(line: 1622, column: 25, scope: !602)
!609 = !DILocation(line: 1622, column: 28, scope: !602)
!610 = !DILocation(line: 1622, column: 41, scope: !602)
!611 = !DILocation(line: 1622, column: 44, scope: !612)
!612 = !DILexicalBlockFile(scope: !598, file: !47, discriminator: 2)
!613 = !DILocation(line: 1622, column: 47, scope: !612)
!614 = !DILocation(line: 1621, column: 9, scope: !615)
!615 = !DILexicalBlockFile(scope: !581, file: !47, discriminator: 2)
!616 = !DILocation(line: 1623, column: 27, scope: !617)
!617 = distinct !DILexicalBlock(scope: !598, file: !47, line: 1622, column: 56)
!618 = !DILocation(line: 1623, column: 30, scope: !617)
!619 = !DILocation(line: 1623, column: 34, scope: !617)
!620 = !DILocation(line: 1623, column: 15, scope: !617)
!621 = !DILocation(line: 1623, column: 13, scope: !617)
!622 = !DILocation(line: 1624, column: 15, scope: !617)
!623 = !DILocation(line: 1624, column: 19, scope: !617)
!624 = !DILocation(line: 1624, column: 15, scope: !625)
!625 = !DILexicalBlockFile(scope: !617, file: !47, discriminator: 1)
!626 = !DILocation(line: 1624, column: 29, scope: !627)
!627 = !DILexicalBlockFile(scope: !617, file: !47, discriminator: 2)
!628 = !DILocation(line: 1624, column: 15, scope: !627)
!629 = !DILocation(line: 1624, column: 15, scope: !630)
!630 = !DILexicalBlockFile(scope: !617, file: !47, discriminator: 3)
!631 = !DILocation(line: 1624, column: 13, scope: !630)
!632 = !DILocation(line: 1626, column: 15, scope: !633)
!633 = distinct !DILexicalBlock(scope: !617, file: !47, line: 1626, column: 13)
!634 = !DILocation(line: 1626, column: 21, scope: !633)
!635 = !DILocation(line: 1626, column: 13, scope: !617)
!636 = !DILocalVariable(name: "buf", scope: !637, file: !47, line: 1627, type: !463)
!637 = distinct !DILexicalBlock(scope: !633, file: !47, line: 1626, column: 27)
!638 = !DILocation(line: 1627, column: 18, scope: !637)
!639 = !DILocalVariable(name: "read_ret", scope: !637, file: !47, line: 1628, type: !87)
!640 = !DILocation(line: 1628, column: 17, scope: !637)
!641 = !DILocation(line: 1629, column: 13, scope: !637)
!642 = !DILocation(line: 1629, column: 16, scope: !637)
!643 = !DILocation(line: 1629, column: 20, scope: !637)
!644 = !DILocation(line: 1629, column: 26, scope: !637)
!645 = !DILocation(line: 1630, column: 35, scope: !637)
!646 = !DILocation(line: 1630, column: 38, scope: !637)
!647 = !DILocation(line: 1630, column: 42, scope: !637)
!648 = !DILocation(line: 1630, column: 24, scope: !637)
!649 = !DILocation(line: 1630, column: 22, scope: !637)
!650 = !DILocation(line: 1631, column: 13, scope: !637)
!651 = !DILocation(line: 1631, column: 16, scope: !637)
!652 = !DILocation(line: 1631, column: 20, scope: !637)
!653 = !DILocation(line: 1631, column: 26, scope: !637)
!654 = !DILocation(line: 1632, column: 17, scope: !655)
!655 = distinct !DILexicalBlock(scope: !637, file: !47, line: 1632, column: 17)
!656 = !DILocation(line: 1632, column: 26, scope: !655)
!657 = !DILocation(line: 1632, column: 30, scope: !655)
!658 = !DILocation(line: 1632, column: 33, scope: !659)
!659 = !DILexicalBlockFile(scope: !655, file: !47, discriminator: 1)
!660 = !DILocation(line: 1632, column: 42, scope: !659)
!661 = !DILocation(line: 1632, column: 17, scope: !659)
!662 = !DILocation(line: 1633, column: 24, scope: !663)
!663 = distinct !DILexicalBlock(scope: !655, file: !47, line: 1632, column: 48)
!664 = !DILocation(line: 1633, column: 56, scope: !663)
!665 = !DILocation(line: 1633, column: 17, scope: !663)
!666 = !DILocation(line: 1634, column: 23, scope: !663)
!667 = !DILocation(line: 1634, column: 21, scope: !663)
!668 = !DILocation(line: 1635, column: 13, scope: !663)
!669 = !DILocation(line: 1636, column: 9, scope: !637)
!670 = !DILocation(line: 1637, column: 9, scope: !617)
!671 = !DILocation(line: 1637, column: 12, scope: !617)
!672 = !DILocation(line: 1637, column: 29, scope: !617)
!673 = !DILocation(line: 1638, column: 5, scope: !617)
!674 = !DILocation(line: 1640, column: 12, scope: !581)
!675 = !DILocation(line: 1640, column: 5, scope: !581)
!676 = distinct !DISubprogram(name: "http_open_cnx", scope: !47, file: !47, line: 251, type: !677, isLocal: true, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !422)
!677 = !DISubroutineType(types: !678)
!678 = !{!87, !152, !172}
!679 = !DILocalVariable(name: "h", arg: 1, scope: !676, file: !47, line: 251, type: !152)
!680 = !DILocation(line: 251, column: 38, scope: !676)
!681 = !DILocalVariable(name: "options", arg: 2, scope: !676, file: !47, line: 251, type: !172)
!682 = !DILocation(line: 251, column: 56, scope: !676)
!683 = !DILocalVariable(name: "cur_auth_type", scope: !676, file: !47, line: 253, type: !684)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "HTTPAuthType", file: !54, line: 33, baseType: !53)
!685 = !DILocation(line: 253, column: 18, scope: !676)
!686 = !DILocalVariable(name: "cur_proxy_auth_type", scope: !676, file: !47, line: 253, type: !684)
!687 = !DILocation(line: 253, column: 33, scope: !676)
!688 = !DILocalVariable(name: "s", scope: !676, file: !47, line: 254, type: !60)
!689 = !DILocation(line: 254, column: 18, scope: !676)
!690 = !DILocation(line: 254, column: 22, scope: !676)
!691 = !DILocation(line: 254, column: 25, scope: !676)
!692 = !DILocalVariable(name: "location_changed", scope: !676, file: !47, line: 255, type: !87)
!693 = !DILocation(line: 255, column: 9, scope: !676)
!694 = !DILocalVariable(name: "attempts", scope: !676, file: !47, line: 255, type: !87)
!695 = !DILocation(line: 255, column: 27, scope: !676)
!696 = !DILocalVariable(name: "redirects", scope: !676, file: !47, line: 255, type: !87)
!697 = !DILocation(line: 255, column: 41, scope: !676)
!698 = !DILocation(line: 255, column: 5, scope: !676)
!699 = !DILocation(line: 257, column: 18, scope: !676)
!700 = !DILocation(line: 257, column: 27, scope: !676)
!701 = !DILocation(line: 257, column: 30, scope: !676)
!702 = !DILocation(line: 257, column: 5, scope: !676)
!703 = !DILocation(line: 259, column: 21, scope: !676)
!704 = !DILocation(line: 259, column: 24, scope: !676)
!705 = !DILocation(line: 259, column: 35, scope: !676)
!706 = !DILocation(line: 259, column: 19, scope: !676)
!707 = !DILocation(line: 260, column: 27, scope: !676)
!708 = !DILocation(line: 260, column: 30, scope: !676)
!709 = !DILocation(line: 260, column: 41, scope: !676)
!710 = !DILocation(line: 260, column: 25, scope: !676)
!711 = !DILocation(line: 262, column: 47, scope: !676)
!712 = !DILocation(line: 262, column: 50, scope: !676)
!713 = !DILocation(line: 262, column: 24, scope: !676)
!714 = !DILocation(line: 262, column: 22, scope: !676)
!715 = !DILocation(line: 263, column: 9, scope: !716)
!716 = distinct !DILexicalBlock(scope: !676, file: !47, line: 263, column: 9)
!717 = !DILocation(line: 263, column: 26, scope: !716)
!718 = !DILocation(line: 263, column: 9, scope: !676)
!719 = !DILocation(line: 264, column: 9, scope: !716)
!720 = !DILocation(line: 266, column: 13, scope: !676)
!721 = !DILocation(line: 267, column: 9, scope: !722)
!722 = distinct !DILexicalBlock(scope: !676, file: !47, line: 267, column: 9)
!723 = !DILocation(line: 267, column: 12, scope: !722)
!724 = !DILocation(line: 267, column: 22, scope: !722)
!725 = !DILocation(line: 267, column: 9, scope: !676)
!726 = !DILocation(line: 268, column: 14, scope: !727)
!727 = distinct !DILexicalBlock(scope: !728, file: !47, line: 268, column: 13)
!728 = distinct !DILexicalBlock(scope: !722, file: !47, line: 267, column: 30)
!729 = !DILocation(line: 268, column: 28, scope: !727)
!730 = !DILocation(line: 268, column: 46, scope: !727)
!731 = !DILocation(line: 268, column: 49, scope: !732)
!732 = !DILexicalBlockFile(scope: !727, file: !47, discriminator: 1)
!733 = !DILocation(line: 268, column: 52, scope: !732)
!734 = !DILocation(line: 268, column: 63, scope: !732)
!735 = !DILocation(line: 268, column: 70, scope: !732)
!736 = !DILocation(line: 269, column: 13, scope: !727)
!737 = !DILocation(line: 269, column: 16, scope: !727)
!738 = !DILocation(line: 269, column: 27, scope: !727)
!739 = !DILocation(line: 269, column: 37, scope: !727)
!740 = !DILocation(line: 269, column: 55, scope: !727)
!741 = !DILocation(line: 269, column: 58, scope: !732)
!742 = !DILocation(line: 269, column: 67, scope: !732)
!743 = !DILocation(line: 268, column: 13, scope: !744)
!744 = !DILexicalBlockFile(scope: !728, file: !47, discriminator: 2)
!745 = !DILocation(line: 270, column: 27, scope: !746)
!746 = distinct !DILexicalBlock(scope: !727, file: !47, line: 269, column: 72)
!747 = !DILocation(line: 270, column: 30, scope: !746)
!748 = !DILocation(line: 270, column: 13, scope: !746)
!749 = !DILocation(line: 271, column: 13, scope: !746)
!750 = !DILocation(line: 273, column: 13, scope: !727)
!751 = !DILocation(line: 275, column: 9, scope: !752)
!752 = distinct !DILexicalBlock(scope: !676, file: !47, line: 275, column: 9)
!753 = !DILocation(line: 275, column: 12, scope: !752)
!754 = !DILocation(line: 275, column: 22, scope: !752)
!755 = !DILocation(line: 275, column: 9, scope: !676)
!756 = !DILocation(line: 276, column: 14, scope: !757)
!757 = distinct !DILexicalBlock(scope: !758, file: !47, line: 276, column: 13)
!758 = distinct !DILexicalBlock(scope: !752, file: !47, line: 275, column: 30)
!759 = !DILocation(line: 276, column: 34, scope: !757)
!760 = !DILocation(line: 276, column: 52, scope: !757)
!761 = !DILocation(line: 276, column: 55, scope: !762)
!762 = !DILexicalBlockFile(scope: !757, file: !47, discriminator: 1)
!763 = !DILocation(line: 276, column: 58, scope: !762)
!764 = !DILocation(line: 276, column: 75, scope: !762)
!765 = !DILocation(line: 276, column: 82, scope: !762)
!766 = !DILocation(line: 277, column: 13, scope: !757)
!767 = !DILocation(line: 277, column: 16, scope: !757)
!768 = !DILocation(line: 277, column: 33, scope: !757)
!769 = !DILocation(line: 277, column: 43, scope: !757)
!770 = !DILocation(line: 277, column: 61, scope: !757)
!771 = !DILocation(line: 277, column: 64, scope: !762)
!772 = !DILocation(line: 277, column: 73, scope: !762)
!773 = !DILocation(line: 276, column: 13, scope: !774)
!774 = !DILexicalBlockFile(scope: !758, file: !47, discriminator: 2)
!775 = !DILocation(line: 278, column: 27, scope: !776)
!776 = distinct !DILexicalBlock(scope: !757, file: !47, line: 277, column: 78)
!777 = !DILocation(line: 278, column: 30, scope: !776)
!778 = !DILocation(line: 278, column: 13, scope: !776)
!779 = !DILocation(line: 279, column: 13, scope: !776)
!780 = !DILocation(line: 281, column: 13, scope: !757)
!781 = !DILocation(line: 283, column: 10, scope: !782)
!782 = distinct !DILexicalBlock(scope: !676, file: !47, line: 283, column: 9)
!783 = !DILocation(line: 283, column: 13, scope: !782)
!784 = !DILocation(line: 283, column: 23, scope: !782)
!785 = !DILocation(line: 283, column: 30, scope: !782)
!786 = !DILocation(line: 283, column: 33, scope: !787)
!787 = !DILexicalBlockFile(scope: !782, file: !47, discriminator: 1)
!788 = !DILocation(line: 283, column: 36, scope: !787)
!789 = !DILocation(line: 283, column: 46, scope: !787)
!790 = !DILocation(line: 283, column: 53, scope: !787)
!791 = !DILocation(line: 284, column: 10, scope: !782)
!792 = !DILocation(line: 284, column: 13, scope: !782)
!793 = !DILocation(line: 284, column: 23, scope: !782)
!794 = !DILocation(line: 284, column: 30, scope: !782)
!795 = !DILocation(line: 284, column: 33, scope: !787)
!796 = !DILocation(line: 284, column: 36, scope: !787)
!797 = !DILocation(line: 284, column: 46, scope: !787)
!798 = !DILocation(line: 284, column: 54, scope: !787)
!799 = !DILocation(line: 285, column: 9, scope: !782)
!800 = !DILocation(line: 285, column: 26, scope: !782)
!801 = !DILocation(line: 283, column: 9, scope: !802)
!802 = !DILexicalBlockFile(scope: !676, file: !47, discriminator: 2)
!803 = !DILocation(line: 287, column: 23, scope: !804)
!804 = distinct !DILexicalBlock(scope: !782, file: !47, line: 285, column: 32)
!805 = !DILocation(line: 287, column: 26, scope: !804)
!806 = !DILocation(line: 287, column: 9, scope: !804)
!807 = !DILocation(line: 288, column: 22, scope: !808)
!808 = distinct !DILexicalBlock(scope: !804, file: !47, line: 288, column: 13)
!809 = !DILocation(line: 288, column: 25, scope: !808)
!810 = !DILocation(line: 288, column: 13, scope: !804)
!811 = !DILocation(line: 289, column: 13, scope: !808)
!812 = !DILocation(line: 292, column: 17, scope: !804)
!813 = !DILocation(line: 292, column: 20, scope: !804)
!814 = !DILocation(line: 292, column: 9, scope: !804)
!815 = !DILocation(line: 293, column: 18, scope: !804)
!816 = !DILocation(line: 294, column: 26, scope: !804)
!817 = !DILocation(line: 295, column: 9, scope: !804)
!818 = !DILocation(line: 297, column: 5, scope: !676)
!819 = !DILocation(line: 300, column: 9, scope: !820)
!820 = distinct !DILexicalBlock(scope: !676, file: !47, line: 300, column: 9)
!821 = !DILocation(line: 300, column: 12, scope: !820)
!822 = !DILocation(line: 300, column: 9, scope: !676)
!823 = !DILocation(line: 301, column: 23, scope: !820)
!824 = !DILocation(line: 301, column: 26, scope: !820)
!825 = !DILocation(line: 301, column: 9, scope: !820)
!826 = !DILocation(line: 302, column: 9, scope: !827)
!827 = distinct !DILexicalBlock(scope: !676, file: !47, line: 302, column: 9)
!828 = !DILocation(line: 302, column: 26, scope: !827)
!829 = !DILocation(line: 302, column: 9, scope: !676)
!830 = !DILocation(line: 303, column: 16, scope: !827)
!831 = !DILocation(line: 303, column: 9, scope: !827)
!832 = !DILocation(line: 304, column: 28, scope: !676)
!833 = !DILocation(line: 304, column: 31, scope: !676)
!834 = !DILocation(line: 304, column: 12, scope: !676)
!835 = !DILocation(line: 304, column: 5, scope: !676)
!836 = !DILocation(line: 305, column: 1, scope: !676)
!837 = distinct !DISubprogram(name: "ff_http_averror", scope: !47, file: !47, line: 358, type: !838, isLocal: false, isDefinition: true, scopeLine: 359, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !422)
!838 = !DISubroutineType(types: !839)
!839 = !{!87, !87, !87}
!840 = !DILocalVariable(name: "status_code", arg: 1, scope: !837, file: !47, line: 358, type: !87)
!841 = !DILocation(line: 358, column: 25, scope: !837)
!842 = !DILocalVariable(name: "default_averror", arg: 2, scope: !837, file: !47, line: 358, type: !87)
!843 = !DILocation(line: 358, column: 42, scope: !837)
!844 = !DILocation(line: 360, column: 13, scope: !837)
!845 = !DILocation(line: 360, column: 5, scope: !837)
!846 = !DILocation(line: 361, column: 19, scope: !847)
!847 = distinct !DILexicalBlock(scope: !837, file: !47, line: 360, column: 26)
!848 = !DILocation(line: 362, column: 19, scope: !847)
!849 = !DILocation(line: 363, column: 19, scope: !847)
!850 = !DILocation(line: 364, column: 19, scope: !847)
!851 = !DILocation(line: 365, column: 18, scope: !847)
!852 = !DILocation(line: 367, column: 9, scope: !853)
!853 = distinct !DILexicalBlock(scope: !837, file: !47, line: 367, column: 9)
!854 = !DILocation(line: 367, column: 21, scope: !853)
!855 = !DILocation(line: 367, column: 28, scope: !853)
!856 = !DILocation(line: 367, column: 31, scope: !857)
!857 = !DILexicalBlockFile(scope: !853, file: !47, discriminator: 1)
!858 = !DILocation(line: 367, column: 43, scope: !857)
!859 = !DILocation(line: 367, column: 9, scope: !857)
!860 = !DILocation(line: 368, column: 9, scope: !853)
!861 = !DILocation(line: 369, column: 14, scope: !862)
!862 = distinct !DILexicalBlock(scope: !853, file: !47, line: 369, column: 14)
!863 = !DILocation(line: 369, column: 26, scope: !862)
!864 = !DILocation(line: 369, column: 14, scope: !853)
!865 = !DILocation(line: 370, column: 9, scope: !862)
!866 = !DILocation(line: 372, column: 16, scope: !862)
!867 = !DILocation(line: 372, column: 9, scope: !862)
!868 = !DILocation(line: 373, column: 1, scope: !837)
!869 = distinct !DISubprogram(name: "http_open", scope: !47, file: !47, line: 522, type: !170, isLocal: true, isDefinition: true, scopeLine: 524, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !422)
!870 = !DILocalVariable(name: "h", arg: 1, scope: !869, file: !47, line: 522, type: !152)
!871 = !DILocation(line: 522, column: 34, scope: !869)
!872 = !DILocalVariable(name: "uri", arg: 2, scope: !869, file: !47, line: 522, type: !71)
!873 = !DILocation(line: 522, column: 49, scope: !869)
!874 = !DILocalVariable(name: "flags", arg: 3, scope: !869, file: !47, line: 522, type: !87)
!875 = !DILocation(line: 522, column: 58, scope: !869)
!876 = !DILocalVariable(name: "options", arg: 4, scope: !869, file: !47, line: 523, type: !172)
!877 = !DILocation(line: 523, column: 37, scope: !869)
!878 = !DILocalVariable(name: "s", scope: !869, file: !47, line: 525, type: !60)
!879 = !DILocation(line: 525, column: 18, scope: !869)
!880 = !DILocation(line: 525, column: 22, scope: !869)
!881 = !DILocation(line: 525, column: 25, scope: !869)
!882 = !DILocalVariable(name: "ret", scope: !869, file: !47, line: 526, type: !87)
!883 = !DILocation(line: 526, column: 9, scope: !869)
!884 = !DILocation(line: 528, column: 9, scope: !885)
!885 = distinct !DILexicalBlock(scope: !869, file: !47, line: 528, column: 9)
!886 = !DILocation(line: 528, column: 12, scope: !885)
!887 = !DILocation(line: 528, column: 21, scope: !885)
!888 = !DILocation(line: 528, column: 9, scope: !869)
!889 = !DILocation(line: 529, column: 9, scope: !885)
!890 = !DILocation(line: 529, column: 12, scope: !885)
!891 = !DILocation(line: 529, column: 24, scope: !885)
!892 = !DILocation(line: 531, column: 9, scope: !885)
!893 = !DILocation(line: 531, column: 12, scope: !885)
!894 = !DILocation(line: 531, column: 24, scope: !885)
!895 = !DILocation(line: 533, column: 5, scope: !869)
!896 = !DILocation(line: 533, column: 8, scope: !869)
!897 = !DILocation(line: 533, column: 17, scope: !869)
!898 = !DILocation(line: 534, column: 29, scope: !869)
!899 = !DILocation(line: 534, column: 19, scope: !869)
!900 = !DILocation(line: 534, column: 5, scope: !869)
!901 = !DILocation(line: 534, column: 8, scope: !869)
!902 = !DILocation(line: 534, column: 17, scope: !869)
!903 = !DILocation(line: 535, column: 10, scope: !904)
!904 = distinct !DILexicalBlock(scope: !869, file: !47, line: 535, column: 9)
!905 = !DILocation(line: 535, column: 13, scope: !904)
!906 = !DILocation(line: 535, column: 9, scope: !869)
!907 = !DILocation(line: 536, column: 9, scope: !904)
!908 = !DILocation(line: 537, column: 9, scope: !909)
!909 = distinct !DILexicalBlock(scope: !869, file: !47, line: 537, column: 9)
!910 = !DILocation(line: 537, column: 9, scope: !869)
!911 = !DILocation(line: 538, column: 23, scope: !909)
!912 = !DILocation(line: 538, column: 26, scope: !909)
!913 = !DILocation(line: 538, column: 44, scope: !909)
!914 = !DILocation(line: 538, column: 43, scope: !909)
!915 = !DILocation(line: 538, column: 9, scope: !909)
!916 = !DILocation(line: 540, column: 9, scope: !917)
!917 = distinct !DILexicalBlock(scope: !869, file: !47, line: 540, column: 9)
!918 = !DILocation(line: 540, column: 12, scope: !917)
!919 = !DILocation(line: 540, column: 9, scope: !869)
!920 = !DILocalVariable(name: "len", scope: !921, file: !47, line: 541, type: !87)
!921 = distinct !DILexicalBlock(scope: !917, file: !47, line: 540, column: 21)
!922 = !DILocation(line: 541, column: 13, scope: !921)
!923 = !DILocation(line: 541, column: 26, scope: !921)
!924 = !DILocation(line: 541, column: 29, scope: !921)
!925 = !DILocation(line: 541, column: 19, scope: !921)
!926 = !DILocation(line: 542, column: 13, scope: !927)
!927 = distinct !DILexicalBlock(scope: !921, file: !47, line: 542, column: 13)
!928 = !DILocation(line: 542, column: 17, scope: !927)
!929 = !DILocation(line: 542, column: 21, scope: !927)
!930 = !DILocation(line: 542, column: 39, scope: !931)
!931 = !DILexicalBlockFile(scope: !927, file: !47, discriminator: 1)
!932 = !DILocation(line: 542, column: 42, scope: !931)
!933 = !DILocation(line: 542, column: 52, scope: !931)
!934 = !DILocation(line: 542, column: 50, scope: !931)
!935 = !DILocation(line: 542, column: 56, scope: !931)
!936 = !DILocation(line: 542, column: 24, scope: !931)
!937 = !DILocation(line: 542, column: 13, scope: !931)
!938 = !DILocation(line: 543, column: 20, scope: !939)
!939 = distinct !DILexicalBlock(scope: !927, file: !47, line: 542, column: 62)
!940 = !DILocation(line: 543, column: 13, scope: !939)
!941 = !DILocation(line: 545, column: 32, scope: !939)
!942 = !DILocation(line: 545, column: 35, scope: !939)
!943 = !DILocation(line: 545, column: 31, scope: !939)
!944 = !DILocation(line: 545, column: 44, scope: !939)
!945 = !DILocation(line: 545, column: 48, scope: !939)
!946 = !DILocation(line: 545, column: 19, scope: !939)
!947 = !DILocation(line: 545, column: 17, scope: !939)
!948 = !DILocation(line: 546, column: 17, scope: !949)
!949 = distinct !DILexicalBlock(scope: !939, file: !47, line: 546, column: 17)
!950 = !DILocation(line: 546, column: 21, scope: !949)
!951 = !DILocation(line: 546, column: 17, scope: !939)
!952 = !DILocation(line: 547, column: 24, scope: !949)
!953 = !DILocation(line: 547, column: 17, scope: !949)
!954 = !DILocation(line: 548, column: 24, scope: !939)
!955 = !DILocation(line: 548, column: 13, scope: !939)
!956 = !DILocation(line: 548, column: 16, scope: !939)
!957 = !DILocation(line: 548, column: 29, scope: !939)
!958 = !DILocation(line: 549, column: 24, scope: !939)
!959 = !DILocation(line: 549, column: 28, scope: !939)
!960 = !DILocation(line: 549, column: 13, scope: !939)
!961 = !DILocation(line: 549, column: 16, scope: !939)
!962 = !DILocation(line: 549, column: 33, scope: !939)
!963 = !DILocation(line: 550, column: 24, scope: !939)
!964 = !DILocation(line: 550, column: 28, scope: !939)
!965 = !DILocation(line: 550, column: 13, scope: !939)
!966 = !DILocation(line: 550, column: 16, scope: !939)
!967 = !DILocation(line: 550, column: 33, scope: !939)
!968 = !DILocation(line: 551, column: 9, scope: !939)
!969 = !DILocation(line: 552, column: 5, scope: !921)
!970 = !DILocation(line: 554, column: 9, scope: !971)
!971 = distinct !DILexicalBlock(scope: !869, file: !47, line: 554, column: 9)
!972 = !DILocation(line: 554, column: 12, scope: !971)
!973 = !DILocation(line: 554, column: 9, scope: !869)
!974 = !DILocation(line: 555, column: 28, scope: !975)
!975 = distinct !DILexicalBlock(scope: !971, file: !47, line: 554, column: 20)
!976 = !DILocation(line: 555, column: 31, scope: !975)
!977 = !DILocation(line: 555, column: 36, scope: !975)
!978 = !DILocation(line: 555, column: 43, scope: !975)
!979 = !DILocation(line: 555, column: 16, scope: !975)
!980 = !DILocation(line: 555, column: 9, scope: !975)
!981 = !DILocation(line: 557, column: 25, scope: !869)
!982 = !DILocation(line: 557, column: 28, scope: !869)
!983 = !DILocation(line: 557, column: 11, scope: !869)
!984 = !DILocation(line: 557, column: 9, scope: !869)
!985 = !DILocation(line: 558, column: 9, scope: !986)
!986 = distinct !DILexicalBlock(scope: !869, file: !47, line: 558, column: 9)
!987 = !DILocation(line: 558, column: 13, scope: !986)
!988 = !DILocation(line: 558, column: 9, scope: !869)
!989 = !DILocation(line: 559, column: 23, scope: !986)
!990 = !DILocation(line: 559, column: 26, scope: !986)
!991 = !DILocation(line: 559, column: 9, scope: !986)
!992 = !DILocation(line: 560, column: 12, scope: !869)
!993 = !DILocation(line: 560, column: 5, scope: !869)
!994 = !DILocation(line: 561, column: 1, scope: !869)
!995 = distinct !DISubprogram(name: "http_accept", scope: !47, file: !47, line: 563, type: !179, isLocal: true, isDefinition: true, scopeLine: 564, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !422)
!996 = !DILocalVariable(name: "s", arg: 1, scope: !995, file: !47, line: 563, type: !152)
!997 = !DILocation(line: 563, column: 36, scope: !995)
!998 = !DILocalVariable(name: "c", arg: 2, scope: !995, file: !47, line: 563, type: !181)
!999 = !DILocation(line: 563, column: 52, scope: !995)
!1000 = !DILocalVariable(name: "ret", scope: !995, file: !47, line: 565, type: !87)
!1001 = !DILocation(line: 565, column: 9, scope: !995)
!1002 = !DILocalVariable(name: "sc", scope: !995, file: !47, line: 566, type: !60)
!1003 = !DILocation(line: 566, column: 18, scope: !995)
!1004 = !DILocation(line: 566, column: 23, scope: !995)
!1005 = !DILocation(line: 566, column: 26, scope: !995)
!1006 = !DILocalVariable(name: "cc", scope: !995, file: !47, line: 567, type: !60)
!1007 = !DILocation(line: 567, column: 18, scope: !995)
!1008 = !DILocalVariable(name: "sl", scope: !995, file: !47, line: 568, type: !152)
!1009 = !DILocation(line: 568, column: 17, scope: !995)
!1010 = !DILocation(line: 568, column: 22, scope: !995)
!1011 = !DILocation(line: 568, column: 26, scope: !995)
!1012 = !DILocalVariable(name: "cl", scope: !995, file: !47, line: 569, type: !152)
!1013 = !DILocation(line: 569, column: 17, scope: !995)
!1014 = !DILocation(line: 571, column: 5, scope: !995)
!1015 = distinct !{!1015, !1014}
!1016 = !DILocation(line: 571, column: 16, scope: !1017)
!1017 = !DILexicalBlockFile(scope: !1018, file: !47, discriminator: 1)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !47, line: 571, column: 14)
!1019 = distinct !DILexicalBlock(scope: !995, file: !47, line: 571, column: 8)
!1020 = !DILocation(line: 571, column: 20, scope: !1017)
!1021 = !DILocation(line: 571, column: 15, scope: !1017)
!1022 = !DILocation(line: 571, column: 14, scope: !1017)
!1023 = !DILocation(line: 571, column: 31, scope: !1024)
!1024 = !DILexicalBlockFile(scope: !1025, file: !47, discriminator: 2)
!1025 = distinct !DILexicalBlock(scope: !1018, file: !47, line: 571, column: 29)
!1026 = !DILocation(line: 571, column: 85, scope: !1027)
!1027 = !DILexicalBlockFile(scope: !1024, file: !47, discriminator: 4)
!1028 = !DILocation(line: 571, column: 85, scope: !1024)
!1029 = !DILocation(line: 571, column: 96, scope: !1030)
!1030 = !DILexicalBlockFile(scope: !1019, file: !47, discriminator: 3)
!1031 = !DILocation(line: 572, column: 28, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !995, file: !47, line: 572, column: 9)
!1033 = !DILocation(line: 572, column: 31, scope: !1032)
!1034 = !DILocation(line: 572, column: 34, scope: !1032)
!1035 = !DILocation(line: 572, column: 44, scope: !1032)
!1036 = !DILocation(line: 572, column: 47, scope: !1032)
!1037 = !DILocation(line: 572, column: 55, scope: !1032)
!1038 = !DILocation(line: 572, column: 59, scope: !1032)
!1039 = !DILocation(line: 572, column: 16, scope: !1032)
!1040 = !DILocation(line: 572, column: 14, scope: !1032)
!1041 = !DILocation(line: 572, column: 80, scope: !1032)
!1042 = !DILocation(line: 572, column: 9, scope: !995)
!1043 = !DILocation(line: 573, column: 9, scope: !1032)
!1044 = !DILocation(line: 574, column: 12, scope: !995)
!1045 = !DILocation(line: 574, column: 11, scope: !995)
!1046 = !DILocation(line: 574, column: 16, scope: !995)
!1047 = !DILocation(line: 574, column: 10, scope: !995)
!1048 = !DILocation(line: 574, column: 8, scope: !995)
!1049 = !DILocation(line: 575, column: 29, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !995, file: !47, line: 575, column: 9)
!1051 = !DILocation(line: 575, column: 16, scope: !1050)
!1052 = !DILocation(line: 575, column: 14, scope: !1050)
!1053 = !DILocation(line: 575, column: 39, scope: !1050)
!1054 = !DILocation(line: 575, column: 9, scope: !995)
!1055 = !DILocation(line: 576, column: 9, scope: !1050)
!1056 = !DILocation(line: 577, column: 14, scope: !995)
!1057 = !DILocation(line: 577, column: 5, scope: !995)
!1058 = !DILocation(line: 577, column: 9, scope: !995)
!1059 = !DILocation(line: 577, column: 12, scope: !995)
!1060 = !DILocation(line: 578, column: 5, scope: !995)
!1061 = !DILocation(line: 578, column: 9, scope: !995)
!1062 = !DILocation(line: 578, column: 25, scope: !995)
!1063 = !DILocation(line: 579, column: 5, scope: !995)
!1064 = !DILocation(line: 581, column: 9, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !995, file: !47, line: 581, column: 9)
!1066 = !DILocation(line: 581, column: 9, scope: !995)
!1067 = !DILocation(line: 582, column: 22, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1065, file: !47, line: 581, column: 12)
!1069 = !DILocation(line: 582, column: 9, scope: !1068)
!1070 = !DILocation(line: 583, column: 5, scope: !1068)
!1071 = !DILocation(line: 584, column: 12, scope: !995)
!1072 = !DILocation(line: 584, column: 5, scope: !995)
!1073 = !DILocation(line: 585, column: 1, scope: !995)
!1074 = distinct !DISubprogram(name: "http_handshake", scope: !47, file: !47, line: 455, type: !184, isLocal: true, isDefinition: true, scopeLine: 456, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !422)
!1075 = !DILocalVariable(name: "c", arg: 1, scope: !1074, file: !47, line: 455, type: !152)
!1076 = !DILocation(line: 455, column: 39, scope: !1074)
!1077 = !DILocalVariable(name: "ret", scope: !1074, file: !47, line: 457, type: !87)
!1078 = !DILocation(line: 457, column: 9, scope: !1074)
!1079 = !DILocalVariable(name: "err", scope: !1074, file: !47, line: 457, type: !87)
!1080 = !DILocation(line: 457, column: 14, scope: !1074)
!1081 = !DILocalVariable(name: "new_location", scope: !1074, file: !47, line: 457, type: !87)
!1082 = !DILocation(line: 457, column: 19, scope: !1074)
!1083 = !DILocalVariable(name: "ch", scope: !1074, file: !47, line: 458, type: !60)
!1084 = !DILocation(line: 458, column: 18, scope: !1074)
!1085 = !DILocation(line: 458, column: 23, scope: !1074)
!1086 = !DILocation(line: 458, column: 26, scope: !1074)
!1087 = !DILocalVariable(name: "cl", scope: !1074, file: !47, line: 459, type: !152)
!1088 = !DILocation(line: 459, column: 17, scope: !1074)
!1089 = !DILocation(line: 459, column: 22, scope: !1074)
!1090 = !DILocation(line: 459, column: 26, scope: !1074)
!1091 = !DILocation(line: 460, column: 13, scope: !1074)
!1092 = !DILocation(line: 460, column: 17, scope: !1074)
!1093 = !DILocation(line: 460, column: 5, scope: !1074)
!1094 = !DILocation(line: 462, column: 16, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1074, file: !47, line: 460, column: 33)
!1096 = !DILocation(line: 462, column: 9, scope: !1095)
!1097 = !DILocation(line: 463, column: 36, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1095, file: !47, line: 463, column: 13)
!1099 = !DILocation(line: 463, column: 20, scope: !1098)
!1100 = !DILocation(line: 463, column: 18, scope: !1098)
!1101 = !DILocation(line: 463, column: 41, scope: !1098)
!1102 = !DILocation(line: 463, column: 13, scope: !1095)
!1103 = !DILocation(line: 464, column: 24, scope: !1098)
!1104 = !DILocation(line: 464, column: 22, scope: !1098)
!1105 = !DILocation(line: 464, column: 13, scope: !1098)
!1106 = !DILocation(line: 465, column: 13, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1095, file: !47, line: 465, column: 13)
!1108 = !DILocation(line: 465, column: 17, scope: !1107)
!1109 = !DILocation(line: 465, column: 13, scope: !1095)
!1110 = !DILocation(line: 466, column: 20, scope: !1107)
!1111 = !DILocation(line: 466, column: 13, scope: !1107)
!1112 = !DILocation(line: 467, column: 9, scope: !1095)
!1113 = !DILocation(line: 467, column: 13, scope: !1095)
!1114 = !DILocation(line: 467, column: 28, scope: !1095)
!1115 = !DILocation(line: 468, column: 9, scope: !1095)
!1116 = !DILocation(line: 468, column: 13, scope: !1095)
!1117 = !DILocation(line: 468, column: 33, scope: !1095)
!1118 = !DILocation(line: 469, column: 9, scope: !1095)
!1119 = !DILocation(line: 471, column: 16, scope: !1095)
!1120 = !DILocation(line: 471, column: 9, scope: !1095)
!1121 = !DILocation(line: 472, column: 37, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1095, file: !47, line: 472, column: 13)
!1123 = !DILocation(line: 472, column: 20, scope: !1122)
!1124 = !DILocation(line: 472, column: 18, scope: !1122)
!1125 = !DILocation(line: 472, column: 56, scope: !1122)
!1126 = !DILocation(line: 472, column: 13, scope: !1095)
!1127 = !DILocation(line: 473, column: 32, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1122, file: !47, line: 472, column: 61)
!1129 = !DILocation(line: 473, column: 35, scope: !1128)
!1130 = !DILocation(line: 473, column: 13, scope: !1128)
!1131 = !DILocation(line: 474, column: 20, scope: !1128)
!1132 = !DILocation(line: 474, column: 13, scope: !1128)
!1133 = !DILocation(line: 476, column: 9, scope: !1095)
!1134 = !DILocation(line: 476, column: 13, scope: !1095)
!1135 = !DILocation(line: 476, column: 28, scope: !1095)
!1136 = !DILocation(line: 477, column: 9, scope: !1095)
!1137 = !DILocation(line: 479, column: 16, scope: !1095)
!1138 = !DILocation(line: 479, column: 43, scope: !1095)
!1139 = !DILocation(line: 479, column: 47, scope: !1095)
!1140 = !DILocation(line: 479, column: 9, scope: !1095)
!1141 = !DILocation(line: 480, column: 37, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1095, file: !47, line: 480, column: 13)
!1143 = !DILocation(line: 480, column: 40, scope: !1142)
!1144 = !DILocation(line: 480, column: 44, scope: !1142)
!1145 = !DILocation(line: 480, column: 20, scope: !1142)
!1146 = !DILocation(line: 480, column: 18, scope: !1142)
!1147 = !DILocation(line: 480, column: 57, scope: !1142)
!1148 = !DILocation(line: 480, column: 13, scope: !1095)
!1149 = !DILocation(line: 481, column: 20, scope: !1142)
!1150 = !DILocation(line: 481, column: 13, scope: !1142)
!1151 = !DILocation(line: 482, column: 9, scope: !1095)
!1152 = !DILocation(line: 482, column: 13, scope: !1095)
!1153 = !DILocation(line: 482, column: 28, scope: !1095)
!1154 = !DILocation(line: 483, column: 9, scope: !1095)
!1155 = !DILocation(line: 485, column: 9, scope: !1095)
!1156 = !DILocation(line: 488, column: 5, scope: !1074)
!1157 = !DILocation(line: 489, column: 1, scope: !1074)
!1158 = distinct !DISubprogram(name: "http_read", scope: !47, file: !47, line: 1571, type: !1159, isLocal: true, isDefinition: true, scopeLine: 1572, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !422)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!87, !152, !334, !87}
!1161 = !DILocalVariable(name: "h", arg: 1, scope: !1158, file: !47, line: 1571, type: !152)
!1162 = !DILocation(line: 1571, column: 34, scope: !1158)
!1163 = !DILocalVariable(name: "buf", arg: 2, scope: !1158, file: !47, line: 1571, type: !334)
!1164 = !DILocation(line: 1571, column: 46, scope: !1158)
!1165 = !DILocalVariable(name: "size", arg: 3, scope: !1158, file: !47, line: 1571, type: !87)
!1166 = !DILocation(line: 1571, column: 55, scope: !1158)
!1167 = !DILocalVariable(name: "s", scope: !1158, file: !47, line: 1573, type: !60)
!1168 = !DILocation(line: 1573, column: 18, scope: !1158)
!1169 = !DILocation(line: 1573, column: 22, scope: !1158)
!1170 = !DILocation(line: 1573, column: 25, scope: !1158)
!1171 = !DILocation(line: 1575, column: 9, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1158, file: !47, line: 1575, column: 9)
!1173 = !DILocation(line: 1575, column: 12, scope: !1172)
!1174 = !DILocation(line: 1575, column: 24, scope: !1172)
!1175 = !DILocation(line: 1575, column: 9, scope: !1158)
!1176 = !DILocation(line: 1576, column: 26, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1172, file: !47, line: 1575, column: 29)
!1178 = !DILocation(line: 1576, column: 29, scope: !1177)
!1179 = !DILocation(line: 1576, column: 16, scope: !1177)
!1180 = !DILocation(line: 1576, column: 14, scope: !1177)
!1181 = !DILocation(line: 1577, column: 13, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1177, file: !47, line: 1577, column: 13)
!1183 = !DILocation(line: 1577, column: 18, scope: !1182)
!1184 = !DILocation(line: 1577, column: 13, scope: !1177)
!1185 = !DILocation(line: 1578, column: 20, scope: !1182)
!1186 = !DILocation(line: 1578, column: 13, scope: !1182)
!1187 = !DILocation(line: 1579, column: 5, scope: !1177)
!1188 = !DILocation(line: 1581, column: 29, scope: !1158)
!1189 = !DILocation(line: 1581, column: 32, scope: !1158)
!1190 = !DILocation(line: 1581, column: 37, scope: !1158)
!1191 = !DILocation(line: 1581, column: 12, scope: !1158)
!1192 = !DILocation(line: 1581, column: 10, scope: !1158)
!1193 = !DILocation(line: 1582, column: 9, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1158, file: !47, line: 1582, column: 9)
!1195 = !DILocation(line: 1582, column: 14, scope: !1194)
!1196 = !DILocation(line: 1582, column: 9, scope: !1158)
!1197 = !DILocation(line: 1583, column: 29, scope: !1194)
!1198 = !DILocation(line: 1583, column: 9, scope: !1194)
!1199 = !DILocation(line: 1583, column: 12, scope: !1194)
!1200 = !DILocation(line: 1583, column: 26, scope: !1194)
!1201 = !DILocation(line: 1584, column: 12, scope: !1158)
!1202 = !DILocation(line: 1584, column: 5, scope: !1158)
!1203 = !DILocation(line: 1585, column: 1, scope: !1158)
!1204 = distinct !DISubprogram(name: "http_write", scope: !47, file: !47, line: 1588, type: !1205, isLocal: true, isDefinition: true, scopeLine: 1589, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !422)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!87, !152, !1207, !87}
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!1209 = !DILocalVariable(name: "h", arg: 1, scope: !1204, file: !47, line: 1588, type: !152)
!1210 = !DILocation(line: 1588, column: 35, scope: !1204)
!1211 = !DILocalVariable(name: "buf", arg: 2, scope: !1204, file: !47, line: 1588, type: !1207)
!1212 = !DILocation(line: 1588, column: 53, scope: !1204)
!1213 = !DILocalVariable(name: "size", arg: 3, scope: !1204, file: !47, line: 1588, type: !87)
!1214 = !DILocation(line: 1588, column: 62, scope: !1204)
!1215 = !DILocalVariable(name: "temp", scope: !1204, file: !47, line: 1590, type: !1216)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 88, align: 8, elements: !1217)
!1217 = !{!1218}
!1218 = !DISubrange(count: 11)
!1219 = !DILocation(line: 1590, column: 10, scope: !1204)
!1220 = !DILocalVariable(name: "ret", scope: !1204, file: !47, line: 1591, type: !87)
!1221 = !DILocation(line: 1591, column: 9, scope: !1204)
!1222 = !DILocalVariable(name: "crlf", scope: !1204, file: !47, line: 1592, type: !1223)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 24, align: 8, elements: !1224)
!1224 = !{!1225}
!1225 = !DISubrange(count: 3)
!1226 = !DILocation(line: 1592, column: 10, scope: !1204)
!1227 = !DILocalVariable(name: "s", scope: !1204, file: !47, line: 1593, type: !60)
!1228 = !DILocation(line: 1593, column: 18, scope: !1204)
!1229 = !DILocation(line: 1593, column: 22, scope: !1204)
!1230 = !DILocation(line: 1593, column: 25, scope: !1204)
!1231 = !DILocation(line: 1595, column: 10, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1204, file: !47, line: 1595, column: 9)
!1233 = !DILocation(line: 1595, column: 13, scope: !1232)
!1234 = !DILocation(line: 1595, column: 9, scope: !1204)
!1235 = !DILocation(line: 1597, column: 28, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !1232, file: !47, line: 1595, column: 27)
!1237 = !DILocation(line: 1597, column: 31, scope: !1236)
!1238 = !DILocation(line: 1597, column: 35, scope: !1236)
!1239 = !DILocation(line: 1597, column: 40, scope: !1236)
!1240 = !DILocation(line: 1597, column: 16, scope: !1236)
!1241 = !DILocation(line: 1597, column: 9, scope: !1236)
!1242 = !DILocation(line: 1602, column: 9, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1204, file: !47, line: 1602, column: 9)
!1244 = !DILocation(line: 1602, column: 14, scope: !1243)
!1245 = !DILocation(line: 1602, column: 9, scope: !1204)
!1246 = !DILocation(line: 1604, column: 18, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !1243, file: !47, line: 1602, column: 19)
!1248 = !DILocation(line: 1604, column: 48, scope: !1247)
!1249 = !DILocation(line: 1604, column: 9, scope: !1247)
!1250 = !DILocation(line: 1606, column: 32, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !1247, file: !47, line: 1606, column: 13)
!1252 = !DILocation(line: 1606, column: 35, scope: !1251)
!1253 = !DILocation(line: 1606, column: 39, scope: !1251)
!1254 = !DILocation(line: 1606, column: 52, scope: !1251)
!1255 = !DILocation(line: 1606, column: 45, scope: !1251)
!1256 = !DILocation(line: 1606, column: 20, scope: !1257)
!1257 = !DILexicalBlockFile(scope: !1251, file: !47, discriminator: 2)
!1258 = !DILocation(line: 1606, column: 18, scope: !1251)
!1259 = !DILocation(line: 1606, column: 60, scope: !1251)
!1260 = !DILocation(line: 1606, column: 64, scope: !1251)
!1261 = !DILocation(line: 1607, column: 32, scope: !1251)
!1262 = !DILocation(line: 1607, column: 35, scope: !1251)
!1263 = !DILocation(line: 1607, column: 39, scope: !1251)
!1264 = !DILocation(line: 1607, column: 44, scope: !1251)
!1265 = !DILocation(line: 1607, column: 20, scope: !1251)
!1266 = !DILocation(line: 1607, column: 18, scope: !1251)
!1267 = !DILocation(line: 1607, column: 51, scope: !1251)
!1268 = !DILocation(line: 1607, column: 55, scope: !1251)
!1269 = !DILocation(line: 1608, column: 32, scope: !1251)
!1270 = !DILocation(line: 1608, column: 35, scope: !1251)
!1271 = !DILocation(line: 1608, column: 39, scope: !1251)
!1272 = !DILocation(line: 1608, column: 20, scope: !1251)
!1273 = !DILocation(line: 1608, column: 18, scope: !1251)
!1274 = !DILocation(line: 1608, column: 64, scope: !1251)
!1275 = !DILocation(line: 1606, column: 13, scope: !1276)
!1276 = !DILexicalBlockFile(scope: !1247, file: !47, discriminator: 1)
!1277 = !DILocation(line: 1609, column: 20, scope: !1251)
!1278 = !DILocation(line: 1609, column: 13, scope: !1251)
!1279 = !DILocation(line: 1610, column: 5, scope: !1247)
!1280 = !DILocation(line: 1611, column: 12, scope: !1204)
!1281 = !DILocation(line: 1611, column: 5, scope: !1204)
!1282 = !DILocation(line: 1612, column: 1, scope: !1204)
!1283 = distinct !DISubprogram(name: "http_seek", scope: !47, file: !47, line: 1714, type: !200, isLocal: true, isDefinition: true, scopeLine: 1715, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !422)
!1284 = !DILocalVariable(name: "h", arg: 1, scope: !1283, file: !47, line: 1714, type: !152)
!1285 = !DILocation(line: 1714, column: 38, scope: !1283)
!1286 = !DILocalVariable(name: "off", arg: 2, scope: !1283, file: !47, line: 1714, type: !93)
!1287 = !DILocation(line: 1714, column: 49, scope: !1283)
!1288 = !DILocalVariable(name: "whence", arg: 3, scope: !1283, file: !47, line: 1714, type: !87)
!1289 = !DILocation(line: 1714, column: 58, scope: !1283)
!1290 = !DILocation(line: 1716, column: 31, scope: !1283)
!1291 = !DILocation(line: 1716, column: 34, scope: !1283)
!1292 = !DILocation(line: 1716, column: 39, scope: !1283)
!1293 = !DILocation(line: 1716, column: 12, scope: !1283)
