; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--srtpproto.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--srtpproto.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !46)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--srtpproto.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!2 = !{!3, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !4, line: 221, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!6 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!7 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!8 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!9 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!10 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!11 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!12 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!13 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!14 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!15 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!16 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!17 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!18 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!19 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!20 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!21 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!22 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!23 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!24 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 29, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!28 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!29 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!30 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!31 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!32 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!33 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!34 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!35 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!36 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!37 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!38 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!39 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!40 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!41 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!42 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!43 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!44 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!45 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!46 = !{!47, !257, !258}
!47 = distinct !DIGlobalVariable(name: "ff_srtp_protocol", scope: !0, file: !48, line: 135, type: !49, isLocal: false, isDefinition: true, variable: { i8*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }* @ff_srtp_protocol)
!48 = !DIFile(filename: "libavformat/srtpproto.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !51, line: 100, baseType: !52)
!51 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !51, line: 54, size: 1600, align: 64, elements: !53)
!53 = !{!54, !58, !174, !183, !188, !192, !198, !204, !208, !209, !213, !217, !218, !224, !225, !226, !227, !228, !229, !230, !231, !250, !251, !252, !256}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !52, file: !51, line: 55, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !52, file: !51, line: 56, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !63, !55, !62}
!62 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !51, line: 52, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !51, line: 38, size: 768, align: 64, elements: !66)
!66 = !{!67, !150, !153, !154, !156, !157, !158, !159, !160, !170, !171, !172, !173}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !65, file: !51, line: 39, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !72)
!72 = !{!73, !74, !79, !109, !110, !111, !112, !116, !122, !124, !128}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !71, file: !26, line: 72, baseType: !55, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !71, file: !26, line: 78, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!55, !78}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !71, file: !26, line: 85, baseType: !80, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !105, !106, !107, !108}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !82, file: !4, line: 247, baseType: !55, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !82, file: !4, line: 253, baseType: !55, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !82, file: !4, line: 259, baseType: !62, size: 32, align: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !82, file: !4, line: 271, baseType: !89, size: 64, align: 64, offset: 192)
!89 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !82, file: !4, line: 265, size: 64, align: 64, elements: !90)
!90 = !{!91, !95, !97, !98}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !89, file: !4, line: 266, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !93, line: 40, baseType: !94)
!93 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!94 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !89, file: !4, line: 267, baseType: !96, size: 64, align: 64)
!96 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !89, file: !4, line: 268, baseType: !55, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !89, file: !4, line: 270, baseType: !99, size: 64, align: 32)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !100, line: 61, baseType: !101)
!100 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !100, line: 58, size: 64, align: 32, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !101, file: !100, line: 59, baseType: !62, size: 32, align: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !101, file: !100, line: 60, baseType: !62, size: 32, align: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !82, file: !4, line: 272, baseType: !96, size: 64, align: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !82, file: !4, line: 273, baseType: !96, size: 64, align: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !82, file: !4, line: 275, baseType: !62, size: 32, align: 32, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !82, file: !4, line: 300, baseType: !55, size: 64, align: 64, offset: 448)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !71, file: !26, line: 93, baseType: !62, size: 32, align: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !71, file: !26, line: 99, baseType: !62, size: 32, align: 32, offset: 224)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !71, file: !26, line: 108, baseType: !62, size: 32, align: 32, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !71, file: !26, line: 113, baseType: !113, size: 64, align: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!78, !78, !78}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !71, file: !26, line: 123, baseType: !117, size: 64, align: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!120, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !71, file: !26, line: 130, baseType: !123, size: 32, align: 32, offset: 448)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !71, file: !26, line: 136, baseType: !125, size: 64, align: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!123, !78}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !71, file: !26, line: 142, baseType: !129, size: 64, align: 64, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!62, !132, !78, !55, !62}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !135)
!135 = !{!136, !148, !149}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !134, file: !4, line: 360, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !140, file: !4, line: 307, baseType: !55, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !140, file: !4, line: 313, baseType: !96, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !140, file: !4, line: 313, baseType: !96, size: 64, align: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !140, file: !4, line: 318, baseType: !96, size: 64, align: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !140, file: !4, line: 318, baseType: !96, size: 64, align: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !140, file: !4, line: 323, baseType: !62, size: 32, align: 32, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !134, file: !4, line: 364, baseType: !62, size: 32, align: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !134, file: !4, line: 368, baseType: !62, size: 32, align: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !65, file: !51, line: 40, baseType: !151, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !65, file: !51, line: 41, baseType: !78, size: 64, align: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !65, file: !51, line: 42, baseType: !155, size: 64, align: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !65, file: !51, line: 43, baseType: !62, size: 32, align: 32, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !65, file: !51, line: 44, baseType: !62, size: 32, align: 32, offset: 288)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !65, file: !51, line: 45, baseType: !62, size: 32, align: 32, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !65, file: !51, line: 46, baseType: !62, size: 32, align: 32, offset: 352)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !65, file: !51, line: 47, baseType: !161, size: 128, align: 64, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !162, line: 61, baseType: !163)
!162 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !162, line: 58, size: 128, align: 64, elements: !164)
!164 = !{!165, !169}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !163, file: !162, line: 59, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!62, !78}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !163, file: !162, line: 60, baseType: !78, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !65, file: !51, line: 48, baseType: !92, size: 64, align: 64, offset: 512)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !65, file: !51, line: 49, baseType: !55, size: 64, align: 64, offset: 576)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !65, file: !51, line: 50, baseType: !55, size: 64, align: 64, offset: 640)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !65, file: !51, line: 51, baseType: !62, size: 32, align: 32, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !52, file: !51, line: 62, baseType: !175, size: 64, align: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!62, !63, !55, !62, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !181, line: 86, baseType: !182)
!181 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !181, line: 86, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !52, file: !51, line: 63, baseType: !184, size: 64, align: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!62, !63, !187}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !52, file: !51, line: 64, baseType: !189, size: 64, align: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!62, !63}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !52, file: !51, line: 78, baseType: !193, size: 64, align: 64, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!62, !63, !196, !62}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !52, file: !51, line: 79, baseType: !199, size: 64, align: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!62, !63, !202, !62}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !52, file: !51, line: 80, baseType: !205, size: 64, align: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!92, !63, !92, !62}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !52, file: !51, line: 81, baseType: !189, size: 64, align: 64, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !52, file: !51, line: 82, baseType: !210, size: 64, align: 64, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!62, !63, !62}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !52, file: !51, line: 83, baseType: !214, size: 64, align: 64, offset: 640)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!92, !63, !62, !92, !62}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !52, file: !51, line: 85, baseType: !189, size: 64, align: 64, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !52, file: !51, line: 86, baseType: !219, size: 64, align: 64, offset: 768)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!62, !63, !222, !223}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !52, file: !51, line: 88, baseType: !189, size: 64, align: 64, offset: 832)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !52, file: !51, line: 89, baseType: !210, size: 64, align: 64, offset: 896)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !52, file: !51, line: 90, baseType: !62, size: 32, align: 32, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !52, file: !51, line: 91, baseType: !68, size: 64, align: 64, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !52, file: !51, line: 92, baseType: !62, size: 32, align: 32, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !52, file: !51, line: 93, baseType: !210, size: 64, align: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !52, file: !51, line: 94, baseType: !189, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !52, file: !51, line: 95, baseType: !232, size: 64, align: 64, offset: 1280)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!62, !63, !235}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !162, line: 101, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !162, line: 86, size: 576, align: 64, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247, !248, !249}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !238, file: !162, line: 87, baseType: !155, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !238, file: !162, line: 88, baseType: !62, size: 32, align: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !238, file: !162, line: 89, baseType: !62, size: 32, align: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !238, file: !162, line: 91, baseType: !92, size: 64, align: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !238, file: !162, line: 92, baseType: !92, size: 64, align: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !238, file: !162, line: 94, baseType: !92, size: 64, align: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !238, file: !162, line: 96, baseType: !92, size: 64, align: 64, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !238, file: !162, line: 98, baseType: !92, size: 64, align: 64, offset: 384)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !238, file: !162, line: 99, baseType: !92, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !238, file: !162, line: 100, baseType: !92, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !52, file: !51, line: 96, baseType: !189, size: 64, align: 64, offset: 1344)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !52, file: !51, line: 97, baseType: !189, size: 64, align: 64, offset: 1408)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !52, file: !51, line: 98, baseType: !253, size: 64, align: 64, offset: 1472)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!62, !63, !63}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !52, file: !51, line: 99, baseType: !55, size: 64, align: 64, offset: 1536)
!257 = distinct !DIGlobalVariable(name: "srtp_context_class", scope: !0, file: !48, line: 50, type: !69, isLocal: true, isDefinition: true, variable: %struct.AVClass* @srtp_context_class)
!258 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !48, line: 42, type: !259, isLocal: true, isDefinition: true, variable: <{ { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption }>* @options)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 2560, align: 64, elements: !262)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !82)
!262 = !{!263}
!263 = !DISubrange(count: 5)
!264 = !{i32 2, !"Dwarf Version", i32 4}
!265 = !{i32 2, !"Debug Info Version", i32 3}
!266 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!267 = distinct !DISubprogram(name: "srtp_open", scope: !48, file: !48, line: 67, type: !60, isLocal: true, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !268)
!268 = !{}
!269 = !DILocalVariable(name: "h", arg: 1, scope: !267, file: !48, line: 67, type: !63)
!270 = !DIExpression()
!271 = !DILocation(line: 67, column: 34, scope: !267)
!272 = !DILocalVariable(name: "uri", arg: 2, scope: !267, file: !48, line: 67, type: !55)
!273 = !DILocation(line: 67, column: 49, scope: !267)
!274 = !DILocalVariable(name: "flags", arg: 3, scope: !267, file: !48, line: 67, type: !62)
!275 = !DILocation(line: 67, column: 58, scope: !267)
!276 = !DILocalVariable(name: "s", scope: !267, file: !48, line: 69, type: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "SRTPProtoContext", file: !48, line: 38, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SRTPProtoContext", file: !48, line: 31, size: 68736, align: 64, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !323, !324}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !279, file: !48, line: 32, baseType: !68, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_hd", scope: !279, file: !48, line: 33, baseType: !63, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "out_suite", scope: !279, file: !48, line: 34, baseType: !55, size: 64, align: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "out_params", scope: !279, file: !48, line: 34, baseType: !55, size: 64, align: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "in_suite", scope: !279, file: !48, line: 35, baseType: !55, size: 64, align: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "in_params", scope: !279, file: !48, line: 35, baseType: !55, size: 64, align: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "srtp_out", scope: !279, file: !48, line: 36, baseType: !288, size: 1408, align: 64, offset: 384)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SRTPContext", file: !289, line: 30, size: 1408, align: 64, elements: !290)
!289 = !DIFile(filename: "libavformat/srtp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!290 = !{!291, !294, !297, !298, !299, !304, !308, !309, !310, !311, !312, !316, !317, !318, !319, !322}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "aes", scope: !288, file: !289, line: 31, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVAES", file: !289, line: 27, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "hmac", scope: !288, file: !289, line: 32, baseType: !295, size: 64, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVHMAC", file: !289, line: 28, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_hmac_size", scope: !288, file: !289, line: 33, baseType: !62, size: 32, align: 32, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "rtcp_hmac_size", scope: !288, file: !289, line: 33, baseType: !62, size: 32, align: 32, offset: 160)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "master_key", scope: !288, file: !289, line: 34, baseType: !300, size: 128, align: 8, offset: 192)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 128, align: 8, elements: !302)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !93, line: 48, baseType: !197)
!302 = !{!303}
!303 = !DISubrange(count: 16)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "master_salt", scope: !288, file: !289, line: 35, baseType: !305, size: 112, align: 8, offset: 320)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 112, align: 8, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 14)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_key", scope: !288, file: !289, line: 36, baseType: !300, size: 128, align: 8, offset: 432)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "rtcp_key", scope: !288, file: !289, line: 36, baseType: !300, size: 128, align: 8, offset: 560)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_salt", scope: !288, file: !289, line: 37, baseType: !305, size: 112, align: 8, offset: 688)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "rtcp_salt", scope: !288, file: !289, line: 37, baseType: !305, size: 112, align: 8, offset: 800)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_auth", scope: !288, file: !289, line: 38, baseType: !313, size: 160, align: 8, offset: 912)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 160, align: 8, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 20)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "rtcp_auth", scope: !288, file: !289, line: 38, baseType: !313, size: 160, align: 8, offset: 1072)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "seq_largest", scope: !288, file: !289, line: 39, baseType: !62, size: 32, align: 32, offset: 1248)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "seq_initialized", scope: !288, file: !289, line: 39, baseType: !62, size: 32, align: 32, offset: 1280)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "roc", scope: !288, file: !289, line: 40, baseType: !320, size: 32, align: 32, offset: 1312)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !93, line: 51, baseType: !321)
!321 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "rtcp_index", scope: !288, file: !289, line: 42, baseType: !320, size: 32, align: 32, offset: 1344)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "srtp_in", scope: !279, file: !48, line: 36, baseType: !288, size: 1408, align: 64, offset: 1792)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "encryptbuf", scope: !279, file: !48, line: 37, baseType: !325, size: 65536, align: 8, offset: 3200)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 65536, align: 8, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 8192)
!328 = !DILocation(line: 69, column: 23, scope: !267)
!329 = !DILocation(line: 69, column: 27, scope: !267)
!330 = !DILocation(line: 69, column: 30, scope: !267)
!331 = !DILocalVariable(name: "hostname", scope: !267, file: !48, line: 70, type: !332)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 2048, align: 8, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 256)
!335 = !DILocation(line: 70, column: 10, scope: !267)
!336 = !DILocalVariable(name: "buf", scope: !267, file: !48, line: 70, type: !337)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8192, align: 8, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 1024)
!340 = !DILocation(line: 70, column: 25, scope: !267)
!341 = !DILocalVariable(name: "path", scope: !267, file: !48, line: 70, type: !337)
!342 = !DILocation(line: 70, column: 36, scope: !267)
!343 = !DILocalVariable(name: "rtp_port", scope: !267, file: !48, line: 71, type: !62)
!344 = !DILocation(line: 71, column: 9, scope: !267)
!345 = !DILocalVariable(name: "ret", scope: !267, file: !48, line: 71, type: !62)
!346 = !DILocation(line: 71, column: 19, scope: !267)
!347 = !DILocation(line: 73, column: 9, scope: !348)
!348 = distinct !DILexicalBlock(scope: !267, file: !48, line: 73, column: 9)
!349 = !DILocation(line: 73, column: 12, scope: !348)
!350 = !DILocation(line: 73, column: 22, scope: !348)
!351 = !DILocation(line: 73, column: 25, scope: !352)
!352 = !DILexicalBlockFile(scope: !348, file: !48, discriminator: 1)
!353 = !DILocation(line: 73, column: 28, scope: !352)
!354 = !DILocation(line: 73, column: 9, scope: !352)
!355 = !DILocation(line: 74, column: 40, scope: !356)
!356 = distinct !DILexicalBlock(scope: !348, file: !48, line: 74, column: 13)
!357 = !DILocation(line: 74, column: 43, scope: !356)
!358 = !DILocation(line: 74, column: 53, scope: !356)
!359 = !DILocation(line: 74, column: 56, scope: !356)
!360 = !DILocation(line: 74, column: 67, scope: !356)
!361 = !DILocation(line: 74, column: 70, scope: !356)
!362 = !DILocation(line: 74, column: 20, scope: !356)
!363 = !DILocation(line: 74, column: 18, scope: !356)
!364 = !DILocation(line: 74, column: 83, scope: !356)
!365 = !DILocation(line: 74, column: 13, scope: !348)
!366 = !DILocation(line: 75, column: 13, scope: !356)
!367 = !DILocation(line: 74, column: 85, scope: !368)
!368 = !DILexicalBlockFile(scope: !356, file: !48, discriminator: 1)
!369 = !DILocation(line: 76, column: 9, scope: !370)
!370 = distinct !DILexicalBlock(scope: !267, file: !48, line: 76, column: 9)
!371 = !DILocation(line: 76, column: 12, scope: !370)
!372 = !DILocation(line: 76, column: 21, scope: !370)
!373 = !DILocation(line: 76, column: 24, scope: !374)
!374 = !DILexicalBlockFile(scope: !370, file: !48, discriminator: 1)
!375 = !DILocation(line: 76, column: 27, scope: !374)
!376 = !DILocation(line: 76, column: 9, scope: !374)
!377 = !DILocation(line: 77, column: 40, scope: !378)
!378 = distinct !DILexicalBlock(scope: !370, file: !48, line: 77, column: 13)
!379 = !DILocation(line: 77, column: 43, scope: !378)
!380 = !DILocation(line: 77, column: 52, scope: !378)
!381 = !DILocation(line: 77, column: 55, scope: !378)
!382 = !DILocation(line: 77, column: 65, scope: !378)
!383 = !DILocation(line: 77, column: 68, scope: !378)
!384 = !DILocation(line: 77, column: 20, scope: !378)
!385 = !DILocation(line: 77, column: 18, scope: !378)
!386 = !DILocation(line: 77, column: 80, scope: !378)
!387 = !DILocation(line: 77, column: 13, scope: !370)
!388 = !DILocation(line: 78, column: 13, scope: !378)
!389 = !DILocation(line: 77, column: 82, scope: !390)
!390 = !DILexicalBlockFile(scope: !378, file: !48, discriminator: 1)
