; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpenc_aac.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpenc_aac.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFormatContext = type { %struct.AVClass*, %struct.AVInputFormat*, %struct.AVOutputFormat*, i8*, %struct.AVIOContext*, i32, i32, %struct.AVStream**, [1024 x i8], i8*, i64, i64, i64, i32, i32, i32, i64, i64, i8*, i32, i32, %struct.AVProgram**, i32, i32, i32, i32, i32, i32, %struct.AVChapter**, %struct.AVDictionary*, i64, i32, i32, %struct.AVIOInterruptCB, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i8*, i8*, %struct.AVFormatInternal*, i32, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, i32, i8*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i64, i8*, i32, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVIOInterruptCB*, %struct.AVDictionary**)*, i8*, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVDictionary**)*, void (%struct.AVFormatContext*, %struct.AVIOContext*)*, i8*, i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }

!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !25, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !25, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !919, line: 222, size: 16, align: 8, elements: !920)
!919 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!920 = !{!921}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !918, file: !919, line: 222, baseType: !922, size: 16, align: 16)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !923, line: 49, baseType: !924)
!923 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!924 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!925 = !{i32 2, !"Dwarf Version", i32 4}
!926 = !{i32 2, !"Debug Info Version", i32 3}
!927 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!928 = distinct !DISubprogram(name: "ff_rtp_send_aac", scope: !929, file: !929, line: 27, type: !930, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2061)
!929 = !DIFile(filename: "libavformat/rtpenc_aac.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!930 = !DISubroutineType(types: !931)
!931 = !{null, !932, !1271, !956}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !935)
!935 = !{!936, !982, !1091, !1240, !1241, !1306, !1307, !1308, !1938, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1992, !1993, !1994, !1995, !1996, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2027, !2028, !2031, !2032, !2033, !2034, !2035, !2036, !2038, !2039, !2040, !2041, !2049, !2050, !2054, !2058, !2059, !2060}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !934, file: !897, line: 1342, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !941)
!941 = !{!942, !946, !951, !955, !957, !958, !959, !963, !969, !971, !975}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !940, file: !4, line: 72, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !940, file: !4, line: 78, baseType: !947, size: 64, align: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!943, !950}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !940, file: !4, line: 85, baseType: !952, size: 64, align: 64, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !940, file: !4, line: 93, baseType: !956, size: 32, align: 32, offset: 192)
!956 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !940, file: !4, line: 99, baseType: !956, size: 32, align: 32, offset: 224)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !940, file: !4, line: 108, baseType: !956, size: 32, align: 32, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !940, file: !4, line: 113, baseType: !960, size: 64, align: 64, offset: 320)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!950, !950, !950}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !940, file: !4, line: 123, baseType: !964, size: 64, align: 64, offset: 384)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!967, !967}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !940, file: !4, line: 130, baseType: !970, size: 32, align: 32, offset: 448)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !940, file: !4, line: 136, baseType: !972, size: 64, align: 64, offset: 512)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!970, !950}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !940, file: !4, line: 142, baseType: !976, size: 64, align: 64, offset: 576)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!956, !979, !950, !943, !956}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !934, file: !897, line: 1349, baseType: !983, size: 64, align: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !985)
!985 = !{!986, !987, !988, !989, !990, !996, !997, !998, !999, !1000, !1001, !1015, !1020, !1062, !1063, !1067, !1072, !1073, !1074, !1078, !1084, !1090}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !984, file: !897, line: 638, baseType: !943, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !984, file: !897, line: 645, baseType: !943, size: 64, align: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !984, file: !897, line: 652, baseType: !956, size: 32, align: 32, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !984, file: !897, line: 659, baseType: !943, size: 64, align: 64, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !984, file: !897, line: 661, baseType: !991, size: 64, align: 64, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !897, line: 443, flags: DIFlagFwdDecl)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !984, file: !897, line: 663, baseType: !937, size: 64, align: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !984, file: !897, line: 670, baseType: !943, size: 64, align: 64, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !984, file: !897, line: 679, baseType: !983, size: 64, align: 64, offset: 448)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !984, file: !897, line: 684, baseType: !956, size: 32, align: 32, offset: 512)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !984, file: !897, line: 689, baseType: !956, size: 32, align: 32, offset: 544)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !984, file: !897, line: 696, baseType: !1002, size: 64, align: 64, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!956, !1005}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1008)
!1008 = !{!1009, !1010, !1013, !1014}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1007, file: !897, line: 449, baseType: !943, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1007, file: !897, line: 450, baseType: !1011, size: 64, align: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1007, file: !897, line: 451, baseType: !956, size: 32, align: 32, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1007, file: !897, line: 452, baseType: !943, size: 64, align: 64, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !984, file: !897, line: 703, baseType: !1016, size: 64, align: 64, offset: 640)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!956, !1019}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !984, file: !897, line: 714, baseType: !1021, size: 64, align: 64, offset: 704)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!956, !1019, !1024}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !25, line: 1499, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !25, line: 1445, size: 704, align: 64, elements: !1027)
!1027 = !{!1028, !1042, !1045, !1046, !1047, !1048, !1049, !1050, !1058, !1059, !1060, !1061}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1026, file: !25, line: 1451, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1031, line: 94, baseType: !1032)
!1031 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1031, line: 81, size: 192, align: 64, elements: !1033)
!1033 = !{!1034, !1038, !1041}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1032, file: !1031, line: 82, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1031, line: 73, baseType: !1037)
!1037 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1031, line: 73, flags: DIFlagFwdDecl)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1032, file: !1031, line: 89, baseType: !1039, size: 64, align: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !923, line: 48, baseType: !1012)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1032, file: !1031, line: 93, baseType: !956, size: 32, align: 32, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1026, file: !25, line: 1461, baseType: !1043, size: 64, align: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !923, line: 40, baseType: !1044)
!1044 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1026, file: !25, line: 1467, baseType: !1043, size: 64, align: 64, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1026, file: !25, line: 1468, baseType: !1039, size: 64, align: 64, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1026, file: !25, line: 1469, baseType: !956, size: 32, align: 32, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1026, file: !25, line: 1470, baseType: !956, size: 32, align: 32, offset: 288)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1026, file: !25, line: 1474, baseType: !956, size: 32, align: 32, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1026, file: !25, line: 1479, baseType: !1051, size: 64, align: 64, offset: 384)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !25, line: 1415, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !25, line: 1411, size: 128, align: 64, elements: !1054)
!1054 = !{!1055, !1056, !1057}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1053, file: !25, line: 1412, baseType: !1039, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1053, file: !25, line: 1413, baseType: !956, size: 32, align: 32, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1053, file: !25, line: 1414, baseType: !24, size: 32, align: 32, offset: 96)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1026, file: !25, line: 1480, baseType: !956, size: 32, align: 32, offset: 448)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1026, file: !25, line: 1486, baseType: !1043, size: 64, align: 64, offset: 512)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1026, file: !25, line: 1488, baseType: !1043, size: 64, align: 64, offset: 576)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1026, file: !25, line: 1497, baseType: !1043, size: 64, align: 64, offset: 640)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !984, file: !897, line: 720, baseType: !1016, size: 64, align: 64, offset: 768)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !984, file: !897, line: 730, baseType: !1064, size: 64, align: 64, offset: 832)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!956, !1019, !956, !1043, !956}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !984, file: !897, line: 737, baseType: !1068, size: 64, align: 64, offset: 896)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!1043, !1019, !956, !1071, !1043}
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !984, file: !897, line: 744, baseType: !1016, size: 64, align: 64, offset: 960)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !984, file: !897, line: 750, baseType: !1016, size: 64, align: 64, offset: 1024)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !984, file: !897, line: 758, baseType: !1075, size: 64, align: 64, offset: 1088)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!956, !1019, !956, !1043, !1043, !1043, !956}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !984, file: !897, line: 764, baseType: !1079, size: 64, align: 64, offset: 1152)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!956, !1019, !1082}
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !984, file: !897, line: 770, baseType: !1085, size: 64, align: 64, offset: 1216)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!956, !1019, !1088}
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !984, file: !897, line: 776, baseType: !1085, size: 64, align: 64, offset: 1280)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !934, file: !897, line: 1356, baseType: !1092, size: 64, align: 64, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1094)
!1094 = !{!1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1114, !1118, !1122, !1129, !1225, !1226, !1227, !1228, !1229, !1230, !1234}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1093, file: !897, line: 498, baseType: !943, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1093, file: !897, line: 504, baseType: !943, size: 64, align: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1093, file: !897, line: 505, baseType: !943, size: 64, align: 64, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1093, file: !897, line: 506, baseType: !943, size: 64, align: 64, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1093, file: !897, line: 508, baseType: !55, size: 32, align: 32, offset: 256)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1093, file: !897, line: 509, baseType: !55, size: 32, align: 32, offset: 288)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1093, file: !897, line: 510, baseType: !55, size: 32, align: 32, offset: 320)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1093, file: !897, line: 517, baseType: !956, size: 32, align: 32, offset: 352)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1093, file: !897, line: 523, baseType: !991, size: 64, align: 64, offset: 384)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1093, file: !897, line: 526, baseType: !937, size: 64, align: 64, offset: 448)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1093, file: !897, line: 535, baseType: !1092, size: 64, align: 64, offset: 512)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1093, file: !897, line: 539, baseType: !956, size: 32, align: 32, offset: 576)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1093, file: !897, line: 541, baseType: !1016, size: 64, align: 64, offset: 640)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1093, file: !897, line: 549, baseType: !1021, size: 64, align: 64, offset: 704)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1093, file: !897, line: 550, baseType: !1016, size: 64, align: 64, offset: 768)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1093, file: !897, line: 554, baseType: !1111, size: 64, align: 64, offset: 832)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!956, !1019, !1024, !1024, !956}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1093, file: !897, line: 563, baseType: !1115, size: 64, align: 64, offset: 896)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!956, !55, !956}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1093, file: !897, line: 565, baseType: !1119, size: 64, align: 64, offset: 960)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{null, !1019, !956, !1071, !1071}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1093, file: !897, line: 570, baseType: !1123, size: 64, align: 64, offset: 1024)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!956, !1019, !956, !950, !1126}
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1127, line: 216, baseType: !1128)
!1127 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1128 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1093, file: !897, line: 581, baseType: !1130, size: 64, align: 64, offset: 1088)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!956, !1019, !956, !1133, !1224}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1136)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1137)
!1137 = !{!1138, !1142, !1144, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1178, !1180, !1181, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1136, file: !526, line: 282, baseType: !1139, size: 512, align: 64)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 512, align: 64, elements: !1140)
!1140 = !{!1141}
!1141 = !DISubrange(count: 8)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1136, file: !526, line: 299, baseType: !1143, size: 256, align: 32, offset: 512)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 256, align: 32, elements: !1140)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1136, file: !526, line: 315, baseType: !1145, size: 64, align: 64, offset: 768)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1136, file: !526, line: 326, baseType: !956, size: 32, align: 32, offset: 832)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1136, file: !526, line: 326, baseType: !956, size: 32, align: 32, offset: 864)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1136, file: !526, line: 334, baseType: !956, size: 32, align: 32, offset: 896)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1136, file: !526, line: 341, baseType: !956, size: 32, align: 32, offset: 928)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1136, file: !526, line: 346, baseType: !956, size: 32, align: 32, offset: 960)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1136, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1136, file: !526, line: 356, baseType: !1153, size: 64, align: 32, offset: 1024)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1154, line: 61, baseType: !1155)
!1154 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1154, line: 58, size: 64, align: 32, elements: !1156)
!1156 = !{!1157, !1158}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1155, file: !1154, line: 59, baseType: !956, size: 32, align: 32)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1155, file: !1154, line: 60, baseType: !956, size: 32, align: 32, offset: 32)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1136, file: !526, line: 361, baseType: !1043, size: 64, align: 64, offset: 1088)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1136, file: !526, line: 369, baseType: !1043, size: 64, align: 64, offset: 1152)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1136, file: !526, line: 377, baseType: !1043, size: 64, align: 64, offset: 1216)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1136, file: !526, line: 382, baseType: !956, size: 32, align: 32, offset: 1280)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1136, file: !526, line: 386, baseType: !956, size: 32, align: 32, offset: 1312)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1136, file: !526, line: 391, baseType: !956, size: 32, align: 32, offset: 1344)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1136, file: !526, line: 396, baseType: !950, size: 64, align: 64, offset: 1408)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1136, file: !526, line: 403, baseType: !1167, size: 512, align: 64, offset: 1472)
!1167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1168, size: 512, align: 64, elements: !1140)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !923, line: 55, baseType: !1128)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1136, file: !526, line: 410, baseType: !956, size: 32, align: 32, offset: 1984)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1136, file: !526, line: 415, baseType: !956, size: 32, align: 32, offset: 2016)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1136, file: !526, line: 420, baseType: !956, size: 32, align: 32, offset: 2048)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1136, file: !526, line: 425, baseType: !956, size: 32, align: 32, offset: 2080)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1136, file: !526, line: 435, baseType: !1043, size: 64, align: 64, offset: 2112)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1136, file: !526, line: 440, baseType: !956, size: 32, align: 32, offset: 2176)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1136, file: !526, line: 445, baseType: !1168, size: 64, align: 64, offset: 2240)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1136, file: !526, line: 459, baseType: !1177, size: 512, align: 64, offset: 2304)
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 512, align: 64, elements: !1140)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1136, file: !526, line: 473, baseType: !1179, size: 64, align: 64, offset: 2816)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1136, file: !526, line: 477, baseType: !956, size: 32, align: 32, offset: 2880)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1136, file: !526, line: 479, baseType: !1182, size: 64, align: 64, offset: 2944)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1186)
!1186 = !{!1187, !1188, !1189, !1190, !1195}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1185, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1185, file: !526, line: 203, baseType: !1039, size: 64, align: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1185, file: !526, line: 204, baseType: !956, size: 32, align: 32, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1185, file: !526, line: 205, baseType: !1191, size: 64, align: 64, offset: 192)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1193, line: 86, baseType: !1194)
!1193 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1194 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1193, line: 86, flags: DIFlagFwdDecl)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1185, file: !526, line: 206, baseType: !1029, size: 64, align: 64, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1136, file: !526, line: 480, baseType: !956, size: 32, align: 32, offset: 3008)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1136, file: !526, line: 505, baseType: !956, size: 32, align: 32, offset: 3040)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1136, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1136, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1136, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1136, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1136, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1136, file: !526, line: 532, baseType: !1043, size: 64, align: 64, offset: 3264)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1136, file: !526, line: 539, baseType: !1043, size: 64, align: 64, offset: 3328)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1136, file: !526, line: 547, baseType: !1043, size: 64, align: 64, offset: 3392)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1136, file: !526, line: 554, baseType: !1191, size: 64, align: 64, offset: 3456)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1136, file: !526, line: 563, baseType: !956, size: 32, align: 32, offset: 3520)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1136, file: !526, line: 572, baseType: !956, size: 32, align: 32, offset: 3552)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1136, file: !526, line: 581, baseType: !956, size: 32, align: 32, offset: 3584)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1136, file: !526, line: 588, baseType: !1211, size: 64, align: 64, offset: 3648)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !923, line: 36, baseType: !1213)
!1213 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1136, file: !526, line: 593, baseType: !956, size: 32, align: 32, offset: 3712)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1136, file: !526, line: 596, baseType: !956, size: 32, align: 32, offset: 3744)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1136, file: !526, line: 599, baseType: !1029, size: 64, align: 64, offset: 3776)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1136, file: !526, line: 605, baseType: !1029, size: 64, align: 64, offset: 3840)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1136, file: !526, line: 616, baseType: !1029, size: 64, align: 64, offset: 3904)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1136, file: !526, line: 626, baseType: !1126, size: 64, align: 64, offset: 3968)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1136, file: !526, line: 627, baseType: !1126, size: 64, align: 64, offset: 4032)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1136, file: !526, line: 628, baseType: !1126, size: 64, align: 64, offset: 4096)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1136, file: !526, line: 629, baseType: !1126, size: 64, align: 64, offset: 4160)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1136, file: !526, line: 645, baseType: !1029, size: 64, align: 64, offset: 4224)
!1224 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1093, file: !897, line: 587, baseType: !1079, size: 64, align: 64, offset: 1152)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1093, file: !897, line: 592, baseType: !1085, size: 64, align: 64, offset: 1216)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1093, file: !897, line: 597, baseType: !1085, size: 64, align: 64, offset: 1280)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1093, file: !897, line: 598, baseType: !55, size: 32, align: 32, offset: 1344)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1093, file: !897, line: 608, baseType: !1016, size: 64, align: 64, offset: 1408)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1093, file: !897, line: 617, baseType: !1231, size: 64, align: 64, offset: 1472)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{null, !1019}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1093, file: !897, line: 623, baseType: !1235, size: 64, align: 64, offset: 1536)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!956, !1019, !1238}
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !934, file: !897, line: 1365, baseType: !950, size: 64, align: 64, offset: 192)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !934, file: !897, line: 1379, baseType: !1242, size: 64, align: 64, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1244)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1245)
!1245 = !{!1246, !1247, !1248, !1249, !1250, !1251, !1252, !1256, !1257, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1273, !1274, !1278, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1296, !1297, !1298, !1299, !1303, !1304, !1305}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1244, file: !628, line: 174, baseType: !937, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1244, file: !628, line: 226, baseType: !1011, size: 64, align: 64, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1244, file: !628, line: 227, baseType: !956, size: 32, align: 32, offset: 128)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1244, file: !628, line: 228, baseType: !1011, size: 64, align: 64, offset: 192)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1244, file: !628, line: 229, baseType: !1011, size: 64, align: 64, offset: 256)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1244, file: !628, line: 233, baseType: !950, size: 64, align: 64, offset: 320)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1244, file: !628, line: 235, baseType: !1253, size: 64, align: 64, offset: 384)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!956, !950, !1039, !956}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1244, file: !628, line: 236, baseType: !1253, size: 64, align: 64, offset: 448)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1244, file: !628, line: 237, baseType: !1258, size: 64, align: 64, offset: 512)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!1043, !950, !1043, !956}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1244, file: !628, line: 238, baseType: !1043, size: 64, align: 64, offset: 576)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1244, file: !628, line: 239, baseType: !956, size: 32, align: 32, offset: 640)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1244, file: !628, line: 240, baseType: !956, size: 32, align: 32, offset: 672)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1244, file: !628, line: 241, baseType: !956, size: 32, align: 32, offset: 704)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1244, file: !628, line: 242, baseType: !1128, size: 64, align: 64, offset: 768)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1244, file: !628, line: 243, baseType: !1011, size: 64, align: 64, offset: 832)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1244, file: !628, line: 244, baseType: !1268, size: 64, align: 64, offset: 896)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!1128, !1128, !1271, !1224}
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1244, file: !628, line: 245, baseType: !956, size: 32, align: 32, offset: 960)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1244, file: !628, line: 249, baseType: !1275, size: 64, align: 64, offset: 1024)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!956, !950, !956}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1244, file: !628, line: 255, baseType: !1279, size: 64, align: 64, offset: 1088)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!1043, !950, !956, !1043, !956}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1244, file: !628, line: 260, baseType: !956, size: 32, align: 32, offset: 1152)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1244, file: !628, line: 266, baseType: !1043, size: 64, align: 64, offset: 1216)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1244, file: !628, line: 273, baseType: !956, size: 32, align: 32, offset: 1280)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1244, file: !628, line: 279, baseType: !1043, size: 64, align: 64, offset: 1344)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1244, file: !628, line: 285, baseType: !956, size: 32, align: 32, offset: 1408)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1244, file: !628, line: 291, baseType: !956, size: 32, align: 32, offset: 1440)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1244, file: !628, line: 298, baseType: !956, size: 32, align: 32, offset: 1472)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1244, file: !628, line: 304, baseType: !956, size: 32, align: 32, offset: 1504)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1244, file: !628, line: 309, baseType: !943, size: 64, align: 64, offset: 1536)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1244, file: !628, line: 314, baseType: !943, size: 64, align: 64, offset: 1600)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1244, file: !628, line: 319, baseType: !1293, size: 64, align: 64, offset: 1664)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!956, !950, !1039, !956, !627, !1043}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1244, file: !628, line: 326, baseType: !956, size: 32, align: 32, offset: 1728)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1244, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1244, file: !628, line: 332, baseType: !1043, size: 64, align: 64, offset: 1792)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1244, file: !628, line: 338, baseType: !1300, size: 64, align: 64, offset: 1856)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!956, !950}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1244, file: !628, line: 340, baseType: !1043, size: 64, align: 64, offset: 1920)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1244, file: !628, line: 346, baseType: !1011, size: 64, align: 64, offset: 1984)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1244, file: !628, line: 351, baseType: !956, size: 32, align: 32, offset: 2048)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !934, file: !897, line: 1386, baseType: !956, size: 32, align: 32, offset: 320)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !934, file: !897, line: 1393, baseType: !1224, size: 32, align: 32, offset: 352)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !934, file: !897, line: 1405, baseType: !1309, size: 64, align: 64, offset: 384)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1312)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1313)
!1313 = !{!1314, !1315, !1316, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1785, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1886, !1892, !1893, !1897, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1929, !1930, !1931, !1932, !1933, !1934}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1312, file: !897, line: 866, baseType: !956, size: 32, align: 32)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1312, file: !897, line: 872, baseType: !956, size: 32, align: 32, offset: 32)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1312, file: !897, line: 878, baseType: !1317, size: 64, align: 64, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !25, line: 3360, baseType: !1319)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !25, line: 1556, size: 8448, align: 64, elements: !1320)
!1320 = !{!1321, !1322, !1323, !1324, !1460, !1461, !1462, !1463, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1489, !1493, !1494, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1673, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1319, file: !25, line: 1561, baseType: !937, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1319, file: !25, line: 1562, baseType: !956, size: 32, align: 32, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1319, file: !25, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1319, file: !25, line: 1565, baseType: !1325, size: 64, align: 64, offset: 128)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1327)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !25, line: 3468, size: 1984, align: 64, elements: !1328)
!1328 = !{!1329, !1330, !1331, !1332, !1333, !1334, !1337, !1340, !1343, !1346, !1349, !1350, !1351, !1359, !1360, !1361, !1363, !1367, !1373, !1378, !1382, !1383, !1425, !1432, !1436, !1437, !1441, !1445, !1449, !1453, !1454, !1455}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1327, file: !25, line: 3475, baseType: !943, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1327, file: !25, line: 3480, baseType: !943, size: 64, align: 64, offset: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1327, file: !25, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1327, file: !25, line: 3482, baseType: !55, size: 32, align: 32, offset: 160)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1327, file: !25, line: 3487, baseType: !956, size: 32, align: 32, offset: 192)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1327, file: !25, line: 3488, baseType: !1335, size: 64, align: 64, offset: 256)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1153)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1327, file: !25, line: 3489, baseType: !1338, size: 64, align: 64, offset: 320)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1327, file: !25, line: 3490, baseType: !1341, size: 64, align: 64, offset: 384)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1327, file: !25, line: 3491, baseType: !1344, size: 64, align: 64, offset: 448)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1327, file: !25, line: 3492, baseType: !1347, size: 64, align: 64, offset: 512)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1168)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1327, file: !25, line: 3493, baseType: !1040, size: 8, align: 8, offset: 576)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1327, file: !25, line: 3494, baseType: !937, size: 64, align: 64, offset: 640)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1327, file: !25, line: 3495, baseType: !1352, size: 64, align: 64, offset: 704)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1354)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !25, line: 3404, baseType: !1355)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !25, line: 3401, size: 128, align: 64, elements: !1356)
!1356 = !{!1357, !1358}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1355, file: !25, line: 3402, baseType: !956, size: 32, align: 32)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1355, file: !25, line: 3403, baseType: !943, size: 64, align: 64, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1327, file: !25, line: 3507, baseType: !943, size: 64, align: 64, offset: 768)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1327, file: !25, line: 3516, baseType: !956, size: 32, align: 32, offset: 832)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1327, file: !25, line: 3517, baseType: !1362, size: 64, align: 64, offset: 896)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1327, file: !25, line: 3527, baseType: !1364, size: 64, align: 64, offset: 960)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DISubroutineType(types: !1366)
!1366 = !{!956, !1317}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1327, file: !25, line: 3535, baseType: !1368, size: 64, align: 64, offset: 1024)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DISubroutineType(types: !1370)
!1370 = !{!956, !1317, !1371}
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1318)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1327, file: !25, line: 3541, baseType: !1374, size: 64, align: 64, offset: 1088)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1376)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !25, line: 3461, baseType: !1377)
!1377 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !25, line: 3461, flags: DIFlagFwdDecl)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1327, file: !25, line: 3549, baseType: !1379, size: 64, align: 64, offset: 1152)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DISubroutineType(types: !1381)
!1381 = !{null, !1362}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1327, file: !25, line: 3551, baseType: !1364, size: 64, align: 64, offset: 1216)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1327, file: !25, line: 3552, baseType: !1384, size: 64, align: 64, offset: 1280)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DISubroutineType(types: !1386)
!1386 = !{!956, !1317, !1039, !956, !1387}
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1389)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !25, line: 3920, size: 256, align: 64, elements: !1390)
!1390 = !{!1391, !1392, !1394, !1395, !1396, !1424}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1389, file: !25, line: 3921, baseType: !922, size: 16, align: 16)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1389, file: !25, line: 3922, baseType: !1393, size: 32, align: 32, offset: 32)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !923, line: 51, baseType: !1224)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1389, file: !25, line: 3923, baseType: !1393, size: 32, align: 32, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1389, file: !25, line: 3924, baseType: !1224, size: 32, align: 32, offset: 96)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1389, file: !25, line: 3925, baseType: !1397, size: 64, align: 64, offset: 128)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !25, line: 3918, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !25, line: 3885, size: 1600, align: 64, elements: !1401)
!1401 = !{!1402, !1403, !1404, !1405, !1406, !1407, !1413, !1417, !1419, !1420, !1422, !1423}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1400, file: !25, line: 3886, baseType: !956, size: 32, align: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1400, file: !25, line: 3887, baseType: !956, size: 32, align: 32, offset: 32)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1400, file: !25, line: 3888, baseType: !956, size: 32, align: 32, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1400, file: !25, line: 3889, baseType: !956, size: 32, align: 32, offset: 96)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1400, file: !25, line: 3890, baseType: !956, size: 32, align: 32, offset: 128)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1400, file: !25, line: 3897, baseType: !1408, size: 768, align: 64, offset: 192)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !25, line: 3858, baseType: !1409)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !25, line: 3853, size: 768, align: 64, elements: !1410)
!1410 = !{!1411, !1412}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1409, file: !25, line: 3855, baseType: !1139, size: 512, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1409, file: !25, line: 3857, baseType: !1143, size: 256, align: 32, offset: 512)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1400, file: !25, line: 3903, baseType: !1414, size: 256, align: 64, offset: 960)
!1414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 256, align: 64, elements: !1415)
!1415 = !{!1416}
!1416 = !DISubrange(count: 4)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1400, file: !25, line: 3904, baseType: !1418, size: 128, align: 32, offset: 1216)
!1418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 128, align: 32, elements: !1415)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1400, file: !25, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1400, file: !25, line: 3908, baseType: !1421, size: 64, align: 64, offset: 1408)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1400, file: !25, line: 3915, baseType: !1421, size: 64, align: 64, offset: 1472)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1400, file: !25, line: 3917, baseType: !956, size: 32, align: 32, offset: 1536)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1389, file: !25, line: 3926, baseType: !1043, size: 64, align: 64, offset: 192)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1327, file: !25, line: 3564, baseType: !1426, size: 64, align: 64, offset: 1344)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DISubroutineType(types: !1428)
!1428 = !{!956, !1317, !1024, !1429, !1431}
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1135)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1327, file: !25, line: 3566, baseType: !1433, size: 64, align: 64, offset: 1408)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DISubroutineType(types: !1435)
!1435 = !{!956, !1317, !950, !1431, !1024}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1327, file: !25, line: 3567, baseType: !1364, size: 64, align: 64, offset: 1472)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1327, file: !25, line: 3576, baseType: !1438, size: 64, align: 64, offset: 1536)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DISubroutineType(types: !1440)
!1440 = !{!956, !1317, !1429}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1327, file: !25, line: 3577, baseType: !1442, size: 64, align: 64, offset: 1600)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{!956, !1317, !1024}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1327, file: !25, line: 3584, baseType: !1446, size: 64, align: 64, offset: 1664)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DISubroutineType(types: !1448)
!1448 = !{!956, !1317, !1134}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1327, file: !25, line: 3589, baseType: !1450, size: 64, align: 64, offset: 1728)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DISubroutineType(types: !1452)
!1452 = !{null, !1317}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1327, file: !25, line: 3594, baseType: !956, size: 32, align: 32, offset: 1792)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1327, file: !25, line: 3600, baseType: !943, size: 64, align: 64, offset: 1856)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1327, file: !25, line: 3609, baseType: !1456, size: 64, align: 64, offset: 1920)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1459)
!1459 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !25, line: 3609, flags: DIFlagFwdDecl)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1319, file: !25, line: 1566, baseType: !55, size: 32, align: 32, offset: 192)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1319, file: !25, line: 1581, baseType: !1224, size: 32, align: 32, offset: 224)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1319, file: !25, line: 1583, baseType: !950, size: 64, align: 64, offset: 256)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1319, file: !25, line: 1591, baseType: !1464, size: 64, align: 64, offset: 320)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !25, line: 1532, flags: DIFlagFwdDecl)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1319, file: !25, line: 1598, baseType: !950, size: 64, align: 64, offset: 384)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1319, file: !25, line: 1606, baseType: !1043, size: 64, align: 64, offset: 448)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1319, file: !25, line: 1614, baseType: !956, size: 32, align: 32, offset: 512)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1319, file: !25, line: 1622, baseType: !956, size: 32, align: 32, offset: 544)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1319, file: !25, line: 1628, baseType: !956, size: 32, align: 32, offset: 576)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1319, file: !25, line: 1636, baseType: !956, size: 32, align: 32, offset: 608)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1319, file: !25, line: 1643, baseType: !956, size: 32, align: 32, offset: 640)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1319, file: !25, line: 1657, baseType: !1039, size: 64, align: 64, offset: 704)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1319, file: !25, line: 1658, baseType: !956, size: 32, align: 32, offset: 768)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1319, file: !25, line: 1679, baseType: !1153, size: 64, align: 32, offset: 800)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1319, file: !25, line: 1688, baseType: !956, size: 32, align: 32, offset: 864)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1319, file: !25, line: 1712, baseType: !956, size: 32, align: 32, offset: 896)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1319, file: !25, line: 1729, baseType: !956, size: 32, align: 32, offset: 928)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1319, file: !25, line: 1729, baseType: !956, size: 32, align: 32, offset: 960)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1319, file: !25, line: 1744, baseType: !956, size: 32, align: 32, offset: 992)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1319, file: !25, line: 1744, baseType: !956, size: 32, align: 32, offset: 1024)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1319, file: !25, line: 1751, baseType: !956, size: 32, align: 32, offset: 1056)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1319, file: !25, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1319, file: !25, line: 1791, baseType: !1485, size: 64, align: 64, offset: 1152)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{null, !1488, !1429, !1431, !956, !956, !956}
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1319, file: !25, line: 1808, baseType: !1490, size: 64, align: 64, offset: 1216)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{!645, !1488, !1338}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1319, file: !25, line: 1816, baseType: !956, size: 32, align: 32, offset: 1280)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1319, file: !25, line: 1825, baseType: !1495, size: 32, align: 32, offset: 1312)
!1495 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1319, file: !25, line: 1830, baseType: !956, size: 32, align: 32, offset: 1344)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1319, file: !25, line: 1838, baseType: !1495, size: 32, align: 32, offset: 1376)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1319, file: !25, line: 1846, baseType: !956, size: 32, align: 32, offset: 1408)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1319, file: !25, line: 1851, baseType: !956, size: 32, align: 32, offset: 1440)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1319, file: !25, line: 1861, baseType: !1495, size: 32, align: 32, offset: 1472)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1319, file: !25, line: 1868, baseType: !1495, size: 32, align: 32, offset: 1504)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1319, file: !25, line: 1875, baseType: !1495, size: 32, align: 32, offset: 1536)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1319, file: !25, line: 1882, baseType: !1495, size: 32, align: 32, offset: 1568)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1319, file: !25, line: 1889, baseType: !1495, size: 32, align: 32, offset: 1600)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1319, file: !25, line: 1896, baseType: !1495, size: 32, align: 32, offset: 1632)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1319, file: !25, line: 1903, baseType: !1495, size: 32, align: 32, offset: 1664)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1319, file: !25, line: 1910, baseType: !956, size: 32, align: 32, offset: 1696)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1319, file: !25, line: 1915, baseType: !956, size: 32, align: 32, offset: 1728)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1319, file: !25, line: 1926, baseType: !1431, size: 64, align: 64, offset: 1792)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1319, file: !25, line: 1935, baseType: !1153, size: 64, align: 32, offset: 1856)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1319, file: !25, line: 1942, baseType: !956, size: 32, align: 32, offset: 1920)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1319, file: !25, line: 1948, baseType: !956, size: 32, align: 32, offset: 1952)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1319, file: !25, line: 1954, baseType: !956, size: 32, align: 32, offset: 1984)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1319, file: !25, line: 1960, baseType: !956, size: 32, align: 32, offset: 2016)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1319, file: !25, line: 1984, baseType: !956, size: 32, align: 32, offset: 2048)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1319, file: !25, line: 1991, baseType: !956, size: 32, align: 32, offset: 2080)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1319, file: !25, line: 1996, baseType: !956, size: 32, align: 32, offset: 2112)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1319, file: !25, line: 2004, baseType: !956, size: 32, align: 32, offset: 2144)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1319, file: !25, line: 2011, baseType: !956, size: 32, align: 32, offset: 2176)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1319, file: !25, line: 2018, baseType: !956, size: 32, align: 32, offset: 2208)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1319, file: !25, line: 2027, baseType: !956, size: 32, align: 32, offset: 2240)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1319, file: !25, line: 2034, baseType: !956, size: 32, align: 32, offset: 2272)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1319, file: !25, line: 2044, baseType: !956, size: 32, align: 32, offset: 2304)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1319, file: !25, line: 2054, baseType: !1525, size: 64, align: 64, offset: 2368)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1319, file: !25, line: 2061, baseType: !1525, size: 64, align: 64, offset: 2432)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1319, file: !25, line: 2066, baseType: !956, size: 32, align: 32, offset: 2496)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1319, file: !25, line: 2070, baseType: !956, size: 32, align: 32, offset: 2528)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1319, file: !25, line: 2078, baseType: !956, size: 32, align: 32, offset: 2560)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1319, file: !25, line: 2085, baseType: !956, size: 32, align: 32, offset: 2592)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1319, file: !25, line: 2092, baseType: !956, size: 32, align: 32, offset: 2624)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1319, file: !25, line: 2099, baseType: !956, size: 32, align: 32, offset: 2656)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1319, file: !25, line: 2106, baseType: !956, size: 32, align: 32, offset: 2688)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1319, file: !25, line: 2113, baseType: !956, size: 32, align: 32, offset: 2720)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1319, file: !25, line: 2120, baseType: !956, size: 32, align: 32, offset: 2752)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1319, file: !25, line: 2125, baseType: !956, size: 32, align: 32, offset: 2784)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1319, file: !25, line: 2133, baseType: !956, size: 32, align: 32, offset: 2816)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1319, file: !25, line: 2140, baseType: !956, size: 32, align: 32, offset: 2848)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1319, file: !25, line: 2145, baseType: !956, size: 32, align: 32, offset: 2880)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1319, file: !25, line: 2153, baseType: !956, size: 32, align: 32, offset: 2912)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1319, file: !25, line: 2158, baseType: !956, size: 32, align: 32, offset: 2944)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1319, file: !25, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1319, file: !25, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1319, file: !25, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1319, file: !25, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1319, file: !25, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1319, file: !25, line: 2203, baseType: !956, size: 32, align: 32, offset: 3136)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1319, file: !25, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1319, file: !25, line: 2212, baseType: !956, size: 32, align: 32, offset: 3200)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1319, file: !25, line: 2213, baseType: !956, size: 32, align: 32, offset: 3232)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1319, file: !25, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1319, file: !25, line: 2232, baseType: !956, size: 32, align: 32, offset: 3296)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1319, file: !25, line: 2243, baseType: !956, size: 32, align: 32, offset: 3328)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1319, file: !25, line: 2249, baseType: !956, size: 32, align: 32, offset: 3360)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1319, file: !25, line: 2256, baseType: !956, size: 32, align: 32, offset: 3392)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1319, file: !25, line: 2263, baseType: !1168, size: 64, align: 64, offset: 3456)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1319, file: !25, line: 2270, baseType: !1168, size: 64, align: 64, offset: 3520)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1319, file: !25, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1319, file: !25, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1319, file: !25, line: 2367, baseType: !1561, size: 64, align: 64, offset: 3648)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{!956, !1488, !1134, !956}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1319, file: !25, line: 2383, baseType: !956, size: 32, align: 32, offset: 3712)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1319, file: !25, line: 2386, baseType: !1495, size: 32, align: 32, offset: 3744)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1319, file: !25, line: 2387, baseType: !1495, size: 32, align: 32, offset: 3776)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1319, file: !25, line: 2394, baseType: !956, size: 32, align: 32, offset: 3808)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1319, file: !25, line: 2401, baseType: !956, size: 32, align: 32, offset: 3840)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1319, file: !25, line: 2408, baseType: !956, size: 32, align: 32, offset: 3872)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1319, file: !25, line: 2415, baseType: !956, size: 32, align: 32, offset: 3904)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1319, file: !25, line: 2422, baseType: !956, size: 32, align: 32, offset: 3936)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1319, file: !25, line: 2423, baseType: !1573, size: 64, align: 64, offset: 3968)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !25, line: 831, baseType: !1575)
!1575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !25, line: 826, size: 128, align: 32, elements: !1576)
!1576 = !{!1577, !1578, !1579, !1580}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1575, file: !25, line: 827, baseType: !956, size: 32, align: 32)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1575, file: !25, line: 828, baseType: !956, size: 32, align: 32, offset: 32)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1575, file: !25, line: 829, baseType: !956, size: 32, align: 32, offset: 64)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1575, file: !25, line: 830, baseType: !1495, size: 32, align: 32, offset: 96)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1319, file: !25, line: 2430, baseType: !1043, size: 64, align: 64, offset: 4032)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1319, file: !25, line: 2437, baseType: !1043, size: 64, align: 64, offset: 4096)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1319, file: !25, line: 2444, baseType: !1495, size: 32, align: 32, offset: 4160)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1319, file: !25, line: 2451, baseType: !1495, size: 32, align: 32, offset: 4192)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1319, file: !25, line: 2458, baseType: !956, size: 32, align: 32, offset: 4224)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1319, file: !25, line: 2469, baseType: !956, size: 32, align: 32, offset: 4256)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1319, file: !25, line: 2475, baseType: !956, size: 32, align: 32, offset: 4288)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1319, file: !25, line: 2481, baseType: !956, size: 32, align: 32, offset: 4320)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1319, file: !25, line: 2485, baseType: !956, size: 32, align: 32, offset: 4352)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1319, file: !25, line: 2489, baseType: !956, size: 32, align: 32, offset: 4384)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1319, file: !25, line: 2493, baseType: !956, size: 32, align: 32, offset: 4416)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1319, file: !25, line: 2501, baseType: !956, size: 32, align: 32, offset: 4448)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1319, file: !25, line: 2506, baseType: !956, size: 32, align: 32, offset: 4480)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1319, file: !25, line: 2510, baseType: !956, size: 32, align: 32, offset: 4512)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1319, file: !25, line: 2514, baseType: !1043, size: 64, align: 64, offset: 4544)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1319, file: !25, line: 2528, baseType: !1597, size: 64, align: 64, offset: 4608)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DISubroutineType(types: !1599)
!1599 = !{null, !1488, !950, !956, !956}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1319, file: !25, line: 2534, baseType: !956, size: 32, align: 32, offset: 4672)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1319, file: !25, line: 2545, baseType: !956, size: 32, align: 32, offset: 4704)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1319, file: !25, line: 2547, baseType: !956, size: 32, align: 32, offset: 4736)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1319, file: !25, line: 2549, baseType: !956, size: 32, align: 32, offset: 4768)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1319, file: !25, line: 2551, baseType: !956, size: 32, align: 32, offset: 4800)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1319, file: !25, line: 2553, baseType: !956, size: 32, align: 32, offset: 4832)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1319, file: !25, line: 2555, baseType: !956, size: 32, align: 32, offset: 4864)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1319, file: !25, line: 2557, baseType: !956, size: 32, align: 32, offset: 4896)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1319, file: !25, line: 2559, baseType: !956, size: 32, align: 32, offset: 4928)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1319, file: !25, line: 2563, baseType: !956, size: 32, align: 32, offset: 4960)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1319, file: !25, line: 2571, baseType: !1421, size: 64, align: 64, offset: 4992)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1319, file: !25, line: 2579, baseType: !1421, size: 64, align: 64, offset: 5056)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1319, file: !25, line: 2586, baseType: !956, size: 32, align: 32, offset: 5120)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1319, file: !25, line: 2615, baseType: !956, size: 32, align: 32, offset: 5152)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1319, file: !25, line: 2627, baseType: !956, size: 32, align: 32, offset: 5184)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1319, file: !25, line: 2637, baseType: !956, size: 32, align: 32, offset: 5216)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1319, file: !25, line: 2681, baseType: !956, size: 32, align: 32, offset: 5248)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1319, file: !25, line: 2709, baseType: !1043, size: 64, align: 64, offset: 5312)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1319, file: !25, line: 2716, baseType: !1619, size: 64, align: 64, offset: 5376)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1621)
!1621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !25, line: 3636, size: 896, align: 64, elements: !1622)
!1622 = !{!1623, !1624, !1625, !1626, !1627, !1628, !1629, !1633, !1637, !1638, !1639, !1640, !1646, !1647, !1648, !1649, !1650}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1621, file: !25, line: 3642, baseType: !943, size: 64, align: 64)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1621, file: !25, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1621, file: !25, line: 3656, baseType: !55, size: 32, align: 32, offset: 96)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1621, file: !25, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1621, file: !25, line: 3669, baseType: !956, size: 32, align: 32, offset: 160)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1621, file: !25, line: 3682, baseType: !1446, size: 64, align: 64, offset: 192)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1621, file: !25, line: 3698, baseType: !1630, size: 64, align: 64, offset: 256)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DISubroutineType(types: !1632)
!1632 = !{!956, !1317, !1271, !1393}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1621, file: !25, line: 3712, baseType: !1634, size: 64, align: 64, offset: 320)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DISubroutineType(types: !1636)
!1636 = !{!956, !1317, !956, !1271, !1393}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1621, file: !25, line: 3726, baseType: !1630, size: 64, align: 64, offset: 384)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1621, file: !25, line: 3737, baseType: !1364, size: 64, align: 64, offset: 448)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1621, file: !25, line: 3746, baseType: !956, size: 32, align: 32, offset: 512)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1621, file: !25, line: 3757, baseType: !1641, size: 64, align: 64, offset: 576)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{null, !1644}
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !25, line: 3617, flags: DIFlagFwdDecl)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1621, file: !25, line: 3766, baseType: !1364, size: 64, align: 64, offset: 640)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1621, file: !25, line: 3774, baseType: !1364, size: 64, align: 64, offset: 704)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1621, file: !25, line: 3780, baseType: !956, size: 32, align: 32, offset: 768)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1621, file: !25, line: 3785, baseType: !956, size: 32, align: 32, offset: 800)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1621, file: !25, line: 3795, baseType: !1651, size: 64, align: 64, offset: 832)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{!956, !1317, !1029}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1319, file: !25, line: 2728, baseType: !950, size: 64, align: 64, offset: 5440)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1319, file: !25, line: 2735, baseType: !1167, size: 512, align: 64, offset: 5504)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1319, file: !25, line: 2742, baseType: !956, size: 32, align: 32, offset: 6016)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1319, file: !25, line: 2755, baseType: !956, size: 32, align: 32, offset: 6048)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1319, file: !25, line: 2776, baseType: !956, size: 32, align: 32, offset: 6080)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1319, file: !25, line: 2783, baseType: !956, size: 32, align: 32, offset: 6112)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1319, file: !25, line: 2791, baseType: !956, size: 32, align: 32, offset: 6144)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1319, file: !25, line: 2802, baseType: !1134, size: 64, align: 64, offset: 6208)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1319, file: !25, line: 2811, baseType: !956, size: 32, align: 32, offset: 6272)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1319, file: !25, line: 2821, baseType: !956, size: 32, align: 32, offset: 6304)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1319, file: !25, line: 2830, baseType: !956, size: 32, align: 32, offset: 6336)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1319, file: !25, line: 2840, baseType: !956, size: 32, align: 32, offset: 6368)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1319, file: !25, line: 2851, baseType: !1667, size: 64, align: 64, offset: 6400)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{!956, !1488, !1670, !950, !1431, !956, !956}
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{!956, !1488, !950}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1319, file: !25, line: 2871, baseType: !1674, size: 64, align: 64, offset: 6464)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DISubroutineType(types: !1676)
!1676 = !{!956, !1488, !1677, !950, !1431, !956}
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DISubroutineType(types: !1679)
!1679 = !{!956, !1488, !950, !956, !956}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1319, file: !25, line: 2878, baseType: !956, size: 32, align: 32, offset: 6528)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1319, file: !25, line: 2885, baseType: !956, size: 32, align: 32, offset: 6560)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1319, file: !25, line: 3005, baseType: !956, size: 32, align: 32, offset: 6592)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1319, file: !25, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1319, file: !25, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1319, file: !25, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1319, file: !25, line: 3037, baseType: !1039, size: 64, align: 64, offset: 6720)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1319, file: !25, line: 3038, baseType: !956, size: 32, align: 32, offset: 6784)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1319, file: !25, line: 3050, baseType: !1168, size: 64, align: 64, offset: 6848)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1319, file: !25, line: 3065, baseType: !956, size: 32, align: 32, offset: 6912)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1319, file: !25, line: 3083, baseType: !956, size: 32, align: 32, offset: 6944)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1319, file: !25, line: 3092, baseType: !1153, size: 64, align: 32, offset: 6976)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1319, file: !25, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1319, file: !25, line: 3106, baseType: !1153, size: 64, align: 32, offset: 7072)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1319, file: !25, line: 3113, baseType: !1695, size: 64, align: 64, offset: 7168)
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64, align: 64)
!1696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1697)
!1697 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !25, line: 740, baseType: !1698)
!1698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !25, line: 712, size: 384, align: 64, elements: !1699)
!1699 = !{!1700, !1701, !1702, !1703, !1704, !1705, !1708}
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1698, file: !25, line: 713, baseType: !55, size: 32, align: 32)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1698, file: !25, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1698, file: !25, line: 720, baseType: !943, size: 64, align: 64, offset: 64)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1698, file: !25, line: 724, baseType: !943, size: 64, align: 64, offset: 128)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1698, file: !25, line: 728, baseType: !956, size: 32, align: 32, offset: 192)
