; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--asfenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--asfenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVLangCodespace", file: !939, line: 30, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "libavformat/avlanguage.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!940 = !{!941, !942, !943}
!941 = !DIEnumerator(name: "AV_LANG_ISO639_2_BIBL", value: 0)
!942 = !DIEnumerator(name: "AV_LANG_ISO639_2_TERM", value: 1)
!943 = !DIEnumerator(name: "AV_LANG_ISO639_1", value: 2)
!944 = !{!945, !946, !949, !950}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !947, line: 197, baseType: !948)
!947 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!948 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!949 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !951, line: 51, baseType: !952)
!951 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!952 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!953 = !{!954, !2197, !2198, !2202, !2203, !2208}
!954 = distinct !DIGlobalVariable(name: "ff_asf_muxer", scope: !0, file: !955, line: 1164, type: !956, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_asf_muxer)
!955 = !DIFile(filename: "libavformat/asfenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !958)
!958 = !{!959, !963, !964, !965, !966, !967, !968, !969, !970, !980, !1059, !1061, !1062, !2162, !2163, !2164, !2168, !2172, !2176, !2177, !2182, !2183, !2184, !2185, !2186, !2187, !2191}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !957, file: !919, line: 498, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !957, file: !919, line: 504, baseType: !960, size: 64, align: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !957, file: !919, line: 505, baseType: !960, size: 64, align: 64, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !957, file: !919, line: 506, baseType: !960, size: 64, align: 64, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !957, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !957, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !957, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !957, file: !919, line: 517, baseType: !949, size: 32, align: 32, offset: 352)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !957, file: !919, line: 523, baseType: !971, size: 64, align: 64, offset: 384)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !976, line: 44, size: 64, align: 32, elements: !977)
!976 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !975, file: !976, line: 45, baseType: !3, size: 32, align: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !975, file: !976, line: 46, baseType: !952, size: 32, align: 32, offset: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !957, file: !919, line: 526, baseType: !981, size: 64, align: 64, offset: 448)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !985)
!985 = !{!986, !987, !991, !1018, !1019, !1020, !1021, !1025, !1031, !1033, !1037}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !984, file: !486, line: 72, baseType: !960, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !984, file: !486, line: 78, baseType: !988, size: 64, align: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!960, !945}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !984, file: !486, line: 85, baseType: !992, size: 64, align: 64, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !995)
!995 = !{!996, !997, !998, !999, !1000, !1014, !1015, !1016, !1017}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !994, file: !464, line: 247, baseType: !960, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !994, file: !464, line: 253, baseType: !960, size: 64, align: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !994, file: !464, line: 259, baseType: !949, size: 32, align: 32, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !994, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !994, file: !464, line: 271, baseType: !1001, size: 64, align: 64, offset: 192)
!1001 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !994, file: !464, line: 265, size: 64, align: 64, elements: !1002)
!1002 = !{!1003, !1004, !1006, !1007}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1001, file: !464, line: 266, baseType: !946, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1001, file: !464, line: 267, baseType: !1005, size: 64, align: 64)
!1005 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1001, file: !464, line: 268, baseType: !960, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1001, file: !464, line: 270, baseType: !1008, size: 64, align: 32)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1009, line: 61, baseType: !1010)
!1009 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1009, line: 58, size: 64, align: 32, elements: !1011)
!1011 = !{!1012, !1013}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1010, file: !1009, line: 59, baseType: !949, size: 32, align: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1010, file: !1009, line: 60, baseType: !949, size: 32, align: 32, offset: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !994, file: !464, line: 272, baseType: !1005, size: 64, align: 64, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !994, file: !464, line: 273, baseType: !1005, size: 64, align: 64, offset: 320)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !994, file: !464, line: 275, baseType: !949, size: 32, align: 32, offset: 384)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !994, file: !464, line: 300, baseType: !960, size: 64, align: 64, offset: 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !984, file: !486, line: 93, baseType: !949, size: 32, align: 32, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !984, file: !486, line: 99, baseType: !949, size: 32, align: 32, offset: 224)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !984, file: !486, line: 108, baseType: !949, size: 32, align: 32, offset: 256)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !984, file: !486, line: 113, baseType: !1022, size: 64, align: 64, offset: 320)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!945, !945, !945}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !984, file: !486, line: 123, baseType: !1026, size: 64, align: 64, offset: 384)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!1029, !1029}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !984, file: !486, line: 130, baseType: !1032, size: 32, align: 32, offset: 448)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !984, file: !486, line: 136, baseType: !1034, size: 64, align: 64, offset: 512)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!1032, !945}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !984, file: !486, line: 142, baseType: !1038, size: 64, align: 64, offset: 576)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!949, !1041, !945, !960, !949}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1044)
!1044 = !{!1045, !1057, !1058}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1043, file: !464, line: 360, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1050)
!1050 = !{!1051, !1052, !1053, !1054, !1055, !1056}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1049, file: !464, line: 307, baseType: !960, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1049, file: !464, line: 313, baseType: !1005, size: 64, align: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1049, file: !464, line: 313, baseType: !1005, size: 64, align: 64, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1049, file: !464, line: 318, baseType: !1005, size: 64, align: 64, offset: 192)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1049, file: !464, line: 318, baseType: !1005, size: 64, align: 64, offset: 256)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1049, file: !464, line: 323, baseType: !949, size: 32, align: 32, offset: 320)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1043, file: !464, line: 364, baseType: !949, size: 32, align: 32, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1043, file: !464, line: 368, baseType: !949, size: 32, align: 32, offset: 96)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !957, file: !919, line: 535, baseType: !1060, size: 64, align: 64, offset: 512)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !957, file: !919, line: 539, baseType: !949, size: 32, align: 32, offset: 576)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !957, file: !919, line: 541, baseType: !1063, size: 64, align: 64, offset: 640)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!949, !1066}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1068)
!1068 = !{!1069, !1070, !1168, !1169, !1170, !1236, !1237, !1238, !2016, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2070, !2071, !2072, !2073, !2074, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2125, !2126, !2129, !2130, !2131, !2132, !2133, !2134, !2139, !2140, !2141, !2142, !2150, !2151, !2155, !2159, !2160, !2161}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1067, file: !919, line: 1342, baseType: !981, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1067, file: !919, line: 1349, baseType: !1071, size: 64, align: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1073)
!1073 = !{!1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1098, !1099, !1139, !1140, !1144, !1149, !1150, !1151, !1155, !1161, !1167}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1072, file: !919, line: 638, baseType: !960, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1072, file: !919, line: 645, baseType: !960, size: 64, align: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1072, file: !919, line: 652, baseType: !949, size: 32, align: 32, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1072, file: !919, line: 659, baseType: !960, size: 64, align: 64, offset: 192)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1072, file: !919, line: 661, baseType: !971, size: 64, align: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1072, file: !919, line: 663, baseType: !981, size: 64, align: 64, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1072, file: !919, line: 670, baseType: !960, size: 64, align: 64, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1072, file: !919, line: 679, baseType: !1071, size: 64, align: 64, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1072, file: !919, line: 684, baseType: !949, size: 32, align: 32, offset: 512)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1072, file: !919, line: 689, baseType: !949, size: 32, align: 32, offset: 544)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1072, file: !919, line: 696, baseType: !1085, size: 64, align: 64, offset: 576)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!949, !1088}
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1091)
!1091 = !{!1092, !1093, !1096, !1097}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1090, file: !919, line: 449, baseType: !960, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1090, file: !919, line: 450, baseType: !1094, size: 64, align: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1090, file: !919, line: 451, baseType: !949, size: 32, align: 32, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1090, file: !919, line: 452, baseType: !960, size: 64, align: 64, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1072, file: !919, line: 703, baseType: !1063, size: 64, align: 64, offset: 640)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1072, file: !919, line: 714, baseType: !1100, size: 64, align: 64, offset: 704)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!949, !1066, !1103}
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1105)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1106)
!1106 = !{!1107, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1135, !1136, !1137, !1138}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1105, file: !4, line: 1451, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1110, line: 94, baseType: !1111)
!1110 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1110, line: 81, size: 192, align: 64, elements: !1112)
!1112 = !{!1113, !1117, !1120}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1111, file: !1110, line: 82, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1110, line: 73, baseType: !1116)
!1116 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1110, line: 73, flags: DIFlagFwdDecl)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1111, file: !1110, line: 89, baseType: !1118, size: 64, align: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !951, line: 48, baseType: !1095)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1111, file: !1110, line: 93, baseType: !949, size: 32, align: 32, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1105, file: !4, line: 1461, baseType: !946, size: 64, align: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1105, file: !4, line: 1467, baseType: !946, size: 64, align: 64, offset: 128)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1105, file: !4, line: 1468, baseType: !1118, size: 64, align: 64, offset: 192)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1105, file: !4, line: 1469, baseType: !949, size: 32, align: 32, offset: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1105, file: !4, line: 1470, baseType: !949, size: 32, align: 32, offset: 288)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1105, file: !4, line: 1474, baseType: !949, size: 32, align: 32, offset: 320)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1105, file: !4, line: 1479, baseType: !1128, size: 64, align: 64, offset: 384)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1130)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1131)
!1131 = !{!1132, !1133, !1134}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1130, file: !4, line: 1412, baseType: !1118, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1130, file: !4, line: 1413, baseType: !949, size: 32, align: 32, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1130, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1105, file: !4, line: 1480, baseType: !949, size: 32, align: 32, offset: 448)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1105, file: !4, line: 1486, baseType: !946, size: 64, align: 64, offset: 512)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1105, file: !4, line: 1488, baseType: !946, size: 64, align: 64, offset: 576)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1105, file: !4, line: 1497, baseType: !946, size: 64, align: 64, offset: 640)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1072, file: !919, line: 720, baseType: !1063, size: 64, align: 64, offset: 768)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1072, file: !919, line: 730, baseType: !1141, size: 64, align: 64, offset: 832)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!949, !1066, !949, !946, !949}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1072, file: !919, line: 737, baseType: !1145, size: 64, align: 64, offset: 896)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!946, !1066, !949, !1148, !946}
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1072, file: !919, line: 744, baseType: !1063, size: 64, align: 64, offset: 960)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1072, file: !919, line: 750, baseType: !1063, size: 64, align: 64, offset: 1024)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1072, file: !919, line: 758, baseType: !1152, size: 64, align: 64, offset: 1088)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!949, !1066, !949, !946, !946, !946, !949}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1072, file: !919, line: 764, baseType: !1156, size: 64, align: 64, offset: 1152)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!949, !1066, !1159}
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1072, file: !919, line: 770, baseType: !1162, size: 64, align: 64, offset: 1216)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!949, !1066, !1165}
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1072, file: !919, line: 776, baseType: !1162, size: 64, align: 64, offset: 1280)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1067, file: !919, line: 1356, baseType: !1060, size: 64, align: 64, offset: 128)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1067, file: !919, line: 1365, baseType: !945, size: 64, align: 64, offset: 192)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1067, file: !919, line: 1379, baseType: !1171, size: 64, align: 64, offset: 256)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1174)
!1174 = !{!1175, !1176, !1177, !1178, !1179, !1180, !1181, !1185, !1186, !1190, !1191, !1192, !1193, !1194, !1196, !1197, !1203, !1204, !1208, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1226, !1227, !1228, !1229, !1233, !1234, !1235}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1173, file: !537, line: 174, baseType: !981, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1173, file: !537, line: 226, baseType: !1094, size: 64, align: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1173, file: !537, line: 227, baseType: !949, size: 32, align: 32, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1173, file: !537, line: 228, baseType: !1094, size: 64, align: 64, offset: 192)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1173, file: !537, line: 229, baseType: !1094, size: 64, align: 64, offset: 256)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1173, file: !537, line: 233, baseType: !945, size: 64, align: 64, offset: 320)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1173, file: !537, line: 235, baseType: !1182, size: 64, align: 64, offset: 384)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!949, !945, !1118, !949}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1173, file: !537, line: 236, baseType: !1182, size: 64, align: 64, offset: 448)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1173, file: !537, line: 237, baseType: !1187, size: 64, align: 64, offset: 512)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!946, !945, !946, !949}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1173, file: !537, line: 238, baseType: !946, size: 64, align: 64, offset: 576)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1173, file: !537, line: 239, baseType: !949, size: 32, align: 32, offset: 640)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1173, file: !537, line: 240, baseType: !949, size: 32, align: 32, offset: 672)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1173, file: !537, line: 241, baseType: !949, size: 32, align: 32, offset: 704)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1173, file: !537, line: 242, baseType: !1195, size: 64, align: 64, offset: 768)
!1195 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1173, file: !537, line: 243, baseType: !1094, size: 64, align: 64, offset: 832)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1173, file: !537, line: 244, baseType: !1198, size: 64, align: 64, offset: 896)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!1195, !1195, !1201, !952}
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1119)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1173, file: !537, line: 245, baseType: !949, size: 32, align: 32, offset: 960)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1173, file: !537, line: 249, baseType: !1205, size: 64, align: 64, offset: 1024)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!949, !945, !949}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1173, file: !537, line: 255, baseType: !1209, size: 64, align: 64, offset: 1088)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!946, !945, !949, !946, !949}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1173, file: !537, line: 260, baseType: !949, size: 32, align: 32, offset: 1152)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1173, file: !537, line: 266, baseType: !946, size: 64, align: 64, offset: 1216)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1173, file: !537, line: 273, baseType: !949, size: 32, align: 32, offset: 1280)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1173, file: !537, line: 279, baseType: !946, size: 64, align: 64, offset: 1344)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1173, file: !537, line: 285, baseType: !949, size: 32, align: 32, offset: 1408)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1173, file: !537, line: 291, baseType: !949, size: 32, align: 32, offset: 1440)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1173, file: !537, line: 298, baseType: !949, size: 32, align: 32, offset: 1472)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1173, file: !537, line: 304, baseType: !949, size: 32, align: 32, offset: 1504)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1173, file: !537, line: 309, baseType: !960, size: 64, align: 64, offset: 1536)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1173, file: !537, line: 314, baseType: !960, size: 64, align: 64, offset: 1600)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1173, file: !537, line: 319, baseType: !1223, size: 64, align: 64, offset: 1664)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!949, !945, !1118, !949, !536, !946}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1173, file: !537, line: 326, baseType: !949, size: 32, align: 32, offset: 1728)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1173, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1173, file: !537, line: 332, baseType: !946, size: 64, align: 64, offset: 1792)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1173, file: !537, line: 338, baseType: !1230, size: 64, align: 64, offset: 1856)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!949, !945}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1173, file: !537, line: 340, baseType: !946, size: 64, align: 64, offset: 1920)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1173, file: !537, line: 346, baseType: !1094, size: 64, align: 64, offset: 1984)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1173, file: !537, line: 351, baseType: !949, size: 32, align: 32, offset: 2048)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1067, file: !919, line: 1386, baseType: !949, size: 32, align: 32, offset: 320)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1067, file: !919, line: 1393, baseType: !952, size: 32, align: 32, offset: 352)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1067, file: !919, line: 1405, baseType: !1239, size: 64, align: 64, offset: 384)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1243)
!1243 = !{!1244, !1245, !1246, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1802, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1902, !1908, !1909, !1913, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1945, !1946, !1947, !1948, !1949, !1950}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1242, file: !919, line: 866, baseType: !949, size: 32, align: 32)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1242, file: !919, line: 872, baseType: !949, size: 32, align: 32, offset: 32)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1242, file: !919, line: 878, baseType: !1247, size: 64, align: 64, offset: 64)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1249)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1250)
!1250 = !{!1251, !1252, !1253, !1254, !1477, !1478, !1479, !1480, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1506, !1510, !1511, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1690, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1249, file: !4, line: 1561, baseType: !981, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1249, file: !4, line: 1562, baseType: !949, size: 32, align: 32, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1249, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1249, file: !4, line: 1565, baseType: !1255, size: 64, align: 64, offset: 128)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1258)
!1258 = !{!1259, !1260, !1261, !1262, !1263, !1264, !1267, !1270, !1273, !1276, !1280, !1281, !1282, !1290, !1291, !1292, !1294, !1298, !1304, !1309, !1313, !1314, !1361, !1448, !1452, !1453, !1457, !1461, !1466, !1470, !1471, !1472}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1257, file: !4, line: 3475, baseType: !960, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1257, file: !4, line: 3480, baseType: !960, size: 64, align: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1257, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1257, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1257, file: !4, line: 3487, baseType: !949, size: 32, align: 32, offset: 192)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1257, file: !4, line: 3488, baseType: !1265, size: 64, align: 64, offset: 256)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1257, file: !4, line: 3489, baseType: !1268, size: 64, align: 64, offset: 320)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1257, file: !4, line: 3490, baseType: !1271, size: 64, align: 64, offset: 384)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1257, file: !4, line: 3491, baseType: !1274, size: 64, align: 64, offset: 448)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1257, file: !4, line: 3492, baseType: !1277, size: 64, align: 64, offset: 512)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1279)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !951, line: 55, baseType: !1195)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1257, file: !4, line: 3493, baseType: !1119, size: 8, align: 8, offset: 576)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1257, file: !4, line: 3494, baseType: !981, size: 64, align: 64, offset: 640)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1257, file: !4, line: 3495, baseType: !1283, size: 64, align: 64, offset: 704)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1285)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1287)
!1287 = !{!1288, !1289}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1286, file: !4, line: 3402, baseType: !949, size: 32, align: 32)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1286, file: !4, line: 3403, baseType: !960, size: 64, align: 64, offset: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1257, file: !4, line: 3507, baseType: !960, size: 64, align: 64, offset: 768)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1257, file: !4, line: 3516, baseType: !949, size: 32, align: 32, offset: 832)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1257, file: !4, line: 3517, baseType: !1293, size: 64, align: 64, offset: 896)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1257, file: !4, line: 3527, baseType: !1295, size: 64, align: 64, offset: 960)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{!949, !1247}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1257, file: !4, line: 3535, baseType: !1299, size: 64, align: 64, offset: 1024)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DISubroutineType(types: !1301)
!1301 = !{!949, !1247, !1302}
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1248)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1257, file: !4, line: 3541, baseType: !1305, size: 64, align: 64, offset: 1088)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1307)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1308)
!1308 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1257, file: !4, line: 3549, baseType: !1310, size: 64, align: 64, offset: 1152)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DISubroutineType(types: !1312)
!1312 = !{null, !1293}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1257, file: !4, line: 3551, baseType: !1295, size: 64, align: 64, offset: 1216)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1257, file: !4, line: 3552, baseType: !1315, size: 64, align: 64, offset: 1280)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!949, !1247, !1118, !949, !1318}
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1320)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1321)
!1321 = !{!1322, !1325, !1326, !1327, !1328, !1360}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1320, file: !4, line: 3921, baseType: !1323, size: 16, align: 16)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !951, line: 49, baseType: !1324)
!1324 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1320, file: !4, line: 3922, baseType: !950, size: 32, align: 32, offset: 32)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1320, file: !4, line: 3923, baseType: !950, size: 32, align: 32, offset: 64)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1320, file: !4, line: 3924, baseType: !952, size: 32, align: 32, offset: 96)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1320, file: !4, line: 3925, baseType: !1329, size: 64, align: 64, offset: 128)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1332)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1333)
!1333 = !{!1334, !1335, !1336, !1337, !1338, !1339, !1349, !1353, !1355, !1356, !1358, !1359}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1332, file: !4, line: 3886, baseType: !949, size: 32, align: 32)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1332, file: !4, line: 3887, baseType: !949, size: 32, align: 32, offset: 32)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1332, file: !4, line: 3888, baseType: !949, size: 32, align: 32, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1332, file: !4, line: 3889, baseType: !949, size: 32, align: 32, offset: 96)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1332, file: !4, line: 3890, baseType: !949, size: 32, align: 32, offset: 128)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1332, file: !4, line: 3897, baseType: !1340, size: 768, align: 64, offset: 192)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1341)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1342)
!1342 = !{!1343, !1347}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1341, file: !4, line: 3855, baseType: !1344, size: 512, align: 64)
!1344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1118, size: 512, align: 64, elements: !1345)
!1345 = !{!1346}
!1346 = !DISubrange(count: 8)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1341, file: !4, line: 3857, baseType: !1348, size: 256, align: 32, offset: 512)
!1348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 256, align: 32, elements: !1345)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1332, file: !4, line: 3903, baseType: !1350, size: 256, align: 64, offset: 960)
!1350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1118, size: 256, align: 64, elements: !1351)
!1351 = !{!1352}
!1352 = !DISubrange(count: 4)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1332, file: !4, line: 3904, baseType: !1354, size: 128, align: 32, offset: 1216)
!1354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 128, align: 32, elements: !1351)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1332, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1332, file: !4, line: 3908, baseType: !1357, size: 64, align: 64, offset: 1408)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1332, file: !4, line: 3915, baseType: !1357, size: 64, align: 64, offset: 1472)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1332, file: !4, line: 3917, baseType: !949, size: 32, align: 32, offset: 1536)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1320, file: !4, line: 3926, baseType: !946, size: 64, align: 64, offset: 192)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1257, file: !4, line: 3564, baseType: !1362, size: 64, align: 64, offset: 1344)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{!949, !1247, !1103, !1365, !1447}
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1367)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1368)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1369)
!1369 = !{!1370, !1371, !1372, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1399, !1401, !1402, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1435, !1436, !1437, !1438, !1439, !1440, !1443, !1444, !1445, !1446}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1368, file: !789, line: 282, baseType: !1344, size: 512, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1368, file: !789, line: 299, baseType: !1348, size: 256, align: 32, offset: 512)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1368, file: !789, line: 315, baseType: !1373, size: 64, align: 64, offset: 768)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1368, file: !789, line: 326, baseType: !949, size: 32, align: 32, offset: 832)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1368, file: !789, line: 326, baseType: !949, size: 32, align: 32, offset: 864)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1368, file: !789, line: 334, baseType: !949, size: 32, align: 32, offset: 896)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1368, file: !789, line: 341, baseType: !949, size: 32, align: 32, offset: 928)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1368, file: !789, line: 346, baseType: !949, size: 32, align: 32, offset: 960)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1368, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1368, file: !789, line: 356, baseType: !1008, size: 64, align: 32, offset: 1024)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1368, file: !789, line: 361, baseType: !946, size: 64, align: 64, offset: 1088)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1368, file: !789, line: 369, baseType: !946, size: 64, align: 64, offset: 1152)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1368, file: !789, line: 377, baseType: !946, size: 64, align: 64, offset: 1216)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1368, file: !789, line: 382, baseType: !949, size: 32, align: 32, offset: 1280)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1368, file: !789, line: 386, baseType: !949, size: 32, align: 32, offset: 1312)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1368, file: !789, line: 391, baseType: !949, size: 32, align: 32, offset: 1344)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1368, file: !789, line: 396, baseType: !945, size: 64, align: 64, offset: 1408)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1368, file: !789, line: 403, baseType: !1389, size: 512, align: 64, offset: 1472)
!1389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1279, size: 512, align: 64, elements: !1345)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1368, file: !789, line: 410, baseType: !949, size: 32, align: 32, offset: 1984)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1368, file: !789, line: 415, baseType: !949, size: 32, align: 32, offset: 2016)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1368, file: !789, line: 420, baseType: !949, size: 32, align: 32, offset: 2048)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1368, file: !789, line: 425, baseType: !949, size: 32, align: 32, offset: 2080)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1368, file: !789, line: 435, baseType: !946, size: 64, align: 64, offset: 2112)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1368, file: !789, line: 440, baseType: !949, size: 32, align: 32, offset: 2176)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1368, file: !789, line: 445, baseType: !1279, size: 64, align: 64, offset: 2240)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1368, file: !789, line: 459, baseType: !1398, size: 512, align: 64, offset: 2304)
!1398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1108, size: 512, align: 64, elements: !1345)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1368, file: !789, line: 473, baseType: !1400, size: 64, align: 64, offset: 2816)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1368, file: !789, line: 477, baseType: !949, size: 32, align: 32, offset: 2880)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1368, file: !789, line: 479, baseType: !1403, size: 64, align: 64, offset: 2944)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1406)
!1406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1407)
!1407 = !{!1408, !1409, !1410, !1411, !1416}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1406, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1406, file: !789, line: 203, baseType: !1118, size: 64, align: 64, offset: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1406, file: !789, line: 204, baseType: !949, size: 32, align: 32, offset: 128)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1406, file: !789, line: 205, baseType: !1412, size: 64, align: 64, offset: 192)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1414, line: 86, baseType: !1415)
!1414 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1415 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1414, line: 86, flags: DIFlagFwdDecl)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1406, file: !789, line: 206, baseType: !1108, size: 64, align: 64, offset: 256)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1368, file: !789, line: 480, baseType: !949, size: 32, align: 32, offset: 3008)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1368, file: !789, line: 505, baseType: !949, size: 32, align: 32, offset: 3040)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1368, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1368, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1368, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1368, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1368, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1368, file: !789, line: 532, baseType: !946, size: 64, align: 64, offset: 3264)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1368, file: !789, line: 539, baseType: !946, size: 64, align: 64, offset: 3328)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1368, file: !789, line: 547, baseType: !946, size: 64, align: 64, offset: 3392)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1368, file: !789, line: 554, baseType: !1412, size: 64, align: 64, offset: 3456)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1368, file: !789, line: 563, baseType: !949, size: 32, align: 32, offset: 3520)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1368, file: !789, line: 572, baseType: !949, size: 32, align: 32, offset: 3552)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1368, file: !789, line: 581, baseType: !949, size: 32, align: 32, offset: 3584)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1368, file: !789, line: 588, baseType: !1432, size: 64, align: 64, offset: 3648)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !947, line: 194, baseType: !1434)
!1434 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1368, file: !789, line: 593, baseType: !949, size: 32, align: 32, offset: 3712)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1368, file: !789, line: 596, baseType: !949, size: 32, align: 32, offset: 3744)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1368, file: !789, line: 599, baseType: !1108, size: 64, align: 64, offset: 3776)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1368, file: !789, line: 605, baseType: !1108, size: 64, align: 64, offset: 3840)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1368, file: !789, line: 616, baseType: !1108, size: 64, align: 64, offset: 3904)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1368, file: !789, line: 626, baseType: !1441, size: 64, align: 64, offset: 3968)
!1441 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1442, line: 216, baseType: !1195)
!1442 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1368, file: !789, line: 627, baseType: !1441, size: 64, align: 64, offset: 4032)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1368, file: !789, line: 628, baseType: !1441, size: 64, align: 64, offset: 4096)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1368, file: !789, line: 629, baseType: !1441, size: 64, align: 64, offset: 4160)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1368, file: !789, line: 645, baseType: !1108, size: 64, align: 64, offset: 4224)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1257, file: !4, line: 3566, baseType: !1449, size: 64, align: 64, offset: 1408)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DISubroutineType(types: !1451)
!1451 = !{!949, !1247, !945, !1447, !1103}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1257, file: !4, line: 3567, baseType: !1295, size: 64, align: 64, offset: 1472)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1257, file: !4, line: 3576, baseType: !1454, size: 64, align: 64, offset: 1536)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DISubroutineType(types: !1456)
!1456 = !{!949, !1247, !1365}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1257, file: !4, line: 3577, baseType: !1458, size: 64, align: 64, offset: 1600)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{!949, !1247, !1103}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1257, file: !4, line: 3584, baseType: !1462, size: 64, align: 64, offset: 1664)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{!949, !1247, !1465}
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1257, file: !4, line: 3589, baseType: !1467, size: 64, align: 64, offset: 1728)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DISubroutineType(types: !1469)
!1469 = !{null, !1247}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1257, file: !4, line: 3594, baseType: !949, size: 32, align: 32, offset: 1792)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1257, file: !4, line: 3600, baseType: !960, size: 64, align: 64, offset: 1856)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1257, file: !4, line: 3609, baseType: !1473, size: 64, align: 64, offset: 1920)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64, align: 64)
!1475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1476)
!1476 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1249, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1249, file: !4, line: 1581, baseType: !952, size: 32, align: 32, offset: 224)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1249, file: !4, line: 1583, baseType: !945, size: 64, align: 64, offset: 256)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1249, file: !4, line: 1591, baseType: !1481, size: 64, align: 64, offset: 320)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1249, file: !4, line: 1598, baseType: !945, size: 64, align: 64, offset: 384)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1249, file: !4, line: 1606, baseType: !946, size: 64, align: 64, offset: 448)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1249, file: !4, line: 1614, baseType: !949, size: 32, align: 32, offset: 512)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1249, file: !4, line: 1622, baseType: !949, size: 32, align: 32, offset: 544)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1249, file: !4, line: 1628, baseType: !949, size: 32, align: 32, offset: 576)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1249, file: !4, line: 1636, baseType: !949, size: 32, align: 32, offset: 608)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1249, file: !4, line: 1643, baseType: !949, size: 32, align: 32, offset: 640)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1249, file: !4, line: 1657, baseType: !1118, size: 64, align: 64, offset: 704)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1249, file: !4, line: 1658, baseType: !949, size: 32, align: 32, offset: 768)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1249, file: !4, line: 1679, baseType: !1008, size: 64, align: 32, offset: 800)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1249, file: !4, line: 1688, baseType: !949, size: 32, align: 32, offset: 864)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1249, file: !4, line: 1712, baseType: !949, size: 32, align: 32, offset: 896)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1249, file: !4, line: 1729, baseType: !949, size: 32, align: 32, offset: 928)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1249, file: !4, line: 1729, baseType: !949, size: 32, align: 32, offset: 960)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1249, file: !4, line: 1744, baseType: !949, size: 32, align: 32, offset: 992)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1249, file: !4, line: 1744, baseType: !949, size: 32, align: 32, offset: 1024)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1249, file: !4, line: 1751, baseType: !949, size: 32, align: 32, offset: 1056)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1249, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1249, file: !4, line: 1791, baseType: !1502, size: 64, align: 64, offset: 1152)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{null, !1505, !1365, !1447, !949, !949, !949}
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1249, file: !4, line: 1808, baseType: !1507, size: 64, align: 64, offset: 1216)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{!555, !1505, !1268}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1249, file: !4, line: 1816, baseType: !949, size: 32, align: 32, offset: 1280)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1249, file: !4, line: 1825, baseType: !1512, size: 32, align: 32, offset: 1312)
!1512 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1249, file: !4, line: 1830, baseType: !949, size: 32, align: 32, offset: 1344)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1249, file: !4, line: 1838, baseType: !1512, size: 32, align: 32, offset: 1376)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1249, file: !4, line: 1846, baseType: !949, size: 32, align: 32, offset: 1408)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1249, file: !4, line: 1851, baseType: !949, size: 32, align: 32, offset: 1440)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1249, file: !4, line: 1861, baseType: !1512, size: 32, align: 32, offset: 1472)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1249, file: !4, line: 1868, baseType: !1512, size: 32, align: 32, offset: 1504)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1249, file: !4, line: 1875, baseType: !1512, size: 32, align: 32, offset: 1536)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1249, file: !4, line: 1882, baseType: !1512, size: 32, align: 32, offset: 1568)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1249, file: !4, line: 1889, baseType: !1512, size: 32, align: 32, offset: 1600)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1249, file: !4, line: 1896, baseType: !1512, size: 32, align: 32, offset: 1632)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1249, file: !4, line: 1903, baseType: !1512, size: 32, align: 32, offset: 1664)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1249, file: !4, line: 1910, baseType: !949, size: 32, align: 32, offset: 1696)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1249, file: !4, line: 1915, baseType: !949, size: 32, align: 32, offset: 1728)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1249, file: !4, line: 1926, baseType: !1447, size: 64, align: 64, offset: 1792)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1249, file: !4, line: 1935, baseType: !1008, size: 64, align: 32, offset: 1856)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1249, file: !4, line: 1942, baseType: !949, size: 32, align: 32, offset: 1920)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1249, file: !4, line: 1948, baseType: !949, size: 32, align: 32, offset: 1952)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1249, file: !4, line: 1954, baseType: !949, size: 32, align: 32, offset: 1984)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1249, file: !4, line: 1960, baseType: !949, size: 32, align: 32, offset: 2016)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1249, file: !4, line: 1984, baseType: !949, size: 32, align: 32, offset: 2048)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1249, file: !4, line: 1991, baseType: !949, size: 32, align: 32, offset: 2080)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1249, file: !4, line: 1996, baseType: !949, size: 32, align: 32, offset: 2112)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1249, file: !4, line: 2004, baseType: !949, size: 32, align: 32, offset: 2144)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1249, file: !4, line: 2011, baseType: !949, size: 32, align: 32, offset: 2176)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1249, file: !4, line: 2018, baseType: !949, size: 32, align: 32, offset: 2208)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1249, file: !4, line: 2027, baseType: !949, size: 32, align: 32, offset: 2240)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1249, file: !4, line: 2034, baseType: !949, size: 32, align: 32, offset: 2272)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1249, file: !4, line: 2044, baseType: !949, size: 32, align: 32, offset: 2304)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1249, file: !4, line: 2054, baseType: !1542, size: 64, align: 64, offset: 2368)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1249, file: !4, line: 2061, baseType: !1542, size: 64, align: 64, offset: 2432)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1249, file: !4, line: 2066, baseType: !949, size: 32, align: 32, offset: 2496)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1249, file: !4, line: 2070, baseType: !949, size: 32, align: 32, offset: 2528)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1249, file: !4, line: 2078, baseType: !949, size: 32, align: 32, offset: 2560)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1249, file: !4, line: 2085, baseType: !949, size: 32, align: 32, offset: 2592)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1249, file: !4, line: 2092, baseType: !949, size: 32, align: 32, offset: 2624)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1249, file: !4, line: 2099, baseType: !949, size: 32, align: 32, offset: 2656)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1249, file: !4, line: 2106, baseType: !949, size: 32, align: 32, offset: 2688)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1249, file: !4, line: 2113, baseType: !949, size: 32, align: 32, offset: 2720)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1249, file: !4, line: 2120, baseType: !949, size: 32, align: 32, offset: 2752)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1249, file: !4, line: 2125, baseType: !949, size: 32, align: 32, offset: 2784)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1249, file: !4, line: 2133, baseType: !949, size: 32, align: 32, offset: 2816)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1249, file: !4, line: 2140, baseType: !949, size: 32, align: 32, offset: 2848)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1249, file: !4, line: 2145, baseType: !949, size: 32, align: 32, offset: 2880)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1249, file: !4, line: 2153, baseType: !949, size: 32, align: 32, offset: 2912)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1249, file: !4, line: 2158, baseType: !949, size: 32, align: 32, offset: 2944)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1249, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1249, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1249, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1249, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1249, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1249, file: !4, line: 2203, baseType: !949, size: 32, align: 32, offset: 3136)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1249, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1249, file: !4, line: 2212, baseType: !949, size: 32, align: 32, offset: 3200)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1249, file: !4, line: 2213, baseType: !949, size: 32, align: 32, offset: 3232)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1249, file: !4, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1249, file: !4, line: 2232, baseType: !949, size: 32, align: 32, offset: 3296)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1249, file: !4, line: 2243, baseType: !949, size: 32, align: 32, offset: 3328)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1249, file: !4, line: 2249, baseType: !949, size: 32, align: 32, offset: 3360)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1249, file: !4, line: 2256, baseType: !949, size: 32, align: 32, offset: 3392)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1249, file: !4, line: 2263, baseType: !1279, size: 64, align: 64, offset: 3456)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1249, file: !4, line: 2270, baseType: !1279, size: 64, align: 64, offset: 3520)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1249, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1249, file: !4, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1249, file: !4, line: 2367, baseType: !1578, size: 64, align: 64, offset: 3648)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64, align: 64)
!1579 = !DISubroutineType(types: !1580)
!1580 = !{!949, !1505, !1465, !949}
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1249, file: !4, line: 2383, baseType: !949, size: 32, align: 32, offset: 3712)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1249, file: !4, line: 2386, baseType: !1512, size: 32, align: 32, offset: 3744)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1249, file: !4, line: 2387, baseType: !1512, size: 32, align: 32, offset: 3776)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1249, file: !4, line: 2394, baseType: !949, size: 32, align: 32, offset: 3808)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1249, file: !4, line: 2401, baseType: !949, size: 32, align: 32, offset: 3840)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1249, file: !4, line: 2408, baseType: !949, size: 32, align: 32, offset: 3872)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1249, file: !4, line: 2415, baseType: !949, size: 32, align: 32, offset: 3904)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1249, file: !4, line: 2422, baseType: !949, size: 32, align: 32, offset: 3936)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1249, file: !4, line: 2423, baseType: !1590, size: 64, align: 64, offset: 3968)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1592)
!1592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1593)
!1593 = !{!1594, !1595, !1596, !1597}
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1592, file: !4, line: 827, baseType: !949, size: 32, align: 32)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1592, file: !4, line: 828, baseType: !949, size: 32, align: 32, offset: 32)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1592, file: !4, line: 829, baseType: !949, size: 32, align: 32, offset: 64)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1592, file: !4, line: 830, baseType: !1512, size: 32, align: 32, offset: 96)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1249, file: !4, line: 2430, baseType: !946, size: 64, align: 64, offset: 4032)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1249, file: !4, line: 2437, baseType: !946, size: 64, align: 64, offset: 4096)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1249, file: !4, line: 2444, baseType: !1512, size: 32, align: 32, offset: 4160)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1249, file: !4, line: 2451, baseType: !1512, size: 32, align: 32, offset: 4192)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1249, file: !4, line: 2458, baseType: !949, size: 32, align: 32, offset: 4224)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1249, file: !4, line: 2469, baseType: !949, size: 32, align: 32, offset: 4256)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1249, file: !4, line: 2475, baseType: !949, size: 32, align: 32, offset: 4288)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1249, file: !4, line: 2481, baseType: !949, size: 32, align: 32, offset: 4320)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1249, file: !4, line: 2485, baseType: !949, size: 32, align: 32, offset: 4352)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1249, file: !4, line: 2489, baseType: !949, size: 32, align: 32, offset: 4384)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1249, file: !4, line: 2493, baseType: !949, size: 32, align: 32, offset: 4416)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1249, file: !4, line: 2501, baseType: !949, size: 32, align: 32, offset: 4448)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1249, file: !4, line: 2506, baseType: !949, size: 32, align: 32, offset: 4480)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1249, file: !4, line: 2510, baseType: !949, size: 32, align: 32, offset: 4512)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1249, file: !4, line: 2514, baseType: !946, size: 64, align: 64, offset: 4544)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1249, file: !4, line: 2528, baseType: !1614, size: 64, align: 64, offset: 4608)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64, align: 64)
!1615 = !DISubroutineType(types: !1616)
!1616 = !{null, !1505, !945, !949, !949}
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1249, file: !4, line: 2534, baseType: !949, size: 32, align: 32, offset: 4672)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1249, file: !4, line: 2545, baseType: !949, size: 32, align: 32, offset: 4704)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1249, file: !4, line: 2547, baseType: !949, size: 32, align: 32, offset: 4736)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1249, file: !4, line: 2549, baseType: !949, size: 32, align: 32, offset: 4768)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1249, file: !4, line: 2551, baseType: !949, size: 32, align: 32, offset: 4800)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1249, file: !4, line: 2553, baseType: !949, size: 32, align: 32, offset: 4832)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1249, file: !4, line: 2555, baseType: !949, size: 32, align: 32, offset: 4864)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1249, file: !4, line: 2557, baseType: !949, size: 32, align: 32, offset: 4896)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1249, file: !4, line: 2559, baseType: !949, size: 32, align: 32, offset: 4928)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1249, file: !4, line: 2563, baseType: !949, size: 32, align: 32, offset: 4960)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1249, file: !4, line: 2571, baseType: !1357, size: 64, align: 64, offset: 4992)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1249, file: !4, line: 2579, baseType: !1357, size: 64, align: 64, offset: 5056)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1249, file: !4, line: 2586, baseType: !949, size: 32, align: 32, offset: 5120)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1249, file: !4, line: 2615, baseType: !949, size: 32, align: 32, offset: 5152)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1249, file: !4, line: 2627, baseType: !949, size: 32, align: 32, offset: 5184)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1249, file: !4, line: 2637, baseType: !949, size: 32, align: 32, offset: 5216)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1249, file: !4, line: 2681, baseType: !949, size: 32, align: 32, offset: 5248)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1249, file: !4, line: 2709, baseType: !946, size: 64, align: 64, offset: 5312)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1249, file: !4, line: 2716, baseType: !1636, size: 64, align: 64, offset: 5376)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1638)
!1638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1639)
!1639 = !{!1640, !1641, !1642, !1643, !1644, !1645, !1646, !1650, !1654, !1655, !1656, !1657, !1663, !1664, !1665, !1666, !1667}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1638, file: !4, line: 3642, baseType: !960, size: 64, align: 64)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1638, file: !4, line: 3649, baseType: !545, size: 32, align: 32, offset: 64)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1638, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1638, file: !4, line: 3663, baseType: !555, size: 32, align: 32, offset: 128)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1638, file: !4, line: 3669, baseType: !949, size: 32, align: 32, offset: 160)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1638, file: !4, line: 3682, baseType: !1462, size: 64, align: 64, offset: 192)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1638, file: !4, line: 3698, baseType: !1647, size: 64, align: 64, offset: 256)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DISubroutineType(types: !1649)
!1649 = !{!949, !1247, !1201, !950}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1638, file: !4, line: 3712, baseType: !1651, size: 64, align: 64, offset: 320)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{!949, !1247, !949, !1201, !950}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1638, file: !4, line: 3726, baseType: !1647, size: 64, align: 64, offset: 384)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1638, file: !4, line: 3737, baseType: !1295, size: 64, align: 64, offset: 448)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1638, file: !4, line: 3746, baseType: !949, size: 32, align: 32, offset: 512)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1638, file: !4, line: 3757, baseType: !1658, size: 64, align: 64, offset: 576)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{null, !1661}
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1638, file: !4, line: 3766, baseType: !1295, size: 64, align: 64, offset: 640)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1638, file: !4, line: 3774, baseType: !1295, size: 64, align: 64, offset: 704)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1638, file: !4, line: 3780, baseType: !949, size: 32, align: 32, offset: 768)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1638, file: !4, line: 3785, baseType: !949, size: 32, align: 32, offset: 800)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1638, file: !4, line: 3795, baseType: !1668, size: 64, align: 64, offset: 832)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{!949, !1247, !1108}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1249, file: !4, line: 2728, baseType: !945, size: 64, align: 64, offset: 5440)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1249, file: !4, line: 2735, baseType: !1389, size: 512, align: 64, offset: 5504)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1249, file: !4, line: 2742, baseType: !949, size: 32, align: 32, offset: 6016)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1249, file: !4, line: 2755, baseType: !949, size: 32, align: 32, offset: 6048)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1249, file: !4, line: 2776, baseType: !949, size: 32, align: 32, offset: 6080)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1249, file: !4, line: 2783, baseType: !949, size: 32, align: 32, offset: 6112)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1249, file: !4, line: 2791, baseType: !949, size: 32, align: 32, offset: 6144)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1249, file: !4, line: 2802, baseType: !1465, size: 64, align: 64, offset: 6208)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1249, file: !4, line: 2811, baseType: !949, size: 32, align: 32, offset: 6272)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1249, file: !4, line: 2821, baseType: !949, size: 32, align: 32, offset: 6304)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1249, file: !4, line: 2830, baseType: !949, size: 32, align: 32, offset: 6336)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1249, file: !4, line: 2840, baseType: !949, size: 32, align: 32, offset: 6368)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1249, file: !4, line: 2851, baseType: !1684, size: 64, align: 64, offset: 6400)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{!949, !1505, !1687, !945, !1447, !949, !949}
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DISubroutineType(types: !1689)
!1689 = !{!949, !1505, !945}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1249, file: !4, line: 2871, baseType: !1691, size: 64, align: 64, offset: 6464)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DISubroutineType(types: !1693)
!1693 = !{!949, !1505, !1694, !945, !1447, !949}
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DISubroutineType(types: !1696)
!1696 = !{!949, !1505, !945, !949, !949}
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1249, file: !4, line: 2878, baseType: !949, size: 32, align: 32, offset: 6528)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1249, file: !4, line: 2885, baseType: !949, size: 32, align: 32, offset: 6560)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1249, file: !4, line: 3005, baseType: !949, size: 32, align: 32, offset: 6592)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1249, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1249, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1249, file: !4, line: 3027, baseType: !909, size: 32, align: 32, offset: 6688)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1249, file: !4, line: 3037, baseType: !1118, size: 64, align: 64, offset: 6720)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1249, file: !4, line: 3038, baseType: !949, size: 32, align: 32, offset: 6784)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1249, file: !4, line: 3050, baseType: !1279, size: 64, align: 64, offset: 6848)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1249, file: !4, line: 3065, baseType: !949, size: 32, align: 32, offset: 6912)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1249, file: !4, line: 3083, baseType: !949, size: 32, align: 32, offset: 6944)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1249, file: !4, line: 3092, baseType: !1008, size: 64, align: 32, offset: 6976)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1249, file: !4, line: 3099, baseType: !555, size: 32, align: 32, offset: 7040)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1249, file: !4, line: 3106, baseType: !1008, size: 64, align: 32, offset: 7072)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1249, file: !4, line: 3113, baseType: !1712, size: 64, align: 64, offset: 7168)
!1712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1713, size: 64, align: 64)
!1713 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1714)
!1714 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1715)
!1715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1716)
!1716 = !{!1717, !1718, !1719, !1720, !1721, !1722, !1725}
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1715, file: !4, line: 713, baseType: !3, size: 32, align: 32)
