; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--omadec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--omadec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecTag = type { i32, i32 }
%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProbeData = type { i8*, i8*, i32, i8* }

!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !918, !919, !928, !932, !933, !938, !940, !944, !946}
!917 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!918 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !922, line: 222, size: 16, align: 8, elements: !923)
!922 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!923 = !{!924}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !921, file: !922, line: 222, baseType: !925, size: 16, align: 16)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !926, line: 49, baseType: !927)
!926 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!927 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !926, line: 48, baseType: !931)
!931 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !922, line: 221, size: 32, align: 8, elements: !935)
!935 = !{!936}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !934, file: !922, line: 221, baseType: !937, size: 32, align: 32)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !926, line: 51, baseType: !918)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !922, line: 220, size: 64, align: 8, elements: !942)
!942 = !{!943}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !941, file: !922, line: 220, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !926, line: 55, baseType: !945)
!945 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !926, line: 40, baseType: !947)
!947 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!948 = !{!949, !2154}
!949 = distinct !DIGlobalVariable(name: "ff_oma_demuxer", scope: !0, file: !950, line: 602, type: !951, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_oma_demuxer)
!950 = !DIFile(filename: "libavformat/omadec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !897, line: 777, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !953)
!953 = !{!954, !958, !959, !960, !961, !971, !1013, !1014, !1016, !1017, !1018, !1031, !2135, !2136, !2137, !2141, !2145, !2146, !2147, !2151, !2152, !2153}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !952, file: !897, line: 638, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !952, file: !897, line: 645, baseType: !955, size: 64, align: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !952, file: !897, line: 652, baseType: !917, size: 32, align: 32, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !952, file: !897, line: 659, baseType: !955, size: 64, align: 64, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !952, file: !897, line: 661, baseType: !962, size: 64, align: 64, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !967, line: 44, size: 64, align: 32, elements: !968)
!967 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!968 = !{!969, !970}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !966, file: !967, line: 45, baseType: !3, size: 32, align: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !966, file: !967, line: 46, baseType: !918, size: 32, align: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !952, file: !897, line: 663, baseType: !972, size: 64, align: 64, offset: 320)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !976)
!976 = !{!977, !978, !983, !987, !988, !989, !990, !994, !1000, !1002, !1006}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !975, file: !464, line: 72, baseType: !955, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !975, file: !464, line: 78, baseType: !979, size: 64, align: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!955, !982}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !975, file: !464, line: 85, baseType: !984, size: 64, align: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !975, file: !464, line: 93, baseType: !917, size: 32, align: 32, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !975, file: !464, line: 99, baseType: !917, size: 32, align: 32, offset: 224)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !975, file: !464, line: 108, baseType: !917, size: 32, align: 32, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !975, file: !464, line: 113, baseType: !991, size: 64, align: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!982, !982, !982}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !975, file: !464, line: 123, baseType: !995, size: 64, align: 64, offset: 384)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!998, !998}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !975, file: !464, line: 130, baseType: !1001, size: 32, align: 32, offset: 448)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !975, file: !464, line: 136, baseType: !1003, size: 64, align: 64, offset: 512)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!1001, !982}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !975, file: !464, line: 142, baseType: !1007, size: 64, align: 64, offset: 576)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!917, !1010, !982, !955, !917}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !952, file: !897, line: 670, baseType: !955, size: 64, align: 64, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !952, file: !897, line: 679, baseType: !1015, size: 64, align: 64, offset: 448)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !952, file: !897, line: 684, baseType: !917, size: 32, align: 32, offset: 512)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !952, file: !897, line: 689, baseType: !917, size: 32, align: 32, offset: 544)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !952, file: !897, line: 696, baseType: !1019, size: 64, align: 64, offset: 576)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!917, !1022}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1025)
!1025 = !{!1026, !1027, !1029, !1030}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1024, file: !897, line: 449, baseType: !955, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1024, file: !897, line: 450, baseType: !1028, size: 64, align: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1024, file: !897, line: 451, baseType: !917, size: 32, align: 32, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1024, file: !897, line: 452, baseType: !955, size: 64, align: 64, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !952, file: !897, line: 703, baseType: !1032, size: 64, align: 64, offset: 640)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!917, !1035}
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1235, !1236, !1299, !1300, !1301, !1992, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2046, !2047, !2048, !2049, !2050, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2101, !2102, !2105, !2106, !2107, !2108, !2109, !2110, !2112, !2113, !2114, !2115, !2123, !2124, !2128, !2132, !2133, !2134}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1036, file: !897, line: 1342, baseType: !972, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1036, file: !897, line: 1349, baseType: !1015, size: 64, align: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1036, file: !897, line: 1356, baseType: !1041, size: 64, align: 64, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1096, !1097, !1101, !1105, !1110, !1116, !1210, !1216, !1222, !1223, !1224, !1225, !1229}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1042, file: !897, line: 498, baseType: !955, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1042, file: !897, line: 504, baseType: !955, size: 64, align: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1042, file: !897, line: 505, baseType: !955, size: 64, align: 64, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1042, file: !897, line: 506, baseType: !955, size: 64, align: 64, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1042, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1042, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1042, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1042, file: !897, line: 517, baseType: !917, size: 32, align: 32, offset: 352)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1042, file: !897, line: 523, baseType: !962, size: 64, align: 64, offset: 384)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1042, file: !897, line: 526, baseType: !972, size: 64, align: 64, offset: 448)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1042, file: !897, line: 535, baseType: !1041, size: 64, align: 64, offset: 512)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1042, file: !897, line: 539, baseType: !917, size: 32, align: 32, offset: 576)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1042, file: !897, line: 541, baseType: !1032, size: 64, align: 64, offset: 640)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1042, file: !897, line: 549, baseType: !1058, size: 64, align: 64, offset: 704)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!917, !1035, !1061}
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1064)
!1064 = !{!1065, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1092, !1093, !1094, !1095}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1063, file: !4, line: 1451, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1068, line: 94, baseType: !1069)
!1068 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1068, line: 81, size: 192, align: 64, elements: !1070)
!1070 = !{!1071, !1075, !1077}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1069, file: !1068, line: 82, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1068, line: 73, baseType: !1074)
!1074 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1068, line: 73, flags: DIFlagFwdDecl)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1069, file: !1068, line: 89, baseType: !1076, size: 64, align: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1069, file: !1068, line: 93, baseType: !917, size: 32, align: 32, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1063, file: !4, line: 1461, baseType: !946, size: 64, align: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1063, file: !4, line: 1467, baseType: !946, size: 64, align: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1063, file: !4, line: 1468, baseType: !1076, size: 64, align: 64, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1063, file: !4, line: 1469, baseType: !917, size: 32, align: 32, offset: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1063, file: !4, line: 1470, baseType: !917, size: 32, align: 32, offset: 288)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1063, file: !4, line: 1474, baseType: !917, size: 32, align: 32, offset: 320)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1063, file: !4, line: 1479, baseType: !1085, size: 64, align: 64, offset: 384)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1088)
!1088 = !{!1089, !1090, !1091}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1087, file: !4, line: 1412, baseType: !1076, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1087, file: !4, line: 1413, baseType: !917, size: 32, align: 32, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1087, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1063, file: !4, line: 1480, baseType: !917, size: 32, align: 32, offset: 448)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1063, file: !4, line: 1486, baseType: !946, size: 64, align: 64, offset: 512)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1063, file: !4, line: 1488, baseType: !946, size: 64, align: 64, offset: 576)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1063, file: !4, line: 1497, baseType: !946, size: 64, align: 64, offset: 640)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1042, file: !897, line: 550, baseType: !1032, size: 64, align: 64, offset: 768)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1042, file: !897, line: 554, baseType: !1098, size: 64, align: 64, offset: 832)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!917, !1035, !1061, !1061, !917}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1042, file: !897, line: 563, baseType: !1102, size: 64, align: 64, offset: 896)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!917, !3, !917}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1042, file: !897, line: 565, baseType: !1106, size: 64, align: 64, offset: 960)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{null, !1035, !917, !1109, !1109}
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1042, file: !897, line: 570, baseType: !1111, size: 64, align: 64, offset: 1024)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!917, !1035, !917, !982, !1114}
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1115, line: 216, baseType: !945)
!1115 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1042, file: !897, line: 581, baseType: !1117, size: 64, align: 64, offset: 1088)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!917, !1035, !917, !1120, !918}
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1124)
!1124 = !{!1125, !1129, !1131, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1164, !1166, !1167, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1123, file: !526, line: 282, baseType: !1126, size: 512, align: 64)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1076, size: 512, align: 64, elements: !1127)
!1127 = !{!1128}
!1128 = !DISubrange(count: 8)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1123, file: !526, line: 299, baseType: !1130, size: 256, align: 32, offset: 512)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 32, elements: !1127)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1123, file: !526, line: 315, baseType: !1132, size: 64, align: 64, offset: 768)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1123, file: !526, line: 326, baseType: !917, size: 32, align: 32, offset: 832)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1123, file: !526, line: 326, baseType: !917, size: 32, align: 32, offset: 864)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1123, file: !526, line: 334, baseType: !917, size: 32, align: 32, offset: 896)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1123, file: !526, line: 341, baseType: !917, size: 32, align: 32, offset: 928)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1123, file: !526, line: 346, baseType: !917, size: 32, align: 32, offset: 960)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1123, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1123, file: !526, line: 356, baseType: !1140, size: 64, align: 32, offset: 1024)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1141, line: 61, baseType: !1142)
!1141 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1141, line: 58, size: 64, align: 32, elements: !1143)
!1143 = !{!1144, !1145}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1142, file: !1141, line: 59, baseType: !917, size: 32, align: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1142, file: !1141, line: 60, baseType: !917, size: 32, align: 32, offset: 32)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1123, file: !526, line: 361, baseType: !946, size: 64, align: 64, offset: 1088)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1123, file: !526, line: 369, baseType: !946, size: 64, align: 64, offset: 1152)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1123, file: !526, line: 377, baseType: !946, size: 64, align: 64, offset: 1216)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1123, file: !526, line: 382, baseType: !917, size: 32, align: 32, offset: 1280)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1123, file: !526, line: 386, baseType: !917, size: 32, align: 32, offset: 1312)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1123, file: !526, line: 391, baseType: !917, size: 32, align: 32, offset: 1344)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1123, file: !526, line: 396, baseType: !982, size: 64, align: 64, offset: 1408)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1123, file: !526, line: 403, baseType: !1154, size: 512, align: 64, offset: 1472)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 512, align: 64, elements: !1127)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1123, file: !526, line: 410, baseType: !917, size: 32, align: 32, offset: 1984)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1123, file: !526, line: 415, baseType: !917, size: 32, align: 32, offset: 2016)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1123, file: !526, line: 420, baseType: !917, size: 32, align: 32, offset: 2048)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1123, file: !526, line: 425, baseType: !917, size: 32, align: 32, offset: 2080)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1123, file: !526, line: 435, baseType: !946, size: 64, align: 64, offset: 2112)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1123, file: !526, line: 440, baseType: !917, size: 32, align: 32, offset: 2176)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1123, file: !526, line: 445, baseType: !944, size: 64, align: 64, offset: 2240)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1123, file: !526, line: 459, baseType: !1163, size: 512, align: 64, offset: 2304)
!1163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1066, size: 512, align: 64, elements: !1127)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1123, file: !526, line: 473, baseType: !1165, size: 64, align: 64, offset: 2816)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1123, file: !526, line: 477, baseType: !917, size: 32, align: 32, offset: 2880)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1123, file: !526, line: 479, baseType: !1168, size: 64, align: 64, offset: 2944)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1172)
!1172 = !{!1173, !1174, !1175, !1176, !1181}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1171, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1171, file: !526, line: 203, baseType: !1076, size: 64, align: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1171, file: !526, line: 204, baseType: !917, size: 32, align: 32, offset: 128)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1171, file: !526, line: 205, baseType: !1177, size: 64, align: 64, offset: 192)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1179, line: 86, baseType: !1180)
!1179 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1180 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1179, line: 86, flags: DIFlagFwdDecl)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1171, file: !526, line: 206, baseType: !1066, size: 64, align: 64, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1123, file: !526, line: 480, baseType: !917, size: 32, align: 32, offset: 3008)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1123, file: !526, line: 505, baseType: !917, size: 32, align: 32, offset: 3040)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1123, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1123, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1123, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1123, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1123, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1123, file: !526, line: 532, baseType: !946, size: 64, align: 64, offset: 3264)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1123, file: !526, line: 539, baseType: !946, size: 64, align: 64, offset: 3328)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1123, file: !526, line: 547, baseType: !946, size: 64, align: 64, offset: 3392)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1123, file: !526, line: 554, baseType: !1177, size: 64, align: 64, offset: 3456)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1123, file: !526, line: 563, baseType: !917, size: 32, align: 32, offset: 3520)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1123, file: !526, line: 572, baseType: !917, size: 32, align: 32, offset: 3552)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1123, file: !526, line: 581, baseType: !917, size: 32, align: 32, offset: 3584)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1123, file: !526, line: 588, baseType: !1197, size: 64, align: 64, offset: 3648)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !926, line: 36, baseType: !1199)
!1199 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1123, file: !526, line: 593, baseType: !917, size: 32, align: 32, offset: 3712)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1123, file: !526, line: 596, baseType: !917, size: 32, align: 32, offset: 3744)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1123, file: !526, line: 599, baseType: !1066, size: 64, align: 64, offset: 3776)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1123, file: !526, line: 605, baseType: !1066, size: 64, align: 64, offset: 3840)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1123, file: !526, line: 616, baseType: !1066, size: 64, align: 64, offset: 3904)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1123, file: !526, line: 626, baseType: !1114, size: 64, align: 64, offset: 3968)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1123, file: !526, line: 627, baseType: !1114, size: 64, align: 64, offset: 4032)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1123, file: !526, line: 628, baseType: !1114, size: 64, align: 64, offset: 4096)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1123, file: !526, line: 629, baseType: !1114, size: 64, align: 64, offset: 4160)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1123, file: !526, line: 645, baseType: !1066, size: 64, align: 64, offset: 4224)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1042, file: !897, line: 587, baseType: !1211, size: 64, align: 64, offset: 1152)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!917, !1035, !1214}
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1042, file: !897, line: 592, baseType: !1217, size: 64, align: 64, offset: 1216)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!917, !1035, !1220}
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1042, file: !897, line: 597, baseType: !1217, size: 64, align: 64, offset: 1280)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1042, file: !897, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1042, file: !897, line: 608, baseType: !1032, size: 64, align: 64, offset: 1408)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1042, file: !897, line: 617, baseType: !1226, size: 64, align: 64, offset: 1472)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{null, !1035}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1042, file: !897, line: 623, baseType: !1230, size: 64, align: 64, offset: 1536)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!917, !1035, !1233}
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1062)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1036, file: !897, line: 1365, baseType: !982, size: 64, align: 64, offset: 192)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1036, file: !897, line: 1379, baseType: !1237, size: 64, align: 64, offset: 256)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1240)
!1240 = !{!1241, !1242, !1243, !1244, !1245, !1246, !1247, !1251, !1252, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1266, !1267, !1271, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1289, !1290, !1291, !1292, !1296, !1297, !1298}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1239, file: !628, line: 174, baseType: !972, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1239, file: !628, line: 226, baseType: !1028, size: 64, align: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1239, file: !628, line: 227, baseType: !917, size: 32, align: 32, offset: 128)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1239, file: !628, line: 228, baseType: !1028, size: 64, align: 64, offset: 192)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1239, file: !628, line: 229, baseType: !1028, size: 64, align: 64, offset: 256)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1239, file: !628, line: 233, baseType: !982, size: 64, align: 64, offset: 320)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1239, file: !628, line: 235, baseType: !1248, size: 64, align: 64, offset: 384)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!917, !982, !1076, !917}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1239, file: !628, line: 236, baseType: !1248, size: 64, align: 64, offset: 448)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1239, file: !628, line: 237, baseType: !1253, size: 64, align: 64, offset: 512)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!946, !982, !946, !917}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1239, file: !628, line: 238, baseType: !946, size: 64, align: 64, offset: 576)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1239, file: !628, line: 239, baseType: !917, size: 32, align: 32, offset: 640)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1239, file: !628, line: 240, baseType: !917, size: 32, align: 32, offset: 672)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1239, file: !628, line: 241, baseType: !917, size: 32, align: 32, offset: 704)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1239, file: !628, line: 242, baseType: !945, size: 64, align: 64, offset: 768)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1239, file: !628, line: 243, baseType: !1028, size: 64, align: 64, offset: 832)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1239, file: !628, line: 244, baseType: !1263, size: 64, align: 64, offset: 896)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!945, !945, !928, !918}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1239, file: !628, line: 245, baseType: !917, size: 32, align: 32, offset: 960)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1239, file: !628, line: 249, baseType: !1268, size: 64, align: 64, offset: 1024)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!917, !982, !917}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1239, file: !628, line: 255, baseType: !1272, size: 64, align: 64, offset: 1088)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!946, !982, !917, !946, !917}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1239, file: !628, line: 260, baseType: !917, size: 32, align: 32, offset: 1152)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1239, file: !628, line: 266, baseType: !946, size: 64, align: 64, offset: 1216)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1239, file: !628, line: 273, baseType: !917, size: 32, align: 32, offset: 1280)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1239, file: !628, line: 279, baseType: !946, size: 64, align: 64, offset: 1344)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1239, file: !628, line: 285, baseType: !917, size: 32, align: 32, offset: 1408)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1239, file: !628, line: 291, baseType: !917, size: 32, align: 32, offset: 1440)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1239, file: !628, line: 298, baseType: !917, size: 32, align: 32, offset: 1472)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1239, file: !628, line: 304, baseType: !917, size: 32, align: 32, offset: 1504)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1239, file: !628, line: 309, baseType: !955, size: 64, align: 64, offset: 1536)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1239, file: !628, line: 314, baseType: !955, size: 64, align: 64, offset: 1600)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1239, file: !628, line: 319, baseType: !1286, size: 64, align: 64, offset: 1664)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!917, !982, !1076, !917, !627, !946}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1239, file: !628, line: 326, baseType: !917, size: 32, align: 32, offset: 1728)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1239, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1239, file: !628, line: 332, baseType: !946, size: 64, align: 64, offset: 1792)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1239, file: !628, line: 338, baseType: !1293, size: 64, align: 64, offset: 1856)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!917, !982}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1239, file: !628, line: 340, baseType: !946, size: 64, align: 64, offset: 1920)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1239, file: !628, line: 346, baseType: !1028, size: 64, align: 64, offset: 1984)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1239, file: !628, line: 351, baseType: !917, size: 32, align: 32, offset: 2048)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1036, file: !897, line: 1386, baseType: !917, size: 32, align: 32, offset: 320)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1036, file: !897, line: 1393, baseType: !918, size: 32, align: 32, offset: 352)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1036, file: !897, line: 1405, baseType: !1302, size: 64, align: 64, offset: 384)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1306)
!1306 = !{!1307, !1308, !1309, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1777, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1878, !1884, !1885, !1889, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1921, !1922, !1923, !1924, !1925, !1926}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1305, file: !897, line: 866, baseType: !917, size: 32, align: 32)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1305, file: !897, line: 872, baseType: !917, size: 32, align: 32, offset: 32)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1305, file: !897, line: 878, baseType: !1310, size: 64, align: 64, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1312)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1313)
!1313 = !{!1314, !1315, !1316, !1317, !1452, !1453, !1454, !1455, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1481, !1485, !1486, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1665, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1312, file: !4, line: 1561, baseType: !972, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1312, file: !4, line: 1562, baseType: !917, size: 32, align: 32, offset: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1312, file: !4, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1312, file: !4, line: 1565, baseType: !1318, size: 64, align: 64, offset: 128)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1320)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1321)
!1321 = !{!1322, !1323, !1324, !1325, !1326, !1327, !1330, !1333, !1336, !1339, !1342, !1343, !1344, !1352, !1353, !1354, !1356, !1360, !1366, !1371, !1375, !1376, !1417, !1424, !1428, !1429, !1433, !1437, !1441, !1445, !1446, !1447}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1320, file: !4, line: 3475, baseType: !955, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1320, file: !4, line: 3480, baseType: !955, size: 64, align: 64, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1320, file: !4, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1320, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1320, file: !4, line: 3487, baseType: !917, size: 32, align: 32, offset: 192)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1320, file: !4, line: 3488, baseType: !1328, size: 64, align: 64, offset: 256)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1140)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1320, file: !4, line: 3489, baseType: !1331, size: 64, align: 64, offset: 320)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1320, file: !4, line: 3490, baseType: !1334, size: 64, align: 64, offset: 384)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1320, file: !4, line: 3491, baseType: !1337, size: 64, align: 64, offset: 448)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1320, file: !4, line: 3492, baseType: !1340, size: 64, align: 64, offset: 512)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1320, file: !4, line: 3493, baseType: !930, size: 8, align: 8, offset: 576)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1320, file: !4, line: 3494, baseType: !972, size: 64, align: 64, offset: 640)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1320, file: !4, line: 3495, baseType: !1345, size: 64, align: 64, offset: 704)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1347)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1348)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1349)
!1349 = !{!1350, !1351}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1348, file: !4, line: 3402, baseType: !917, size: 32, align: 32)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1348, file: !4, line: 3403, baseType: !955, size: 64, align: 64, offset: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1320, file: !4, line: 3507, baseType: !955, size: 64, align: 64, offset: 768)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1320, file: !4, line: 3516, baseType: !917, size: 32, align: 32, offset: 832)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1320, file: !4, line: 3517, baseType: !1355, size: 64, align: 64, offset: 896)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1320, file: !4, line: 3527, baseType: !1357, size: 64, align: 64, offset: 960)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DISubroutineType(types: !1359)
!1359 = !{!917, !1310}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1320, file: !4, line: 3535, baseType: !1361, size: 64, align: 64, offset: 1024)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{!917, !1310, !1364}
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1311)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1320, file: !4, line: 3541, baseType: !1367, size: 64, align: 64, offset: 1088)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1369)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1370)
!1370 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1320, file: !4, line: 3549, baseType: !1372, size: 64, align: 64, offset: 1152)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DISubroutineType(types: !1374)
!1374 = !{null, !1355}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1320, file: !4, line: 3551, baseType: !1357, size: 64, align: 64, offset: 1216)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1320, file: !4, line: 3552, baseType: !1377, size: 64, align: 64, offset: 1280)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DISubroutineType(types: !1379)
!1379 = !{!917, !1310, !1076, !917, !1380}
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1382)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1383)
!1383 = !{!1384, !1385, !1386, !1387, !1388, !1416}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1382, file: !4, line: 3921, baseType: !925, size: 16, align: 16)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1382, file: !4, line: 3922, baseType: !937, size: 32, align: 32, offset: 32)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1382, file: !4, line: 3923, baseType: !937, size: 32, align: 32, offset: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1382, file: !4, line: 3924, baseType: !918, size: 32, align: 32, offset: 96)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1382, file: !4, line: 3925, baseType: !1389, size: 64, align: 64, offset: 128)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1393)
!1393 = !{!1394, !1395, !1396, !1397, !1398, !1399, !1405, !1409, !1411, !1412, !1414, !1415}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1392, file: !4, line: 3886, baseType: !917, size: 32, align: 32)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1392, file: !4, line: 3887, baseType: !917, size: 32, align: 32, offset: 32)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1392, file: !4, line: 3888, baseType: !917, size: 32, align: 32, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1392, file: !4, line: 3889, baseType: !917, size: 32, align: 32, offset: 96)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1392, file: !4, line: 3890, baseType: !917, size: 32, align: 32, offset: 128)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1392, file: !4, line: 3897, baseType: !1400, size: 768, align: 64, offset: 192)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1401)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1402)
!1402 = !{!1403, !1404}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1401, file: !4, line: 3855, baseType: !1126, size: 512, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1401, file: !4, line: 3857, baseType: !1130, size: 256, align: 32, offset: 512)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1392, file: !4, line: 3903, baseType: !1406, size: 256, align: 64, offset: 960)
!1406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1076, size: 256, align: 64, elements: !1407)
!1407 = !{!1408}
!1408 = !DISubrange(count: 4)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1392, file: !4, line: 3904, baseType: !1410, size: 128, align: 32, offset: 1216)
!1410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 128, align: 32, elements: !1407)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1392, file: !4, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1392, file: !4, line: 3908, baseType: !1413, size: 64, align: 64, offset: 1408)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1392, file: !4, line: 3915, baseType: !1413, size: 64, align: 64, offset: 1472)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1392, file: !4, line: 3917, baseType: !917, size: 32, align: 32, offset: 1536)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1382, file: !4, line: 3926, baseType: !946, size: 64, align: 64, offset: 192)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1320, file: !4, line: 3564, baseType: !1418, size: 64, align: 64, offset: 1344)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{!917, !1310, !1061, !1421, !1423}
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1122)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1320, file: !4, line: 3566, baseType: !1425, size: 64, align: 64, offset: 1408)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DISubroutineType(types: !1427)
!1427 = !{!917, !1310, !982, !1423, !1061}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1320, file: !4, line: 3567, baseType: !1357, size: 64, align: 64, offset: 1472)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1320, file: !4, line: 3576, baseType: !1430, size: 64, align: 64, offset: 1536)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DISubroutineType(types: !1432)
!1432 = !{!917, !1310, !1421}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1320, file: !4, line: 3577, baseType: !1434, size: 64, align: 64, offset: 1600)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DISubroutineType(types: !1436)
!1436 = !{!917, !1310, !1061}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1320, file: !4, line: 3584, baseType: !1438, size: 64, align: 64, offset: 1664)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DISubroutineType(types: !1440)
!1440 = !{!917, !1310, !1121}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1320, file: !4, line: 3589, baseType: !1442, size: 64, align: 64, offset: 1728)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{null, !1310}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1320, file: !4, line: 3594, baseType: !917, size: 32, align: 32, offset: 1792)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1320, file: !4, line: 3600, baseType: !955, size: 64, align: 64, offset: 1856)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1320, file: !4, line: 3609, baseType: !1448, size: 64, align: 64, offset: 1920)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1451)
!1451 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1312, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1312, file: !4, line: 1581, baseType: !918, size: 32, align: 32, offset: 224)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1312, file: !4, line: 1583, baseType: !982, size: 64, align: 64, offset: 256)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1312, file: !4, line: 1591, baseType: !1456, size: 64, align: 64, offset: 320)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1312, file: !4, line: 1598, baseType: !982, size: 64, align: 64, offset: 384)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1312, file: !4, line: 1606, baseType: !946, size: 64, align: 64, offset: 448)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1312, file: !4, line: 1614, baseType: !917, size: 32, align: 32, offset: 512)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1312, file: !4, line: 1622, baseType: !917, size: 32, align: 32, offset: 544)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1312, file: !4, line: 1628, baseType: !917, size: 32, align: 32, offset: 576)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1312, file: !4, line: 1636, baseType: !917, size: 32, align: 32, offset: 608)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1312, file: !4, line: 1643, baseType: !917, size: 32, align: 32, offset: 640)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1312, file: !4, line: 1657, baseType: !1076, size: 64, align: 64, offset: 704)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1312, file: !4, line: 1658, baseType: !917, size: 32, align: 32, offset: 768)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1312, file: !4, line: 1679, baseType: !1140, size: 64, align: 32, offset: 800)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1312, file: !4, line: 1688, baseType: !917, size: 32, align: 32, offset: 864)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1312, file: !4, line: 1712, baseType: !917, size: 32, align: 32, offset: 896)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1312, file: !4, line: 1729, baseType: !917, size: 32, align: 32, offset: 928)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1312, file: !4, line: 1729, baseType: !917, size: 32, align: 32, offset: 960)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1312, file: !4, line: 1744, baseType: !917, size: 32, align: 32, offset: 992)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1312, file: !4, line: 1744, baseType: !917, size: 32, align: 32, offset: 1024)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1312, file: !4, line: 1751, baseType: !917, size: 32, align: 32, offset: 1056)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1312, file: !4, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1312, file: !4, line: 1791, baseType: !1477, size: 64, align: 64, offset: 1152)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{null, !1480, !1421, !1423, !917, !917, !917}
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1312, file: !4, line: 1808, baseType: !1482, size: 64, align: 64, offset: 1216)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DISubroutineType(types: !1484)
!1484 = !{!645, !1480, !1331}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1312, file: !4, line: 1816, baseType: !917, size: 32, align: 32, offset: 1280)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1312, file: !4, line: 1825, baseType: !1487, size: 32, align: 32, offset: 1312)
!1487 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1312, file: !4, line: 1830, baseType: !917, size: 32, align: 32, offset: 1344)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1312, file: !4, line: 1838, baseType: !1487, size: 32, align: 32, offset: 1376)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1312, file: !4, line: 1846, baseType: !917, size: 32, align: 32, offset: 1408)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1312, file: !4, line: 1851, baseType: !917, size: 32, align: 32, offset: 1440)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1312, file: !4, line: 1861, baseType: !1487, size: 32, align: 32, offset: 1472)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1312, file: !4, line: 1868, baseType: !1487, size: 32, align: 32, offset: 1504)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1312, file: !4, line: 1875, baseType: !1487, size: 32, align: 32, offset: 1536)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1312, file: !4, line: 1882, baseType: !1487, size: 32, align: 32, offset: 1568)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1312, file: !4, line: 1889, baseType: !1487, size: 32, align: 32, offset: 1600)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1312, file: !4, line: 1896, baseType: !1487, size: 32, align: 32, offset: 1632)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1312, file: !4, line: 1903, baseType: !1487, size: 32, align: 32, offset: 1664)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1312, file: !4, line: 1910, baseType: !917, size: 32, align: 32, offset: 1696)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1312, file: !4, line: 1915, baseType: !917, size: 32, align: 32, offset: 1728)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1312, file: !4, line: 1926, baseType: !1423, size: 64, align: 64, offset: 1792)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1312, file: !4, line: 1935, baseType: !1140, size: 64, align: 32, offset: 1856)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1312, file: !4, line: 1942, baseType: !917, size: 32, align: 32, offset: 1920)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1312, file: !4, line: 1948, baseType: !917, size: 32, align: 32, offset: 1952)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1312, file: !4, line: 1954, baseType: !917, size: 32, align: 32, offset: 1984)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1312, file: !4, line: 1960, baseType: !917, size: 32, align: 32, offset: 2016)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1312, file: !4, line: 1984, baseType: !917, size: 32, align: 32, offset: 2048)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1312, file: !4, line: 1991, baseType: !917, size: 32, align: 32, offset: 2080)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1312, file: !4, line: 1996, baseType: !917, size: 32, align: 32, offset: 2112)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1312, file: !4, line: 2004, baseType: !917, size: 32, align: 32, offset: 2144)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1312, file: !4, line: 2011, baseType: !917, size: 32, align: 32, offset: 2176)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1312, file: !4, line: 2018, baseType: !917, size: 32, align: 32, offset: 2208)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1312, file: !4, line: 2027, baseType: !917, size: 32, align: 32, offset: 2240)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1312, file: !4, line: 2034, baseType: !917, size: 32, align: 32, offset: 2272)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1312, file: !4, line: 2044, baseType: !917, size: 32, align: 32, offset: 2304)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1312, file: !4, line: 2054, baseType: !1517, size: 64, align: 64, offset: 2368)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1312, file: !4, line: 2061, baseType: !1517, size: 64, align: 64, offset: 2432)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1312, file: !4, line: 2066, baseType: !917, size: 32, align: 32, offset: 2496)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1312, file: !4, line: 2070, baseType: !917, size: 32, align: 32, offset: 2528)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1312, file: !4, line: 2078, baseType: !917, size: 32, align: 32, offset: 2560)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1312, file: !4, line: 2085, baseType: !917, size: 32, align: 32, offset: 2592)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1312, file: !4, line: 2092, baseType: !917, size: 32, align: 32, offset: 2624)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1312, file: !4, line: 2099, baseType: !917, size: 32, align: 32, offset: 2656)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1312, file: !4, line: 2106, baseType: !917, size: 32, align: 32, offset: 2688)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1312, file: !4, line: 2113, baseType: !917, size: 32, align: 32, offset: 2720)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1312, file: !4, line: 2120, baseType: !917, size: 32, align: 32, offset: 2752)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1312, file: !4, line: 2125, baseType: !917, size: 32, align: 32, offset: 2784)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1312, file: !4, line: 2133, baseType: !917, size: 32, align: 32, offset: 2816)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1312, file: !4, line: 2140, baseType: !917, size: 32, align: 32, offset: 2848)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1312, file: !4, line: 2145, baseType: !917, size: 32, align: 32, offset: 2880)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1312, file: !4, line: 2153, baseType: !917, size: 32, align: 32, offset: 2912)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1312, file: !4, line: 2158, baseType: !917, size: 32, align: 32, offset: 2944)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1312, file: !4, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1312, file: !4, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1312, file: !4, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1312, file: !4, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1312, file: !4, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1312, file: !4, line: 2203, baseType: !917, size: 32, align: 32, offset: 3136)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1312, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1312, file: !4, line: 2212, baseType: !917, size: 32, align: 32, offset: 3200)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1312, file: !4, line: 2213, baseType: !917, size: 32, align: 32, offset: 3232)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1312, file: !4, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1312, file: !4, line: 2232, baseType: !917, size: 32, align: 32, offset: 3296)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1312, file: !4, line: 2243, baseType: !917, size: 32, align: 32, offset: 3328)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1312, file: !4, line: 2249, baseType: !917, size: 32, align: 32, offset: 3360)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1312, file: !4, line: 2256, baseType: !917, size: 32, align: 32, offset: 3392)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1312, file: !4, line: 2263, baseType: !944, size: 64, align: 64, offset: 3456)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1312, file: !4, line: 2270, baseType: !944, size: 64, align: 64, offset: 3520)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1312, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1312, file: !4, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1312, file: !4, line: 2367, baseType: !1553, size: 64, align: 64, offset: 3648)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DISubroutineType(types: !1555)
!1555 = !{!917, !1480, !1121, !917}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1312, file: !4, line: 2383, baseType: !917, size: 32, align: 32, offset: 3712)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1312, file: !4, line: 2386, baseType: !1487, size: 32, align: 32, offset: 3744)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1312, file: !4, line: 2387, baseType: !1487, size: 32, align: 32, offset: 3776)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1312, file: !4, line: 2394, baseType: !917, size: 32, align: 32, offset: 3808)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1312, file: !4, line: 2401, baseType: !917, size: 32, align: 32, offset: 3840)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1312, file: !4, line: 2408, baseType: !917, size: 32, align: 32, offset: 3872)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1312, file: !4, line: 2415, baseType: !917, size: 32, align: 32, offset: 3904)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1312, file: !4, line: 2422, baseType: !917, size: 32, align: 32, offset: 3936)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1312, file: !4, line: 2423, baseType: !1565, size: 64, align: 64, offset: 3968)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64, align: 64)
!1566 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1567)
!1567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1568)
!1568 = !{!1569, !1570, !1571, !1572}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1567, file: !4, line: 827, baseType: !917, size: 32, align: 32)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1567, file: !4, line: 828, baseType: !917, size: 32, align: 32, offset: 32)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1567, file: !4, line: 829, baseType: !917, size: 32, align: 32, offset: 64)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1567, file: !4, line: 830, baseType: !1487, size: 32, align: 32, offset: 96)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1312, file: !4, line: 2430, baseType: !946, size: 64, align: 64, offset: 4032)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1312, file: !4, line: 2437, baseType: !946, size: 64, align: 64, offset: 4096)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1312, file: !4, line: 2444, baseType: !1487, size: 32, align: 32, offset: 4160)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1312, file: !4, line: 2451, baseType: !1487, size: 32, align: 32, offset: 4192)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1312, file: !4, line: 2458, baseType: !917, size: 32, align: 32, offset: 4224)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1312, file: !4, line: 2469, baseType: !917, size: 32, align: 32, offset: 4256)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1312, file: !4, line: 2475, baseType: !917, size: 32, align: 32, offset: 4288)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1312, file: !4, line: 2481, baseType: !917, size: 32, align: 32, offset: 4320)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1312, file: !4, line: 2485, baseType: !917, size: 32, align: 32, offset: 4352)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1312, file: !4, line: 2489, baseType: !917, size: 32, align: 32, offset: 4384)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1312, file: !4, line: 2493, baseType: !917, size: 32, align: 32, offset: 4416)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1312, file: !4, line: 2501, baseType: !917, size: 32, align: 32, offset: 4448)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1312, file: !4, line: 2506, baseType: !917, size: 32, align: 32, offset: 4480)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1312, file: !4, line: 2510, baseType: !917, size: 32, align: 32, offset: 4512)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1312, file: !4, line: 2514, baseType: !946, size: 64, align: 64, offset: 4544)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1312, file: !4, line: 2528, baseType: !1589, size: 64, align: 64, offset: 4608)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DISubroutineType(types: !1591)
!1591 = !{null, !1480, !982, !917, !917}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1312, file: !4, line: 2534, baseType: !917, size: 32, align: 32, offset: 4672)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1312, file: !4, line: 2545, baseType: !917, size: 32, align: 32, offset: 4704)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1312, file: !4, line: 2547, baseType: !917, size: 32, align: 32, offset: 4736)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1312, file: !4, line: 2549, baseType: !917, size: 32, align: 32, offset: 4768)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1312, file: !4, line: 2551, baseType: !917, size: 32, align: 32, offset: 4800)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1312, file: !4, line: 2553, baseType: !917, size: 32, align: 32, offset: 4832)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1312, file: !4, line: 2555, baseType: !917, size: 32, align: 32, offset: 4864)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1312, file: !4, line: 2557, baseType: !917, size: 32, align: 32, offset: 4896)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1312, file: !4, line: 2559, baseType: !917, size: 32, align: 32, offset: 4928)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1312, file: !4, line: 2563, baseType: !917, size: 32, align: 32, offset: 4960)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1312, file: !4, line: 2571, baseType: !1413, size: 64, align: 64, offset: 4992)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1312, file: !4, line: 2579, baseType: !1413, size: 64, align: 64, offset: 5056)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1312, file: !4, line: 2586, baseType: !917, size: 32, align: 32, offset: 5120)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1312, file: !4, line: 2615, baseType: !917, size: 32, align: 32, offset: 5152)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1312, file: !4, line: 2627, baseType: !917, size: 32, align: 32, offset: 5184)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1312, file: !4, line: 2637, baseType: !917, size: 32, align: 32, offset: 5216)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1312, file: !4, line: 2681, baseType: !917, size: 32, align: 32, offset: 5248)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1312, file: !4, line: 2709, baseType: !946, size: 64, align: 64, offset: 5312)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1312, file: !4, line: 2716, baseType: !1611, size: 64, align: 64, offset: 5376)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1613)
!1613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1614)
!1614 = !{!1615, !1616, !1617, !1618, !1619, !1620, !1621, !1625, !1629, !1630, !1631, !1632, !1638, !1639, !1640, !1641, !1642}
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1613, file: !4, line: 3642, baseType: !955, size: 64, align: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1613, file: !4, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1613, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1613, file: !4, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1613, file: !4, line: 3669, baseType: !917, size: 32, align: 32, offset: 160)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1613, file: !4, line: 3682, baseType: !1438, size: 64, align: 64, offset: 192)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1613, file: !4, line: 3698, baseType: !1622, size: 64, align: 64, offset: 256)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DISubroutineType(types: !1624)
!1624 = !{!917, !1310, !928, !937}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1613, file: !4, line: 3712, baseType: !1626, size: 64, align: 64, offset: 320)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{!917, !1310, !917, !928, !937}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1613, file: !4, line: 3726, baseType: !1622, size: 64, align: 64, offset: 384)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1613, file: !4, line: 3737, baseType: !1357, size: 64, align: 64, offset: 448)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1613, file: !4, line: 3746, baseType: !917, size: 32, align: 32, offset: 512)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1613, file: !4, line: 3757, baseType: !1633, size: 64, align: 64, offset: 576)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DISubroutineType(types: !1635)
!1635 = !{null, !1636}
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1613, file: !4, line: 3766, baseType: !1357, size: 64, align: 64, offset: 640)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1613, file: !4, line: 3774, baseType: !1357, size: 64, align: 64, offset: 704)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1613, file: !4, line: 3780, baseType: !917, size: 32, align: 32, offset: 768)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1613, file: !4, line: 3785, baseType: !917, size: 32, align: 32, offset: 800)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1613, file: !4, line: 3795, baseType: !1643, size: 64, align: 64, offset: 832)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64, align: 64)
!1644 = !DISubroutineType(types: !1645)
!1645 = !{!917, !1310, !1066}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1312, file: !4, line: 2728, baseType: !982, size: 64, align: 64, offset: 5440)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1312, file: !4, line: 2735, baseType: !1154, size: 512, align: 64, offset: 5504)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1312, file: !4, line: 2742, baseType: !917, size: 32, align: 32, offset: 6016)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1312, file: !4, line: 2755, baseType: !917, size: 32, align: 32, offset: 6048)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1312, file: !4, line: 2776, baseType: !917, size: 32, align: 32, offset: 6080)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1312, file: !4, line: 2783, baseType: !917, size: 32, align: 32, offset: 6112)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1312, file: !4, line: 2791, baseType: !917, size: 32, align: 32, offset: 6144)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1312, file: !4, line: 2802, baseType: !1121, size: 64, align: 64, offset: 6208)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1312, file: !4, line: 2811, baseType: !917, size: 32, align: 32, offset: 6272)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1312, file: !4, line: 2821, baseType: !917, size: 32, align: 32, offset: 6304)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1312, file: !4, line: 2830, baseType: !917, size: 32, align: 32, offset: 6336)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1312, file: !4, line: 2840, baseType: !917, size: 32, align: 32, offset: 6368)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1312, file: !4, line: 2851, baseType: !1659, size: 64, align: 64, offset: 6400)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DISubroutineType(types: !1661)
!1661 = !{!917, !1480, !1662, !982, !1423, !917, !917}
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DISubroutineType(types: !1664)
!1664 = !{!917, !1480, !982}
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1312, file: !4, line: 2871, baseType: !1666, size: 64, align: 64, offset: 6464)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DISubroutineType(types: !1668)
!1668 = !{!917, !1480, !1669, !982, !1423, !917}
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DISubroutineType(types: !1671)
!1671 = !{!917, !1480, !982, !917, !917}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1312, file: !4, line: 2878, baseType: !917, size: 32, align: 32, offset: 6528)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1312, file: !4, line: 2885, baseType: !917, size: 32, align: 32, offset: 6560)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1312, file: !4, line: 3005, baseType: !917, size: 32, align: 32, offset: 6592)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1312, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1312, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1312, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1312, file: !4, line: 3037, baseType: !1076, size: 64, align: 64, offset: 6720)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1312, file: !4, line: 3038, baseType: !917, size: 32, align: 32, offset: 6784)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1312, file: !4, line: 3050, baseType: !944, size: 64, align: 64, offset: 6848)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1312, file: !4, line: 3065, baseType: !917, size: 32, align: 32, offset: 6912)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1312, file: !4, line: 3083, baseType: !917, size: 32, align: 32, offset: 6944)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1312, file: !4, line: 3092, baseType: !1140, size: 64, align: 32, offset: 6976)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1312, file: !4, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1312, file: !4, line: 3106, baseType: !1140, size: 64, align: 32, offset: 7072)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1312, file: !4, line: 3113, baseType: !1687, size: 64, align: 64, offset: 7168)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1689)
!1689 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1690)
!1690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1691)
!1691 = !{!1692, !1693, !1694, !1695, !1696, !1697, !1700}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1690, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1690, file: !4, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1690, file: !4, line: 720, baseType: !955, size: 64, align: 64, offset: 64)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1690, file: !4, line: 724, baseType: !955, size: 64, align: 64, offset: 128)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1690, file: !4, line: 728, baseType: !917, size: 32, align: 32, offset: 192)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1690, file: !4, line: 734, baseType: !1698, size: 64, align: 64, offset: 256)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1690, file: !4, line: 739, baseType: !1701, size: 64, align: 64, offset: 320)
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1348)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1312, file: !4, line: 3129, baseType: !946, size: 64, align: 64, offset: 7232)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1312, file: !4, line: 3130, baseType: !946, size: 64, align: 64, offset: 7296)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1312, file: !4, line: 3131, baseType: !946, size: 64, align: 64, offset: 7360)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1312, file: !4, line: 3132, baseType: !946, size: 64, align: 64, offset: 7424)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1312, file: !4, line: 3139, baseType: !1413, size: 64, align: 64, offset: 7488)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1312, file: !4, line: 3147, baseType: !917, size: 32, align: 32, offset: 7552)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1312, file: !4, line: 3165, baseType: !917, size: 32, align: 32, offset: 7584)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1312, file: !4, line: 3172, baseType: !917, size: 32, align: 32, offset: 7616)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1312, file: !4, line: 3180, baseType: !917, size: 32, align: 32, offset: 7648)
