; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--protocols.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--protocols.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.URLProtocol = type { i8*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }
%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }
%struct.AVIOInterruptCB = type { i32 (i8*)*, i8* }
%struct.AVDictionary = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !24, globals: !26)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--protocols.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 29, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!6 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!7 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!8 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!9 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!10 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!11 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!12 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!13 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!14 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!15 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!16 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!17 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!18 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!19 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!20 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!21 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!22 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!23 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!24 = !{!25}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!26 = !{!27}
!27 = distinct !DIGlobalVariable(name: "url_protocols", scope: !0, file: !28, line: 1, type: !29, isLocal: true, isDefinition: true, variable: [29 x %struct.URLProtocol*]* @url_protocols)
!28 = !DIFile(filename: "./libavformat/protocol_list.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 1856, align: 64, elements: !201)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !34, line: 100, baseType: !35)
!34 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !34, line: 54, size: 1600, align: 64, elements: !36)
!36 = !{!37, !41, !118, !127, !132, !136, !142, !148, !152, !153, !157, !161, !162, !168, !169, !170, !171, !172, !173, !174, !175, !194, !195, !196, !200}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !35, file: !34, line: 55, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !35, file: !34, line: 56, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !46, !38, !45}
!45 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !34, line: 52, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !34, line: 38, size: 768, align: 64, elements: !49)
!49 = !{!50, !91, !94, !95, !97, !98, !99, !100, !101, !111, !115, !116, !117}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !48, file: !34, line: 39, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !55)
!55 = !{!56, !57, !61, !65, !66, !67, !68, !72, !78, !80, !84}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !54, file: !4, line: 72, baseType: !38, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !54, file: !4, line: 78, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!38, !25}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !54, file: !4, line: 85, baseType: !62, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !54, file: !4, line: 93, baseType: !45, size: 32, align: 32, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !54, file: !4, line: 99, baseType: !45, size: 32, align: 32, offset: 224)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !54, file: !4, line: 108, baseType: !45, size: 32, align: 32, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !54, file: !4, line: 113, baseType: !69, size: 64, align: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!25, !25, !25}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !54, file: !4, line: 123, baseType: !73, size: 64, align: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!76, !76}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !54, file: !4, line: 130, baseType: !79, size: 32, align: 32, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !54, file: !4, line: 136, baseType: !81, size: 64, align: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!79, !25}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !54, file: !4, line: 142, baseType: !85, size: 64, align: 64, offset: 576)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!45, !88, !25, !38, !45}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !48, file: !34, line: 40, baseType: !92, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !48, file: !34, line: 41, baseType: !25, size: 64, align: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !48, file: !34, line: 42, baseType: !96, size: 64, align: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !48, file: !34, line: 43, baseType: !45, size: 32, align: 32, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !48, file: !34, line: 44, baseType: !45, size: 32, align: 32, offset: 288)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !48, file: !34, line: 45, baseType: !45, size: 32, align: 32, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !48, file: !34, line: 46, baseType: !45, size: 32, align: 32, offset: 352)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !48, file: !34, line: 47, baseType: !102, size: 128, align: 64, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !103, line: 61, baseType: !104)
!103 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !103, line: 58, size: 128, align: 64, elements: !105)
!105 = !{!106, !110}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !104, file: !103, line: 59, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!45, !25}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !104, file: !103, line: 60, baseType: !25, size: 64, align: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !48, file: !34, line: 48, baseType: !112, size: 64, align: 64, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !113, line: 40, baseType: !114)
!113 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!114 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !48, file: !34, line: 49, baseType: !38, size: 64, align: 64, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !48, file: !34, line: 50, baseType: !38, size: 64, align: 64, offset: 640)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !48, file: !34, line: 51, baseType: !45, size: 32, align: 32, offset: 704)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !35, file: !34, line: 62, baseType: !119, size: 64, align: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!45, !46, !38, !45, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !125, line: 86, baseType: !126)
!125 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !125, line: 86, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !35, file: !34, line: 63, baseType: !128, size: 64, align: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!45, !46, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !35, file: !34, line: 64, baseType: !133, size: 64, align: 64, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!45, !46}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !35, file: !34, line: 78, baseType: !137, size: 64, align: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!45, !46, !140, !45}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !35, file: !34, line: 79, baseType: !143, size: 64, align: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!45, !46, !146, !45}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !35, file: !34, line: 80, baseType: !149, size: 64, align: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!112, !46, !112, !45}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !35, file: !34, line: 81, baseType: !133, size: 64, align: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !35, file: !34, line: 82, baseType: !154, size: 64, align: 64, offset: 576)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!45, !46, !45}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !35, file: !34, line: 83, baseType: !158, size: 64, align: 64, offset: 640)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!112, !46, !45, !112, !45}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !35, file: !34, line: 85, baseType: !133, size: 64, align: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !35, file: !34, line: 86, baseType: !163, size: 64, align: 64, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!45, !46, !166, !167}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !35, file: !34, line: 88, baseType: !133, size: 64, align: 64, offset: 832)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !35, file: !34, line: 89, baseType: !154, size: 64, align: 64, offset: 896)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !35, file: !34, line: 90, baseType: !45, size: 32, align: 32, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !35, file: !34, line: 91, baseType: !51, size: 64, align: 64, offset: 1024)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !35, file: !34, line: 92, baseType: !45, size: 32, align: 32, offset: 1088)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !35, file: !34, line: 93, baseType: !154, size: 64, align: 64, offset: 1152)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !35, file: !34, line: 94, baseType: !133, size: 64, align: 64, offset: 1216)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !35, file: !34, line: 95, baseType: !176, size: 64, align: 64, offset: 1280)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!45, !46, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !103, line: 101, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !103, line: 86, size: 576, align: 64, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !189, !190, !191, !192, !193}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !103, line: 87, baseType: !96, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !182, file: !103, line: 88, baseType: !45, size: 32, align: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !182, file: !103, line: 89, baseType: !45, size: 32, align: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !182, file: !103, line: 91, baseType: !112, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !182, file: !103, line: 92, baseType: !112, size: 64, align: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !182, file: !103, line: 94, baseType: !112, size: 64, align: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !182, file: !103, line: 96, baseType: !112, size: 64, align: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !182, file: !103, line: 98, baseType: !112, size: 64, align: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !182, file: !103, line: 99, baseType: !112, size: 64, align: 64, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !182, file: !103, line: 100, baseType: !112, size: 64, align: 64, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !35, file: !34, line: 96, baseType: !133, size: 64, align: 64, offset: 1344)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !35, file: !34, line: 97, baseType: !133, size: 64, align: 64, offset: 1408)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !35, file: !34, line: 98, baseType: !197, size: 64, align: 64, offset: 1472)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!45, !46, !46}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !35, file: !34, line: 99, baseType: !38, size: 64, align: 64, offset: 1536)
!201 = !{!202}
!202 = !DISubrange(count: 29)
!203 = !{i32 2, !"Dwarf Version", i32 4}
!204 = !{i32 2, !"Debug Info Version", i32 3}
!205 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!206 = distinct !DISubprogram(name: "ff_urlcontext_child_class_next", scope: !207, file: !207, line: 74, type: !208, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !210)
!207 = !DIFile(filename: "libavformat/protocols.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!208 = !DISubroutineType(types: !209)
!209 = !{!51, !51}
!210 = !{}
!211 = !DILocalVariable(name: "prev", arg: 1, scope: !206, file: !207, line: 74, type: !51)
!212 = !DIExpression()
!213 = !DILocation(line: 74, column: 62, scope: !206)
!214 = !DILocalVariable(name: "i", scope: !206, file: !207, line: 76, type: !45)
!215 = !DILocation(line: 76, column: 9, scope: !206)
!216 = !DILocation(line: 79, column: 12, scope: !217)
!217 = distinct !DILexicalBlock(scope: !206, file: !207, line: 79, column: 5)
!218 = !DILocation(line: 79, column: 10, scope: !217)
!219 = !DILocation(line: 79, column: 17, scope: !220)
!220 = !DILexicalBlockFile(scope: !221, file: !207, discriminator: 1)
!221 = distinct !DILexicalBlock(scope: !217, file: !207, line: 79, column: 5)
!222 = !DILocation(line: 79, column: 22, scope: !220)
!223 = !DILocation(line: 79, column: 39, scope: !224)
!224 = !DILexicalBlockFile(scope: !221, file: !207, discriminator: 2)
!225 = !DILocation(line: 79, column: 25, scope: !224)
!226 = !DILocation(line: 79, column: 22, scope: !224)
!227 = !DILocation(line: 79, column: 5, scope: !228)
!228 = !DILexicalBlockFile(scope: !217, file: !207, discriminator: 3)
!229 = !DILocation(line: 80, column: 27, scope: !230)
!230 = distinct !DILexicalBlock(scope: !231, file: !207, line: 80, column: 13)
!231 = distinct !DILexicalBlock(scope: !221, file: !207, line: 79, column: 48)
!232 = !DILocation(line: 80, column: 13, scope: !230)
!233 = !DILocation(line: 80, column: 31, scope: !230)
!234 = !DILocation(line: 80, column: 50, scope: !230)
!235 = !DILocation(line: 80, column: 47, scope: !230)
!236 = !DILocation(line: 80, column: 13, scope: !231)
!237 = !DILocation(line: 81, column: 14, scope: !238)
!238 = distinct !DILexicalBlock(scope: !230, file: !207, line: 80, column: 56)
!239 = !DILocation(line: 82, column: 13, scope: !238)
!240 = !DILocation(line: 84, column: 5, scope: !231)
!241 = !DILocation(line: 79, column: 44, scope: !242)
!242 = !DILexicalBlockFile(scope: !221, file: !207, discriminator: 4)
!243 = !DILocation(line: 79, column: 5, scope: !242)
!244 = distinct !{!244, !245}
!245 = !DILocation(line: 79, column: 5, scope: !206)
!246 = !DILocation(line: 87, column: 5, scope: !206)
!247 = !DILocation(line: 87, column: 26, scope: !248)
!248 = !DILexicalBlockFile(scope: !249, file: !207, discriminator: 1)
!249 = distinct !DILexicalBlock(scope: !250, file: !207, line: 87, column: 5)
!250 = distinct !DILexicalBlock(scope: !206, file: !207, line: 87, column: 5)
!251 = !DILocation(line: 87, column: 12, scope: !248)
!252 = !DILocation(line: 87, column: 5, scope: !248)
!253 = !DILocation(line: 88, column: 27, scope: !254)
!254 = distinct !DILexicalBlock(scope: !249, file: !207, line: 88, column: 13)
!255 = !DILocation(line: 88, column: 13, scope: !254)
!256 = !DILocation(line: 88, column: 31, scope: !254)
!257 = !DILocation(line: 88, column: 13, scope: !249)
!258 = !DILocation(line: 89, column: 34, scope: !254)
!259 = !DILocation(line: 89, column: 20, scope: !254)
!260 = !DILocation(line: 89, column: 38, scope: !254)
!261 = !DILocation(line: 89, column: 13, scope: !254)
!262 = !DILocation(line: 88, column: 31, scope: !263)
!263 = !DILexicalBlockFile(scope: !254, file: !207, discriminator: 1)
!264 = !DILocation(line: 87, column: 31, scope: !265)
