; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtmppkt.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtmppkt.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.av_intfloat64 = type { i64 }
%union.unaligned_64 = type { i64 }
%union.unaligned_16 = type { i16 }
%struct.GetByteContext = type { i8*, i8*, i8* }
%struct.RTMPPacket = type { i32, i32, i32, i32, i32, i8*, i32, i32, i32 }
%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!433 = !DILocation(line: 73, column: 57, scope: !419)
!434 = !DILocation(line: 75, column: 25, scope: !419)
!435 = !DILocation(line: 75, column: 37, scope: !419)
!436 = !DILocation(line: 75, column: 30, scope: !419)
!437 = !DILocation(line: 75, column: 5, scope: !422)
!438 = !DILocation(line: 94, column: 339, scope: !220, inlinedAt: !427)
!439 = !DILocation(line: 94, column: 328, scope: !220, inlinedAt: !427)
!440 = !DILocation(line: 60, column: 9, scope: !214, inlinedAt: !426)
!441 = !DILocation(line: 60, column: 10, scope: !214, inlinedAt: !426)
!442 = !DILocation(line: 60, column: 18, scope: !214, inlinedAt: !426)
!443 = !DILocation(line: 60, column: 19, scope: !214, inlinedAt: !426)
!444 = !DILocation(line: 60, column: 15, scope: !214, inlinedAt: !426)
!445 = !DILocation(line: 60, column: 8, scope: !214, inlinedAt: !426)
!446 = !DILocation(line: 60, column: 6, scope: !214, inlinedAt: !426)
!447 = !DILocation(line: 61, column: 12, scope: !214, inlinedAt: !426)
!448 = !DILocation(line: 94, column: 317, scope: !220, inlinedAt: !427)
!449 = !DILocation(line: 94, column: 316, scope: !220, inlinedAt: !427)
!450 = !DILocation(line: 94, column: 322, scope: !220, inlinedAt: !427)
!451 = !DILocation(line: 94, column: 325, scope: !220, inlinedAt: !427)
!452 = !DILocation(line: 94, column: 351, scope: !220, inlinedAt: !427)
!453 = !DILocation(line: 94, column: 354, scope: !220, inlinedAt: !427)
!454 = !DILocation(line: 76, column: 27, scope: !419)
!455 = !DILocation(line: 76, column: 32, scope: !419)
!456 = !DILocation(line: 76, column: 44, scope: !419)
!457 = !DILocation(line: 76, column: 37, scope: !419)
!458 = !DILocation(line: 76, column: 5, scope: !422)
!459 = !DILocation(line: 372, column: 13, scope: !228, inlinedAt: !421)
!460 = !DILocation(line: 372, column: 12, scope: !228, inlinedAt: !421)
!461 = !DILocation(line: 372, column: 16, scope: !228, inlinedAt: !421)
!462 = !DILocation(line: 372, column: 21, scope: !228, inlinedAt: !421)
!463 = !DILocation(line: 372, column: 5, scope: !228, inlinedAt: !421)
!464 = !DILocation(line: 373, column: 13, scope: !228, inlinedAt: !421)
!465 = !DILocation(line: 373, column: 7, scope: !228, inlinedAt: !421)
!466 = !DILocation(line: 373, column: 10, scope: !228, inlinedAt: !421)
!467 = !DILocation(line: 77, column: 1, scope: !419)
!468 = distinct !DISubprogram(name: "ff_amf_write_object_end", scope: !101, file: !101, line: 79, type: !386, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!469 = !DILocalVariable(name: "b", arg: 1, scope: !470, file: !108, line: 93, type: !104)
!470 = distinct !DISubprogram(name: "bytestream_put_be24", scope: !108, file: !108, line: 93, type: !109, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!471 = !DILocation(line: 93, column: 312, scope: !470, inlinedAt: !472)
!472 = distinct !DILocation(line: 84, column: 5, scope: !468)
!473 = !DILocalVariable(name: "value", arg: 2, scope: !470, file: !108, line: 93, type: !111)
!474 = !DILocation(line: 93, column: 334, scope: !470, inlinedAt: !472)
!475 = !DILocalVariable(name: "dst", arg: 1, scope: !468, file: !101, line: 79, type: !104)
!476 = !DILocation(line: 79, column: 40, scope: !468)
!477 = !DILocation(line: 84, column: 25, scope: !468)
!478 = !DILocation(line: 84, column: 5, scope: !468)
!479 = !DILocation(line: 93, column: 371, scope: !480, inlinedAt: !472)
!480 = !DILexicalBlockFile(scope: !481, file: !108, discriminator: 1)
!481 = distinct !DILexicalBlock(scope: !470, file: !108, line: 93, column: 346)
!482 = !DILocation(line: 93, column: 370, scope: !480, inlinedAt: !472)
!483 = !DILocation(line: 93, column: 361, scope: !480, inlinedAt: !472)
!484 = !DILocation(line: 93, column: 360, scope: !480, inlinedAt: !472)
!485 = !DILocation(line: 93, column: 348, scope: !480, inlinedAt: !472)
!486 = !DILocation(line: 93, column: 368, scope: !480, inlinedAt: !472)
!487 = !DILocation(line: 93, column: 402, scope: !480, inlinedAt: !472)
!488 = !DILocation(line: 93, column: 408, scope: !480, inlinedAt: !472)
!489 = !DILocation(line: 93, column: 401, scope: !480, inlinedAt: !472)
!490 = !DILocation(line: 93, column: 392, scope: !480, inlinedAt: !472)
!491 = !DILocation(line: 93, column: 391, scope: !480, inlinedAt: !472)
!492 = !DILocation(line: 93, column: 379, scope: !480, inlinedAt: !472)
!493 = !DILocation(line: 93, column: 399, scope: !480, inlinedAt: !472)
!494 = !DILocation(line: 93, column: 436, scope: !480, inlinedAt: !472)
!495 = !DILocation(line: 93, column: 442, scope: !480, inlinedAt: !472)
!496 = !DILocation(line: 93, column: 435, scope: !480, inlinedAt: !472)
!497 = !DILocation(line: 93, column: 426, scope: !480, inlinedAt: !472)
!498 = !DILocation(line: 93, column: 425, scope: !480, inlinedAt: !472)
!499 = !DILocation(line: 93, column: 433, scope: !480, inlinedAt: !472)
!500 = !DILocation(line: 93, column: 462, scope: !501, inlinedAt: !472)
!501 = !DILexicalBlockFile(scope: !470, file: !108, discriminator: 2)
!502 = !DILocation(line: 93, column: 465, scope: !501, inlinedAt: !472)
!503 = !DILocation(line: 85, column: 1, scope: !468)
!504 = distinct !DISubprogram(name: "ff_amf_read_bool", scope: !101, file: !101, line: 87, type: !505, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!505 = !DISubroutineType(types: !506)
!506 = !{!64, !507, !514}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetByteContext", file: !108, line: 35, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetByteContext", file: !108, line: 33, size: 192, align: 64, elements: !510)
!510 = !{!511, !512, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !509, file: !108, line: 34, baseType: !91, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !509, file: !108, line: 34, baseType: !91, size: 64, align: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !509, file: !108, line: 34, baseType: !91, size: 64, align: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!515 = !DILocalVariable(name: "b", arg: 1, scope: !516, file: !108, line: 95, type: !519)
!516 = distinct !DISubprogram(name: "bytestream_get_byte", scope: !108, file: !108, line: 95, type: !517, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!517 = !DISubroutineType(types: !518)
!518 = !{!65, !519}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!520 = !DILocation(line: 95, column: 95, scope: !516, inlinedAt: !521)
!521 = distinct !DILocation(line: 95, column: 855, scope: !522, inlinedAt: !525)
!522 = distinct !DISubprogram(name: "bytestream2_get_byteu", scope: !108, file: !108, line: 95, type: !523, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!523 = !DISubroutineType(types: !524)
!524 = !{!65, !507}
!525 = distinct !DILocation(line: 95, column: 1073, scope: !526, inlinedAt: !528)
!526 = !DILexicalBlockFile(scope: !527, file: !108, discriminator: 2)
!527 = distinct !DISubprogram(name: "bytestream2_get_byte", scope: !108, file: !108, line: 95, type: !523, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!528 = distinct !DILocation(line: 91, column: 12, scope: !504)
!529 = !DILocalVariable(name: "g", arg: 1, scope: !522, file: !108, line: 95, type: !507)
!530 = !DILocation(line: 95, column: 843, scope: !522, inlinedAt: !525)
!531 = !DILocalVariable(name: "g", arg: 1, scope: !527, file: !108, line: 95, type: !507)
!532 = !DILocation(line: 95, column: 985, scope: !527, inlinedAt: !528)
!533 = !DILocation(line: 95, column: 95, scope: !516, inlinedAt: !534)
!534 = distinct !DILocation(line: 95, column: 855, scope: !522, inlinedAt: !535)
!535 = distinct !DILocation(line: 95, column: 1073, scope: !526, inlinedAt: !536)
!536 = distinct !DILocation(line: 89, column: 9, scope: !537)
!537 = distinct !DILexicalBlock(scope: !504, file: !101, line: 89, column: 9)
!538 = !DILocation(line: 95, column: 843, scope: !522, inlinedAt: !535)
!539 = !DILocation(line: 95, column: 985, scope: !527, inlinedAt: !536)
!540 = !DILocalVariable(name: "bc", arg: 1, scope: !504, file: !101, line: 87, type: !507)
!541 = !DILocation(line: 87, column: 38, scope: !504)
!542 = !DILocalVariable(name: "val", arg: 2, scope: !504, file: !101, line: 87, type: !514)
!543 = !DILocation(line: 87, column: 47, scope: !504)
!544 = !DILocation(line: 89, column: 30, scope: !537)
!545 = !DILocation(line: 89, column: 9, scope: !537)
!546 = !DILocation(line: 95, column: 994, scope: !547, inlinedAt: !536)
!547 = distinct !DILexicalBlock(scope: !527, file: !108, line: 95, column: 994)
!548 = !DILocation(line: 95, column: 997, scope: !547, inlinedAt: !536)
!549 = !DILocation(line: 95, column: 1010, scope: !547, inlinedAt: !536)
!550 = !DILocation(line: 95, column: 1013, scope: !547, inlinedAt: !536)
!551 = !DILocation(line: 95, column: 1008, scope: !547, inlinedAt: !536)
!552 = !DILocation(line: 95, column: 1020, scope: !547, inlinedAt: !536)
!553 = !DILocation(line: 95, column: 994, scope: !527, inlinedAt: !536)
!554 = !DILocation(line: 95, column: 1039, scope: !555, inlinedAt: !536)
!555 = !DILexicalBlockFile(scope: !556, file: !108, discriminator: 1)
!556 = distinct !DILexicalBlock(scope: !547, file: !108, line: 95, column: 1025)
!557 = !DILocation(line: 95, column: 1042, scope: !555, inlinedAt: !536)
!558 = !DILocation(line: 95, column: 1027, scope: !555, inlinedAt: !536)
!559 = !DILocation(line: 95, column: 1030, scope: !555, inlinedAt: !536)
!560 = !DILocation(line: 95, column: 1037, scope: !555, inlinedAt: !536)
!561 = !DILocation(line: 95, column: 1054, scope: !555, inlinedAt: !536)
!562 = !DILocation(line: 95, column: 1095, scope: !526, inlinedAt: !536)
!563 = !DILocation(line: 95, column: 1073, scope: !526, inlinedAt: !536)
!564 = !DILocation(line: 95, column: 876, scope: !522, inlinedAt: !535)
!565 = !DILocation(line: 95, column: 879, scope: !522, inlinedAt: !535)
!566 = !DILocation(line: 95, column: 855, scope: !522, inlinedAt: !535)
!567 = !DILocation(line: 95, column: 102, scope: !516, inlinedAt: !534)
!568 = !DILocation(line: 95, column: 105, scope: !516, inlinedAt: !534)
!569 = !DILocation(line: 95, column: 138, scope: !516, inlinedAt: !534)
!570 = !DILocation(line: 95, column: 137, scope: !516, inlinedAt: !534)
!571 = !DILocation(line: 95, column: 140, scope: !516, inlinedAt: !534)
!572 = !DILocation(line: 95, column: 119, scope: !516, inlinedAt: !534)
!573 = !DILocation(line: 95, column: 118, scope: !516, inlinedAt: !534)
!574 = !DILocation(line: 95, column: 1066, scope: !526, inlinedAt: !536)
!575 = !DILocation(line: 95, column: 1099, scope: !576, inlinedAt: !536)
!576 = !DILexicalBlockFile(scope: !527, file: !108, discriminator: 3)
!577 = !DILocation(line: 89, column: 34, scope: !537)
!578 = !DILocation(line: 89, column: 9, scope: !504)
!579 = !DILocation(line: 90, column: 9, scope: !537)
!580 = !DILocation(line: 91, column: 33, scope: !504)
!581 = !DILocation(line: 91, column: 12, scope: !504)
!582 = !DILocation(line: 95, column: 994, scope: !547, inlinedAt: !528)
!583 = !DILocation(line: 95, column: 997, scope: !547, inlinedAt: !528)
!584 = !DILocation(line: 95, column: 1010, scope: !547, inlinedAt: !528)
!585 = !DILocation(line: 95, column: 1013, scope: !547, inlinedAt: !528)
!586 = !DILocation(line: 95, column: 1008, scope: !547, inlinedAt: !528)
!587 = !DILocation(line: 95, column: 1020, scope: !547, inlinedAt: !528)
!588 = !DILocation(line: 95, column: 994, scope: !527, inlinedAt: !528)
!589 = !DILocation(line: 95, column: 1039, scope: !555, inlinedAt: !528)
!590 = !DILocation(line: 95, column: 1042, scope: !555, inlinedAt: !528)
!591 = !DILocation(line: 95, column: 1027, scope: !555, inlinedAt: !528)
!592 = !DILocation(line: 95, column: 1030, scope: !555, inlinedAt: !528)
!593 = !DILocation(line: 95, column: 1037, scope: !555, inlinedAt: !528)
!594 = !DILocation(line: 95, column: 1054, scope: !555, inlinedAt: !528)
!595 = !DILocation(line: 95, column: 1095, scope: !526, inlinedAt: !528)
!596 = !DILocation(line: 95, column: 1073, scope: !526, inlinedAt: !528)
!597 = !DILocation(line: 95, column: 876, scope: !522, inlinedAt: !525)
!598 = !DILocation(line: 95, column: 879, scope: !522, inlinedAt: !525)
!599 = !DILocation(line: 95, column: 855, scope: !522, inlinedAt: !525)
!600 = !DILocation(line: 95, column: 102, scope: !516, inlinedAt: !521)
!601 = !DILocation(line: 95, column: 105, scope: !516, inlinedAt: !521)
!602 = !DILocation(line: 95, column: 138, scope: !516, inlinedAt: !521)
!603 = !DILocation(line: 95, column: 137, scope: !516, inlinedAt: !521)
!604 = !DILocation(line: 95, column: 140, scope: !516, inlinedAt: !521)
!605 = !DILocation(line: 95, column: 119, scope: !516, inlinedAt: !521)
!606 = !DILocation(line: 95, column: 118, scope: !516, inlinedAt: !521)
!607 = !DILocation(line: 95, column: 1066, scope: !526, inlinedAt: !528)
!608 = !DILocation(line: 95, column: 1099, scope: !576, inlinedAt: !528)
!609 = !DILocation(line: 91, column: 6, scope: !504)
!610 = !DILocation(line: 91, column: 10, scope: !504)
!611 = !DILocation(line: 92, column: 5, scope: !504)
!612 = !DILocation(line: 93, column: 1, scope: !504)
!613 = distinct !DISubprogram(name: "ff_amf_read_number", scope: !101, file: !101, line: 95, type: !614, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!614 = !DISubroutineType(types: !615)
!615 = !{!64, !507, !616}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!617 = !DILocalVariable(name: "b", arg: 1, scope: !618, file: !108, line: 91, type: !519)
!618 = distinct !DISubprogram(name: "bytestream_get_be64", scope: !108, file: !108, line: 91, type: !619, isLocal: true, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!619 = !DISubroutineType(types: !620)
!620 = !{!83, !519}
!621 = !DILocation(line: 91, column: 91, scope: !618, inlinedAt: !622)
!622 = distinct !DILocation(line: 91, column: 884, scope: !623, inlinedAt: !626)
!623 = distinct !DISubprogram(name: "bytestream2_get_be64u", scope: !108, file: !108, line: 91, type: !624, isLocal: true, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!624 = !DISubroutineType(types: !625)
!625 = !{!83, !507}
!626 = distinct !DILocation(line: 91, column: 1098, scope: !627, inlinedAt: !629)
!627 = !DILexicalBlockFile(scope: !628, file: !108, discriminator: 2)
!628 = distinct !DISubprogram(name: "bytestream2_get_be64", scope: !108, file: !108, line: 91, type: !624, isLocal: true, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!629 = distinct !DILocation(line: 100, column: 12, scope: !613)
!630 = !DILocalVariable(name: "g", arg: 1, scope: !623, file: !108, line: 91, type: !507)
!631 = !DILocation(line: 91, column: 872, scope: !623, inlinedAt: !626)
!632 = !DILocalVariable(name: "g", arg: 1, scope: !628, file: !108, line: 91, type: !507)
!633 = !DILocation(line: 91, column: 1010, scope: !628, inlinedAt: !629)
!634 = !DILocalVariable(name: "i", arg: 1, scope: !635, file: !153, line: 60, type: !83)
!635 = distinct !DISubprogram(name: "av_int2double", scope: !153, file: !153, line: 60, type: !636, isLocal: true, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!636 = !DISubroutineType(types: !637)
!637 = !{!150, !83}
!638 = !DILocation(line: 60, column: 76, scope: !635, inlinedAt: !639)
!639 = distinct !DILocation(line: 101, column: 12, scope: !613)
!640 = !DILocalVariable(name: "v", scope: !635, file: !153, line: 62, type: !159)
!641 = !DILocation(line: 62, column: 25, scope: !635, inlinedAt: !639)
!642 = !DILocation(line: 95, column: 95, scope: !516, inlinedAt: !643)
!643 = distinct !DILocation(line: 95, column: 855, scope: !522, inlinedAt: !644)
!644 = distinct !DILocation(line: 95, column: 1073, scope: !526, inlinedAt: !645)
!645 = distinct !DILocation(line: 98, column: 9, scope: !646)
!646 = distinct !DILexicalBlock(scope: !613, file: !101, line: 98, column: 9)
!647 = !DILocation(line: 95, column: 843, scope: !522, inlinedAt: !644)
!648 = !DILocation(line: 95, column: 985, scope: !527, inlinedAt: !645)
!649 = !DILocalVariable(name: "bc", arg: 1, scope: !613, file: !101, line: 95, type: !507)
!650 = !DILocation(line: 95, column: 40, scope: !613)
!651 = !DILocalVariable(name: "val", arg: 2, scope: !613, file: !101, line: 95, type: !616)
!652 = !DILocation(line: 95, column: 52, scope: !613)
!653 = !DILocalVariable(name: "read", scope: !613, file: !101, line: 97, type: !83)
!654 = !DILocation(line: 97, column: 14, scope: !613)
!655 = !DILocation(line: 98, column: 30, scope: !646)
!656 = !DILocation(line: 98, column: 9, scope: !646)
!657 = !DILocation(line: 95, column: 994, scope: !547, inlinedAt: !645)
!658 = !DILocation(line: 95, column: 997, scope: !547, inlinedAt: !645)
!659 = !DILocation(line: 95, column: 1010, scope: !547, inlinedAt: !645)
!660 = !DILocation(line: 95, column: 1013, scope: !547, inlinedAt: !645)
!661 = !DILocation(line: 95, column: 1008, scope: !547, inlinedAt: !645)
!662 = !DILocation(line: 95, column: 1020, scope: !547, inlinedAt: !645)
!663 = !DILocation(line: 95, column: 994, scope: !527, inlinedAt: !645)
!664 = !DILocation(line: 95, column: 1039, scope: !555, inlinedAt: !645)
!665 = !DILocation(line: 95, column: 1042, scope: !555, inlinedAt: !645)
!666 = !DILocation(line: 95, column: 1027, scope: !555, inlinedAt: !645)
!667 = !DILocation(line: 95, column: 1030, scope: !555, inlinedAt: !645)
!668 = !DILocation(line: 95, column: 1037, scope: !555, inlinedAt: !645)
!669 = !DILocation(line: 95, column: 1054, scope: !555, inlinedAt: !645)
!670 = !DILocation(line: 95, column: 1095, scope: !526, inlinedAt: !645)
!671 = !DILocation(line: 95, column: 1073, scope: !526, inlinedAt: !645)
!672 = !DILocation(line: 95, column: 876, scope: !522, inlinedAt: !644)
!673 = !DILocation(line: 95, column: 879, scope: !522, inlinedAt: !644)
!674 = !DILocation(line: 95, column: 855, scope: !522, inlinedAt: !644)
!675 = !DILocation(line: 95, column: 102, scope: !516, inlinedAt: !643)
!676 = !DILocation(line: 95, column: 105, scope: !516, inlinedAt: !643)
!677 = !DILocation(line: 95, column: 138, scope: !516, inlinedAt: !643)
!678 = !DILocation(line: 95, column: 137, scope: !516, inlinedAt: !643)
!679 = !DILocation(line: 95, column: 140, scope: !516, inlinedAt: !643)
!680 = !DILocation(line: 95, column: 119, scope: !516, inlinedAt: !643)
!681 = !DILocation(line: 95, column: 118, scope: !516, inlinedAt: !643)
!682 = !DILocation(line: 95, column: 1066, scope: !526, inlinedAt: !645)
!683 = !DILocation(line: 95, column: 1099, scope: !576, inlinedAt: !645)
!684 = !DILocation(line: 98, column: 34, scope: !646)
!685 = !DILocation(line: 98, column: 9, scope: !613)
!686 = !DILocation(line: 99, column: 9, scope: !646)
!687 = !DILocation(line: 100, column: 33, scope: !613)
!688 = !DILocation(line: 100, column: 12, scope: !613)
!689 = !DILocation(line: 91, column: 1019, scope: !690, inlinedAt: !629)
!690 = distinct !DILexicalBlock(scope: !628, file: !108, line: 91, column: 1019)
!691 = !DILocation(line: 91, column: 1022, scope: !690, inlinedAt: !629)
!692 = !DILocation(line: 91, column: 1035, scope: !690, inlinedAt: !629)
!693 = !DILocation(line: 91, column: 1038, scope: !690, inlinedAt: !629)
!694 = !DILocation(line: 91, column: 1033, scope: !690, inlinedAt: !629)
!695 = !DILocation(line: 91, column: 1045, scope: !690, inlinedAt: !629)
!696 = !DILocation(line: 91, column: 1019, scope: !628, inlinedAt: !629)
!697 = !DILocation(line: 91, column: 1064, scope: !698, inlinedAt: !629)
!698 = !DILexicalBlockFile(scope: !699, file: !108, discriminator: 1)
!699 = distinct !DILexicalBlock(scope: !690, file: !108, line: 91, column: 1050)
!700 = !DILocation(line: 91, column: 1067, scope: !698, inlinedAt: !629)
!701 = !DILocation(line: 91, column: 1052, scope: !698, inlinedAt: !629)
!702 = !DILocation(line: 91, column: 1055, scope: !698, inlinedAt: !629)
!703 = !DILocation(line: 91, column: 1062, scope: !698, inlinedAt: !629)
!704 = !DILocation(line: 91, column: 1079, scope: !698, inlinedAt: !629)
!705 = !DILocation(line: 91, column: 1120, scope: !627, inlinedAt: !629)
!706 = !DILocation(line: 91, column: 1098, scope: !627, inlinedAt: !629)
!707 = !DILocation(line: 91, column: 905, scope: !623, inlinedAt: !626)
!708 = !DILocation(line: 91, column: 908, scope: !623, inlinedAt: !626)
!709 = !DILocation(line: 91, column: 884, scope: !623, inlinedAt: !626)
!710 = !DILocation(line: 91, column: 98, scope: !618, inlinedAt: !622)
!711 = !DILocation(line: 91, column: 101, scope: !618, inlinedAt: !622)
!712 = !DILocation(line: 91, column: 158, scope: !618, inlinedAt: !622)
!713 = !DILocation(line: 91, column: 157, scope: !618, inlinedAt: !622)
!714 = !DILocation(line: 91, column: 160, scope: !618, inlinedAt: !622)
!715 = !DILocation(line: 91, column: 167, scope: !618, inlinedAt: !622)
!716 = !DILocation(line: 91, column: 114, scope: !618, inlinedAt: !622)
!717 = !DILocation(line: 91, column: 1091, scope: !627, inlinedAt: !629)
!718 = !DILocation(line: 91, column: 1124, scope: !719, inlinedAt: !629)
!719 = !DILexicalBlockFile(scope: !628, file: !108, discriminator: 3)
!720 = !DILocation(line: 100, column: 10, scope: !613)
!721 = !DILocation(line: 101, column: 26, scope: !613)
!722 = !DILocation(line: 101, column: 12, scope: !613)
!723 = !DILocation(line: 63, column: 11, scope: !635, inlinedAt: !639)
!724 = !DILocation(line: 63, column: 7, scope: !635, inlinedAt: !639)
!725 = !DILocation(line: 63, column: 9, scope: !635, inlinedAt: !639)
!726 = !DILocation(line: 64, column: 14, scope: !635, inlinedAt: !639)
!727 = !DILocation(line: 101, column: 6, scope: !613)
!728 = !DILocation(line: 101, column: 10, scope: !613)
!729 = !DILocation(line: 102, column: 5, scope: !613)
!730 = !DILocation(line: 103, column: 1, scope: !613)
!731 = distinct !DISubprogram(name: "ff_amf_get_string", scope: !101, file: !101, line: 105, type: !732, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!732 = !DISubroutineType(types: !733)
!733 = !{!64, !507, !76, !64, !514}
!734 = !DILocalVariable(name: "g", arg: 1, scope: !735, file: !108, line: 263, type: !507)
!735 = distinct !DISubprogram(name: "bytestream2_get_buffer", scope: !108, file: !108, line: 263, type: !736, isLocal: true, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!736 = !DISubroutineType(types: !737)
!737 = !{!65, !507, !76, !65}
!738 = !DILocation(line: 263, column: 98, scope: !735, inlinedAt: !739)
!739 = distinct !DILocation(line: 113, column: 16, scope: !731)
!740 = !DILocalVariable(name: "dst", arg: 2, scope: !735, file: !108, line: 264, type: !76)
!741 = !DILocation(line: 264, column: 70, scope: !735, inlinedAt: !739)
!742 = !DILocalVariable(name: "size", arg: 3, scope: !735, file: !108, line: 265, type: !65)
!743 = !DILocation(line: 265, column: 74, scope: !735, inlinedAt: !739)
!744 = !DILocalVariable(name: "size2", scope: !735, file: !108, line: 267, type: !64)
!745 = !DILocation(line: 267, column: 9, scope: !735, inlinedAt: !739)
!746 = !DILocation(line: 58, column: 98, scope: !214, inlinedAt: !747)
!747 = distinct !DILocation(line: 94, column: 118, scope: !748, inlinedAt: !749)
!748 = distinct !DISubprogram(name: "bytestream_get_be16", scope: !108, file: !108, line: 94, type: !517, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!749 = distinct !DILocation(line: 94, column: 904, scope: !750, inlinedAt: !751)
!750 = distinct !DISubprogram(name: "bytestream2_get_be16u", scope: !108, file: !108, line: 94, type: !523, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!751 = distinct !DILocation(line: 94, column: 1122, scope: !752, inlinedAt: !754)
!752 = !DILexicalBlockFile(scope: !753, file: !108, discriminator: 2)
!753 = distinct !DISubprogram(name: "bytestream2_get_be16", scope: !108, file: !108, line: 94, type: !523, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!754 = distinct !DILocation(line: 110, column: 17, scope: !731)
!755 = !DILocalVariable(name: "b", arg: 1, scope: !748, file: !108, line: 94, type: !519)
!756 = !DILocation(line: 94, column: 95, scope: !748, inlinedAt: !749)
!757 = !DILocalVariable(name: "g", arg: 1, scope: !750, file: !108, line: 94, type: !507)
!758 = !DILocation(line: 94, column: 892, scope: !750, inlinedAt: !751)
!759 = !DILocalVariable(name: "g", arg: 1, scope: !753, file: !108, line: 94, type: !507)
!760 = !DILocation(line: 94, column: 1034, scope: !753, inlinedAt: !754)
!761 = !DILocalVariable(name: "bc", arg: 1, scope: !731, file: !101, line: 105, type: !507)
!762 = !DILocation(line: 105, column: 39, scope: !731)
!763 = !DILocalVariable(name: "str", arg: 2, scope: !731, file: !101, line: 105, type: !76)
!764 = !DILocation(line: 105, column: 52, scope: !731)
!765 = !DILocalVariable(name: "strsize", arg: 3, scope: !731, file: !101, line: 106, type: !64)
!766 = !DILocation(line: 106, column: 27, scope: !731)
!767 = !DILocalVariable(name: "length", arg: 4, scope: !731, file: !101, line: 106, type: !514)
!768 = !DILocation(line: 106, column: 41, scope: !731)
!769 = !DILocalVariable(name: "stringlen", scope: !731, file: !101, line: 108, type: !64)
!770 = !DILocation(line: 108, column: 9, scope: !731)
!771 = !DILocalVariable(name: "readsize", scope: !731, file: !101, line: 109, type: !64)
!772 = !DILocation(line: 109, column: 9, scope: !731)
!773 = !DILocation(line: 110, column: 38, scope: !731)
!774 = !DILocation(line: 110, column: 17, scope: !731)
!775 = !DILocation(line: 94, column: 1043, scope: !776, inlinedAt: !754)
!776 = distinct !DILexicalBlock(scope: !753, file: !108, line: 94, column: 1043)
!777 = !DILocation(line: 94, column: 1046, scope: !776, inlinedAt: !754)
!778 = !DILocation(line: 94, column: 1059, scope: !776, inlinedAt: !754)
!779 = !DILocation(line: 94, column: 1062, scope: !776, inlinedAt: !754)
!780 = !DILocation(line: 94, column: 1057, scope: !776, inlinedAt: !754)
!781 = !DILocation(line: 94, column: 1069, scope: !776, inlinedAt: !754)
!782 = !DILocation(line: 94, column: 1043, scope: !753, inlinedAt: !754)
!783 = !DILocation(line: 94, column: 1088, scope: !784, inlinedAt: !754)
!784 = !DILexicalBlockFile(scope: !785, file: !108, discriminator: 1)
!785 = distinct !DILexicalBlock(scope: !776, file: !108, line: 94, column: 1074)
!786 = !DILocation(line: 94, column: 1091, scope: !784, inlinedAt: !754)
!787 = !DILocation(line: 94, column: 1076, scope: !784, inlinedAt: !754)
!788 = !DILocation(line: 94, column: 1079, scope: !784, inlinedAt: !754)
!789 = !DILocation(line: 94, column: 1086, scope: !784, inlinedAt: !754)
!790 = !DILocation(line: 94, column: 1103, scope: !784, inlinedAt: !754)
!791 = !DILocation(line: 94, column: 1144, scope: !752, inlinedAt: !754)
!792 = !DILocation(line: 94, column: 1122, scope: !752, inlinedAt: !754)
!793 = !DILocation(line: 94, column: 925, scope: !750, inlinedAt: !751)
!794 = !DILocation(line: 94, column: 928, scope: !750, inlinedAt: !751)
!795 = !DILocation(line: 94, column: 904, scope: !750, inlinedAt: !751)
!796 = !DILocation(line: 94, column: 102, scope: !748, inlinedAt: !749)
!797 = !DILocation(line: 94, column: 105, scope: !748, inlinedAt: !749)
!798 = !DILocation(line: 94, column: 162, scope: !748, inlinedAt: !749)
!799 = !DILocation(line: 94, column: 161, scope: !748, inlinedAt: !749)
!800 = !DILocation(line: 94, column: 164, scope: !748, inlinedAt: !749)
!801 = !DILocation(line: 94, column: 171, scope: !748, inlinedAt: !749)
!802 = !DILocation(line: 94, column: 118, scope: !748, inlinedAt: !749)
!803 = !DILocation(line: 60, column: 9, scope: !214, inlinedAt: !747)
!804 = !DILocation(line: 60, column: 10, scope: !214, inlinedAt: !747)
!805 = !DILocation(line: 60, column: 18, scope: !214, inlinedAt: !747)
!806 = !DILocation(line: 60, column: 19, scope: !214, inlinedAt: !747)
!807 = !DILocation(line: 60, column: 15, scope: !214, inlinedAt: !747)
!808 = !DILocation(line: 60, column: 8, scope: !214, inlinedAt: !747)
!809 = !DILocation(line: 60, column: 6, scope: !214, inlinedAt: !747)
!810 = !DILocation(line: 61, column: 12, scope: !214, inlinedAt: !747)
!811 = !DILocation(line: 94, column: 1115, scope: !752, inlinedAt: !754)
!812 = !DILocation(line: 94, column: 1148, scope: !813, inlinedAt: !754)
!813 = !DILexicalBlockFile(scope: !753, file: !108, discriminator: 3)
!814 = !DILocation(line: 110, column: 15, scope: !731)
!815 = !DILocation(line: 111, column: 9, scope: !816)
!816 = distinct !DILexicalBlock(scope: !731, file: !101, line: 111, column: 9)
!817 = !DILocation(line: 111, column: 19, scope: !816)
!818 = !DILocation(line: 111, column: 25, scope: !816)
!819 = !DILocation(line: 111, column: 23, scope: !816)
!820 = !DILocation(line: 111, column: 9, scope: !731)
!821 = !DILocation(line: 112, column: 9, scope: !816)
!822 = !DILocation(line: 113, column: 39, scope: !731)
!823 = !DILocation(line: 113, column: 43, scope: !731)
!824 = !DILocation(line: 113, column: 48, scope: !731)
!825 = !DILocation(line: 113, column: 16, scope: !731)
!826 = !DILocation(line: 267, column: 19, scope: !735, inlinedAt: !739)
!827 = !DILocation(line: 267, column: 22, scope: !735, inlinedAt: !739)
!828 = !DILocation(line: 267, column: 35, scope: !735, inlinedAt: !739)
!829 = !DILocation(line: 267, column: 38, scope: !735, inlinedAt: !739)
!830 = !DILocation(line: 267, column: 33, scope: !735, inlinedAt: !739)
!831 = !DILocation(line: 267, column: 49, scope: !735, inlinedAt: !739)
!832 = !DILocation(line: 267, column: 48, scope: !735, inlinedAt: !739)
!833 = !DILocation(line: 267, column: 46, scope: !735, inlinedAt: !739)
!834 = !DILocation(line: 267, column: 18, scope: !735, inlinedAt: !739)
!835 = !DILocation(line: 267, column: 58, scope: !836, inlinedAt: !739)
!836 = !DILexicalBlockFile(scope: !735, file: !108, discriminator: 1)
!837 = !DILocation(line: 267, column: 57, scope: !836, inlinedAt: !739)
!838 = !DILocation(line: 267, column: 18, scope: !836, inlinedAt: !739)
!839 = !DILocation(line: 267, column: 67, scope: !840, inlinedAt: !739)
!840 = !DILexicalBlockFile(scope: !735, file: !108, discriminator: 2)
!841 = !DILocation(line: 267, column: 70, scope: !840, inlinedAt: !739)
!842 = !DILocation(line: 267, column: 83, scope: !840, inlinedAt: !739)
!843 = !DILocation(line: 267, column: 86, scope: !840, inlinedAt: !739)
!844 = !DILocation(line: 267, column: 81, scope: !840, inlinedAt: !739)
!845 = !DILocation(line: 267, column: 18, scope: !840, inlinedAt: !739)
!846 = !DILocation(line: 267, column: 18, scope: !847, inlinedAt: !739)
!847 = !DILexicalBlockFile(scope: !735, file: !108, discriminator: 3)
!848 = !DILocation(line: 267, column: 17, scope: !847, inlinedAt: !739)
!849 = !DILocation(line: 267, column: 9, scope: !847, inlinedAt: !739)
!850 = !DILocation(line: 268, column: 12, scope: !735, inlinedAt: !739)
!851 = !DILocation(line: 268, column: 17, scope: !735, inlinedAt: !739)
!852 = !DILocation(line: 268, column: 20, scope: !735, inlinedAt: !739)
!853 = !DILocation(line: 268, column: 28, scope: !735, inlinedAt: !739)
!854 = !DILocation(line: 268, column: 5, scope: !735, inlinedAt: !739)
!855 = !DILocation(line: 269, column: 18, scope: !735, inlinedAt: !739)
!856 = !DILocation(line: 269, column: 5, scope: !735, inlinedAt: !739)
!857 = !DILocation(line: 269, column: 8, scope: !735, inlinedAt: !739)
!858 = !DILocation(line: 269, column: 15, scope: !735, inlinedAt: !739)
!859 = !DILocation(line: 270, column: 12, scope: !735, inlinedAt: !739)
!860 = !DILocation(line: 113, column: 14, scope: !731)
!861 = !DILocation(line: 114, column: 9, scope: !862)
!862 = distinct !DILexicalBlock(scope: !731, file: !101, line: 114, column: 9)
!863 = !DILocation(line: 114, column: 21, scope: !862)
!864 = !DILocation(line: 114, column: 18, scope: !862)
!865 = !DILocation(line: 114, column: 9, scope: !731)
!866 = !DILocation(line: 115, column: 9, scope: !867)
!867 = distinct !DILexicalBlock(scope: !862, file: !101, line: 114, column: 32)
!868 = !DILocation(line: 117, column: 5, scope: !867)
!869 = !DILocation(line: 118, column: 9, scope: !731)
!870 = !DILocation(line: 118, column: 5, scope: !731)
!871 = !DILocation(line: 118, column: 19, scope: !731)
!872 = !DILocation(line: 119, column: 17, scope: !731)
!873 = !DILocation(line: 119, column: 31, scope: !731)
!874 = !DILocation(line: 119, column: 28, scope: !731)
!875 = !DILocation(line: 119, column: 16, scope: !731)
!876 = !DILocation(line: 119, column: 44, scope: !877)
!877 = !DILexicalBlockFile(scope: !731, file: !101, discriminator: 1)
!878 = !DILocation(line: 119, column: 16, scope: !877)
!879 = !DILocation(line: 119, column: 57, scope: !880)
!880 = !DILexicalBlockFile(scope: !731, file: !101, discriminator: 2)
!881 = !DILocation(line: 119, column: 16, scope: !880)
!882 = !DILocation(line: 119, column: 16, scope: !883)
!883 = !DILexicalBlockFile(scope: !731, file: !101, discriminator: 3)
!884 = !DILocation(line: 119, column: 6, scope: !883)
!885 = !DILocation(line: 119, column: 13, scope: !883)
!886 = !DILocation(line: 120, column: 5, scope: !731)
!887 = !DILocation(line: 121, column: 1, scope: !731)
!888 = distinct !DISubprogram(name: "ff_amf_read_string", scope: !101, file: !101, line: 123, type: !732, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!889 = !DILocation(line: 95, column: 95, scope: !516, inlinedAt: !890)
!890 = distinct !DILocation(line: 95, column: 855, scope: !522, inlinedAt: !891)
!891 = distinct !DILocation(line: 95, column: 1073, scope: !526, inlinedAt: !892)
!892 = distinct !DILocation(line: 126, column: 9, scope: !893)
!893 = distinct !DILexicalBlock(scope: !888, file: !101, line: 126, column: 9)
!894 = !DILocation(line: 95, column: 843, scope: !522, inlinedAt: !891)
!895 = !DILocation(line: 95, column: 985, scope: !527, inlinedAt: !892)
!896 = !DILocalVariable(name: "bc", arg: 1, scope: !888, file: !101, line: 123, type: !507)
!897 = !DILocation(line: 123, column: 40, scope: !888)
!898 = !DILocalVariable(name: "str", arg: 2, scope: !888, file: !101, line: 123, type: !76)
!899 = !DILocation(line: 123, column: 53, scope: !888)
!900 = !DILocalVariable(name: "strsize", arg: 3, scope: !888, file: !101, line: 124, type: !64)
!901 = !DILocation(line: 124, column: 28, scope: !888)
!902 = !DILocalVariable(name: "length", arg: 4, scope: !888, file: !101, line: 124, type: !514)
!903 = !DILocation(line: 124, column: 42, scope: !888)
!904 = !DILocation(line: 126, column: 30, scope: !893)
!905 = !DILocation(line: 126, column: 9, scope: !893)
!906 = !DILocation(line: 95, column: 994, scope: !547, inlinedAt: !892)
!907 = !DILocation(line: 95, column: 997, scope: !547, inlinedAt: !892)
!908 = !DILocation(line: 95, column: 1010, scope: !547, inlinedAt: !892)
!909 = !DILocation(line: 95, column: 1013, scope: !547, inlinedAt: !892)
!910 = !DILocation(line: 95, column: 1008, scope: !547, inlinedAt: !892)
!911 = !DILocation(line: 95, column: 1020, scope: !547, inlinedAt: !892)
!912 = !DILocation(line: 95, column: 994, scope: !527, inlinedAt: !892)
!913 = !DILocation(line: 95, column: 1039, scope: !555, inlinedAt: !892)
!914 = !DILocation(line: 95, column: 1042, scope: !555, inlinedAt: !892)
!915 = !DILocation(line: 95, column: 1027, scope: !555, inlinedAt: !892)
!916 = !DILocation(line: 95, column: 1030, scope: !555, inlinedAt: !892)
!917 = !DILocation(line: 95, column: 1037, scope: !555, inlinedAt: !892)
!918 = !DILocation(line: 95, column: 1054, scope: !555, inlinedAt: !892)
!919 = !DILocation(line: 95, column: 1095, scope: !526, inlinedAt: !892)
!920 = !DILocation(line: 95, column: 1073, scope: !526, inlinedAt: !892)
!921 = !DILocation(line: 95, column: 876, scope: !522, inlinedAt: !891)
!922 = !DILocation(line: 95, column: 879, scope: !522, inlinedAt: !891)
!923 = !DILocation(line: 95, column: 855, scope: !522, inlinedAt: !891)
!924 = !DILocation(line: 95, column: 102, scope: !516, inlinedAt: !890)
!925 = !DILocation(line: 95, column: 105, scope: !516, inlinedAt: !890)
!926 = !DILocation(line: 95, column: 138, scope: !516, inlinedAt: !890)
!927 = !DILocation(line: 95, column: 137, scope: !516, inlinedAt: !890)
!928 = !DILocation(line: 95, column: 140, scope: !516, inlinedAt: !890)
!929 = !DILocation(line: 95, column: 119, scope: !516, inlinedAt: !890)
!930 = !DILocation(line: 95, column: 118, scope: !516, inlinedAt: !890)
!931 = !DILocation(line: 95, column: 1066, scope: !526, inlinedAt: !892)
!932 = !DILocation(line: 95, column: 1099, scope: !576, inlinedAt: !892)
!933 = !DILocation(line: 126, column: 34, scope: !893)
!934 = !DILocation(line: 126, column: 9, scope: !888)
!935 = !DILocation(line: 127, column: 9, scope: !893)
!936 = !DILocation(line: 128, column: 30, scope: !888)
!937 = !DILocation(line: 128, column: 34, scope: !888)
!938 = !DILocation(line: 128, column: 39, scope: !888)
!939 = !DILocation(line: 128, column: 48, scope: !888)
!940 = !DILocation(line: 128, column: 12, scope: !888)
!941 = !DILocation(line: 128, column: 5, scope: !888)
!942 = !DILocation(line: 129, column: 1, scope: !888)
!943 = distinct !DISubprogram(name: "ff_amf_read_null", scope: !101, file: !101, line: 131, type: !944, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!944 = !DISubroutineType(types: !945)
!945 = !{!64, !507}
!946 = !DILocation(line: 95, column: 95, scope: !516, inlinedAt: !947)
!947 = distinct !DILocation(line: 95, column: 855, scope: !522, inlinedAt: !948)
!948 = distinct !DILocation(line: 95, column: 1073, scope: !526, inlinedAt: !949)
!949 = distinct !DILocation(line: 133, column: 9, scope: !950)
!950 = distinct !DILexicalBlock(scope: !943, file: !101, line: 133, column: 9)
!951 = !DILocation(line: 95, column: 843, scope: !522, inlinedAt: !948)
!952 = !DILocation(line: 95, column: 985, scope: !527, inlinedAt: !949)
!953 = !DILocalVariable(name: "bc", arg: 1, scope: !943, file: !101, line: 131, type: !507)
!954 = !DILocation(line: 131, column: 38, scope: !943)
!955 = !DILocation(line: 133, column: 30, scope: !950)
!956 = !DILocation(line: 133, column: 9, scope: !950)
!957 = !DILocation(line: 95, column: 994, scope: !547, inlinedAt: !949)
!958 = !DILocation(line: 95, column: 997, scope: !547, inlinedAt: !949)
!959 = !DILocation(line: 95, column: 1010, scope: !547, inlinedAt: !949)
!960 = !DILocation(line: 95, column: 1013, scope: !547, inlinedAt: !949)
!961 = !DILocation(line: 95, column: 1008, scope: !547, inlinedAt: !949)
!962 = !DILocation(line: 95, column: 1020, scope: !547, inlinedAt: !949)
!963 = !DILocation(line: 95, column: 994, scope: !527, inlinedAt: !949)
!964 = !DILocation(line: 95, column: 1039, scope: !555, inlinedAt: !949)
!965 = !DILocation(line: 95, column: 1042, scope: !555, inlinedAt: !949)
!966 = !DILocation(line: 95, column: 1027, scope: !555, inlinedAt: !949)
!967 = !DILocation(line: 95, column: 1030, scope: !555, inlinedAt: !949)
!968 = !DILocation(line: 95, column: 1037, scope: !555, inlinedAt: !949)
!969 = !DILocation(line: 95, column: 1054, scope: !555, inlinedAt: !949)
!970 = !DILocation(line: 95, column: 1095, scope: !526, inlinedAt: !949)
!971 = !DILocation(line: 95, column: 1073, scope: !526, inlinedAt: !949)
!972 = !DILocation(line: 95, column: 876, scope: !522, inlinedAt: !948)
!973 = !DILocation(line: 95, column: 879, scope: !522, inlinedAt: !948)
!974 = !DILocation(line: 95, column: 855, scope: !522, inlinedAt: !948)
!975 = !DILocation(line: 95, column: 102, scope: !516, inlinedAt: !947)
!976 = !DILocation(line: 95, column: 105, scope: !516, inlinedAt: !947)
!977 = !DILocation(line: 95, column: 138, scope: !516, inlinedAt: !947)
!978 = !DILocation(line: 95, column: 137, scope: !516, inlinedAt: !947)
!979 = !DILocation(line: 95, column: 140, scope: !516, inlinedAt: !947)
!980 = !DILocation(line: 95, column: 119, scope: !516, inlinedAt: !947)
!981 = !DILocation(line: 95, column: 118, scope: !516, inlinedAt: !947)
!982 = !DILocation(line: 95, column: 1066, scope: !526, inlinedAt: !949)
!983 = !DILocation(line: 95, column: 1099, scope: !576, inlinedAt: !949)
!984 = !DILocation(line: 133, column: 34, scope: !950)
!985 = !DILocation(line: 133, column: 9, scope: !943)
!986 = !DILocation(line: 134, column: 9, scope: !950)
!987 = !DILocation(line: 135, column: 5, scope: !943)
!988 = !DILocation(line: 136, column: 1, scope: !943)
!989 = distinct !DISubprogram(name: "ff_rtmp_check_alloc_array", scope: !101, file: !101, line: 138, type: !990, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!990 = !DISubroutineType(types: !991)
!991 = !{!64, !992, !514, !64}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTMPPacket", file: !20, line: 87, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RTMPPacket", file: !20, line: 77, size: 384, align: 64, elements: !996)
!996 = !{!997, !998, !1000, !1001, !1002, !1003, !1004, !1005, !1006}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "channel_id", scope: !995, file: !20, line: 78, baseType: !64, size: 32, align: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !995, file: !20, line: 79, baseType: !999, size: 32, align: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTMPPacketType", file: !20, line: 62, baseType: !19)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !995, file: !20, line: 80, baseType: !72, size: 32, align: 32, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "ts_field", scope: !995, file: !20, line: 81, baseType: !72, size: 32, align: 32, offset: 96)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !995, file: !20, line: 82, baseType: !72, size: 32, align: 32, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !995, file: !20, line: 83, baseType: !76, size: 64, align: 64, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !995, file: !20, line: 84, baseType: !64, size: 32, align: 32, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !995, file: !20, line: 85, baseType: !64, size: 32, align: 32, offset: 288)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !995, file: !20, line: 86, baseType: !64, size: 32, align: 32, offset: 320)
!1007 = !DILocalVariable(name: "prev_pkt", arg: 1, scope: !989, file: !101, line: 138, type: !992)
!1008 = !DILocation(line: 138, column: 44, scope: !989)
!1009 = !DILocalVariable(name: "nb_prev_pkt", arg: 2, scope: !989, file: !101, line: 138, type: !514)
!1010 = !DILocation(line: 138, column: 59, scope: !989)
!1011 = !DILocalVariable(name: "channel", arg: 3, scope: !989, file: !101, line: 139, type: !64)
!1012 = !DILocation(line: 139, column: 35, scope: !989)
!1013 = !DILocalVariable(name: "nb_alloc", scope: !989, file: !101, line: 141, type: !64)
!1014 = !DILocation(line: 141, column: 9, scope: !989)
!1015 = !DILocalVariable(name: "ptr", scope: !989, file: !101, line: 142, type: !993)
!1016 = !DILocation(line: 142, column: 17, scope: !989)
!1017 = !DILocation(line: 143, column: 9, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !989, file: !101, line: 143, column: 9)
!1019 = !DILocation(line: 143, column: 20, scope: !1018)
!1020 = !DILocation(line: 143, column: 19, scope: !1018)
!1021 = !DILocation(line: 143, column: 17, scope: !1018)
!1022 = !DILocation(line: 143, column: 9, scope: !989)
!1023 = !DILocation(line: 144, column: 9, scope: !1018)
!1024 = !DILocation(line: 146, column: 16, scope: !989)
!1025 = !DILocation(line: 146, column: 24, scope: !989)
!1026 = !DILocation(line: 146, column: 14, scope: !989)
!1027 = !DILocation(line: 150, column: 29, scope: !989)
!1028 = !DILocation(line: 150, column: 28, scope: !989)
!1029 = !DILocation(line: 150, column: 39, scope: !989)
!1030 = !DILocation(line: 150, column: 11, scope: !989)
!1031 = !DILocation(line: 150, column: 9, scope: !989)
!1032 = !DILocation(line: 151, column: 10, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !989, file: !101, line: 151, column: 9)
!1034 = !DILocation(line: 151, column: 9, scope: !989)
!1035 = !DILocation(line: 152, column: 9, scope: !1033)
!1036 = !DILocation(line: 153, column: 12, scope: !989)
!1037 = !DILocation(line: 153, column: 19, scope: !989)
!1038 = !DILocation(line: 153, column: 18, scope: !989)
!1039 = !DILocation(line: 153, column: 16, scope: !989)
!1040 = !DILocation(line: 153, column: 5, scope: !989)
!1041 = !DILocation(line: 153, column: 36, scope: !989)
!1042 = !DILocation(line: 153, column: 48, scope: !989)
!1043 = !DILocation(line: 153, column: 47, scope: !989)
!1044 = !DILocation(line: 153, column: 45, scope: !989)
!1045 = !DILocation(line: 153, column: 35, scope: !989)
!1046 = !DILocation(line: 153, column: 61, scope: !989)
!1047 = !DILocation(line: 154, column: 17, scope: !989)
!1048 = !DILocation(line: 154, column: 6, scope: !989)
!1049 = !DILocation(line: 154, column: 15, scope: !989)
!1050 = !DILocation(line: 155, column: 20, scope: !989)
!1051 = !DILocation(line: 155, column: 6, scope: !989)
!1052 = !DILocation(line: 155, column: 18, scope: !989)
!1053 = !DILocation(line: 156, column: 5, scope: !989)
!1054 = !DILocation(line: 157, column: 1, scope: !989)
!1055 = distinct !DISubprogram(name: "ff_rtmp_packet_read", scope: !101, file: !101, line: 159, type: !1056, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!64, !1058, !993, !64, !992, !514}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !1060, line: 52, baseType: !1061)
!1060 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !1060, line: 38, size: 768, align: 64, elements: !1062)
!1062 = !{!1063, !1104, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1214, !1215, !1216, !1217}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1061, file: !1060, line: 39, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1066)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !37, line: 143, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !37, line: 67, size: 640, align: 64, elements: !1068)
!1068 = !{!1069, !1070, !1074, !1078, !1079, !1080, !1081, !1085, !1091, !1093, !1097}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1067, file: !37, line: 72, baseType: !210, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1067, file: !37, line: 78, baseType: !1071, size: 64, align: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!210, !66}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1067, file: !37, line: 85, baseType: !1075, size: 64, align: 64, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1077)
!1077 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !37, line: 85, flags: DIFlagFwdDecl)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1067, file: !37, line: 93, baseType: !64, size: 32, align: 32, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1067, file: !37, line: 99, baseType: !64, size: 32, align: 32, offset: 224)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1067, file: !37, line: 108, baseType: !64, size: 32, align: 32, offset: 256)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1067, file: !37, line: 113, baseType: !1082, size: 64, align: 64, offset: 320)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!66, !66, !66}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1067, file: !37, line: 123, baseType: !1086, size: 64, align: 64, offset: 384)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!1089, !1089}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1067)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1067, file: !37, line: 130, baseType: !1092, size: 32, align: 32, offset: 448)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !37, line: 48, baseType: !36)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1067, file: !37, line: 136, baseType: !1094, size: 64, align: 64, offset: 512)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!1092, !66}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1067, file: !37, line: 142, baseType: !1098, size: 64, align: 64, offset: 576)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!64, !1101, !66, !210, !64}
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !37, line: 60, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !1061, file: !1060, line: 40, baseType: !1105, size: 64, align: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !1060, line: 54, size: 1600, align: 64, elements: !1108)
!1108 = !{!1109, !1110, !1114, !1123, !1128, !1132, !1137, !1143, !1149, !1150, !1154, !1158, !1159, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1192, !1193, !1194, !1198}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1107, file: !1060, line: 55, baseType: !210, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !1107, file: !1060, line: 56, baseType: !1111, size: 64, align: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!64, !1058, !210, !64}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !1107, file: !1060, line: 62, baseType: !1115, size: 64, align: 64, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!64, !1058, !210, !64, !1118}
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1121, line: 86, baseType: !1122)
!1121 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1122 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1121, line: 86, flags: DIFlagFwdDecl)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !1107, file: !1060, line: 63, baseType: !1124, size: 64, align: 64, offset: 192)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!64, !1058, !1127}
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !1107, file: !1060, line: 64, baseType: !1129, size: 64, align: 64, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!64, !1058}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !1107, file: !1060, line: 78, baseType: !1133, size: 64, align: 64, offset: 320)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!64, !1058, !1136, !64}
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !1107, file: !1060, line: 79, baseType: !1138, size: 64, align: 64, offset: 384)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!64, !1058, !1141, !64}
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !1107, file: !1060, line: 80, baseType: !1144, size: 64, align: 64, offset: 448)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!1147, !1058, !1147, !64}
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !73, line: 40, baseType: !1148)
!1148 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !1107, file: !1060, line: 81, baseType: !1129, size: 64, align: 64, offset: 512)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !1107, file: !1060, line: 82, baseType: !1151, size: 64, align: 64, offset: 576)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!64, !1058, !64}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !1107, file: !1060, line: 83, baseType: !1155, size: 64, align: 64, offset: 640)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!1147, !1058, !64, !1147, !64}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !1107, file: !1060, line: 85, baseType: !1129, size: 64, align: 64, offset: 704)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !1107, file: !1060, line: 86, baseType: !1160, size: 64, align: 64, offset: 768)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!64, !1058, !1163, !514}
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !1107, file: !1060, line: 88, baseType: !1129, size: 64, align: 64, offset: 832)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !1107, file: !1060, line: 89, baseType: !1151, size: 64, align: 64, offset: 896)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1107, file: !1060, line: 90, baseType: !64, size: 32, align: 32, offset: 960)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !1107, file: !1060, line: 91, baseType: !1064, size: 64, align: 64, offset: 1024)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1107, file: !1060, line: 92, baseType: !64, size: 32, align: 32, offset: 1088)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !1107, file: !1060, line: 93, baseType: !1151, size: 64, align: 64, offset: 1152)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !1107, file: !1060, line: 94, baseType: !1129, size: 64, align: 64, offset: 1216)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !1107, file: !1060, line: 95, baseType: !1172, size: 64, align: 64, offset: 1280)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!64, !1058, !1175}
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !1178, line: 101, baseType: !1179)
!1178 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !1178, line: 86, size: 576, align: 64, elements: !1180)
!1180 = !{!1181, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1179, file: !1178, line: 87, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1179, file: !1178, line: 88, baseType: !64, size: 32, align: 32, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !1179, file: !1178, line: 89, baseType: !64, size: 32, align: 32, offset: 96)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1179, file: !1178, line: 91, baseType: !1147, size: 64, align: 64, offset: 128)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !1179, file: !1178, line: 92, baseType: !1147, size: 64, align: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !1179, file: !1178, line: 94, baseType: !1147, size: 64, align: 64, offset: 256)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !1179, file: !1178, line: 96, baseType: !1147, size: 64, align: 64, offset: 320)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !1179, file: !1178, line: 98, baseType: !1147, size: 64, align: 64, offset: 384)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !1179, file: !1178, line: 99, baseType: !1147, size: 64, align: 64, offset: 448)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !1179, file: !1178, line: 100, baseType: !1147, size: 64, align: 64, offset: 512)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !1107, file: !1060, line: 96, baseType: !1129, size: 64, align: 64, offset: 1344)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !1107, file: !1060, line: 97, baseType: !1129, size: 64, align: 64, offset: 1408)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !1107, file: !1060, line: 98, baseType: !1195, size: 64, align: 64, offset: 1472)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!64, !1058, !1058}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !1107, file: !1060, line: 99, baseType: !210, size: 64, align: 64, offset: 1536)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1061, file: !1060, line: 41, baseType: !66, size: 64, align: 64, offset: 128)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1061, file: !1060, line: 42, baseType: !1182, size: 64, align: 64, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1061, file: !1060, line: 43, baseType: !64, size: 32, align: 32, offset: 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1061, file: !1060, line: 44, baseType: !64, size: 32, align: 32, offset: 288)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !1061, file: !1060, line: 45, baseType: !64, size: 32, align: 32, offset: 320)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !1061, file: !1060, line: 46, baseType: !64, size: 32, align: 32, offset: 352)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !1061, file: !1060, line: 47, baseType: !1206, size: 128, align: 64, offset: 384)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !1178, line: 61, baseType: !1207)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !1178, line: 58, size: 128, align: 64, elements: !1208)
!1208 = !{!1209, !1213}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1207, file: !1178, line: 59, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!64, !66}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1207, file: !1178, line: 60, baseType: !66, size: 64, align: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !1061, file: !1060, line: 48, baseType: !1147, size: 64, align: 64, offset: 512)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1061, file: !1060, line: 49, baseType: !210, size: 64, align: 64, offset: 576)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1061, file: !1060, line: 50, baseType: !210, size: 64, align: 64, offset: 640)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1061, file: !1060, line: 51, baseType: !64, size: 32, align: 32, offset: 704)
!1218 = !DILocalVariable(name: "h", arg: 1, scope: !1055, file: !101, line: 159, type: !1058)
!1219 = !DILocation(line: 159, column: 37, scope: !1055)
!1220 = !DILocalVariable(name: "p", arg: 2, scope: !1055, file: !101, line: 159, type: !993)
!1221 = !DILocation(line: 159, column: 52, scope: !1055)
!1222 = !DILocalVariable(name: "chunk_size", arg: 3, scope: !1055, file: !101, line: 160, type: !64)
!1223 = !DILocation(line: 160, column: 29, scope: !1055)
!1224 = !DILocalVariable(name: "prev_pkt", arg: 4, scope: !1055, file: !101, line: 160, type: !992)
!1225 = !DILocation(line: 160, column: 54, scope: !1055)
!1226 = !DILocalVariable(name: "nb_prev_pkt", arg: 5, scope: !1055, file: !101, line: 160, type: !514)
!1227 = !DILocation(line: 160, column: 69, scope: !1055)
!1228 = !DILocalVariable(name: "hdr", scope: !1055, file: !101, line: 162, type: !77)
!1229 = !DILocation(line: 162, column: 13, scope: !1055)
!1230 = !DILocation(line: 164, column: 20, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1055, file: !101, line: 164, column: 9)
!1232 = !DILocation(line: 164, column: 9, scope: !1231)
!1233 = !DILocation(line: 164, column: 32, scope: !1231)
!1234 = !DILocation(line: 164, column: 9, scope: !1055)
!1235 = !DILocation(line: 165, column: 9, scope: !1231)
!1236 = !DILocation(line: 167, column: 41, scope: !1055)
!1237 = !DILocation(line: 167, column: 44, scope: !1055)
!1238 = !DILocation(line: 167, column: 47, scope: !1055)
!1239 = !DILocation(line: 167, column: 59, scope: !1055)
!1240 = !DILocation(line: 168, column: 41, scope: !1055)
!1241 = !DILocation(line: 168, column: 54, scope: !1055)
!1242 = !DILocation(line: 167, column: 12, scope: !1055)
!1243 = !DILocation(line: 167, column: 5, scope: !1055)
!1244 = !DILocation(line: 169, column: 1, scope: !1055)
!1245 = distinct !DISubprogram(name: "ff_rtmp_packet_read_internal", scope: !101, file: !101, line: 298, type: !1246, isLocal: false, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!64, !1058, !993, !64, !992, !514, !77}
!1248 = !DILocalVariable(name: "h", arg: 1, scope: !1245, file: !101, line: 298, type: !1058)
!1249 = !DILocation(line: 298, column: 46, scope: !1245)
!1250 = !DILocalVariable(name: "p", arg: 2, scope: !1245, file: !101, line: 298, type: !993)
!1251 = !DILocation(line: 298, column: 61, scope: !1245)
!1252 = !DILocalVariable(name: "chunk_size", arg: 3, scope: !1245, file: !101, line: 298, type: !64)
!1253 = !DILocation(line: 298, column: 68, scope: !1245)
!1254 = !DILocalVariable(name: "prev_pkt", arg: 4, scope: !1245, file: !101, line: 299, type: !992)
!1255 = !DILocation(line: 299, column: 47, scope: !1245)
!1256 = !DILocalVariable(name: "nb_prev_pkt", arg: 5, scope: !1245, file: !101, line: 299, type: !514)
!1257 = !DILocation(line: 299, column: 62, scope: !1245)
!1258 = !DILocalVariable(name: "hdr", arg: 6, scope: !1245, file: !101, line: 300, type: !77)
!1259 = !DILocation(line: 300, column: 42, scope: !1245)
!1260 = !DILocation(line: 302, column: 5, scope: !1245)
!1261 = !DILocalVariable(name: "ret", scope: !1262, file: !101, line: 303, type: !64)
!1262 = distinct !DILexicalBlock(scope: !1245, file: !101, line: 302, column: 15)
!1263 = !DILocation(line: 303, column: 13, scope: !1262)
!1264 = !DILocation(line: 303, column: 46, scope: !1262)
!1265 = !DILocation(line: 303, column: 49, scope: !1262)
!1266 = !DILocation(line: 303, column: 52, scope: !1262)
!1267 = !DILocation(line: 303, column: 64, scope: !1262)
!1268 = !DILocation(line: 304, column: 46, scope: !1262)
!1269 = !DILocation(line: 304, column: 59, scope: !1262)
!1270 = !DILocation(line: 303, column: 19, scope: !1262)
!1271 = !DILocation(line: 305, column: 13, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1262, file: !101, line: 305, column: 13)
