; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--nutdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--nutdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecTag = type { i32, i32 }
%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProbeData = type { i8*, i8*, i32, i8* }

!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !917, line: 43, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavformat/nut.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!918 = !{!919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930}
!919 = !DIEnumerator(name: "FLAG_KEY", value: 1)
!920 = !DIEnumerator(name: "FLAG_EOR", value: 2)
!921 = !DIEnumerator(name: "FLAG_CODED_PTS", value: 8)
!922 = !DIEnumerator(name: "FLAG_STREAM_ID", value: 16)
!923 = !DIEnumerator(name: "FLAG_SIZE_MSB", value: 32)
!924 = !DIEnumerator(name: "FLAG_CHECKSUM", value: 64)
!925 = !DIEnumerator(name: "FLAG_RESERVED", value: 128)
!926 = !DIEnumerator(name: "FLAG_SM_DATA", value: 256)
!927 = !DIEnumerator(name: "FLAG_HEADER_IDX", value: 1024)
!928 = !DIEnumerator(name: "FLAG_MATCH_TIME", value: 2048)
!929 = !DIEnumerator(name: "FLAG_CODED", value: 4096)
!930 = !DIEnumerator(name: "FLAG_INVALID", value: 8192)
!931 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSideDataParamChangeFlags", file: !4, line: 1522, size: 32, align: 32, elements: !932)
!932 = !{!933, !934, !935, !936}
!933 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_CHANNEL_COUNT", value: 1)
!934 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_CHANNEL_LAYOUT", value: 2)
!935 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_SAMPLE_RATE", value: 4)
!936 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_DIMENSIONS", value: 8)
!937 = !{!938, !947, !949, !950, !946, !951, !954, !956, !957, !961, !962}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !941, line: 221, size: 32, align: 8, elements: !942)
!941 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!942 = !{!943}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !940, file: !941, line: 221, baseType: !944, size: 32, align: 32)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !945, line: 51, baseType: !946)
!945 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!946 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !945, line: 55, baseType: !948)
!948 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!950 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !945, line: 48, baseType: !953)
!953 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !945, line: 40, baseType: !955)
!955 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!956 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !941, line: 220, size: 64, align: 8, elements: !959)
!959 = !{!960}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !958, file: !941, line: 220, baseType: !947, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!963 = !{!964}
!964 = distinct !DIGlobalVariable(name: "ff_nut_demuxer", scope: !0, file: !965, line: 1293, type: !966, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_nut_demuxer)
!965 = !DIFile(filename: "libavformat/nutdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !897, line: 777, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !968)
!968 = !{!969, !973, !974, !975, !976, !986, !1027, !1028, !1030, !1031, !1032, !1045, !2151, !2152, !2153, !2157, !2161, !2162, !2163, !2167, !2168, !2169}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !967, file: !897, line: 638, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !967, file: !897, line: 645, baseType: !970, size: 64, align: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !967, file: !897, line: 652, baseType: !950, size: 32, align: 32, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !967, file: !897, line: 659, baseType: !970, size: 64, align: 64, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !967, file: !897, line: 661, baseType: !977, size: 64, align: 64, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !982, line: 44, size: 64, align: 32, elements: !983)
!982 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !981, file: !982, line: 45, baseType: !3, size: 32, align: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !981, file: !982, line: 46, baseType: !946, size: 32, align: 32, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !967, file: !897, line: 663, baseType: !987, size: 64, align: 64, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !991)
!991 = !{!992, !993, !997, !1001, !1002, !1003, !1004, !1008, !1014, !1016, !1020}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !990, file: !464, line: 72, baseType: !970, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !990, file: !464, line: 78, baseType: !994, size: 64, align: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!970, !949}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !990, file: !464, line: 85, baseType: !998, size: 64, align: 64, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !990, file: !464, line: 93, baseType: !950, size: 32, align: 32, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !990, file: !464, line: 99, baseType: !950, size: 32, align: 32, offset: 224)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !990, file: !464, line: 108, baseType: !950, size: 32, align: 32, offset: 256)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !990, file: !464, line: 113, baseType: !1005, size: 64, align: 64, offset: 320)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!949, !949, !949}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !990, file: !464, line: 123, baseType: !1009, size: 64, align: 64, offset: 384)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!1012, !1012}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !990, file: !464, line: 130, baseType: !1015, size: 32, align: 32, offset: 448)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !990, file: !464, line: 136, baseType: !1017, size: 64, align: 64, offset: 512)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!1015, !949}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !990, file: !464, line: 142, baseType: !1021, size: 64, align: 64, offset: 576)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!950, !1024, !949, !970, !950}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !967, file: !897, line: 670, baseType: !970, size: 64, align: 64, offset: 384)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !967, file: !897, line: 679, baseType: !1029, size: 64, align: 64, offset: 448)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !967, file: !897, line: 684, baseType: !950, size: 32, align: 32, offset: 512)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !967, file: !897, line: 689, baseType: !950, size: 32, align: 32, offset: 544)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !967, file: !897, line: 696, baseType: !1033, size: 64, align: 64, offset: 576)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!950, !1036}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1039)
!1039 = !{!1040, !1041, !1043, !1044}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1038, file: !897, line: 449, baseType: !970, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1038, file: !897, line: 450, baseType: !1042, size: 64, align: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1038, file: !897, line: 451, baseType: !950, size: 32, align: 32, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1038, file: !897, line: 452, baseType: !970, size: 64, align: 64, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !967, file: !897, line: 703, baseType: !1046, size: 64, align: 64, offset: 640)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!950, !1049}
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1051)
!1051 = !{!1052, !1053, !1054, !1248, !1249, !1314, !1315, !1316, !2008, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2062, !2063, !2064, !2065, !2066, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2117, !2118, !2121, !2122, !2123, !2124, !2125, !2126, !2128, !2129, !2130, !2131, !2139, !2140, !2144, !2148, !2149, !2150}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1050, file: !897, line: 1342, baseType: !987, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1050, file: !897, line: 1349, baseType: !1029, size: 64, align: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1050, file: !897, line: 1356, baseType: !1055, size: 64, align: 64, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1057)
!1057 = !{!1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1109, !1110, !1114, !1118, !1123, !1129, !1223, !1229, !1235, !1236, !1237, !1238, !1242}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1056, file: !897, line: 498, baseType: !970, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1056, file: !897, line: 504, baseType: !970, size: 64, align: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1056, file: !897, line: 505, baseType: !970, size: 64, align: 64, offset: 128)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1056, file: !897, line: 506, baseType: !970, size: 64, align: 64, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1056, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1056, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1056, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1056, file: !897, line: 517, baseType: !950, size: 32, align: 32, offset: 352)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1056, file: !897, line: 523, baseType: !977, size: 64, align: 64, offset: 384)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1056, file: !897, line: 526, baseType: !987, size: 64, align: 64, offset: 448)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1056, file: !897, line: 535, baseType: !1055, size: 64, align: 64, offset: 512)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1056, file: !897, line: 539, baseType: !950, size: 32, align: 32, offset: 576)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1056, file: !897, line: 541, baseType: !1046, size: 64, align: 64, offset: 640)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1056, file: !897, line: 549, baseType: !1072, size: 64, align: 64, offset: 704)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!950, !1049, !1075}
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1078)
!1078 = !{!1079, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1105, !1106, !1107, !1108}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1077, file: !4, line: 1451, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1082, line: 94, baseType: !1083)
!1082 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1082, line: 81, size: 192, align: 64, elements: !1084)
!1084 = !{!1085, !1089, !1090}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1083, file: !1082, line: 82, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1082, line: 73, baseType: !1088)
!1088 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1082, line: 73, flags: DIFlagFwdDecl)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1083, file: !1082, line: 89, baseType: !951, size: 64, align: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1083, file: !1082, line: 93, baseType: !950, size: 32, align: 32, offset: 128)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1077, file: !4, line: 1461, baseType: !954, size: 64, align: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1077, file: !4, line: 1467, baseType: !954, size: 64, align: 64, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1077, file: !4, line: 1468, baseType: !951, size: 64, align: 64, offset: 192)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1077, file: !4, line: 1469, baseType: !950, size: 32, align: 32, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1077, file: !4, line: 1470, baseType: !950, size: 32, align: 32, offset: 288)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1077, file: !4, line: 1474, baseType: !950, size: 32, align: 32, offset: 320)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1077, file: !4, line: 1479, baseType: !1098, size: 64, align: 64, offset: 384)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1100)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1101)
!1101 = !{!1102, !1103, !1104}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1100, file: !4, line: 1412, baseType: !951, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1100, file: !4, line: 1413, baseType: !950, size: 32, align: 32, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1100, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1077, file: !4, line: 1480, baseType: !950, size: 32, align: 32, offset: 448)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1077, file: !4, line: 1486, baseType: !954, size: 64, align: 64, offset: 512)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1077, file: !4, line: 1488, baseType: !954, size: 64, align: 64, offset: 576)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1077, file: !4, line: 1497, baseType: !954, size: 64, align: 64, offset: 640)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1056, file: !897, line: 550, baseType: !1046, size: 64, align: 64, offset: 768)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1056, file: !897, line: 554, baseType: !1111, size: 64, align: 64, offset: 832)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!950, !1049, !1075, !1075, !950}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1056, file: !897, line: 563, baseType: !1115, size: 64, align: 64, offset: 896)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!950, !3, !950}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1056, file: !897, line: 565, baseType: !1119, size: 64, align: 64, offset: 960)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{null, !1049, !950, !1122, !1122}
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1056, file: !897, line: 570, baseType: !1124, size: 64, align: 64, offset: 1024)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!950, !1049, !950, !949, !1127}
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1128, line: 216, baseType: !948)
!1128 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1056, file: !897, line: 581, baseType: !1130, size: 64, align: 64, offset: 1088)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!950, !1049, !950, !1133, !946}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1136)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1137)
!1137 = !{!1138, !1142, !1144, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1177, !1179, !1180, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1136, file: !526, line: 282, baseType: !1139, size: 512, align: 64)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 512, align: 64, elements: !1140)
!1140 = !{!1141}
!1141 = !DISubrange(count: 8)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1136, file: !526, line: 299, baseType: !1143, size: 256, align: 32, offset: 512)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 256, align: 32, elements: !1140)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1136, file: !526, line: 315, baseType: !1145, size: 64, align: 64, offset: 768)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1136, file: !526, line: 326, baseType: !950, size: 32, align: 32, offset: 832)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1136, file: !526, line: 326, baseType: !950, size: 32, align: 32, offset: 864)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1136, file: !526, line: 334, baseType: !950, size: 32, align: 32, offset: 896)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1136, file: !526, line: 341, baseType: !950, size: 32, align: 32, offset: 928)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1136, file: !526, line: 346, baseType: !950, size: 32, align: 32, offset: 960)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1136, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1136, file: !526, line: 356, baseType: !1153, size: 64, align: 32, offset: 1024)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1154, line: 61, baseType: !1155)
!1154 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1154, line: 58, size: 64, align: 32, elements: !1156)
!1156 = !{!1157, !1158}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1155, file: !1154, line: 59, baseType: !950, size: 32, align: 32)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1155, file: !1154, line: 60, baseType: !950, size: 32, align: 32, offset: 32)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1136, file: !526, line: 361, baseType: !954, size: 64, align: 64, offset: 1088)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1136, file: !526, line: 369, baseType: !954, size: 64, align: 64, offset: 1152)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1136, file: !526, line: 377, baseType: !954, size: 64, align: 64, offset: 1216)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1136, file: !526, line: 382, baseType: !950, size: 32, align: 32, offset: 1280)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1136, file: !526, line: 386, baseType: !950, size: 32, align: 32, offset: 1312)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1136, file: !526, line: 391, baseType: !950, size: 32, align: 32, offset: 1344)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1136, file: !526, line: 396, baseType: !949, size: 64, align: 64, offset: 1408)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1136, file: !526, line: 403, baseType: !1167, size: 512, align: 64, offset: 1472)
!1167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 512, align: 64, elements: !1140)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1136, file: !526, line: 410, baseType: !950, size: 32, align: 32, offset: 1984)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1136, file: !526, line: 415, baseType: !950, size: 32, align: 32, offset: 2016)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1136, file: !526, line: 420, baseType: !950, size: 32, align: 32, offset: 2048)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1136, file: !526, line: 425, baseType: !950, size: 32, align: 32, offset: 2080)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1136, file: !526, line: 435, baseType: !954, size: 64, align: 64, offset: 2112)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1136, file: !526, line: 440, baseType: !950, size: 32, align: 32, offset: 2176)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1136, file: !526, line: 445, baseType: !947, size: 64, align: 64, offset: 2240)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1136, file: !526, line: 459, baseType: !1176, size: 512, align: 64, offset: 2304)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1080, size: 512, align: 64, elements: !1140)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1136, file: !526, line: 473, baseType: !1178, size: 64, align: 64, offset: 2816)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1136, file: !526, line: 477, baseType: !950, size: 32, align: 32, offset: 2880)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1136, file: !526, line: 479, baseType: !1181, size: 64, align: 64, offset: 2944)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1185)
!1185 = !{!1186, !1187, !1188, !1189, !1194}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1184, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1184, file: !526, line: 203, baseType: !951, size: 64, align: 64, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1184, file: !526, line: 204, baseType: !950, size: 32, align: 32, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1184, file: !526, line: 205, baseType: !1190, size: 64, align: 64, offset: 192)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1192, line: 86, baseType: !1193)
!1192 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1193 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1192, line: 86, flags: DIFlagFwdDecl)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1184, file: !526, line: 206, baseType: !1080, size: 64, align: 64, offset: 256)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1136, file: !526, line: 480, baseType: !950, size: 32, align: 32, offset: 3008)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1136, file: !526, line: 505, baseType: !950, size: 32, align: 32, offset: 3040)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1136, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1136, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1136, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1136, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1136, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1136, file: !526, line: 532, baseType: !954, size: 64, align: 64, offset: 3264)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1136, file: !526, line: 539, baseType: !954, size: 64, align: 64, offset: 3328)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1136, file: !526, line: 547, baseType: !954, size: 64, align: 64, offset: 3392)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1136, file: !526, line: 554, baseType: !1190, size: 64, align: 64, offset: 3456)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1136, file: !526, line: 563, baseType: !950, size: 32, align: 32, offset: 3520)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1136, file: !526, line: 572, baseType: !950, size: 32, align: 32, offset: 3552)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1136, file: !526, line: 581, baseType: !950, size: 32, align: 32, offset: 3584)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1136, file: !526, line: 588, baseType: !1210, size: 64, align: 64, offset: 3648)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !945, line: 36, baseType: !1212)
!1212 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1136, file: !526, line: 593, baseType: !950, size: 32, align: 32, offset: 3712)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1136, file: !526, line: 596, baseType: !950, size: 32, align: 32, offset: 3744)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1136, file: !526, line: 599, baseType: !1080, size: 64, align: 64, offset: 3776)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1136, file: !526, line: 605, baseType: !1080, size: 64, align: 64, offset: 3840)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1136, file: !526, line: 616, baseType: !1080, size: 64, align: 64, offset: 3904)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1136, file: !526, line: 626, baseType: !1127, size: 64, align: 64, offset: 3968)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1136, file: !526, line: 627, baseType: !1127, size: 64, align: 64, offset: 4032)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1136, file: !526, line: 628, baseType: !1127, size: 64, align: 64, offset: 4096)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1136, file: !526, line: 629, baseType: !1127, size: 64, align: 64, offset: 4160)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1136, file: !526, line: 645, baseType: !1080, size: 64, align: 64, offset: 4224)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1056, file: !897, line: 587, baseType: !1224, size: 64, align: 64, offset: 1152)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!950, !1049, !1227}
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1056, file: !897, line: 592, baseType: !1230, size: 64, align: 64, offset: 1216)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!950, !1049, !1233}
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1056, file: !897, line: 597, baseType: !1230, size: 64, align: 64, offset: 1280)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1056, file: !897, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1056, file: !897, line: 608, baseType: !1046, size: 64, align: 64, offset: 1408)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1056, file: !897, line: 617, baseType: !1239, size: 64, align: 64, offset: 1472)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{null, !1049}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1056, file: !897, line: 623, baseType: !1243, size: 64, align: 64, offset: 1536)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!950, !1049, !1246}
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1076)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1050, file: !897, line: 1365, baseType: !949, size: 64, align: 64, offset: 192)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1050, file: !897, line: 1379, baseType: !1250, size: 64, align: 64, offset: 256)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1253)
!1253 = !{!1254, !1255, !1256, !1257, !1258, !1259, !1260, !1264, !1265, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1281, !1282, !1286, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1304, !1305, !1306, !1307, !1311, !1312, !1313}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1252, file: !628, line: 174, baseType: !987, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1252, file: !628, line: 226, baseType: !1042, size: 64, align: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1252, file: !628, line: 227, baseType: !950, size: 32, align: 32, offset: 128)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1252, file: !628, line: 228, baseType: !1042, size: 64, align: 64, offset: 192)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1252, file: !628, line: 229, baseType: !1042, size: 64, align: 64, offset: 256)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1252, file: !628, line: 233, baseType: !949, size: 64, align: 64, offset: 320)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1252, file: !628, line: 235, baseType: !1261, size: 64, align: 64, offset: 384)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DISubroutineType(types: !1263)
!1263 = !{!950, !949, !951, !950}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1252, file: !628, line: 236, baseType: !1261, size: 64, align: 64, offset: 448)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1252, file: !628, line: 237, baseType: !1266, size: 64, align: 64, offset: 512)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!954, !949, !954, !950}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1252, file: !628, line: 238, baseType: !954, size: 64, align: 64, offset: 576)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1252, file: !628, line: 239, baseType: !950, size: 32, align: 32, offset: 640)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1252, file: !628, line: 240, baseType: !950, size: 32, align: 32, offset: 672)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1252, file: !628, line: 241, baseType: !950, size: 32, align: 32, offset: 704)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1252, file: !628, line: 242, baseType: !948, size: 64, align: 64, offset: 768)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1252, file: !628, line: 243, baseType: !1042, size: 64, align: 64, offset: 832)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1252, file: !628, line: 244, baseType: !1276, size: 64, align: 64, offset: 896)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!948, !948, !1279, !946}
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1252, file: !628, line: 245, baseType: !950, size: 32, align: 32, offset: 960)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1252, file: !628, line: 249, baseType: !1283, size: 64, align: 64, offset: 1024)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!950, !949, !950}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1252, file: !628, line: 255, baseType: !1287, size: 64, align: 64, offset: 1088)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!954, !949, !950, !954, !950}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1252, file: !628, line: 260, baseType: !950, size: 32, align: 32, offset: 1152)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1252, file: !628, line: 266, baseType: !954, size: 64, align: 64, offset: 1216)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1252, file: !628, line: 273, baseType: !950, size: 32, align: 32, offset: 1280)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1252, file: !628, line: 279, baseType: !954, size: 64, align: 64, offset: 1344)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1252, file: !628, line: 285, baseType: !950, size: 32, align: 32, offset: 1408)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1252, file: !628, line: 291, baseType: !950, size: 32, align: 32, offset: 1440)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1252, file: !628, line: 298, baseType: !950, size: 32, align: 32, offset: 1472)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1252, file: !628, line: 304, baseType: !950, size: 32, align: 32, offset: 1504)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1252, file: !628, line: 309, baseType: !970, size: 64, align: 64, offset: 1536)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1252, file: !628, line: 314, baseType: !970, size: 64, align: 64, offset: 1600)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1252, file: !628, line: 319, baseType: !1301, size: 64, align: 64, offset: 1664)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!950, !949, !951, !950, !627, !954}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1252, file: !628, line: 326, baseType: !950, size: 32, align: 32, offset: 1728)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1252, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1252, file: !628, line: 332, baseType: !954, size: 64, align: 64, offset: 1792)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1252, file: !628, line: 338, baseType: !1308, size: 64, align: 64, offset: 1856)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!950, !949}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1252, file: !628, line: 340, baseType: !954, size: 64, align: 64, offset: 1920)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1252, file: !628, line: 346, baseType: !1042, size: 64, align: 64, offset: 1984)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1252, file: !628, line: 351, baseType: !950, size: 32, align: 32, offset: 2048)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1050, file: !897, line: 1386, baseType: !950, size: 32, align: 32, offset: 320)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1050, file: !897, line: 1393, baseType: !946, size: 32, align: 32, offset: 352)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1050, file: !897, line: 1405, baseType: !1317, size: 64, align: 64, offset: 384)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1320)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1321)
!1321 = !{!1322, !1323, !1324, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1794, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1894, !1900, !1901, !1905, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1937, !1938, !1939, !1940, !1941, !1942}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1320, file: !897, line: 866, baseType: !950, size: 32, align: 32)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1320, file: !897, line: 872, baseType: !950, size: 32, align: 32, offset: 32)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1320, file: !897, line: 878, baseType: !1325, size: 64, align: 64, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1327)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1328)
!1328 = !{!1329, !1330, !1331, !1332, !1469, !1470, !1471, !1472, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1498, !1502, !1503, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1682, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1327, file: !4, line: 1561, baseType: !987, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1327, file: !4, line: 1562, baseType: !950, size: 32, align: 32, offset: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1327, file: !4, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1327, file: !4, line: 1565, baseType: !1333, size: 64, align: 64, offset: 128)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1335)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1336)
!1336 = !{!1337, !1338, !1339, !1340, !1341, !1342, !1345, !1348, !1351, !1354, !1357, !1358, !1359, !1367, !1368, !1369, !1371, !1375, !1381, !1386, !1390, !1391, !1434, !1441, !1445, !1446, !1450, !1454, !1458, !1462, !1463, !1464}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1335, file: !4, line: 3475, baseType: !970, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1335, file: !4, line: 3480, baseType: !970, size: 64, align: 64, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1335, file: !4, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1335, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1335, file: !4, line: 3487, baseType: !950, size: 32, align: 32, offset: 192)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1335, file: !4, line: 3488, baseType: !1343, size: 64, align: 64, offset: 256)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1153)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1335, file: !4, line: 3489, baseType: !1346, size: 64, align: 64, offset: 320)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1335, file: !4, line: 3490, baseType: !1349, size: 64, align: 64, offset: 384)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1335, file: !4, line: 3491, baseType: !1352, size: 64, align: 64, offset: 448)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1335, file: !4, line: 3492, baseType: !1355, size: 64, align: 64, offset: 512)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1335, file: !4, line: 3493, baseType: !952, size: 8, align: 8, offset: 576)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1335, file: !4, line: 3494, baseType: !987, size: 64, align: 64, offset: 640)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1335, file: !4, line: 3495, baseType: !1360, size: 64, align: 64, offset: 704)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1362)
!1362 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1363)
!1363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1364)
!1364 = !{!1365, !1366}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1363, file: !4, line: 3402, baseType: !950, size: 32, align: 32)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1363, file: !4, line: 3403, baseType: !970, size: 64, align: 64, offset: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1335, file: !4, line: 3507, baseType: !970, size: 64, align: 64, offset: 768)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1335, file: !4, line: 3516, baseType: !950, size: 32, align: 32, offset: 832)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1335, file: !4, line: 3517, baseType: !1370, size: 64, align: 64, offset: 896)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1335, file: !4, line: 3527, baseType: !1372, size: 64, align: 64, offset: 960)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DISubroutineType(types: !1374)
!1374 = !{!950, !1325}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1335, file: !4, line: 3535, baseType: !1376, size: 64, align: 64, offset: 1024)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DISubroutineType(types: !1378)
!1378 = !{!950, !1325, !1379}
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1326)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1335, file: !4, line: 3541, baseType: !1382, size: 64, align: 64, offset: 1088)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1384)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1385)
!1385 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1335, file: !4, line: 3549, baseType: !1387, size: 64, align: 64, offset: 1152)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DISubroutineType(types: !1389)
!1389 = !{null, !1370}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1335, file: !4, line: 3551, baseType: !1372, size: 64, align: 64, offset: 1216)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1335, file: !4, line: 3552, baseType: !1392, size: 64, align: 64, offset: 1280)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DISubroutineType(types: !1394)
!1394 = !{!950, !1325, !951, !950, !1395}
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1397)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1398)
!1398 = !{!1399, !1402, !1403, !1404, !1405, !1433}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1397, file: !4, line: 3921, baseType: !1400, size: 16, align: 16)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !945, line: 49, baseType: !1401)
!1401 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1397, file: !4, line: 3922, baseType: !944, size: 32, align: 32, offset: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1397, file: !4, line: 3923, baseType: !944, size: 32, align: 32, offset: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1397, file: !4, line: 3924, baseType: !946, size: 32, align: 32, offset: 96)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1397, file: !4, line: 3925, baseType: !1406, size: 64, align: 64, offset: 128)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1409)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1410)
!1410 = !{!1411, !1412, !1413, !1414, !1415, !1416, !1422, !1426, !1428, !1429, !1431, !1432}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1409, file: !4, line: 3886, baseType: !950, size: 32, align: 32)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1409, file: !4, line: 3887, baseType: !950, size: 32, align: 32, offset: 32)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1409, file: !4, line: 3888, baseType: !950, size: 32, align: 32, offset: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1409, file: !4, line: 3889, baseType: !950, size: 32, align: 32, offset: 96)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1409, file: !4, line: 3890, baseType: !950, size: 32, align: 32, offset: 128)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1409, file: !4, line: 3897, baseType: !1417, size: 768, align: 64, offset: 192)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1418)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1419)
!1419 = !{!1420, !1421}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1418, file: !4, line: 3855, baseType: !1139, size: 512, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1418, file: !4, line: 3857, baseType: !1143, size: 256, align: 32, offset: 512)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1409, file: !4, line: 3903, baseType: !1423, size: 256, align: 64, offset: 960)
!1423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 256, align: 64, elements: !1424)
!1424 = !{!1425}
!1425 = !DISubrange(count: 4)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1409, file: !4, line: 3904, baseType: !1427, size: 128, align: 32, offset: 1216)
!1427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 128, align: 32, elements: !1424)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1409, file: !4, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1409, file: !4, line: 3908, baseType: !1430, size: 64, align: 64, offset: 1408)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1409, file: !4, line: 3915, baseType: !1430, size: 64, align: 64, offset: 1472)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1409, file: !4, line: 3917, baseType: !950, size: 32, align: 32, offset: 1536)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1397, file: !4, line: 3926, baseType: !954, size: 64, align: 64, offset: 192)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1335, file: !4, line: 3564, baseType: !1435, size: 64, align: 64, offset: 1344)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{!950, !1325, !1075, !1438, !1440}
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1135)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1335, file: !4, line: 3566, baseType: !1442, size: 64, align: 64, offset: 1408)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{!950, !1325, !949, !1440, !1075}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1335, file: !4, line: 3567, baseType: !1372, size: 64, align: 64, offset: 1472)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1335, file: !4, line: 3576, baseType: !1447, size: 64, align: 64, offset: 1536)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DISubroutineType(types: !1449)
!1449 = !{!950, !1325, !1438}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1335, file: !4, line: 3577, baseType: !1451, size: 64, align: 64, offset: 1600)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DISubroutineType(types: !1453)
!1453 = !{!950, !1325, !1075}
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1335, file: !4, line: 3584, baseType: !1455, size: 64, align: 64, offset: 1664)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{!950, !1325, !1134}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1335, file: !4, line: 3589, baseType: !1459, size: 64, align: 64, offset: 1728)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DISubroutineType(types: !1461)
!1461 = !{null, !1325}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1335, file: !4, line: 3594, baseType: !950, size: 32, align: 32, offset: 1792)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1335, file: !4, line: 3600, baseType: !970, size: 64, align: 64, offset: 1856)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1335, file: !4, line: 3609, baseType: !1465, size: 64, align: 64, offset: 1920)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1468)
!1468 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1327, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1327, file: !4, line: 1581, baseType: !946, size: 32, align: 32, offset: 224)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1327, file: !4, line: 1583, baseType: !949, size: 64, align: 64, offset: 256)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1327, file: !4, line: 1591, baseType: !1473, size: 64, align: 64, offset: 320)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1327, file: !4, line: 1598, baseType: !949, size: 64, align: 64, offset: 384)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1327, file: !4, line: 1606, baseType: !954, size: 64, align: 64, offset: 448)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1327, file: !4, line: 1614, baseType: !950, size: 32, align: 32, offset: 512)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1327, file: !4, line: 1622, baseType: !950, size: 32, align: 32, offset: 544)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1327, file: !4, line: 1628, baseType: !950, size: 32, align: 32, offset: 576)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1327, file: !4, line: 1636, baseType: !950, size: 32, align: 32, offset: 608)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1327, file: !4, line: 1643, baseType: !950, size: 32, align: 32, offset: 640)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1327, file: !4, line: 1657, baseType: !951, size: 64, align: 64, offset: 704)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1327, file: !4, line: 1658, baseType: !950, size: 32, align: 32, offset: 768)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1327, file: !4, line: 1679, baseType: !1153, size: 64, align: 32, offset: 800)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1327, file: !4, line: 1688, baseType: !950, size: 32, align: 32, offset: 864)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1327, file: !4, line: 1712, baseType: !950, size: 32, align: 32, offset: 896)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1327, file: !4, line: 1729, baseType: !950, size: 32, align: 32, offset: 928)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1327, file: !4, line: 1729, baseType: !950, size: 32, align: 32, offset: 960)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1327, file: !4, line: 1744, baseType: !950, size: 32, align: 32, offset: 992)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1327, file: !4, line: 1744, baseType: !950, size: 32, align: 32, offset: 1024)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1327, file: !4, line: 1751, baseType: !950, size: 32, align: 32, offset: 1056)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1327, file: !4, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1327, file: !4, line: 1791, baseType: !1494, size: 64, align: 64, offset: 1152)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DISubroutineType(types: !1496)
!1496 = !{null, !1497, !1438, !1440, !950, !950, !950}
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1327, file: !4, line: 1808, baseType: !1499, size: 64, align: 64, offset: 1216)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DISubroutineType(types: !1501)
!1501 = !{!645, !1497, !1346}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1327, file: !4, line: 1816, baseType: !950, size: 32, align: 32, offset: 1280)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1327, file: !4, line: 1825, baseType: !1504, size: 32, align: 32, offset: 1312)
!1504 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1327, file: !4, line: 1830, baseType: !950, size: 32, align: 32, offset: 1344)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1327, file: !4, line: 1838, baseType: !1504, size: 32, align: 32, offset: 1376)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1327, file: !4, line: 1846, baseType: !950, size: 32, align: 32, offset: 1408)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1327, file: !4, line: 1851, baseType: !950, size: 32, align: 32, offset: 1440)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1327, file: !4, line: 1861, baseType: !1504, size: 32, align: 32, offset: 1472)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1327, file: !4, line: 1868, baseType: !1504, size: 32, align: 32, offset: 1504)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1327, file: !4, line: 1875, baseType: !1504, size: 32, align: 32, offset: 1536)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1327, file: !4, line: 1882, baseType: !1504, size: 32, align: 32, offset: 1568)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1327, file: !4, line: 1889, baseType: !1504, size: 32, align: 32, offset: 1600)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1327, file: !4, line: 1896, baseType: !1504, size: 32, align: 32, offset: 1632)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1327, file: !4, line: 1903, baseType: !1504, size: 32, align: 32, offset: 1664)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1327, file: !4, line: 1910, baseType: !950, size: 32, align: 32, offset: 1696)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1327, file: !4, line: 1915, baseType: !950, size: 32, align: 32, offset: 1728)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1327, file: !4, line: 1926, baseType: !1440, size: 64, align: 64, offset: 1792)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1327, file: !4, line: 1935, baseType: !1153, size: 64, align: 32, offset: 1856)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1327, file: !4, line: 1942, baseType: !950, size: 32, align: 32, offset: 1920)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1327, file: !4, line: 1948, baseType: !950, size: 32, align: 32, offset: 1952)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1327, file: !4, line: 1954, baseType: !950, size: 32, align: 32, offset: 1984)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1327, file: !4, line: 1960, baseType: !950, size: 32, align: 32, offset: 2016)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1327, file: !4, line: 1984, baseType: !950, size: 32, align: 32, offset: 2048)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1327, file: !4, line: 1991, baseType: !950, size: 32, align: 32, offset: 2080)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1327, file: !4, line: 1996, baseType: !950, size: 32, align: 32, offset: 2112)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1327, file: !4, line: 2004, baseType: !950, size: 32, align: 32, offset: 2144)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1327, file: !4, line: 2011, baseType: !950, size: 32, align: 32, offset: 2176)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1327, file: !4, line: 2018, baseType: !950, size: 32, align: 32, offset: 2208)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1327, file: !4, line: 2027, baseType: !950, size: 32, align: 32, offset: 2240)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1327, file: !4, line: 2034, baseType: !950, size: 32, align: 32, offset: 2272)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1327, file: !4, line: 2044, baseType: !950, size: 32, align: 32, offset: 2304)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1327, file: !4, line: 2054, baseType: !1534, size: 64, align: 64, offset: 2368)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1327, file: !4, line: 2061, baseType: !1534, size: 64, align: 64, offset: 2432)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1327, file: !4, line: 2066, baseType: !950, size: 32, align: 32, offset: 2496)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1327, file: !4, line: 2070, baseType: !950, size: 32, align: 32, offset: 2528)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1327, file: !4, line: 2078, baseType: !950, size: 32, align: 32, offset: 2560)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1327, file: !4, line: 2085, baseType: !950, size: 32, align: 32, offset: 2592)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1327, file: !4, line: 2092, baseType: !950, size: 32, align: 32, offset: 2624)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1327, file: !4, line: 2099, baseType: !950, size: 32, align: 32, offset: 2656)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1327, file: !4, line: 2106, baseType: !950, size: 32, align: 32, offset: 2688)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1327, file: !4, line: 2113, baseType: !950, size: 32, align: 32, offset: 2720)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1327, file: !4, line: 2120, baseType: !950, size: 32, align: 32, offset: 2752)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1327, file: !4, line: 2125, baseType: !950, size: 32, align: 32, offset: 2784)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1327, file: !4, line: 2133, baseType: !950, size: 32, align: 32, offset: 2816)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1327, file: !4, line: 2140, baseType: !950, size: 32, align: 32, offset: 2848)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1327, file: !4, line: 2145, baseType: !950, size: 32, align: 32, offset: 2880)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1327, file: !4, line: 2153, baseType: !950, size: 32, align: 32, offset: 2912)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1327, file: !4, line: 2158, baseType: !950, size: 32, align: 32, offset: 2944)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1327, file: !4, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1327, file: !4, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1327, file: !4, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1327, file: !4, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1327, file: !4, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1327, file: !4, line: 2203, baseType: !950, size: 32, align: 32, offset: 3136)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1327, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1327, file: !4, line: 2212, baseType: !950, size: 32, align: 32, offset: 3200)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1327, file: !4, line: 2213, baseType: !950, size: 32, align: 32, offset: 3232)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1327, file: !4, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1327, file: !4, line: 2232, baseType: !950, size: 32, align: 32, offset: 3296)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1327, file: !4, line: 2243, baseType: !950, size: 32, align: 32, offset: 3328)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1327, file: !4, line: 2249, baseType: !950, size: 32, align: 32, offset: 3360)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1327, file: !4, line: 2256, baseType: !950, size: 32, align: 32, offset: 3392)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1327, file: !4, line: 2263, baseType: !947, size: 64, align: 64, offset: 3456)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1327, file: !4, line: 2270, baseType: !947, size: 64, align: 64, offset: 3520)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1327, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1327, file: !4, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1327, file: !4, line: 2367, baseType: !1570, size: 64, align: 64, offset: 3648)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DISubroutineType(types: !1572)
!1572 = !{!950, !1497, !1134, !950}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1327, file: !4, line: 2383, baseType: !950, size: 32, align: 32, offset: 3712)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1327, file: !4, line: 2386, baseType: !1504, size: 32, align: 32, offset: 3744)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1327, file: !4, line: 2387, baseType: !1504, size: 32, align: 32, offset: 3776)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1327, file: !4, line: 2394, baseType: !950, size: 32, align: 32, offset: 3808)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1327, file: !4, line: 2401, baseType: !950, size: 32, align: 32, offset: 3840)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1327, file: !4, line: 2408, baseType: !950, size: 32, align: 32, offset: 3872)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1327, file: !4, line: 2415, baseType: !950, size: 32, align: 32, offset: 3904)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1327, file: !4, line: 2422, baseType: !950, size: 32, align: 32, offset: 3936)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1327, file: !4, line: 2423, baseType: !1582, size: 64, align: 64, offset: 3968)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1584)
!1584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1585)
!1585 = !{!1586, !1587, !1588, !1589}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1584, file: !4, line: 827, baseType: !950, size: 32, align: 32)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1584, file: !4, line: 828, baseType: !950, size: 32, align: 32, offset: 32)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1584, file: !4, line: 829, baseType: !950, size: 32, align: 32, offset: 64)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1584, file: !4, line: 830, baseType: !1504, size: 32, align: 32, offset: 96)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1327, file: !4, line: 2430, baseType: !954, size: 64, align: 64, offset: 4032)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1327, file: !4, line: 2437, baseType: !954, size: 64, align: 64, offset: 4096)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1327, file: !4, line: 2444, baseType: !1504, size: 32, align: 32, offset: 4160)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1327, file: !4, line: 2451, baseType: !1504, size: 32, align: 32, offset: 4192)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1327, file: !4, line: 2458, baseType: !950, size: 32, align: 32, offset: 4224)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1327, file: !4, line: 2469, baseType: !950, size: 32, align: 32, offset: 4256)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1327, file: !4, line: 2475, baseType: !950, size: 32, align: 32, offset: 4288)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1327, file: !4, line: 2481, baseType: !950, size: 32, align: 32, offset: 4320)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1327, file: !4, line: 2485, baseType: !950, size: 32, align: 32, offset: 4352)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1327, file: !4, line: 2489, baseType: !950, size: 32, align: 32, offset: 4384)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1327, file: !4, line: 2493, baseType: !950, size: 32, align: 32, offset: 4416)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1327, file: !4, line: 2501, baseType: !950, size: 32, align: 32, offset: 4448)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1327, file: !4, line: 2506, baseType: !950, size: 32, align: 32, offset: 4480)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1327, file: !4, line: 2510, baseType: !950, size: 32, align: 32, offset: 4512)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1327, file: !4, line: 2514, baseType: !954, size: 64, align: 64, offset: 4544)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1327, file: !4, line: 2528, baseType: !1606, size: 64, align: 64, offset: 4608)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DISubroutineType(types: !1608)
!1608 = !{null, !1497, !949, !950, !950}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1327, file: !4, line: 2534, baseType: !950, size: 32, align: 32, offset: 4672)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1327, file: !4, line: 2545, baseType: !950, size: 32, align: 32, offset: 4704)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1327, file: !4, line: 2547, baseType: !950, size: 32, align: 32, offset: 4736)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1327, file: !4, line: 2549, baseType: !950, size: 32, align: 32, offset: 4768)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1327, file: !4, line: 2551, baseType: !950, size: 32, align: 32, offset: 4800)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1327, file: !4, line: 2553, baseType: !950, size: 32, align: 32, offset: 4832)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1327, file: !4, line: 2555, baseType: !950, size: 32, align: 32, offset: 4864)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1327, file: !4, line: 2557, baseType: !950, size: 32, align: 32, offset: 4896)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1327, file: !4, line: 2559, baseType: !950, size: 32, align: 32, offset: 4928)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1327, file: !4, line: 2563, baseType: !950, size: 32, align: 32, offset: 4960)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1327, file: !4, line: 2571, baseType: !1430, size: 64, align: 64, offset: 4992)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1327, file: !4, line: 2579, baseType: !1430, size: 64, align: 64, offset: 5056)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1327, file: !4, line: 2586, baseType: !950, size: 32, align: 32, offset: 5120)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1327, file: !4, line: 2615, baseType: !950, size: 32, align: 32, offset: 5152)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1327, file: !4, line: 2627, baseType: !950, size: 32, align: 32, offset: 5184)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1327, file: !4, line: 2637, baseType: !950, size: 32, align: 32, offset: 5216)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1327, file: !4, line: 2681, baseType: !950, size: 32, align: 32, offset: 5248)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1327, file: !4, line: 2709, baseType: !954, size: 64, align: 64, offset: 5312)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1327, file: !4, line: 2716, baseType: !1628, size: 64, align: 64, offset: 5376)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1630)
!1630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1631)
!1631 = !{!1632, !1633, !1634, !1635, !1636, !1637, !1638, !1642, !1646, !1647, !1648, !1649, !1655, !1656, !1657, !1658, !1659}
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1630, file: !4, line: 3642, baseType: !970, size: 64, align: 64)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1630, file: !4, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1630, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1630, file: !4, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1630, file: !4, line: 3669, baseType: !950, size: 32, align: 32, offset: 160)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1630, file: !4, line: 3682, baseType: !1455, size: 64, align: 64, offset: 192)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1630, file: !4, line: 3698, baseType: !1639, size: 64, align: 64, offset: 256)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{!950, !1325, !1279, !944}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1630, file: !4, line: 3712, baseType: !1643, size: 64, align: 64, offset: 320)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64, align: 64)
!1644 = !DISubroutineType(types: !1645)
!1645 = !{!950, !1325, !950, !1279, !944}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1630, file: !4, line: 3726, baseType: !1639, size: 64, align: 64, offset: 384)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1630, file: !4, line: 3737, baseType: !1372, size: 64, align: 64, offset: 448)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1630, file: !4, line: 3746, baseType: !950, size: 32, align: 32, offset: 512)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1630, file: !4, line: 3757, baseType: !1650, size: 64, align: 64, offset: 576)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DISubroutineType(types: !1652)
!1652 = !{null, !1653}
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1630, file: !4, line: 3766, baseType: !1372, size: 64, align: 64, offset: 640)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1630, file: !4, line: 3774, baseType: !1372, size: 64, align: 64, offset: 704)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1630, file: !4, line: 3780, baseType: !950, size: 32, align: 32, offset: 768)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1630, file: !4, line: 3785, baseType: !950, size: 32, align: 32, offset: 800)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1630, file: !4, line: 3795, baseType: !1660, size: 64, align: 64, offset: 832)
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64, align: 64)
!1661 = !DISubroutineType(types: !1662)
!1662 = !{!950, !1325, !1080}
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1327, file: !4, line: 2728, baseType: !949, size: 64, align: 64, offset: 5440)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1327, file: !4, line: 2735, baseType: !1167, size: 512, align: 64, offset: 5504)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1327, file: !4, line: 2742, baseType: !950, size: 32, align: 32, offset: 6016)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1327, file: !4, line: 2755, baseType: !950, size: 32, align: 32, offset: 6048)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1327, file: !4, line: 2776, baseType: !950, size: 32, align: 32, offset: 6080)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1327, file: !4, line: 2783, baseType: !950, size: 32, align: 32, offset: 6112)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1327, file: !4, line: 2791, baseType: !950, size: 32, align: 32, offset: 6144)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1327, file: !4, line: 2802, baseType: !1134, size: 64, align: 64, offset: 6208)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1327, file: !4, line: 2811, baseType: !950, size: 32, align: 32, offset: 6272)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1327, file: !4, line: 2821, baseType: !950, size: 32, align: 32, offset: 6304)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1327, file: !4, line: 2830, baseType: !950, size: 32, align: 32, offset: 6336)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1327, file: !4, line: 2840, baseType: !950, size: 32, align: 32, offset: 6368)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1327, file: !4, line: 2851, baseType: !1676, size: 64, align: 64, offset: 6400)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DISubroutineType(types: !1678)
!1678 = !{!950, !1497, !1679, !949, !1440, !950, !950}
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DISubroutineType(types: !1681)
!1681 = !{!950, !1497, !949}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1327, file: !4, line: 2871, baseType: !1683, size: 64, align: 64, offset: 6464)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DISubroutineType(types: !1685)
!1685 = !{!950, !1497, !1686, !949, !1440, !950}
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64, align: 64)
!1687 = !DISubroutineType(types: !1688)
!1688 = !{!950, !1497, !949, !950, !950}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1327, file: !4, line: 2878, baseType: !950, size: 32, align: 32, offset: 6528)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1327, file: !4, line: 2885, baseType: !950, size: 32, align: 32, offset: 6560)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1327, file: !4, line: 3005, baseType: !950, size: 32, align: 32, offset: 6592)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1327, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1327, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1327, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1327, file: !4, line: 3037, baseType: !951, size: 64, align: 64, offset: 6720)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1327, file: !4, line: 3038, baseType: !950, size: 32, align: 32, offset: 6784)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1327, file: !4, line: 3050, baseType: !947, size: 64, align: 64, offset: 6848)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1327, file: !4, line: 3065, baseType: !950, size: 32, align: 32, offset: 6912)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1327, file: !4, line: 3083, baseType: !950, size: 32, align: 32, offset: 6944)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1327, file: !4, line: 3092, baseType: !1153, size: 64, align: 32, offset: 6976)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1327, file: !4, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1327, file: !4, line: 3106, baseType: !1153, size: 64, align: 32, offset: 7072)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1327, file: !4, line: 3113, baseType: !1704, size: 64, align: 64, offset: 7168)
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1705, size: 64, align: 64)
!1705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1706)
!1706 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1707)
!1707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1708)
!1708 = !{!1709, !1710, !1711, !1712, !1713, !1714, !1717}
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1707, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1707, file: !4, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1707, file: !4, line: 720, baseType: !970, size: 64, align: 64, offset: 64)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1707, file: !4, line: 724, baseType: !970, size: 64, align: 64, offset: 128)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1707, file: !4, line: 728, baseType: !950, size: 32, align: 32, offset: 192)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1707, file: !4, line: 734, baseType: !1715, size: 64, align: 64, offset: 256)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1707, file: !4, line: 739, baseType: !1718, size: 64, align: 64, offset: 320)
!1718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1719, size: 64, align: 64)
!1719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1363)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1327, file: !4, line: 3129, baseType: !954, size: 64, align: 64, offset: 7232)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1327, file: !4, line: 3130, baseType: !954, size: 64, align: 64, offset: 7296)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1327, file: !4, line: 3131, baseType: !954, size: 64, align: 64, offset: 7360)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1327, file: !4, line: 3132, baseType: !954, size: 64, align: 64, offset: 7424)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1327, file: !4, line: 3139, baseType: !1430, size: 64, align: 64, offset: 7488)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1327, file: !4, line: 3147, baseType: !950, size: 32, align: 32, offset: 7552)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1327, file: !4, line: 3165, baseType: !950, size: 32, align: 32, offset: 7584)
