; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpdec_asf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpdec_asf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RTPDynamicProtocolHandler = type { i8*, i32, i32, i32, i32, i32, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*, i8*)*, void (%struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, %struct.PayloadContext*, %struct.AVStream*, %struct.AVPacket*, i32*, i8*, i32, i16, i32)*, i32 (%struct.PayloadContext*)*, %struct.RTPDynamicProtocolHandler* }

!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RTSPClientState", file: !939, line: 195, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "libavformat/rtsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!940 = !{!941, !942, !943, !944}
!941 = !DIEnumerator(name: "RTSP_STATE_IDLE", value: 0)
!942 = !DIEnumerator(name: "RTSP_STATE_STREAMING", value: 1)
!943 = !DIEnumerator(name: "RTSP_STATE_PAUSED", value: 2)
!944 = !DIEnumerator(name: "RTSP_STATE_SEEKING", value: 3)
!945 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RTSPTransport", file: !939, line: 56, size: 32, align: 32, elements: !946)
!946 = !{!947, !948, !949, !950}
!947 = !DIEnumerator(name: "RTSP_TRANSPORT_RTP", value: 0)
!948 = !DIEnumerator(name: "RTSP_TRANSPORT_RDT", value: 1)
!949 = !DIEnumerator(name: "RTSP_TRANSPORT_RAW", value: 2)
!950 = !DIEnumerator(name: "RTSP_TRANSPORT_NB", value: 3)
!951 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RTSPLowerTransport", file: !939, line: 37, size: 32, align: 32, elements: !952)
!952 = !{!953, !954, !955, !956, !957, !958}
!953 = !DIEnumerator(name: "RTSP_LOWER_TRANSPORT_UDP", value: 0)
!954 = !DIEnumerator(name: "RTSP_LOWER_TRANSPORT_TCP", value: 1)
!955 = !DIEnumerator(name: "RTSP_LOWER_TRANSPORT_UDP_MULTICAST", value: 2)
!956 = !DIEnumerator(name: "RTSP_LOWER_TRANSPORT_NB", value: 3)
!957 = !DIEnumerator(name: "RTSP_LOWER_TRANSPORT_HTTP", value: 8)
!958 = !DIEnumerator(name: "RTSP_LOWER_TRANSPORT_CUSTOM", value: 16)
!959 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RTSPServerType", file: !939, line: 206, size: 32, align: 32, elements: !960)
!960 = !{!961, !962, !963, !964}
!961 = !DIEnumerator(name: "RTSP_SERVER_RTP", value: 0)
!962 = !DIEnumerator(name: "RTSP_SERVER_REAL", value: 1)
!963 = !DIEnumerator(name: "RTSP_SERVER_WMS", value: 2)
!964 = !DIEnumerator(name: "RTSP_SERVER_NB", value: 3)
!965 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RTSPControlTransport", file: !939, line: 67, size: 32, align: 32, elements: !966)
!966 = !{!967, !968}
!967 = !DIEnumerator(name: "RTSP_MODE_PLAIN", value: 0)
!968 = !DIEnumerator(name: "RTSP_MODE_TUNNEL", value: 1)
!969 = !{!970, !971, !972, !981, !987, !988, !989}
!970 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!971 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !975, line: 220, size: 64, align: 8, elements: !976)
!975 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!976 = !{!977}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !974, file: !975, line: 220, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !979, line: 55, baseType: !980)
!979 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!980 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !975, line: 221, size: 32, align: 8, elements: !984)
!984 = !{!985}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !983, file: !975, line: 221, baseType: !986, size: 32, align: 32)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !979, line: 51, baseType: !971)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !979, line: 48, baseType: !991)
!991 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!992 = !{!993, !2277}
!993 = distinct !DIGlobalVariable(name: "ff_ms_rtp_asf_pfv_handler", scope: !0, file: !994, line: 313, type: !995, isLocal: false, isDefinition: true, variable: %struct.RTPDynamicProtocolHandler* @ff_ms_rtp_asf_pfv_handler)
!994 = !DIFile(filename: "libavformat/rtpdec_asf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTPDynamicProtocolHandler", file: !997, line: 33, baseType: !998)
!997 = !DIFile(filename: "libavformat/rtpdec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RTPDynamicProtocolHandler", file: !997, line: 115, size: 640, align: 64, elements: !999)
!999 = !{!1000, !1004, !1005, !1006, !1007, !1008, !1009, !2257, !2261, !2265, !2271, !2275}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "enc_name", scope: !998, file: !997, line: 116, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1003 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !998, file: !997, line: 117, baseType: !658, size: 32, align: 32, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !998, file: !997, line: 118, baseType: !46, size: 32, align: 32, offset: 96)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "need_parsing", scope: !998, file: !997, line: 119, baseType: !918, size: 32, align: 32, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "static_payload_id", scope: !998, file: !997, line: 120, baseType: !970, size: 32, align: 32, offset: 160)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !998, file: !997, line: 123, baseType: !970, size: 32, align: 32, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !998, file: !997, line: 126, baseType: !1010, size: 64, align: 64, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!970, !1013, !970, !2250}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !919, line: 1947, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1016)
!1016 = !{!1017, !1099, !1207, !1347, !1348, !1413, !1414, !1415, !2107, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2161, !2162, !2163, !2164, !2165, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2216, !2217, !2220, !2221, !2222, !2223, !2224, !2225, !2227, !2228, !2229, !2230, !2238, !2239, !2243, !2247, !2248, !2249}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1015, file: !919, line: 1342, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !1022)
!1022 = !{!1023, !1024, !1028, !1058, !1059, !1060, !1061, !1065, !1071, !1073, !1077}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1021, file: !26, line: 72, baseType: !1001, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1021, file: !26, line: 78, baseType: !1025, size: 64, align: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!1001, !988}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1021, file: !26, line: 85, baseType: !1029, size: 64, align: 64, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1054, !1055, !1056, !1057}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1031, file: !4, line: 247, baseType: !1001, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1031, file: !4, line: 253, baseType: !1001, size: 64, align: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1031, file: !4, line: 259, baseType: !970, size: 32, align: 32, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1031, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1031, file: !4, line: 271, baseType: !1038, size: 64, align: 64, offset: 192)
!1038 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1031, file: !4, line: 265, size: 64, align: 64, elements: !1039)
!1039 = !{!1040, !1044, !1046, !1047}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1038, file: !4, line: 266, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1042, line: 197, baseType: !1043)
!1042 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1043 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1038, file: !4, line: 267, baseType: !1045, size: 64, align: 64)
!1045 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1038, file: !4, line: 268, baseType: !1001, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1038, file: !4, line: 270, baseType: !1048, size: 64, align: 32)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1049, line: 61, baseType: !1050)
!1049 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1049, line: 58, size: 64, align: 32, elements: !1051)
!1051 = !{!1052, !1053}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1050, file: !1049, line: 59, baseType: !970, size: 32, align: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1050, file: !1049, line: 60, baseType: !970, size: 32, align: 32, offset: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1031, file: !4, line: 272, baseType: !1045, size: 64, align: 64, offset: 256)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1031, file: !4, line: 273, baseType: !1045, size: 64, align: 64, offset: 320)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1031, file: !4, line: 275, baseType: !970, size: 32, align: 32, offset: 384)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1031, file: !4, line: 300, baseType: !1001, size: 64, align: 64, offset: 448)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1021, file: !26, line: 93, baseType: !970, size: 32, align: 32, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1021, file: !26, line: 99, baseType: !970, size: 32, align: 32, offset: 224)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1021, file: !26, line: 108, baseType: !970, size: 32, align: 32, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1021, file: !26, line: 113, baseType: !1062, size: 64, align: 64, offset: 320)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!988, !988, !988}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1021, file: !26, line: 123, baseType: !1066, size: 64, align: 64, offset: 384)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!1069, !1069}
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1021, file: !26, line: 130, baseType: !1072, size: 32, align: 32, offset: 448)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1021, file: !26, line: 136, baseType: !1074, size: 64, align: 64, offset: 512)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!1072, !988}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1021, file: !26, line: 142, baseType: !1078, size: 64, align: 64, offset: 576)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!970, !1081, !988, !1001, !970}
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1084)
!1084 = !{!1085, !1097, !1098}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1083, file: !4, line: 360, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1090)
!1090 = !{!1091, !1092, !1093, !1094, !1095, !1096}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1089, file: !4, line: 307, baseType: !1001, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1089, file: !4, line: 313, baseType: !1045, size: 64, align: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1089, file: !4, line: 313, baseType: !1045, size: 64, align: 64, offset: 128)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1089, file: !4, line: 318, baseType: !1045, size: 64, align: 64, offset: 192)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1089, file: !4, line: 318, baseType: !1045, size: 64, align: 64, offset: 256)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1089, file: !4, line: 323, baseType: !970, size: 32, align: 32, offset: 320)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1083, file: !4, line: 364, baseType: !970, size: 32, align: 32, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1083, file: !4, line: 368, baseType: !970, size: 32, align: 32, offset: 96)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1015, file: !919, line: 1349, baseType: !1100, size: 64, align: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1102)
!1102 = !{!1103, !1104, !1105, !1106, !1107, !1117, !1118, !1119, !1120, !1121, !1122, !1135, !1140, !1178, !1179, !1183, !1188, !1189, !1190, !1194, !1200, !1206}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1101, file: !919, line: 638, baseType: !1001, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1101, file: !919, line: 645, baseType: !1001, size: 64, align: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1101, file: !919, line: 652, baseType: !970, size: 32, align: 32, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1101, file: !919, line: 659, baseType: !1001, size: 64, align: 64, offset: 192)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1101, file: !919, line: 661, baseType: !1108, size: 64, align: 64, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1110)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1113, line: 44, size: 64, align: 32, elements: !1114)
!1113 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1114 = !{!1115, !1116}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1112, file: !1113, line: 45, baseType: !46, size: 32, align: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1112, file: !1113, line: 46, baseType: !971, size: 32, align: 32, offset: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1101, file: !919, line: 663, baseType: !1018, size: 64, align: 64, offset: 320)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1101, file: !919, line: 670, baseType: !1001, size: 64, align: 64, offset: 384)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1101, file: !919, line: 679, baseType: !1100, size: 64, align: 64, offset: 448)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1101, file: !919, line: 684, baseType: !970, size: 32, align: 32, offset: 512)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1101, file: !919, line: 689, baseType: !970, size: 32, align: 32, offset: 544)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1101, file: !919, line: 696, baseType: !1123, size: 64, align: 64, offset: 576)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!970, !1126}
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1129)
!1129 = !{!1130, !1131, !1133, !1134}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1128, file: !919, line: 449, baseType: !1001, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1128, file: !919, line: 450, baseType: !1132, size: 64, align: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1128, file: !919, line: 451, baseType: !970, size: 32, align: 32, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1128, file: !919, line: 452, baseType: !1001, size: 64, align: 64, offset: 192)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1101, file: !919, line: 703, baseType: !1136, size: 64, align: 64, offset: 640)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!970, !1139}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1101, file: !919, line: 714, baseType: !1141, size: 64, align: 64, offset: 704)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!970, !1139, !1144}
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !47, line: 1499, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !47, line: 1445, size: 704, align: 64, elements: !1147)
!1147 = !{!1148, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1174, !1175, !1176, !1177}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1146, file: !47, line: 1451, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1151, line: 94, baseType: !1152)
!1151 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1151, line: 81, size: 192, align: 64, elements: !1153)
!1153 = !{!1154, !1158, !1159}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1152, file: !1151, line: 82, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1151, line: 73, baseType: !1157)
!1157 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1151, line: 73, flags: DIFlagFwdDecl)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1152, file: !1151, line: 89, baseType: !989, size: 64, align: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1152, file: !1151, line: 93, baseType: !970, size: 32, align: 32, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1146, file: !47, line: 1461, baseType: !1041, size: 64, align: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1146, file: !47, line: 1467, baseType: !1041, size: 64, align: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1146, file: !47, line: 1468, baseType: !989, size: 64, align: 64, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1146, file: !47, line: 1469, baseType: !970, size: 32, align: 32, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1146, file: !47, line: 1470, baseType: !970, size: 32, align: 32, offset: 288)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1146, file: !47, line: 1474, baseType: !970, size: 32, align: 32, offset: 320)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1146, file: !47, line: 1479, baseType: !1167, size: 64, align: 64, offset: 384)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !47, line: 1415, baseType: !1169)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !47, line: 1411, size: 128, align: 64, elements: !1170)
!1170 = !{!1171, !1172, !1173}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1169, file: !47, line: 1412, baseType: !989, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1169, file: !47, line: 1413, baseType: !970, size: 32, align: 32, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1169, file: !47, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1146, file: !47, line: 1480, baseType: !970, size: 32, align: 32, offset: 448)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1146, file: !47, line: 1486, baseType: !1041, size: 64, align: 64, offset: 512)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1146, file: !47, line: 1488, baseType: !1041, size: 64, align: 64, offset: 576)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1146, file: !47, line: 1497, baseType: !1041, size: 64, align: 64, offset: 640)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1101, file: !919, line: 720, baseType: !1136, size: 64, align: 64, offset: 768)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1101, file: !919, line: 730, baseType: !1180, size: 64, align: 64, offset: 832)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!970, !1139, !970, !1041, !970}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1101, file: !919, line: 737, baseType: !1184, size: 64, align: 64, offset: 896)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!1041, !1139, !970, !1187, !1041}
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1101, file: !919, line: 744, baseType: !1136, size: 64, align: 64, offset: 960)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1101, file: !919, line: 750, baseType: !1136, size: 64, align: 64, offset: 1024)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1101, file: !919, line: 758, baseType: !1191, size: 64, align: 64, offset: 1088)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!970, !1139, !970, !1041, !1041, !1041, !970}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1101, file: !919, line: 764, baseType: !1195, size: 64, align: 64, offset: 1152)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!970, !1139, !1198}
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1101, file: !919, line: 770, baseType: !1201, size: 64, align: 64, offset: 1216)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!970, !1139, !1204}
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1101, file: !919, line: 776, baseType: !1201, size: 64, align: 64, offset: 1280)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1015, file: !919, line: 1356, baseType: !1208, size: 64, align: 64, offset: 128)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1210)
!1210 = !{!1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1230, !1234, !1238, !1244, !1332, !1333, !1334, !1335, !1336, !1337, !1341}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1209, file: !919, line: 498, baseType: !1001, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1209, file: !919, line: 504, baseType: !1001, size: 64, align: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1209, file: !919, line: 505, baseType: !1001, size: 64, align: 64, offset: 128)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1209, file: !919, line: 506, baseType: !1001, size: 64, align: 64, offset: 192)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1209, file: !919, line: 508, baseType: !46, size: 32, align: 32, offset: 256)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1209, file: !919, line: 509, baseType: !46, size: 32, align: 32, offset: 288)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1209, file: !919, line: 510, baseType: !46, size: 32, align: 32, offset: 320)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1209, file: !919, line: 517, baseType: !970, size: 32, align: 32, offset: 352)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1209, file: !919, line: 523, baseType: !1108, size: 64, align: 64, offset: 384)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1209, file: !919, line: 526, baseType: !1018, size: 64, align: 64, offset: 448)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1209, file: !919, line: 535, baseType: !1208, size: 64, align: 64, offset: 512)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1209, file: !919, line: 539, baseType: !970, size: 32, align: 32, offset: 576)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1209, file: !919, line: 541, baseType: !1136, size: 64, align: 64, offset: 640)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1209, file: !919, line: 549, baseType: !1141, size: 64, align: 64, offset: 704)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1209, file: !919, line: 550, baseType: !1136, size: 64, align: 64, offset: 768)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1209, file: !919, line: 554, baseType: !1227, size: 64, align: 64, offset: 832)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!970, !1139, !1144, !1144, !970}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1209, file: !919, line: 563, baseType: !1231, size: 64, align: 64, offset: 896)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!970, !46, !970}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1209, file: !919, line: 565, baseType: !1235, size: 64, align: 64, offset: 960)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{null, !1139, !970, !1187, !1187}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1209, file: !919, line: 570, baseType: !1239, size: 64, align: 64, offset: 1024)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!970, !1139, !970, !988, !1242}
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1243, line: 216, baseType: !980)
!1243 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1209, file: !919, line: 581, baseType: !1245, size: 64, align: 64, offset: 1088)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!970, !1139, !970, !1248, !971}
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1252)
!1252 = !{!1253, !1257, !1259, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1286, !1288, !1289, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1251, file: !548, line: 282, baseType: !1254, size: 512, align: 64)
!1254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !989, size: 512, align: 64, elements: !1255)
!1255 = !{!1256}
!1256 = !DISubrange(count: 8)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1251, file: !548, line: 299, baseType: !1258, size: 256, align: 32, offset: 512)
!1258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !970, size: 256, align: 32, elements: !1255)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1251, file: !548, line: 315, baseType: !1260, size: 64, align: 64, offset: 768)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1251, file: !548, line: 326, baseType: !970, size: 32, align: 32, offset: 832)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1251, file: !548, line: 326, baseType: !970, size: 32, align: 32, offset: 864)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1251, file: !548, line: 334, baseType: !970, size: 32, align: 32, offset: 896)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1251, file: !548, line: 341, baseType: !970, size: 32, align: 32, offset: 928)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1251, file: !548, line: 346, baseType: !970, size: 32, align: 32, offset: 960)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1251, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1251, file: !548, line: 356, baseType: !1048, size: 64, align: 32, offset: 1024)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1251, file: !548, line: 361, baseType: !1041, size: 64, align: 64, offset: 1088)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1251, file: !548, line: 369, baseType: !1041, size: 64, align: 64, offset: 1152)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1251, file: !548, line: 377, baseType: !1041, size: 64, align: 64, offset: 1216)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1251, file: !548, line: 382, baseType: !970, size: 32, align: 32, offset: 1280)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1251, file: !548, line: 386, baseType: !970, size: 32, align: 32, offset: 1312)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1251, file: !548, line: 391, baseType: !970, size: 32, align: 32, offset: 1344)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1251, file: !548, line: 396, baseType: !988, size: 64, align: 64, offset: 1408)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1251, file: !548, line: 403, baseType: !1276, size: 512, align: 64, offset: 1472)
!1276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 512, align: 64, elements: !1255)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1251, file: !548, line: 410, baseType: !970, size: 32, align: 32, offset: 1984)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1251, file: !548, line: 415, baseType: !970, size: 32, align: 32, offset: 2016)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1251, file: !548, line: 420, baseType: !970, size: 32, align: 32, offset: 2048)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1251, file: !548, line: 425, baseType: !970, size: 32, align: 32, offset: 2080)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1251, file: !548, line: 435, baseType: !1041, size: 64, align: 64, offset: 2112)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1251, file: !548, line: 440, baseType: !970, size: 32, align: 32, offset: 2176)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1251, file: !548, line: 445, baseType: !978, size: 64, align: 64, offset: 2240)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1251, file: !548, line: 459, baseType: !1285, size: 512, align: 64, offset: 2304)
!1285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1149, size: 512, align: 64, elements: !1255)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1251, file: !548, line: 473, baseType: !1287, size: 64, align: 64, offset: 2816)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1251, file: !548, line: 477, baseType: !970, size: 32, align: 32, offset: 2880)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1251, file: !548, line: 479, baseType: !1290, size: 64, align: 64, offset: 2944)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1293)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1294)
!1294 = !{!1295, !1296, !1297, !1298, !1303}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1293, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1293, file: !548, line: 203, baseType: !989, size: 64, align: 64, offset: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1293, file: !548, line: 204, baseType: !970, size: 32, align: 32, offset: 128)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1293, file: !548, line: 205, baseType: !1299, size: 64, align: 64, offset: 192)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1301, line: 86, baseType: !1302)
!1301 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1302 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1301, line: 86, flags: DIFlagFwdDecl)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1293, file: !548, line: 206, baseType: !1149, size: 64, align: 64, offset: 256)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1251, file: !548, line: 480, baseType: !970, size: 32, align: 32, offset: 3008)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1251, file: !548, line: 505, baseType: !970, size: 32, align: 32, offset: 3040)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1251, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1251, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1251, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1251, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1251, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1251, file: !548, line: 532, baseType: !1041, size: 64, align: 64, offset: 3264)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1251, file: !548, line: 539, baseType: !1041, size: 64, align: 64, offset: 3328)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1251, file: !548, line: 547, baseType: !1041, size: 64, align: 64, offset: 3392)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1251, file: !548, line: 554, baseType: !1299, size: 64, align: 64, offset: 3456)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1251, file: !548, line: 563, baseType: !970, size: 32, align: 32, offset: 3520)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1251, file: !548, line: 572, baseType: !970, size: 32, align: 32, offset: 3552)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1251, file: !548, line: 581, baseType: !970, size: 32, align: 32, offset: 3584)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1251, file: !548, line: 588, baseType: !1319, size: 64, align: 64, offset: 3648)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1042, line: 194, baseType: !1321)
!1321 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1251, file: !548, line: 593, baseType: !970, size: 32, align: 32, offset: 3712)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1251, file: !548, line: 596, baseType: !970, size: 32, align: 32, offset: 3744)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1251, file: !548, line: 599, baseType: !1149, size: 64, align: 64, offset: 3776)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1251, file: !548, line: 605, baseType: !1149, size: 64, align: 64, offset: 3840)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1251, file: !548, line: 616, baseType: !1149, size: 64, align: 64, offset: 3904)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1251, file: !548, line: 626, baseType: !1242, size: 64, align: 64, offset: 3968)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1251, file: !548, line: 627, baseType: !1242, size: 64, align: 64, offset: 4032)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1251, file: !548, line: 628, baseType: !1242, size: 64, align: 64, offset: 4096)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1251, file: !548, line: 629, baseType: !1242, size: 64, align: 64, offset: 4160)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1251, file: !548, line: 645, baseType: !1149, size: 64, align: 64, offset: 4224)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1209, file: !919, line: 587, baseType: !1195, size: 64, align: 64, offset: 1152)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1209, file: !919, line: 592, baseType: !1201, size: 64, align: 64, offset: 1216)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1209, file: !919, line: 597, baseType: !1201, size: 64, align: 64, offset: 1280)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1209, file: !919, line: 598, baseType: !46, size: 32, align: 32, offset: 1344)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1209, file: !919, line: 608, baseType: !1136, size: 64, align: 64, offset: 1408)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1209, file: !919, line: 617, baseType: !1338, size: 64, align: 64, offset: 1472)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{null, !1139}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1209, file: !919, line: 623, baseType: !1342, size: 64, align: 64, offset: 1536)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!970, !1139, !1345}
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1145)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1015, file: !919, line: 1365, baseType: !988, size: 64, align: 64, offset: 192)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1015, file: !919, line: 1379, baseType: !1349, size: 64, align: 64, offset: 256)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1351)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1352)
!1352 = !{!1353, !1354, !1355, !1356, !1357, !1358, !1359, !1363, !1364, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1380, !1381, !1385, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1403, !1404, !1405, !1406, !1410, !1411, !1412}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1351, file: !650, line: 174, baseType: !1018, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1351, file: !650, line: 226, baseType: !1132, size: 64, align: 64, offset: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1351, file: !650, line: 227, baseType: !970, size: 32, align: 32, offset: 128)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1351, file: !650, line: 228, baseType: !1132, size: 64, align: 64, offset: 192)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1351, file: !650, line: 229, baseType: !1132, size: 64, align: 64, offset: 256)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1351, file: !650, line: 233, baseType: !988, size: 64, align: 64, offset: 320)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1351, file: !650, line: 235, baseType: !1360, size: 64, align: 64, offset: 384)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{!970, !988, !989, !970}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1351, file: !650, line: 236, baseType: !1360, size: 64, align: 64, offset: 448)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1351, file: !650, line: 237, baseType: !1365, size: 64, align: 64, offset: 512)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{!1041, !988, !1041, !970}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1351, file: !650, line: 238, baseType: !1041, size: 64, align: 64, offset: 576)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1351, file: !650, line: 239, baseType: !970, size: 32, align: 32, offset: 640)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1351, file: !650, line: 240, baseType: !970, size: 32, align: 32, offset: 672)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1351, file: !650, line: 241, baseType: !970, size: 32, align: 32, offset: 704)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1351, file: !650, line: 242, baseType: !980, size: 64, align: 64, offset: 768)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1351, file: !650, line: 243, baseType: !1132, size: 64, align: 64, offset: 832)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1351, file: !650, line: 244, baseType: !1375, size: 64, align: 64, offset: 896)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DISubroutineType(types: !1377)
!1377 = !{!980, !980, !1378, !971}
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1351, file: !650, line: 245, baseType: !970, size: 32, align: 32, offset: 960)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1351, file: !650, line: 249, baseType: !1382, size: 64, align: 64, offset: 1024)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DISubroutineType(types: !1384)
!1384 = !{!970, !988, !970}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1351, file: !650, line: 255, baseType: !1386, size: 64, align: 64, offset: 1088)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DISubroutineType(types: !1388)
!1388 = !{!1041, !988, !970, !1041, !970}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1351, file: !650, line: 260, baseType: !970, size: 32, align: 32, offset: 1152)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1351, file: !650, line: 266, baseType: !1041, size: 64, align: 64, offset: 1216)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1351, file: !650, line: 273, baseType: !970, size: 32, align: 32, offset: 1280)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1351, file: !650, line: 279, baseType: !1041, size: 64, align: 64, offset: 1344)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1351, file: !650, line: 285, baseType: !970, size: 32, align: 32, offset: 1408)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1351, file: !650, line: 291, baseType: !970, size: 32, align: 32, offset: 1440)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1351, file: !650, line: 298, baseType: !970, size: 32, align: 32, offset: 1472)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1351, file: !650, line: 304, baseType: !970, size: 32, align: 32, offset: 1504)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1351, file: !650, line: 309, baseType: !1001, size: 64, align: 64, offset: 1536)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1351, file: !650, line: 314, baseType: !1001, size: 64, align: 64, offset: 1600)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1351, file: !650, line: 319, baseType: !1400, size: 64, align: 64, offset: 1664)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DISubroutineType(types: !1402)
!1402 = !{!970, !988, !989, !970, !649, !1041}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1351, file: !650, line: 326, baseType: !970, size: 32, align: 32, offset: 1728)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1351, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1351, file: !650, line: 332, baseType: !1041, size: 64, align: 64, offset: 1792)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1351, file: !650, line: 338, baseType: !1407, size: 64, align: 64, offset: 1856)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DISubroutineType(types: !1409)
!1409 = !{!970, !988}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1351, file: !650, line: 340, baseType: !1041, size: 64, align: 64, offset: 1920)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1351, file: !650, line: 346, baseType: !1132, size: 64, align: 64, offset: 1984)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1351, file: !650, line: 351, baseType: !970, size: 32, align: 32, offset: 2048)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1015, file: !919, line: 1386, baseType: !970, size: 32, align: 32, offset: 320)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1015, file: !919, line: 1393, baseType: !971, size: 32, align: 32, offset: 352)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1015, file: !919, line: 1405, baseType: !1416, size: 64, align: 64, offset: 384)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1419)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1420)
!1420 = !{!1421, !1422, !1423, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1893, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1993, !1999, !2000, !2004, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2036, !2037, !2038, !2039, !2040, !2041}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1419, file: !919, line: 866, baseType: !970, size: 32, align: 32)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1419, file: !919, line: 872, baseType: !970, size: 32, align: 32, offset: 32)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1419, file: !919, line: 878, baseType: !1424, size: 64, align: 64, offset: 64)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !47, line: 3360, baseType: !1426)
!1426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !47, line: 1556, size: 8448, align: 64, elements: !1427)
!1427 = !{!1428, !1429, !1430, !1431, !1568, !1569, !1570, !1571, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1597, !1601, !1602, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1781, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1426, file: !47, line: 1561, baseType: !1018, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1426, file: !47, line: 1562, baseType: !970, size: 32, align: 32, offset: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1426, file: !47, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1426, file: !47, line: 1565, baseType: !1432, size: 64, align: 64, offset: 128)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1434)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !47, line: 3468, size: 1984, align: 64, elements: !1435)
!1435 = !{!1436, !1437, !1438, !1439, !1440, !1441, !1444, !1447, !1450, !1453, !1456, !1457, !1458, !1466, !1467, !1468, !1470, !1474, !1480, !1485, !1489, !1490, !1533, !1540, !1544, !1545, !1549, !1553, !1557, !1561, !1562, !1563}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1434, file: !47, line: 3475, baseType: !1001, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1434, file: !47, line: 3480, baseType: !1001, size: 64, align: 64, offset: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1434, file: !47, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1434, file: !47, line: 3482, baseType: !46, size: 32, align: 32, offset: 160)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1434, file: !47, line: 3487, baseType: !970, size: 32, align: 32, offset: 192)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1434, file: !47, line: 3488, baseType: !1442, size: 64, align: 64, offset: 256)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1434, file: !47, line: 3489, baseType: !1445, size: 64, align: 64, offset: 320)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1434, file: !47, line: 3490, baseType: !1448, size: 64, align: 64, offset: 384)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1434, file: !47, line: 3491, baseType: !1451, size: 64, align: 64, offset: 448)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1434, file: !47, line: 3492, baseType: !1454, size: 64, align: 64, offset: 512)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1434, file: !47, line: 3493, baseType: !990, size: 8, align: 8, offset: 576)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1434, file: !47, line: 3494, baseType: !1018, size: 64, align: 64, offset: 640)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1434, file: !47, line: 3495, baseType: !1459, size: 64, align: 64, offset: 704)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1461)
!1461 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !47, line: 3404, baseType: !1462)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !47, line: 3401, size: 128, align: 64, elements: !1463)
!1463 = !{!1464, !1465}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1462, file: !47, line: 3402, baseType: !970, size: 32, align: 32)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1462, file: !47, line: 3403, baseType: !1001, size: 64, align: 64, offset: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1434, file: !47, line: 3507, baseType: !1001, size: 64, align: 64, offset: 768)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1434, file: !47, line: 3516, baseType: !970, size: 32, align: 32, offset: 832)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1434, file: !47, line: 3517, baseType: !1469, size: 64, align: 64, offset: 896)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1434, file: !47, line: 3527, baseType: !1471, size: 64, align: 64, offset: 960)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{!970, !1424}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1434, file: !47, line: 3535, baseType: !1475, size: 64, align: 64, offset: 1024)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!970, !1424, !1478}
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1425)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1434, file: !47, line: 3541, baseType: !1481, size: 64, align: 64, offset: 1088)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1483)
!1483 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !47, line: 3461, baseType: !1484)
!1484 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !47, line: 3461, flags: DIFlagFwdDecl)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1434, file: !47, line: 3549, baseType: !1486, size: 64, align: 64, offset: 1152)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DISubroutineType(types: !1488)
!1488 = !{null, !1469}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1434, file: !47, line: 3551, baseType: !1471, size: 64, align: 64, offset: 1216)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1434, file: !47, line: 3552, baseType: !1491, size: 64, align: 64, offset: 1280)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!970, !1424, !989, !970, !1494}
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1496)
!1496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !47, line: 3920, size: 256, align: 64, elements: !1497)
!1497 = !{!1498, !1501, !1502, !1503, !1504, !1532}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1496, file: !47, line: 3921, baseType: !1499, size: 16, align: 16)
!1499 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !979, line: 49, baseType: !1500)
!1500 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1496, file: !47, line: 3922, baseType: !986, size: 32, align: 32, offset: 32)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1496, file: !47, line: 3923, baseType: !986, size: 32, align: 32, offset: 64)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1496, file: !47, line: 3924, baseType: !971, size: 32, align: 32, offset: 96)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1496, file: !47, line: 3925, baseType: !1505, size: 64, align: 64, offset: 128)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !47, line: 3918, baseType: !1508)
!1508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !47, line: 3885, size: 1600, align: 64, elements: !1509)
!1509 = !{!1510, !1511, !1512, !1513, !1514, !1515, !1521, !1525, !1527, !1528, !1530, !1531}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1508, file: !47, line: 3886, baseType: !970, size: 32, align: 32)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1508, file: !47, line: 3887, baseType: !970, size: 32, align: 32, offset: 32)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1508, file: !47, line: 3888, baseType: !970, size: 32, align: 32, offset: 64)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1508, file: !47, line: 3889, baseType: !970, size: 32, align: 32, offset: 96)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1508, file: !47, line: 3890, baseType: !970, size: 32, align: 32, offset: 128)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1508, file: !47, line: 3897, baseType: !1516, size: 768, align: 64, offset: 192)
!1516 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !47, line: 3858, baseType: !1517)
!1517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !47, line: 3853, size: 768, align: 64, elements: !1518)
!1518 = !{!1519, !1520}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1517, file: !47, line: 3855, baseType: !1254, size: 512, align: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1517, file: !47, line: 3857, baseType: !1258, size: 256, align: 32, offset: 512)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1508, file: !47, line: 3903, baseType: !1522, size: 256, align: 64, offset: 960)
!1522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !989, size: 256, align: 64, elements: !1523)
!1523 = !{!1524}
!1524 = !DISubrange(count: 4)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1508, file: !47, line: 3904, baseType: !1526, size: 128, align: 32, offset: 1216)
!1526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !970, size: 128, align: 32, elements: !1523)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1508, file: !47, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1508, file: !47, line: 3908, baseType: !1529, size: 64, align: 64, offset: 1408)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1508, file: !47, line: 3915, baseType: !1529, size: 64, align: 64, offset: 1472)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1508, file: !47, line: 3917, baseType: !970, size: 32, align: 32, offset: 1536)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1496, file: !47, line: 3926, baseType: !1041, size: 64, align: 64, offset: 192)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1434, file: !47, line: 3564, baseType: !1534, size: 64, align: 64, offset: 1344)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{!970, !1424, !1144, !1537, !1539}
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1250)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1434, file: !47, line: 3566, baseType: !1541, size: 64, align: 64, offset: 1408)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{!970, !1424, !988, !1539, !1144}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1434, file: !47, line: 3567, baseType: !1471, size: 64, align: 64, offset: 1472)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1434, file: !47, line: 3576, baseType: !1546, size: 64, align: 64, offset: 1536)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DISubroutineType(types: !1548)
!1548 = !{!970, !1424, !1537}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1434, file: !47, line: 3577, baseType: !1550, size: 64, align: 64, offset: 1600)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{!970, !1424, !1144}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1434, file: !47, line: 3584, baseType: !1554, size: 64, align: 64, offset: 1664)
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1555, size: 64, align: 64)
!1555 = !DISubroutineType(types: !1556)
!1556 = !{!970, !1424, !1249}
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1434, file: !47, line: 3589, baseType: !1558, size: 64, align: 64, offset: 1728)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DISubroutineType(types: !1560)
!1560 = !{null, !1424}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1434, file: !47, line: 3594, baseType: !970, size: 32, align: 32, offset: 1792)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1434, file: !47, line: 3600, baseType: !1001, size: 64, align: 64, offset: 1856)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1434, file: !47, line: 3609, baseType: !1564, size: 64, align: 64, offset: 1920)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64, align: 64)
!1566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1567)
!1567 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !47, line: 3609, flags: DIFlagFwdDecl)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1426, file: !47, line: 1566, baseType: !46, size: 32, align: 32, offset: 192)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1426, file: !47, line: 1581, baseType: !971, size: 32, align: 32, offset: 224)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1426, file: !47, line: 1583, baseType: !988, size: 64, align: 64, offset: 256)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1426, file: !47, line: 1591, baseType: !1572, size: 64, align: 64, offset: 320)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !47, line: 1532, flags: DIFlagFwdDecl)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1426, file: !47, line: 1598, baseType: !988, size: 64, align: 64, offset: 384)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1426, file: !47, line: 1606, baseType: !1041, size: 64, align: 64, offset: 448)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1426, file: !47, line: 1614, baseType: !970, size: 32, align: 32, offset: 512)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1426, file: !47, line: 1622, baseType: !970, size: 32, align: 32, offset: 544)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1426, file: !47, line: 1628, baseType: !970, size: 32, align: 32, offset: 576)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1426, file: !47, line: 1636, baseType: !970, size: 32, align: 32, offset: 608)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1426, file: !47, line: 1643, baseType: !970, size: 32, align: 32, offset: 640)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1426, file: !47, line: 1657, baseType: !989, size: 64, align: 64, offset: 704)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1426, file: !47, line: 1658, baseType: !970, size: 32, align: 32, offset: 768)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1426, file: !47, line: 1679, baseType: !1048, size: 64, align: 32, offset: 800)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1426, file: !47, line: 1688, baseType: !970, size: 32, align: 32, offset: 864)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1426, file: !47, line: 1712, baseType: !970, size: 32, align: 32, offset: 896)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1426, file: !47, line: 1729, baseType: !970, size: 32, align: 32, offset: 928)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1426, file: !47, line: 1729, baseType: !970, size: 32, align: 32, offset: 960)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1426, file: !47, line: 1744, baseType: !970, size: 32, align: 32, offset: 992)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1426, file: !47, line: 1744, baseType: !970, size: 32, align: 32, offset: 1024)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1426, file: !47, line: 1751, baseType: !970, size: 32, align: 32, offset: 1056)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1426, file: !47, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1426, file: !47, line: 1791, baseType: !1593, size: 64, align: 64, offset: 1152)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DISubroutineType(types: !1595)
!1595 = !{null, !1596, !1537, !1539, !970, !970, !970}
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1426, file: !47, line: 1808, baseType: !1598, size: 64, align: 64, offset: 1216)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DISubroutineType(types: !1600)
!1600 = !{!667, !1596, !1445}
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1426, file: !47, line: 1816, baseType: !970, size: 32, align: 32, offset: 1280)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1426, file: !47, line: 1825, baseType: !1603, size: 32, align: 32, offset: 1312)
!1603 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1426, file: !47, line: 1830, baseType: !970, size: 32, align: 32, offset: 1344)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1426, file: !47, line: 1838, baseType: !1603, size: 32, align: 32, offset: 1376)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1426, file: !47, line: 1846, baseType: !970, size: 32, align: 32, offset: 1408)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1426, file: !47, line: 1851, baseType: !970, size: 32, align: 32, offset: 1440)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1426, file: !47, line: 1861, baseType: !1603, size: 32, align: 32, offset: 1472)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1426, file: !47, line: 1868, baseType: !1603, size: 32, align: 32, offset: 1504)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1426, file: !47, line: 1875, baseType: !1603, size: 32, align: 32, offset: 1536)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1426, file: !47, line: 1882, baseType: !1603, size: 32, align: 32, offset: 1568)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1426, file: !47, line: 1889, baseType: !1603, size: 32, align: 32, offset: 1600)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1426, file: !47, line: 1896, baseType: !1603, size: 32, align: 32, offset: 1632)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1426, file: !47, line: 1903, baseType: !1603, size: 32, align: 32, offset: 1664)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1426, file: !47, line: 1910, baseType: !970, size: 32, align: 32, offset: 1696)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1426, file: !47, line: 1915, baseType: !970, size: 32, align: 32, offset: 1728)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1426, file: !47, line: 1926, baseType: !1539, size: 64, align: 64, offset: 1792)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1426, file: !47, line: 1935, baseType: !1048, size: 64, align: 32, offset: 1856)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1426, file: !47, line: 1942, baseType: !970, size: 32, align: 32, offset: 1920)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1426, file: !47, line: 1948, baseType: !970, size: 32, align: 32, offset: 1952)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1426, file: !47, line: 1954, baseType: !970, size: 32, align: 32, offset: 1984)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1426, file: !47, line: 1960, baseType: !970, size: 32, align: 32, offset: 2016)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1426, file: !47, line: 1984, baseType: !970, size: 32, align: 32, offset: 2048)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1426, file: !47, line: 1991, baseType: !970, size: 32, align: 32, offset: 2080)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1426, file: !47, line: 1996, baseType: !970, size: 32, align: 32, offset: 2112)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1426, file: !47, line: 2004, baseType: !970, size: 32, align: 32, offset: 2144)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1426, file: !47, line: 2011, baseType: !970, size: 32, align: 32, offset: 2176)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1426, file: !47, line: 2018, baseType: !970, size: 32, align: 32, offset: 2208)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1426, file: !47, line: 2027, baseType: !970, size: 32, align: 32, offset: 2240)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1426, file: !47, line: 2034, baseType: !970, size: 32, align: 32, offset: 2272)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1426, file: !47, line: 2044, baseType: !970, size: 32, align: 32, offset: 2304)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1426, file: !47, line: 2054, baseType: !1633, size: 64, align: 64, offset: 2368)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1426, file: !47, line: 2061, baseType: !1633, size: 64, align: 64, offset: 2432)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1426, file: !47, line: 2066, baseType: !970, size: 32, align: 32, offset: 2496)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1426, file: !47, line: 2070, baseType: !970, size: 32, align: 32, offset: 2528)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1426, file: !47, line: 2078, baseType: !970, size: 32, align: 32, offset: 2560)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1426, file: !47, line: 2085, baseType: !970, size: 32, align: 32, offset: 2592)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1426, file: !47, line: 2092, baseType: !970, size: 32, align: 32, offset: 2624)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1426, file: !47, line: 2099, baseType: !970, size: 32, align: 32, offset: 2656)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1426, file: !47, line: 2106, baseType: !970, size: 32, align: 32, offset: 2688)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1426, file: !47, line: 2113, baseType: !970, size: 32, align: 32, offset: 2720)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1426, file: !47, line: 2120, baseType: !970, size: 32, align: 32, offset: 2752)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1426, file: !47, line: 2125, baseType: !970, size: 32, align: 32, offset: 2784)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1426, file: !47, line: 2133, baseType: !970, size: 32, align: 32, offset: 2816)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1426, file: !47, line: 2140, baseType: !970, size: 32, align: 32, offset: 2848)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1426, file: !47, line: 2145, baseType: !970, size: 32, align: 32, offset: 2880)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1426, file: !47, line: 2153, baseType: !970, size: 32, align: 32, offset: 2912)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1426, file: !47, line: 2158, baseType: !970, size: 32, align: 32, offset: 2944)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1426, file: !47, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1426, file: !47, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1426, file: !47, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1426, file: !47, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1426, file: !47, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1426, file: !47, line: 2203, baseType: !970, size: 32, align: 32, offset: 3136)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1426, file: !47, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1426, file: !47, line: 2212, baseType: !970, size: 32, align: 32, offset: 3200)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1426, file: !47, line: 2213, baseType: !970, size: 32, align: 32, offset: 3232)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1426, file: !47, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1426, file: !47, line: 2232, baseType: !970, size: 32, align: 32, offset: 3296)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1426, file: !47, line: 2243, baseType: !970, size: 32, align: 32, offset: 3328)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1426, file: !47, line: 2249, baseType: !970, size: 32, align: 32, offset: 3360)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1426, file: !47, line: 2256, baseType: !970, size: 32, align: 32, offset: 3392)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1426, file: !47, line: 2263, baseType: !978, size: 64, align: 64, offset: 3456)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1426, file: !47, line: 2270, baseType: !978, size: 64, align: 64, offset: 3520)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1426, file: !47, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1426, file: !47, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1426, file: !47, line: 2367, baseType: !1669, size: 64, align: 64, offset: 3648)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DISubroutineType(types: !1671)
!1671 = !{!970, !1596, !1249, !970}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1426, file: !47, line: 2383, baseType: !970, size: 32, align: 32, offset: 3712)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1426, file: !47, line: 2386, baseType: !1603, size: 32, align: 32, offset: 3744)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1426, file: !47, line: 2387, baseType: !1603, size: 32, align: 32, offset: 3776)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1426, file: !47, line: 2394, baseType: !970, size: 32, align: 32, offset: 3808)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1426, file: !47, line: 2401, baseType: !970, size: 32, align: 32, offset: 3840)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1426, file: !47, line: 2408, baseType: !970, size: 32, align: 32, offset: 3872)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1426, file: !47, line: 2415, baseType: !970, size: 32, align: 32, offset: 3904)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1426, file: !47, line: 2422, baseType: !970, size: 32, align: 32, offset: 3936)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1426, file: !47, line: 2423, baseType: !1681, size: 64, align: 64, offset: 3968)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !47, line: 831, baseType: !1683)
!1683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !47, line: 826, size: 128, align: 32, elements: !1684)
!1684 = !{!1685, !1686, !1687, !1688}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1683, file: !47, line: 827, baseType: !970, size: 32, align: 32)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1683, file: !47, line: 828, baseType: !970, size: 32, align: 32, offset: 32)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1683, file: !47, line: 829, baseType: !970, size: 32, align: 32, offset: 64)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1683, file: !47, line: 830, baseType: !1603, size: 32, align: 32, offset: 96)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1426, file: !47, line: 2430, baseType: !1041, size: 64, align: 64, offset: 4032)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1426, file: !47, line: 2437, baseType: !1041, size: 64, align: 64, offset: 4096)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1426, file: !47, line: 2444, baseType: !1603, size: 32, align: 32, offset: 4160)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1426, file: !47, line: 2451, baseType: !1603, size: 32, align: 32, offset: 4192)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1426, file: !47, line: 2458, baseType: !970, size: 32, align: 32, offset: 4224)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1426, file: !47, line: 2469, baseType: !970, size: 32, align: 32, offset: 4256)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1426, file: !47, line: 2475, baseType: !970, size: 32, align: 32, offset: 4288)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1426, file: !47, line: 2481, baseType: !970, size: 32, align: 32, offset: 4320)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1426, file: !47, line: 2485, baseType: !970, size: 32, align: 32, offset: 4352)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1426, file: !47, line: 2489, baseType: !970, size: 32, align: 32, offset: 4384)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1426, file: !47, line: 2493, baseType: !970, size: 32, align: 32, offset: 4416)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1426, file: !47, line: 2501, baseType: !970, size: 32, align: 32, offset: 4448)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1426, file: !47, line: 2506, baseType: !970, size: 32, align: 32, offset: 4480)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1426, file: !47, line: 2510, baseType: !970, size: 32, align: 32, offset: 4512)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1426, file: !47, line: 2514, baseType: !1041, size: 64, align: 64, offset: 4544)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1426, file: !47, line: 2528, baseType: !1705, size: 64, align: 64, offset: 4608)
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64, align: 64)
!1706 = !DISubroutineType(types: !1707)
!1707 = !{null, !1596, !988, !970, !970}
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1426, file: !47, line: 2534, baseType: !970, size: 32, align: 32, offset: 4672)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1426, file: !47, line: 2545, baseType: !970, size: 32, align: 32, offset: 4704)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1426, file: !47, line: 2547, baseType: !970, size: 32, align: 32, offset: 4736)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1426, file: !47, line: 2549, baseType: !970, size: 32, align: 32, offset: 4768)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1426, file: !47, line: 2551, baseType: !970, size: 32, align: 32, offset: 4800)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1426, file: !47, line: 2553, baseType: !970, size: 32, align: 32, offset: 4832)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1426, file: !47, line: 2555, baseType: !970, size: 32, align: 32, offset: 4864)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1426, file: !47, line: 2557, baseType: !970, size: 32, align: 32, offset: 4896)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1426, file: !47, line: 2559, baseType: !970, size: 32, align: 32, offset: 4928)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1426, file: !47, line: 2563, baseType: !970, size: 32, align: 32, offset: 4960)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1426, file: !47, line: 2571, baseType: !1529, size: 64, align: 64, offset: 4992)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1426, file: !47, line: 2579, baseType: !1529, size: 64, align: 64, offset: 5056)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1426, file: !47, line: 2586, baseType: !970, size: 32, align: 32, offset: 5120)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1426, file: !47, line: 2615, baseType: !970, size: 32, align: 32, offset: 5152)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1426, file: !47, line: 2627, baseType: !970, size: 32, align: 32, offset: 5184)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1426, file: !47, line: 2637, baseType: !970, size: 32, align: 32, offset: 5216)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1426, file: !47, line: 2681, baseType: !970, size: 32, align: 32, offset: 5248)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1426, file: !47, line: 2709, baseType: !1041, size: 64, align: 64, offset: 5312)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1426, file: !47, line: 2716, baseType: !1727, size: 64, align: 64, offset: 5376)
!1727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1728, size: 64, align: 64)
!1728 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1729)
!1729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !47, line: 3636, size: 896, align: 64, elements: !1730)
!1730 = !{!1731, !1732, !1733, !1734, !1735, !1736, !1737, !1741, !1745, !1746, !1747, !1748, !1754, !1755, !1756, !1757, !1758}
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1729, file: !47, line: 3642, baseType: !1001, size: 64, align: 64)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1729, file: !47, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1729, file: !47, line: 3656, baseType: !46, size: 32, align: 32, offset: 96)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1729, file: !47, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1729, file: !47, line: 3669, baseType: !970, size: 32, align: 32, offset: 160)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1729, file: !47, line: 3682, baseType: !1554, size: 64, align: 64, offset: 192)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1729, file: !47, line: 3698, baseType: !1738, size: 64, align: 64, offset: 256)
!1738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1739, size: 64, align: 64)
!1739 = !DISubroutineType(types: !1740)
!1740 = !{!970, !1424, !1378, !986}
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1729, file: !47, line: 3712, baseType: !1742, size: 64, align: 64, offset: 320)
!1742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1743, size: 64, align: 64)
!1743 = !DISubroutineType(types: !1744)
!1744 = !{!970, !1424, !970, !1378, !986}
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1729, file: !47, line: 3726, baseType: !1738, size: 64, align: 64, offset: 384)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1729, file: !47, line: 3737, baseType: !1471, size: 64, align: 64, offset: 448)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1729, file: !47, line: 3746, baseType: !970, size: 32, align: 32, offset: 512)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1729, file: !47, line: 3757, baseType: !1749, size: 64, align: 64, offset: 576)
!1749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1750, size: 64, align: 64)
!1750 = !DISubroutineType(types: !1751)
!1751 = !{null, !1752}
!1752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1753, size: 64, align: 64)
!1753 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !47, line: 3617, flags: DIFlagFwdDecl)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1729, file: !47, line: 3766, baseType: !1471, size: 64, align: 64, offset: 640)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1729, file: !47, line: 3774, baseType: !1471, size: 64, align: 64, offset: 704)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1729, file: !47, line: 3780, baseType: !970, size: 32, align: 32, offset: 768)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1729, file: !47, line: 3785, baseType: !970, size: 32, align: 32, offset: 800)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1729, file: !47, line: 3795, baseType: !1759, size: 64, align: 64, offset: 832)
!1759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1760, size: 64, align: 64)
!1760 = !DISubroutineType(types: !1761)
!1761 = !{!970, !1424, !1149}
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1426, file: !47, line: 2728, baseType: !988, size: 64, align: 64, offset: 5440)
