; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--mux.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--mux.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFormatContext = type { %struct.AVClass*, %struct.AVInputFormat*, %struct.AVOutputFormat*, i8*, %struct.AVIOContext*, i32, i32, %struct.AVStream**, [1024 x i8], i8*, i64, i64, i64, i32, i32, i32, i64, i64, i8*, i32, i32, %struct.AVProgram**, i32, i32, i32, i32, i32, i32, %struct.AVChapter**, %struct.AVDictionary*, i64, i32, i32, %struct.AVIOInterruptCB, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i8*, i8*, %struct.AVFormatInternal*, i32, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, i32, i8*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i64, i8*, i32, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVIOInterruptCB*, %struct.AVDictionary**)*, i8*, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVDictionary**)*, void (%struct.AVFormatContext*, %struct.AVIOContext*)*, i8*, i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }

!882 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!883 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !47, line: 3865, size: 32, align: 32, elements: !884)
!884 = !{!885, !886, !887, !888}
!885 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!886 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!887 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!888 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !47, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !47, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !47, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !47, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVRounding", file: !939, line: 79, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "./libavutil/mathematics.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!940 = !{!941, !942, !943, !944, !945, !946}
!941 = !DIEnumerator(name: "AV_ROUND_ZERO", value: 0)
!942 = !DIEnumerator(name: "AV_ROUND_INF", value: 1)
!943 = !DIEnumerator(name: "AV_ROUND_DOWN", value: 2)
!944 = !DIEnumerator(name: "AV_ROUND_UP", value: 3)
!945 = !DIEnumerator(name: "AV_ROUND_NEAR_INF", value: 5)
!946 = !DIEnumerator(name: "AV_ROUND_PASS_MINMAX", value: 8192)
!947 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVWriteUncodedFrameFlags", file: !948, line: 638, size: 32, align: 32, elements: !949)
!948 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!949 = !{!950}
!950 = !DIEnumerator(name: "AV_WRITE_UNCODED_FRAME_QUERY", value: 1)
!951 = !{!952, !966, !981, !975, !1039, !1140, !985}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !957)
!957 = !{!958, !962, !967, !998, !999, !1000, !1001, !1005, !1011, !1013, !1017}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !956, file: !26, line: 72, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !956, file: !26, line: 78, baseType: !963, size: 64, align: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!959, !966}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !956, file: !26, line: 85, baseType: !968, size: 64, align: 64, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !971)
!971 = !{!972, !973, !974, !976, !977, !994, !995, !996, !997}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !970, file: !4, line: 247, baseType: !959, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !970, file: !4, line: 253, baseType: !959, size: 64, align: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !970, file: !4, line: 259, baseType: !975, size: 32, align: 32, offset: 128)
!975 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !970, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !970, file: !4, line: 271, baseType: !978, size: 64, align: 64, offset: 192)
!978 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !970, file: !4, line: 265, size: 64, align: 64, elements: !979)
!979 = !{!980, !984, !986, !987}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !978, file: !4, line: 266, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !982, line: 40, baseType: !983)
!982 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!983 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !978, file: !4, line: 267, baseType: !985, size: 64, align: 64)
!985 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !978, file: !4, line: 268, baseType: !959, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !978, file: !4, line: 270, baseType: !988, size: 64, align: 32)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !989, line: 61, baseType: !990)
!989 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !989, line: 58, size: 64, align: 32, elements: !991)
!991 = !{!992, !993}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !990, file: !989, line: 59, baseType: !975, size: 32, align: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !990, file: !989, line: 60, baseType: !975, size: 32, align: 32, offset: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !970, file: !4, line: 272, baseType: !985, size: 64, align: 64, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !970, file: !4, line: 273, baseType: !985, size: 64, align: 64, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !970, file: !4, line: 275, baseType: !975, size: 32, align: 32, offset: 384)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !970, file: !4, line: 300, baseType: !959, size: 64, align: 64, offset: 448)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !956, file: !26, line: 93, baseType: !975, size: 32, align: 32, offset: 192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !956, file: !26, line: 99, baseType: !975, size: 32, align: 32, offset: 224)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !956, file: !26, line: 108, baseType: !975, size: 32, align: 32, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !956, file: !26, line: 113, baseType: !1002, size: 64, align: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!966, !966, !966}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !956, file: !26, line: 123, baseType: !1006, size: 64, align: 64, offset: 384)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!1009, !1009}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !956, file: !26, line: 130, baseType: !1012, size: 32, align: 32, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !956, file: !26, line: 136, baseType: !1014, size: 64, align: 64, offset: 512)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!1012, !966}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !956, file: !26, line: 142, baseType: !1018, size: 64, align: 64, offset: 576)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!975, !1021, !966, !959, !975}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1024)
!1024 = !{!1025, !1037, !1038}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1023, file: !4, line: 360, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034, !1035, !1036}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1029, file: !4, line: 307, baseType: !959, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1029, file: !4, line: 313, baseType: !985, size: 64, align: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1029, file: !4, line: 313, baseType: !985, size: 64, align: 64, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1029, file: !4, line: 318, baseType: !985, size: 64, align: 64, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1029, file: !4, line: 318, baseType: !985, size: 64, align: 64, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1029, file: !4, line: 323, baseType: !975, size: 32, align: 32, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1023, file: !4, line: 364, baseType: !975, size: 32, align: 32, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1023, file: !4, line: 368, baseType: !975, size: 32, align: 32, offset: 96)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1042)
!1042 = !{!1043, !1050, !1052, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1092, !1094, !1095, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1128, !1129, !1130, !1131, !1132, !1133, !1136, !1137, !1138, !1139}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1041, file: !548, line: 282, baseType: !1044, size: 512, align: 64)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1045, size: 512, align: 64, elements: !1048)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !982, line: 48, baseType: !1047)
!1047 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1048 = !{!1049}
!1049 = !DISubrange(count: 8)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1041, file: !548, line: 299, baseType: !1051, size: 256, align: 32, offset: 512)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 256, align: 32, elements: !1048)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1041, file: !548, line: 315, baseType: !1053, size: 64, align: 64, offset: 768)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1041, file: !548, line: 326, baseType: !975, size: 32, align: 32, offset: 832)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1041, file: !548, line: 326, baseType: !975, size: 32, align: 32, offset: 864)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1041, file: !548, line: 334, baseType: !975, size: 32, align: 32, offset: 896)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1041, file: !548, line: 341, baseType: !975, size: 32, align: 32, offset: 928)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1041, file: !548, line: 346, baseType: !975, size: 32, align: 32, offset: 960)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1041, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1041, file: !548, line: 356, baseType: !988, size: 64, align: 32, offset: 1024)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1041, file: !548, line: 361, baseType: !981, size: 64, align: 64, offset: 1088)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1041, file: !548, line: 369, baseType: !981, size: 64, align: 64, offset: 1152)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1041, file: !548, line: 377, baseType: !981, size: 64, align: 64, offset: 1216)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1041, file: !548, line: 382, baseType: !975, size: 32, align: 32, offset: 1280)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1041, file: !548, line: 386, baseType: !975, size: 32, align: 32, offset: 1312)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1041, file: !548, line: 391, baseType: !975, size: 32, align: 32, offset: 1344)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1041, file: !548, line: 396, baseType: !966, size: 64, align: 64, offset: 1408)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1041, file: !548, line: 403, baseType: !1069, size: 512, align: 64, offset: 1472)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 512, align: 64, elements: !1048)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !982, line: 55, baseType: !1071)
!1071 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1041, file: !548, line: 410, baseType: !975, size: 32, align: 32, offset: 1984)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1041, file: !548, line: 415, baseType: !975, size: 32, align: 32, offset: 2016)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1041, file: !548, line: 420, baseType: !975, size: 32, align: 32, offset: 2048)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1041, file: !548, line: 425, baseType: !975, size: 32, align: 32, offset: 2080)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1041, file: !548, line: 435, baseType: !981, size: 64, align: 64, offset: 2112)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1041, file: !548, line: 440, baseType: !975, size: 32, align: 32, offset: 2176)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1041, file: !548, line: 445, baseType: !1070, size: 64, align: 64, offset: 2240)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1041, file: !548, line: 459, baseType: !1080, size: 512, align: 64, offset: 2304)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1081, size: 512, align: 64, elements: !1048)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1083, line: 94, baseType: !1084)
!1083 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1083, line: 81, size: 192, align: 64, elements: !1085)
!1085 = !{!1086, !1090, !1091}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1084, file: !1083, line: 82, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1083, line: 73, baseType: !1089)
!1089 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1083, line: 73, flags: DIFlagFwdDecl)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1084, file: !1083, line: 89, baseType: !1045, size: 64, align: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1084, file: !1083, line: 93, baseType: !975, size: 32, align: 32, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1041, file: !548, line: 473, baseType: !1093, size: 64, align: 64, offset: 2816)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1041, file: !548, line: 477, baseType: !975, size: 32, align: 32, offset: 2880)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1041, file: !548, line: 479, baseType: !1096, size: 64, align: 64, offset: 2944)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1104, !1109}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1099, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1099, file: !548, line: 203, baseType: !1045, size: 64, align: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1099, file: !548, line: 204, baseType: !975, size: 32, align: 32, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1099, file: !548, line: 205, baseType: !1105, size: 64, align: 64, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1107, line: 86, baseType: !1108)
!1107 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1108 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1107, line: 86, flags: DIFlagFwdDecl)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1099, file: !548, line: 206, baseType: !1081, size: 64, align: 64, offset: 256)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1041, file: !548, line: 480, baseType: !975, size: 32, align: 32, offset: 3008)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1041, file: !548, line: 505, baseType: !975, size: 32, align: 32, offset: 3040)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1041, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1041, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1041, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1041, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1041, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1041, file: !548, line: 532, baseType: !981, size: 64, align: 64, offset: 3264)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1041, file: !548, line: 539, baseType: !981, size: 64, align: 64, offset: 3328)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1041, file: !548, line: 547, baseType: !981, size: 64, align: 64, offset: 3392)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1041, file: !548, line: 554, baseType: !1105, size: 64, align: 64, offset: 3456)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1041, file: !548, line: 563, baseType: !975, size: 32, align: 32, offset: 3520)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1041, file: !548, line: 572, baseType: !975, size: 32, align: 32, offset: 3552)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1041, file: !548, line: 581, baseType: !975, size: 32, align: 32, offset: 3584)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1041, file: !548, line: 588, baseType: !1125, size: 64, align: 64, offset: 3648)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !982, line: 36, baseType: !1127)
!1127 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1041, file: !548, line: 593, baseType: !975, size: 32, align: 32, offset: 3712)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1041, file: !548, line: 596, baseType: !975, size: 32, align: 32, offset: 3744)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1041, file: !548, line: 599, baseType: !1081, size: 64, align: 64, offset: 3776)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1041, file: !548, line: 605, baseType: !1081, size: 64, align: 64, offset: 3840)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1041, file: !548, line: 616, baseType: !1081, size: 64, align: 64, offset: 3904)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1041, file: !548, line: 626, baseType: !1134, size: 64, align: 64, offset: 3968)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1135, line: 216, baseType: !1071)
!1135 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1041, file: !548, line: 627, baseType: !1134, size: 64, align: 64, offset: 4032)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1041, file: !548, line: 628, baseType: !1134, size: 64, align: 64, offset: 4096)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1041, file: !548, line: 629, baseType: !1134, size: 64, align: 64, offset: 4160)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1041, file: !548, line: 645, baseType: !1081, size: 64, align: 64, offset: 4224)
!1140 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1141 = !{!1142}
!1142 = distinct !DIGlobalVariable(name: "warned", scope: !1143, file: !1144, line: 596, type: !975, isLocal: true, isDefinition: true, variable: i32* @compute_muxer_pkt_fields.warned)
!1143 = distinct !DISubprogram(name: "compute_muxer_pkt_fields", scope: !1144, file: !1144, line: 556, type: !1145, isLocal: true, isDefinition: true, scopeLine: 557, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2266)
!1144 = !DIFile(filename: "libavformat/mux.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!975, !1147, !1373, !1196}
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !919, line: 1947, baseType: !1149)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1150)
!1150 = !{!1151, !1152, !1248, !1303, !1304, !1369, !1370, !1371, !2123, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2177, !2178, !2179, !2180, !2181, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2232, !2233, !2236, !2237, !2238, !2239, !2240, !2241, !2243, !2244, !2245, !2246, !2254, !2255, !2259, !2263, !2264, !2265}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1149, file: !919, line: 1342, baseType: !953, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1149, file: !919, line: 1349, baseType: !1153, size: 64, align: 64, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1159, !1160, !1169, !1170, !1171, !1172, !1173, !1174, !1187, !1192, !1219, !1220, !1224, !1229, !1230, !1231, !1235, !1241, !1247}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1154, file: !919, line: 638, baseType: !959, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1154, file: !919, line: 645, baseType: !959, size: 64, align: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1154, file: !919, line: 652, baseType: !975, size: 32, align: 32, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1154, file: !919, line: 659, baseType: !959, size: 64, align: 64, offset: 192)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1154, file: !919, line: 661, baseType: !1161, size: 64, align: 64, offset: 256)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1163)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !948, line: 44, size: 64, align: 32, elements: !1166)
!1166 = !{!1167, !1168}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1165, file: !948, line: 45, baseType: !46, size: 32, align: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1165, file: !948, line: 46, baseType: !1140, size: 32, align: 32, offset: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1154, file: !919, line: 663, baseType: !953, size: 64, align: 64, offset: 320)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1154, file: !919, line: 670, baseType: !959, size: 64, align: 64, offset: 384)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1154, file: !919, line: 679, baseType: !1153, size: 64, align: 64, offset: 448)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1154, file: !919, line: 684, baseType: !975, size: 32, align: 32, offset: 512)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1154, file: !919, line: 689, baseType: !975, size: 32, align: 32, offset: 544)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1154, file: !919, line: 696, baseType: !1175, size: 64, align: 64, offset: 576)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!975, !1178}
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1180)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1181)
!1181 = !{!1182, !1183, !1185, !1186}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1180, file: !919, line: 449, baseType: !959, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1180, file: !919, line: 450, baseType: !1184, size: 64, align: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1180, file: !919, line: 451, baseType: !975, size: 32, align: 32, offset: 128)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1180, file: !919, line: 452, baseType: !959, size: 64, align: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1154, file: !919, line: 703, baseType: !1188, size: 64, align: 64, offset: 640)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{!975, !1191}
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1154, file: !919, line: 714, baseType: !1193, size: 64, align: 64, offset: 704)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!975, !1191, !1196}
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !47, line: 1499, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !47, line: 1445, size: 704, align: 64, elements: !1199)
!1199 = !{!1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1215, !1216, !1217, !1218}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1198, file: !47, line: 1451, baseType: !1081, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1198, file: !47, line: 1461, baseType: !981, size: 64, align: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1198, file: !47, line: 1467, baseType: !981, size: 64, align: 64, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1198, file: !47, line: 1468, baseType: !1045, size: 64, align: 64, offset: 192)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1198, file: !47, line: 1469, baseType: !975, size: 32, align: 32, offset: 256)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1198, file: !47, line: 1470, baseType: !975, size: 32, align: 32, offset: 288)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1198, file: !47, line: 1474, baseType: !975, size: 32, align: 32, offset: 320)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1198, file: !47, line: 1479, baseType: !1208, size: 64, align: 64, offset: 384)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !47, line: 1415, baseType: !1210)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !47, line: 1411, size: 128, align: 64, elements: !1211)
!1211 = !{!1212, !1213, !1214}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1210, file: !47, line: 1412, baseType: !1045, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1210, file: !47, line: 1413, baseType: !975, size: 32, align: 32, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1210, file: !47, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1198, file: !47, line: 1480, baseType: !975, size: 32, align: 32, offset: 448)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1198, file: !47, line: 1486, baseType: !981, size: 64, align: 64, offset: 512)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1198, file: !47, line: 1488, baseType: !981, size: 64, align: 64, offset: 576)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1198, file: !47, line: 1497, baseType: !981, size: 64, align: 64, offset: 640)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1154, file: !919, line: 720, baseType: !1188, size: 64, align: 64, offset: 768)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1154, file: !919, line: 730, baseType: !1221, size: 64, align: 64, offset: 832)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!975, !1191, !975, !981, !975}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1154, file: !919, line: 737, baseType: !1225, size: 64, align: 64, offset: 896)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!981, !1191, !975, !1228, !981}
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1154, file: !919, line: 744, baseType: !1188, size: 64, align: 64, offset: 960)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1154, file: !919, line: 750, baseType: !1188, size: 64, align: 64, offset: 1024)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1154, file: !919, line: 758, baseType: !1232, size: 64, align: 64, offset: 1088)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!975, !1191, !975, !981, !981, !981, !975}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1154, file: !919, line: 764, baseType: !1236, size: 64, align: 64, offset: 1152)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!975, !1191, !1239}
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1154, file: !919, line: 770, baseType: !1242, size: 64, align: 64, offset: 1216)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{!975, !1191, !1245}
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1154, file: !919, line: 776, baseType: !1242, size: 64, align: 64, offset: 1280)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1149, file: !919, line: 1356, baseType: !1249, size: 64, align: 64, offset: 128)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1251)
!1251 = !{!1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1271, !1275, !1279, !1283, !1288, !1289, !1290, !1291, !1292, !1293, !1297}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1250, file: !919, line: 498, baseType: !959, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1250, file: !919, line: 504, baseType: !959, size: 64, align: 64, offset: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1250, file: !919, line: 505, baseType: !959, size: 64, align: 64, offset: 128)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1250, file: !919, line: 506, baseType: !959, size: 64, align: 64, offset: 192)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1250, file: !919, line: 508, baseType: !46, size: 32, align: 32, offset: 256)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1250, file: !919, line: 509, baseType: !46, size: 32, align: 32, offset: 288)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1250, file: !919, line: 510, baseType: !46, size: 32, align: 32, offset: 320)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1250, file: !919, line: 517, baseType: !975, size: 32, align: 32, offset: 352)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1250, file: !919, line: 523, baseType: !1161, size: 64, align: 64, offset: 384)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1250, file: !919, line: 526, baseType: !953, size: 64, align: 64, offset: 448)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1250, file: !919, line: 535, baseType: !1249, size: 64, align: 64, offset: 512)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1250, file: !919, line: 539, baseType: !975, size: 32, align: 32, offset: 576)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1250, file: !919, line: 541, baseType: !1188, size: 64, align: 64, offset: 640)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1250, file: !919, line: 549, baseType: !1193, size: 64, align: 64, offset: 704)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1250, file: !919, line: 550, baseType: !1188, size: 64, align: 64, offset: 768)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1250, file: !919, line: 554, baseType: !1268, size: 64, align: 64, offset: 832)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!975, !1191, !1196, !1196, !975}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1250, file: !919, line: 563, baseType: !1272, size: 64, align: 64, offset: 896)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!975, !46, !975}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1250, file: !919, line: 565, baseType: !1276, size: 64, align: 64, offset: 960)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{null, !1191, !975, !1228, !1228}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1250, file: !919, line: 570, baseType: !1280, size: 64, align: 64, offset: 1024)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!975, !1191, !975, !966, !1134}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1250, file: !919, line: 581, baseType: !1284, size: 64, align: 64, offset: 1088)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!975, !1191, !975, !1287, !1140}
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1250, file: !919, line: 587, baseType: !1236, size: 64, align: 64, offset: 1152)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1250, file: !919, line: 592, baseType: !1242, size: 64, align: 64, offset: 1216)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1250, file: !919, line: 597, baseType: !1242, size: 64, align: 64, offset: 1280)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1250, file: !919, line: 598, baseType: !46, size: 32, align: 32, offset: 1344)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1250, file: !919, line: 608, baseType: !1188, size: 64, align: 64, offset: 1408)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1250, file: !919, line: 617, baseType: !1294, size: 64, align: 64, offset: 1472)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{null, !1191}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1250, file: !919, line: 623, baseType: !1298, size: 64, align: 64, offset: 1536)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!975, !1191, !1301}
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1197)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1149, file: !919, line: 1365, baseType: !966, size: 64, align: 64, offset: 192)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1149, file: !919, line: 1379, baseType: !1305, size: 64, align: 64, offset: 256)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1307)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1308)
!1308 = !{!1309, !1310, !1311, !1312, !1313, !1314, !1315, !1319, !1320, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1336, !1337, !1341, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1359, !1360, !1361, !1362, !1366, !1367, !1368}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1307, file: !650, line: 174, baseType: !953, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1307, file: !650, line: 226, baseType: !1184, size: 64, align: 64, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1307, file: !650, line: 227, baseType: !975, size: 32, align: 32, offset: 128)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1307, file: !650, line: 228, baseType: !1184, size: 64, align: 64, offset: 192)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1307, file: !650, line: 229, baseType: !1184, size: 64, align: 64, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1307, file: !650, line: 233, baseType: !966, size: 64, align: 64, offset: 320)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1307, file: !650, line: 235, baseType: !1316, size: 64, align: 64, offset: 384)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{!975, !966, !1045, !975}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1307, file: !650, line: 236, baseType: !1316, size: 64, align: 64, offset: 448)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1307, file: !650, line: 237, baseType: !1321, size: 64, align: 64, offset: 512)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DISubroutineType(types: !1323)
!1323 = !{!981, !966, !981, !975}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1307, file: !650, line: 238, baseType: !981, size: 64, align: 64, offset: 576)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1307, file: !650, line: 239, baseType: !975, size: 32, align: 32, offset: 640)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1307, file: !650, line: 240, baseType: !975, size: 32, align: 32, offset: 672)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1307, file: !650, line: 241, baseType: !975, size: 32, align: 32, offset: 704)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1307, file: !650, line: 242, baseType: !1071, size: 64, align: 64, offset: 768)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1307, file: !650, line: 243, baseType: !1184, size: 64, align: 64, offset: 832)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1307, file: !650, line: 244, baseType: !1331, size: 64, align: 64, offset: 896)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!1071, !1071, !1334, !1140}
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1307, file: !650, line: 245, baseType: !975, size: 32, align: 32, offset: 960)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1307, file: !650, line: 249, baseType: !1338, size: 64, align: 64, offset: 1024)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!975, !966, !975}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1307, file: !650, line: 255, baseType: !1342, size: 64, align: 64, offset: 1088)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!981, !966, !975, !981, !975}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1307, file: !650, line: 260, baseType: !975, size: 32, align: 32, offset: 1152)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1307, file: !650, line: 266, baseType: !981, size: 64, align: 64, offset: 1216)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1307, file: !650, line: 273, baseType: !975, size: 32, align: 32, offset: 1280)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1307, file: !650, line: 279, baseType: !981, size: 64, align: 64, offset: 1344)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1307, file: !650, line: 285, baseType: !975, size: 32, align: 32, offset: 1408)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1307, file: !650, line: 291, baseType: !975, size: 32, align: 32, offset: 1440)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1307, file: !650, line: 298, baseType: !975, size: 32, align: 32, offset: 1472)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1307, file: !650, line: 304, baseType: !975, size: 32, align: 32, offset: 1504)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1307, file: !650, line: 309, baseType: !959, size: 64, align: 64, offset: 1536)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1307, file: !650, line: 314, baseType: !959, size: 64, align: 64, offset: 1600)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1307, file: !650, line: 319, baseType: !1356, size: 64, align: 64, offset: 1664)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!975, !966, !1045, !975, !649, !981}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1307, file: !650, line: 326, baseType: !975, size: 32, align: 32, offset: 1728)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1307, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1307, file: !650, line: 332, baseType: !981, size: 64, align: 64, offset: 1792)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1307, file: !650, line: 338, baseType: !1363, size: 64, align: 64, offset: 1856)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DISubroutineType(types: !1365)
!1365 = !{!975, !966}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1307, file: !650, line: 340, baseType: !981, size: 64, align: 64, offset: 1920)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1307, file: !650, line: 346, baseType: !1184, size: 64, align: 64, offset: 1984)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1307, file: !650, line: 351, baseType: !975, size: 32, align: 32, offset: 2048)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1149, file: !919, line: 1386, baseType: !975, size: 32, align: 32, offset: 320)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1149, file: !919, line: 1393, baseType: !1140, size: 32, align: 32, offset: 352)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1149, file: !919, line: 1405, baseType: !1372, size: 64, align: 64, offset: 384)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1375)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1376)
!1376 = !{!1377, !1378, !1379, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !2048, !2054, !2055, !2059, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2091, !2092, !2093, !2094, !2095, !2096}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1375, file: !919, line: 866, baseType: !975, size: 32, align: 32)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1375, file: !919, line: 872, baseType: !975, size: 32, align: 32, offset: 32)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1375, file: !919, line: 878, baseType: !1380, size: 64, align: 64, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !47, line: 3360, baseType: !1382)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !47, line: 1556, size: 8448, align: 64, elements: !1383)
!1383 = !{!1384, !1385, !1386, !1387, !1529, !1530, !1531, !1532, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1685, !1689, !1690, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1869, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1382, file: !47, line: 1561, baseType: !953, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1382, file: !47, line: 1562, baseType: !975, size: 32, align: 32, offset: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1382, file: !47, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1382, file: !47, line: 1565, baseType: !1388, size: 64, align: 64, offset: 128)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1390)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !47, line: 3468, size: 1984, align: 64, elements: !1391)
!1391 = !{!1392, !1393, !1394, !1395, !1396, !1397, !1400, !1403, !1406, !1409, !1412, !1413, !1414, !1422, !1423, !1424, !1426, !1430, !1436, !1445, !1449, !1450, !1494, !1501, !1505, !1506, !1510, !1514, !1518, !1522, !1523, !1524}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1390, file: !47, line: 3475, baseType: !959, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1390, file: !47, line: 3480, baseType: !959, size: 64, align: 64, offset: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1390, file: !47, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1390, file: !47, line: 3482, baseType: !46, size: 32, align: 32, offset: 160)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1390, file: !47, line: 3487, baseType: !975, size: 32, align: 32, offset: 192)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1390, file: !47, line: 3488, baseType: !1398, size: 64, align: 64, offset: 256)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1390, file: !47, line: 3489, baseType: !1401, size: 64, align: 64, offset: 320)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1390, file: !47, line: 3490, baseType: !1404, size: 64, align: 64, offset: 384)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1390, file: !47, line: 3491, baseType: !1407, size: 64, align: 64, offset: 448)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1390, file: !47, line: 3492, baseType: !1410, size: 64, align: 64, offset: 512)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1070)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1390, file: !47, line: 3493, baseType: !1046, size: 8, align: 8, offset: 576)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1390, file: !47, line: 3494, baseType: !953, size: 64, align: 64, offset: 640)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1390, file: !47, line: 3495, baseType: !1415, size: 64, align: 64, offset: 704)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1417)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !47, line: 3404, baseType: !1418)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !47, line: 3401, size: 128, align: 64, elements: !1419)
!1419 = !{!1420, !1421}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1418, file: !47, line: 3402, baseType: !975, size: 32, align: 32)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1418, file: !47, line: 3403, baseType: !959, size: 64, align: 64, offset: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1390, file: !47, line: 3507, baseType: !959, size: 64, align: 64, offset: 768)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1390, file: !47, line: 3516, baseType: !975, size: 32, align: 32, offset: 832)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1390, file: !47, line: 3517, baseType: !1425, size: 64, align: 64, offset: 896)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1390, file: !47, line: 3527, baseType: !1427, size: 64, align: 64, offset: 960)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!975, !1380}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1390, file: !47, line: 3535, baseType: !1431, size: 64, align: 64, offset: 1024)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{!975, !1380, !1434}
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1381)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1390, file: !47, line: 3541, baseType: !1437, size: 64, align: 64, offset: 1088)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1439)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !47, line: 3461, baseType: !1440)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1441, line: 223, size: 128, align: 64, elements: !1442)
!1441 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1442 = !{!1443, !1444}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1440, file: !1441, line: 224, baseType: !1334, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1440, file: !1441, line: 225, baseType: !1334, size: 64, align: 64, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1390, file: !47, line: 3549, baseType: !1446, size: 64, align: 64, offset: 1152)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DISubroutineType(types: !1448)
!1448 = !{null, !1425}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1390, file: !47, line: 3551, baseType: !1427, size: 64, align: 64, offset: 1216)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1390, file: !47, line: 3552, baseType: !1451, size: 64, align: 64, offset: 1280)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DISubroutineType(types: !1453)
!1453 = !{!975, !1380, !1045, !975, !1454}
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1456)
!1456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !47, line: 3920, size: 256, align: 64, elements: !1457)
!1457 = !{!1458, !1461, !1463, !1464, !1465, !1493}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1456, file: !47, line: 3921, baseType: !1459, size: 16, align: 16)
!1459 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !982, line: 49, baseType: !1460)
!1460 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1456, file: !47, line: 3922, baseType: !1462, size: 32, align: 32, offset: 32)
!1462 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !982, line: 51, baseType: !1140)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1456, file: !47, line: 3923, baseType: !1462, size: 32, align: 32, offset: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1456, file: !47, line: 3924, baseType: !1140, size: 32, align: 32, offset: 96)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1456, file: !47, line: 3925, baseType: !1466, size: 64, align: 64, offset: 128)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !47, line: 3918, baseType: !1469)
!1469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !47, line: 3885, size: 1600, align: 64, elements: !1470)
!1470 = !{!1471, !1472, !1473, !1474, !1475, !1476, !1482, !1486, !1488, !1489, !1491, !1492}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1469, file: !47, line: 3886, baseType: !975, size: 32, align: 32)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1469, file: !47, line: 3887, baseType: !975, size: 32, align: 32, offset: 32)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1469, file: !47, line: 3888, baseType: !975, size: 32, align: 32, offset: 64)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1469, file: !47, line: 3889, baseType: !975, size: 32, align: 32, offset: 96)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1469, file: !47, line: 3890, baseType: !975, size: 32, align: 32, offset: 128)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1469, file: !47, line: 3897, baseType: !1477, size: 768, align: 64, offset: 192)
!1477 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !47, line: 3858, baseType: !1478)
!1478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !47, line: 3853, size: 768, align: 64, elements: !1479)
!1479 = !{!1480, !1481}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1478, file: !47, line: 3855, baseType: !1044, size: 512, align: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1478, file: !47, line: 3857, baseType: !1051, size: 256, align: 32, offset: 512)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1469, file: !47, line: 3903, baseType: !1483, size: 256, align: 64, offset: 960)
!1483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1045, size: 256, align: 64, elements: !1484)
!1484 = !{!1485}
!1485 = !DISubrange(count: 4)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1469, file: !47, line: 3904, baseType: !1487, size: 128, align: 32, offset: 1216)
!1487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 128, align: 32, elements: !1484)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1469, file: !47, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1469, file: !47, line: 3908, baseType: !1490, size: 64, align: 64, offset: 1408)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1469, file: !47, line: 3915, baseType: !1490, size: 64, align: 64, offset: 1472)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1469, file: !47, line: 3917, baseType: !975, size: 32, align: 32, offset: 1536)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1456, file: !47, line: 3926, baseType: !981, size: 64, align: 64, offset: 192)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1390, file: !47, line: 3564, baseType: !1495, size: 64, align: 64, offset: 1344)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!975, !1380, !1196, !1498, !1500}
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1390, file: !47, line: 3566, baseType: !1502, size: 64, align: 64, offset: 1408)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{!975, !1380, !966, !1500, !1196}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1390, file: !47, line: 3567, baseType: !1427, size: 64, align: 64, offset: 1472)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1390, file: !47, line: 3576, baseType: !1507, size: 64, align: 64, offset: 1536)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{!975, !1380, !1498}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1390, file: !47, line: 3577, baseType: !1511, size: 64, align: 64, offset: 1600)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{!975, !1380, !1196}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1390, file: !47, line: 3584, baseType: !1515, size: 64, align: 64, offset: 1664)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DISubroutineType(types: !1517)
!1517 = !{!975, !1380, !1039}
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1390, file: !47, line: 3589, baseType: !1519, size: 64, align: 64, offset: 1728)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DISubroutineType(types: !1521)
!1521 = !{null, !1380}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1390, file: !47, line: 3594, baseType: !975, size: 32, align: 32, offset: 1792)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1390, file: !47, line: 3600, baseType: !959, size: 64, align: 64, offset: 1856)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1390, file: !47, line: 3609, baseType: !1525, size: 64, align: 64, offset: 1920)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1528)
!1528 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !47, line: 3609, flags: DIFlagFwdDecl)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1382, file: !47, line: 1566, baseType: !46, size: 32, align: 32, offset: 192)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1382, file: !47, line: 1581, baseType: !1140, size: 32, align: 32, offset: 224)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1382, file: !47, line: 1583, baseType: !966, size: 64, align: 64, offset: 256)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1382, file: !47, line: 1591, baseType: !1533, size: 64, align: 64, offset: 320)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1441, line: 129, size: 1664, align: 64, elements: !1535)
!1535 = !{!1536, !1537, !1538, !1539, !1540, !1558, !1559, !1565, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1534, file: !1441, line: 136, baseType: !975, size: 32, align: 32)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1534, file: !1441, line: 151, baseType: !975, size: 32, align: 32, offset: 32)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1534, file: !1441, line: 157, baseType: !975, size: 32, align: 32, offset: 64)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1534, file: !1441, line: 159, baseType: !1039, size: 64, align: 64, offset: 128)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1534, file: !1441, line: 161, baseType: !1541, size: 64, align: 64, offset: 192)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1441, line: 117, baseType: !1543)
!1543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1441, line: 100, size: 832, align: 64, elements: !1544)
!1544 = !{!1545, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1543, file: !1441, line: 105, baseType: !1546, size: 256, align: 64)
!1546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1547, size: 256, align: 64, elements: !1484)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1083, line: 238, baseType: !1549)
!1549 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1083, line: 238, flags: DIFlagFwdDecl)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1543, file: !1441, line: 110, baseType: !975, size: 32, align: 32, offset: 256)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1543, file: !1441, line: 111, baseType: !975, size: 32, align: 32, offset: 288)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1543, file: !1441, line: 111, baseType: !975, size: 32, align: 32, offset: 320)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1543, file: !1441, line: 112, baseType: !1051, size: 256, align: 32, offset: 352)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1543, file: !1441, line: 113, baseType: !1487, size: 128, align: 32, offset: 608)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1543, file: !1441, line: 114, baseType: !975, size: 32, align: 32, offset: 736)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1543, file: !1441, line: 115, baseType: !975, size: 32, align: 32, offset: 768)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1543, file: !1441, line: 116, baseType: !975, size: 32, align: 32, offset: 800)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1534, file: !1441, line: 163, baseType: !966, size: 64, align: 64, offset: 256)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1534, file: !1441, line: 165, baseType: !1560, size: 128, align: 64, offset: 320)
!1560 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1441, line: 122, baseType: !1561)
!1561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1441, line: 119, size: 128, align: 64, elements: !1562)
!1562 = !{!1563, !1564}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1561, file: !1441, line: 120, baseType: !1196, size: 64, align: 64)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1561, file: !1441, line: 121, baseType: !1039, size: 64, align: 64, offset: 64)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1534, file: !1441, line: 166, baseType: !1566, size: 128, align: 64, offset: 448)
!1566 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1441, line: 127, baseType: !1567)
!1567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1441, line: 124, size: 128, align: 64, elements: !1568)
!1568 = !{!1569, !1642}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1567, file: !1441, line: 125, baseType: !1570, size: 64, align: 64)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !47, line: 5794, baseType: !1573)
!1573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !47, line: 5747, size: 512, align: 64, elements: !1574)
!1574 = !{!1575, !1576, !1600, !1604, !1605, !1639, !1640, !1641}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1573, file: !47, line: 5751, baseType: !953, size: 64, align: 64)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1573, file: !47, line: 5756, baseType: !1577, size: 64, align: 64, offset: 64)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1579)
!1579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !47, line: 5796, size: 512, align: 64, elements: !1580)
!1580 = !{!1581, !1582, !1585, !1586, !1587, !1591, !1595, !1599}
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1579, file: !47, line: 5797, baseType: !959, size: 64, align: 64)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1579, file: !47, line: 5804, baseType: !1583, size: 64, align: 64, offset: 64)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1579, file: !47, line: 5815, baseType: !953, size: 64, align: 64, offset: 128)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1579, file: !47, line: 5825, baseType: !975, size: 32, align: 32, offset: 192)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1579, file: !47, line: 5826, baseType: !1588, size: 64, align: 64, offset: 256)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DISubroutineType(types: !1590)
!1590 = !{!975, !1571}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1579, file: !47, line: 5827, baseType: !1592, size: 64, align: 64, offset: 320)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DISubroutineType(types: !1594)
!1594 = !{!975, !1571, !1196}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1579, file: !47, line: 5828, baseType: !1596, size: 64, align: 64, offset: 384)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{null, !1571}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1579, file: !47, line: 5829, baseType: !1596, size: 64, align: 64, offset: 448)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1573, file: !47, line: 5762, baseType: !1601, size: 64, align: 64, offset: 128)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !47, line: 5735, baseType: !1603)
!1603 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !47, line: 5735, flags: DIFlagFwdDecl)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1573, file: !47, line: 5768, baseType: !966, size: 64, align: 64, offset: 192)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1573, file: !47, line: 5775, baseType: !1606, size: 64, align: 64, offset: 256)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !47, line: 4085, baseType: !1608)
!1608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !47, line: 3936, size: 1152, align: 64, elements: !1609)
!1609 = !{!1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1608, file: !47, line: 3940, baseType: !658, size: 32, align: 32)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1608, file: !47, line: 3944, baseType: !46, size: 32, align: 32, offset: 32)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1608, file: !47, line: 3948, baseType: !1462, size: 32, align: 32, offset: 64)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1608, file: !47, line: 3958, baseType: !1045, size: 64, align: 64, offset: 128)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1608, file: !47, line: 3962, baseType: !975, size: 32, align: 32, offset: 192)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1608, file: !47, line: 3968, baseType: !975, size: 32, align: 32, offset: 224)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1608, file: !47, line: 3973, baseType: !981, size: 64, align: 64, offset: 256)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1608, file: !47, line: 3986, baseType: !975, size: 32, align: 32, offset: 320)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1608, file: !47, line: 3999, baseType: !975, size: 32, align: 32, offset: 352)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1608, file: !47, line: 4004, baseType: !975, size: 32, align: 32, offset: 384)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1608, file: !47, line: 4005, baseType: !975, size: 32, align: 32, offset: 416)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1608, file: !47, line: 4010, baseType: !975, size: 32, align: 32, offset: 448)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1608, file: !47, line: 4011, baseType: !975, size: 32, align: 32, offset: 480)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1608, file: !47, line: 4020, baseType: !988, size: 64, align: 32, offset: 512)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1608, file: !47, line: 4025, baseType: !889, size: 32, align: 32, offset: 576)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1608, file: !47, line: 4030, baseType: !571, size: 32, align: 32, offset: 608)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1608, file: !47, line: 4031, baseType: !578, size: 32, align: 32, offset: 640)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1608, file: !47, line: 4032, baseType: !596, size: 32, align: 32, offset: 672)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1608, file: !47, line: 4033, baseType: !620, size: 32, align: 32, offset: 704)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1608, file: !47, line: 4034, baseType: !639, size: 32, align: 32, offset: 736)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1608, file: !47, line: 4039, baseType: !975, size: 32, align: 32, offset: 768)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1608, file: !47, line: 4046, baseType: !1070, size: 64, align: 64, offset: 832)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1608, file: !47, line: 4050, baseType: !975, size: 32, align: 32, offset: 896)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1608, file: !47, line: 4054, baseType: !975, size: 32, align: 32, offset: 928)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1608, file: !47, line: 4061, baseType: !975, size: 32, align: 32, offset: 960)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1608, file: !47, line: 4065, baseType: !975, size: 32, align: 32, offset: 992)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1608, file: !47, line: 4073, baseType: !975, size: 32, align: 32, offset: 1024)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1608, file: !47, line: 4080, baseType: !975, size: 32, align: 32, offset: 1056)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1608, file: !47, line: 4084, baseType: !975, size: 32, align: 32, offset: 1088)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1573, file: !47, line: 5781, baseType: !1606, size: 64, align: 64, offset: 320)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1573, file: !47, line: 5787, baseType: !988, size: 64, align: 32, offset: 384)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1573, file: !47, line: 5793, baseType: !988, size: 64, align: 32, offset: 448)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1567, file: !1441, line: 126, baseType: !975, size: 32, align: 32, offset: 64)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1534, file: !1441, line: 172, baseType: !1196, size: 64, align: 64, offset: 576)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1534, file: !1441, line: 177, baseType: !1045, size: 64, align: 64, offset: 640)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1534, file: !1441, line: 178, baseType: !1140, size: 32, align: 32, offset: 704)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1534, file: !1441, line: 180, baseType: !966, size: 64, align: 64, offset: 768)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1534, file: !1441, line: 185, baseType: !975, size: 32, align: 32, offset: 832)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1534, file: !1441, line: 190, baseType: !966, size: 64, align: 64, offset: 896)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1534, file: !1441, line: 195, baseType: !975, size: 32, align: 32, offset: 960)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1534, file: !1441, line: 200, baseType: !1196, size: 64, align: 64, offset: 1024)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1534, file: !1441, line: 201, baseType: !975, size: 32, align: 32, offset: 1088)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1534, file: !1441, line: 202, baseType: !1039, size: 64, align: 64, offset: 1152)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1534, file: !1441, line: 203, baseType: !975, size: 32, align: 32, offset: 1216)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1534, file: !1441, line: 205, baseType: !975, size: 32, align: 32, offset: 1248)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1534, file: !1441, line: 206, baseType: !975, size: 32, align: 32, offset: 1280)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1534, file: !1441, line: 209, baseType: !1134, size: 64, align: 64, offset: 1344)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1534, file: !1441, line: 212, baseType: !1134, size: 64, align: 64, offset: 1408)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1534, file: !1441, line: 213, baseType: !1039, size: 64, align: 64, offset: 1472)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1534, file: !1441, line: 215, baseType: !975, size: 32, align: 32, offset: 1536)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1534, file: !1441, line: 217, baseType: !975, size: 32, align: 32, offset: 1568)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1534, file: !1441, line: 220, baseType: !975, size: 32, align: 32, offset: 1600)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1382, file: !47, line: 1598, baseType: !966, size: 64, align: 64, offset: 384)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1382, file: !47, line: 1606, baseType: !981, size: 64, align: 64, offset: 448)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1382, file: !47, line: 1614, baseType: !975, size: 32, align: 32, offset: 512)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1382, file: !47, line: 1622, baseType: !975, size: 32, align: 32, offset: 544)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1382, file: !47, line: 1628, baseType: !975, size: 32, align: 32, offset: 576)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1382, file: !47, line: 1636, baseType: !975, size: 32, align: 32, offset: 608)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1382, file: !47, line: 1643, baseType: !975, size: 32, align: 32, offset: 640)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1382, file: !47, line: 1657, baseType: !1045, size: 64, align: 64, offset: 704)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1382, file: !47, line: 1658, baseType: !975, size: 32, align: 32, offset: 768)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1382, file: !47, line: 1679, baseType: !988, size: 64, align: 32, offset: 800)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1382, file: !47, line: 1688, baseType: !975, size: 32, align: 32, offset: 864)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1382, file: !47, line: 1712, baseType: !975, size: 32, align: 32, offset: 896)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1382, file: !47, line: 1729, baseType: !975, size: 32, align: 32, offset: 928)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1382, file: !47, line: 1729, baseType: !975, size: 32, align: 32, offset: 960)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1382, file: !47, line: 1744, baseType: !975, size: 32, align: 32, offset: 992)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1382, file: !47, line: 1744, baseType: !975, size: 32, align: 32, offset: 1024)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1382, file: !47, line: 1751, baseType: !975, size: 32, align: 32, offset: 1056)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1382, file: !47, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1382, file: !47, line: 1791, baseType: !1681, size: 64, align: 64, offset: 1152)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{null, !1684, !1498, !1500, !975, !975, !975}
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1382, file: !47, line: 1808, baseType: !1686, size: 64, align: 64, offset: 1216)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64, align: 64)
!1687 = !DISubroutineType(types: !1688)
!1688 = !{!667, !1684, !1401}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1382, file: !47, line: 1816, baseType: !975, size: 32, align: 32, offset: 1280)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1382, file: !47, line: 1825, baseType: !1691, size: 32, align: 32, offset: 1312)
!1691 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1382, file: !47, line: 1830, baseType: !975, size: 32, align: 32, offset: 1344)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1382, file: !47, line: 1838, baseType: !1691, size: 32, align: 32, offset: 1376)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1382, file: !47, line: 1846, baseType: !975, size: 32, align: 32, offset: 1408)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1382, file: !47, line: 1851, baseType: !975, size: 32, align: 32, offset: 1440)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1382, file: !47, line: 1861, baseType: !1691, size: 32, align: 32, offset: 1472)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1382, file: !47, line: 1868, baseType: !1691, size: 32, align: 32, offset: 1504)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1382, file: !47, line: 1875, baseType: !1691, size: 32, align: 32, offset: 1536)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1382, file: !47, line: 1882, baseType: !1691, size: 32, align: 32, offset: 1568)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1382, file: !47, line: 1889, baseType: !1691, size: 32, align: 32, offset: 1600)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1382, file: !47, line: 1896, baseType: !1691, size: 32, align: 32, offset: 1632)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1382, file: !47, line: 1903, baseType: !1691, size: 32, align: 32, offset: 1664)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1382, file: !47, line: 1910, baseType: !975, size: 32, align: 32, offset: 1696)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1382, file: !47, line: 1915, baseType: !975, size: 32, align: 32, offset: 1728)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1382, file: !47, line: 1926, baseType: !1500, size: 64, align: 64, offset: 1792)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1382, file: !47, line: 1935, baseType: !988, size: 64, align: 32, offset: 1856)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1382, file: !47, line: 1942, baseType: !975, size: 32, align: 32, offset: 1920)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1382, file: !47, line: 1948, baseType: !975, size: 32, align: 32, offset: 1952)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1382, file: !47, line: 1954, baseType: !975, size: 32, align: 32, offset: 1984)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1382, file: !47, line: 1960, baseType: !975, size: 32, align: 32, offset: 2016)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1382, file: !47, line: 1984, baseType: !975, size: 32, align: 32, offset: 2048)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1382, file: !47, line: 1991, baseType: !975, size: 32, align: 32, offset: 2080)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1382, file: !47, line: 1996, baseType: !975, size: 32, align: 32, offset: 2112)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1382, file: !47, line: 2004, baseType: !975, size: 32, align: 32, offset: 2144)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1382, file: !47, line: 2011, baseType: !975, size: 32, align: 32, offset: 2176)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1382, file: !47, line: 2018, baseType: !975, size: 32, align: 32, offset: 2208)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1382, file: !47, line: 2027, baseType: !975, size: 32, align: 32, offset: 2240)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1382, file: !47, line: 2034, baseType: !975, size: 32, align: 32, offset: 2272)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1382, file: !47, line: 2044, baseType: !975, size: 32, align: 32, offset: 2304)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1382, file: !47, line: 2054, baseType: !1721, size: 64, align: 64, offset: 2368)
