; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpdec_jpeg.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpdec_jpeg.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RTPDynamicProtocolHandler = type { i8*, i32, i32, i32, i32, i32, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*, i8*)*, void (%struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, %struct.PayloadContext*, %struct.AVStream*, %struct.AVPacket*, i32*, i8*, i32, i16, i32)*, i32 (%struct.PayloadContext*)*, %struct.RTPDynamicProtocolHandler* }

!921 = !DIEnumerator(name: "SOF2", value: 194)
!922 = !DIEnumerator(name: "SOF3", value: 195)
!923 = !DIEnumerator(name: "SOF5", value: 197)
!924 = !DIEnumerator(name: "SOF6", value: 198)
!925 = !DIEnumerator(name: "SOF7", value: 199)
!926 = !DIEnumerator(name: "JPG", value: 200)
!927 = !DIEnumerator(name: "SOF9", value: 201)
!928 = !DIEnumerator(name: "SOF10", value: 202)
!929 = !DIEnumerator(name: "SOF11", value: 203)
!930 = !DIEnumerator(name: "SOF13", value: 205)
!931 = !DIEnumerator(name: "SOF14", value: 206)
!932 = !DIEnumerator(name: "SOF15", value: 207)
!933 = !DIEnumerator(name: "DHT", value: 196)
!934 = !DIEnumerator(name: "DAC", value: 204)
!935 = !DIEnumerator(name: "RST0", value: 208)
!936 = !DIEnumerator(name: "RST1", value: 209)
!937 = !DIEnumerator(name: "RST2", value: 210)
!938 = !DIEnumerator(name: "RST3", value: 211)
!939 = !DIEnumerator(name: "RST4", value: 212)
!940 = !DIEnumerator(name: "RST5", value: 213)
!941 = !DIEnumerator(name: "RST6", value: 214)
!942 = !DIEnumerator(name: "RST7", value: 215)
!943 = !DIEnumerator(name: "SOI", value: 216)
!944 = !DIEnumerator(name: "EOI", value: 217)
!945 = !DIEnumerator(name: "SOS", value: 218)
!946 = !DIEnumerator(name: "DQT", value: 219)
!947 = !DIEnumerator(name: "DNL", value: 220)
!948 = !DIEnumerator(name: "DRI", value: 221)
!949 = !DIEnumerator(name: "DHP", value: 222)
!950 = !DIEnumerator(name: "EXP", value: 223)
!951 = !DIEnumerator(name: "APP0", value: 224)
!952 = !DIEnumerator(name: "APP1", value: 225)
!953 = !DIEnumerator(name: "APP2", value: 226)
!954 = !DIEnumerator(name: "APP3", value: 227)
!955 = !DIEnumerator(name: "APP4", value: 228)
!956 = !DIEnumerator(name: "APP5", value: 229)
!957 = !DIEnumerator(name: "APP6", value: 230)
!958 = !DIEnumerator(name: "APP7", value: 231)
!959 = !DIEnumerator(name: "APP8", value: 232)
!960 = !DIEnumerator(name: "APP9", value: 233)
!961 = !DIEnumerator(name: "APP10", value: 234)
!962 = !DIEnumerator(name: "APP11", value: 235)
!963 = !DIEnumerator(name: "APP12", value: 236)
!964 = !DIEnumerator(name: "APP13", value: 237)
!965 = !DIEnumerator(name: "APP14", value: 238)
!966 = !DIEnumerator(name: "APP15", value: 239)
!967 = !DIEnumerator(name: "JPG0", value: 240)
!968 = !DIEnumerator(name: "JPG1", value: 241)
!969 = !DIEnumerator(name: "JPG2", value: 242)
!970 = !DIEnumerator(name: "JPG3", value: 243)
!971 = !DIEnumerator(name: "JPG4", value: 244)
!972 = !DIEnumerator(name: "JPG5", value: 245)
!973 = !DIEnumerator(name: "JPG6", value: 246)
!974 = !DIEnumerator(name: "SOF48", value: 247)
!975 = !DIEnumerator(name: "LSE", value: 248)
!976 = !DIEnumerator(name: "JPG9", value: 249)
!977 = !DIEnumerator(name: "JPG10", value: 250)
!978 = !DIEnumerator(name: "JPG11", value: 251)
!979 = !DIEnumerator(name: "JPG12", value: 252)
!980 = !DIEnumerator(name: "JPG13", value: 253)
!981 = !DIEnumerator(name: "COM", value: 254)
!982 = !DIEnumerator(name: "TEM", value: 1)
!983 = !{!984, !985, !986, !991, !999, !1000, !1001}
!984 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!985 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !989, line: 48, baseType: !990)
!989 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!990 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !994, line: 222, size: 16, align: 8, elements: !995)
!994 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!995 = !{!996}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !993, file: !994, line: 222, baseType: !997, size: 16, align: 16)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !989, line: 49, baseType: !998)
!998 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!1002 = !{!1003, !2273}
!1003 = distinct !DIGlobalVariable(name: "ff_jpeg_dynamic_handler", scope: !0, file: !1004, line: 382, type: !1005, isLocal: false, isDefinition: true, variable: %struct.RTPDynamicProtocolHandler* @ff_jpeg_dynamic_handler)
!1004 = !DIFile(filename: "libavformat/rtpdec_jpeg.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTPDynamicProtocolHandler", file: !1007, line: 33, baseType: !1008)
!1007 = !DIFile(filename: "libavformat/rtpdec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RTPDynamicProtocolHandler", file: !1007, line: 115, size: 640, align: 64, elements: !1009)
!1009 = !{!1010, !1014, !1015, !1016, !1017, !1018, !1019, !2253, !2257, !2261, !2267, !2271}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "enc_name", scope: !1008, file: !1007, line: 116, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1013 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1008, file: !1007, line: 117, baseType: !3, size: 32, align: 32, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1008, file: !1007, line: 118, baseType: !13, size: 32, align: 32, offset: 96)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "need_parsing", scope: !1008, file: !1007, line: 119, baseType: !473, size: 32, align: 32, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "static_payload_id", scope: !1008, file: !1007, line: 120, baseType: !984, size: 32, align: 32, offset: 160)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1008, file: !1007, line: 123, baseType: !984, size: 32, align: 32, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1008, file: !1007, line: 126, baseType: !1020, size: 64, align: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!984, !1023, !984, !2239}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !474, line: 1947, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !474, line: 1337, size: 11968, align: 64, elements: !1026)
!1026 = !{!1027, !1068, !1174, !1322, !1323, !1386, !1387, !1388, !2116, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2170, !2171, !2172, !2173, !2174, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2205, !2206, !2209, !2210, !2211, !2212, !2213, !2214, !2216, !2217, !2218, !2219, !2227, !2228, !2232, !2236, !2237, !2238}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1025, file: !474, line: 1342, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !483, line: 143, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !483, line: 67, size: 640, align: 64, elements: !1032)
!1032 = !{!1033, !1034, !1038, !1042, !1043, !1044, !1045, !1049, !1055, !1057, !1061}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1031, file: !483, line: 72, baseType: !1011, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1031, file: !483, line: 78, baseType: !1035, size: 64, align: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!1011, !1000}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1031, file: !483, line: 85, baseType: !1039, size: 64, align: 64, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !483, line: 85, flags: DIFlagFwdDecl)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1031, file: !483, line: 93, baseType: !984, size: 32, align: 32, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1031, file: !483, line: 99, baseType: !984, size: 32, align: 32, offset: 224)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1031, file: !483, line: 108, baseType: !984, size: 32, align: 32, offset: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1031, file: !483, line: 113, baseType: !1046, size: 64, align: 64, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!1000, !1000, !1000}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1031, file: !483, line: 123, baseType: !1050, size: 64, align: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!1053, !1053}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1031, file: !483, line: 130, baseType: !1056, size: 32, align: 32, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !483, line: 48, baseType: !482)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1031, file: !483, line: 136, baseType: !1058, size: 64, align: 64, offset: 512)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!1056, !1000}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1031, file: !483, line: 142, baseType: !1062, size: 64, align: 64, offset: 576)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!984, !1065, !1000, !1011, !984}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !483, line: 60, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1025, file: !474, line: 1349, baseType: !1069, size: 64, align: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !474, line: 633, size: 1344, align: 64, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075, !1076, !1082, !1083, !1084, !1085, !1086, !1087, !1100, !1105, !1145, !1146, !1150, !1155, !1156, !1157, !1161, !1167, !1173}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1070, file: !474, line: 638, baseType: !1011, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1070, file: !474, line: 645, baseType: !1011, size: 64, align: 64, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1070, file: !474, line: 652, baseType: !984, size: 32, align: 32, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1070, file: !474, line: 659, baseType: !1011, size: 64, align: 64, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1070, file: !474, line: 661, baseType: !1077, size: 64, align: 64, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1079)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1081 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !474, line: 443, flags: DIFlagFwdDecl)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1070, file: !474, line: 663, baseType: !1028, size: 64, align: 64, offset: 320)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1070, file: !474, line: 670, baseType: !1011, size: 64, align: 64, offset: 384)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1070, file: !474, line: 679, baseType: !1069, size: 64, align: 64, offset: 448)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1070, file: !474, line: 684, baseType: !984, size: 32, align: 32, offset: 512)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1070, file: !474, line: 689, baseType: !984, size: 32, align: 32, offset: 544)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1070, file: !474, line: 696, baseType: !1088, size: 64, align: 64, offset: 576)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!984, !1091}
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !474, line: 453, baseType: !1093)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !474, line: 448, size: 256, align: 64, elements: !1094)
!1094 = !{!1095, !1096, !1098, !1099}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1093, file: !474, line: 449, baseType: !1011, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1093, file: !474, line: 450, baseType: !1097, size: 64, align: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1093, file: !474, line: 451, baseType: !984, size: 32, align: 32, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1093, file: !474, line: 452, baseType: !1011, size: 64, align: 64, offset: 192)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1070, file: !474, line: 703, baseType: !1101, size: 64, align: 64, offset: 640)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!984, !1104}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1070, file: !474, line: 714, baseType: !1106, size: 64, align: 64, offset: 704)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!984, !1104, !1109}
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1112)
!1112 = !{!1113, !1125, !1128, !1129, !1130, !1131, !1132, !1133, !1141, !1142, !1143, !1144}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1111, file: !14, line: 1451, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1116, line: 94, baseType: !1117)
!1116 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1116, line: 81, size: 192, align: 64, elements: !1118)
!1118 = !{!1119, !1123, !1124}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1117, file: !1116, line: 82, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1116, line: 73, baseType: !1122)
!1122 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1116, line: 73, flags: DIFlagFwdDecl)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1117, file: !1116, line: 89, baseType: !1001, size: 64, align: 64, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1117, file: !1116, line: 93, baseType: !984, size: 32, align: 32, offset: 128)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1111, file: !14, line: 1461, baseType: !1126, size: 64, align: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !989, line: 40, baseType: !1127)
!1127 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1111, file: !14, line: 1467, baseType: !1126, size: 64, align: 64, offset: 128)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1111, file: !14, line: 1468, baseType: !1001, size: 64, align: 64, offset: 192)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1111, file: !14, line: 1469, baseType: !984, size: 32, align: 32, offset: 256)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1111, file: !14, line: 1470, baseType: !984, size: 32, align: 32, offset: 288)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1111, file: !14, line: 1474, baseType: !984, size: 32, align: 32, offset: 320)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1111, file: !14, line: 1479, baseType: !1134, size: 64, align: 64, offset: 384)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1136)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1137)
!1137 = !{!1138, !1139, !1140}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1136, file: !14, line: 1412, baseType: !1001, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1136, file: !14, line: 1413, baseType: !984, size: 32, align: 32, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1136, file: !14, line: 1414, baseType: !503, size: 32, align: 32, offset: 96)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1111, file: !14, line: 1480, baseType: !984, size: 32, align: 32, offset: 448)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1111, file: !14, line: 1486, baseType: !1126, size: 64, align: 64, offset: 512)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1111, file: !14, line: 1488, baseType: !1126, size: 64, align: 64, offset: 576)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1111, file: !14, line: 1497, baseType: !1126, size: 64, align: 64, offset: 640)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1070, file: !474, line: 720, baseType: !1101, size: 64, align: 64, offset: 768)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1070, file: !474, line: 730, baseType: !1147, size: 64, align: 64, offset: 832)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!984, !1104, !984, !1126, !984}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1070, file: !474, line: 737, baseType: !1151, size: 64, align: 64, offset: 896)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!1126, !1104, !984, !1154, !1126}
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1070, file: !474, line: 744, baseType: !1101, size: 64, align: 64, offset: 960)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1070, file: !474, line: 750, baseType: !1101, size: 64, align: 64, offset: 1024)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1070, file: !474, line: 758, baseType: !1158, size: 64, align: 64, offset: 1088)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!984, !1104, !984, !1126, !1126, !1126, !984}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1070, file: !474, line: 764, baseType: !1162, size: 64, align: 64, offset: 1152)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!984, !1104, !1165}
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !474, line: 328, flags: DIFlagFwdDecl)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1070, file: !474, line: 770, baseType: !1168, size: 64, align: 64, offset: 1216)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!984, !1104, !1171}
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !474, line: 329, flags: DIFlagFwdDecl)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1070, file: !474, line: 776, baseType: !1168, size: 64, align: 64, offset: 1280)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1025, file: !474, line: 1356, baseType: !1175, size: 64, align: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !474, line: 497, size: 1600, align: 64, elements: !1177)
!1177 = !{!1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1197, !1201, !1205, !1212, !1307, !1308, !1309, !1310, !1311, !1312, !1316}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1176, file: !474, line: 498, baseType: !1011, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1176, file: !474, line: 504, baseType: !1011, size: 64, align: 64, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1176, file: !474, line: 505, baseType: !1011, size: 64, align: 64, offset: 128)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1176, file: !474, line: 506, baseType: !1011, size: 64, align: 64, offset: 192)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1176, file: !474, line: 508, baseType: !13, size: 32, align: 32, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1176, file: !474, line: 509, baseType: !13, size: 32, align: 32, offset: 288)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1176, file: !474, line: 510, baseType: !13, size: 32, align: 32, offset: 320)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1176, file: !474, line: 517, baseType: !984, size: 32, align: 32, offset: 352)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1176, file: !474, line: 523, baseType: !1077, size: 64, align: 64, offset: 384)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1176, file: !474, line: 526, baseType: !1028, size: 64, align: 64, offset: 448)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1176, file: !474, line: 535, baseType: !1175, size: 64, align: 64, offset: 512)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1176, file: !474, line: 539, baseType: !984, size: 32, align: 32, offset: 576)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1176, file: !474, line: 541, baseType: !1101, size: 64, align: 64, offset: 640)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1176, file: !474, line: 549, baseType: !1106, size: 64, align: 64, offset: 704)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1176, file: !474, line: 550, baseType: !1101, size: 64, align: 64, offset: 768)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1176, file: !474, line: 554, baseType: !1194, size: 64, align: 64, offset: 832)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!984, !1104, !1109, !1109, !984}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1176, file: !474, line: 563, baseType: !1198, size: 64, align: 64, offset: 896)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!984, !13, !984}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1176, file: !474, line: 565, baseType: !1202, size: 64, align: 64, offset: 960)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{null, !1104, !984, !1154, !1154}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1176, file: !474, line: 570, baseType: !1206, size: 64, align: 64, offset: 1024)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!984, !1104, !984, !1000, !1209}
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1210, line: 216, baseType: !1211)
!1210 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1211 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1176, file: !474, line: 581, baseType: !1213, size: 64, align: 64, offset: 1088)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{!984, !1104, !984, !1216, !985}
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !544, line: 646, baseType: !1219)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !544, line: 268, size: 4288, align: 64, elements: !1220)
!1220 = !{!1221, !1225, !1227, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1261, !1263, !1264, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1219, file: !544, line: 282, baseType: !1222, size: 512, align: 64)
!1222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1001, size: 512, align: 64, elements: !1223)
!1223 = !{!1224}
!1224 = !DISubrange(count: 8)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1219, file: !544, line: 299, baseType: !1226, size: 256, align: 32, offset: 512)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 256, align: 32, elements: !1223)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1219, file: !544, line: 315, baseType: !1228, size: 64, align: 64, offset: 768)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1219, file: !544, line: 326, baseType: !984, size: 32, align: 32, offset: 832)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1219, file: !544, line: 326, baseType: !984, size: 32, align: 32, offset: 864)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1219, file: !544, line: 334, baseType: !984, size: 32, align: 32, offset: 896)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1219, file: !544, line: 341, baseType: !984, size: 32, align: 32, offset: 928)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1219, file: !544, line: 346, baseType: !984, size: 32, align: 32, offset: 960)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1219, file: !544, line: 351, baseType: !533, size: 32, align: 32, offset: 992)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1219, file: !544, line: 356, baseType: !1236, size: 64, align: 32, offset: 1024)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1237, line: 61, baseType: !1238)
!1237 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1237, line: 58, size: 64, align: 32, elements: !1239)
!1239 = !{!1240, !1241}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1238, file: !1237, line: 59, baseType: !984, size: 32, align: 32)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1238, file: !1237, line: 60, baseType: !984, size: 32, align: 32, offset: 32)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1219, file: !544, line: 361, baseType: !1126, size: 64, align: 64, offset: 1088)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1219, file: !544, line: 369, baseType: !1126, size: 64, align: 64, offset: 1152)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1219, file: !544, line: 377, baseType: !1126, size: 64, align: 64, offset: 1216)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1219, file: !544, line: 382, baseType: !984, size: 32, align: 32, offset: 1280)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1219, file: !544, line: 386, baseType: !984, size: 32, align: 32, offset: 1312)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1219, file: !544, line: 391, baseType: !984, size: 32, align: 32, offset: 1344)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1219, file: !544, line: 396, baseType: !1000, size: 64, align: 64, offset: 1408)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1219, file: !544, line: 403, baseType: !1250, size: 512, align: 64, offset: 1472)
!1250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1251, size: 512, align: 64, elements: !1223)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !989, line: 55, baseType: !1211)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1219, file: !544, line: 410, baseType: !984, size: 32, align: 32, offset: 1984)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1219, file: !544, line: 415, baseType: !984, size: 32, align: 32, offset: 2016)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1219, file: !544, line: 420, baseType: !984, size: 32, align: 32, offset: 2048)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1219, file: !544, line: 425, baseType: !984, size: 32, align: 32, offset: 2080)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1219, file: !544, line: 435, baseType: !1126, size: 64, align: 64, offset: 2112)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1219, file: !544, line: 440, baseType: !984, size: 32, align: 32, offset: 2176)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1219, file: !544, line: 445, baseType: !1251, size: 64, align: 64, offset: 2240)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1219, file: !544, line: 459, baseType: !1260, size: 512, align: 64, offset: 2304)
!1260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1114, size: 512, align: 64, elements: !1223)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1219, file: !544, line: 473, baseType: !1262, size: 64, align: 64, offset: 2816)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1219, file: !544, line: 477, baseType: !984, size: 32, align: 32, offset: 2880)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1219, file: !544, line: 479, baseType: !1265, size: 64, align: 64, offset: 2944)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !544, line: 207, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !544, line: 201, size: 320, align: 64, elements: !1269)
!1269 = !{!1270, !1271, !1272, !1273, !1278}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1268, file: !544, line: 202, baseType: !543, size: 32, align: 32)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1268, file: !544, line: 203, baseType: !1001, size: 64, align: 64, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1268, file: !544, line: 204, baseType: !984, size: 32, align: 32, offset: 128)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1268, file: !544, line: 205, baseType: !1274, size: 64, align: 64, offset: 192)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1276, line: 86, baseType: !1277)
!1276 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1277 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1276, line: 86, flags: DIFlagFwdDecl)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1268, file: !544, line: 206, baseType: !1114, size: 64, align: 64, offset: 256)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1219, file: !544, line: 480, baseType: !984, size: 32, align: 32, offset: 3008)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1219, file: !544, line: 505, baseType: !984, size: 32, align: 32, offset: 3040)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1219, file: !544, line: 512, baseType: !567, size: 32, align: 32, offset: 3072)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1219, file: !544, line: 514, baseType: !574, size: 32, align: 32, offset: 3104)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1219, file: !544, line: 516, baseType: !592, size: 32, align: 32, offset: 3136)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1219, file: !544, line: 523, baseType: !616, size: 32, align: 32, offset: 3168)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1219, file: !544, line: 525, baseType: !635, size: 32, align: 32, offset: 3200)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1219, file: !544, line: 532, baseType: !1126, size: 64, align: 64, offset: 3264)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1219, file: !544, line: 539, baseType: !1126, size: 64, align: 64, offset: 3328)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1219, file: !544, line: 547, baseType: !1126, size: 64, align: 64, offset: 3392)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1219, file: !544, line: 554, baseType: !1274, size: 64, align: 64, offset: 3456)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1219, file: !544, line: 563, baseType: !984, size: 32, align: 32, offset: 3520)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1219, file: !544, line: 572, baseType: !984, size: 32, align: 32, offset: 3552)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1219, file: !544, line: 581, baseType: !984, size: 32, align: 32, offset: 3584)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1219, file: !544, line: 588, baseType: !1294, size: 64, align: 64, offset: 3648)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !989, line: 36, baseType: !1296)
!1296 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1219, file: !544, line: 593, baseType: !984, size: 32, align: 32, offset: 3712)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1219, file: !544, line: 596, baseType: !984, size: 32, align: 32, offset: 3744)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1219, file: !544, line: 599, baseType: !1114, size: 64, align: 64, offset: 3776)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1219, file: !544, line: 605, baseType: !1114, size: 64, align: 64, offset: 3840)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1219, file: !544, line: 616, baseType: !1114, size: 64, align: 64, offset: 3904)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1219, file: !544, line: 626, baseType: !1209, size: 64, align: 64, offset: 3968)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1219, file: !544, line: 627, baseType: !1209, size: 64, align: 64, offset: 4032)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1219, file: !544, line: 628, baseType: !1209, size: 64, align: 64, offset: 4096)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1219, file: !544, line: 629, baseType: !1209, size: 64, align: 64, offset: 4160)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1219, file: !544, line: 645, baseType: !1114, size: 64, align: 64, offset: 4224)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1176, file: !474, line: 587, baseType: !1162, size: 64, align: 64, offset: 1152)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1176, file: !474, line: 592, baseType: !1168, size: 64, align: 64, offset: 1216)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1176, file: !474, line: 597, baseType: !1168, size: 64, align: 64, offset: 1280)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1176, file: !474, line: 598, baseType: !13, size: 32, align: 32, offset: 1344)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1176, file: !474, line: 608, baseType: !1101, size: 64, align: 64, offset: 1408)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1176, file: !474, line: 617, baseType: !1313, size: 64, align: 64, offset: 1472)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{null, !1104}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1176, file: !474, line: 623, baseType: !1317, size: 64, align: 64, offset: 1536)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!984, !1104, !1320}
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1110)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1025, file: !474, line: 1365, baseType: !1000, size: 64, align: 64, offset: 192)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1025, file: !474, line: 1379, baseType: !1324, size: 64, align: 64, offset: 256)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !646, line: 352, baseType: !1326)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !646, line: 161, size: 2112, align: 64, elements: !1327)
!1327 = !{!1328, !1329, !1330, !1331, !1332, !1333, !1334, !1338, !1339, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1353, !1354, !1358, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1376, !1377, !1378, !1379, !1383, !1384, !1385}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1326, file: !646, line: 174, baseType: !1028, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1326, file: !646, line: 226, baseType: !1097, size: 64, align: 64, offset: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1326, file: !646, line: 227, baseType: !984, size: 32, align: 32, offset: 128)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1326, file: !646, line: 228, baseType: !1097, size: 64, align: 64, offset: 192)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1326, file: !646, line: 229, baseType: !1097, size: 64, align: 64, offset: 256)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1326, file: !646, line: 233, baseType: !1000, size: 64, align: 64, offset: 320)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1326, file: !646, line: 235, baseType: !1335, size: 64, align: 64, offset: 384)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DISubroutineType(types: !1337)
!1337 = !{!984, !1000, !1001, !984}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1326, file: !646, line: 236, baseType: !1335, size: 64, align: 64, offset: 448)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1326, file: !646, line: 237, baseType: !1340, size: 64, align: 64, offset: 512)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!1126, !1000, !1126, !984}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1326, file: !646, line: 238, baseType: !1126, size: 64, align: 64, offset: 576)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1326, file: !646, line: 239, baseType: !984, size: 32, align: 32, offset: 640)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1326, file: !646, line: 240, baseType: !984, size: 32, align: 32, offset: 672)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1326, file: !646, line: 241, baseType: !984, size: 32, align: 32, offset: 704)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1326, file: !646, line: 242, baseType: !1211, size: 64, align: 64, offset: 768)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1326, file: !646, line: 243, baseType: !1097, size: 64, align: 64, offset: 832)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1326, file: !646, line: 244, baseType: !1350, size: 64, align: 64, offset: 896)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DISubroutineType(types: !1352)
!1352 = !{!1211, !1211, !986, !985}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1326, file: !646, line: 245, baseType: !984, size: 32, align: 32, offset: 960)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1326, file: !646, line: 249, baseType: !1355, size: 64, align: 64, offset: 1024)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!984, !1000, !984}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1326, file: !646, line: 255, baseType: !1359, size: 64, align: 64, offset: 1088)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{!1126, !1000, !984, !1126, !984}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1326, file: !646, line: 260, baseType: !984, size: 32, align: 32, offset: 1152)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1326, file: !646, line: 266, baseType: !1126, size: 64, align: 64, offset: 1216)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1326, file: !646, line: 273, baseType: !984, size: 32, align: 32, offset: 1280)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1326, file: !646, line: 279, baseType: !1126, size: 64, align: 64, offset: 1344)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1326, file: !646, line: 285, baseType: !984, size: 32, align: 32, offset: 1408)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1326, file: !646, line: 291, baseType: !984, size: 32, align: 32, offset: 1440)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1326, file: !646, line: 298, baseType: !984, size: 32, align: 32, offset: 1472)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1326, file: !646, line: 304, baseType: !984, size: 32, align: 32, offset: 1504)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1326, file: !646, line: 309, baseType: !1011, size: 64, align: 64, offset: 1536)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1326, file: !646, line: 314, baseType: !1011, size: 64, align: 64, offset: 1600)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1326, file: !646, line: 319, baseType: !1373, size: 64, align: 64, offset: 1664)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DISubroutineType(types: !1375)
!1375 = !{!984, !1000, !1001, !984, !645, !1126}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1326, file: !646, line: 326, baseType: !984, size: 32, align: 32, offset: 1728)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1326, file: !646, line: 331, baseType: !645, size: 32, align: 32, offset: 1760)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1326, file: !646, line: 332, baseType: !1126, size: 64, align: 64, offset: 1792)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1326, file: !646, line: 338, baseType: !1380, size: 64, align: 64, offset: 1856)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DISubroutineType(types: !1382)
!1382 = !{!984, !1000}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1326, file: !646, line: 340, baseType: !1126, size: 64, align: 64, offset: 1920)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1326, file: !646, line: 346, baseType: !1097, size: 64, align: 64, offset: 1984)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1326, file: !646, line: 351, baseType: !984, size: 32, align: 32, offset: 2048)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1025, file: !474, line: 1386, baseType: !984, size: 32, align: 32, offset: 320)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1025, file: !474, line: 1393, baseType: !985, size: 32, align: 32, offset: 352)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1025, file: !474, line: 1405, baseType: !1389, size: 64, align: 64, offset: 384)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !474, line: 1223, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !474, line: 865, size: 6144, align: 64, elements: !1393)
!1393 = !{!1394, !1395, !1396, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !2064, !2070, !2071, !2075, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2107, !2108, !2109, !2110, !2111, !2112}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1392, file: !474, line: 866, baseType: !984, size: 32, align: 32)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1392, file: !474, line: 872, baseType: !984, size: 32, align: 32, offset: 32)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1392, file: !474, line: 878, baseType: !1397, size: 64, align: 64, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1400)
!1400 = !{!1401, !1402, !1403, !1404, !1544, !1545, !1546, !1547, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1700, !1704, !1705, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1884, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1399, file: !14, line: 1561, baseType: !1028, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1399, file: !14, line: 1562, baseType: !984, size: 32, align: 32, offset: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1399, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1399, file: !14, line: 1565, baseType: !1405, size: 64, align: 64, offset: 128)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1407)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1408)
!1408 = !{!1409, !1410, !1411, !1412, !1413, !1414, !1417, !1420, !1423, !1426, !1429, !1430, !1431, !1439, !1440, !1441, !1443, !1447, !1453, !1462, !1466, !1467, !1509, !1516, !1520, !1521, !1525, !1529, !1533, !1537, !1538, !1539}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1407, file: !14, line: 3475, baseType: !1011, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1407, file: !14, line: 3480, baseType: !1011, size: 64, align: 64, offset: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1407, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1407, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1407, file: !14, line: 3487, baseType: !984, size: 32, align: 32, offset: 192)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1407, file: !14, line: 3488, baseType: !1415, size: 64, align: 64, offset: 256)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1236)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1407, file: !14, line: 3489, baseType: !1418, size: 64, align: 64, offset: 320)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1407, file: !14, line: 3490, baseType: !1421, size: 64, align: 64, offset: 384)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1407, file: !14, line: 3491, baseType: !1424, size: 64, align: 64, offset: 448)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !853)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1407, file: !14, line: 3492, baseType: !1427, size: 64, align: 64, offset: 512)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1251)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1407, file: !14, line: 3493, baseType: !988, size: 8, align: 8, offset: 576)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1407, file: !14, line: 3494, baseType: !1028, size: 64, align: 64, offset: 640)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1407, file: !14, line: 3495, baseType: !1432, size: 64, align: 64, offset: 704)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1434)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1435)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1436)
!1436 = !{!1437, !1438}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1435, file: !14, line: 3402, baseType: !984, size: 32, align: 32)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1435, file: !14, line: 3403, baseType: !1011, size: 64, align: 64, offset: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1407, file: !14, line: 3507, baseType: !1011, size: 64, align: 64, offset: 768)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1407, file: !14, line: 3516, baseType: !984, size: 32, align: 32, offset: 832)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1407, file: !14, line: 3517, baseType: !1442, size: 64, align: 64, offset: 896)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1407, file: !14, line: 3527, baseType: !1444, size: 64, align: 64, offset: 960)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DISubroutineType(types: !1446)
!1446 = !{!984, !1397}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1407, file: !14, line: 3535, baseType: !1448, size: 64, align: 64, offset: 1024)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!984, !1397, !1451}
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1398)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1407, file: !14, line: 3541, baseType: !1454, size: 64, align: 64, offset: 1088)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1456)
!1456 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1457)
!1457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1458, line: 223, size: 128, align: 64, elements: !1459)
!1458 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1459 = !{!1460, !1461}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1457, file: !1458, line: 224, baseType: !986, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1457, file: !1458, line: 225, baseType: !986, size: 64, align: 64, offset: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1407, file: !14, line: 3549, baseType: !1463, size: 64, align: 64, offset: 1152)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DISubroutineType(types: !1465)
!1465 = !{null, !1442}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1407, file: !14, line: 3551, baseType: !1444, size: 64, align: 64, offset: 1216)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1407, file: !14, line: 3552, baseType: !1468, size: 64, align: 64, offset: 1280)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!984, !1397, !1001, !984, !1471}
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1473)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1474)
!1474 = !{!1475, !1476, !1478, !1479, !1480, !1508}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1473, file: !14, line: 3921, baseType: !997, size: 16, align: 16)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1473, file: !14, line: 3922, baseType: !1477, size: 32, align: 32, offset: 32)
!1477 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !989, line: 51, baseType: !985)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1473, file: !14, line: 3923, baseType: !1477, size: 32, align: 32, offset: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1473, file: !14, line: 3924, baseType: !985, size: 32, align: 32, offset: 96)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1473, file: !14, line: 3925, baseType: !1481, size: 64, align: 64, offset: 128)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1484)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1485)
!1485 = !{!1486, !1487, !1488, !1489, !1490, !1491, !1497, !1501, !1503, !1504, !1506, !1507}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1484, file: !14, line: 3886, baseType: !984, size: 32, align: 32)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1484, file: !14, line: 3887, baseType: !984, size: 32, align: 32, offset: 32)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1484, file: !14, line: 3888, baseType: !984, size: 32, align: 32, offset: 64)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1484, file: !14, line: 3889, baseType: !984, size: 32, align: 32, offset: 96)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1484, file: !14, line: 3890, baseType: !984, size: 32, align: 32, offset: 128)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1484, file: !14, line: 3897, baseType: !1492, size: 768, align: 64, offset: 192)
!1492 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1493)
!1493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1494)
!1494 = !{!1495, !1496}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1493, file: !14, line: 3855, baseType: !1222, size: 512, align: 64)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1493, file: !14, line: 3857, baseType: !1226, size: 256, align: 32, offset: 512)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1484, file: !14, line: 3903, baseType: !1498, size: 256, align: 64, offset: 960)
!1498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1001, size: 256, align: 64, elements: !1499)
!1499 = !{!1500}
!1500 = !DISubrange(count: 4)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1484, file: !14, line: 3904, baseType: !1502, size: 128, align: 32, offset: 1216)
!1502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 128, align: 32, elements: !1499)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1484, file: !14, line: 3906, baseType: !870, size: 32, align: 32, offset: 1344)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1484, file: !14, line: 3908, baseType: !1505, size: 64, align: 64, offset: 1408)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1484, file: !14, line: 3915, baseType: !1505, size: 64, align: 64, offset: 1472)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1484, file: !14, line: 3917, baseType: !984, size: 32, align: 32, offset: 1536)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1473, file: !14, line: 3926, baseType: !1126, size: 64, align: 64, offset: 192)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1407, file: !14, line: 3564, baseType: !1510, size: 64, align: 64, offset: 1344)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DISubroutineType(types: !1512)
!1512 = !{!984, !1397, !1109, !1513, !1515}
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1218)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1407, file: !14, line: 3566, baseType: !1517, size: 64, align: 64, offset: 1408)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1518 = !DISubroutineType(types: !1519)
!1519 = !{!984, !1397, !1000, !1515, !1109}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1407, file: !14, line: 3567, baseType: !1444, size: 64, align: 64, offset: 1472)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1407, file: !14, line: 3576, baseType: !1522, size: 64, align: 64, offset: 1536)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DISubroutineType(types: !1524)
!1524 = !{!984, !1397, !1513}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1407, file: !14, line: 3577, baseType: !1526, size: 64, align: 64, offset: 1600)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = !DISubroutineType(types: !1528)
!1528 = !{!984, !1397, !1109}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1407, file: !14, line: 3584, baseType: !1530, size: 64, align: 64, offset: 1664)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DISubroutineType(types: !1532)
!1532 = !{!984, !1397, !1217}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1407, file: !14, line: 3589, baseType: !1534, size: 64, align: 64, offset: 1728)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{null, !1397}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1407, file: !14, line: 3594, baseType: !984, size: 32, align: 32, offset: 1792)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1407, file: !14, line: 3600, baseType: !1011, size: 64, align: 64, offset: 1856)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1407, file: !14, line: 3609, baseType: !1540, size: 64, align: 64, offset: 1920)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1543)
!1543 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1399, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1399, file: !14, line: 1581, baseType: !985, size: 32, align: 32, offset: 224)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1399, file: !14, line: 1583, baseType: !1000, size: 64, align: 64, offset: 256)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1399, file: !14, line: 1591, baseType: !1548, size: 64, align: 64, offset: 320)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1458, line: 129, size: 1664, align: 64, elements: !1550)
!1550 = !{!1551, !1552, !1553, !1554, !1555, !1573, !1574, !1580, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1549, file: !1458, line: 136, baseType: !984, size: 32, align: 32)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1549, file: !1458, line: 151, baseType: !984, size: 32, align: 32, offset: 32)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1549, file: !1458, line: 157, baseType: !984, size: 32, align: 32, offset: 64)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1549, file: !1458, line: 159, baseType: !1217, size: 64, align: 64, offset: 128)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1549, file: !1458, line: 161, baseType: !1556, size: 64, align: 64, offset: 192)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1458, line: 117, baseType: !1558)
!1558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1458, line: 100, size: 832, align: 64, elements: !1559)
!1559 = !{!1560, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1558, file: !1458, line: 105, baseType: !1561, size: 256, align: 64)
!1561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1562, size: 256, align: 64, elements: !1499)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1116, line: 238, baseType: !1564)
!1564 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1116, line: 238, flags: DIFlagFwdDecl)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1558, file: !1458, line: 110, baseType: !984, size: 32, align: 32, offset: 256)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1558, file: !1458, line: 111, baseType: !984, size: 32, align: 32, offset: 288)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1558, file: !1458, line: 111, baseType: !984, size: 32, align: 32, offset: 320)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1558, file: !1458, line: 112, baseType: !1226, size: 256, align: 32, offset: 352)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1558, file: !1458, line: 113, baseType: !1502, size: 128, align: 32, offset: 608)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1558, file: !1458, line: 114, baseType: !984, size: 32, align: 32, offset: 736)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1558, file: !1458, line: 115, baseType: !984, size: 32, align: 32, offset: 768)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1558, file: !1458, line: 116, baseType: !984, size: 32, align: 32, offset: 800)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1549, file: !1458, line: 163, baseType: !1000, size: 64, align: 64, offset: 256)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1549, file: !1458, line: 165, baseType: !1575, size: 128, align: 64, offset: 320)
!1575 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1458, line: 122, baseType: !1576)
!1576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1458, line: 119, size: 128, align: 64, elements: !1577)
!1577 = !{!1578, !1579}
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1576, file: !1458, line: 120, baseType: !1109, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1576, file: !1458, line: 121, baseType: !1217, size: 64, align: 64, offset: 64)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1549, file: !1458, line: 166, baseType: !1581, size: 128, align: 64, offset: 448)
!1581 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1458, line: 127, baseType: !1582)
!1582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1458, line: 124, size: 128, align: 64, elements: !1583)
!1583 = !{!1584, !1657}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1582, file: !1458, line: 125, baseType: !1585, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1588)
!1588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1589)
!1589 = !{!1590, !1591, !1615, !1619, !1620, !1654, !1655, !1656}
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1588, file: !14, line: 5751, baseType: !1028, size: 64, align: 64)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1588, file: !14, line: 5756, baseType: !1592, size: 64, align: 64, offset: 64)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1594)
!1594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1595)
!1595 = !{!1596, !1597, !1600, !1601, !1602, !1606, !1610, !1614}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1594, file: !14, line: 5797, baseType: !1011, size: 64, align: 64)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1594, file: !14, line: 5804, baseType: !1598, size: 64, align: 64, offset: 64)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1594, file: !14, line: 5815, baseType: !1028, size: 64, align: 64, offset: 128)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1594, file: !14, line: 5825, baseType: !984, size: 32, align: 32, offset: 192)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1594, file: !14, line: 5826, baseType: !1603, size: 64, align: 64, offset: 256)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DISubroutineType(types: !1605)
!1605 = !{!984, !1586}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1594, file: !14, line: 5827, baseType: !1607, size: 64, align: 64, offset: 320)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DISubroutineType(types: !1609)
!1609 = !{!984, !1586, !1109}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1594, file: !14, line: 5828, baseType: !1611, size: 64, align: 64, offset: 384)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DISubroutineType(types: !1613)
!1613 = !{null, !1586}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1594, file: !14, line: 5829, baseType: !1611, size: 64, align: 64, offset: 448)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1588, file: !14, line: 5762, baseType: !1616, size: 64, align: 64, offset: 128)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1618)
!1618 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1588, file: !14, line: 5768, baseType: !1000, size: 64, align: 64, offset: 192)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1588, file: !14, line: 5775, baseType: !1621, size: 64, align: 64, offset: 256)
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64, align: 64)
!1622 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1623)
!1623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1624)
!1624 = !{!1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1623, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1623, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1623, file: !14, line: 3948, baseType: !1477, size: 32, align: 32, offset: 64)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1623, file: !14, line: 3958, baseType: !1001, size: 64, align: 64, offset: 128)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1623, file: !14, line: 3962, baseType: !984, size: 32, align: 32, offset: 192)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1623, file: !14, line: 3968, baseType: !984, size: 32, align: 32, offset: 224)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1623, file: !14, line: 3973, baseType: !1126, size: 64, align: 64, offset: 256)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1623, file: !14, line: 3986, baseType: !984, size: 32, align: 32, offset: 320)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1623, file: !14, line: 3999, baseType: !984, size: 32, align: 32, offset: 352)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1623, file: !14, line: 4004, baseType: !984, size: 32, align: 32, offset: 384)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1623, file: !14, line: 4005, baseType: !984, size: 32, align: 32, offset: 416)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1623, file: !14, line: 4010, baseType: !984, size: 32, align: 32, offset: 448)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1623, file: !14, line: 4011, baseType: !984, size: 32, align: 32, offset: 480)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1623, file: !14, line: 4020, baseType: !1236, size: 64, align: 32, offset: 512)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1623, file: !14, line: 4025, baseType: !876, size: 32, align: 32, offset: 576)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1623, file: !14, line: 4030, baseType: !567, size: 32, align: 32, offset: 608)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1623, file: !14, line: 4031, baseType: !574, size: 32, align: 32, offset: 640)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1623, file: !14, line: 4032, baseType: !592, size: 32, align: 32, offset: 672)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1623, file: !14, line: 4033, baseType: !616, size: 32, align: 32, offset: 704)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1623, file: !14, line: 4034, baseType: !635, size: 32, align: 32, offset: 736)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1623, file: !14, line: 4039, baseType: !984, size: 32, align: 32, offset: 768)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1623, file: !14, line: 4046, baseType: !1251, size: 64, align: 64, offset: 832)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1623, file: !14, line: 4050, baseType: !984, size: 32, align: 32, offset: 896)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1623, file: !14, line: 4054, baseType: !984, size: 32, align: 32, offset: 928)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1623, file: !14, line: 4061, baseType: !984, size: 32, align: 32, offset: 960)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1623, file: !14, line: 4065, baseType: !984, size: 32, align: 32, offset: 992)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1623, file: !14, line: 4073, baseType: !984, size: 32, align: 32, offset: 1024)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1623, file: !14, line: 4080, baseType: !984, size: 32, align: 32, offset: 1056)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1623, file: !14, line: 4084, baseType: !984, size: 32, align: 32, offset: 1088)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1588, file: !14, line: 5781, baseType: !1621, size: 64, align: 64, offset: 320)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1588, file: !14, line: 5787, baseType: !1236, size: 64, align: 32, offset: 384)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1588, file: !14, line: 5793, baseType: !1236, size: 64, align: 32, offset: 448)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1582, file: !1458, line: 126, baseType: !984, size: 32, align: 32, offset: 64)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1549, file: !1458, line: 172, baseType: !1109, size: 64, align: 64, offset: 576)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1549, file: !1458, line: 177, baseType: !1001, size: 64, align: 64, offset: 640)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1549, file: !1458, line: 178, baseType: !985, size: 32, align: 32, offset: 704)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1549, file: !1458, line: 180, baseType: !1000, size: 64, align: 64, offset: 768)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1549, file: !1458, line: 185, baseType: !984, size: 32, align: 32, offset: 832)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1549, file: !1458, line: 190, baseType: !1000, size: 64, align: 64, offset: 896)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1549, file: !1458, line: 195, baseType: !984, size: 32, align: 32, offset: 960)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1549, file: !1458, line: 200, baseType: !1109, size: 64, align: 64, offset: 1024)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1549, file: !1458, line: 201, baseType: !984, size: 32, align: 32, offset: 1088)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1549, file: !1458, line: 202, baseType: !1217, size: 64, align: 64, offset: 1152)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1549, file: !1458, line: 203, baseType: !984, size: 32, align: 32, offset: 1216)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1549, file: !1458, line: 205, baseType: !984, size: 32, align: 32, offset: 1248)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1549, file: !1458, line: 206, baseType: !984, size: 32, align: 32, offset: 1280)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1549, file: !1458, line: 209, baseType: !1209, size: 64, align: 64, offset: 1344)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1549, file: !1458, line: 212, baseType: !1209, size: 64, align: 64, offset: 1408)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1549, file: !1458, line: 213, baseType: !1217, size: 64, align: 64, offset: 1472)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1549, file: !1458, line: 215, baseType: !984, size: 32, align: 32, offset: 1536)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1549, file: !1458, line: 217, baseType: !984, size: 32, align: 32, offset: 1568)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1549, file: !1458, line: 220, baseType: !984, size: 32, align: 32, offset: 1600)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1399, file: !14, line: 1598, baseType: !1000, size: 64, align: 64, offset: 384)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1399, file: !14, line: 1606, baseType: !1126, size: 64, align: 64, offset: 448)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1399, file: !14, line: 1614, baseType: !984, size: 32, align: 32, offset: 512)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1399, file: !14, line: 1622, baseType: !984, size: 32, align: 32, offset: 544)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1399, file: !14, line: 1628, baseType: !984, size: 32, align: 32, offset: 576)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1399, file: !14, line: 1636, baseType: !984, size: 32, align: 32, offset: 608)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1399, file: !14, line: 1643, baseType: !984, size: 32, align: 32, offset: 640)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1399, file: !14, line: 1657, baseType: !1001, size: 64, align: 64, offset: 704)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1399, file: !14, line: 1658, baseType: !984, size: 32, align: 32, offset: 768)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1399, file: !14, line: 1679, baseType: !1236, size: 64, align: 32, offset: 800)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1399, file: !14, line: 1688, baseType: !984, size: 32, align: 32, offset: 864)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1399, file: !14, line: 1712, baseType: !984, size: 32, align: 32, offset: 896)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1399, file: !14, line: 1729, baseType: !984, size: 32, align: 32, offset: 928)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1399, file: !14, line: 1729, baseType: !984, size: 32, align: 32, offset: 960)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1399, file: !14, line: 1744, baseType: !984, size: 32, align: 32, offset: 992)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1399, file: !14, line: 1744, baseType: !984, size: 32, align: 32, offset: 1024)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1399, file: !14, line: 1751, baseType: !984, size: 32, align: 32, offset: 1056)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1399, file: !14, line: 1766, baseType: !654, size: 32, align: 32, offset: 1088)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1399, file: !14, line: 1791, baseType: !1696, size: 64, align: 64, offset: 1152)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{null, !1699, !1513, !1515, !984, !984, !984}
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1399, file: !14, line: 1808, baseType: !1701, size: 64, align: 64, offset: 1216)
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DISubroutineType(types: !1703)
!1703 = !{!654, !1699, !1418}
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1399, file: !14, line: 1816, baseType: !984, size: 32, align: 32, offset: 1280)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1399, file: !14, line: 1825, baseType: !1706, size: 32, align: 32, offset: 1312)
!1706 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1399, file: !14, line: 1830, baseType: !984, size: 32, align: 32, offset: 1344)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1399, file: !14, line: 1838, baseType: !1706, size: 32, align: 32, offset: 1376)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1399, file: !14, line: 1846, baseType: !984, size: 32, align: 32, offset: 1408)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1399, file: !14, line: 1851, baseType: !984, size: 32, align: 32, offset: 1440)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1399, file: !14, line: 1861, baseType: !1706, size: 32, align: 32, offset: 1472)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1399, file: !14, line: 1868, baseType: !1706, size: 32, align: 32, offset: 1504)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1399, file: !14, line: 1875, baseType: !1706, size: 32, align: 32, offset: 1536)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1399, file: !14, line: 1882, baseType: !1706, size: 32, align: 32, offset: 1568)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1399, file: !14, line: 1889, baseType: !1706, size: 32, align: 32, offset: 1600)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1399, file: !14, line: 1896, baseType: !1706, size: 32, align: 32, offset: 1632)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1399, file: !14, line: 1903, baseType: !1706, size: 32, align: 32, offset: 1664)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1399, file: !14, line: 1910, baseType: !984, size: 32, align: 32, offset: 1696)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1399, file: !14, line: 1915, baseType: !984, size: 32, align: 32, offset: 1728)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1399, file: !14, line: 1926, baseType: !1515, size: 64, align: 64, offset: 1792)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1399, file: !14, line: 1935, baseType: !1236, size: 64, align: 32, offset: 1856)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1399, file: !14, line: 1942, baseType: !984, size: 32, align: 32, offset: 1920)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1399, file: !14, line: 1948, baseType: !984, size: 32, align: 32, offset: 1952)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1399, file: !14, line: 1954, baseType: !984, size: 32, align: 32, offset: 1984)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1399, file: !14, line: 1960, baseType: !984, size: 32, align: 32, offset: 2016)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1399, file: !14, line: 1984, baseType: !984, size: 32, align: 32, offset: 2048)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1399, file: !14, line: 1991, baseType: !984, size: 32, align: 32, offset: 2080)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1399, file: !14, line: 1996, baseType: !984, size: 32, align: 32, offset: 2112)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1399, file: !14, line: 2004, baseType: !984, size: 32, align: 32, offset: 2144)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1399, file: !14, line: 2011, baseType: !984, size: 32, align: 32, offset: 2176)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1399, file: !14, line: 2018, baseType: !984, size: 32, align: 32, offset: 2208)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1399, file: !14, line: 2027, baseType: !984, size: 32, align: 32, offset: 2240)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1399, file: !14, line: 2034, baseType: !984, size: 32, align: 32, offset: 2272)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1399, file: !14, line: 2044, baseType: !984, size: 32, align: 32, offset: 2304)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1399, file: !14, line: 2054, baseType: !1736, size: 64, align: 64, offset: 2368)
!1736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1399, file: !14, line: 2061, baseType: !1736, size: 64, align: 64, offset: 2432)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1399, file: !14, line: 2066, baseType: !984, size: 32, align: 32, offset: 2496)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1399, file: !14, line: 2070, baseType: !984, size: 32, align: 32, offset: 2528)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1399, file: !14, line: 2078, baseType: !984, size: 32, align: 32, offset: 2560)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1399, file: !14, line: 2085, baseType: !984, size: 32, align: 32, offset: 2592)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1399, file: !14, line: 2092, baseType: !984, size: 32, align: 32, offset: 2624)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1399, file: !14, line: 2099, baseType: !984, size: 32, align: 32, offset: 2656)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1399, file: !14, line: 2106, baseType: !984, size: 32, align: 32, offset: 2688)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1399, file: !14, line: 2113, baseType: !984, size: 32, align: 32, offset: 2720)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1399, file: !14, line: 2120, baseType: !984, size: 32, align: 32, offset: 2752)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1399, file: !14, line: 2125, baseType: !984, size: 32, align: 32, offset: 2784)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1399, file: !14, line: 2133, baseType: !984, size: 32, align: 32, offset: 2816)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1399, file: !14, line: 2140, baseType: !984, size: 32, align: 32, offset: 2848)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1399, file: !14, line: 2145, baseType: !984, size: 32, align: 32, offset: 2880)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1399, file: !14, line: 2153, baseType: !984, size: 32, align: 32, offset: 2912)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1399, file: !14, line: 2158, baseType: !984, size: 32, align: 32, offset: 2944)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1399, file: !14, line: 2166, baseType: !574, size: 32, align: 32, offset: 2976)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1399, file: !14, line: 2173, baseType: !592, size: 32, align: 32, offset: 3008)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1399, file: !14, line: 2180, baseType: !616, size: 32, align: 32, offset: 3040)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1399, file: !14, line: 2187, baseType: !567, size: 32, align: 32, offset: 3072)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1399, file: !14, line: 2194, baseType: !635, size: 32, align: 32, offset: 3104)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1399, file: !14, line: 2203, baseType: !984, size: 32, align: 32, offset: 3136)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1399, file: !14, line: 2209, baseType: !876, size: 32, align: 32, offset: 3168)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1399, file: !14, line: 2212, baseType: !984, size: 32, align: 32, offset: 3200)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1399, file: !14, line: 2213, baseType: !984, size: 32, align: 32, offset: 3232)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1399, file: !14, line: 2220, baseType: !853, size: 32, align: 32, offset: 3264)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1399, file: !14, line: 2232, baseType: !984, size: 32, align: 32, offset: 3296)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1399, file: !14, line: 2243, baseType: !984, size: 32, align: 32, offset: 3328)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1399, file: !14, line: 2249, baseType: !984, size: 32, align: 32, offset: 3360)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1399, file: !14, line: 2256, baseType: !984, size: 32, align: 32, offset: 3392)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1399, file: !14, line: 2263, baseType: !1251, size: 64, align: 64, offset: 3456)
