; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rdt.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rdt.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RTPDynamicProtocolHandler = type { i8*, i32, i32, i32, i32, i32, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*, i8*)*, void (%struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, %struct.PayloadContext*, %struct.AVStream*, %struct.AVPacket*, i32*, i8*, i32, i16, i32)*, i32 (%struct.PayloadContext*)*, %struct.RTPDynamicProtocolHandler* }

!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !25, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !926, !927, !928, !934, !936, !937}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !920, line: 222, size: 16, align: 8, elements: !921)
!920 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !919, file: !920, line: 222, baseType: !923, size: 16, align: 16)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !924, line: 49, baseType: !925)
!924 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!925 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!926 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!927 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !920, line: 221, size: 32, align: 8, elements: !931)
!931 = !{!932}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !930, file: !920, line: 221, baseType: !933, size: 32, align: 32)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !924, line: 51, baseType: !927)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !924, line: 48, baseType: !935)
!935 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!938 = !{!939, !953, !2211, !2212, !2213}
!939 = distinct !DIGlobalVariable(name: "xor_table", scope: !940, file: !941, line: 101, type: !949, isLocal: true, isDefinition: true, variable: [37 x i8]* @ff_rdt_calc_response_and_checksum.xor_table)
!940 = distinct !DISubprogram(name: "ff_rdt_calc_response_and_checksum", scope: !941, file: !941, line: 94, type: !942, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !948)
!941 = !DIFile(filename: "libavformat/rdt.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!942 = !DISubroutineType(types: !943)
!943 = !{null, !944, !944, !946}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!948 = !{}
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 296, align: 8, elements: !951)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!951 = !{!952}
!952 = !DISubrange(count: 37)
!953 = distinct !DIGlobalVariable(name: "ff_rdt_live_video_handler", scope: !0, file: !941, line: 568, type: !954, isLocal: false, isDefinition: true, variable: %struct.RTPDynamicProtocolHandler* @ff_rdt_live_video_handler)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTPDynamicProtocolHandler", file: !955, line: 33, baseType: !956)
!955 = !DIFile(filename: "libavformat/rtpdec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RTPDynamicProtocolHandler", file: !955, line: 115, size: 640, align: 64, elements: !957)
!957 = !{!958, !959, !960, !961, !962, !963, !964, !2191, !2195, !2199, !2205, !2209}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "enc_name", scope: !956, file: !955, line: 116, baseType: !946, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !956, file: !955, line: 117, baseType: !636, size: 32, align: 32, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !956, file: !955, line: 118, baseType: !24, size: 32, align: 32, offset: 96)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "need_parsing", scope: !956, file: !955, line: 119, baseType: !896, size: 32, align: 32, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "static_payload_id", scope: !956, file: !955, line: 120, baseType: !926, size: 32, align: 32, offset: 160)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !956, file: !955, line: 123, baseType: !926, size: 32, align: 32, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !956, file: !955, line: 126, baseType: !965, size: 64, align: 64, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!926, !968, !926, !2172}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !971)
!971 = !{!972, !1013, !1123, !1271, !1272, !1337, !1338, !1339, !2029, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2083, !2084, !2085, !2086, !2087, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2138, !2139, !2142, !2143, !2144, !2145, !2146, !2147, !2149, !2150, !2151, !2152, !2160, !2161, !2165, !2169, !2170, !2171}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !970, file: !897, line: 1342, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !977)
!977 = !{!978, !979, !983, !987, !988, !989, !990, !994, !1000, !1002, !1006}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !976, file: !4, line: 72, baseType: !946, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !976, file: !4, line: 78, baseType: !980, size: 64, align: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!946, !936}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !976, file: !4, line: 85, baseType: !984, size: 64, align: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !976, file: !4, line: 93, baseType: !926, size: 32, align: 32, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !976, file: !4, line: 99, baseType: !926, size: 32, align: 32, offset: 224)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !976, file: !4, line: 108, baseType: !926, size: 32, align: 32, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !976, file: !4, line: 113, baseType: !991, size: 64, align: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!936, !936, !936}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !976, file: !4, line: 123, baseType: !995, size: 64, align: 64, offset: 384)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!998, !998}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !976, file: !4, line: 130, baseType: !1001, size: 32, align: 32, offset: 448)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !976, file: !4, line: 136, baseType: !1003, size: 64, align: 64, offset: 512)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!1001, !936}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !976, file: !4, line: 142, baseType: !1007, size: 64, align: 64, offset: 576)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!926, !1010, !936, !946, !926}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !970, file: !897, line: 1349, baseType: !1014, size: 64, align: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1031, !1032, !1033, !1034, !1035, !1036, !1049, !1054, !1094, !1095, !1099, !1104, !1105, !1106, !1110, !1116, !1122}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1015, file: !897, line: 638, baseType: !946, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1015, file: !897, line: 645, baseType: !946, size: 64, align: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1015, file: !897, line: 652, baseType: !926, size: 32, align: 32, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1015, file: !897, line: 659, baseType: !946, size: 64, align: 64, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1015, file: !897, line: 661, baseType: !1022, size: 64, align: 64, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1027, line: 44, size: 64, align: 32, elements: !1028)
!1027 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1026, file: !1027, line: 45, baseType: !24, size: 32, align: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1026, file: !1027, line: 46, baseType: !927, size: 32, align: 32, offset: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1015, file: !897, line: 663, baseType: !973, size: 64, align: 64, offset: 320)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1015, file: !897, line: 670, baseType: !946, size: 64, align: 64, offset: 384)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1015, file: !897, line: 679, baseType: !1014, size: 64, align: 64, offset: 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1015, file: !897, line: 684, baseType: !926, size: 32, align: 32, offset: 512)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1015, file: !897, line: 689, baseType: !926, size: 32, align: 32, offset: 544)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1015, file: !897, line: 696, baseType: !1037, size: 64, align: 64, offset: 576)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!926, !1040}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1043)
!1043 = !{!1044, !1045, !1047, !1048}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1042, file: !897, line: 449, baseType: !946, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1042, file: !897, line: 450, baseType: !1046, size: 64, align: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1042, file: !897, line: 451, baseType: !926, size: 32, align: 32, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1042, file: !897, line: 452, baseType: !946, size: 64, align: 64, offset: 192)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1015, file: !897, line: 703, baseType: !1050, size: 64, align: 64, offset: 640)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!926, !1053}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1015, file: !897, line: 714, baseType: !1055, size: 64, align: 64, offset: 704)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!926, !1053, !1058}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !25, line: 1499, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !25, line: 1445, size: 704, align: 64, elements: !1061)
!1061 = !{!1062, !1074, !1077, !1078, !1079, !1080, !1081, !1082, !1090, !1091, !1092, !1093}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1060, file: !25, line: 1451, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1065, line: 94, baseType: !1066)
!1065 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1065, line: 81, size: 192, align: 64, elements: !1067)
!1067 = !{!1068, !1072, !1073}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1066, file: !1065, line: 82, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1065, line: 73, baseType: !1071)
!1071 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1065, line: 73, flags: DIFlagFwdDecl)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1066, file: !1065, line: 89, baseType: !937, size: 64, align: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1066, file: !1065, line: 93, baseType: !926, size: 32, align: 32, offset: 128)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1060, file: !25, line: 1461, baseType: !1075, size: 64, align: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !924, line: 40, baseType: !1076)
!1076 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1060, file: !25, line: 1467, baseType: !1075, size: 64, align: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1060, file: !25, line: 1468, baseType: !937, size: 64, align: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1060, file: !25, line: 1469, baseType: !926, size: 32, align: 32, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1060, file: !25, line: 1470, baseType: !926, size: 32, align: 32, offset: 288)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1060, file: !25, line: 1474, baseType: !926, size: 32, align: 32, offset: 320)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1060, file: !25, line: 1479, baseType: !1083, size: 64, align: 64, offset: 384)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !25, line: 1415, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !25, line: 1411, size: 128, align: 64, elements: !1086)
!1086 = !{!1087, !1088, !1089}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1085, file: !25, line: 1412, baseType: !937, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1085, file: !25, line: 1413, baseType: !926, size: 32, align: 32, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1085, file: !25, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1060, file: !25, line: 1480, baseType: !926, size: 32, align: 32, offset: 448)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1060, file: !25, line: 1486, baseType: !1075, size: 64, align: 64, offset: 512)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1060, file: !25, line: 1488, baseType: !1075, size: 64, align: 64, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1060, file: !25, line: 1497, baseType: !1075, size: 64, align: 64, offset: 640)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1015, file: !897, line: 720, baseType: !1050, size: 64, align: 64, offset: 768)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1015, file: !897, line: 730, baseType: !1096, size: 64, align: 64, offset: 832)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!926, !1053, !926, !1075, !926}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1015, file: !897, line: 737, baseType: !1100, size: 64, align: 64, offset: 896)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!1075, !1053, !926, !1103, !1075}
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1015, file: !897, line: 744, baseType: !1050, size: 64, align: 64, offset: 960)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1015, file: !897, line: 750, baseType: !1050, size: 64, align: 64, offset: 1024)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1015, file: !897, line: 758, baseType: !1107, size: 64, align: 64, offset: 1088)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!926, !1053, !926, !1075, !1075, !1075, !926}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1015, file: !897, line: 764, baseType: !1111, size: 64, align: 64, offset: 1152)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!926, !1053, !1114}
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1015, file: !897, line: 770, baseType: !1117, size: 64, align: 64, offset: 1216)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!926, !1053, !1120}
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1015, file: !897, line: 776, baseType: !1117, size: 64, align: 64, offset: 1280)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !970, file: !897, line: 1356, baseType: !1124, size: 64, align: 64, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1126)
!1126 = !{!1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1146, !1150, !1154, !1161, !1256, !1257, !1258, !1259, !1260, !1261, !1265}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1125, file: !897, line: 498, baseType: !946, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1125, file: !897, line: 504, baseType: !946, size: 64, align: 64, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1125, file: !897, line: 505, baseType: !946, size: 64, align: 64, offset: 128)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1125, file: !897, line: 506, baseType: !946, size: 64, align: 64, offset: 192)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1125, file: !897, line: 508, baseType: !24, size: 32, align: 32, offset: 256)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1125, file: !897, line: 509, baseType: !24, size: 32, align: 32, offset: 288)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1125, file: !897, line: 510, baseType: !24, size: 32, align: 32, offset: 320)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1125, file: !897, line: 517, baseType: !926, size: 32, align: 32, offset: 352)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1125, file: !897, line: 523, baseType: !1022, size: 64, align: 64, offset: 384)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1125, file: !897, line: 526, baseType: !973, size: 64, align: 64, offset: 448)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1125, file: !897, line: 535, baseType: !1124, size: 64, align: 64, offset: 512)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1125, file: !897, line: 539, baseType: !926, size: 32, align: 32, offset: 576)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1125, file: !897, line: 541, baseType: !1050, size: 64, align: 64, offset: 640)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1125, file: !897, line: 549, baseType: !1055, size: 64, align: 64, offset: 704)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1125, file: !897, line: 550, baseType: !1050, size: 64, align: 64, offset: 768)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1125, file: !897, line: 554, baseType: !1143, size: 64, align: 64, offset: 832)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!926, !1053, !1058, !1058, !926}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1125, file: !897, line: 563, baseType: !1147, size: 64, align: 64, offset: 896)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!926, !24, !926}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1125, file: !897, line: 565, baseType: !1151, size: 64, align: 64, offset: 960)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{null, !1053, !926, !1103, !1103}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1125, file: !897, line: 570, baseType: !1155, size: 64, align: 64, offset: 1024)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!926, !1053, !926, !936, !1158}
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1159, line: 216, baseType: !1160)
!1159 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1160 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1125, file: !897, line: 581, baseType: !1162, size: 64, align: 64, offset: 1088)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!926, !1053, !926, !1165, !927}
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1169)
!1169 = !{!1170, !1174, !1176, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1210, !1212, !1213, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1168, file: !526, line: 282, baseType: !1171, size: 512, align: 64)
!1171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 512, align: 64, elements: !1172)
!1172 = !{!1173}
!1173 = !DISubrange(count: 8)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1168, file: !526, line: 299, baseType: !1175, size: 256, align: 32, offset: 512)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 256, align: 32, elements: !1172)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1168, file: !526, line: 315, baseType: !1177, size: 64, align: 64, offset: 768)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1168, file: !526, line: 326, baseType: !926, size: 32, align: 32, offset: 832)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1168, file: !526, line: 326, baseType: !926, size: 32, align: 32, offset: 864)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1168, file: !526, line: 334, baseType: !926, size: 32, align: 32, offset: 896)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1168, file: !526, line: 341, baseType: !926, size: 32, align: 32, offset: 928)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1168, file: !526, line: 346, baseType: !926, size: 32, align: 32, offset: 960)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1168, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1168, file: !526, line: 356, baseType: !1185, size: 64, align: 32, offset: 1024)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1186, line: 61, baseType: !1187)
!1186 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1186, line: 58, size: 64, align: 32, elements: !1188)
!1188 = !{!1189, !1190}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1187, file: !1186, line: 59, baseType: !926, size: 32, align: 32)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1187, file: !1186, line: 60, baseType: !926, size: 32, align: 32, offset: 32)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1168, file: !526, line: 361, baseType: !1075, size: 64, align: 64, offset: 1088)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1168, file: !526, line: 369, baseType: !1075, size: 64, align: 64, offset: 1152)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1168, file: !526, line: 377, baseType: !1075, size: 64, align: 64, offset: 1216)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1168, file: !526, line: 382, baseType: !926, size: 32, align: 32, offset: 1280)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1168, file: !526, line: 386, baseType: !926, size: 32, align: 32, offset: 1312)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1168, file: !526, line: 391, baseType: !926, size: 32, align: 32, offset: 1344)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1168, file: !526, line: 396, baseType: !936, size: 64, align: 64, offset: 1408)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1168, file: !526, line: 403, baseType: !1199, size: 512, align: 64, offset: 1472)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1200, size: 512, align: 64, elements: !1172)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !924, line: 55, baseType: !1160)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1168, file: !526, line: 410, baseType: !926, size: 32, align: 32, offset: 1984)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1168, file: !526, line: 415, baseType: !926, size: 32, align: 32, offset: 2016)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1168, file: !526, line: 420, baseType: !926, size: 32, align: 32, offset: 2048)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1168, file: !526, line: 425, baseType: !926, size: 32, align: 32, offset: 2080)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1168, file: !526, line: 435, baseType: !1075, size: 64, align: 64, offset: 2112)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1168, file: !526, line: 440, baseType: !926, size: 32, align: 32, offset: 2176)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1168, file: !526, line: 445, baseType: !1200, size: 64, align: 64, offset: 2240)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1168, file: !526, line: 459, baseType: !1209, size: 512, align: 64, offset: 2304)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1063, size: 512, align: 64, elements: !1172)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1168, file: !526, line: 473, baseType: !1211, size: 64, align: 64, offset: 2816)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1168, file: !526, line: 477, baseType: !926, size: 32, align: 32, offset: 2880)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1168, file: !526, line: 479, baseType: !1214, size: 64, align: 64, offset: 2944)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1218)
!1218 = !{!1219, !1220, !1221, !1222, !1227}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1217, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1217, file: !526, line: 203, baseType: !937, size: 64, align: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1217, file: !526, line: 204, baseType: !926, size: 32, align: 32, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1217, file: !526, line: 205, baseType: !1223, size: 64, align: 64, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1225, line: 86, baseType: !1226)
!1225 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1226 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1225, line: 86, flags: DIFlagFwdDecl)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1217, file: !526, line: 206, baseType: !1063, size: 64, align: 64, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1168, file: !526, line: 480, baseType: !926, size: 32, align: 32, offset: 3008)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1168, file: !526, line: 505, baseType: !926, size: 32, align: 32, offset: 3040)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1168, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1168, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1168, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1168, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1168, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1168, file: !526, line: 532, baseType: !1075, size: 64, align: 64, offset: 3264)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1168, file: !526, line: 539, baseType: !1075, size: 64, align: 64, offset: 3328)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1168, file: !526, line: 547, baseType: !1075, size: 64, align: 64, offset: 3392)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1168, file: !526, line: 554, baseType: !1223, size: 64, align: 64, offset: 3456)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1168, file: !526, line: 563, baseType: !926, size: 32, align: 32, offset: 3520)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1168, file: !526, line: 572, baseType: !926, size: 32, align: 32, offset: 3552)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1168, file: !526, line: 581, baseType: !926, size: 32, align: 32, offset: 3584)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1168, file: !526, line: 588, baseType: !1243, size: 64, align: 64, offset: 3648)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !924, line: 36, baseType: !1245)
!1245 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1168, file: !526, line: 593, baseType: !926, size: 32, align: 32, offset: 3712)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1168, file: !526, line: 596, baseType: !926, size: 32, align: 32, offset: 3744)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1168, file: !526, line: 599, baseType: !1063, size: 64, align: 64, offset: 3776)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1168, file: !526, line: 605, baseType: !1063, size: 64, align: 64, offset: 3840)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1168, file: !526, line: 616, baseType: !1063, size: 64, align: 64, offset: 3904)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1168, file: !526, line: 626, baseType: !1158, size: 64, align: 64, offset: 3968)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1168, file: !526, line: 627, baseType: !1158, size: 64, align: 64, offset: 4032)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1168, file: !526, line: 628, baseType: !1158, size: 64, align: 64, offset: 4096)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1168, file: !526, line: 629, baseType: !1158, size: 64, align: 64, offset: 4160)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1168, file: !526, line: 645, baseType: !1063, size: 64, align: 64, offset: 4224)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1125, file: !897, line: 587, baseType: !1111, size: 64, align: 64, offset: 1152)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1125, file: !897, line: 592, baseType: !1117, size: 64, align: 64, offset: 1216)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1125, file: !897, line: 597, baseType: !1117, size: 64, align: 64, offset: 1280)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1125, file: !897, line: 598, baseType: !24, size: 32, align: 32, offset: 1344)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1125, file: !897, line: 608, baseType: !1050, size: 64, align: 64, offset: 1408)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1125, file: !897, line: 617, baseType: !1262, size: 64, align: 64, offset: 1472)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{null, !1053}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1125, file: !897, line: 623, baseType: !1266, size: 64, align: 64, offset: 1536)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!926, !1053, !1269}
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !970, file: !897, line: 1365, baseType: !936, size: 64, align: 64, offset: 192)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !970, file: !897, line: 1379, baseType: !1273, size: 64, align: 64, offset: 256)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1275)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1276)
!1276 = !{!1277, !1278, !1279, !1280, !1281, !1282, !1283, !1287, !1288, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1304, !1305, !1309, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1327, !1328, !1329, !1330, !1334, !1335, !1336}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1275, file: !628, line: 174, baseType: !973, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1275, file: !628, line: 226, baseType: !1046, size: 64, align: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1275, file: !628, line: 227, baseType: !926, size: 32, align: 32, offset: 128)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1275, file: !628, line: 228, baseType: !1046, size: 64, align: 64, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1275, file: !628, line: 229, baseType: !1046, size: 64, align: 64, offset: 256)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1275, file: !628, line: 233, baseType: !936, size: 64, align: 64, offset: 320)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1275, file: !628, line: 235, baseType: !1284, size: 64, align: 64, offset: 384)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!926, !936, !937, !926}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1275, file: !628, line: 236, baseType: !1284, size: 64, align: 64, offset: 448)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1275, file: !628, line: 237, baseType: !1289, size: 64, align: 64, offset: 512)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!1075, !936, !1075, !926}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1275, file: !628, line: 238, baseType: !1075, size: 64, align: 64, offset: 576)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1275, file: !628, line: 239, baseType: !926, size: 32, align: 32, offset: 640)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1275, file: !628, line: 240, baseType: !926, size: 32, align: 32, offset: 672)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1275, file: !628, line: 241, baseType: !926, size: 32, align: 32, offset: 704)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1275, file: !628, line: 242, baseType: !1160, size: 64, align: 64, offset: 768)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1275, file: !628, line: 243, baseType: !1046, size: 64, align: 64, offset: 832)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1275, file: !628, line: 244, baseType: !1299, size: 64, align: 64, offset: 896)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DISubroutineType(types: !1301)
!1301 = !{!1160, !1160, !1302, !927}
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1275, file: !628, line: 245, baseType: !926, size: 32, align: 32, offset: 960)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1275, file: !628, line: 249, baseType: !1306, size: 64, align: 64, offset: 1024)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!926, !936, !926}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1275, file: !628, line: 255, baseType: !1310, size: 64, align: 64, offset: 1088)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DISubroutineType(types: !1312)
!1312 = !{!1075, !936, !926, !1075, !926}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1275, file: !628, line: 260, baseType: !926, size: 32, align: 32, offset: 1152)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1275, file: !628, line: 266, baseType: !1075, size: 64, align: 64, offset: 1216)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1275, file: !628, line: 273, baseType: !926, size: 32, align: 32, offset: 1280)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1275, file: !628, line: 279, baseType: !1075, size: 64, align: 64, offset: 1344)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1275, file: !628, line: 285, baseType: !926, size: 32, align: 32, offset: 1408)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1275, file: !628, line: 291, baseType: !926, size: 32, align: 32, offset: 1440)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1275, file: !628, line: 298, baseType: !926, size: 32, align: 32, offset: 1472)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1275, file: !628, line: 304, baseType: !926, size: 32, align: 32, offset: 1504)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1275, file: !628, line: 309, baseType: !946, size: 64, align: 64, offset: 1536)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1275, file: !628, line: 314, baseType: !946, size: 64, align: 64, offset: 1600)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1275, file: !628, line: 319, baseType: !1324, size: 64, align: 64, offset: 1664)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!926, !936, !937, !926, !627, !1075}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1275, file: !628, line: 326, baseType: !926, size: 32, align: 32, offset: 1728)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1275, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1275, file: !628, line: 332, baseType: !1075, size: 64, align: 64, offset: 1792)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1275, file: !628, line: 338, baseType: !1331, size: 64, align: 64, offset: 1856)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!926, !936}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1275, file: !628, line: 340, baseType: !1075, size: 64, align: 64, offset: 1920)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1275, file: !628, line: 346, baseType: !1046, size: 64, align: 64, offset: 1984)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1275, file: !628, line: 351, baseType: !926, size: 32, align: 32, offset: 2048)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !970, file: !897, line: 1386, baseType: !926, size: 32, align: 32, offset: 320)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !970, file: !897, line: 1393, baseType: !927, size: 32, align: 32, offset: 352)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !970, file: !897, line: 1405, baseType: !1340, size: 64, align: 64, offset: 384)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1343)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1344)
!1344 = !{!1345, !1346, !1347, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1814, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1915, !1921, !1922, !1926, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1958, !1959, !1960, !1961, !1962, !1963}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1343, file: !897, line: 866, baseType: !926, size: 32, align: 32)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1343, file: !897, line: 872, baseType: !926, size: 32, align: 32, offset: 32)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1343, file: !897, line: 878, baseType: !1348, size: 64, align: 64, offset: 64)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !25, line: 3360, baseType: !1350)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !25, line: 1556, size: 8448, align: 64, elements: !1351)
!1351 = !{!1352, !1353, !1354, !1355, !1489, !1490, !1491, !1492, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1518, !1522, !1523, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1702, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1350, file: !25, line: 1561, baseType: !973, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1350, file: !25, line: 1562, baseType: !926, size: 32, align: 32, offset: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1350, file: !25, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1350, file: !25, line: 1565, baseType: !1356, size: 64, align: 64, offset: 128)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1358)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !25, line: 3468, size: 1984, align: 64, elements: !1359)
!1359 = !{!1360, !1361, !1362, !1363, !1364, !1365, !1368, !1371, !1374, !1377, !1380, !1381, !1382, !1390, !1391, !1392, !1394, !1398, !1404, !1409, !1413, !1414, !1454, !1461, !1465, !1466, !1470, !1474, !1478, !1482, !1483, !1484}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1358, file: !25, line: 3475, baseType: !946, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1358, file: !25, line: 3480, baseType: !946, size: 64, align: 64, offset: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1358, file: !25, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1358, file: !25, line: 3482, baseType: !24, size: 32, align: 32, offset: 160)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1358, file: !25, line: 3487, baseType: !926, size: 32, align: 32, offset: 192)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1358, file: !25, line: 3488, baseType: !1366, size: 64, align: 64, offset: 256)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1185)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1358, file: !25, line: 3489, baseType: !1369, size: 64, align: 64, offset: 320)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1358, file: !25, line: 3490, baseType: !1372, size: 64, align: 64, offset: 384)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1358, file: !25, line: 3491, baseType: !1375, size: 64, align: 64, offset: 448)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1358, file: !25, line: 3492, baseType: !1378, size: 64, align: 64, offset: 512)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1200)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1358, file: !25, line: 3493, baseType: !934, size: 8, align: 8, offset: 576)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1358, file: !25, line: 3494, baseType: !973, size: 64, align: 64, offset: 640)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1358, file: !25, line: 3495, baseType: !1383, size: 64, align: 64, offset: 704)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1385)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !25, line: 3404, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !25, line: 3401, size: 128, align: 64, elements: !1387)
!1387 = !{!1388, !1389}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1386, file: !25, line: 3402, baseType: !926, size: 32, align: 32)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1386, file: !25, line: 3403, baseType: !946, size: 64, align: 64, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1358, file: !25, line: 3507, baseType: !946, size: 64, align: 64, offset: 768)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1358, file: !25, line: 3516, baseType: !926, size: 32, align: 32, offset: 832)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1358, file: !25, line: 3517, baseType: !1393, size: 64, align: 64, offset: 896)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1358, file: !25, line: 3527, baseType: !1395, size: 64, align: 64, offset: 960)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DISubroutineType(types: !1397)
!1397 = !{!926, !1348}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1358, file: !25, line: 3535, baseType: !1399, size: 64, align: 64, offset: 1024)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DISubroutineType(types: !1401)
!1401 = !{!926, !1348, !1402}
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1349)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1358, file: !25, line: 3541, baseType: !1405, size: 64, align: 64, offset: 1088)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1407)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !25, line: 3461, baseType: !1408)
!1408 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !25, line: 3461, flags: DIFlagFwdDecl)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1358, file: !25, line: 3549, baseType: !1410, size: 64, align: 64, offset: 1152)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DISubroutineType(types: !1412)
!1412 = !{null, !1393}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1358, file: !25, line: 3551, baseType: !1395, size: 64, align: 64, offset: 1216)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1358, file: !25, line: 3552, baseType: !1415, size: 64, align: 64, offset: 1280)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{!926, !1348, !937, !926, !1418}
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1420)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !25, line: 3920, size: 256, align: 64, elements: !1421)
!1421 = !{!1422, !1423, !1424, !1425, !1426, !1453}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1420, file: !25, line: 3921, baseType: !923, size: 16, align: 16)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1420, file: !25, line: 3922, baseType: !933, size: 32, align: 32, offset: 32)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1420, file: !25, line: 3923, baseType: !933, size: 32, align: 32, offset: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1420, file: !25, line: 3924, baseType: !927, size: 32, align: 32, offset: 96)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1420, file: !25, line: 3925, baseType: !1427, size: 64, align: 64, offset: 128)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !25, line: 3918, baseType: !1430)
!1430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !25, line: 3885, size: 1600, align: 64, elements: !1431)
!1431 = !{!1432, !1433, !1434, !1435, !1436, !1437, !1443, !1447, !1449, !1450, !1451, !1452}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1430, file: !25, line: 3886, baseType: !926, size: 32, align: 32)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1430, file: !25, line: 3887, baseType: !926, size: 32, align: 32, offset: 32)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1430, file: !25, line: 3888, baseType: !926, size: 32, align: 32, offset: 64)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1430, file: !25, line: 3889, baseType: !926, size: 32, align: 32, offset: 96)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1430, file: !25, line: 3890, baseType: !926, size: 32, align: 32, offset: 128)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1430, file: !25, line: 3897, baseType: !1438, size: 768, align: 64, offset: 192)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !25, line: 3858, baseType: !1439)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !25, line: 3853, size: 768, align: 64, elements: !1440)
!1440 = !{!1441, !1442}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1439, file: !25, line: 3855, baseType: !1171, size: 512, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1439, file: !25, line: 3857, baseType: !1175, size: 256, align: 32, offset: 512)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1430, file: !25, line: 3903, baseType: !1444, size: 256, align: 64, offset: 960)
!1444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 256, align: 64, elements: !1445)
!1445 = !{!1446}
!1446 = !DISubrange(count: 4)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1430, file: !25, line: 3904, baseType: !1448, size: 128, align: 32, offset: 1216)
!1448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 128, align: 32, elements: !1445)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1430, file: !25, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1430, file: !25, line: 3908, baseType: !944, size: 64, align: 64, offset: 1408)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1430, file: !25, line: 3915, baseType: !944, size: 64, align: 64, offset: 1472)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1430, file: !25, line: 3917, baseType: !926, size: 32, align: 32, offset: 1536)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1420, file: !25, line: 3926, baseType: !1075, size: 64, align: 64, offset: 192)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1358, file: !25, line: 3564, baseType: !1455, size: 64, align: 64, offset: 1344)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{!926, !1348, !1058, !1458, !1460}
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1167)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1358, file: !25, line: 3566, baseType: !1462, size: 64, align: 64, offset: 1408)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{!926, !1348, !936, !1460, !1058}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1358, file: !25, line: 3567, baseType: !1395, size: 64, align: 64, offset: 1472)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1358, file: !25, line: 3576, baseType: !1467, size: 64, align: 64, offset: 1536)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DISubroutineType(types: !1469)
!1469 = !{!926, !1348, !1458}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1358, file: !25, line: 3577, baseType: !1471, size: 64, align: 64, offset: 1600)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{!926, !1348, !1058}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1358, file: !25, line: 3584, baseType: !1475, size: 64, align: 64, offset: 1664)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!926, !1348, !1166}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1358, file: !25, line: 3589, baseType: !1479, size: 64, align: 64, offset: 1728)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{null, !1348}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1358, file: !25, line: 3594, baseType: !926, size: 32, align: 32, offset: 1792)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1358, file: !25, line: 3600, baseType: !946, size: 64, align: 64, offset: 1856)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1358, file: !25, line: 3609, baseType: !1485, size: 64, align: 64, offset: 1920)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1488)
!1488 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !25, line: 3609, flags: DIFlagFwdDecl)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1350, file: !25, line: 1566, baseType: !24, size: 32, align: 32, offset: 192)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1350, file: !25, line: 1581, baseType: !927, size: 32, align: 32, offset: 224)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1350, file: !25, line: 1583, baseType: !936, size: 64, align: 64, offset: 256)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1350, file: !25, line: 1591, baseType: !1493, size: 64, align: 64, offset: 320)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !25, line: 1532, flags: DIFlagFwdDecl)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1350, file: !25, line: 1598, baseType: !936, size: 64, align: 64, offset: 384)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1350, file: !25, line: 1606, baseType: !1075, size: 64, align: 64, offset: 448)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1350, file: !25, line: 1614, baseType: !926, size: 32, align: 32, offset: 512)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1350, file: !25, line: 1622, baseType: !926, size: 32, align: 32, offset: 544)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1350, file: !25, line: 1628, baseType: !926, size: 32, align: 32, offset: 576)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1350, file: !25, line: 1636, baseType: !926, size: 32, align: 32, offset: 608)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1350, file: !25, line: 1643, baseType: !926, size: 32, align: 32, offset: 640)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1350, file: !25, line: 1657, baseType: !937, size: 64, align: 64, offset: 704)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1350, file: !25, line: 1658, baseType: !926, size: 32, align: 32, offset: 768)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1350, file: !25, line: 1679, baseType: !1185, size: 64, align: 32, offset: 800)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1350, file: !25, line: 1688, baseType: !926, size: 32, align: 32, offset: 864)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1350, file: !25, line: 1712, baseType: !926, size: 32, align: 32, offset: 896)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1350, file: !25, line: 1729, baseType: !926, size: 32, align: 32, offset: 928)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1350, file: !25, line: 1729, baseType: !926, size: 32, align: 32, offset: 960)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1350, file: !25, line: 1744, baseType: !926, size: 32, align: 32, offset: 992)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1350, file: !25, line: 1744, baseType: !926, size: 32, align: 32, offset: 1024)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1350, file: !25, line: 1751, baseType: !926, size: 32, align: 32, offset: 1056)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1350, file: !25, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1350, file: !25, line: 1791, baseType: !1514, size: 64, align: 64, offset: 1152)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{null, !1517, !1458, !1460, !926, !926, !926}
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1350, file: !25, line: 1808, baseType: !1519, size: 64, align: 64, offset: 1216)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DISubroutineType(types: !1521)
!1521 = !{!645, !1517, !1369}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1350, file: !25, line: 1816, baseType: !926, size: 32, align: 32, offset: 1280)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1350, file: !25, line: 1825, baseType: !1524, size: 32, align: 32, offset: 1312)
!1524 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1350, file: !25, line: 1830, baseType: !926, size: 32, align: 32, offset: 1344)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1350, file: !25, line: 1838, baseType: !1524, size: 32, align: 32, offset: 1376)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1350, file: !25, line: 1846, baseType: !926, size: 32, align: 32, offset: 1408)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1350, file: !25, line: 1851, baseType: !926, size: 32, align: 32, offset: 1440)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1350, file: !25, line: 1861, baseType: !1524, size: 32, align: 32, offset: 1472)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1350, file: !25, line: 1868, baseType: !1524, size: 32, align: 32, offset: 1504)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1350, file: !25, line: 1875, baseType: !1524, size: 32, align: 32, offset: 1536)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1350, file: !25, line: 1882, baseType: !1524, size: 32, align: 32, offset: 1568)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1350, file: !25, line: 1889, baseType: !1524, size: 32, align: 32, offset: 1600)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1350, file: !25, line: 1896, baseType: !1524, size: 32, align: 32, offset: 1632)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1350, file: !25, line: 1903, baseType: !1524, size: 32, align: 32, offset: 1664)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1350, file: !25, line: 1910, baseType: !926, size: 32, align: 32, offset: 1696)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1350, file: !25, line: 1915, baseType: !926, size: 32, align: 32, offset: 1728)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1350, file: !25, line: 1926, baseType: !1460, size: 64, align: 64, offset: 1792)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1350, file: !25, line: 1935, baseType: !1185, size: 64, align: 32, offset: 1856)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1350, file: !25, line: 1942, baseType: !926, size: 32, align: 32, offset: 1920)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1350, file: !25, line: 1948, baseType: !926, size: 32, align: 32, offset: 1952)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1350, file: !25, line: 1954, baseType: !926, size: 32, align: 32, offset: 1984)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1350, file: !25, line: 1960, baseType: !926, size: 32, align: 32, offset: 2016)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1350, file: !25, line: 1984, baseType: !926, size: 32, align: 32, offset: 2048)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1350, file: !25, line: 1991, baseType: !926, size: 32, align: 32, offset: 2080)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1350, file: !25, line: 1996, baseType: !926, size: 32, align: 32, offset: 2112)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1350, file: !25, line: 2004, baseType: !926, size: 32, align: 32, offset: 2144)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1350, file: !25, line: 2011, baseType: !926, size: 32, align: 32, offset: 2176)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1350, file: !25, line: 2018, baseType: !926, size: 32, align: 32, offset: 2208)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1350, file: !25, line: 2027, baseType: !926, size: 32, align: 32, offset: 2240)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1350, file: !25, line: 2034, baseType: !926, size: 32, align: 32, offset: 2272)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1350, file: !25, line: 2044, baseType: !926, size: 32, align: 32, offset: 2304)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1350, file: !25, line: 2054, baseType: !1554, size: 64, align: 64, offset: 2368)
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1350, file: !25, line: 2061, baseType: !1554, size: 64, align: 64, offset: 2432)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1350, file: !25, line: 2066, baseType: !926, size: 32, align: 32, offset: 2496)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1350, file: !25, line: 2070, baseType: !926, size: 32, align: 32, offset: 2528)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1350, file: !25, line: 2078, baseType: !926, size: 32, align: 32, offset: 2560)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1350, file: !25, line: 2085, baseType: !926, size: 32, align: 32, offset: 2592)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1350, file: !25, line: 2092, baseType: !926, size: 32, align: 32, offset: 2624)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1350, file: !25, line: 2099, baseType: !926, size: 32, align: 32, offset: 2656)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1350, file: !25, line: 2106, baseType: !926, size: 32, align: 32, offset: 2688)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1350, file: !25, line: 2113, baseType: !926, size: 32, align: 32, offset: 2720)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1350, file: !25, line: 2120, baseType: !926, size: 32, align: 32, offset: 2752)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1350, file: !25, line: 2125, baseType: !926, size: 32, align: 32, offset: 2784)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1350, file: !25, line: 2133, baseType: !926, size: 32, align: 32, offset: 2816)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1350, file: !25, line: 2140, baseType: !926, size: 32, align: 32, offset: 2848)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1350, file: !25, line: 2145, baseType: !926, size: 32, align: 32, offset: 2880)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1350, file: !25, line: 2153, baseType: !926, size: 32, align: 32, offset: 2912)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1350, file: !25, line: 2158, baseType: !926, size: 32, align: 32, offset: 2944)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1350, file: !25, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1350, file: !25, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1350, file: !25, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1350, file: !25, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1350, file: !25, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1350, file: !25, line: 2203, baseType: !926, size: 32, align: 32, offset: 3136)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1350, file: !25, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1350, file: !25, line: 2212, baseType: !926, size: 32, align: 32, offset: 3200)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1350, file: !25, line: 2213, baseType: !926, size: 32, align: 32, offset: 3232)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1350, file: !25, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1350, file: !25, line: 2232, baseType: !926, size: 32, align: 32, offset: 3296)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1350, file: !25, line: 2243, baseType: !926, size: 32, align: 32, offset: 3328)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1350, file: !25, line: 2249, baseType: !926, size: 32, align: 32, offset: 3360)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1350, file: !25, line: 2256, baseType: !926, size: 32, align: 32, offset: 3392)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1350, file: !25, line: 2263, baseType: !1200, size: 64, align: 64, offset: 3456)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1350, file: !25, line: 2270, baseType: !1200, size: 64, align: 64, offset: 3520)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1350, file: !25, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1350, file: !25, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1350, file: !25, line: 2367, baseType: !1590, size: 64, align: 64, offset: 3648)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DISubroutineType(types: !1592)
!1592 = !{!926, !1517, !1166, !926}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1350, file: !25, line: 2383, baseType: !926, size: 32, align: 32, offset: 3712)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1350, file: !25, line: 2386, baseType: !1524, size: 32, align: 32, offset: 3744)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1350, file: !25, line: 2387, baseType: !1524, size: 32, align: 32, offset: 3776)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1350, file: !25, line: 2394, baseType: !926, size: 32, align: 32, offset: 3808)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1350, file: !25, line: 2401, baseType: !926, size: 32, align: 32, offset: 3840)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1350, file: !25, line: 2408, baseType: !926, size: 32, align: 32, offset: 3872)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1350, file: !25, line: 2415, baseType: !926, size: 32, align: 32, offset: 3904)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1350, file: !25, line: 2422, baseType: !926, size: 32, align: 32, offset: 3936)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1350, file: !25, line: 2423, baseType: !1602, size: 64, align: 64, offset: 3968)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !25, line: 831, baseType: !1604)
!1604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !25, line: 826, size: 128, align: 32, elements: !1605)
!1605 = !{!1606, !1607, !1608, !1609}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1604, file: !25, line: 827, baseType: !926, size: 32, align: 32)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1604, file: !25, line: 828, baseType: !926, size: 32, align: 32, offset: 32)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1604, file: !25, line: 829, baseType: !926, size: 32, align: 32, offset: 64)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1604, file: !25, line: 830, baseType: !1524, size: 32, align: 32, offset: 96)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1350, file: !25, line: 2430, baseType: !1075, size: 64, align: 64, offset: 4032)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1350, file: !25, line: 2437, baseType: !1075, size: 64, align: 64, offset: 4096)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1350, file: !25, line: 2444, baseType: !1524, size: 32, align: 32, offset: 4160)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1350, file: !25, line: 2451, baseType: !1524, size: 32, align: 32, offset: 4192)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1350, file: !25, line: 2458, baseType: !926, size: 32, align: 32, offset: 4224)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1350, file: !25, line: 2469, baseType: !926, size: 32, align: 32, offset: 4256)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1350, file: !25, line: 2475, baseType: !926, size: 32, align: 32, offset: 4288)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1350, file: !25, line: 2481, baseType: !926, size: 32, align: 32, offset: 4320)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1350, file: !25, line: 2485, baseType: !926, size: 32, align: 32, offset: 4352)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1350, file: !25, line: 2489, baseType: !926, size: 32, align: 32, offset: 4384)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1350, file: !25, line: 2493, baseType: !926, size: 32, align: 32, offset: 4416)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1350, file: !25, line: 2501, baseType: !926, size: 32, align: 32, offset: 4448)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1350, file: !25, line: 2506, baseType: !926, size: 32, align: 32, offset: 4480)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1350, file: !25, line: 2510, baseType: !926, size: 32, align: 32, offset: 4512)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1350, file: !25, line: 2514, baseType: !1075, size: 64, align: 64, offset: 4544)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1350, file: !25, line: 2528, baseType: !1626, size: 64, align: 64, offset: 4608)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{null, !1517, !936, !926, !926}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1350, file: !25, line: 2534, baseType: !926, size: 32, align: 32, offset: 4672)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1350, file: !25, line: 2545, baseType: !926, size: 32, align: 32, offset: 4704)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1350, file: !25, line: 2547, baseType: !926, size: 32, align: 32, offset: 4736)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1350, file: !25, line: 2549, baseType: !926, size: 32, align: 32, offset: 4768)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1350, file: !25, line: 2551, baseType: !926, size: 32, align: 32, offset: 4800)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1350, file: !25, line: 2553, baseType: !926, size: 32, align: 32, offset: 4832)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1350, file: !25, line: 2555, baseType: !926, size: 32, align: 32, offset: 4864)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1350, file: !25, line: 2557, baseType: !926, size: 32, align: 32, offset: 4896)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1350, file: !25, line: 2559, baseType: !926, size: 32, align: 32, offset: 4928)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1350, file: !25, line: 2563, baseType: !926, size: 32, align: 32, offset: 4960)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1350, file: !25, line: 2571, baseType: !944, size: 64, align: 64, offset: 4992)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1350, file: !25, line: 2579, baseType: !944, size: 64, align: 64, offset: 5056)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1350, file: !25, line: 2586, baseType: !926, size: 32, align: 32, offset: 5120)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1350, file: !25, line: 2615, baseType: !926, size: 32, align: 32, offset: 5152)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1350, file: !25, line: 2627, baseType: !926, size: 32, align: 32, offset: 5184)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1350, file: !25, line: 2637, baseType: !926, size: 32, align: 32, offset: 5216)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1350, file: !25, line: 2681, baseType: !926, size: 32, align: 32, offset: 5248)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1350, file: !25, line: 2709, baseType: !1075, size: 64, align: 64, offset: 5312)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1350, file: !25, line: 2716, baseType: !1648, size: 64, align: 64, offset: 5376)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1650)
!1650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !25, line: 3636, size: 896, align: 64, elements: !1651)
!1651 = !{!1652, !1653, !1654, !1655, !1656, !1657, !1658, !1662, !1666, !1667, !1668, !1669, !1675, !1676, !1677, !1678, !1679}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1650, file: !25, line: 3642, baseType: !946, size: 64, align: 64)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1650, file: !25, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1650, file: !25, line: 3656, baseType: !24, size: 32, align: 32, offset: 96)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1650, file: !25, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1650, file: !25, line: 3669, baseType: !926, size: 32, align: 32, offset: 160)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1650, file: !25, line: 3682, baseType: !1475, size: 64, align: 64, offset: 192)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1650, file: !25, line: 3698, baseType: !1659, size: 64, align: 64, offset: 256)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DISubroutineType(types: !1661)
!1661 = !{!926, !1348, !1302, !933}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1650, file: !25, line: 3712, baseType: !1663, size: 64, align: 64, offset: 320)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{!926, !1348, !926, !1302, !933}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1650, file: !25, line: 3726, baseType: !1659, size: 64, align: 64, offset: 384)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1650, file: !25, line: 3737, baseType: !1395, size: 64, align: 64, offset: 448)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1650, file: !25, line: 3746, baseType: !926, size: 32, align: 32, offset: 512)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1650, file: !25, line: 3757, baseType: !1670, size: 64, align: 64, offset: 576)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{null, !1673}
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !25, line: 3617, flags: DIFlagFwdDecl)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1650, file: !25, line: 3766, baseType: !1395, size: 64, align: 64, offset: 640)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1650, file: !25, line: 3774, baseType: !1395, size: 64, align: 64, offset: 704)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1650, file: !25, line: 3780, baseType: !926, size: 32, align: 32, offset: 768)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1650, file: !25, line: 3785, baseType: !926, size: 32, align: 32, offset: 800)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1650, file: !25, line: 3795, baseType: !1680, size: 64, align: 64, offset: 832)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!926, !1348, !1063}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1350, file: !25, line: 2728, baseType: !936, size: 64, align: 64, offset: 5440)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1350, file: !25, line: 2735, baseType: !1199, size: 512, align: 64, offset: 5504)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1350, file: !25, line: 2742, baseType: !926, size: 32, align: 32, offset: 6016)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1350, file: !25, line: 2755, baseType: !926, size: 32, align: 32, offset: 6048)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1350, file: !25, line: 2776, baseType: !926, size: 32, align: 32, offset: 6080)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1350, file: !25, line: 2783, baseType: !926, size: 32, align: 32, offset: 6112)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1350, file: !25, line: 2791, baseType: !926, size: 32, align: 32, offset: 6144)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1350, file: !25, line: 2802, baseType: !1166, size: 64, align: 64, offset: 6208)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1350, file: !25, line: 2811, baseType: !926, size: 32, align: 32, offset: 6272)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1350, file: !25, line: 2821, baseType: !926, size: 32, align: 32, offset: 6304)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1350, file: !25, line: 2830, baseType: !926, size: 32, align: 32, offset: 6336)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1350, file: !25, line: 2840, baseType: !926, size: 32, align: 32, offset: 6368)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1350, file: !25, line: 2851, baseType: !1696, size: 64, align: 64, offset: 6400)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!926, !1517, !1699, !936, !1460, !926, !926}
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{!926, !1517, !936}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1350, file: !25, line: 2871, baseType: !1703, size: 64, align: 64, offset: 6464)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DISubroutineType(types: !1705)
!1705 = !{!926, !1517, !1706, !936, !1460, !926}
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DISubroutineType(types: !1708)
!1708 = !{!926, !1517, !936, !926, !926}
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1350, file: !25, line: 2878, baseType: !926, size: 32, align: 32, offset: 6528)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1350, file: !25, line: 2885, baseType: !926, size: 32, align: 32, offset: 6560)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1350, file: !25, line: 3005, baseType: !926, size: 32, align: 32, offset: 6592)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1350, file: !25, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1350, file: !25, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1350, file: !25, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1350, file: !25, line: 3037, baseType: !937, size: 64, align: 64, offset: 6720)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1350, file: !25, line: 3038, baseType: !926, size: 32, align: 32, offset: 6784)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1350, file: !25, line: 3050, baseType: !1200, size: 64, align: 64, offset: 6848)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1350, file: !25, line: 3065, baseType: !926, size: 32, align: 32, offset: 6912)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1350, file: !25, line: 3083, baseType: !926, size: 32, align: 32, offset: 6944)
