; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--allformats.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--allformats.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVOutputFormat = type { i8*, i8*, i8*, i8*, i32, i32, i32, i32, %struct.AVCodecTag**, %struct.AVClass*, %struct.AVOutputFormat*, i32, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*, %struct.AVPacket*, i32)*, i32 (i32, i32)*, void (%struct.AVFormatContext*, i32, i64*, i64*)*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i32 (%struct.AVFormatContext*, i32, %struct.AVFrame**, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32, i32 (%struct.AVFormatContext*)*, void (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque

!850 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!851 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!852 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!853 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!854 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!855 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!856 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!857 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !534, line: 538, size: 32, align: 32, elements: !858)
!858 = !{!859, !860, !861, !862, !863, !864, !865, !866}
!859 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!860 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!861 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!862 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!863 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!864 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "./libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !920, !921, !2136}
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !918, line: 122, baseType: !919)
!918 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!919 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !897, line: 777, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !924)
!924 = !{!925, !929, !930, !932, !933, !944, !985, !986, !988, !989, !990, !1004, !2117, !2118, !2119, !2123, !2127, !2128, !2129, !2133, !2134, !2135}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !923, file: !897, line: 638, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !923, file: !897, line: 645, baseType: !926, size: 64, align: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !923, file: !897, line: 652, baseType: !931, size: 32, align: 32, offset: 128)
!931 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !923, file: !897, line: 659, baseType: !926, size: 64, align: 64, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !923, file: !897, line: 661, baseType: !934, size: 64, align: 64, offset: 256)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !939, line: 44, size: 64, align: 32, elements: !940)
!939 = !DIFile(filename: "./libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !938, file: !939, line: 45, baseType: !3, size: 32, align: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !938, file: !939, line: 46, baseType: !943, size: 32, align: 32, offset: 32)
!943 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !923, file: !897, line: 663, baseType: !945, size: 64, align: 64, offset: 320)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !949)
!949 = !{!950, !951, !955, !959, !960, !961, !962, !966, !972, !974, !978}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !948, file: !464, line: 72, baseType: !926, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !948, file: !464, line: 78, baseType: !952, size: 64, align: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!926, !920}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !948, file: !464, line: 85, baseType: !956, size: 64, align: 64, offset: 128)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !948, file: !464, line: 93, baseType: !931, size: 32, align: 32, offset: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !948, file: !464, line: 99, baseType: !931, size: 32, align: 32, offset: 224)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !948, file: !464, line: 108, baseType: !931, size: 32, align: 32, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !948, file: !464, line: 113, baseType: !963, size: 64, align: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!920, !920, !920}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !948, file: !464, line: 123, baseType: !967, size: 64, align: 64, offset: 384)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!970, !970}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !948, file: !464, line: 130, baseType: !973, size: 32, align: 32, offset: 448)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !948, file: !464, line: 136, baseType: !975, size: 64, align: 64, offset: 512)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!973, !920}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !948, file: !464, line: 142, baseType: !979, size: 64, align: 64, offset: 576)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!931, !982, !920, !926, !931}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !923, file: !897, line: 670, baseType: !926, size: 64, align: 64, offset: 384)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !923, file: !897, line: 679, baseType: !987, size: 64, align: 64, offset: 448)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !923, file: !897, line: 684, baseType: !931, size: 32, align: 32, offset: 512)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !923, file: !897, line: 689, baseType: !931, size: 32, align: 32, offset: 544)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !923, file: !897, line: 696, baseType: !991, size: 64, align: 64, offset: 576)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!931, !994}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !997)
!997 = !{!998, !999, !1002, !1003}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !996, file: !897, line: 449, baseType: !926, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !996, file: !897, line: 450, baseType: !1000, size: 64, align: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !996, file: !897, line: 451, baseType: !931, size: 32, align: 32, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !996, file: !897, line: 452, baseType: !926, size: 64, align: 64, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !923, file: !897, line: 703, baseType: !1005, size: 64, align: 64, offset: 640)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!931, !1008}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1212, !1213, !1278, !1279, !1280, !1974, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2028, !2029, !2030, !2031, !2032, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2083, !2084, !2087, !2088, !2089, !2090, !2091, !2092, !2094, !2095, !2096, !2097, !2105, !2106, !2110, !2114, !2115, !2116}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1009, file: !897, line: 1342, baseType: !945, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1009, file: !897, line: 1349, baseType: !987, size: 64, align: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1009, file: !897, line: 1356, baseType: !1014, size: 64, align: 64, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1072, !1073, !1077, !1081, !1086, !1092, !1187, !1193, !1199, !1200, !1201, !1202, !1206}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1015, file: !897, line: 498, baseType: !926, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1015, file: !897, line: 504, baseType: !926, size: 64, align: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1015, file: !897, line: 505, baseType: !926, size: 64, align: 64, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1015, file: !897, line: 506, baseType: !926, size: 64, align: 64, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1015, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1015, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1015, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1015, file: !897, line: 517, baseType: !931, size: 32, align: 32, offset: 352)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1015, file: !897, line: 523, baseType: !934, size: 64, align: 64, offset: 384)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1015, file: !897, line: 526, baseType: !945, size: 64, align: 64, offset: 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1015, file: !897, line: 535, baseType: !1014, size: 64, align: 64, offset: 512)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1015, file: !897, line: 539, baseType: !931, size: 32, align: 32, offset: 576)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1015, file: !897, line: 541, baseType: !1005, size: 64, align: 64, offset: 640)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1015, file: !897, line: 549, baseType: !1031, size: 64, align: 64, offset: 704)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!931, !1008, !1034}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1037)
!1037 = !{!1038, !1052, !1055, !1056, !1057, !1058, !1059, !1060, !1068, !1069, !1070, !1071}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1036, file: !4, line: 1451, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1041, line: 94, baseType: !1042)
!1041 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1041, line: 81, size: 192, align: 64, elements: !1043)
!1043 = !{!1044, !1048, !1051}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1042, file: !1041, line: 82, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1041, line: 73, baseType: !1047)
!1047 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1041, line: 73, flags: DIFlagFwdDecl)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1042, file: !1041, line: 89, baseType: !1049, size: 64, align: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !918, line: 48, baseType: !1001)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1042, file: !1041, line: 93, baseType: !931, size: 32, align: 32, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1036, file: !4, line: 1461, baseType: !1053, size: 64, align: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !918, line: 40, baseType: !1054)
!1054 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1036, file: !4, line: 1467, baseType: !1053, size: 64, align: 64, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1036, file: !4, line: 1468, baseType: !1049, size: 64, align: 64, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1036, file: !4, line: 1469, baseType: !931, size: 32, align: 32, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1036, file: !4, line: 1470, baseType: !931, size: 32, align: 32, offset: 288)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1036, file: !4, line: 1474, baseType: !931, size: 32, align: 32, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1036, file: !4, line: 1479, baseType: !1061, size: 64, align: 64, offset: 384)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1064)
!1064 = !{!1065, !1066, !1067}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1063, file: !4, line: 1412, baseType: !1049, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1063, file: !4, line: 1413, baseType: !931, size: 32, align: 32, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1063, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1036, file: !4, line: 1480, baseType: !931, size: 32, align: 32, offset: 448)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1036, file: !4, line: 1486, baseType: !1053, size: 64, align: 64, offset: 512)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1036, file: !4, line: 1488, baseType: !1053, size: 64, align: 64, offset: 576)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1036, file: !4, line: 1497, baseType: !1053, size: 64, align: 64, offset: 640)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1015, file: !897, line: 550, baseType: !1005, size: 64, align: 64, offset: 768)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1015, file: !897, line: 554, baseType: !1074, size: 64, align: 64, offset: 832)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!931, !1008, !1034, !1034, !931}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1015, file: !897, line: 563, baseType: !1078, size: 64, align: 64, offset: 896)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!931, !3, !931}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1015, file: !897, line: 565, baseType: !1082, size: 64, align: 64, offset: 960)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{null, !1008, !931, !1085, !1085}
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1015, file: !897, line: 570, baseType: !1087, size: 64, align: 64, offset: 1024)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!931, !1008, !931, !920, !1090}
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1091, line: 216, baseType: !919)
!1091 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1015, file: !897, line: 581, baseType: !1093, size: 64, align: 64, offset: 1088)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!931, !1008, !931, !1096, !943}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !767, line: 646, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !767, line: 268, size: 4288, align: 64, elements: !1100)
!1100 = !{!1101, !1105, !1107, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1141, !1143, !1144, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1099, file: !767, line: 282, baseType: !1102, size: 512, align: 64)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 512, align: 64, elements: !1103)
!1103 = !{!1104}
!1104 = !DISubrange(count: 8)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1099, file: !767, line: 299, baseType: !1106, size: 256, align: 32, offset: 512)
!1106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 256, align: 32, elements: !1103)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1099, file: !767, line: 315, baseType: !1108, size: 64, align: 64, offset: 768)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1099, file: !767, line: 326, baseType: !931, size: 32, align: 32, offset: 832)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1099, file: !767, line: 326, baseType: !931, size: 32, align: 32, offset: 864)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1099, file: !767, line: 334, baseType: !931, size: 32, align: 32, offset: 896)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1099, file: !767, line: 341, baseType: !931, size: 32, align: 32, offset: 928)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1099, file: !767, line: 346, baseType: !931, size: 32, align: 32, offset: 960)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1099, file: !767, line: 351, baseType: !756, size: 32, align: 32, offset: 992)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1099, file: !767, line: 356, baseType: !1116, size: 64, align: 32, offset: 1024)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1117, line: 61, baseType: !1118)
!1117 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1117, line: 58, size: 64, align: 32, elements: !1119)
!1119 = !{!1120, !1121}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1118, file: !1117, line: 59, baseType: !931, size: 32, align: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1118, file: !1117, line: 60, baseType: !931, size: 32, align: 32, offset: 32)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1099, file: !767, line: 361, baseType: !1053, size: 64, align: 64, offset: 1088)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1099, file: !767, line: 369, baseType: !1053, size: 64, align: 64, offset: 1152)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1099, file: !767, line: 377, baseType: !1053, size: 64, align: 64, offset: 1216)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1099, file: !767, line: 382, baseType: !931, size: 32, align: 32, offset: 1280)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1099, file: !767, line: 386, baseType: !931, size: 32, align: 32, offset: 1312)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1099, file: !767, line: 391, baseType: !931, size: 32, align: 32, offset: 1344)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1099, file: !767, line: 396, baseType: !920, size: 64, align: 64, offset: 1408)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1099, file: !767, line: 403, baseType: !1130, size: 512, align: 64, offset: 1472)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1131, size: 512, align: 64, elements: !1103)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !918, line: 55, baseType: !919)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1099, file: !767, line: 410, baseType: !931, size: 32, align: 32, offset: 1984)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1099, file: !767, line: 415, baseType: !931, size: 32, align: 32, offset: 2016)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1099, file: !767, line: 420, baseType: !931, size: 32, align: 32, offset: 2048)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1099, file: !767, line: 425, baseType: !931, size: 32, align: 32, offset: 2080)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1099, file: !767, line: 435, baseType: !1053, size: 64, align: 64, offset: 2112)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1099, file: !767, line: 440, baseType: !931, size: 32, align: 32, offset: 2176)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1099, file: !767, line: 445, baseType: !1131, size: 64, align: 64, offset: 2240)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1099, file: !767, line: 459, baseType: !1140, size: 512, align: 64, offset: 2304)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 512, align: 64, elements: !1103)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1099, file: !767, line: 473, baseType: !1142, size: 64, align: 64, offset: 2816)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1099, file: !767, line: 477, baseType: !931, size: 32, align: 32, offset: 2880)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1099, file: !767, line: 479, baseType: !1145, size: 64, align: 64, offset: 2944)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !767, line: 207, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !767, line: 201, size: 320, align: 64, elements: !1149)
!1149 = !{!1150, !1151, !1152, !1153, !1158}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1148, file: !767, line: 202, baseType: !766, size: 32, align: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1148, file: !767, line: 203, baseType: !1049, size: 64, align: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1148, file: !767, line: 204, baseType: !931, size: 32, align: 32, offset: 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1148, file: !767, line: 205, baseType: !1154, size: 64, align: 64, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1156, line: 86, baseType: !1157)
!1156 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1157 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1156, line: 86, flags: DIFlagFwdDecl)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1148, file: !767, line: 206, baseType: !1039, size: 64, align: 64, offset: 256)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1099, file: !767, line: 480, baseType: !931, size: 32, align: 32, offset: 3008)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1099, file: !767, line: 505, baseType: !931, size: 32, align: 32, offset: 3040)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1099, file: !767, line: 512, baseType: !790, size: 32, align: 32, offset: 3072)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1099, file: !767, line: 514, baseType: !796, size: 32, align: 32, offset: 3104)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1099, file: !767, line: 516, baseType: !814, size: 32, align: 32, offset: 3136)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1099, file: !767, line: 523, baseType: !838, size: 32, align: 32, offset: 3168)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1099, file: !767, line: 525, baseType: !857, size: 32, align: 32, offset: 3200)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1099, file: !767, line: 532, baseType: !1053, size: 64, align: 64, offset: 3264)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1099, file: !767, line: 539, baseType: !1053, size: 64, align: 64, offset: 3328)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1099, file: !767, line: 547, baseType: !1053, size: 64, align: 64, offset: 3392)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1099, file: !767, line: 554, baseType: !1154, size: 64, align: 64, offset: 3456)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1099, file: !767, line: 563, baseType: !931, size: 32, align: 32, offset: 3520)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1099, file: !767, line: 572, baseType: !931, size: 32, align: 32, offset: 3552)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1099, file: !767, line: 581, baseType: !931, size: 32, align: 32, offset: 3584)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1099, file: !767, line: 588, baseType: !1174, size: 64, align: 64, offset: 3648)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !918, line: 36, baseType: !1176)
!1176 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1099, file: !767, line: 593, baseType: !931, size: 32, align: 32, offset: 3712)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1099, file: !767, line: 596, baseType: !931, size: 32, align: 32, offset: 3744)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1099, file: !767, line: 599, baseType: !1039, size: 64, align: 64, offset: 3776)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1099, file: !767, line: 605, baseType: !1039, size: 64, align: 64, offset: 3840)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1099, file: !767, line: 616, baseType: !1039, size: 64, align: 64, offset: 3904)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1099, file: !767, line: 626, baseType: !1090, size: 64, align: 64, offset: 3968)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1099, file: !767, line: 627, baseType: !1090, size: 64, align: 64, offset: 4032)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1099, file: !767, line: 628, baseType: !1090, size: 64, align: 64, offset: 4096)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1099, file: !767, line: 629, baseType: !1090, size: 64, align: 64, offset: 4160)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1099, file: !767, line: 645, baseType: !1039, size: 64, align: 64, offset: 4224)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1015, file: !897, line: 587, baseType: !1188, size: 64, align: 64, offset: 1152)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{!931, !1008, !1191}
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1015, file: !897, line: 592, baseType: !1194, size: 64, align: 64, offset: 1216)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!931, !1008, !1197}
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1015, file: !897, line: 597, baseType: !1194, size: 64, align: 64, offset: 1280)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1015, file: !897, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1015, file: !897, line: 608, baseType: !1005, size: 64, align: 64, offset: 1408)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1015, file: !897, line: 617, baseType: !1203, size: 64, align: 64, offset: 1472)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{null, !1008}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1015, file: !897, line: 623, baseType: !1207, size: 64, align: 64, offset: 1536)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!931, !1008, !1210}
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1009, file: !897, line: 1365, baseType: !920, size: 64, align: 64, offset: 192)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1009, file: !897, line: 1379, baseType: !1214, size: 64, align: 64, offset: 256)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !515, line: 352, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !515, line: 161, size: 2112, align: 64, elements: !1217)
!1217 = !{!1218, !1219, !1220, !1221, !1222, !1223, !1224, !1228, !1229, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1245, !1246, !1250, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1268, !1269, !1270, !1271, !1275, !1276, !1277}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1216, file: !515, line: 174, baseType: !945, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1216, file: !515, line: 226, baseType: !1000, size: 64, align: 64, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1216, file: !515, line: 227, baseType: !931, size: 32, align: 32, offset: 128)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1216, file: !515, line: 228, baseType: !1000, size: 64, align: 64, offset: 192)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1216, file: !515, line: 229, baseType: !1000, size: 64, align: 64, offset: 256)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1216, file: !515, line: 233, baseType: !920, size: 64, align: 64, offset: 320)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1216, file: !515, line: 235, baseType: !1225, size: 64, align: 64, offset: 384)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!931, !920, !1049, !931}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1216, file: !515, line: 236, baseType: !1225, size: 64, align: 64, offset: 448)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1216, file: !515, line: 237, baseType: !1230, size: 64, align: 64, offset: 512)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!1053, !920, !1053, !931}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1216, file: !515, line: 238, baseType: !1053, size: 64, align: 64, offset: 576)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1216, file: !515, line: 239, baseType: !931, size: 32, align: 32, offset: 640)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1216, file: !515, line: 240, baseType: !931, size: 32, align: 32, offset: 672)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1216, file: !515, line: 241, baseType: !931, size: 32, align: 32, offset: 704)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1216, file: !515, line: 242, baseType: !919, size: 64, align: 64, offset: 768)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1216, file: !515, line: 243, baseType: !1000, size: 64, align: 64, offset: 832)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1216, file: !515, line: 244, baseType: !1240, size: 64, align: 64, offset: 896)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!919, !919, !1243, !943}
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1216, file: !515, line: 245, baseType: !931, size: 32, align: 32, offset: 960)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1216, file: !515, line: 249, baseType: !1247, size: 64, align: 64, offset: 1024)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!931, !920, !931}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1216, file: !515, line: 255, baseType: !1251, size: 64, align: 64, offset: 1088)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!1053, !920, !931, !1053, !931}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1216, file: !515, line: 260, baseType: !931, size: 32, align: 32, offset: 1152)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1216, file: !515, line: 266, baseType: !1053, size: 64, align: 64, offset: 1216)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1216, file: !515, line: 273, baseType: !931, size: 32, align: 32, offset: 1280)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1216, file: !515, line: 279, baseType: !1053, size: 64, align: 64, offset: 1344)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1216, file: !515, line: 285, baseType: !931, size: 32, align: 32, offset: 1408)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1216, file: !515, line: 291, baseType: !931, size: 32, align: 32, offset: 1440)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1216, file: !515, line: 298, baseType: !931, size: 32, align: 32, offset: 1472)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1216, file: !515, line: 304, baseType: !931, size: 32, align: 32, offset: 1504)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1216, file: !515, line: 309, baseType: !926, size: 64, align: 64, offset: 1536)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1216, file: !515, line: 314, baseType: !926, size: 64, align: 64, offset: 1600)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1216, file: !515, line: 319, baseType: !1265, size: 64, align: 64, offset: 1664)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!931, !920, !1049, !931, !514, !1053}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1216, file: !515, line: 326, baseType: !931, size: 32, align: 32, offset: 1728)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1216, file: !515, line: 331, baseType: !514, size: 32, align: 32, offset: 1760)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1216, file: !515, line: 332, baseType: !1053, size: 64, align: 64, offset: 1792)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1216, file: !515, line: 338, baseType: !1272, size: 64, align: 64, offset: 1856)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!931, !920}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1216, file: !515, line: 340, baseType: !1053, size: 64, align: 64, offset: 1920)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1216, file: !515, line: 346, baseType: !1000, size: 64, align: 64, offset: 1984)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1216, file: !515, line: 351, baseType: !931, size: 32, align: 32, offset: 2048)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1009, file: !897, line: 1386, baseType: !931, size: 32, align: 32, offset: 320)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1009, file: !897, line: 1393, baseType: !943, size: 32, align: 32, offset: 352)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1009, file: !897, line: 1405, baseType: !1281, size: 64, align: 64, offset: 384)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1284)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1285)
!1285 = !{!1286, !1287, !1288, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1759, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1860, !1866, !1867, !1871, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1903, !1904, !1905, !1906, !1907, !1908}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1284, file: !897, line: 866, baseType: !931, size: 32, align: 32)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1284, file: !897, line: 872, baseType: !931, size: 32, align: 32, offset: 32)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1284, file: !897, line: 878, baseType: !1289, size: 64, align: 64, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1291)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1292)
!1292 = !{!1293, !1294, !1295, !1296, !1434, !1435, !1436, !1437, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1463, !1467, !1468, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1647, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1291, file: !4, line: 1561, baseType: !945, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1291, file: !4, line: 1562, baseType: !931, size: 32, align: 32, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1291, file: !4, line: 1564, baseType: !523, size: 32, align: 32, offset: 96)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1291, file: !4, line: 1565, baseType: !1297, size: 64, align: 64, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1299)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1300)
!1300 = !{!1301, !1302, !1303, !1304, !1305, !1306, !1309, !1312, !1315, !1318, !1321, !1322, !1323, !1331, !1332, !1333, !1335, !1339, !1345, !1350, !1354, !1355, !1399, !1406, !1410, !1411, !1415, !1419, !1423, !1427, !1428, !1429}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1299, file: !4, line: 3475, baseType: !926, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1299, file: !4, line: 3480, baseType: !926, size: 64, align: 64, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1299, file: !4, line: 3481, baseType: !523, size: 32, align: 32, offset: 128)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1299, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1299, file: !4, line: 3487, baseType: !931, size: 32, align: 32, offset: 192)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1299, file: !4, line: 3488, baseType: !1307, size: 64, align: 64, offset: 256)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1116)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1299, file: !4, line: 3489, baseType: !1310, size: 64, align: 64, offset: 320)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1299, file: !4, line: 3490, baseType: !1313, size: 64, align: 64, offset: 384)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1299, file: !4, line: 3491, baseType: !1316, size: 64, align: 64, offset: 448)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1299, file: !4, line: 3492, baseType: !1319, size: 64, align: 64, offset: 512)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1131)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1299, file: !4, line: 3493, baseType: !1050, size: 8, align: 8, offset: 576)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1299, file: !4, line: 3494, baseType: !945, size: 64, align: 64, offset: 640)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1299, file: !4, line: 3495, baseType: !1324, size: 64, align: 64, offset: 704)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1326)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1327)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1328)
!1328 = !{!1329, !1330}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1327, file: !4, line: 3402, baseType: !931, size: 32, align: 32)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1327, file: !4, line: 3403, baseType: !926, size: 64, align: 64, offset: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1299, file: !4, line: 3507, baseType: !926, size: 64, align: 64, offset: 768)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1299, file: !4, line: 3516, baseType: !931, size: 32, align: 32, offset: 832)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1299, file: !4, line: 3517, baseType: !1334, size: 64, align: 64, offset: 896)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1299, file: !4, line: 3527, baseType: !1336, size: 64, align: 64, offset: 960)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{!931, !1289}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1299, file: !4, line: 3535, baseType: !1340, size: 64, align: 64, offset: 1024)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!931, !1289, !1343}
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1290)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1299, file: !4, line: 3541, baseType: !1346, size: 64, align: 64, offset: 1088)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1348)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1349)
!1349 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1299, file: !4, line: 3549, baseType: !1351, size: 64, align: 64, offset: 1152)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{null, !1334}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1299, file: !4, line: 3551, baseType: !1336, size: 64, align: 64, offset: 1216)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1299, file: !4, line: 3552, baseType: !1356, size: 64, align: 64, offset: 1280)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!931, !1289, !1049, !931, !1359}
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1362)
!1362 = !{!1363, !1366, !1368, !1369, !1370, !1398}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1361, file: !4, line: 3921, baseType: !1364, size: 16, align: 16)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !918, line: 49, baseType: !1365)
!1365 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1361, file: !4, line: 3922, baseType: !1367, size: 32, align: 32, offset: 32)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !918, line: 51, baseType: !943)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1361, file: !4, line: 3923, baseType: !1367, size: 32, align: 32, offset: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1361, file: !4, line: 3924, baseType: !943, size: 32, align: 32, offset: 96)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1361, file: !4, line: 3925, baseType: !1371, size: 64, align: 64, offset: 128)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1374)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1375)
!1375 = !{!1376, !1377, !1378, !1379, !1380, !1381, !1387, !1391, !1393, !1394, !1396, !1397}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1374, file: !4, line: 3886, baseType: !931, size: 32, align: 32)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1374, file: !4, line: 3887, baseType: !931, size: 32, align: 32, offset: 32)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1374, file: !4, line: 3888, baseType: !931, size: 32, align: 32, offset: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1374, file: !4, line: 3889, baseType: !931, size: 32, align: 32, offset: 96)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1374, file: !4, line: 3890, baseType: !931, size: 32, align: 32, offset: 128)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1374, file: !4, line: 3897, baseType: !1382, size: 768, align: 64, offset: 192)
!1382 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1383)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1384)
!1384 = !{!1385, !1386}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1383, file: !4, line: 3855, baseType: !1102, size: 512, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1383, file: !4, line: 3857, baseType: !1106, size: 256, align: 32, offset: 512)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1374, file: !4, line: 3903, baseType: !1388, size: 256, align: 64, offset: 960)
!1388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 256, align: 64, elements: !1389)
!1389 = !{!1390}
!1390 = !DISubrange(count: 4)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1374, file: !4, line: 3904, baseType: !1392, size: 128, align: 32, offset: 1216)
!1392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 128, align: 32, elements: !1389)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1374, file: !4, line: 3906, baseType: !750, size: 32, align: 32, offset: 1344)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1374, file: !4, line: 3908, baseType: !1395, size: 64, align: 64, offset: 1408)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1374, file: !4, line: 3915, baseType: !1395, size: 64, align: 64, offset: 1472)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1374, file: !4, line: 3917, baseType: !931, size: 32, align: 32, offset: 1536)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1361, file: !4, line: 3926, baseType: !1053, size: 64, align: 64, offset: 192)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1299, file: !4, line: 3564, baseType: !1400, size: 64, align: 64, offset: 1344)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DISubroutineType(types: !1402)
!1402 = !{!931, !1289, !1034, !1403, !1405}
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1098)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1299, file: !4, line: 3566, baseType: !1407, size: 64, align: 64, offset: 1408)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DISubroutineType(types: !1409)
!1409 = !{!931, !1289, !920, !1405, !1034}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1299, file: !4, line: 3567, baseType: !1336, size: 64, align: 64, offset: 1472)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1299, file: !4, line: 3576, baseType: !1412, size: 64, align: 64, offset: 1536)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DISubroutineType(types: !1414)
!1414 = !{!931, !1289, !1403}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1299, file: !4, line: 3577, baseType: !1416, size: 64, align: 64, offset: 1600)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{!931, !1289, !1034}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1299, file: !4, line: 3584, baseType: !1420, size: 64, align: 64, offset: 1664)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DISubroutineType(types: !1422)
!1422 = !{!931, !1289, !1097}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1299, file: !4, line: 3589, baseType: !1424, size: 64, align: 64, offset: 1728)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DISubroutineType(types: !1426)
!1426 = !{null, !1289}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1299, file: !4, line: 3594, baseType: !931, size: 32, align: 32, offset: 1792)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1299, file: !4, line: 3600, baseType: !926, size: 64, align: 64, offset: 1856)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1299, file: !4, line: 3609, baseType: !1430, size: 64, align: 64, offset: 1920)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1433)
!1433 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1291, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1291, file: !4, line: 1581, baseType: !943, size: 32, align: 32, offset: 224)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1291, file: !4, line: 1583, baseType: !920, size: 64, align: 64, offset: 256)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1291, file: !4, line: 1591, baseType: !1438, size: 64, align: 64, offset: 320)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1291, file: !4, line: 1598, baseType: !920, size: 64, align: 64, offset: 384)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1291, file: !4, line: 1606, baseType: !1053, size: 64, align: 64, offset: 448)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1291, file: !4, line: 1614, baseType: !931, size: 32, align: 32, offset: 512)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1291, file: !4, line: 1622, baseType: !931, size: 32, align: 32, offset: 544)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1291, file: !4, line: 1628, baseType: !931, size: 32, align: 32, offset: 576)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1291, file: !4, line: 1636, baseType: !931, size: 32, align: 32, offset: 608)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1291, file: !4, line: 1643, baseType: !931, size: 32, align: 32, offset: 640)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1291, file: !4, line: 1657, baseType: !1049, size: 64, align: 64, offset: 704)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1291, file: !4, line: 1658, baseType: !931, size: 32, align: 32, offset: 768)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1291, file: !4, line: 1679, baseType: !1116, size: 64, align: 32, offset: 800)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1291, file: !4, line: 1688, baseType: !931, size: 32, align: 32, offset: 864)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1291, file: !4, line: 1712, baseType: !931, size: 32, align: 32, offset: 896)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1291, file: !4, line: 1729, baseType: !931, size: 32, align: 32, offset: 928)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1291, file: !4, line: 1729, baseType: !931, size: 32, align: 32, offset: 960)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1291, file: !4, line: 1744, baseType: !931, size: 32, align: 32, offset: 992)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1291, file: !4, line: 1744, baseType: !931, size: 32, align: 32, offset: 1024)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1291, file: !4, line: 1751, baseType: !931, size: 32, align: 32, offset: 1056)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1291, file: !4, line: 1766, baseType: !533, size: 32, align: 32, offset: 1088)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1291, file: !4, line: 1791, baseType: !1459, size: 64, align: 64, offset: 1152)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DISubroutineType(types: !1461)
!1461 = !{null, !1462, !1403, !1405, !931, !931, !931}
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1291, file: !4, line: 1808, baseType: !1464, size: 64, align: 64, offset: 1216)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DISubroutineType(types: !1466)
!1466 = !{!533, !1462, !1310}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1291, file: !4, line: 1816, baseType: !931, size: 32, align: 32, offset: 1280)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1291, file: !4, line: 1825, baseType: !1469, size: 32, align: 32, offset: 1312)
!1469 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1291, file: !4, line: 1830, baseType: !931, size: 32, align: 32, offset: 1344)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1291, file: !4, line: 1838, baseType: !1469, size: 32, align: 32, offset: 1376)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1291, file: !4, line: 1846, baseType: !931, size: 32, align: 32, offset: 1408)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1291, file: !4, line: 1851, baseType: !931, size: 32, align: 32, offset: 1440)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1291, file: !4, line: 1861, baseType: !1469, size: 32, align: 32, offset: 1472)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1291, file: !4, line: 1868, baseType: !1469, size: 32, align: 32, offset: 1504)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1291, file: !4, line: 1875, baseType: !1469, size: 32, align: 32, offset: 1536)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1291, file: !4, line: 1882, baseType: !1469, size: 32, align: 32, offset: 1568)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1291, file: !4, line: 1889, baseType: !1469, size: 32, align: 32, offset: 1600)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1291, file: !4, line: 1896, baseType: !1469, size: 32, align: 32, offset: 1632)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1291, file: !4, line: 1903, baseType: !1469, size: 32, align: 32, offset: 1664)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1291, file: !4, line: 1910, baseType: !931, size: 32, align: 32, offset: 1696)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1291, file: !4, line: 1915, baseType: !931, size: 32, align: 32, offset: 1728)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1291, file: !4, line: 1926, baseType: !1405, size: 64, align: 64, offset: 1792)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1291, file: !4, line: 1935, baseType: !1116, size: 64, align: 32, offset: 1856)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1291, file: !4, line: 1942, baseType: !931, size: 32, align: 32, offset: 1920)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1291, file: !4, line: 1948, baseType: !931, size: 32, align: 32, offset: 1952)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1291, file: !4, line: 1954, baseType: !931, size: 32, align: 32, offset: 1984)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1291, file: !4, line: 1960, baseType: !931, size: 32, align: 32, offset: 2016)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1291, file: !4, line: 1984, baseType: !931, size: 32, align: 32, offset: 2048)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1291, file: !4, line: 1991, baseType: !931, size: 32, align: 32, offset: 2080)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1291, file: !4, line: 1996, baseType: !931, size: 32, align: 32, offset: 2112)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1291, file: !4, line: 2004, baseType: !931, size: 32, align: 32, offset: 2144)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1291, file: !4, line: 2011, baseType: !931, size: 32, align: 32, offset: 2176)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1291, file: !4, line: 2018, baseType: !931, size: 32, align: 32, offset: 2208)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1291, file: !4, line: 2027, baseType: !931, size: 32, align: 32, offset: 2240)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1291, file: !4, line: 2034, baseType: !931, size: 32, align: 32, offset: 2272)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1291, file: !4, line: 2044, baseType: !931, size: 32, align: 32, offset: 2304)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1291, file: !4, line: 2054, baseType: !1499, size: 64, align: 64, offset: 2368)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1291, file: !4, line: 2061, baseType: !1499, size: 64, align: 64, offset: 2432)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1291, file: !4, line: 2066, baseType: !931, size: 32, align: 32, offset: 2496)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1291, file: !4, line: 2070, baseType: !931, size: 32, align: 32, offset: 2528)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1291, file: !4, line: 2078, baseType: !931, size: 32, align: 32, offset: 2560)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1291, file: !4, line: 2085, baseType: !931, size: 32, align: 32, offset: 2592)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1291, file: !4, line: 2092, baseType: !931, size: 32, align: 32, offset: 2624)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1291, file: !4, line: 2099, baseType: !931, size: 32, align: 32, offset: 2656)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1291, file: !4, line: 2106, baseType: !931, size: 32, align: 32, offset: 2688)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1291, file: !4, line: 2113, baseType: !931, size: 32, align: 32, offset: 2720)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1291, file: !4, line: 2120, baseType: !931, size: 32, align: 32, offset: 2752)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1291, file: !4, line: 2125, baseType: !931, size: 32, align: 32, offset: 2784)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1291, file: !4, line: 2133, baseType: !931, size: 32, align: 32, offset: 2816)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1291, file: !4, line: 2140, baseType: !931, size: 32, align: 32, offset: 2848)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1291, file: !4, line: 2145, baseType: !931, size: 32, align: 32, offset: 2880)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1291, file: !4, line: 2153, baseType: !931, size: 32, align: 32, offset: 2912)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1291, file: !4, line: 2158, baseType: !931, size: 32, align: 32, offset: 2944)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1291, file: !4, line: 2166, baseType: !796, size: 32, align: 32, offset: 2976)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1291, file: !4, line: 2173, baseType: !814, size: 32, align: 32, offset: 3008)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1291, file: !4, line: 2180, baseType: !838, size: 32, align: 32, offset: 3040)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1291, file: !4, line: 2187, baseType: !790, size: 32, align: 32, offset: 3072)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1291, file: !4, line: 2194, baseType: !857, size: 32, align: 32, offset: 3104)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1291, file: !4, line: 2203, baseType: !931, size: 32, align: 32, offset: 3136)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1291, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1291, file: !4, line: 2212, baseType: !931, size: 32, align: 32, offset: 3200)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1291, file: !4, line: 2213, baseType: !931, size: 32, align: 32, offset: 3232)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1291, file: !4, line: 2220, baseType: !733, size: 32, align: 32, offset: 3264)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1291, file: !4, line: 2232, baseType: !931, size: 32, align: 32, offset: 3296)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1291, file: !4, line: 2243, baseType: !931, size: 32, align: 32, offset: 3328)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1291, file: !4, line: 2249, baseType: !931, size: 32, align: 32, offset: 3360)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1291, file: !4, line: 2256, baseType: !931, size: 32, align: 32, offset: 3392)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1291, file: !4, line: 2263, baseType: !1131, size: 64, align: 64, offset: 3456)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1291, file: !4, line: 2270, baseType: !1131, size: 64, align: 64, offset: 3520)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1291, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1291, file: !4, line: 2285, baseType: !733, size: 32, align: 32, offset: 3616)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1291, file: !4, line: 2367, baseType: !1535, size: 64, align: 64, offset: 3648)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!931, !1462, !1097, !931}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1291, file: !4, line: 2383, baseType: !931, size: 32, align: 32, offset: 3712)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1291, file: !4, line: 2386, baseType: !1469, size: 32, align: 32, offset: 3744)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1291, file: !4, line: 2387, baseType: !1469, size: 32, align: 32, offset: 3776)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1291, file: !4, line: 2394, baseType: !931, size: 32, align: 32, offset: 3808)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1291, file: !4, line: 2401, baseType: !931, size: 32, align: 32, offset: 3840)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1291, file: !4, line: 2408, baseType: !931, size: 32, align: 32, offset: 3872)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1291, file: !4, line: 2415, baseType: !931, size: 32, align: 32, offset: 3904)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1291, file: !4, line: 2422, baseType: !931, size: 32, align: 32, offset: 3936)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1291, file: !4, line: 2423, baseType: !1547, size: 64, align: 64, offset: 3968)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1549)
!1549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1550)
!1550 = !{!1551, !1552, !1553, !1554}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1549, file: !4, line: 827, baseType: !931, size: 32, align: 32)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1549, file: !4, line: 828, baseType: !931, size: 32, align: 32, offset: 32)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1549, file: !4, line: 829, baseType: !931, size: 32, align: 32, offset: 64)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1549, file: !4, line: 830, baseType: !1469, size: 32, align: 32, offset: 96)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1291, file: !4, line: 2430, baseType: !1053, size: 64, align: 64, offset: 4032)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1291, file: !4, line: 2437, baseType: !1053, size: 64, align: 64, offset: 4096)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1291, file: !4, line: 2444, baseType: !1469, size: 32, align: 32, offset: 4160)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1291, file: !4, line: 2451, baseType: !1469, size: 32, align: 32, offset: 4192)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1291, file: !4, line: 2458, baseType: !931, size: 32, align: 32, offset: 4224)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1291, file: !4, line: 2469, baseType: !931, size: 32, align: 32, offset: 4256)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1291, file: !4, line: 2475, baseType: !931, size: 32, align: 32, offset: 4288)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1291, file: !4, line: 2481, baseType: !931, size: 32, align: 32, offset: 4320)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1291, file: !4, line: 2485, baseType: !931, size: 32, align: 32, offset: 4352)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1291, file: !4, line: 2489, baseType: !931, size: 32, align: 32, offset: 4384)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1291, file: !4, line: 2493, baseType: !931, size: 32, align: 32, offset: 4416)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1291, file: !4, line: 2501, baseType: !931, size: 32, align: 32, offset: 4448)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1291, file: !4, line: 2506, baseType: !931, size: 32, align: 32, offset: 4480)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1291, file: !4, line: 2510, baseType: !931, size: 32, align: 32, offset: 4512)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1291, file: !4, line: 2514, baseType: !1053, size: 64, align: 64, offset: 4544)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1291, file: !4, line: 2528, baseType: !1571, size: 64, align: 64, offset: 4608)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DISubroutineType(types: !1573)
!1573 = !{null, !1462, !920, !931, !931}
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1291, file: !4, line: 2534, baseType: !931, size: 32, align: 32, offset: 4672)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1291, file: !4, line: 2545, baseType: !931, size: 32, align: 32, offset: 4704)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1291, file: !4, line: 2547, baseType: !931, size: 32, align: 32, offset: 4736)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1291, file: !4, line: 2549, baseType: !931, size: 32, align: 32, offset: 4768)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1291, file: !4, line: 2551, baseType: !931, size: 32, align: 32, offset: 4800)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1291, file: !4, line: 2553, baseType: !931, size: 32, align: 32, offset: 4832)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1291, file: !4, line: 2555, baseType: !931, size: 32, align: 32, offset: 4864)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1291, file: !4, line: 2557, baseType: !931, size: 32, align: 32, offset: 4896)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1291, file: !4, line: 2559, baseType: !931, size: 32, align: 32, offset: 4928)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1291, file: !4, line: 2563, baseType: !931, size: 32, align: 32, offset: 4960)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1291, file: !4, line: 2571, baseType: !1395, size: 64, align: 64, offset: 4992)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1291, file: !4, line: 2579, baseType: !1395, size: 64, align: 64, offset: 5056)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1291, file: !4, line: 2586, baseType: !931, size: 32, align: 32, offset: 5120)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1291, file: !4, line: 2615, baseType: !931, size: 32, align: 32, offset: 5152)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1291, file: !4, line: 2627, baseType: !931, size: 32, align: 32, offset: 5184)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1291, file: !4, line: 2637, baseType: !931, size: 32, align: 32, offset: 5216)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1291, file: !4, line: 2681, baseType: !931, size: 32, align: 32, offset: 5248)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1291, file: !4, line: 2709, baseType: !1053, size: 64, align: 64, offset: 5312)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1291, file: !4, line: 2716, baseType: !1593, size: 64, align: 64, offset: 5376)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1595)
!1595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1596)
!1596 = !{!1597, !1598, !1599, !1600, !1601, !1602, !1603, !1607, !1611, !1612, !1613, !1614, !1620, !1621, !1622, !1623, !1624}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1595, file: !4, line: 3642, baseType: !926, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1595, file: !4, line: 3649, baseType: !523, size: 32, align: 32, offset: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1595, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1595, file: !4, line: 3663, baseType: !533, size: 32, align: 32, offset: 128)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1595, file: !4, line: 3669, baseType: !931, size: 32, align: 32, offset: 160)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1595, file: !4, line: 3682, baseType: !1420, size: 64, align: 64, offset: 192)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1595, file: !4, line: 3698, baseType: !1604, size: 64, align: 64, offset: 256)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DISubroutineType(types: !1606)
!1606 = !{!931, !1289, !1243, !1367}
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1595, file: !4, line: 3712, baseType: !1608, size: 64, align: 64, offset: 320)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DISubroutineType(types: !1610)
!1610 = !{!931, !1289, !931, !1243, !1367}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1595, file: !4, line: 3726, baseType: !1604, size: 64, align: 64, offset: 384)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1595, file: !4, line: 3737, baseType: !1336, size: 64, align: 64, offset: 448)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1595, file: !4, line: 3746, baseType: !931, size: 32, align: 32, offset: 512)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1595, file: !4, line: 3757, baseType: !1615, size: 64, align: 64, offset: 576)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DISubroutineType(types: !1617)
!1617 = !{null, !1618}
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1595, file: !4, line: 3766, baseType: !1336, size: 64, align: 64, offset: 640)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1595, file: !4, line: 3774, baseType: !1336, size: 64, align: 64, offset: 704)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1595, file: !4, line: 3780, baseType: !931, size: 32, align: 32, offset: 768)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1595, file: !4, line: 3785, baseType: !931, size: 32, align: 32, offset: 800)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1595, file: !4, line: 3795, baseType: !1625, size: 64, align: 64, offset: 832)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DISubroutineType(types: !1627)
!1627 = !{!931, !1289, !1039}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1291, file: !4, line: 2728, baseType: !920, size: 64, align: 64, offset: 5440)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1291, file: !4, line: 2735, baseType: !1130, size: 512, align: 64, offset: 5504)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1291, file: !4, line: 2742, baseType: !931, size: 32, align: 32, offset: 6016)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1291, file: !4, line: 2755, baseType: !931, size: 32, align: 32, offset: 6048)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1291, file: !4, line: 2776, baseType: !931, size: 32, align: 32, offset: 6080)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1291, file: !4, line: 2783, baseType: !931, size: 32, align: 32, offset: 6112)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1291, file: !4, line: 2791, baseType: !931, size: 32, align: 32, offset: 6144)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1291, file: !4, line: 2802, baseType: !1097, size: 64, align: 64, offset: 6208)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1291, file: !4, line: 2811, baseType: !931, size: 32, align: 32, offset: 6272)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1291, file: !4, line: 2821, baseType: !931, size: 32, align: 32, offset: 6304)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1291, file: !4, line: 2830, baseType: !931, size: 32, align: 32, offset: 6336)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1291, file: !4, line: 2840, baseType: !931, size: 32, align: 32, offset: 6368)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1291, file: !4, line: 2851, baseType: !1641, size: 64, align: 64, offset: 6400)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{!931, !1462, !1644, !920, !1405, !931, !931}
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DISubroutineType(types: !1646)
!1646 = !{!931, !1462, !920}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1291, file: !4, line: 2871, baseType: !1648, size: 64, align: 64, offset: 6464)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{!931, !1462, !1651, !920, !1405, !931}
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{!931, !1462, !920, !931, !931}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1291, file: !4, line: 2878, baseType: !931, size: 32, align: 32, offset: 6528)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1291, file: !4, line: 2885, baseType: !931, size: 32, align: 32, offset: 6560)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1291, file: !4, line: 3005, baseType: !931, size: 32, align: 32, offset: 6592)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1291, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1291, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1291, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1291, file: !4, line: 3037, baseType: !1049, size: 64, align: 64, offset: 6720)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1291, file: !4, line: 3038, baseType: !931, size: 32, align: 32, offset: 6784)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1291, file: !4, line: 3050, baseType: !1131, size: 64, align: 64, offset: 6848)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1291, file: !4, line: 3065, baseType: !931, size: 32, align: 32, offset: 6912)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1291, file: !4, line: 3083, baseType: !931, size: 32, align: 32, offset: 6944)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1291, file: !4, line: 3092, baseType: !1116, size: 64, align: 32, offset: 6976)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1291, file: !4, line: 3099, baseType: !533, size: 32, align: 32, offset: 7040)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1291, file: !4, line: 3106, baseType: !1116, size: 64, align: 32, offset: 7072)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1291, file: !4, line: 3113, baseType: !1669, size: 64, align: 64, offset: 7168)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1671)
!1671 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1672)
!1672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1673)
!1673 = !{!1674, !1675, !1676, !1677, !1678, !1679, !1682}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1672, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1672, file: !4, line: 714, baseType: !523, size: 32, align: 32, offset: 32)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1672, file: !4, line: 720, baseType: !926, size: 64, align: 64, offset: 64)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1672, file: !4, line: 724, baseType: !926, size: 64, align: 64, offset: 128)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1672, file: !4, line: 728, baseType: !931, size: 32, align: 32, offset: 192)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1672, file: !4, line: 734, baseType: !1680, size: 64, align: 64, offset: 256)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1672, file: !4, line: 739, baseType: !1683, size: 64, align: 64, offset: 320)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1327)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1291, file: !4, line: 3129, baseType: !1053, size: 64, align: 64, offset: 7232)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1291, file: !4, line: 3130, baseType: !1053, size: 64, align: 64, offset: 7296)
