; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--movenchint.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--movenchint.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFormatContext = type { %struct.AVClass*, %struct.AVInputFormat*, %struct.AVOutputFormat*, i8*, %struct.AVIOContext*, i32, i32, %struct.AVStream**, [1024 x i8], i8*, i64, i64, i64, i32, i32, i32, i64, i64, i8*, i32, i32, %struct.AVProgram**, i32, i32, i32, i32, i32, i32, %struct.AVChapter**, %struct.AVDictionary*, i64, i32, i32, %struct.AVIOInterruptCB, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i8*, i8*, %struct.AVFormatInternal*, i32, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, i32, i8*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i64, i8*, i32, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVIOInterruptCB*, %struct.AVDictionary**)*, i8*, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVDictionary**)*, void (%struct.AVFormatContext*, %struct.AVIOContext*)*, i8*, i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }

!917 = !DIFile(filename: "libavformat/movenc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!918 = !{!919, !920}
!919 = !DIEnumerator(name: "MOV_ENC_NONE", value: 0)
!920 = !DIEnumerator(name: "MOV_ENC_CENC_AES_CTR", value: 1)
!921 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !917, line: 173, size: 32, align: 32, elements: !922)
!922 = !{!923, !924, !925, !926}
!923 = !DIEnumerator(name: "MOV_PRFT_NONE", value: 0)
!924 = !DIEnumerator(name: "MOV_PRFT_SRC_WALLCLOCK", value: 1)
!925 = !DIEnumerator(name: "MOV_PRFT_SRC_PTS", value: 2)
!926 = !DIEnumerator(name: "MOV_PRFT_NB", value: 3)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RTCPType", file: !928, line: 92, size: 32, align: 32, elements: !929)
!928 = !DIFile(filename: "libavformat/rtp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!929 = !{!930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944}
!930 = !DIEnumerator(name: "RTCP_FIR", value: 192)
!931 = !DIEnumerator(name: "RTCP_NACK", value: 193)
!932 = !DIEnumerator(name: "RTCP_SMPTETC", value: 194)
!933 = !DIEnumerator(name: "RTCP_IJ", value: 195)
!934 = !DIEnumerator(name: "RTCP_SR", value: 200)
!935 = !DIEnumerator(name: "RTCP_RR", value: 201)
!936 = !DIEnumerator(name: "RTCP_SDES", value: 202)
!937 = !DIEnumerator(name: "RTCP_BYE", value: 203)
!938 = !DIEnumerator(name: "RTCP_APP", value: 204)
!939 = !DIEnumerator(name: "RTCP_RTPFB", value: 205)
!940 = !DIEnumerator(name: "RTCP_PSFB", value: 206)
!941 = !DIEnumerator(name: "RTCP_XR", value: 207)
!942 = !DIEnumerator(name: "RTCP_AVB", value: 208)
!943 = !DIEnumerator(name: "RTCP_RSI", value: 209)
!944 = !DIEnumerator(name: "RTCP_TOKEN", value: 210)
!945 = !{!946, !947, !955, !962}
!946 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !950, line: 221, size: 32, align: 8, elements: !951)
!950 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!951 = !{!952}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !949, file: !950, line: 221, baseType: !953, size: 32, align: 32)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !954, line: 51, baseType: !946)
!954 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !950, line: 222, size: 16, align: 8, elements: !958)
!958 = !{!959}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !957, file: !950, line: 222, baseType: !960, size: 16, align: 16)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !954, line: 49, baseType: !961)
!961 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !954, line: 40, baseType: !963)
!963 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!964 = !{i32 2, !"Dwarf Version", i32 4}
!965 = !{i32 2, !"Debug Info Version", i32 3}
!966 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!967 = distinct !DISubprogram(name: "ff_mov_init_hinting", scope: !968, file: !968, line: 29, type: !969, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2182)
!968 = !DIFile(filename: "libavformat/movenchint.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!969 = !DISubroutineType(types: !970)
!970 = !{!971, !972, !971, !971}
!971 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !975)
!975 = !{!976, !1021, !1132, !1280, !1281, !1346, !1347, !1348, !2039, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2093, !2094, !2095, !2096, !2097, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2148, !2149, !2152, !2153, !2154, !2155, !2156, !2157, !2159, !2160, !2161, !2162, !2170, !2171, !2175, !2179, !2180, !2181}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !974, file: !897, line: 1342, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !981)
!981 = !{!982, !986, !991, !995, !996, !997, !998, !1002, !1008, !1010, !1014}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !980, file: !4, line: 72, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!985 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !980, file: !4, line: 78, baseType: !987, size: 64, align: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!983, !990}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !980, file: !4, line: 85, baseType: !992, size: 64, align: 64, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !980, file: !4, line: 93, baseType: !971, size: 32, align: 32, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !980, file: !4, line: 99, baseType: !971, size: 32, align: 32, offset: 224)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !980, file: !4, line: 108, baseType: !971, size: 32, align: 32, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !980, file: !4, line: 113, baseType: !999, size: 64, align: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!990, !990, !990}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !980, file: !4, line: 123, baseType: !1003, size: 64, align: 64, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!1006, !1006}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !980, file: !4, line: 130, baseType: !1009, size: 32, align: 32, offset: 448)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !980, file: !4, line: 136, baseType: !1011, size: 64, align: 64, offset: 512)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!1009, !990}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !980, file: !4, line: 142, baseType: !1015, size: 64, align: 64, offset: 576)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!971, !1018, !990, !983, !971}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !974, file: !897, line: 1349, baseType: !1022, size: 64, align: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1039, !1040, !1041, !1042, !1043, !1044, !1058, !1063, !1103, !1104, !1108, !1113, !1114, !1115, !1119, !1125, !1131}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1023, file: !897, line: 638, baseType: !983, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1023, file: !897, line: 645, baseType: !983, size: 64, align: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1023, file: !897, line: 652, baseType: !971, size: 32, align: 32, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1023, file: !897, line: 659, baseType: !983, size: 64, align: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1023, file: !897, line: 661, baseType: !1030, size: 64, align: 64, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1035, line: 44, size: 64, align: 32, elements: !1036)
!1035 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1036 = !{!1037, !1038}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1034, file: !1035, line: 45, baseType: !24, size: 32, align: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1034, file: !1035, line: 46, baseType: !946, size: 32, align: 32, offset: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1023, file: !897, line: 663, baseType: !977, size: 64, align: 64, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1023, file: !897, line: 670, baseType: !983, size: 64, align: 64, offset: 384)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1023, file: !897, line: 679, baseType: !1022, size: 64, align: 64, offset: 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1023, file: !897, line: 684, baseType: !971, size: 32, align: 32, offset: 512)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1023, file: !897, line: 689, baseType: !971, size: 32, align: 32, offset: 544)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1023, file: !897, line: 696, baseType: !1045, size: 64, align: 64, offset: 576)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!971, !1048}
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1051)
!1051 = !{!1052, !1053, !1056, !1057}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1050, file: !897, line: 449, baseType: !983, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1050, file: !897, line: 450, baseType: !1054, size: 64, align: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1050, file: !897, line: 451, baseType: !971, size: 32, align: 32, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1050, file: !897, line: 452, baseType: !983, size: 64, align: 64, offset: 192)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1023, file: !897, line: 703, baseType: !1059, size: 64, align: 64, offset: 640)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!971, !1062}
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1023, file: !897, line: 714, baseType: !1064, size: 64, align: 64, offset: 704)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!971, !1062, !1067}
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !25, line: 1499, baseType: !1069)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !25, line: 1445, size: 704, align: 64, elements: !1070)
!1070 = !{!1071, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1099, !1100, !1101, !1102}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1069, file: !25, line: 1451, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1074, line: 94, baseType: !1075)
!1074 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1074, line: 81, size: 192, align: 64, elements: !1076)
!1076 = !{!1077, !1081, !1084}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1075, file: !1074, line: 82, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1074, line: 73, baseType: !1080)
!1080 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1074, line: 73, flags: DIFlagFwdDecl)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1075, file: !1074, line: 89, baseType: !1082, size: 64, align: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !954, line: 48, baseType: !1055)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1075, file: !1074, line: 93, baseType: !971, size: 32, align: 32, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1069, file: !25, line: 1461, baseType: !962, size: 64, align: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1069, file: !25, line: 1467, baseType: !962, size: 64, align: 64, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1069, file: !25, line: 1468, baseType: !1082, size: 64, align: 64, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1069, file: !25, line: 1469, baseType: !971, size: 32, align: 32, offset: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1069, file: !25, line: 1470, baseType: !971, size: 32, align: 32, offset: 288)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1069, file: !25, line: 1474, baseType: !971, size: 32, align: 32, offset: 320)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1069, file: !25, line: 1479, baseType: !1092, size: 64, align: 64, offset: 384)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !25, line: 1415, baseType: !1094)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !25, line: 1411, size: 128, align: 64, elements: !1095)
!1095 = !{!1096, !1097, !1098}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1094, file: !25, line: 1412, baseType: !1082, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1094, file: !25, line: 1413, baseType: !971, size: 32, align: 32, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1094, file: !25, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1069, file: !25, line: 1480, baseType: !971, size: 32, align: 32, offset: 448)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1069, file: !25, line: 1486, baseType: !962, size: 64, align: 64, offset: 512)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1069, file: !25, line: 1488, baseType: !962, size: 64, align: 64, offset: 576)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1069, file: !25, line: 1497, baseType: !962, size: 64, align: 64, offset: 640)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1023, file: !897, line: 720, baseType: !1059, size: 64, align: 64, offset: 768)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1023, file: !897, line: 730, baseType: !1105, size: 64, align: 64, offset: 832)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!971, !1062, !971, !962, !971}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1023, file: !897, line: 737, baseType: !1109, size: 64, align: 64, offset: 896)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!962, !1062, !971, !1112, !962}
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1023, file: !897, line: 744, baseType: !1059, size: 64, align: 64, offset: 960)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1023, file: !897, line: 750, baseType: !1059, size: 64, align: 64, offset: 1024)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1023, file: !897, line: 758, baseType: !1116, size: 64, align: 64, offset: 1088)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!971, !1062, !971, !962, !962, !962, !971}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1023, file: !897, line: 764, baseType: !1120, size: 64, align: 64, offset: 1152)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!971, !1062, !1123}
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1023, file: !897, line: 770, baseType: !1126, size: 64, align: 64, offset: 1216)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!971, !1062, !1129}
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1023, file: !897, line: 776, baseType: !1126, size: 64, align: 64, offset: 1280)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !974, file: !897, line: 1356, baseType: !1133, size: 64, align: 64, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1135)
!1135 = !{!1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1155, !1159, !1163, !1170, !1265, !1266, !1267, !1268, !1269, !1270, !1274}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1134, file: !897, line: 498, baseType: !983, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1134, file: !897, line: 504, baseType: !983, size: 64, align: 64, offset: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1134, file: !897, line: 505, baseType: !983, size: 64, align: 64, offset: 128)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1134, file: !897, line: 506, baseType: !983, size: 64, align: 64, offset: 192)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1134, file: !897, line: 508, baseType: !24, size: 32, align: 32, offset: 256)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1134, file: !897, line: 509, baseType: !24, size: 32, align: 32, offset: 288)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1134, file: !897, line: 510, baseType: !24, size: 32, align: 32, offset: 320)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1134, file: !897, line: 517, baseType: !971, size: 32, align: 32, offset: 352)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1134, file: !897, line: 523, baseType: !1030, size: 64, align: 64, offset: 384)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1134, file: !897, line: 526, baseType: !977, size: 64, align: 64, offset: 448)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1134, file: !897, line: 535, baseType: !1133, size: 64, align: 64, offset: 512)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1134, file: !897, line: 539, baseType: !971, size: 32, align: 32, offset: 576)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1134, file: !897, line: 541, baseType: !1059, size: 64, align: 64, offset: 640)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1134, file: !897, line: 549, baseType: !1064, size: 64, align: 64, offset: 704)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1134, file: !897, line: 550, baseType: !1059, size: 64, align: 64, offset: 768)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1134, file: !897, line: 554, baseType: !1152, size: 64, align: 64, offset: 832)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!971, !1062, !1067, !1067, !971}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1134, file: !897, line: 563, baseType: !1156, size: 64, align: 64, offset: 896)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!971, !24, !971}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1134, file: !897, line: 565, baseType: !1160, size: 64, align: 64, offset: 960)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{null, !1062, !971, !1112, !1112}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1134, file: !897, line: 570, baseType: !1164, size: 64, align: 64, offset: 1024)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!971, !1062, !971, !990, !1167}
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1168, line: 216, baseType: !1169)
!1168 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1169 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1134, file: !897, line: 581, baseType: !1171, size: 64, align: 64, offset: 1088)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!971, !1062, !971, !1174, !946}
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1178)
!1178 = !{!1179, !1183, !1185, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1219, !1221, !1222, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1177, file: !526, line: 282, baseType: !1180, size: 512, align: 64)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1082, size: 512, align: 64, elements: !1181)
!1181 = !{!1182}
!1182 = !DISubrange(count: 8)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1177, file: !526, line: 299, baseType: !1184, size: 256, align: 32, offset: 512)
!1184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 256, align: 32, elements: !1181)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1177, file: !526, line: 315, baseType: !1186, size: 64, align: 64, offset: 768)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1177, file: !526, line: 326, baseType: !971, size: 32, align: 32, offset: 832)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1177, file: !526, line: 326, baseType: !971, size: 32, align: 32, offset: 864)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1177, file: !526, line: 334, baseType: !971, size: 32, align: 32, offset: 896)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1177, file: !526, line: 341, baseType: !971, size: 32, align: 32, offset: 928)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1177, file: !526, line: 346, baseType: !971, size: 32, align: 32, offset: 960)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1177, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1177, file: !526, line: 356, baseType: !1194, size: 64, align: 32, offset: 1024)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1195, line: 61, baseType: !1196)
!1195 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1195, line: 58, size: 64, align: 32, elements: !1197)
!1197 = !{!1198, !1199}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1196, file: !1195, line: 59, baseType: !971, size: 32, align: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1196, file: !1195, line: 60, baseType: !971, size: 32, align: 32, offset: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1177, file: !526, line: 361, baseType: !962, size: 64, align: 64, offset: 1088)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1177, file: !526, line: 369, baseType: !962, size: 64, align: 64, offset: 1152)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1177, file: !526, line: 377, baseType: !962, size: 64, align: 64, offset: 1216)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1177, file: !526, line: 382, baseType: !971, size: 32, align: 32, offset: 1280)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1177, file: !526, line: 386, baseType: !971, size: 32, align: 32, offset: 1312)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1177, file: !526, line: 391, baseType: !971, size: 32, align: 32, offset: 1344)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1177, file: !526, line: 396, baseType: !990, size: 64, align: 64, offset: 1408)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1177, file: !526, line: 403, baseType: !1208, size: 512, align: 64, offset: 1472)
!1208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1209, size: 512, align: 64, elements: !1181)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !954, line: 55, baseType: !1169)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1177, file: !526, line: 410, baseType: !971, size: 32, align: 32, offset: 1984)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1177, file: !526, line: 415, baseType: !971, size: 32, align: 32, offset: 2016)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1177, file: !526, line: 420, baseType: !971, size: 32, align: 32, offset: 2048)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1177, file: !526, line: 425, baseType: !971, size: 32, align: 32, offset: 2080)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1177, file: !526, line: 435, baseType: !962, size: 64, align: 64, offset: 2112)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1177, file: !526, line: 440, baseType: !971, size: 32, align: 32, offset: 2176)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1177, file: !526, line: 445, baseType: !1209, size: 64, align: 64, offset: 2240)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1177, file: !526, line: 459, baseType: !1218, size: 512, align: 64, offset: 2304)
!1218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 512, align: 64, elements: !1181)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1177, file: !526, line: 473, baseType: !1220, size: 64, align: 64, offset: 2816)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1177, file: !526, line: 477, baseType: !971, size: 32, align: 32, offset: 2880)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1177, file: !526, line: 479, baseType: !1223, size: 64, align: 64, offset: 2944)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1227)
!1227 = !{!1228, !1229, !1230, !1231, !1236}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1226, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1226, file: !526, line: 203, baseType: !1082, size: 64, align: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1226, file: !526, line: 204, baseType: !971, size: 32, align: 32, offset: 128)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1226, file: !526, line: 205, baseType: !1232, size: 64, align: 64, offset: 192)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1234, line: 86, baseType: !1235)
!1234 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1235 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1234, line: 86, flags: DIFlagFwdDecl)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1226, file: !526, line: 206, baseType: !1072, size: 64, align: 64, offset: 256)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1177, file: !526, line: 480, baseType: !971, size: 32, align: 32, offset: 3008)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1177, file: !526, line: 505, baseType: !971, size: 32, align: 32, offset: 3040)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1177, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1177, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1177, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1177, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1177, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1177, file: !526, line: 532, baseType: !962, size: 64, align: 64, offset: 3264)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1177, file: !526, line: 539, baseType: !962, size: 64, align: 64, offset: 3328)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1177, file: !526, line: 547, baseType: !962, size: 64, align: 64, offset: 3392)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1177, file: !526, line: 554, baseType: !1232, size: 64, align: 64, offset: 3456)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1177, file: !526, line: 563, baseType: !971, size: 32, align: 32, offset: 3520)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1177, file: !526, line: 572, baseType: !971, size: 32, align: 32, offset: 3552)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1177, file: !526, line: 581, baseType: !971, size: 32, align: 32, offset: 3584)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1177, file: !526, line: 588, baseType: !1252, size: 64, align: 64, offset: 3648)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !954, line: 36, baseType: !1254)
!1254 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1177, file: !526, line: 593, baseType: !971, size: 32, align: 32, offset: 3712)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1177, file: !526, line: 596, baseType: !971, size: 32, align: 32, offset: 3744)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1177, file: !526, line: 599, baseType: !1072, size: 64, align: 64, offset: 3776)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1177, file: !526, line: 605, baseType: !1072, size: 64, align: 64, offset: 3840)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1177, file: !526, line: 616, baseType: !1072, size: 64, align: 64, offset: 3904)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1177, file: !526, line: 626, baseType: !1167, size: 64, align: 64, offset: 3968)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1177, file: !526, line: 627, baseType: !1167, size: 64, align: 64, offset: 4032)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1177, file: !526, line: 628, baseType: !1167, size: 64, align: 64, offset: 4096)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1177, file: !526, line: 629, baseType: !1167, size: 64, align: 64, offset: 4160)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1177, file: !526, line: 645, baseType: !1072, size: 64, align: 64, offset: 4224)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1134, file: !897, line: 587, baseType: !1120, size: 64, align: 64, offset: 1152)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1134, file: !897, line: 592, baseType: !1126, size: 64, align: 64, offset: 1216)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1134, file: !897, line: 597, baseType: !1126, size: 64, align: 64, offset: 1280)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1134, file: !897, line: 598, baseType: !24, size: 32, align: 32, offset: 1344)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1134, file: !897, line: 608, baseType: !1059, size: 64, align: 64, offset: 1408)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1134, file: !897, line: 617, baseType: !1271, size: 64, align: 64, offset: 1472)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{null, !1062}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1134, file: !897, line: 623, baseType: !1275, size: 64, align: 64, offset: 1536)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!971, !1062, !1278}
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1068)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !974, file: !897, line: 1365, baseType: !990, size: 64, align: 64, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !974, file: !897, line: 1379, baseType: !1282, size: 64, align: 64, offset: 256)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1284)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1285)
!1285 = !{!1286, !1287, !1288, !1289, !1290, !1291, !1292, !1296, !1297, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1313, !1314, !1318, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1336, !1337, !1338, !1339, !1343, !1344, !1345}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1284, file: !628, line: 174, baseType: !977, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1284, file: !628, line: 226, baseType: !1054, size: 64, align: 64, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1284, file: !628, line: 227, baseType: !971, size: 32, align: 32, offset: 128)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1284, file: !628, line: 228, baseType: !1054, size: 64, align: 64, offset: 192)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1284, file: !628, line: 229, baseType: !1054, size: 64, align: 64, offset: 256)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1284, file: !628, line: 233, baseType: !990, size: 64, align: 64, offset: 320)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1284, file: !628, line: 235, baseType: !1293, size: 64, align: 64, offset: 384)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!971, !990, !1082, !971}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1284, file: !628, line: 236, baseType: !1293, size: 64, align: 64, offset: 448)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1284, file: !628, line: 237, baseType: !1298, size: 64, align: 64, offset: 512)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!962, !990, !962, !971}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1284, file: !628, line: 238, baseType: !962, size: 64, align: 64, offset: 576)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1284, file: !628, line: 239, baseType: !971, size: 32, align: 32, offset: 640)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1284, file: !628, line: 240, baseType: !971, size: 32, align: 32, offset: 672)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1284, file: !628, line: 241, baseType: !971, size: 32, align: 32, offset: 704)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1284, file: !628, line: 242, baseType: !1169, size: 64, align: 64, offset: 768)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1284, file: !628, line: 243, baseType: !1054, size: 64, align: 64, offset: 832)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1284, file: !628, line: 244, baseType: !1308, size: 64, align: 64, offset: 896)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!1169, !1169, !1311, !946}
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1083)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1284, file: !628, line: 245, baseType: !971, size: 32, align: 32, offset: 960)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1284, file: !628, line: 249, baseType: !1315, size: 64, align: 64, offset: 1024)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!971, !990, !971}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1284, file: !628, line: 255, baseType: !1319, size: 64, align: 64, offset: 1088)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!962, !990, !971, !962, !971}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1284, file: !628, line: 260, baseType: !971, size: 32, align: 32, offset: 1152)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1284, file: !628, line: 266, baseType: !962, size: 64, align: 64, offset: 1216)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1284, file: !628, line: 273, baseType: !971, size: 32, align: 32, offset: 1280)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1284, file: !628, line: 279, baseType: !962, size: 64, align: 64, offset: 1344)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1284, file: !628, line: 285, baseType: !971, size: 32, align: 32, offset: 1408)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1284, file: !628, line: 291, baseType: !971, size: 32, align: 32, offset: 1440)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1284, file: !628, line: 298, baseType: !971, size: 32, align: 32, offset: 1472)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1284, file: !628, line: 304, baseType: !971, size: 32, align: 32, offset: 1504)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1284, file: !628, line: 309, baseType: !983, size: 64, align: 64, offset: 1536)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1284, file: !628, line: 314, baseType: !983, size: 64, align: 64, offset: 1600)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1284, file: !628, line: 319, baseType: !1333, size: 64, align: 64, offset: 1664)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{!971, !990, !1082, !971, !627, !962}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1284, file: !628, line: 326, baseType: !971, size: 32, align: 32, offset: 1728)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1284, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1284, file: !628, line: 332, baseType: !962, size: 64, align: 64, offset: 1792)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1284, file: !628, line: 338, baseType: !1340, size: 64, align: 64, offset: 1856)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!971, !990}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1284, file: !628, line: 340, baseType: !962, size: 64, align: 64, offset: 1920)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1284, file: !628, line: 346, baseType: !1054, size: 64, align: 64, offset: 1984)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1284, file: !628, line: 351, baseType: !971, size: 32, align: 32, offset: 2048)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !974, file: !897, line: 1386, baseType: !971, size: 32, align: 32, offset: 320)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !974, file: !897, line: 1393, baseType: !946, size: 32, align: 32, offset: 352)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !974, file: !897, line: 1405, baseType: !1349, size: 64, align: 64, offset: 384)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1352)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1353)
!1353 = !{!1354, !1355, !1356, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1824, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1925, !1931, !1932, !1936, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1968, !1969, !1970, !1971, !1972, !1973}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1352, file: !897, line: 866, baseType: !971, size: 32, align: 32)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1352, file: !897, line: 872, baseType: !971, size: 32, align: 32, offset: 32)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1352, file: !897, line: 878, baseType: !1357, size: 64, align: 64, offset: 64)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !25, line: 3360, baseType: !1359)
!1359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !25, line: 1556, size: 8448, align: 64, elements: !1360)
!1360 = !{!1361, !1362, !1363, !1364, !1499, !1500, !1501, !1502, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1528, !1532, !1533, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1712, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1359, file: !25, line: 1561, baseType: !977, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1359, file: !25, line: 1562, baseType: !971, size: 32, align: 32, offset: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1359, file: !25, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1359, file: !25, line: 1565, baseType: !1365, size: 64, align: 64, offset: 128)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1367)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !25, line: 3468, size: 1984, align: 64, elements: !1368)
!1368 = !{!1369, !1370, !1371, !1372, !1373, !1374, !1377, !1380, !1383, !1386, !1389, !1390, !1391, !1399, !1400, !1401, !1403, !1407, !1413, !1418, !1422, !1423, !1464, !1471, !1475, !1476, !1480, !1484, !1488, !1492, !1493, !1494}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1367, file: !25, line: 3475, baseType: !983, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1367, file: !25, line: 3480, baseType: !983, size: 64, align: 64, offset: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1367, file: !25, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1367, file: !25, line: 3482, baseType: !24, size: 32, align: 32, offset: 160)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1367, file: !25, line: 3487, baseType: !971, size: 32, align: 32, offset: 192)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1367, file: !25, line: 3488, baseType: !1375, size: 64, align: 64, offset: 256)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1194)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1367, file: !25, line: 3489, baseType: !1378, size: 64, align: 64, offset: 320)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1367, file: !25, line: 3490, baseType: !1381, size: 64, align: 64, offset: 384)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1367, file: !25, line: 3491, baseType: !1384, size: 64, align: 64, offset: 448)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1367, file: !25, line: 3492, baseType: !1387, size: 64, align: 64, offset: 512)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1209)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1367, file: !25, line: 3493, baseType: !1083, size: 8, align: 8, offset: 576)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1367, file: !25, line: 3494, baseType: !977, size: 64, align: 64, offset: 640)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1367, file: !25, line: 3495, baseType: !1392, size: 64, align: 64, offset: 704)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1394)
!1394 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !25, line: 3404, baseType: !1395)
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !25, line: 3401, size: 128, align: 64, elements: !1396)
!1396 = !{!1397, !1398}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1395, file: !25, line: 3402, baseType: !971, size: 32, align: 32)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1395, file: !25, line: 3403, baseType: !983, size: 64, align: 64, offset: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1367, file: !25, line: 3507, baseType: !983, size: 64, align: 64, offset: 768)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1367, file: !25, line: 3516, baseType: !971, size: 32, align: 32, offset: 832)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1367, file: !25, line: 3517, baseType: !1402, size: 64, align: 64, offset: 896)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1367, file: !25, line: 3527, baseType: !1404, size: 64, align: 64, offset: 960)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DISubroutineType(types: !1406)
!1406 = !{!971, !1357}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1367, file: !25, line: 3535, baseType: !1408, size: 64, align: 64, offset: 1024)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DISubroutineType(types: !1410)
!1410 = !{!971, !1357, !1411}
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1358)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1367, file: !25, line: 3541, baseType: !1414, size: 64, align: 64, offset: 1088)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1416)
!1416 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !25, line: 3461, baseType: !1417)
!1417 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !25, line: 3461, flags: DIFlagFwdDecl)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1367, file: !25, line: 3549, baseType: !1419, size: 64, align: 64, offset: 1152)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DISubroutineType(types: !1421)
!1421 = !{null, !1402}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1367, file: !25, line: 3551, baseType: !1404, size: 64, align: 64, offset: 1216)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1367, file: !25, line: 3552, baseType: !1424, size: 64, align: 64, offset: 1280)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DISubroutineType(types: !1426)
!1426 = !{!971, !1357, !1082, !971, !1427}
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1429)
!1429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !25, line: 3920, size: 256, align: 64, elements: !1430)
!1430 = !{!1431, !1432, !1433, !1434, !1435, !1463}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1429, file: !25, line: 3921, baseType: !960, size: 16, align: 16)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1429, file: !25, line: 3922, baseType: !953, size: 32, align: 32, offset: 32)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1429, file: !25, line: 3923, baseType: !953, size: 32, align: 32, offset: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1429, file: !25, line: 3924, baseType: !946, size: 32, align: 32, offset: 96)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1429, file: !25, line: 3925, baseType: !1436, size: 64, align: 64, offset: 128)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !25, line: 3918, baseType: !1439)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !25, line: 3885, size: 1600, align: 64, elements: !1440)
!1440 = !{!1441, !1442, !1443, !1444, !1445, !1446, !1452, !1456, !1458, !1459, !1461, !1462}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1439, file: !25, line: 3886, baseType: !971, size: 32, align: 32)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1439, file: !25, line: 3887, baseType: !971, size: 32, align: 32, offset: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1439, file: !25, line: 3888, baseType: !971, size: 32, align: 32, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1439, file: !25, line: 3889, baseType: !971, size: 32, align: 32, offset: 96)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1439, file: !25, line: 3890, baseType: !971, size: 32, align: 32, offset: 128)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1439, file: !25, line: 3897, baseType: !1447, size: 768, align: 64, offset: 192)
!1447 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !25, line: 3858, baseType: !1448)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !25, line: 3853, size: 768, align: 64, elements: !1449)
!1449 = !{!1450, !1451}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1448, file: !25, line: 3855, baseType: !1180, size: 512, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1448, file: !25, line: 3857, baseType: !1184, size: 256, align: 32, offset: 512)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1439, file: !25, line: 3903, baseType: !1453, size: 256, align: 64, offset: 960)
!1453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1082, size: 256, align: 64, elements: !1454)
!1454 = !{!1455}
!1455 = !DISubrange(count: 4)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1439, file: !25, line: 3904, baseType: !1457, size: 128, align: 32, offset: 1216)
!1457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 128, align: 32, elements: !1454)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1439, file: !25, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1439, file: !25, line: 3908, baseType: !1460, size: 64, align: 64, offset: 1408)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1439, file: !25, line: 3915, baseType: !1460, size: 64, align: 64, offset: 1472)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1439, file: !25, line: 3917, baseType: !971, size: 32, align: 32, offset: 1536)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1429, file: !25, line: 3926, baseType: !962, size: 64, align: 64, offset: 192)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1367, file: !25, line: 3564, baseType: !1465, size: 64, align: 64, offset: 1344)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!971, !1357, !1067, !1468, !1470}
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1176)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1367, file: !25, line: 3566, baseType: !1472, size: 64, align: 64, offset: 1408)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{!971, !1357, !990, !1470, !1067}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1367, file: !25, line: 3567, baseType: !1404, size: 64, align: 64, offset: 1472)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1367, file: !25, line: 3576, baseType: !1477, size: 64, align: 64, offset: 1536)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{!971, !1357, !1468}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1367, file: !25, line: 3577, baseType: !1481, size: 64, align: 64, offset: 1600)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{!971, !1357, !1067}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1367, file: !25, line: 3584, baseType: !1485, size: 64, align: 64, offset: 1664)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{!971, !1357, !1175}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1367, file: !25, line: 3589, baseType: !1489, size: 64, align: 64, offset: 1728)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{null, !1357}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1367, file: !25, line: 3594, baseType: !971, size: 32, align: 32, offset: 1792)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1367, file: !25, line: 3600, baseType: !983, size: 64, align: 64, offset: 1856)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1367, file: !25, line: 3609, baseType: !1495, size: 64, align: 64, offset: 1920)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1498)
!1498 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !25, line: 3609, flags: DIFlagFwdDecl)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1359, file: !25, line: 1566, baseType: !24, size: 32, align: 32, offset: 192)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1359, file: !25, line: 1581, baseType: !946, size: 32, align: 32, offset: 224)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1359, file: !25, line: 1583, baseType: !990, size: 64, align: 64, offset: 256)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1359, file: !25, line: 1591, baseType: !1503, size: 64, align: 64, offset: 320)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !25, line: 1532, flags: DIFlagFwdDecl)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1359, file: !25, line: 1598, baseType: !990, size: 64, align: 64, offset: 384)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1359, file: !25, line: 1606, baseType: !962, size: 64, align: 64, offset: 448)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1359, file: !25, line: 1614, baseType: !971, size: 32, align: 32, offset: 512)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1359, file: !25, line: 1622, baseType: !971, size: 32, align: 32, offset: 544)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1359, file: !25, line: 1628, baseType: !971, size: 32, align: 32, offset: 576)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1359, file: !25, line: 1636, baseType: !971, size: 32, align: 32, offset: 608)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1359, file: !25, line: 1643, baseType: !971, size: 32, align: 32, offset: 640)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1359, file: !25, line: 1657, baseType: !1082, size: 64, align: 64, offset: 704)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1359, file: !25, line: 1658, baseType: !971, size: 32, align: 32, offset: 768)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1359, file: !25, line: 1679, baseType: !1194, size: 64, align: 32, offset: 800)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1359, file: !25, line: 1688, baseType: !971, size: 32, align: 32, offset: 864)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1359, file: !25, line: 1712, baseType: !971, size: 32, align: 32, offset: 896)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1359, file: !25, line: 1729, baseType: !971, size: 32, align: 32, offset: 928)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1359, file: !25, line: 1729, baseType: !971, size: 32, align: 32, offset: 960)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1359, file: !25, line: 1744, baseType: !971, size: 32, align: 32, offset: 992)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1359, file: !25, line: 1744, baseType: !971, size: 32, align: 32, offset: 1024)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1359, file: !25, line: 1751, baseType: !971, size: 32, align: 32, offset: 1056)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1359, file: !25, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1359, file: !25, line: 1791, baseType: !1524, size: 64, align: 64, offset: 1152)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DISubroutineType(types: !1526)
!1526 = !{null, !1527, !1468, !1470, !971, !971, !971}
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1359, file: !25, line: 1808, baseType: !1529, size: 64, align: 64, offset: 1216)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!645, !1527, !1378}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1359, file: !25, line: 1816, baseType: !971, size: 32, align: 32, offset: 1280)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1359, file: !25, line: 1825, baseType: !1534, size: 32, align: 32, offset: 1312)
!1534 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1359, file: !25, line: 1830, baseType: !971, size: 32, align: 32, offset: 1344)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1359, file: !25, line: 1838, baseType: !1534, size: 32, align: 32, offset: 1376)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1359, file: !25, line: 1846, baseType: !971, size: 32, align: 32, offset: 1408)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1359, file: !25, line: 1851, baseType: !971, size: 32, align: 32, offset: 1440)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1359, file: !25, line: 1861, baseType: !1534, size: 32, align: 32, offset: 1472)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1359, file: !25, line: 1868, baseType: !1534, size: 32, align: 32, offset: 1504)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1359, file: !25, line: 1875, baseType: !1534, size: 32, align: 32, offset: 1536)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1359, file: !25, line: 1882, baseType: !1534, size: 32, align: 32, offset: 1568)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1359, file: !25, line: 1889, baseType: !1534, size: 32, align: 32, offset: 1600)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1359, file: !25, line: 1896, baseType: !1534, size: 32, align: 32, offset: 1632)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1359, file: !25, line: 1903, baseType: !1534, size: 32, align: 32, offset: 1664)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1359, file: !25, line: 1910, baseType: !971, size: 32, align: 32, offset: 1696)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1359, file: !25, line: 1915, baseType: !971, size: 32, align: 32, offset: 1728)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1359, file: !25, line: 1926, baseType: !1470, size: 64, align: 64, offset: 1792)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1359, file: !25, line: 1935, baseType: !1194, size: 64, align: 32, offset: 1856)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1359, file: !25, line: 1942, baseType: !971, size: 32, align: 32, offset: 1920)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1359, file: !25, line: 1948, baseType: !971, size: 32, align: 32, offset: 1952)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1359, file: !25, line: 1954, baseType: !971, size: 32, align: 32, offset: 1984)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1359, file: !25, line: 1960, baseType: !971, size: 32, align: 32, offset: 2016)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1359, file: !25, line: 1984, baseType: !971, size: 32, align: 32, offset: 2048)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1359, file: !25, line: 1991, baseType: !971, size: 32, align: 32, offset: 2080)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1359, file: !25, line: 1996, baseType: !971, size: 32, align: 32, offset: 2112)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1359, file: !25, line: 2004, baseType: !971, size: 32, align: 32, offset: 2144)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1359, file: !25, line: 2011, baseType: !971, size: 32, align: 32, offset: 2176)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1359, file: !25, line: 2018, baseType: !971, size: 32, align: 32, offset: 2208)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1359, file: !25, line: 2027, baseType: !971, size: 32, align: 32, offset: 2240)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1359, file: !25, line: 2034, baseType: !971, size: 32, align: 32, offset: 2272)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1359, file: !25, line: 2044, baseType: !971, size: 32, align: 32, offset: 2304)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1359, file: !25, line: 2054, baseType: !1564, size: 64, align: 64, offset: 2368)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1359, file: !25, line: 2061, baseType: !1564, size: 64, align: 64, offset: 2432)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1359, file: !25, line: 2066, baseType: !971, size: 32, align: 32, offset: 2496)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1359, file: !25, line: 2070, baseType: !971, size: 32, align: 32, offset: 2528)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1359, file: !25, line: 2078, baseType: !971, size: 32, align: 32, offset: 2560)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1359, file: !25, line: 2085, baseType: !971, size: 32, align: 32, offset: 2592)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1359, file: !25, line: 2092, baseType: !971, size: 32, align: 32, offset: 2624)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1359, file: !25, line: 2099, baseType: !971, size: 32, align: 32, offset: 2656)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1359, file: !25, line: 2106, baseType: !971, size: 32, align: 32, offset: 2688)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1359, file: !25, line: 2113, baseType: !971, size: 32, align: 32, offset: 2720)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1359, file: !25, line: 2120, baseType: !971, size: 32, align: 32, offset: 2752)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1359, file: !25, line: 2125, baseType: !971, size: 32, align: 32, offset: 2784)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1359, file: !25, line: 2133, baseType: !971, size: 32, align: 32, offset: 2816)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1359, file: !25, line: 2140, baseType: !971, size: 32, align: 32, offset: 2848)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1359, file: !25, line: 2145, baseType: !971, size: 32, align: 32, offset: 2880)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1359, file: !25, line: 2153, baseType: !971, size: 32, align: 32, offset: 2912)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1359, file: !25, line: 2158, baseType: !971, size: 32, align: 32, offset: 2944)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1359, file: !25, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1359, file: !25, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1359, file: !25, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1359, file: !25, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1359, file: !25, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1359, file: !25, line: 2203, baseType: !971, size: 32, align: 32, offset: 3136)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1359, file: !25, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1359, file: !25, line: 2212, baseType: !971, size: 32, align: 32, offset: 3200)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1359, file: !25, line: 2213, baseType: !971, size: 32, align: 32, offset: 3232)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1359, file: !25, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1359, file: !25, line: 2232, baseType: !971, size: 32, align: 32, offset: 3296)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1359, file: !25, line: 2243, baseType: !971, size: 32, align: 32, offset: 3328)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1359, file: !25, line: 2249, baseType: !971, size: 32, align: 32, offset: 3360)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1359, file: !25, line: 2256, baseType: !971, size: 32, align: 32, offset: 3392)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1359, file: !25, line: 2263, baseType: !1209, size: 64, align: 64, offset: 3456)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1359, file: !25, line: 2270, baseType: !1209, size: 64, align: 64, offset: 3520)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1359, file: !25, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1359, file: !25, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1359, file: !25, line: 2367, baseType: !1600, size: 64, align: 64, offset: 3648)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DISubroutineType(types: !1602)
!1602 = !{!971, !1527, !1175, !971}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1359, file: !25, line: 2383, baseType: !971, size: 32, align: 32, offset: 3712)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1359, file: !25, line: 2386, baseType: !1534, size: 32, align: 32, offset: 3744)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1359, file: !25, line: 2387, baseType: !1534, size: 32, align: 32, offset: 3776)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1359, file: !25, line: 2394, baseType: !971, size: 32, align: 32, offset: 3808)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1359, file: !25, line: 2401, baseType: !971, size: 32, align: 32, offset: 3840)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1359, file: !25, line: 2408, baseType: !971, size: 32, align: 32, offset: 3872)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1359, file: !25, line: 2415, baseType: !971, size: 32, align: 32, offset: 3904)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1359, file: !25, line: 2422, baseType: !971, size: 32, align: 32, offset: 3936)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1359, file: !25, line: 2423, baseType: !1612, size: 64, align: 64, offset: 3968)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !25, line: 831, baseType: !1614)
!1614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !25, line: 826, size: 128, align: 32, elements: !1615)
!1615 = !{!1616, !1617, !1618, !1619}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1614, file: !25, line: 827, baseType: !971, size: 32, align: 32)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1614, file: !25, line: 828, baseType: !971, size: 32, align: 32, offset: 32)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1614, file: !25, line: 829, baseType: !971, size: 32, align: 32, offset: 64)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1614, file: !25, line: 830, baseType: !1534, size: 32, align: 32, offset: 96)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1359, file: !25, line: 2430, baseType: !962, size: 64, align: 64, offset: 4032)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1359, file: !25, line: 2437, baseType: !962, size: 64, align: 64, offset: 4096)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1359, file: !25, line: 2444, baseType: !1534, size: 32, align: 32, offset: 4160)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1359, file: !25, line: 2451, baseType: !1534, size: 32, align: 32, offset: 4192)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1359, file: !25, line: 2458, baseType: !971, size: 32, align: 32, offset: 4224)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1359, file: !25, line: 2469, baseType: !971, size: 32, align: 32, offset: 4256)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1359, file: !25, line: 2475, baseType: !971, size: 32, align: 32, offset: 4288)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1359, file: !25, line: 2481, baseType: !971, size: 32, align: 32, offset: 4320)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1359, file: !25, line: 2485, baseType: !971, size: 32, align: 32, offset: 4352)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1359, file: !25, line: 2489, baseType: !971, size: 32, align: 32, offset: 4384)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1359, file: !25, line: 2493, baseType: !971, size: 32, align: 32, offset: 4416)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1359, file: !25, line: 2501, baseType: !971, size: 32, align: 32, offset: 4448)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1359, file: !25, line: 2506, baseType: !971, size: 32, align: 32, offset: 4480)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1359, file: !25, line: 2510, baseType: !971, size: 32, align: 32, offset: 4512)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1359, file: !25, line: 2514, baseType: !962, size: 64, align: 64, offset: 4544)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1359, file: !25, line: 2528, baseType: !1636, size: 64, align: 64, offset: 4608)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DISubroutineType(types: !1638)
!1638 = !{null, !1527, !990, !971, !971}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1359, file: !25, line: 2534, baseType: !971, size: 32, align: 32, offset: 4672)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1359, file: !25, line: 2545, baseType: !971, size: 32, align: 32, offset: 4704)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1359, file: !25, line: 2547, baseType: !971, size: 32, align: 32, offset: 4736)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1359, file: !25, line: 2549, baseType: !971, size: 32, align: 32, offset: 4768)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1359, file: !25, line: 2551, baseType: !971, size: 32, align: 32, offset: 4800)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1359, file: !25, line: 2553, baseType: !971, size: 32, align: 32, offset: 4832)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1359, file: !25, line: 2555, baseType: !971, size: 32, align: 32, offset: 4864)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1359, file: !25, line: 2557, baseType: !971, size: 32, align: 32, offset: 4896)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1359, file: !25, line: 2559, baseType: !971, size: 32, align: 32, offset: 4928)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1359, file: !25, line: 2563, baseType: !971, size: 32, align: 32, offset: 4960)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1359, file: !25, line: 2571, baseType: !1460, size: 64, align: 64, offset: 4992)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1359, file: !25, line: 2579, baseType: !1460, size: 64, align: 64, offset: 5056)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1359, file: !25, line: 2586, baseType: !971, size: 32, align: 32, offset: 5120)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1359, file: !25, line: 2615, baseType: !971, size: 32, align: 32, offset: 5152)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1359, file: !25, line: 2627, baseType: !971, size: 32, align: 32, offset: 5184)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1359, file: !25, line: 2637, baseType: !971, size: 32, align: 32, offset: 5216)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1359, file: !25, line: 2681, baseType: !971, size: 32, align: 32, offset: 5248)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1359, file: !25, line: 2709, baseType: !962, size: 64, align: 64, offset: 5312)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1359, file: !25, line: 2716, baseType: !1658, size: 64, align: 64, offset: 5376)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1660)
!1660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !25, line: 3636, size: 896, align: 64, elements: !1661)
!1661 = !{!1662, !1663, !1664, !1665, !1666, !1667, !1668, !1672, !1676, !1677, !1678, !1679, !1685, !1686, !1687, !1688, !1689}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1660, file: !25, line: 3642, baseType: !983, size: 64, align: 64)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1660, file: !25, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1660, file: !25, line: 3656, baseType: !24, size: 32, align: 32, offset: 96)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1660, file: !25, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1660, file: !25, line: 3669, baseType: !971, size: 32, align: 32, offset: 160)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1660, file: !25, line: 3682, baseType: !1485, size: 64, align: 64, offset: 192)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1660, file: !25, line: 3698, baseType: !1669, size: 64, align: 64, offset: 256)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DISubroutineType(types: !1671)
!1671 = !{!971, !1357, !1311, !953}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1660, file: !25, line: 3712, baseType: !1673, size: 64, align: 64, offset: 320)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DISubroutineType(types: !1675)
!1675 = !{!971, !1357, !971, !1311, !953}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1660, file: !25, line: 3726, baseType: !1669, size: 64, align: 64, offset: 384)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1660, file: !25, line: 3737, baseType: !1404, size: 64, align: 64, offset: 448)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1660, file: !25, line: 3746, baseType: !971, size: 32, align: 32, offset: 512)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1660, file: !25, line: 3757, baseType: !1680, size: 64, align: 64, offset: 576)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{null, !1683}
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !25, line: 3617, flags: DIFlagFwdDecl)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1660, file: !25, line: 3766, baseType: !1404, size: 64, align: 64, offset: 640)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1660, file: !25, line: 3774, baseType: !1404, size: 64, align: 64, offset: 704)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1660, file: !25, line: 3780, baseType: !971, size: 32, align: 32, offset: 768)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1660, file: !25, line: 3785, baseType: !971, size: 32, align: 32, offset: 800)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1660, file: !25, line: 3795, baseType: !1690, size: 64, align: 64, offset: 832)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DISubroutineType(types: !1692)
!1692 = !{!971, !1357, !1072}
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1359, file: !25, line: 2728, baseType: !990, size: 64, align: 64, offset: 5440)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1359, file: !25, line: 2735, baseType: !1208, size: 512, align: 64, offset: 5504)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1359, file: !25, line: 2742, baseType: !971, size: 32, align: 32, offset: 6016)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1359, file: !25, line: 2755, baseType: !971, size: 32, align: 32, offset: 6048)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1359, file: !25, line: 2776, baseType: !971, size: 32, align: 32, offset: 6080)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1359, file: !25, line: 2783, baseType: !971, size: 32, align: 32, offset: 6112)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1359, file: !25, line: 2791, baseType: !971, size: 32, align: 32, offset: 6144)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1359, file: !25, line: 2802, baseType: !1175, size: 64, align: 64, offset: 6208)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1359, file: !25, line: 2811, baseType: !971, size: 32, align: 32, offset: 6272)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1359, file: !25, line: 2821, baseType: !971, size: 32, align: 32, offset: 6304)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1359, file: !25, line: 2830, baseType: !971, size: 32, align: 32, offset: 6336)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1359, file: !25, line: 2840, baseType: !971, size: 32, align: 32, offset: 6368)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1359, file: !25, line: 2851, baseType: !1706, size: 64, align: 64, offset: 6400)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DISubroutineType(types: !1708)
!1708 = !{!971, !1527, !1709, !990, !1470, !971, !971}
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DISubroutineType(types: !1711)
!1711 = !{!971, !1527, !990}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1359, file: !25, line: 2871, baseType: !1713, size: 64, align: 64, offset: 6464)
!1713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1714, size: 64, align: 64)
!1714 = !DISubroutineType(types: !1715)
!1715 = !{!971, !1527, !1716, !990, !1470, !971}
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1717 = !DISubroutineType(types: !1718)
!1718 = !{!971, !1527, !990, !971, !971}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1359, file: !25, line: 2878, baseType: !971, size: 32, align: 32, offset: 6528)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1359, file: !25, line: 2885, baseType: !971, size: 32, align: 32, offset: 6560)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1359, file: !25, line: 3005, baseType: !971, size: 32, align: 32, offset: 6592)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1359, file: !25, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1359, file: !25, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1359, file: !25, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1359, file: !25, line: 3037, baseType: !1082, size: 64, align: 64, offset: 6720)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1359, file: !25, line: 3038, baseType: !971, size: 32, align: 32, offset: 6784)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1359, file: !25, line: 3050, baseType: !1209, size: 64, align: 64, offset: 6848)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1359, file: !25, line: 3065, baseType: !971, size: 32, align: 32, offset: 6912)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1359, file: !25, line: 3083, baseType: !971, size: 32, align: 32, offset: 6944)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1359, file: !25, line: 3092, baseType: !1194, size: 64, align: 32, offset: 6976)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1359, file: !25, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1359, file: !25, line: 3106, baseType: !1194, size: 64, align: 32, offset: 7072)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1359, file: !25, line: 3113, baseType: !1734, size: 64, align: 64, offset: 7168)
!1734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1735, size: 64, align: 64)
!1735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1736)
!1736 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !25, line: 740, baseType: !1737)
!1737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !25, line: 712, size: 384, align: 64, elements: !1738)
!1738 = !{!1739, !1740, !1741, !1742, !1743, !1744, !1747}
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1737, file: !25, line: 713, baseType: !24, size: 32, align: 32)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1737, file: !25, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1737, file: !25, line: 720, baseType: !983, size: 64, align: 64, offset: 64)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1737, file: !25, line: 724, baseType: !983, size: 64, align: 64, offset: 128)
