; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--dvbsub.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--dvbsub.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!883 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !47, line: 3865, size: 32, align: 32, elements: !884)
!884 = !{!885, !886, !887, !888}
!885 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!886 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!887 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!888 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !47, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !47, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !47, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !47, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !{!939}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !942, line: 222, size: 16, align: 8, elements: !943)
!942 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!943 = !{!944}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !941, file: !942, line: 222, baseType: !945, size: 16, align: 16)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !946, line: 49, baseType: !947)
!946 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!947 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!948 = !{!949, !2110}
!949 = distinct !DIGlobalVariable(name: "ff_dvbsub_demuxer", scope: !0, file: !950, line: 70, type: !951, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_dvbsub_demuxer)
!950 = !DIFile(filename: "libavformat/dvbsub.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !953)
!953 = !{!954, !958, !959, !961, !962, !968, !1050, !1051, !1053, !1054, !1055, !1069, !2091, !2092, !2093, !2097, !2101, !2102, !2103, !2107, !2108, !2109}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !952, file: !919, line: 638, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !952, file: !919, line: 645, baseType: !955, size: 64, align: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !952, file: !919, line: 652, baseType: !960, size: 32, align: 32, offset: 128)
!960 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !952, file: !919, line: 659, baseType: !955, size: 64, align: 64, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !952, file: !919, line: 661, baseType: !963, size: 64, align: 64, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !919, line: 443, flags: DIFlagFwdDecl)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !952, file: !919, line: 663, baseType: !969, size: 64, align: 64, offset: 320)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !973)
!973 = !{!974, !975, !980, !1009, !1010, !1011, !1012, !1016, !1022, !1024, !1028}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !972, file: !26, line: 72, baseType: !955, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !972, file: !26, line: 78, baseType: !976, size: 64, align: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!955, !979}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !972, file: !26, line: 85, baseType: !981, size: 64, align: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !1005, !1006, !1007, !1008}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !983, file: !4, line: 247, baseType: !955, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !983, file: !4, line: 253, baseType: !955, size: 64, align: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !983, file: !4, line: 259, baseType: !960, size: 32, align: 32, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !983, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !983, file: !4, line: 271, baseType: !990, size: 64, align: 64, offset: 192)
!990 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !983, file: !4, line: 265, size: 64, align: 64, elements: !991)
!991 = !{!992, !995, !997, !998}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !990, file: !4, line: 266, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !946, line: 40, baseType: !994)
!994 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !990, file: !4, line: 267, baseType: !996, size: 64, align: 64)
!996 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !990, file: !4, line: 268, baseType: !955, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !990, file: !4, line: 270, baseType: !999, size: 64, align: 32)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1000, line: 61, baseType: !1001)
!1000 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1000, line: 58, size: 64, align: 32, elements: !1002)
!1002 = !{!1003, !1004}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1001, file: !1000, line: 59, baseType: !960, size: 32, align: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1001, file: !1000, line: 60, baseType: !960, size: 32, align: 32, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !983, file: !4, line: 272, baseType: !996, size: 64, align: 64, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !983, file: !4, line: 273, baseType: !996, size: 64, align: 64, offset: 320)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !983, file: !4, line: 275, baseType: !960, size: 32, align: 32, offset: 384)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !983, file: !4, line: 300, baseType: !955, size: 64, align: 64, offset: 448)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !972, file: !26, line: 93, baseType: !960, size: 32, align: 32, offset: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !972, file: !26, line: 99, baseType: !960, size: 32, align: 32, offset: 224)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !972, file: !26, line: 108, baseType: !960, size: 32, align: 32, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !972, file: !26, line: 113, baseType: !1013, size: 64, align: 64, offset: 320)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!979, !979, !979}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !972, file: !26, line: 123, baseType: !1017, size: 64, align: 64, offset: 384)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!1020, !1020}
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !972, file: !26, line: 130, baseType: !1023, size: 32, align: 32, offset: 448)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !972, file: !26, line: 136, baseType: !1025, size: 64, align: 64, offset: 512)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!1023, !979}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !972, file: !26, line: 142, baseType: !1029, size: 64, align: 64, offset: 576)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!960, !1032, !979, !955, !960}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1035)
!1035 = !{!1036, !1048, !1049}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1034, file: !4, line: 360, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1041)
!1041 = !{!1042, !1043, !1044, !1045, !1046, !1047}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1040, file: !4, line: 307, baseType: !955, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1040, file: !4, line: 313, baseType: !996, size: 64, align: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1040, file: !4, line: 313, baseType: !996, size: 64, align: 64, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1040, file: !4, line: 318, baseType: !996, size: 64, align: 64, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1040, file: !4, line: 318, baseType: !996, size: 64, align: 64, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1040, file: !4, line: 323, baseType: !960, size: 32, align: 32, offset: 320)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1034, file: !4, line: 364, baseType: !960, size: 32, align: 32, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1034, file: !4, line: 368, baseType: !960, size: 32, align: 32, offset: 96)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !952, file: !919, line: 670, baseType: !955, size: 64, align: 64, offset: 384)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !952, file: !919, line: 679, baseType: !1052, size: 64, align: 64, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !952, file: !919, line: 684, baseType: !960, size: 32, align: 32, offset: 512)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !952, file: !919, line: 689, baseType: !960, size: 32, align: 32, offset: 544)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !952, file: !919, line: 696, baseType: !1056, size: 64, align: 64, offset: 576)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!960, !1059}
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1062)
!1062 = !{!1063, !1064, !1067, !1068}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1061, file: !919, line: 449, baseType: !955, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1061, file: !919, line: 450, baseType: !1065, size: 64, align: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1061, file: !919, line: 451, baseType: !960, size: 32, align: 32, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1061, file: !919, line: 452, baseType: !955, size: 64, align: 64, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !952, file: !919, line: 703, baseType: !1070, size: 64, align: 64, offset: 640)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!960, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1271, !1272, !1337, !1338, !1339, !1968, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2022, !2023, !2024, !2025, !2026, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2057, !2058, !2061, !2062, !2063, !2064, !2065, !2066, !2068, !2069, !2070, !2071, !2079, !2080, !2084, !2088, !2089, !2090}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1074, file: !919, line: 1342, baseType: !969, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1074, file: !919, line: 1349, baseType: !1052, size: 64, align: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1074, file: !919, line: 1356, baseType: !1079, size: 64, align: 64, offset: 128)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1135, !1136, !1140, !1144, !1149, !1156, !1246, !1252, !1258, !1259, !1260, !1261, !1265}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1080, file: !919, line: 498, baseType: !955, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1080, file: !919, line: 504, baseType: !955, size: 64, align: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1080, file: !919, line: 505, baseType: !955, size: 64, align: 64, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1080, file: !919, line: 506, baseType: !955, size: 64, align: 64, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1080, file: !919, line: 508, baseType: !46, size: 32, align: 32, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1080, file: !919, line: 509, baseType: !46, size: 32, align: 32, offset: 288)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1080, file: !919, line: 510, baseType: !46, size: 32, align: 32, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1080, file: !919, line: 517, baseType: !960, size: 32, align: 32, offset: 352)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1080, file: !919, line: 523, baseType: !963, size: 64, align: 64, offset: 384)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1080, file: !919, line: 526, baseType: !969, size: 64, align: 64, offset: 448)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1080, file: !919, line: 535, baseType: !1079, size: 64, align: 64, offset: 512)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1080, file: !919, line: 539, baseType: !960, size: 32, align: 32, offset: 576)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1080, file: !919, line: 541, baseType: !1070, size: 64, align: 64, offset: 640)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1080, file: !919, line: 549, baseType: !1096, size: 64, align: 64, offset: 704)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!960, !1073, !1099}
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !47, line: 1499, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !47, line: 1445, size: 704, align: 64, elements: !1102)
!1102 = !{!1103, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1131, !1132, !1133, !1134}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1101, file: !47, line: 1451, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1106, line: 94, baseType: !1107)
!1106 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1106, line: 81, size: 192, align: 64, elements: !1108)
!1108 = !{!1109, !1113, !1116}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1107, file: !1106, line: 82, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1106, line: 73, baseType: !1112)
!1112 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1106, line: 73, flags: DIFlagFwdDecl)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1107, file: !1106, line: 89, baseType: !1114, size: 64, align: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !946, line: 48, baseType: !1066)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1107, file: !1106, line: 93, baseType: !960, size: 32, align: 32, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1101, file: !47, line: 1461, baseType: !993, size: 64, align: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1101, file: !47, line: 1467, baseType: !993, size: 64, align: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1101, file: !47, line: 1468, baseType: !1114, size: 64, align: 64, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1101, file: !47, line: 1469, baseType: !960, size: 32, align: 32, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1101, file: !47, line: 1470, baseType: !960, size: 32, align: 32, offset: 288)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1101, file: !47, line: 1474, baseType: !960, size: 32, align: 32, offset: 320)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1101, file: !47, line: 1479, baseType: !1124, size: 64, align: 64, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !47, line: 1415, baseType: !1126)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !47, line: 1411, size: 128, align: 64, elements: !1127)
!1127 = !{!1128, !1129, !1130}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1126, file: !47, line: 1412, baseType: !1114, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1126, file: !47, line: 1413, baseType: !960, size: 32, align: 32, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1126, file: !47, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1101, file: !47, line: 1480, baseType: !960, size: 32, align: 32, offset: 448)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1101, file: !47, line: 1486, baseType: !993, size: 64, align: 64, offset: 512)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1101, file: !47, line: 1488, baseType: !993, size: 64, align: 64, offset: 576)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1101, file: !47, line: 1497, baseType: !993, size: 64, align: 64, offset: 640)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1080, file: !919, line: 550, baseType: !1070, size: 64, align: 64, offset: 768)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1080, file: !919, line: 554, baseType: !1137, size: 64, align: 64, offset: 832)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!960, !1073, !1099, !1099, !960}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1080, file: !919, line: 563, baseType: !1141, size: 64, align: 64, offset: 896)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!960, !46, !960}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1080, file: !919, line: 565, baseType: !1145, size: 64, align: 64, offset: 960)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{null, !1073, !960, !1148, !1148}
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1080, file: !919, line: 570, baseType: !1150, size: 64, align: 64, offset: 1024)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!960, !1073, !960, !979, !1153}
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1154, line: 216, baseType: !1155)
!1154 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1155 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1080, file: !919, line: 581, baseType: !1157, size: 64, align: 64, offset: 1088)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!960, !1073, !960, !1160, !1245}
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1164)
!1164 = !{!1165, !1169, !1171, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1199, !1201, !1202, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1163, file: !548, line: 282, baseType: !1166, size: 512, align: 64)
!1166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1114, size: 512, align: 64, elements: !1167)
!1167 = !{!1168}
!1168 = !DISubrange(count: 8)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1163, file: !548, line: 299, baseType: !1170, size: 256, align: 32, offset: 512)
!1170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 256, align: 32, elements: !1167)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1163, file: !548, line: 315, baseType: !1172, size: 64, align: 64, offset: 768)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1163, file: !548, line: 326, baseType: !960, size: 32, align: 32, offset: 832)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1163, file: !548, line: 326, baseType: !960, size: 32, align: 32, offset: 864)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1163, file: !548, line: 334, baseType: !960, size: 32, align: 32, offset: 896)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1163, file: !548, line: 341, baseType: !960, size: 32, align: 32, offset: 928)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1163, file: !548, line: 346, baseType: !960, size: 32, align: 32, offset: 960)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1163, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1163, file: !548, line: 356, baseType: !999, size: 64, align: 32, offset: 1024)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1163, file: !548, line: 361, baseType: !993, size: 64, align: 64, offset: 1088)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1163, file: !548, line: 369, baseType: !993, size: 64, align: 64, offset: 1152)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1163, file: !548, line: 377, baseType: !993, size: 64, align: 64, offset: 1216)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1163, file: !548, line: 382, baseType: !960, size: 32, align: 32, offset: 1280)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1163, file: !548, line: 386, baseType: !960, size: 32, align: 32, offset: 1312)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1163, file: !548, line: 391, baseType: !960, size: 32, align: 32, offset: 1344)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1163, file: !548, line: 396, baseType: !979, size: 64, align: 64, offset: 1408)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1163, file: !548, line: 403, baseType: !1188, size: 512, align: 64, offset: 1472)
!1188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1189, size: 512, align: 64, elements: !1167)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !946, line: 55, baseType: !1155)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1163, file: !548, line: 410, baseType: !960, size: 32, align: 32, offset: 1984)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1163, file: !548, line: 415, baseType: !960, size: 32, align: 32, offset: 2016)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1163, file: !548, line: 420, baseType: !960, size: 32, align: 32, offset: 2048)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1163, file: !548, line: 425, baseType: !960, size: 32, align: 32, offset: 2080)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1163, file: !548, line: 435, baseType: !993, size: 64, align: 64, offset: 2112)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1163, file: !548, line: 440, baseType: !960, size: 32, align: 32, offset: 2176)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1163, file: !548, line: 445, baseType: !1189, size: 64, align: 64, offset: 2240)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1163, file: !548, line: 459, baseType: !1198, size: 512, align: 64, offset: 2304)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1104, size: 512, align: 64, elements: !1167)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1163, file: !548, line: 473, baseType: !1200, size: 64, align: 64, offset: 2816)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1163, file: !548, line: 477, baseType: !960, size: 32, align: 32, offset: 2880)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1163, file: !548, line: 479, baseType: !1203, size: 64, align: 64, offset: 2944)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1206)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1207)
!1207 = !{!1208, !1209, !1210, !1211, !1216}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1206, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1206, file: !548, line: 203, baseType: !1114, size: 64, align: 64, offset: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1206, file: !548, line: 204, baseType: !960, size: 32, align: 32, offset: 128)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1206, file: !548, line: 205, baseType: !1212, size: 64, align: 64, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1214, line: 86, baseType: !1215)
!1214 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1215 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1214, line: 86, flags: DIFlagFwdDecl)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1206, file: !548, line: 206, baseType: !1104, size: 64, align: 64, offset: 256)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1163, file: !548, line: 480, baseType: !960, size: 32, align: 32, offset: 3008)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1163, file: !548, line: 505, baseType: !960, size: 32, align: 32, offset: 3040)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1163, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1163, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1163, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1163, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1163, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1163, file: !548, line: 532, baseType: !993, size: 64, align: 64, offset: 3264)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1163, file: !548, line: 539, baseType: !993, size: 64, align: 64, offset: 3328)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1163, file: !548, line: 547, baseType: !993, size: 64, align: 64, offset: 3392)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1163, file: !548, line: 554, baseType: !1212, size: 64, align: 64, offset: 3456)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1163, file: !548, line: 563, baseType: !960, size: 32, align: 32, offset: 3520)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1163, file: !548, line: 572, baseType: !960, size: 32, align: 32, offset: 3552)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1163, file: !548, line: 581, baseType: !960, size: 32, align: 32, offset: 3584)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1163, file: !548, line: 588, baseType: !1232, size: 64, align: 64, offset: 3648)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !946, line: 36, baseType: !1234)
!1234 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1163, file: !548, line: 593, baseType: !960, size: 32, align: 32, offset: 3712)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1163, file: !548, line: 596, baseType: !960, size: 32, align: 32, offset: 3744)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1163, file: !548, line: 599, baseType: !1104, size: 64, align: 64, offset: 3776)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1163, file: !548, line: 605, baseType: !1104, size: 64, align: 64, offset: 3840)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1163, file: !548, line: 616, baseType: !1104, size: 64, align: 64, offset: 3904)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1163, file: !548, line: 626, baseType: !1153, size: 64, align: 64, offset: 3968)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1163, file: !548, line: 627, baseType: !1153, size: 64, align: 64, offset: 4032)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1163, file: !548, line: 628, baseType: !1153, size: 64, align: 64, offset: 4096)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1163, file: !548, line: 629, baseType: !1153, size: 64, align: 64, offset: 4160)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1163, file: !548, line: 645, baseType: !1104, size: 64, align: 64, offset: 4224)
!1245 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1080, file: !919, line: 587, baseType: !1247, size: 64, align: 64, offset: 1152)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!960, !1073, !1250}
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1080, file: !919, line: 592, baseType: !1253, size: 64, align: 64, offset: 1216)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!960, !1073, !1256}
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1080, file: !919, line: 597, baseType: !1253, size: 64, align: 64, offset: 1280)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1080, file: !919, line: 598, baseType: !46, size: 32, align: 32, offset: 1344)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1080, file: !919, line: 608, baseType: !1070, size: 64, align: 64, offset: 1408)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1080, file: !919, line: 617, baseType: !1262, size: 64, align: 64, offset: 1472)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{null, !1073}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1080, file: !919, line: 623, baseType: !1266, size: 64, align: 64, offset: 1536)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!960, !1073, !1269}
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1100)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1074, file: !919, line: 1365, baseType: !979, size: 64, align: 64, offset: 192)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1074, file: !919, line: 1379, baseType: !1273, size: 64, align: 64, offset: 256)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1275)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1276)
!1276 = !{!1277, !1278, !1279, !1280, !1281, !1282, !1283, !1287, !1288, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1304, !1305, !1309, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1327, !1328, !1329, !1330, !1334, !1335, !1336}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1275, file: !650, line: 174, baseType: !969, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1275, file: !650, line: 226, baseType: !1065, size: 64, align: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1275, file: !650, line: 227, baseType: !960, size: 32, align: 32, offset: 128)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1275, file: !650, line: 228, baseType: !1065, size: 64, align: 64, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1275, file: !650, line: 229, baseType: !1065, size: 64, align: 64, offset: 256)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1275, file: !650, line: 233, baseType: !979, size: 64, align: 64, offset: 320)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1275, file: !650, line: 235, baseType: !1284, size: 64, align: 64, offset: 384)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!960, !979, !1114, !960}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1275, file: !650, line: 236, baseType: !1284, size: 64, align: 64, offset: 448)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1275, file: !650, line: 237, baseType: !1289, size: 64, align: 64, offset: 512)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!993, !979, !993, !960}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1275, file: !650, line: 238, baseType: !993, size: 64, align: 64, offset: 576)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1275, file: !650, line: 239, baseType: !960, size: 32, align: 32, offset: 640)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1275, file: !650, line: 240, baseType: !960, size: 32, align: 32, offset: 672)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1275, file: !650, line: 241, baseType: !960, size: 32, align: 32, offset: 704)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1275, file: !650, line: 242, baseType: !1155, size: 64, align: 64, offset: 768)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1275, file: !650, line: 243, baseType: !1065, size: 64, align: 64, offset: 832)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1275, file: !650, line: 244, baseType: !1299, size: 64, align: 64, offset: 896)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DISubroutineType(types: !1301)
!1301 = !{!1155, !1155, !1302, !1245}
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1115)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1275, file: !650, line: 245, baseType: !960, size: 32, align: 32, offset: 960)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1275, file: !650, line: 249, baseType: !1306, size: 64, align: 64, offset: 1024)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!960, !979, !960}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1275, file: !650, line: 255, baseType: !1310, size: 64, align: 64, offset: 1088)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DISubroutineType(types: !1312)
!1312 = !{!993, !979, !960, !993, !960}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1275, file: !650, line: 260, baseType: !960, size: 32, align: 32, offset: 1152)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1275, file: !650, line: 266, baseType: !993, size: 64, align: 64, offset: 1216)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1275, file: !650, line: 273, baseType: !960, size: 32, align: 32, offset: 1280)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1275, file: !650, line: 279, baseType: !993, size: 64, align: 64, offset: 1344)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1275, file: !650, line: 285, baseType: !960, size: 32, align: 32, offset: 1408)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1275, file: !650, line: 291, baseType: !960, size: 32, align: 32, offset: 1440)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1275, file: !650, line: 298, baseType: !960, size: 32, align: 32, offset: 1472)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1275, file: !650, line: 304, baseType: !960, size: 32, align: 32, offset: 1504)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1275, file: !650, line: 309, baseType: !955, size: 64, align: 64, offset: 1536)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1275, file: !650, line: 314, baseType: !955, size: 64, align: 64, offset: 1600)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1275, file: !650, line: 319, baseType: !1324, size: 64, align: 64, offset: 1664)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!960, !979, !1114, !960, !649, !993}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1275, file: !650, line: 326, baseType: !960, size: 32, align: 32, offset: 1728)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1275, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1275, file: !650, line: 332, baseType: !993, size: 64, align: 64, offset: 1792)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1275, file: !650, line: 338, baseType: !1331, size: 64, align: 64, offset: 1856)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!960, !979}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1275, file: !650, line: 340, baseType: !993, size: 64, align: 64, offset: 1920)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1275, file: !650, line: 346, baseType: !1065, size: 64, align: 64, offset: 1984)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1275, file: !650, line: 351, baseType: !960, size: 32, align: 32, offset: 2048)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1074, file: !919, line: 1386, baseType: !960, size: 32, align: 32, offset: 320)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1074, file: !919, line: 1393, baseType: !1245, size: 32, align: 32, offset: 352)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1074, file: !919, line: 1405, baseType: !1340, size: 64, align: 64, offset: 384)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1343)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1344)
!1344 = !{!1345, !1346, !1347, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1816, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1916, !1922, !1923, !1927, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1959, !1960, !1961, !1962, !1963, !1964}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1343, file: !919, line: 866, baseType: !960, size: 32, align: 32)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1343, file: !919, line: 872, baseType: !960, size: 32, align: 32, offset: 32)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1343, file: !919, line: 878, baseType: !1348, size: 64, align: 64, offset: 64)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !47, line: 3360, baseType: !1350)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !47, line: 1556, size: 8448, align: 64, elements: !1351)
!1351 = !{!1352, !1353, !1354, !1355, !1491, !1492, !1493, !1494, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1520, !1524, !1525, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1704, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1350, file: !47, line: 1561, baseType: !969, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1350, file: !47, line: 1562, baseType: !960, size: 32, align: 32, offset: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1350, file: !47, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1350, file: !47, line: 1565, baseType: !1356, size: 64, align: 64, offset: 128)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1358)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !47, line: 3468, size: 1984, align: 64, elements: !1359)
!1359 = !{!1360, !1361, !1362, !1363, !1364, !1365, !1368, !1371, !1374, !1377, !1380, !1381, !1382, !1390, !1391, !1392, !1394, !1398, !1404, !1409, !1413, !1414, !1456, !1463, !1467, !1468, !1472, !1476, !1480, !1484, !1485, !1486}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1358, file: !47, line: 3475, baseType: !955, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1358, file: !47, line: 3480, baseType: !955, size: 64, align: 64, offset: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1358, file: !47, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1358, file: !47, line: 3482, baseType: !46, size: 32, align: 32, offset: 160)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1358, file: !47, line: 3487, baseType: !960, size: 32, align: 32, offset: 192)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1358, file: !47, line: 3488, baseType: !1366, size: 64, align: 64, offset: 256)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1358, file: !47, line: 3489, baseType: !1369, size: 64, align: 64, offset: 320)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1358, file: !47, line: 3490, baseType: !1372, size: 64, align: 64, offset: 384)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1358, file: !47, line: 3491, baseType: !1375, size: 64, align: 64, offset: 448)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1358, file: !47, line: 3492, baseType: !1378, size: 64, align: 64, offset: 512)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1189)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1358, file: !47, line: 3493, baseType: !1115, size: 8, align: 8, offset: 576)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1358, file: !47, line: 3494, baseType: !969, size: 64, align: 64, offset: 640)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1358, file: !47, line: 3495, baseType: !1383, size: 64, align: 64, offset: 704)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1385)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !47, line: 3404, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !47, line: 3401, size: 128, align: 64, elements: !1387)
!1387 = !{!1388, !1389}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1386, file: !47, line: 3402, baseType: !960, size: 32, align: 32)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1386, file: !47, line: 3403, baseType: !955, size: 64, align: 64, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1358, file: !47, line: 3507, baseType: !955, size: 64, align: 64, offset: 768)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1358, file: !47, line: 3516, baseType: !960, size: 32, align: 32, offset: 832)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1358, file: !47, line: 3517, baseType: !1393, size: 64, align: 64, offset: 896)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1358, file: !47, line: 3527, baseType: !1395, size: 64, align: 64, offset: 960)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DISubroutineType(types: !1397)
!1397 = !{!960, !1348}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1358, file: !47, line: 3535, baseType: !1399, size: 64, align: 64, offset: 1024)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DISubroutineType(types: !1401)
!1401 = !{!960, !1348, !1402}
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1349)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1358, file: !47, line: 3541, baseType: !1405, size: 64, align: 64, offset: 1088)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1407)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !47, line: 3461, baseType: !1408)
!1408 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !47, line: 3461, flags: DIFlagFwdDecl)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1358, file: !47, line: 3549, baseType: !1410, size: 64, align: 64, offset: 1152)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DISubroutineType(types: !1412)
!1412 = !{null, !1393}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1358, file: !47, line: 3551, baseType: !1395, size: 64, align: 64, offset: 1216)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1358, file: !47, line: 3552, baseType: !1415, size: 64, align: 64, offset: 1280)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{!960, !1348, !1114, !960, !1418}
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1420)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !47, line: 3920, size: 256, align: 64, elements: !1421)
!1421 = !{!1422, !1423, !1425, !1426, !1427, !1455}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1420, file: !47, line: 3921, baseType: !945, size: 16, align: 16)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1420, file: !47, line: 3922, baseType: !1424, size: 32, align: 32, offset: 32)
!1424 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !946, line: 51, baseType: !1245)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1420, file: !47, line: 3923, baseType: !1424, size: 32, align: 32, offset: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1420, file: !47, line: 3924, baseType: !1245, size: 32, align: 32, offset: 96)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1420, file: !47, line: 3925, baseType: !1428, size: 64, align: 64, offset: 128)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !47, line: 3918, baseType: !1431)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !47, line: 3885, size: 1600, align: 64, elements: !1432)
!1432 = !{!1433, !1434, !1435, !1436, !1437, !1438, !1444, !1448, !1450, !1451, !1453, !1454}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1431, file: !47, line: 3886, baseType: !960, size: 32, align: 32)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1431, file: !47, line: 3887, baseType: !960, size: 32, align: 32, offset: 32)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1431, file: !47, line: 3888, baseType: !960, size: 32, align: 32, offset: 64)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1431, file: !47, line: 3889, baseType: !960, size: 32, align: 32, offset: 96)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1431, file: !47, line: 3890, baseType: !960, size: 32, align: 32, offset: 128)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1431, file: !47, line: 3897, baseType: !1439, size: 768, align: 64, offset: 192)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !47, line: 3858, baseType: !1440)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !47, line: 3853, size: 768, align: 64, elements: !1441)
!1441 = !{!1442, !1443}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1440, file: !47, line: 3855, baseType: !1166, size: 512, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1440, file: !47, line: 3857, baseType: !1170, size: 256, align: 32, offset: 512)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1431, file: !47, line: 3903, baseType: !1445, size: 256, align: 64, offset: 960)
!1445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1114, size: 256, align: 64, elements: !1446)
!1446 = !{!1447}
!1447 = !DISubrange(count: 4)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1431, file: !47, line: 3904, baseType: !1449, size: 128, align: 32, offset: 1216)
!1449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 128, align: 32, elements: !1446)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1431, file: !47, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1431, file: !47, line: 3908, baseType: !1452, size: 64, align: 64, offset: 1408)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1431, file: !47, line: 3915, baseType: !1452, size: 64, align: 64, offset: 1472)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1431, file: !47, line: 3917, baseType: !960, size: 32, align: 32, offset: 1536)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1420, file: !47, line: 3926, baseType: !993, size: 64, align: 64, offset: 192)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1358, file: !47, line: 3564, baseType: !1457, size: 64, align: 64, offset: 1344)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!960, !1348, !1099, !1460, !1462}
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1162)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1358, file: !47, line: 3566, baseType: !1464, size: 64, align: 64, offset: 1408)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DISubroutineType(types: !1466)
!1466 = !{!960, !1348, !979, !1462, !1099}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1358, file: !47, line: 3567, baseType: !1395, size: 64, align: 64, offset: 1472)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1358, file: !47, line: 3576, baseType: !1469, size: 64, align: 64, offset: 1536)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DISubroutineType(types: !1471)
!1471 = !{!960, !1348, !1460}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1358, file: !47, line: 3577, baseType: !1473, size: 64, align: 64, offset: 1600)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DISubroutineType(types: !1475)
!1475 = !{!960, !1348, !1099}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1358, file: !47, line: 3584, baseType: !1477, size: 64, align: 64, offset: 1664)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{!960, !1348, !1161}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1358, file: !47, line: 3589, baseType: !1481, size: 64, align: 64, offset: 1728)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{null, !1348}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1358, file: !47, line: 3594, baseType: !960, size: 32, align: 32, offset: 1792)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1358, file: !47, line: 3600, baseType: !955, size: 64, align: 64, offset: 1856)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1358, file: !47, line: 3609, baseType: !1487, size: 64, align: 64, offset: 1920)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1490)
!1490 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !47, line: 3609, flags: DIFlagFwdDecl)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1350, file: !47, line: 1566, baseType: !46, size: 32, align: 32, offset: 192)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1350, file: !47, line: 1581, baseType: !1245, size: 32, align: 32, offset: 224)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1350, file: !47, line: 1583, baseType: !979, size: 64, align: 64, offset: 256)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1350, file: !47, line: 1591, baseType: !1495, size: 64, align: 64, offset: 320)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !47, line: 1532, flags: DIFlagFwdDecl)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1350, file: !47, line: 1598, baseType: !979, size: 64, align: 64, offset: 384)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1350, file: !47, line: 1606, baseType: !993, size: 64, align: 64, offset: 448)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1350, file: !47, line: 1614, baseType: !960, size: 32, align: 32, offset: 512)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1350, file: !47, line: 1622, baseType: !960, size: 32, align: 32, offset: 544)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1350, file: !47, line: 1628, baseType: !960, size: 32, align: 32, offset: 576)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1350, file: !47, line: 1636, baseType: !960, size: 32, align: 32, offset: 608)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1350, file: !47, line: 1643, baseType: !960, size: 32, align: 32, offset: 640)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1350, file: !47, line: 1657, baseType: !1114, size: 64, align: 64, offset: 704)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1350, file: !47, line: 1658, baseType: !960, size: 32, align: 32, offset: 768)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1350, file: !47, line: 1679, baseType: !999, size: 64, align: 32, offset: 800)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1350, file: !47, line: 1688, baseType: !960, size: 32, align: 32, offset: 864)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1350, file: !47, line: 1712, baseType: !960, size: 32, align: 32, offset: 896)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1350, file: !47, line: 1729, baseType: !960, size: 32, align: 32, offset: 928)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1350, file: !47, line: 1729, baseType: !960, size: 32, align: 32, offset: 960)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1350, file: !47, line: 1744, baseType: !960, size: 32, align: 32, offset: 992)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1350, file: !47, line: 1744, baseType: !960, size: 32, align: 32, offset: 1024)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1350, file: !47, line: 1751, baseType: !960, size: 32, align: 32, offset: 1056)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1350, file: !47, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1350, file: !47, line: 1791, baseType: !1516, size: 64, align: 64, offset: 1152)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{null, !1519, !1460, !1462, !960, !960, !960}
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1350, file: !47, line: 1808, baseType: !1521, size: 64, align: 64, offset: 1216)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DISubroutineType(types: !1523)
!1523 = !{!667, !1519, !1369}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1350, file: !47, line: 1816, baseType: !960, size: 32, align: 32, offset: 1280)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1350, file: !47, line: 1825, baseType: !1526, size: 32, align: 32, offset: 1312)
!1526 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1350, file: !47, line: 1830, baseType: !960, size: 32, align: 32, offset: 1344)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1350, file: !47, line: 1838, baseType: !1526, size: 32, align: 32, offset: 1376)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1350, file: !47, line: 1846, baseType: !960, size: 32, align: 32, offset: 1408)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1350, file: !47, line: 1851, baseType: !960, size: 32, align: 32, offset: 1440)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1350, file: !47, line: 1861, baseType: !1526, size: 32, align: 32, offset: 1472)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1350, file: !47, line: 1868, baseType: !1526, size: 32, align: 32, offset: 1504)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1350, file: !47, line: 1875, baseType: !1526, size: 32, align: 32, offset: 1536)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1350, file: !47, line: 1882, baseType: !1526, size: 32, align: 32, offset: 1568)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1350, file: !47, line: 1889, baseType: !1526, size: 32, align: 32, offset: 1600)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1350, file: !47, line: 1896, baseType: !1526, size: 32, align: 32, offset: 1632)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1350, file: !47, line: 1903, baseType: !1526, size: 32, align: 32, offset: 1664)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1350, file: !47, line: 1910, baseType: !960, size: 32, align: 32, offset: 1696)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1350, file: !47, line: 1915, baseType: !960, size: 32, align: 32, offset: 1728)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1350, file: !47, line: 1926, baseType: !1462, size: 64, align: 64, offset: 1792)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1350, file: !47, line: 1935, baseType: !999, size: 64, align: 32, offset: 1856)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1350, file: !47, line: 1942, baseType: !960, size: 32, align: 32, offset: 1920)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1350, file: !47, line: 1948, baseType: !960, size: 32, align: 32, offset: 1952)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1350, file: !47, line: 1954, baseType: !960, size: 32, align: 32, offset: 1984)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1350, file: !47, line: 1960, baseType: !960, size: 32, align: 32, offset: 2016)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1350, file: !47, line: 1984, baseType: !960, size: 32, align: 32, offset: 2048)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1350, file: !47, line: 1991, baseType: !960, size: 32, align: 32, offset: 2080)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1350, file: !47, line: 1996, baseType: !960, size: 32, align: 32, offset: 2112)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1350, file: !47, line: 2004, baseType: !960, size: 32, align: 32, offset: 2144)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1350, file: !47, line: 2011, baseType: !960, size: 32, align: 32, offset: 2176)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1350, file: !47, line: 2018, baseType: !960, size: 32, align: 32, offset: 2208)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1350, file: !47, line: 2027, baseType: !960, size: 32, align: 32, offset: 2240)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1350, file: !47, line: 2034, baseType: !960, size: 32, align: 32, offset: 2272)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1350, file: !47, line: 2044, baseType: !960, size: 32, align: 32, offset: 2304)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1350, file: !47, line: 2054, baseType: !1556, size: 64, align: 64, offset: 2368)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1350, file: !47, line: 2061, baseType: !1556, size: 64, align: 64, offset: 2432)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1350, file: !47, line: 2066, baseType: !960, size: 32, align: 32, offset: 2496)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1350, file: !47, line: 2070, baseType: !960, size: 32, align: 32, offset: 2528)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1350, file: !47, line: 2078, baseType: !960, size: 32, align: 32, offset: 2560)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1350, file: !47, line: 2085, baseType: !960, size: 32, align: 32, offset: 2592)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1350, file: !47, line: 2092, baseType: !960, size: 32, align: 32, offset: 2624)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1350, file: !47, line: 2099, baseType: !960, size: 32, align: 32, offset: 2656)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1350, file: !47, line: 2106, baseType: !960, size: 32, align: 32, offset: 2688)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1350, file: !47, line: 2113, baseType: !960, size: 32, align: 32, offset: 2720)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1350, file: !47, line: 2120, baseType: !960, size: 32, align: 32, offset: 2752)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1350, file: !47, line: 2125, baseType: !960, size: 32, align: 32, offset: 2784)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1350, file: !47, line: 2133, baseType: !960, size: 32, align: 32, offset: 2816)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1350, file: !47, line: 2140, baseType: !960, size: 32, align: 32, offset: 2848)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1350, file: !47, line: 2145, baseType: !960, size: 32, align: 32, offset: 2880)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1350, file: !47, line: 2153, baseType: !960, size: 32, align: 32, offset: 2912)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1350, file: !47, line: 2158, baseType: !960, size: 32, align: 32, offset: 2944)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1350, file: !47, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1350, file: !47, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1350, file: !47, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1350, file: !47, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1350, file: !47, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1350, file: !47, line: 2203, baseType: !960, size: 32, align: 32, offset: 3136)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1350, file: !47, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1350, file: !47, line: 2212, baseType: !960, size: 32, align: 32, offset: 3200)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1350, file: !47, line: 2213, baseType: !960, size: 32, align: 32, offset: 3232)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1350, file: !47, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1350, file: !47, line: 2232, baseType: !960, size: 32, align: 32, offset: 3296)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1350, file: !47, line: 2243, baseType: !960, size: 32, align: 32, offset: 3328)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1350, file: !47, line: 2249, baseType: !960, size: 32, align: 32, offset: 3360)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1350, file: !47, line: 2256, baseType: !960, size: 32, align: 32, offset: 3392)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1350, file: !47, line: 2263, baseType: !1189, size: 64, align: 64, offset: 3456)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1350, file: !47, line: 2270, baseType: !1189, size: 64, align: 64, offset: 3520)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1350, file: !47, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1350, file: !47, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1350, file: !47, line: 2367, baseType: !1592, size: 64, align: 64, offset: 3648)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DISubroutineType(types: !1594)
!1594 = !{!960, !1519, !1161, !960}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1350, file: !47, line: 2383, baseType: !960, size: 32, align: 32, offset: 3712)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1350, file: !47, line: 2386, baseType: !1526, size: 32, align: 32, offset: 3744)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1350, file: !47, line: 2387, baseType: !1526, size: 32, align: 32, offset: 3776)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1350, file: !47, line: 2394, baseType: !960, size: 32, align: 32, offset: 3808)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1350, file: !47, line: 2401, baseType: !960, size: 32, align: 32, offset: 3840)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1350, file: !47, line: 2408, baseType: !960, size: 32, align: 32, offset: 3872)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1350, file: !47, line: 2415, baseType: !960, size: 32, align: 32, offset: 3904)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1350, file: !47, line: 2422, baseType: !960, size: 32, align: 32, offset: 3936)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1350, file: !47, line: 2423, baseType: !1604, size: 64, align: 64, offset: 3968)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !47, line: 831, baseType: !1606)
!1606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !47, line: 826, size: 128, align: 32, elements: !1607)
!1607 = !{!1608, !1609, !1610, !1611}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1606, file: !47, line: 827, baseType: !960, size: 32, align: 32)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1606, file: !47, line: 828, baseType: !960, size: 32, align: 32, offset: 32)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1606, file: !47, line: 829, baseType: !960, size: 32, align: 32, offset: 64)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1606, file: !47, line: 830, baseType: !1526, size: 32, align: 32, offset: 96)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1350, file: !47, line: 2430, baseType: !993, size: 64, align: 64, offset: 4032)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1350, file: !47, line: 2437, baseType: !993, size: 64, align: 64, offset: 4096)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1350, file: !47, line: 2444, baseType: !1526, size: 32, align: 32, offset: 4160)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1350, file: !47, line: 2451, baseType: !1526, size: 32, align: 32, offset: 4192)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1350, file: !47, line: 2458, baseType: !960, size: 32, align: 32, offset: 4224)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1350, file: !47, line: 2469, baseType: !960, size: 32, align: 32, offset: 4256)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1350, file: !47, line: 2475, baseType: !960, size: 32, align: 32, offset: 4288)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1350, file: !47, line: 2481, baseType: !960, size: 32, align: 32, offset: 4320)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1350, file: !47, line: 2485, baseType: !960, size: 32, align: 32, offset: 4352)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1350, file: !47, line: 2489, baseType: !960, size: 32, align: 32, offset: 4384)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1350, file: !47, line: 2493, baseType: !960, size: 32, align: 32, offset: 4416)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1350, file: !47, line: 2501, baseType: !960, size: 32, align: 32, offset: 4448)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1350, file: !47, line: 2506, baseType: !960, size: 32, align: 32, offset: 4480)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1350, file: !47, line: 2510, baseType: !960, size: 32, align: 32, offset: 4512)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1350, file: !47, line: 2514, baseType: !993, size: 64, align: 64, offset: 4544)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1350, file: !47, line: 2528, baseType: !1628, size: 64, align: 64, offset: 4608)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DISubroutineType(types: !1630)
!1630 = !{null, !1519, !979, !960, !960}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1350, file: !47, line: 2534, baseType: !960, size: 32, align: 32, offset: 4672)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1350, file: !47, line: 2545, baseType: !960, size: 32, align: 32, offset: 4704)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1350, file: !47, line: 2547, baseType: !960, size: 32, align: 32, offset: 4736)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1350, file: !47, line: 2549, baseType: !960, size: 32, align: 32, offset: 4768)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1350, file: !47, line: 2551, baseType: !960, size: 32, align: 32, offset: 4800)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1350, file: !47, line: 2553, baseType: !960, size: 32, align: 32, offset: 4832)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1350, file: !47, line: 2555, baseType: !960, size: 32, align: 32, offset: 4864)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1350, file: !47, line: 2557, baseType: !960, size: 32, align: 32, offset: 4896)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1350, file: !47, line: 2559, baseType: !960, size: 32, align: 32, offset: 4928)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1350, file: !47, line: 2563, baseType: !960, size: 32, align: 32, offset: 4960)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1350, file: !47, line: 2571, baseType: !1452, size: 64, align: 64, offset: 4992)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1350, file: !47, line: 2579, baseType: !1452, size: 64, align: 64, offset: 5056)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1350, file: !47, line: 2586, baseType: !960, size: 32, align: 32, offset: 5120)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1350, file: !47, line: 2615, baseType: !960, size: 32, align: 32, offset: 5152)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1350, file: !47, line: 2627, baseType: !960, size: 32, align: 32, offset: 5184)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1350, file: !47, line: 2637, baseType: !960, size: 32, align: 32, offset: 5216)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1350, file: !47, line: 2681, baseType: !960, size: 32, align: 32, offset: 5248)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1350, file: !47, line: 2709, baseType: !993, size: 64, align: 64, offset: 5312)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1350, file: !47, line: 2716, baseType: !1650, size: 64, align: 64, offset: 5376)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1652)
!1652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !47, line: 3636, size: 896, align: 64, elements: !1653)
!1653 = !{!1654, !1655, !1656, !1657, !1658, !1659, !1660, !1664, !1668, !1669, !1670, !1671, !1677, !1678, !1679, !1680, !1681}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1652, file: !47, line: 3642, baseType: !955, size: 64, align: 64)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1652, file: !47, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1652, file: !47, line: 3656, baseType: !46, size: 32, align: 32, offset: 96)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1652, file: !47, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1652, file: !47, line: 3669, baseType: !960, size: 32, align: 32, offset: 160)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1652, file: !47, line: 3682, baseType: !1477, size: 64, align: 64, offset: 192)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1652, file: !47, line: 3698, baseType: !1661, size: 64, align: 64, offset: 256)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DISubroutineType(types: !1663)
!1663 = !{!960, !1348, !1302, !1424}
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1652, file: !47, line: 3712, baseType: !1665, size: 64, align: 64, offset: 320)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DISubroutineType(types: !1667)
!1667 = !{!960, !1348, !960, !1302, !1424}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1652, file: !47, line: 3726, baseType: !1661, size: 64, align: 64, offset: 384)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1652, file: !47, line: 3737, baseType: !1395, size: 64, align: 64, offset: 448)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1652, file: !47, line: 3746, baseType: !960, size: 32, align: 32, offset: 512)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1652, file: !47, line: 3757, baseType: !1672, size: 64, align: 64, offset: 576)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{null, !1675}
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !47, line: 3617, flags: DIFlagFwdDecl)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1652, file: !47, line: 3766, baseType: !1395, size: 64, align: 64, offset: 640)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1652, file: !47, line: 3774, baseType: !1395, size: 64, align: 64, offset: 704)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1652, file: !47, line: 3780, baseType: !960, size: 32, align: 32, offset: 768)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1652, file: !47, line: 3785, baseType: !960, size: 32, align: 32, offset: 800)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1652, file: !47, line: 3795, baseType: !1682, size: 64, align: 64, offset: 832)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64, align: 64)
!1683 = !DISubroutineType(types: !1684)
!1684 = !{!960, !1348, !1104}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1350, file: !47, line: 2728, baseType: !979, size: 64, align: 64, offset: 5440)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1350, file: !47, line: 2735, baseType: !1188, size: 512, align: 64, offset: 5504)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1350, file: !47, line: 2742, baseType: !960, size: 32, align: 32, offset: 6016)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1350, file: !47, line: 2755, baseType: !960, size: 32, align: 32, offset: 6048)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1350, file: !47, line: 2776, baseType: !960, size: 32, align: 32, offset: 6080)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1350, file: !47, line: 2783, baseType: !960, size: 32, align: 32, offset: 6112)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1350, file: !47, line: 2791, baseType: !960, size: 32, align: 32, offset: 6144)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1350, file: !47, line: 2802, baseType: !1161, size: 64, align: 64, offset: 6208)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1350, file: !47, line: 2811, baseType: !960, size: 32, align: 32, offset: 6272)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1350, file: !47, line: 2821, baseType: !960, size: 32, align: 32, offset: 6304)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1350, file: !47, line: 2830, baseType: !960, size: 32, align: 32, offset: 6336)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1350, file: !47, line: 2840, baseType: !960, size: 32, align: 32, offset: 6368)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1350, file: !47, line: 2851, baseType: !1698, size: 64, align: 64, offset: 6400)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DISubroutineType(types: !1700)
!1700 = !{!960, !1519, !1701, !979, !1462, !960, !960}
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DISubroutineType(types: !1703)
!1703 = !{!960, !1519, !979}
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1350, file: !47, line: 2871, baseType: !1705, size: 64, align: 64, offset: 6464)
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64, align: 64)
!1706 = !DISubroutineType(types: !1707)
!1707 = !{!960, !1519, !1708, !979, !1462, !960}
!1708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1709, size: 64, align: 64)
!1709 = !DISubroutineType(types: !1710)
!1710 = !{!960, !1519, !979, !960, !960}
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1350, file: !47, line: 2878, baseType: !960, size: 32, align: 32, offset: 6528)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1350, file: !47, line: 2885, baseType: !960, size: 32, align: 32, offset: 6560)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1350, file: !47, line: 3005, baseType: !960, size: 32, align: 32, offset: 6592)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1350, file: !47, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1350, file: !47, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1350, file: !47, line: 3027, baseType: !909, size: 32, align: 32, offset: 6688)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1350, file: !47, line: 3037, baseType: !1114, size: 64, align: 64, offset: 6720)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1350, file: !47, line: 3038, baseType: !960, size: 32, align: 32, offset: 6784)
