; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--crypto.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--crypto.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !46, globals: !50)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--crypto.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!2 = !{!3, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !4, line: 221, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!6 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!7 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!8 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!9 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!10 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!11 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!12 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!13 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!14 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!15 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!16 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!17 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!18 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!19 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!20 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!21 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!22 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!23 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!24 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 29, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!28 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!29 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!30 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!31 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!32 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!33 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!34 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!35 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!36 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!37 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!38 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!39 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!40 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!41 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!42 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!43 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!44 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!45 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!46 = !{!47, !48, !49}
!47 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!48 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!49 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!50 = !{!51, !260, !261}
!51 = distinct !DIGlobalVariable(name: "ff_crypto_protocol", scope: !0, file: !52, line: 396, type: !53, isLocal: false, isDefinition: true, variable: { i8*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }* @ff_crypto_protocol)
!52 = !DIFile(filename: "libavformat/crypto.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !55, line: 100, baseType: !56)
!55 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !55, line: 54, size: 1600, align: 64, elements: !57)
!57 = !{!58, !62, !177, !186, !191, !195, !201, !207, !211, !212, !216, !220, !221, !227, !228, !229, !230, !231, !232, !233, !234, !253, !254, !255, !259}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !56, file: !55, line: 55, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !56, file: !55, line: 56, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!47, !66, !59, !47}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !55, line: 52, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !55, line: 38, size: 768, align: 64, elements: !69)
!69 = !{!70, !153, !156, !157, !159, !160, !161, !162, !163, !173, !174, !175, !176}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !68, file: !55, line: 39, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !75)
!75 = !{!76, !77, !82, !112, !113, !114, !115, !119, !125, !127, !131}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !74, file: !26, line: 72, baseType: !59, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !74, file: !26, line: 78, baseType: !78, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!59, !81}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !74, file: !26, line: 85, baseType: !83, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !86)
!86 = !{!87, !88, !89, !90, !91, !108, !109, !110, !111}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !85, file: !4, line: 247, baseType: !59, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !85, file: !4, line: 253, baseType: !59, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !85, file: !4, line: 259, baseType: !47, size: 32, align: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !85, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !85, file: !4, line: 271, baseType: !92, size: 64, align: 64, offset: 192)
!92 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !85, file: !4, line: 265, size: 64, align: 64, elements: !93)
!93 = !{!94, !98, !100, !101}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !92, file: !4, line: 266, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !96, line: 40, baseType: !97)
!96 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!97 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !92, file: !4, line: 267, baseType: !99, size: 64, align: 64)
!99 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !92, file: !4, line: 268, baseType: !59, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !92, file: !4, line: 270, baseType: !102, size: 64, align: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !103, line: 61, baseType: !104)
!103 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !103, line: 58, size: 64, align: 32, elements: !105)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !104, file: !103, line: 59, baseType: !47, size: 32, align: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !104, file: !103, line: 60, baseType: !47, size: 32, align: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !85, file: !4, line: 272, baseType: !99, size: 64, align: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !85, file: !4, line: 273, baseType: !99, size: 64, align: 64, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !85, file: !4, line: 275, baseType: !47, size: 32, align: 32, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !85, file: !4, line: 300, baseType: !59, size: 64, align: 64, offset: 448)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !74, file: !26, line: 93, baseType: !47, size: 32, align: 32, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !74, file: !26, line: 99, baseType: !47, size: 32, align: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !74, file: !26, line: 108, baseType: !47, size: 32, align: 32, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !74, file: !26, line: 113, baseType: !116, size: 64, align: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!81, !81, !81}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !74, file: !26, line: 123, baseType: !120, size: 64, align: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !74, file: !26, line: 130, baseType: !126, size: 32, align: 32, offset: 448)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !74, file: !26, line: 136, baseType: !128, size: 64, align: 64, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!126, !81}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !74, file: !26, line: 142, baseType: !132, size: 64, align: 64, offset: 576)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!47, !135, !81, !59, !47}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !138)
!138 = !{!139, !151, !152}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !137, file: !4, line: 360, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !144)
!144 = !{!145, !146, !147, !148, !149, !150}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !143, file: !4, line: 307, baseType: !59, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !143, file: !4, line: 313, baseType: !99, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !143, file: !4, line: 313, baseType: !99, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !143, file: !4, line: 318, baseType: !99, size: 64, align: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !143, file: !4, line: 318, baseType: !99, size: 64, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !143, file: !4, line: 323, baseType: !47, size: 32, align: 32, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !137, file: !4, line: 364, baseType: !47, size: 32, align: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !137, file: !4, line: 368, baseType: !47, size: 32, align: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !68, file: !55, line: 40, baseType: !154, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !68, file: !55, line: 41, baseType: !81, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !68, file: !55, line: 42, baseType: !158, size: 64, align: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !68, file: !55, line: 43, baseType: !47, size: 32, align: 32, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !68, file: !55, line: 44, baseType: !47, size: 32, align: 32, offset: 288)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !68, file: !55, line: 45, baseType: !47, size: 32, align: 32, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !68, file: !55, line: 46, baseType: !47, size: 32, align: 32, offset: 352)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !68, file: !55, line: 47, baseType: !164, size: 128, align: 64, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !165, line: 61, baseType: !166)
!165 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !165, line: 58, size: 128, align: 64, elements: !167)
!167 = !{!168, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !166, file: !165, line: 59, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!47, !81}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !166, file: !165, line: 60, baseType: !81, size: 64, align: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !68, file: !55, line: 48, baseType: !95, size: 64, align: 64, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !68, file: !55, line: 49, baseType: !59, size: 64, align: 64, offset: 576)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !68, file: !55, line: 50, baseType: !59, size: 64, align: 64, offset: 640)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !68, file: !55, line: 51, baseType: !47, size: 32, align: 32, offset: 704)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !56, file: !55, line: 62, baseType: !178, size: 64, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!47, !66, !59, !47, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !184, line: 86, baseType: !185)
!184 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !184, line: 86, flags: DIFlagFwdDecl)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !56, file: !55, line: 63, baseType: !187, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!47, !66, !190}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !56, file: !55, line: 64, baseType: !192, size: 64, align: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!47, !66}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !56, file: !55, line: 78, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!47, !66, !199, !47}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !56, file: !55, line: 79, baseType: !202, size: 64, align: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!47, !66, !205, !47}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !56, file: !55, line: 80, baseType: !208, size: 64, align: 64, offset: 448)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!95, !66, !95, !47}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !56, file: !55, line: 81, baseType: !192, size: 64, align: 64, offset: 512)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !56, file: !55, line: 82, baseType: !213, size: 64, align: 64, offset: 576)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!47, !66, !47}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !56, file: !55, line: 83, baseType: !217, size: 64, align: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!95, !66, !47, !95, !47}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !56, file: !55, line: 85, baseType: !192, size: 64, align: 64, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !56, file: !55, line: 86, baseType: !222, size: 64, align: 64, offset: 768)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!47, !66, !225, !226}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !56, file: !55, line: 88, baseType: !192, size: 64, align: 64, offset: 832)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !56, file: !55, line: 89, baseType: !213, size: 64, align: 64, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !56, file: !55, line: 90, baseType: !47, size: 32, align: 32, offset: 960)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !56, file: !55, line: 91, baseType: !71, size: 64, align: 64, offset: 1024)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !56, file: !55, line: 92, baseType: !47, size: 32, align: 32, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !56, file: !55, line: 93, baseType: !213, size: 64, align: 64, offset: 1152)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !56, file: !55, line: 94, baseType: !192, size: 64, align: 64, offset: 1216)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !56, file: !55, line: 95, baseType: !235, size: 64, align: 64, offset: 1280)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!47, !66, !238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !165, line: 101, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !165, line: 86, size: 576, align: 64, elements: !242)
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !251, !252}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !241, file: !165, line: 87, baseType: !158, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !241, file: !165, line: 88, baseType: !47, size: 32, align: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !241, file: !165, line: 89, baseType: !47, size: 32, align: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !241, file: !165, line: 91, baseType: !95, size: 64, align: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !241, file: !165, line: 92, baseType: !95, size: 64, align: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !241, file: !165, line: 94, baseType: !95, size: 64, align: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !241, file: !165, line: 96, baseType: !95, size: 64, align: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !241, file: !165, line: 98, baseType: !95, size: 64, align: 64, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !241, file: !165, line: 99, baseType: !95, size: 64, align: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !241, file: !165, line: 100, baseType: !95, size: 64, align: 64, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !56, file: !55, line: 96, baseType: !192, size: 64, align: 64, offset: 1344)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !56, file: !55, line: 97, baseType: !192, size: 64, align: 64, offset: 1408)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !56, file: !55, line: 98, baseType: !256, size: 64, align: 64, offset: 1472)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!47, !66, !66}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !56, file: !55, line: 99, baseType: !59, size: 64, align: 64, offset: 1536)
!260 = distinct !DIGlobalVariable(name: "crypto_class", scope: !0, file: !52, line: 76, type: !72, isLocal: true, isDefinition: true, variable: %struct.AVClass* @crypto_class)
!261 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !52, line: 66, type: !262, isLocal: true, isDefinition: true, variable: [7 x %struct.AVOption]* @options)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 3584, align: 64, elements: !265)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !85)
!265 = !{!266}
!266 = !DISubrange(count: 7)
!267 = !{i32 2, !"Dwarf Version", i32 4}
!268 = !{i32 2, !"Debug Info Version", i32 3}
!269 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!270 = distinct !DISubprogram(name: "crypto_open2", scope: !52, file: !52, line: 110, type: !179, isLocal: true, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !271)
!271 = !{}
!272 = !DILocalVariable(name: "h", arg: 1, scope: !270, file: !52, line: 110, type: !66)
!273 = !DIExpression()
!274 = !DILocation(line: 110, column: 37, scope: !270)
!275 = !DILocalVariable(name: "uri", arg: 2, scope: !270, file: !52, line: 110, type: !59)
!276 = !DILocation(line: 110, column: 52, scope: !270)
!277 = !DILocalVariable(name: "flags", arg: 3, scope: !270, file: !52, line: 110, type: !47)
!278 = !DILocation(line: 110, column: 61, scope: !270)
!279 = !DILocalVariable(name: "options", arg: 4, scope: !270, file: !52, line: 110, type: !181)
!280 = !DILocation(line: 110, column: 83, scope: !270)
!281 = !DILocalVariable(name: "nested_url", scope: !270, file: !52, line: 112, type: !59)
!282 = !DILocation(line: 112, column: 17, scope: !270)
!283 = !DILocalVariable(name: "ret", scope: !270, file: !52, line: 113, type: !47)
!284 = !DILocation(line: 113, column: 9, scope: !270)
!285 = !DILocalVariable(name: "c", scope: !270, file: !52, line: 114, type: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "CryptoContext", file: !52, line: 61, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CryptoContext", file: !52, line: 33, size: 67392, align: 64, elements: !289)
!289 = !{!290, !291, !292, !297, !298, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !322, !323, !324, !325, !329}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !288, file: !52, line: 34, baseType: !71, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "hd", scope: !288, file: !52, line: 35, baseType: !66, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "inbuffer", scope: !288, file: !52, line: 36, baseType: !293, size: 32896, align: 8, offset: 128)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 32896, align: 8, elements: !295)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !96, line: 48, baseType: !200)
!295 = !{!296}
!296 = !DISubrange(count: 4112)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "outbuffer", scope: !288, file: !52, line: 37, baseType: !293, size: 32896, align: 8, offset: 33024)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "outptr", scope: !288, file: !52, line: 38, baseType: !299, size: 64, align: 64, offset: 65920)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "indata", scope: !288, file: !52, line: 39, baseType: !47, size: 32, align: 32, offset: 65984)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "indata_used", scope: !288, file: !52, line: 39, baseType: !47, size: 32, align: 32, offset: 66016)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "outdata", scope: !288, file: !52, line: 39, baseType: !47, size: 32, align: 32, offset: 66048)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !288, file: !52, line: 40, baseType: !95, size: 64, align: 64, offset: 66112)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !288, file: !52, line: 41, baseType: !47, size: 32, align: 32, offset: 66176)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !288, file: !52, line: 42, baseType: !47, size: 32, align: 32, offset: 66208)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !288, file: !52, line: 43, baseType: !299, size: 64, align: 64, offset: 66240)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !288, file: !52, line: 44, baseType: !47, size: 32, align: 32, offset: 66304)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "iv", scope: !288, file: !52, line: 45, baseType: !299, size: 64, align: 64, offset: 66368)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ivlen", scope: !288, file: !52, line: 46, baseType: !47, size: 32, align: 32, offset: 66432)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "decrypt_key", scope: !288, file: !52, line: 47, baseType: !299, size: 64, align: 64, offset: 66496)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "decrypt_keylen", scope: !288, file: !52, line: 48, baseType: !47, size: 32, align: 32, offset: 66560)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "decrypt_iv", scope: !288, file: !52, line: 49, baseType: !299, size: 64, align: 64, offset: 66624)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "decrypt_ivlen", scope: !288, file: !52, line: 50, baseType: !47, size: 32, align: 32, offset: 66688)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "encrypt_key", scope: !288, file: !52, line: 51, baseType: !299, size: 64, align: 64, offset: 66752)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "encrypt_keylen", scope: !288, file: !52, line: 52, baseType: !47, size: 32, align: 32, offset: 66816)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "encrypt_iv", scope: !288, file: !52, line: 53, baseType: !299, size: 64, align: 64, offset: 66880)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "encrypt_ivlen", scope: !288, file: !52, line: 54, baseType: !47, size: 32, align: 32, offset: 66944)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "aes_decrypt", scope: !288, file: !52, line: 55, baseType: !319, size: 64, align: 64, offset: 67008)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVAES", file: !321, line: 37, flags: DIFlagFwdDecl)
!321 = !DIFile(filename: "./libavutil/aes.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!322 = !DIDerivedType(tag: DW_TAG_member, name: "aes_encrypt", scope: !288, file: !52, line: 56, baseType: !319, size: 64, align: 64, offset: 67072)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !288, file: !52, line: 57, baseType: !299, size: 64, align: 64, offset: 67136)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf_size", scope: !288, file: !52, line: 58, baseType: !48, size: 32, align: 32, offset: 67200)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !288, file: !52, line: 59, baseType: !326, size: 128, align: 8, offset: 67232)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 128, align: 8, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 16)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pad_len", scope: !288, file: !52, line: 60, baseType: !47, size: 32, align: 32, offset: 67360)
!330 = !DILocation(line: 114, column: 20, scope: !270)
!331 = !DILocation(line: 114, column: 24, scope: !270)
!332 = !DILocation(line: 114, column: 27, scope: !270)
!333 = !DILocation(line: 115, column: 16, scope: !270)
!334 = !DILocation(line: 115, column: 5, scope: !270)
!335 = !DILocation(line: 115, column: 8, scope: !270)
!336 = !DILocation(line: 115, column: 14, scope: !270)
!337 = !DILocation(line: 117, column: 22, scope: !338)
!338 = distinct !DILexicalBlock(scope: !270, file: !52, line: 117, column: 9)
!339 = !DILocation(line: 117, column: 10, scope: !338)
!340 = !DILocation(line: 117, column: 51, scope: !338)
!341 = !DILocation(line: 118, column: 22, scope: !338)
!342 = !DILocation(line: 118, column: 10, scope: !338)
!343 = !DILocation(line: 117, column: 9, scope: !344)
!344 = !DILexicalBlockFile(scope: !270, file: !52, discriminator: 1)
!345 = !DILocation(line: 119, column: 16, scope: !346)
!346 = distinct !DILexicalBlock(scope: !338, file: !52, line: 118, column: 52)
!347 = !DILocation(line: 119, column: 47, scope: !346)
!348 = !DILocation(line: 119, column: 9, scope: !346)
!349 = !DILocation(line: 120, column: 13, scope: !346)
!350 = !DILocation(line: 121, column: 9, scope: !346)
!351 = !DILocation(line: 124, column: 9, scope: !352)
!352 = distinct !DILexicalBlock(scope: !270, file: !52, line: 124, column: 9)
!353 = !DILocation(line: 124, column: 15, scope: !352)
!354 = !DILocation(line: 124, column: 9, scope: !270)
!355 = !DILocation(line: 125, column: 32, scope: !356)
!356 = distinct !DILexicalBlock(scope: !357, file: !52, line: 125, column: 13)
!357 = distinct !DILexicalBlock(scope: !352, file: !52, line: 124, column: 20)
!358 = !DILocation(line: 125, column: 36, scope: !356)
!359 = !DILocation(line: 125, column: 39, scope: !356)
!360 = !DILocation(line: 125, column: 53, scope: !356)
!361 = !DILocation(line: 125, column: 56, scope: !356)
!362 = !DILocation(line: 126, column: 32, scope: !356)
!363 = !DILocation(line: 126, column: 35, scope: !356)
!364 = !DILocation(line: 126, column: 40, scope: !356)
!365 = !DILocation(line: 126, column: 43, scope: !356)
!366 = !DILocation(line: 125, column: 20, scope: !356)
!367 = !DILocation(line: 125, column: 18, scope: !356)
!368 = !DILocation(line: 126, column: 70, scope: !356)
!369 = !DILocation(line: 125, column: 13, scope: !357)
!370 = !DILocation(line: 127, column: 13, scope: !356)
!371 = !DILocation(line: 128, column: 32, scope: !372)
!372 = distinct !DILexicalBlock(scope: !357, file: !52, line: 128, column: 13)
!373 = !DILocation(line: 128, column: 36, scope: !372)
!374 = !DILocation(line: 128, column: 39, scope: !372)
!375 = !DILocation(line: 128, column: 52, scope: !372)
!376 = !DILocation(line: 128, column: 55, scope: !372)
!377 = !DILocation(line: 129, column: 32, scope: !372)
!378 = !DILocation(line: 129, column: 35, scope: !372)
!379 = !DILocation(line: 129, column: 39, scope: !372)
!380 = !DILocation(line: 129, column: 42, scope: !372)
!381 = !DILocation(line: 128, column: 20, scope: !372)
!382 = !DILocation(line: 128, column: 18, scope: !372)
!383 = !DILocation(line: 129, column: 67, scope: !372)
!384 = !DILocation(line: 128, column: 13, scope: !357)
!385 = !DILocation(line: 130, column: 13, scope: !372)
!386 = !DILocation(line: 131, column: 5, scope: !357)
!387 = !DILocation(line: 133, column: 9, scope: !388)
!388 = distinct !DILexicalBlock(scope: !270, file: !52, line: 133, column: 9)
!389 = !DILocation(line: 133, column: 15, scope: !388)
!390 = !DILocation(line: 133, column: 9, scope: !270)
!391 = !DILocation(line: 134, column: 32, scope: !392)
!392 = distinct !DILexicalBlock(scope: !393, file: !52, line: 134, column: 13)
!393 = distinct !DILexicalBlock(scope: !388, file: !52, line: 133, column: 20)
!394 = !DILocation(line: 134, column: 36, scope: !392)
!395 = !DILocation(line: 134, column: 39, scope: !392)
