; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--flacdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--flacdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }

!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 47, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "./libavcodec/flac.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948}
!941 = !DIEnumerator(name: "FLAC_METADATA_TYPE_STREAMINFO", value: 0)
!942 = !DIEnumerator(name: "FLAC_METADATA_TYPE_PADDING", value: 1)
!943 = !DIEnumerator(name: "FLAC_METADATA_TYPE_APPLICATION", value: 2)
!944 = !DIEnumerator(name: "FLAC_METADATA_TYPE_SEEKTABLE", value: 3)
!945 = !DIEnumerator(name: "FLAC_METADATA_TYPE_VORBIS_COMMENT", value: 4)
!946 = !DIEnumerator(name: "FLAC_METADATA_TYPE_CUESHEET", value: 5)
!947 = !DIEnumerator(name: "FLAC_METADATA_TYPE_PICTURE", value: 6)
!948 = !DIEnumerator(name: "FLAC_METADATA_TYPE_INVALID", value: 127)
!949 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 40, size: 32, align: 32, elements: !950)
!950 = !{!951, !952, !953, !954}
!951 = !DIEnumerator(name: "FLAC_CHMODE_INDEPENDENT", value: 0)
!952 = !DIEnumerator(name: "FLAC_CHMODE_LEFT_SIDE", value: 1)
!953 = !DIEnumerator(name: "FLAC_CHMODE_RIGHT_SIDE", value: 2)
!954 = !DIEnumerator(name: "FLAC_CHMODE_MID_SIDE", value: 3)
!955 = !{!956, !965, !969, !970, !971, !978, !976}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !959, line: 222, size: 16, align: 8, elements: !960)
!959 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!960 = !{!961}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !958, file: !959, line: 222, baseType: !962, size: 16, align: 16)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !963, line: 49, baseType: !964)
!963 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!964 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !963, line: 48, baseType: !968)
!968 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!969 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!970 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !959, line: 220, size: 64, align: 8, elements: !974)
!974 = !{!975}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !973, file: !959, line: 220, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !963, line: 55, baseType: !977)
!977 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !963, line: 40, baseType: !979)
!979 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!980 = !{!981}
!981 = distinct !DIGlobalVariable(name: "ff_flac_demuxer", scope: !0, file: !982, line: 330, type: !983, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_flac_demuxer)
!982 = !DIFile(filename: "libavformat/flacdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !985)
!985 = !{!986, !990, !991, !992, !993, !1003, !1083, !1084, !1086, !1087, !1088, !1101, !2199, !2200, !2201, !2205, !2209, !2210, !2211, !2215, !2216, !2217}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !984, file: !919, line: 638, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !984, file: !919, line: 645, baseType: !987, size: 64, align: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !984, file: !919, line: 652, baseType: !970, size: 32, align: 32, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !984, file: !919, line: 659, baseType: !987, size: 64, align: 64, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !984, file: !919, line: 661, baseType: !994, size: 64, align: 64, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !999, line: 44, size: 64, align: 32, elements: !1000)
!999 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !998, file: !999, line: 45, baseType: !3, size: 32, align: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !998, file: !999, line: 46, baseType: !969, size: 32, align: 32, offset: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !984, file: !919, line: 663, baseType: !1004, size: 64, align: 64, offset: 320)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1008)
!1008 = !{!1009, !1010, !1015, !1042, !1043, !1044, !1045, !1049, !1055, !1057, !1061}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1007, file: !486, line: 72, baseType: !987, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1007, file: !486, line: 78, baseType: !1011, size: 64, align: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!987, !1014}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1007, file: !486, line: 85, baseType: !1016, size: 64, align: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024, !1038, !1039, !1040, !1041}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1018, file: !464, line: 247, baseType: !987, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1018, file: !464, line: 253, baseType: !987, size: 64, align: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1018, file: !464, line: 259, baseType: !970, size: 32, align: 32, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1018, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1018, file: !464, line: 271, baseType: !1025, size: 64, align: 64, offset: 192)
!1025 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1018, file: !464, line: 265, size: 64, align: 64, elements: !1026)
!1026 = !{!1027, !1028, !1030, !1031}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1025, file: !464, line: 266, baseType: !978, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1025, file: !464, line: 267, baseType: !1029, size: 64, align: 64)
!1029 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1025, file: !464, line: 268, baseType: !987, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1025, file: !464, line: 270, baseType: !1032, size: 64, align: 32)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1033, line: 61, baseType: !1034)
!1033 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1033, line: 58, size: 64, align: 32, elements: !1035)
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1034, file: !1033, line: 59, baseType: !970, size: 32, align: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1034, file: !1033, line: 60, baseType: !970, size: 32, align: 32, offset: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1018, file: !464, line: 272, baseType: !1029, size: 64, align: 64, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1018, file: !464, line: 273, baseType: !1029, size: 64, align: 64, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1018, file: !464, line: 275, baseType: !970, size: 32, align: 32, offset: 384)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1018, file: !464, line: 300, baseType: !987, size: 64, align: 64, offset: 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1007, file: !486, line: 93, baseType: !970, size: 32, align: 32, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1007, file: !486, line: 99, baseType: !970, size: 32, align: 32, offset: 224)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1007, file: !486, line: 108, baseType: !970, size: 32, align: 32, offset: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1007, file: !486, line: 113, baseType: !1046, size: 64, align: 64, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!1014, !1014, !1014}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1007, file: !486, line: 123, baseType: !1050, size: 64, align: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!1053, !1053}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1007, file: !486, line: 130, baseType: !1056, size: 32, align: 32, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1007, file: !486, line: 136, baseType: !1058, size: 64, align: 64, offset: 512)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!1056, !1014}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1007, file: !486, line: 142, baseType: !1062, size: 64, align: 64, offset: 576)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!970, !1065, !1014, !987, !970}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1068)
!1068 = !{!1069, !1081, !1082}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1067, file: !464, line: 360, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1073, file: !464, line: 307, baseType: !987, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1073, file: !464, line: 313, baseType: !1029, size: 64, align: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1073, file: !464, line: 313, baseType: !1029, size: 64, align: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1073, file: !464, line: 318, baseType: !1029, size: 64, align: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1073, file: !464, line: 318, baseType: !1029, size: 64, align: 64, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1073, file: !464, line: 323, baseType: !970, size: 32, align: 32, offset: 320)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1067, file: !464, line: 364, baseType: !970, size: 32, align: 32, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1067, file: !464, line: 368, baseType: !970, size: 32, align: 32, offset: 96)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !984, file: !919, line: 670, baseType: !987, size: 64, align: 64, offset: 384)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !984, file: !919, line: 679, baseType: !1085, size: 64, align: 64, offset: 448)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !984, file: !919, line: 684, baseType: !970, size: 32, align: 32, offset: 512)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !984, file: !919, line: 689, baseType: !970, size: 32, align: 32, offset: 544)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !984, file: !919, line: 696, baseType: !1089, size: 64, align: 64, offset: 576)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!970, !1092}
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1094)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1095)
!1095 = !{!1096, !1097, !1099, !1100}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1094, file: !919, line: 449, baseType: !987, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1094, file: !919, line: 450, baseType: !1098, size: 64, align: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1094, file: !919, line: 451, baseType: !970, size: 32, align: 32, offset: 128)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1094, file: !919, line: 452, baseType: !987, size: 64, align: 64, offset: 192)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !984, file: !919, line: 703, baseType: !1102, size: 64, align: 64, offset: 640)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!970, !1105}
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1107)
!1107 = !{!1108, !1109, !1110, !1299, !1300, !1363, !1364, !1365, !2056, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2110, !2111, !2112, !2113, !2114, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2165, !2166, !2169, !2170, !2171, !2172, !2173, !2174, !2176, !2177, !2178, !2179, !2187, !2188, !2192, !2196, !2197, !2198}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1106, file: !919, line: 1342, baseType: !1004, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1106, file: !919, line: 1349, baseType: !1085, size: 64, align: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1106, file: !919, line: 1356, baseType: !1111, size: 64, align: 64, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1113)
!1113 = !{!1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1166, !1167, !1171, !1175, !1180, !1186, !1274, !1280, !1286, !1287, !1288, !1289, !1293}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1112, file: !919, line: 498, baseType: !987, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1112, file: !919, line: 504, baseType: !987, size: 64, align: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1112, file: !919, line: 505, baseType: !987, size: 64, align: 64, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1112, file: !919, line: 506, baseType: !987, size: 64, align: 64, offset: 192)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1112, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1112, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1112, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1112, file: !919, line: 517, baseType: !970, size: 32, align: 32, offset: 352)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1112, file: !919, line: 523, baseType: !994, size: 64, align: 64, offset: 384)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1112, file: !919, line: 526, baseType: !1004, size: 64, align: 64, offset: 448)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1112, file: !919, line: 535, baseType: !1111, size: 64, align: 64, offset: 512)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1112, file: !919, line: 539, baseType: !970, size: 32, align: 32, offset: 576)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1112, file: !919, line: 541, baseType: !1102, size: 64, align: 64, offset: 640)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1112, file: !919, line: 549, baseType: !1128, size: 64, align: 64, offset: 704)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!970, !1105, !1131}
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1134)
!1134 = !{!1135, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1162, !1163, !1164, !1165}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1133, file: !4, line: 1451, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1138, line: 94, baseType: !1139)
!1138 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1138, line: 81, size: 192, align: 64, elements: !1140)
!1140 = !{!1141, !1145, !1147}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1139, file: !1138, line: 82, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1138, line: 73, baseType: !1144)
!1144 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1138, line: 73, flags: DIFlagFwdDecl)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1139, file: !1138, line: 89, baseType: !1146, size: 64, align: 64, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1139, file: !1138, line: 93, baseType: !970, size: 32, align: 32, offset: 128)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1133, file: !4, line: 1461, baseType: !978, size: 64, align: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1133, file: !4, line: 1467, baseType: !978, size: 64, align: 64, offset: 128)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1133, file: !4, line: 1468, baseType: !1146, size: 64, align: 64, offset: 192)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1133, file: !4, line: 1469, baseType: !970, size: 32, align: 32, offset: 256)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1133, file: !4, line: 1470, baseType: !970, size: 32, align: 32, offset: 288)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1133, file: !4, line: 1474, baseType: !970, size: 32, align: 32, offset: 320)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1133, file: !4, line: 1479, baseType: !1155, size: 64, align: 64, offset: 384)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1157)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1158)
!1158 = !{!1159, !1160, !1161}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1157, file: !4, line: 1412, baseType: !1146, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1157, file: !4, line: 1413, baseType: !970, size: 32, align: 32, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1157, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1133, file: !4, line: 1480, baseType: !970, size: 32, align: 32, offset: 448)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1133, file: !4, line: 1486, baseType: !978, size: 64, align: 64, offset: 512)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1133, file: !4, line: 1488, baseType: !978, size: 64, align: 64, offset: 576)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1133, file: !4, line: 1497, baseType: !978, size: 64, align: 64, offset: 640)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1112, file: !919, line: 550, baseType: !1102, size: 64, align: 64, offset: 768)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1112, file: !919, line: 554, baseType: !1168, size: 64, align: 64, offset: 832)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!970, !1105, !1131, !1131, !970}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1112, file: !919, line: 563, baseType: !1172, size: 64, align: 64, offset: 896)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!970, !3, !970}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1112, file: !919, line: 565, baseType: !1176, size: 64, align: 64, offset: 960)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{null, !1105, !970, !1179, !1179}
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1112, file: !919, line: 570, baseType: !1181, size: 64, align: 64, offset: 1024)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!970, !1105, !970, !1014, !1184}
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1185, line: 216, baseType: !977)
!1185 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1112, file: !919, line: 581, baseType: !1187, size: 64, align: 64, offset: 1088)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!970, !1105, !970, !1190, !969}
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1194)
!1194 = !{!1195, !1199, !1201, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1228, !1230, !1231, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1193, file: !548, line: 282, baseType: !1196, size: 512, align: 64)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1146, size: 512, align: 64, elements: !1197)
!1197 = !{!1198}
!1198 = !DISubrange(count: 8)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1193, file: !548, line: 299, baseType: !1200, size: 256, align: 32, offset: 512)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !970, size: 256, align: 32, elements: !1197)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1193, file: !548, line: 315, baseType: !1202, size: 64, align: 64, offset: 768)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1193, file: !548, line: 326, baseType: !970, size: 32, align: 32, offset: 832)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1193, file: !548, line: 326, baseType: !970, size: 32, align: 32, offset: 864)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1193, file: !548, line: 334, baseType: !970, size: 32, align: 32, offset: 896)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1193, file: !548, line: 341, baseType: !970, size: 32, align: 32, offset: 928)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1193, file: !548, line: 346, baseType: !970, size: 32, align: 32, offset: 960)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1193, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1193, file: !548, line: 356, baseType: !1032, size: 64, align: 32, offset: 1024)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1193, file: !548, line: 361, baseType: !978, size: 64, align: 64, offset: 1088)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1193, file: !548, line: 369, baseType: !978, size: 64, align: 64, offset: 1152)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1193, file: !548, line: 377, baseType: !978, size: 64, align: 64, offset: 1216)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1193, file: !548, line: 382, baseType: !970, size: 32, align: 32, offset: 1280)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1193, file: !548, line: 386, baseType: !970, size: 32, align: 32, offset: 1312)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1193, file: !548, line: 391, baseType: !970, size: 32, align: 32, offset: 1344)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1193, file: !548, line: 396, baseType: !1014, size: 64, align: 64, offset: 1408)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1193, file: !548, line: 403, baseType: !1218, size: 512, align: 64, offset: 1472)
!1218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !976, size: 512, align: 64, elements: !1197)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1193, file: !548, line: 410, baseType: !970, size: 32, align: 32, offset: 1984)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1193, file: !548, line: 415, baseType: !970, size: 32, align: 32, offset: 2016)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1193, file: !548, line: 420, baseType: !970, size: 32, align: 32, offset: 2048)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1193, file: !548, line: 425, baseType: !970, size: 32, align: 32, offset: 2080)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1193, file: !548, line: 435, baseType: !978, size: 64, align: 64, offset: 2112)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1193, file: !548, line: 440, baseType: !970, size: 32, align: 32, offset: 2176)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1193, file: !548, line: 445, baseType: !976, size: 64, align: 64, offset: 2240)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1193, file: !548, line: 459, baseType: !1227, size: 512, align: 64, offset: 2304)
!1227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 512, align: 64, elements: !1197)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1193, file: !548, line: 473, baseType: !1229, size: 64, align: 64, offset: 2816)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1193, file: !548, line: 477, baseType: !970, size: 32, align: 32, offset: 2880)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1193, file: !548, line: 479, baseType: !1232, size: 64, align: 64, offset: 2944)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1236)
!1236 = !{!1237, !1238, !1239, !1240, !1245}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1235, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1235, file: !548, line: 203, baseType: !1146, size: 64, align: 64, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1235, file: !548, line: 204, baseType: !970, size: 32, align: 32, offset: 128)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1235, file: !548, line: 205, baseType: !1241, size: 64, align: 64, offset: 192)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1243, line: 86, baseType: !1244)
!1243 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1244 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1243, line: 86, flags: DIFlagFwdDecl)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1235, file: !548, line: 206, baseType: !1136, size: 64, align: 64, offset: 256)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1193, file: !548, line: 480, baseType: !970, size: 32, align: 32, offset: 3008)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1193, file: !548, line: 505, baseType: !970, size: 32, align: 32, offset: 3040)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1193, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1193, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1193, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1193, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1193, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1193, file: !548, line: 532, baseType: !978, size: 64, align: 64, offset: 3264)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1193, file: !548, line: 539, baseType: !978, size: 64, align: 64, offset: 3328)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1193, file: !548, line: 547, baseType: !978, size: 64, align: 64, offset: 3392)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1193, file: !548, line: 554, baseType: !1241, size: 64, align: 64, offset: 3456)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1193, file: !548, line: 563, baseType: !970, size: 32, align: 32, offset: 3520)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1193, file: !548, line: 572, baseType: !970, size: 32, align: 32, offset: 3552)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1193, file: !548, line: 581, baseType: !970, size: 32, align: 32, offset: 3584)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1193, file: !548, line: 588, baseType: !1261, size: 64, align: 64, offset: 3648)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !963, line: 36, baseType: !1263)
!1263 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1193, file: !548, line: 593, baseType: !970, size: 32, align: 32, offset: 3712)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1193, file: !548, line: 596, baseType: !970, size: 32, align: 32, offset: 3744)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1193, file: !548, line: 599, baseType: !1136, size: 64, align: 64, offset: 3776)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1193, file: !548, line: 605, baseType: !1136, size: 64, align: 64, offset: 3840)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1193, file: !548, line: 616, baseType: !1136, size: 64, align: 64, offset: 3904)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1193, file: !548, line: 626, baseType: !1184, size: 64, align: 64, offset: 3968)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1193, file: !548, line: 627, baseType: !1184, size: 64, align: 64, offset: 4032)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1193, file: !548, line: 628, baseType: !1184, size: 64, align: 64, offset: 4096)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1193, file: !548, line: 629, baseType: !1184, size: 64, align: 64, offset: 4160)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1193, file: !548, line: 645, baseType: !1136, size: 64, align: 64, offset: 4224)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1112, file: !919, line: 587, baseType: !1275, size: 64, align: 64, offset: 1152)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!970, !1105, !1278}
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1112, file: !919, line: 592, baseType: !1281, size: 64, align: 64, offset: 1216)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{!970, !1105, !1284}
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1112, file: !919, line: 597, baseType: !1281, size: 64, align: 64, offset: 1280)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1112, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1112, file: !919, line: 608, baseType: !1102, size: 64, align: 64, offset: 1408)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1112, file: !919, line: 617, baseType: !1290, size: 64, align: 64, offset: 1472)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{null, !1105}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1112, file: !919, line: 623, baseType: !1294, size: 64, align: 64, offset: 1536)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!970, !1105, !1297}
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1132)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1106, file: !919, line: 1365, baseType: !1014, size: 64, align: 64, offset: 192)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1106, file: !919, line: 1379, baseType: !1301, size: 64, align: 64, offset: 256)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1304)
!1304 = !{!1305, !1306, !1307, !1308, !1309, !1310, !1311, !1315, !1316, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1330, !1331, !1335, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1353, !1354, !1355, !1356, !1360, !1361, !1362}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1303, file: !650, line: 174, baseType: !1004, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1303, file: !650, line: 226, baseType: !1098, size: 64, align: 64, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1303, file: !650, line: 227, baseType: !970, size: 32, align: 32, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1303, file: !650, line: 228, baseType: !1098, size: 64, align: 64, offset: 192)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1303, file: !650, line: 229, baseType: !1098, size: 64, align: 64, offset: 256)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1303, file: !650, line: 233, baseType: !1014, size: 64, align: 64, offset: 320)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1303, file: !650, line: 235, baseType: !1312, size: 64, align: 64, offset: 384)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!970, !1014, !1146, !970}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1303, file: !650, line: 236, baseType: !1312, size: 64, align: 64, offset: 448)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1303, file: !650, line: 237, baseType: !1317, size: 64, align: 64, offset: 512)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!978, !1014, !978, !970}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1303, file: !650, line: 238, baseType: !978, size: 64, align: 64, offset: 576)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1303, file: !650, line: 239, baseType: !970, size: 32, align: 32, offset: 640)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1303, file: !650, line: 240, baseType: !970, size: 32, align: 32, offset: 672)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1303, file: !650, line: 241, baseType: !970, size: 32, align: 32, offset: 704)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1303, file: !650, line: 242, baseType: !977, size: 64, align: 64, offset: 768)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1303, file: !650, line: 243, baseType: !1098, size: 64, align: 64, offset: 832)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1303, file: !650, line: 244, baseType: !1327, size: 64, align: 64, offset: 896)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!977, !977, !965, !969}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1303, file: !650, line: 245, baseType: !970, size: 32, align: 32, offset: 960)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1303, file: !650, line: 249, baseType: !1332, size: 64, align: 64, offset: 1024)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!970, !1014, !970}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1303, file: !650, line: 255, baseType: !1336, size: 64, align: 64, offset: 1088)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{!978, !1014, !970, !978, !970}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1303, file: !650, line: 260, baseType: !970, size: 32, align: 32, offset: 1152)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1303, file: !650, line: 266, baseType: !978, size: 64, align: 64, offset: 1216)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1303, file: !650, line: 273, baseType: !970, size: 32, align: 32, offset: 1280)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1303, file: !650, line: 279, baseType: !978, size: 64, align: 64, offset: 1344)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1303, file: !650, line: 285, baseType: !970, size: 32, align: 32, offset: 1408)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1303, file: !650, line: 291, baseType: !970, size: 32, align: 32, offset: 1440)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1303, file: !650, line: 298, baseType: !970, size: 32, align: 32, offset: 1472)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1303, file: !650, line: 304, baseType: !970, size: 32, align: 32, offset: 1504)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1303, file: !650, line: 309, baseType: !987, size: 64, align: 64, offset: 1536)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1303, file: !650, line: 314, baseType: !987, size: 64, align: 64, offset: 1600)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1303, file: !650, line: 319, baseType: !1350, size: 64, align: 64, offset: 1664)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DISubroutineType(types: !1352)
!1352 = !{!970, !1014, !1146, !970, !649, !978}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1303, file: !650, line: 326, baseType: !970, size: 32, align: 32, offset: 1728)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1303, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1303, file: !650, line: 332, baseType: !978, size: 64, align: 64, offset: 1792)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1303, file: !650, line: 338, baseType: !1357, size: 64, align: 64, offset: 1856)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DISubroutineType(types: !1359)
!1359 = !{!970, !1014}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1303, file: !650, line: 340, baseType: !978, size: 64, align: 64, offset: 1920)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1303, file: !650, line: 346, baseType: !1098, size: 64, align: 64, offset: 1984)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1303, file: !650, line: 351, baseType: !970, size: 32, align: 32, offset: 2048)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1106, file: !919, line: 1386, baseType: !970, size: 32, align: 32, offset: 320)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1106, file: !919, line: 1393, baseType: !969, size: 32, align: 32, offset: 352)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1106, file: !919, line: 1405, baseType: !1366, size: 64, align: 64, offset: 384)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1369)
!1369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1370)
!1370 = !{!1371, !1372, !1373, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1842, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1942, !1948, !1949, !1953, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1985, !1986, !1987, !1988, !1989, !1990}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1369, file: !919, line: 866, baseType: !970, size: 32, align: 32)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1369, file: !919, line: 872, baseType: !970, size: 32, align: 32, offset: 32)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1369, file: !919, line: 878, baseType: !1374, size: 64, align: 64, offset: 64)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1376)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1377)
!1377 = !{!1378, !1379, !1380, !1381, !1517, !1518, !1519, !1520, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1546, !1550, !1551, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1730, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1376, file: !4, line: 1561, baseType: !1004, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1376, file: !4, line: 1562, baseType: !970, size: 32, align: 32, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1376, file: !4, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1376, file: !4, line: 1565, baseType: !1382, size: 64, align: 64, offset: 128)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1384)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1385)
!1385 = !{!1386, !1387, !1388, !1389, !1390, !1391, !1394, !1397, !1400, !1403, !1406, !1407, !1408, !1416, !1417, !1418, !1420, !1424, !1430, !1435, !1439, !1440, !1482, !1489, !1493, !1494, !1498, !1502, !1506, !1510, !1511, !1512}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1384, file: !4, line: 3475, baseType: !987, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1384, file: !4, line: 3480, baseType: !987, size: 64, align: 64, offset: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1384, file: !4, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1384, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1384, file: !4, line: 3487, baseType: !970, size: 32, align: 32, offset: 192)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1384, file: !4, line: 3488, baseType: !1392, size: 64, align: 64, offset: 256)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1384, file: !4, line: 3489, baseType: !1395, size: 64, align: 64, offset: 320)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1384, file: !4, line: 3490, baseType: !1398, size: 64, align: 64, offset: 384)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1384, file: !4, line: 3491, baseType: !1401, size: 64, align: 64, offset: 448)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1384, file: !4, line: 3492, baseType: !1404, size: 64, align: 64, offset: 512)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1384, file: !4, line: 3493, baseType: !967, size: 8, align: 8, offset: 576)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1384, file: !4, line: 3494, baseType: !1004, size: 64, align: 64, offset: 640)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1384, file: !4, line: 3495, baseType: !1409, size: 64, align: 64, offset: 704)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1411)
!1411 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1412)
!1412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1413)
!1413 = !{!1414, !1415}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1412, file: !4, line: 3402, baseType: !970, size: 32, align: 32)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1412, file: !4, line: 3403, baseType: !987, size: 64, align: 64, offset: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1384, file: !4, line: 3507, baseType: !987, size: 64, align: 64, offset: 768)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1384, file: !4, line: 3516, baseType: !970, size: 32, align: 32, offset: 832)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1384, file: !4, line: 3517, baseType: !1419, size: 64, align: 64, offset: 896)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1384, file: !4, line: 3527, baseType: !1421, size: 64, align: 64, offset: 960)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{!970, !1374}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1384, file: !4, line: 3535, baseType: !1425, size: 64, align: 64, offset: 1024)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DISubroutineType(types: !1427)
!1427 = !{!970, !1374, !1428}
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1375)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1384, file: !4, line: 3541, baseType: !1431, size: 64, align: 64, offset: 1088)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1433)
!1433 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1434)
!1434 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1384, file: !4, line: 3549, baseType: !1436, size: 64, align: 64, offset: 1152)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DISubroutineType(types: !1438)
!1438 = !{null, !1419}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1384, file: !4, line: 3551, baseType: !1421, size: 64, align: 64, offset: 1216)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1384, file: !4, line: 3552, baseType: !1441, size: 64, align: 64, offset: 1280)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DISubroutineType(types: !1443)
!1443 = !{!970, !1374, !1146, !970, !1444}
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1446)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1447)
!1447 = !{!1448, !1449, !1451, !1452, !1453, !1481}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1446, file: !4, line: 3921, baseType: !962, size: 16, align: 16)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1446, file: !4, line: 3922, baseType: !1450, size: 32, align: 32, offset: 32)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !963, line: 51, baseType: !969)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1446, file: !4, line: 3923, baseType: !1450, size: 32, align: 32, offset: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1446, file: !4, line: 3924, baseType: !969, size: 32, align: 32, offset: 96)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1446, file: !4, line: 3925, baseType: !1454, size: 64, align: 64, offset: 128)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1457)
!1457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1458)
!1458 = !{!1459, !1460, !1461, !1462, !1463, !1464, !1470, !1474, !1476, !1477, !1479, !1480}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1457, file: !4, line: 3886, baseType: !970, size: 32, align: 32)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1457, file: !4, line: 3887, baseType: !970, size: 32, align: 32, offset: 32)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1457, file: !4, line: 3888, baseType: !970, size: 32, align: 32, offset: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1457, file: !4, line: 3889, baseType: !970, size: 32, align: 32, offset: 96)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1457, file: !4, line: 3890, baseType: !970, size: 32, align: 32, offset: 128)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1457, file: !4, line: 3897, baseType: !1465, size: 768, align: 64, offset: 192)
!1465 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1466)
!1466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1467)
!1467 = !{!1468, !1469}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1466, file: !4, line: 3855, baseType: !1196, size: 512, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1466, file: !4, line: 3857, baseType: !1200, size: 256, align: 32, offset: 512)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1457, file: !4, line: 3903, baseType: !1471, size: 256, align: 64, offset: 960)
!1471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1146, size: 256, align: 64, elements: !1472)
!1472 = !{!1473}
!1473 = !DISubrange(count: 4)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1457, file: !4, line: 3904, baseType: !1475, size: 128, align: 32, offset: 1216)
!1475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !970, size: 128, align: 32, elements: !1472)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1457, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1457, file: !4, line: 3908, baseType: !1478, size: 64, align: 64, offset: 1408)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1457, file: !4, line: 3915, baseType: !1478, size: 64, align: 64, offset: 1472)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1457, file: !4, line: 3917, baseType: !970, size: 32, align: 32, offset: 1536)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1446, file: !4, line: 3926, baseType: !978, size: 64, align: 64, offset: 192)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1384, file: !4, line: 3564, baseType: !1483, size: 64, align: 64, offset: 1344)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DISubroutineType(types: !1485)
!1485 = !{!970, !1374, !1131, !1486, !1488}
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1192)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1384, file: !4, line: 3566, baseType: !1490, size: 64, align: 64, offset: 1408)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{!970, !1374, !1014, !1488, !1131}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1384, file: !4, line: 3567, baseType: !1421, size: 64, align: 64, offset: 1472)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1384, file: !4, line: 3576, baseType: !1495, size: 64, align: 64, offset: 1536)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!970, !1374, !1486}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1384, file: !4, line: 3577, baseType: !1499, size: 64, align: 64, offset: 1600)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DISubroutineType(types: !1501)
!1501 = !{!970, !1374, !1131}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1384, file: !4, line: 3584, baseType: !1503, size: 64, align: 64, offset: 1664)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DISubroutineType(types: !1505)
!1505 = !{!970, !1374, !1191}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1384, file: !4, line: 3589, baseType: !1507, size: 64, align: 64, offset: 1728)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{null, !1374}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1384, file: !4, line: 3594, baseType: !970, size: 32, align: 32, offset: 1792)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1384, file: !4, line: 3600, baseType: !987, size: 64, align: 64, offset: 1856)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1384, file: !4, line: 3609, baseType: !1513, size: 64, align: 64, offset: 1920)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1516)
!1516 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1376, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1376, file: !4, line: 1581, baseType: !969, size: 32, align: 32, offset: 224)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1376, file: !4, line: 1583, baseType: !1014, size: 64, align: 64, offset: 256)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1376, file: !4, line: 1591, baseType: !1521, size: 64, align: 64, offset: 320)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1376, file: !4, line: 1598, baseType: !1014, size: 64, align: 64, offset: 384)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1376, file: !4, line: 1606, baseType: !978, size: 64, align: 64, offset: 448)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1376, file: !4, line: 1614, baseType: !970, size: 32, align: 32, offset: 512)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1376, file: !4, line: 1622, baseType: !970, size: 32, align: 32, offset: 544)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1376, file: !4, line: 1628, baseType: !970, size: 32, align: 32, offset: 576)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1376, file: !4, line: 1636, baseType: !970, size: 32, align: 32, offset: 608)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1376, file: !4, line: 1643, baseType: !970, size: 32, align: 32, offset: 640)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1376, file: !4, line: 1657, baseType: !1146, size: 64, align: 64, offset: 704)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1376, file: !4, line: 1658, baseType: !970, size: 32, align: 32, offset: 768)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1376, file: !4, line: 1679, baseType: !1032, size: 64, align: 32, offset: 800)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1376, file: !4, line: 1688, baseType: !970, size: 32, align: 32, offset: 864)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1376, file: !4, line: 1712, baseType: !970, size: 32, align: 32, offset: 896)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1376, file: !4, line: 1729, baseType: !970, size: 32, align: 32, offset: 928)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1376, file: !4, line: 1729, baseType: !970, size: 32, align: 32, offset: 960)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1376, file: !4, line: 1744, baseType: !970, size: 32, align: 32, offset: 992)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1376, file: !4, line: 1744, baseType: !970, size: 32, align: 32, offset: 1024)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1376, file: !4, line: 1751, baseType: !970, size: 32, align: 32, offset: 1056)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1376, file: !4, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1376, file: !4, line: 1791, baseType: !1542, size: 64, align: 64, offset: 1152)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DISubroutineType(types: !1544)
!1544 = !{null, !1545, !1486, !1488, !970, !970, !970}
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1376, file: !4, line: 1808, baseType: !1547, size: 64, align: 64, offset: 1216)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DISubroutineType(types: !1549)
!1549 = !{!667, !1545, !1395}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1376, file: !4, line: 1816, baseType: !970, size: 32, align: 32, offset: 1280)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1376, file: !4, line: 1825, baseType: !1552, size: 32, align: 32, offset: 1312)
!1552 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1376, file: !4, line: 1830, baseType: !970, size: 32, align: 32, offset: 1344)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1376, file: !4, line: 1838, baseType: !1552, size: 32, align: 32, offset: 1376)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1376, file: !4, line: 1846, baseType: !970, size: 32, align: 32, offset: 1408)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1376, file: !4, line: 1851, baseType: !970, size: 32, align: 32, offset: 1440)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1376, file: !4, line: 1861, baseType: !1552, size: 32, align: 32, offset: 1472)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1376, file: !4, line: 1868, baseType: !1552, size: 32, align: 32, offset: 1504)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1376, file: !4, line: 1875, baseType: !1552, size: 32, align: 32, offset: 1536)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1376, file: !4, line: 1882, baseType: !1552, size: 32, align: 32, offset: 1568)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1376, file: !4, line: 1889, baseType: !1552, size: 32, align: 32, offset: 1600)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1376, file: !4, line: 1896, baseType: !1552, size: 32, align: 32, offset: 1632)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1376, file: !4, line: 1903, baseType: !1552, size: 32, align: 32, offset: 1664)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1376, file: !4, line: 1910, baseType: !970, size: 32, align: 32, offset: 1696)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1376, file: !4, line: 1915, baseType: !970, size: 32, align: 32, offset: 1728)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1376, file: !4, line: 1926, baseType: !1488, size: 64, align: 64, offset: 1792)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1376, file: !4, line: 1935, baseType: !1032, size: 64, align: 32, offset: 1856)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1376, file: !4, line: 1942, baseType: !970, size: 32, align: 32, offset: 1920)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1376, file: !4, line: 1948, baseType: !970, size: 32, align: 32, offset: 1952)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1376, file: !4, line: 1954, baseType: !970, size: 32, align: 32, offset: 1984)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1376, file: !4, line: 1960, baseType: !970, size: 32, align: 32, offset: 2016)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1376, file: !4, line: 1984, baseType: !970, size: 32, align: 32, offset: 2048)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1376, file: !4, line: 1991, baseType: !970, size: 32, align: 32, offset: 2080)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1376, file: !4, line: 1996, baseType: !970, size: 32, align: 32, offset: 2112)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1376, file: !4, line: 2004, baseType: !970, size: 32, align: 32, offset: 2144)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1376, file: !4, line: 2011, baseType: !970, size: 32, align: 32, offset: 2176)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1376, file: !4, line: 2018, baseType: !970, size: 32, align: 32, offset: 2208)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1376, file: !4, line: 2027, baseType: !970, size: 32, align: 32, offset: 2240)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1376, file: !4, line: 2034, baseType: !970, size: 32, align: 32, offset: 2272)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1376, file: !4, line: 2044, baseType: !970, size: 32, align: 32, offset: 2304)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1376, file: !4, line: 2054, baseType: !1582, size: 64, align: 64, offset: 2368)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1376, file: !4, line: 2061, baseType: !1582, size: 64, align: 64, offset: 2432)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1376, file: !4, line: 2066, baseType: !970, size: 32, align: 32, offset: 2496)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1376, file: !4, line: 2070, baseType: !970, size: 32, align: 32, offset: 2528)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1376, file: !4, line: 2078, baseType: !970, size: 32, align: 32, offset: 2560)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1376, file: !4, line: 2085, baseType: !970, size: 32, align: 32, offset: 2592)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1376, file: !4, line: 2092, baseType: !970, size: 32, align: 32, offset: 2624)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1376, file: !4, line: 2099, baseType: !970, size: 32, align: 32, offset: 2656)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1376, file: !4, line: 2106, baseType: !970, size: 32, align: 32, offset: 2688)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1376, file: !4, line: 2113, baseType: !970, size: 32, align: 32, offset: 2720)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1376, file: !4, line: 2120, baseType: !970, size: 32, align: 32, offset: 2752)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1376, file: !4, line: 2125, baseType: !970, size: 32, align: 32, offset: 2784)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1376, file: !4, line: 2133, baseType: !970, size: 32, align: 32, offset: 2816)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1376, file: !4, line: 2140, baseType: !970, size: 32, align: 32, offset: 2848)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1376, file: !4, line: 2145, baseType: !970, size: 32, align: 32, offset: 2880)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1376, file: !4, line: 2153, baseType: !970, size: 32, align: 32, offset: 2912)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1376, file: !4, line: 2158, baseType: !970, size: 32, align: 32, offset: 2944)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1376, file: !4, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1376, file: !4, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1376, file: !4, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1376, file: !4, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1376, file: !4, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1376, file: !4, line: 2203, baseType: !970, size: 32, align: 32, offset: 3136)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1376, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1376, file: !4, line: 2212, baseType: !970, size: 32, align: 32, offset: 3200)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1376, file: !4, line: 2213, baseType: !970, size: 32, align: 32, offset: 3232)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1376, file: !4, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1376, file: !4, line: 2232, baseType: !970, size: 32, align: 32, offset: 3296)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1376, file: !4, line: 2243, baseType: !970, size: 32, align: 32, offset: 3328)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1376, file: !4, line: 2249, baseType: !970, size: 32, align: 32, offset: 3360)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1376, file: !4, line: 2256, baseType: !970, size: 32, align: 32, offset: 3392)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1376, file: !4, line: 2263, baseType: !976, size: 64, align: 64, offset: 3456)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1376, file: !4, line: 2270, baseType: !976, size: 64, align: 64, offset: 3520)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1376, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1376, file: !4, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1376, file: !4, line: 2367, baseType: !1618, size: 64, align: 64, offset: 3648)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DISubroutineType(types: !1620)
!1620 = !{!970, !1545, !1191, !970}
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1376, file: !4, line: 2383, baseType: !970, size: 32, align: 32, offset: 3712)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1376, file: !4, line: 2386, baseType: !1552, size: 32, align: 32, offset: 3744)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1376, file: !4, line: 2387, baseType: !1552, size: 32, align: 32, offset: 3776)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1376, file: !4, line: 2394, baseType: !970, size: 32, align: 32, offset: 3808)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1376, file: !4, line: 2401, baseType: !970, size: 32, align: 32, offset: 3840)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1376, file: !4, line: 2408, baseType: !970, size: 32, align: 32, offset: 3872)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1376, file: !4, line: 2415, baseType: !970, size: 32, align: 32, offset: 3904)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1376, file: !4, line: 2422, baseType: !970, size: 32, align: 32, offset: 3936)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1376, file: !4, line: 2423, baseType: !1630, size: 64, align: 64, offset: 3968)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1632)
!1632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1633)
!1633 = !{!1634, !1635, !1636, !1637}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1632, file: !4, line: 827, baseType: !970, size: 32, align: 32)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1632, file: !4, line: 828, baseType: !970, size: 32, align: 32, offset: 32)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1632, file: !4, line: 829, baseType: !970, size: 32, align: 32, offset: 64)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1632, file: !4, line: 830, baseType: !1552, size: 32, align: 32, offset: 96)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1376, file: !4, line: 2430, baseType: !978, size: 64, align: 64, offset: 4032)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1376, file: !4, line: 2437, baseType: !978, size: 64, align: 64, offset: 4096)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1376, file: !4, line: 2444, baseType: !1552, size: 32, align: 32, offset: 4160)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1376, file: !4, line: 2451, baseType: !1552, size: 32, align: 32, offset: 4192)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1376, file: !4, line: 2458, baseType: !970, size: 32, align: 32, offset: 4224)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1376, file: !4, line: 2469, baseType: !970, size: 32, align: 32, offset: 4256)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1376, file: !4, line: 2475, baseType: !970, size: 32, align: 32, offset: 4288)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1376, file: !4, line: 2481, baseType: !970, size: 32, align: 32, offset: 4320)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1376, file: !4, line: 2485, baseType: !970, size: 32, align: 32, offset: 4352)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1376, file: !4, line: 2489, baseType: !970, size: 32, align: 32, offset: 4384)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1376, file: !4, line: 2493, baseType: !970, size: 32, align: 32, offset: 4416)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1376, file: !4, line: 2501, baseType: !970, size: 32, align: 32, offset: 4448)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1376, file: !4, line: 2506, baseType: !970, size: 32, align: 32, offset: 4480)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1376, file: !4, line: 2510, baseType: !970, size: 32, align: 32, offset: 4512)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1376, file: !4, line: 2514, baseType: !978, size: 64, align: 64, offset: 4544)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1376, file: !4, line: 2528, baseType: !1654, size: 64, align: 64, offset: 4608)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{null, !1545, !1014, !970, !970}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1376, file: !4, line: 2534, baseType: !970, size: 32, align: 32, offset: 4672)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1376, file: !4, line: 2545, baseType: !970, size: 32, align: 32, offset: 4704)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1376, file: !4, line: 2547, baseType: !970, size: 32, align: 32, offset: 4736)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1376, file: !4, line: 2549, baseType: !970, size: 32, align: 32, offset: 4768)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1376, file: !4, line: 2551, baseType: !970, size: 32, align: 32, offset: 4800)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1376, file: !4, line: 2553, baseType: !970, size: 32, align: 32, offset: 4832)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1376, file: !4, line: 2555, baseType: !970, size: 32, align: 32, offset: 4864)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1376, file: !4, line: 2557, baseType: !970, size: 32, align: 32, offset: 4896)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1376, file: !4, line: 2559, baseType: !970, size: 32, align: 32, offset: 4928)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1376, file: !4, line: 2563, baseType: !970, size: 32, align: 32, offset: 4960)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1376, file: !4, line: 2571, baseType: !1478, size: 64, align: 64, offset: 4992)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1376, file: !4, line: 2579, baseType: !1478, size: 64, align: 64, offset: 5056)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1376, file: !4, line: 2586, baseType: !970, size: 32, align: 32, offset: 5120)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1376, file: !4, line: 2615, baseType: !970, size: 32, align: 32, offset: 5152)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1376, file: !4, line: 2627, baseType: !970, size: 32, align: 32, offset: 5184)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1376, file: !4, line: 2637, baseType: !970, size: 32, align: 32, offset: 5216)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1376, file: !4, line: 2681, baseType: !970, size: 32, align: 32, offset: 5248)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1376, file: !4, line: 2709, baseType: !978, size: 64, align: 64, offset: 5312)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1376, file: !4, line: 2716, baseType: !1676, size: 64, align: 64, offset: 5376)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1678)
!1678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1679)
!1679 = !{!1680, !1681, !1682, !1683, !1684, !1685, !1686, !1690, !1694, !1695, !1696, !1697, !1703, !1704, !1705, !1706, !1707}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1678, file: !4, line: 3642, baseType: !987, size: 64, align: 64)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1678, file: !4, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1678, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1678, file: !4, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1678, file: !4, line: 3669, baseType: !970, size: 32, align: 32, offset: 160)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1678, file: !4, line: 3682, baseType: !1503, size: 64, align: 64, offset: 192)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1678, file: !4, line: 3698, baseType: !1687, size: 64, align: 64, offset: 256)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DISubroutineType(types: !1689)
!1689 = !{!970, !1374, !965, !1450}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1678, file: !4, line: 3712, baseType: !1691, size: 64, align: 64, offset: 320)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DISubroutineType(types: !1693)
!1693 = !{!970, !1374, !970, !965, !1450}
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1678, file: !4, line: 3726, baseType: !1687, size: 64, align: 64, offset: 384)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1678, file: !4, line: 3737, baseType: !1421, size: 64, align: 64, offset: 448)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1678, file: !4, line: 3746, baseType: !970, size: 32, align: 32, offset: 512)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1678, file: !4, line: 3757, baseType: !1698, size: 64, align: 64, offset: 576)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DISubroutineType(types: !1700)
!1700 = !{null, !1701}
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1678, file: !4, line: 3766, baseType: !1421, size: 64, align: 64, offset: 640)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1678, file: !4, line: 3774, baseType: !1421, size: 64, align: 64, offset: 704)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1678, file: !4, line: 3780, baseType: !970, size: 32, align: 32, offset: 768)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1678, file: !4, line: 3785, baseType: !970, size: 32, align: 32, offset: 800)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1678, file: !4, line: 3795, baseType: !1708, size: 64, align: 64, offset: 832)
!1708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1709, size: 64, align: 64)
!1709 = !DISubroutineType(types: !1710)
!1710 = !{!970, !1374, !1136}
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1376, file: !4, line: 2728, baseType: !1014, size: 64, align: 64, offset: 5440)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1376, file: !4, line: 2735, baseType: !1218, size: 512, align: 64, offset: 5504)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1376, file: !4, line: 2742, baseType: !970, size: 32, align: 32, offset: 6016)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1376, file: !4, line: 2755, baseType: !970, size: 32, align: 32, offset: 6048)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1376, file: !4, line: 2776, baseType: !970, size: 32, align: 32, offset: 6080)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1376, file: !4, line: 2783, baseType: !970, size: 32, align: 32, offset: 6112)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1376, file: !4, line: 2791, baseType: !970, size: 32, align: 32, offset: 6144)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1376, file: !4, line: 2802, baseType: !1191, size: 64, align: 64, offset: 6208)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1376, file: !4, line: 2811, baseType: !970, size: 32, align: 32, offset: 6272)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1376, file: !4, line: 2821, baseType: !970, size: 32, align: 32, offset: 6304)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1376, file: !4, line: 2830, baseType: !970, size: 32, align: 32, offset: 6336)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1376, file: !4, line: 2840, baseType: !970, size: 32, align: 32, offset: 6368)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1376, file: !4, line: 2851, baseType: !1724, size: 64, align: 64, offset: 6400)
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1725, size: 64, align: 64)
!1725 = !DISubroutineType(types: !1726)
!1726 = !{!970, !1545, !1727, !1014, !1488, !970, !970}
!1727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1728, size: 64, align: 64)
!1728 = !DISubroutineType(types: !1729)
!1729 = !{!970, !1545, !1014}
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1376, file: !4, line: 2871, baseType: !1731, size: 64, align: 64, offset: 6464)
!1731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1732, size: 64, align: 64)
!1732 = !DISubroutineType(types: !1733)
!1733 = !{!970, !1545, !1734, !1014, !1488, !970}
!1734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1735, size: 64, align: 64)
!1735 = !DISubroutineType(types: !1736)
!1736 = !{!970, !1545, !1014, !970, !970}
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1376, file: !4, line: 2878, baseType: !970, size: 32, align: 32, offset: 6528)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1376, file: !4, line: 2885, baseType: !970, size: 32, align: 32, offset: 6560)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1376, file: !4, line: 3005, baseType: !970, size: 32, align: 32, offset: 6592)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1376, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1376, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1376, file: !4, line: 3027, baseType: !909, size: 32, align: 32, offset: 6688)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1376, file: !4, line: 3037, baseType: !1146, size: 64, align: 64, offset: 6720)
