; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rmenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rmenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecTag = type { i32, i32 }
%struct.AVOutputFormat = type { i8*, i8*, i8*, i8*, i32, i32, i32, i32, %struct.AVCodecTag**, %struct.AVClass*, %struct.AVOutputFormat*, i32, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*, %struct.AVPacket*, i32)*, i32 (i32, i32)*, void (%struct.AVFormatContext*, i32, i64*, i64*)*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i32 (%struct.AVFormatContext*, i32, %struct.AVFrame**, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32, i32 (%struct.AVFormatContext*)*, void (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)* }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!859 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!860 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!861 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!862 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!863 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!864 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVRounding", file: !917, line: 79, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "./libavutil/mathematics.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!918 = !{!919, !920, !921, !922, !923, !924}
!919 = !DIEnumerator(name: "AV_ROUND_ZERO", value: 0)
!920 = !DIEnumerator(name: "AV_ROUND_INF", value: 1)
!921 = !DIEnumerator(name: "AV_ROUND_DOWN", value: 2)
!922 = !DIEnumerator(name: "AV_ROUND_UP", value: 3)
!923 = !DIEnumerator(name: "AV_ROUND_NEAR_INF", value: 5)
!924 = !DIEnumerator(name: "AV_ROUND_PASS_MINMAX", value: 8192)
!925 = !{!926, !927}
!926 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!927 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!928 = !{!929}
!929 = distinct !DIGlobalVariable(name: "ff_rm_muxer", scope: !0, file: !930, line: 469, type: !931, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_rm_muxer)
!930 = !DIFile(filename: "libavformat/rmenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !897, line: 624, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !933)
!933 = !{!934, !938, !939, !940, !941, !942, !943, !944, !945, !955, !997, !999, !1000, !2111, !2112, !2113, !2117, !2121, !2125, !2126, !2131, !2132, !2133, !2134, !2135, !2136, !2140}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !932, file: !897, line: 498, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !932, file: !897, line: 504, baseType: !935, size: 64, align: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !932, file: !897, line: 505, baseType: !935, size: 64, align: 64, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !932, file: !897, line: 506, baseType: !935, size: 64, align: 64, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !932, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !932, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !932, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !932, file: !897, line: 517, baseType: !926, size: 32, align: 32, offset: 352)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !932, file: !897, line: 523, baseType: !946, size: 64, align: 64, offset: 384)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !951, line: 44, size: 64, align: 32, elements: !952)
!951 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !950, file: !951, line: 45, baseType: !3, size: 32, align: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !950, file: !951, line: 46, baseType: !927, size: 32, align: 32, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !932, file: !897, line: 526, baseType: !956, size: 64, align: 64, offset: 448)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !960)
!960 = !{!961, !962, !967, !971, !972, !973, !974, !978, !984, !986, !990}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !959, file: !464, line: 72, baseType: !935, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !959, file: !464, line: 78, baseType: !963, size: 64, align: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!935, !966}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !959, file: !464, line: 85, baseType: !968, size: 64, align: 64, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !959, file: !464, line: 93, baseType: !926, size: 32, align: 32, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !959, file: !464, line: 99, baseType: !926, size: 32, align: 32, offset: 224)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !959, file: !464, line: 108, baseType: !926, size: 32, align: 32, offset: 256)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !959, file: !464, line: 113, baseType: !975, size: 64, align: 64, offset: 320)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!966, !966, !966}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !959, file: !464, line: 123, baseType: !979, size: 64, align: 64, offset: 384)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!982, !982}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !959, file: !464, line: 130, baseType: !985, size: 32, align: 32, offset: 448)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !959, file: !464, line: 136, baseType: !987, size: 64, align: 64, offset: 512)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!985, !966}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !959, file: !464, line: 142, baseType: !991, size: 64, align: 64, offset: 576)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!926, !994, !966, !935, !926}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !932, file: !897, line: 535, baseType: !998, size: 64, align: 64, offset: 512)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !932, file: !897, line: 539, baseType: !926, size: 32, align: 32, offset: 576)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !932, file: !897, line: 541, baseType: !1001, size: 64, align: 64, offset: 640)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!926, !1004}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1006)
!1006 = !{!1007, !1008, !1109, !1110, !1111, !1177, !1178, !1179, !1965, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2019, !2020, !2021, !2022, !2023, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2074, !2075, !2078, !2079, !2080, !2081, !2082, !2083, !2088, !2089, !2090, !2091, !2099, !2100, !2104, !2108, !2109, !2110}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1005, file: !897, line: 1342, baseType: !956, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1005, file: !897, line: 1349, baseType: !1009, size: 64, align: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1036, !1037, !1080, !1081, !1085, !1090, !1091, !1092, !1096, !1102, !1108}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1010, file: !897, line: 638, baseType: !935, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1010, file: !897, line: 645, baseType: !935, size: 64, align: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1010, file: !897, line: 652, baseType: !926, size: 32, align: 32, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1010, file: !897, line: 659, baseType: !935, size: 64, align: 64, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1010, file: !897, line: 661, baseType: !946, size: 64, align: 64, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1010, file: !897, line: 663, baseType: !956, size: 64, align: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1010, file: !897, line: 670, baseType: !935, size: 64, align: 64, offset: 384)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1010, file: !897, line: 679, baseType: !1009, size: 64, align: 64, offset: 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1010, file: !897, line: 684, baseType: !926, size: 32, align: 32, offset: 512)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1010, file: !897, line: 689, baseType: !926, size: 32, align: 32, offset: 544)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1010, file: !897, line: 696, baseType: !1023, size: 64, align: 64, offset: 576)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!926, !1026}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1029)
!1029 = !{!1030, !1031, !1034, !1035}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1028, file: !897, line: 449, baseType: !935, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1028, file: !897, line: 450, baseType: !1032, size: 64, align: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1028, file: !897, line: 451, baseType: !926, size: 32, align: 32, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1028, file: !897, line: 452, baseType: !935, size: 64, align: 64, offset: 192)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1010, file: !897, line: 703, baseType: !1001, size: 64, align: 64, offset: 640)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1010, file: !897, line: 714, baseType: !1038, size: 64, align: 64, offset: 704)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!926, !1004, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1044)
!1044 = !{!1045, !1060, !1063, !1064, !1065, !1066, !1067, !1068, !1076, !1077, !1078, !1079}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1043, file: !4, line: 1451, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1048, line: 94, baseType: !1049)
!1048 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1048, line: 81, size: 192, align: 64, elements: !1050)
!1050 = !{!1051, !1055, !1059}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1049, file: !1048, line: 82, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1048, line: 73, baseType: !1054)
!1054 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1048, line: 73, flags: DIFlagFwdDecl)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1049, file: !1048, line: 89, baseType: !1056, size: 64, align: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1058, line: 48, baseType: !1033)
!1058 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1049, file: !1048, line: 93, baseType: !926, size: 32, align: 32, offset: 128)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1043, file: !4, line: 1461, baseType: !1061, size: 64, align: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1058, line: 40, baseType: !1062)
!1062 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1043, file: !4, line: 1467, baseType: !1061, size: 64, align: 64, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1043, file: !4, line: 1468, baseType: !1056, size: 64, align: 64, offset: 192)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1043, file: !4, line: 1469, baseType: !926, size: 32, align: 32, offset: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1043, file: !4, line: 1470, baseType: !926, size: 32, align: 32, offset: 288)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1043, file: !4, line: 1474, baseType: !926, size: 32, align: 32, offset: 320)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1043, file: !4, line: 1479, baseType: !1069, size: 64, align: 64, offset: 384)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1072)
!1072 = !{!1073, !1074, !1075}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1071, file: !4, line: 1412, baseType: !1056, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1071, file: !4, line: 1413, baseType: !926, size: 32, align: 32, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1071, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1043, file: !4, line: 1480, baseType: !926, size: 32, align: 32, offset: 448)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1043, file: !4, line: 1486, baseType: !1061, size: 64, align: 64, offset: 512)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1043, file: !4, line: 1488, baseType: !1061, size: 64, align: 64, offset: 576)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1043, file: !4, line: 1497, baseType: !1061, size: 64, align: 64, offset: 640)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1010, file: !897, line: 720, baseType: !1001, size: 64, align: 64, offset: 768)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1010, file: !897, line: 730, baseType: !1082, size: 64, align: 64, offset: 832)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!926, !1004, !926, !1061, !926}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1010, file: !897, line: 737, baseType: !1086, size: 64, align: 64, offset: 896)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!1061, !1004, !926, !1089, !1061}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1010, file: !897, line: 744, baseType: !1001, size: 64, align: 64, offset: 960)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1010, file: !897, line: 750, baseType: !1001, size: 64, align: 64, offset: 1024)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1010, file: !897, line: 758, baseType: !1093, size: 64, align: 64, offset: 1088)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!926, !1004, !926, !1061, !1061, !1061, !926}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1010, file: !897, line: 764, baseType: !1097, size: 64, align: 64, offset: 1152)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!926, !1004, !1100}
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1010, file: !897, line: 770, baseType: !1103, size: 64, align: 64, offset: 1216)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!926, !1004, !1106}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1010, file: !897, line: 776, baseType: !1103, size: 64, align: 64, offset: 1280)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1005, file: !897, line: 1356, baseType: !998, size: 64, align: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1005, file: !897, line: 1365, baseType: !966, size: 64, align: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1005, file: !897, line: 1379, baseType: !1112, size: 64, align: 64, offset: 256)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !515, line: 352, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !515, line: 161, size: 2112, align: 64, elements: !1115)
!1115 = !{!1116, !1117, !1118, !1119, !1120, !1121, !1122, !1126, !1127, !1131, !1132, !1133, !1134, !1135, !1137, !1138, !1144, !1145, !1149, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1167, !1168, !1169, !1170, !1174, !1175, !1176}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1114, file: !515, line: 174, baseType: !956, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1114, file: !515, line: 226, baseType: !1032, size: 64, align: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1114, file: !515, line: 227, baseType: !926, size: 32, align: 32, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1114, file: !515, line: 228, baseType: !1032, size: 64, align: 64, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1114, file: !515, line: 229, baseType: !1032, size: 64, align: 64, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1114, file: !515, line: 233, baseType: !966, size: 64, align: 64, offset: 320)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1114, file: !515, line: 235, baseType: !1123, size: 64, align: 64, offset: 384)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!926, !966, !1056, !926}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1114, file: !515, line: 236, baseType: !1123, size: 64, align: 64, offset: 448)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1114, file: !515, line: 237, baseType: !1128, size: 64, align: 64, offset: 512)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!1061, !966, !1061, !926}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1114, file: !515, line: 238, baseType: !1061, size: 64, align: 64, offset: 576)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1114, file: !515, line: 239, baseType: !926, size: 32, align: 32, offset: 640)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1114, file: !515, line: 240, baseType: !926, size: 32, align: 32, offset: 672)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1114, file: !515, line: 241, baseType: !926, size: 32, align: 32, offset: 704)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1114, file: !515, line: 242, baseType: !1136, size: 64, align: 64, offset: 768)
!1136 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1114, file: !515, line: 243, baseType: !1032, size: 64, align: 64, offset: 832)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1114, file: !515, line: 244, baseType: !1139, size: 64, align: 64, offset: 896)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!1136, !1136, !1142, !927}
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1057)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1114, file: !515, line: 245, baseType: !926, size: 32, align: 32, offset: 960)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1114, file: !515, line: 249, baseType: !1146, size: 64, align: 64, offset: 1024)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!926, !966, !926}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1114, file: !515, line: 255, baseType: !1150, size: 64, align: 64, offset: 1088)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!1061, !966, !926, !1061, !926}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1114, file: !515, line: 260, baseType: !926, size: 32, align: 32, offset: 1152)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1114, file: !515, line: 266, baseType: !1061, size: 64, align: 64, offset: 1216)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1114, file: !515, line: 273, baseType: !926, size: 32, align: 32, offset: 1280)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1114, file: !515, line: 279, baseType: !1061, size: 64, align: 64, offset: 1344)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1114, file: !515, line: 285, baseType: !926, size: 32, align: 32, offset: 1408)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1114, file: !515, line: 291, baseType: !926, size: 32, align: 32, offset: 1440)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1114, file: !515, line: 298, baseType: !926, size: 32, align: 32, offset: 1472)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1114, file: !515, line: 304, baseType: !926, size: 32, align: 32, offset: 1504)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1114, file: !515, line: 309, baseType: !935, size: 64, align: 64, offset: 1536)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1114, file: !515, line: 314, baseType: !935, size: 64, align: 64, offset: 1600)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1114, file: !515, line: 319, baseType: !1164, size: 64, align: 64, offset: 1664)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!926, !966, !1056, !926, !514, !1061}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1114, file: !515, line: 326, baseType: !926, size: 32, align: 32, offset: 1728)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1114, file: !515, line: 331, baseType: !514, size: 32, align: 32, offset: 1760)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1114, file: !515, line: 332, baseType: !1061, size: 64, align: 64, offset: 1792)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1114, file: !515, line: 338, baseType: !1171, size: 64, align: 64, offset: 1856)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!926, !966}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1114, file: !515, line: 340, baseType: !1061, size: 64, align: 64, offset: 1920)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1114, file: !515, line: 346, baseType: !1032, size: 64, align: 64, offset: 1984)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1114, file: !515, line: 351, baseType: !926, size: 32, align: 32, offset: 2048)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1005, file: !897, line: 1386, baseType: !926, size: 32, align: 32, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1005, file: !897, line: 1393, baseType: !927, size: 32, align: 32, offset: 352)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1005, file: !897, line: 1405, baseType: !1180, size: 64, align: 64, offset: 384)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1184)
!1184 = !{!1185, !1186, !1187, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1750, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1851, !1857, !1858, !1862, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1894, !1895, !1896, !1897, !1898, !1899}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1183, file: !897, line: 866, baseType: !926, size: 32, align: 32)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1183, file: !897, line: 872, baseType: !926, size: 32, align: 32, offset: 32)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1183, file: !897, line: 878, baseType: !1188, size: 64, align: 64, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1191)
!1191 = !{!1192, !1193, !1194, !1195, !1425, !1426, !1427, !1428, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1454, !1458, !1459, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1638, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1190, file: !4, line: 1561, baseType: !956, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1190, file: !4, line: 1562, baseType: !926, size: 32, align: 32, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1190, file: !4, line: 1564, baseType: !523, size: 32, align: 32, offset: 96)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1190, file: !4, line: 1565, baseType: !1196, size: 64, align: 64, offset: 128)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1199)
!1199 = !{!1200, !1201, !1202, !1203, !1204, !1205, !1214, !1217, !1220, !1223, !1227, !1228, !1229, !1237, !1238, !1239, !1241, !1245, !1251, !1256, !1260, !1261, !1309, !1396, !1400, !1401, !1405, !1409, !1414, !1418, !1419, !1420}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1198, file: !4, line: 3475, baseType: !935, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1198, file: !4, line: 3480, baseType: !935, size: 64, align: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1198, file: !4, line: 3481, baseType: !523, size: 32, align: 32, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1198, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1198, file: !4, line: 3487, baseType: !926, size: 32, align: 32, offset: 192)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1198, file: !4, line: 3488, baseType: !1206, size: 64, align: 64, offset: 256)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1208)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1209, line: 61, baseType: !1210)
!1209 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1209, line: 58, size: 64, align: 32, elements: !1211)
!1211 = !{!1212, !1213}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1210, file: !1209, line: 59, baseType: !926, size: 32, align: 32)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1210, file: !1209, line: 60, baseType: !926, size: 32, align: 32, offset: 32)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1198, file: !4, line: 3489, baseType: !1215, size: 64, align: 64, offset: 320)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1198, file: !4, line: 3490, baseType: !1218, size: 64, align: 64, offset: 384)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1198, file: !4, line: 3491, baseType: !1221, size: 64, align: 64, offset: 448)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1198, file: !4, line: 3492, baseType: !1224, size: 64, align: 64, offset: 512)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1226)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1058, line: 55, baseType: !1136)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1198, file: !4, line: 3493, baseType: !1057, size: 8, align: 8, offset: 576)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1198, file: !4, line: 3494, baseType: !956, size: 64, align: 64, offset: 640)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1198, file: !4, line: 3495, baseType: !1230, size: 64, align: 64, offset: 704)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1232)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1234)
!1234 = !{!1235, !1236}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1233, file: !4, line: 3402, baseType: !926, size: 32, align: 32)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1233, file: !4, line: 3403, baseType: !935, size: 64, align: 64, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1198, file: !4, line: 3507, baseType: !935, size: 64, align: 64, offset: 768)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1198, file: !4, line: 3516, baseType: !926, size: 32, align: 32, offset: 832)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1198, file: !4, line: 3517, baseType: !1240, size: 64, align: 64, offset: 896)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1198, file: !4, line: 3527, baseType: !1242, size: 64, align: 64, offset: 960)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{!926, !1188}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1198, file: !4, line: 3535, baseType: !1246, size: 64, align: 64, offset: 1024)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!926, !1188, !1249}
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1189)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1198, file: !4, line: 3541, baseType: !1252, size: 64, align: 64, offset: 1088)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1254)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1255)
!1255 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1198, file: !4, line: 3549, baseType: !1257, size: 64, align: 64, offset: 1152)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{null, !1240}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1198, file: !4, line: 3551, baseType: !1242, size: 64, align: 64, offset: 1216)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1198, file: !4, line: 3552, baseType: !1262, size: 64, align: 64, offset: 1280)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!926, !1188, !1056, !926, !1265}
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1267)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1268)
!1268 = !{!1269, !1272, !1274, !1275, !1276, !1308}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1267, file: !4, line: 3921, baseType: !1270, size: 16, align: 16)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1058, line: 49, baseType: !1271)
!1271 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1267, file: !4, line: 3922, baseType: !1273, size: 32, align: 32, offset: 32)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1058, line: 51, baseType: !927)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1267, file: !4, line: 3923, baseType: !1273, size: 32, align: 32, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1267, file: !4, line: 3924, baseType: !927, size: 32, align: 32, offset: 96)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1267, file: !4, line: 3925, baseType: !1277, size: 64, align: 64, offset: 128)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1280)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1281)
!1281 = !{!1282, !1283, !1284, !1285, !1286, !1287, !1297, !1301, !1303, !1304, !1306, !1307}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1280, file: !4, line: 3886, baseType: !926, size: 32, align: 32)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1280, file: !4, line: 3887, baseType: !926, size: 32, align: 32, offset: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1280, file: !4, line: 3888, baseType: !926, size: 32, align: 32, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1280, file: !4, line: 3889, baseType: !926, size: 32, align: 32, offset: 96)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1280, file: !4, line: 3890, baseType: !926, size: 32, align: 32, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1280, file: !4, line: 3897, baseType: !1288, size: 768, align: 64, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1289)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1290)
!1290 = !{!1291, !1295}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1289, file: !4, line: 3855, baseType: !1292, size: 512, align: 64)
!1292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1056, size: 512, align: 64, elements: !1293)
!1293 = !{!1294}
!1294 = !DISubrange(count: 8)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1289, file: !4, line: 3857, baseType: !1296, size: 256, align: 32, offset: 512)
!1296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 256, align: 32, elements: !1293)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1280, file: !4, line: 3903, baseType: !1298, size: 256, align: 64, offset: 960)
!1298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1056, size: 256, align: 64, elements: !1299)
!1299 = !{!1300}
!1300 = !DISubrange(count: 4)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1280, file: !4, line: 3904, baseType: !1302, size: 128, align: 32, offset: 1216)
!1302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 128, align: 32, elements: !1299)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1280, file: !4, line: 3906, baseType: !750, size: 32, align: 32, offset: 1344)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1280, file: !4, line: 3908, baseType: !1305, size: 64, align: 64, offset: 1408)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1280, file: !4, line: 3915, baseType: !1305, size: 64, align: 64, offset: 1472)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1280, file: !4, line: 3917, baseType: !926, size: 32, align: 32, offset: 1536)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1267, file: !4, line: 3926, baseType: !1061, size: 64, align: 64, offset: 192)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1198, file: !4, line: 3564, baseType: !1310, size: 64, align: 64, offset: 1344)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DISubroutineType(types: !1312)
!1312 = !{!926, !1188, !1041, !1313, !1395}
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1315)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !767, line: 646, baseType: !1316)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !767, line: 268, size: 4288, align: 64, elements: !1317)
!1317 = !{!1318, !1319, !1320, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1347, !1349, !1350, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1383, !1384, !1385, !1386, !1387, !1388, !1391, !1392, !1393, !1394}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1316, file: !767, line: 282, baseType: !1292, size: 512, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1316, file: !767, line: 299, baseType: !1296, size: 256, align: 32, offset: 512)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1316, file: !767, line: 315, baseType: !1321, size: 64, align: 64, offset: 768)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1316, file: !767, line: 326, baseType: !926, size: 32, align: 32, offset: 832)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1316, file: !767, line: 326, baseType: !926, size: 32, align: 32, offset: 864)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1316, file: !767, line: 334, baseType: !926, size: 32, align: 32, offset: 896)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1316, file: !767, line: 341, baseType: !926, size: 32, align: 32, offset: 928)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1316, file: !767, line: 346, baseType: !926, size: 32, align: 32, offset: 960)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1316, file: !767, line: 351, baseType: !756, size: 32, align: 32, offset: 992)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1316, file: !767, line: 356, baseType: !1208, size: 64, align: 32, offset: 1024)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1316, file: !767, line: 361, baseType: !1061, size: 64, align: 64, offset: 1088)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1316, file: !767, line: 369, baseType: !1061, size: 64, align: 64, offset: 1152)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1316, file: !767, line: 377, baseType: !1061, size: 64, align: 64, offset: 1216)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1316, file: !767, line: 382, baseType: !926, size: 32, align: 32, offset: 1280)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1316, file: !767, line: 386, baseType: !926, size: 32, align: 32, offset: 1312)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1316, file: !767, line: 391, baseType: !926, size: 32, align: 32, offset: 1344)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1316, file: !767, line: 396, baseType: !966, size: 64, align: 64, offset: 1408)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1316, file: !767, line: 403, baseType: !1337, size: 512, align: 64, offset: 1472)
!1337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1226, size: 512, align: 64, elements: !1293)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1316, file: !767, line: 410, baseType: !926, size: 32, align: 32, offset: 1984)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1316, file: !767, line: 415, baseType: !926, size: 32, align: 32, offset: 2016)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1316, file: !767, line: 420, baseType: !926, size: 32, align: 32, offset: 2048)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1316, file: !767, line: 425, baseType: !926, size: 32, align: 32, offset: 2080)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1316, file: !767, line: 435, baseType: !1061, size: 64, align: 64, offset: 2112)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1316, file: !767, line: 440, baseType: !926, size: 32, align: 32, offset: 2176)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1316, file: !767, line: 445, baseType: !1226, size: 64, align: 64, offset: 2240)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1316, file: !767, line: 459, baseType: !1346, size: 512, align: 64, offset: 2304)
!1346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1046, size: 512, align: 64, elements: !1293)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1316, file: !767, line: 473, baseType: !1348, size: 64, align: 64, offset: 2816)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1316, file: !767, line: 477, baseType: !926, size: 32, align: 32, offset: 2880)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1316, file: !767, line: 479, baseType: !1351, size: 64, align: 64, offset: 2944)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !767, line: 207, baseType: !1354)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !767, line: 201, size: 320, align: 64, elements: !1355)
!1355 = !{!1356, !1357, !1358, !1359, !1364}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1354, file: !767, line: 202, baseType: !766, size: 32, align: 32)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1354, file: !767, line: 203, baseType: !1056, size: 64, align: 64, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1354, file: !767, line: 204, baseType: !926, size: 32, align: 32, offset: 128)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1354, file: !767, line: 205, baseType: !1360, size: 64, align: 64, offset: 192)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1362, line: 86, baseType: !1363)
!1362 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1363 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1362, line: 86, flags: DIFlagFwdDecl)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1354, file: !767, line: 206, baseType: !1046, size: 64, align: 64, offset: 256)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1316, file: !767, line: 480, baseType: !926, size: 32, align: 32, offset: 3008)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1316, file: !767, line: 505, baseType: !926, size: 32, align: 32, offset: 3040)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1316, file: !767, line: 512, baseType: !790, size: 32, align: 32, offset: 3072)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1316, file: !767, line: 514, baseType: !796, size: 32, align: 32, offset: 3104)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1316, file: !767, line: 516, baseType: !814, size: 32, align: 32, offset: 3136)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1316, file: !767, line: 523, baseType: !838, size: 32, align: 32, offset: 3168)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1316, file: !767, line: 525, baseType: !857, size: 32, align: 32, offset: 3200)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1316, file: !767, line: 532, baseType: !1061, size: 64, align: 64, offset: 3264)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1316, file: !767, line: 539, baseType: !1061, size: 64, align: 64, offset: 3328)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1316, file: !767, line: 547, baseType: !1061, size: 64, align: 64, offset: 3392)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1316, file: !767, line: 554, baseType: !1360, size: 64, align: 64, offset: 3456)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1316, file: !767, line: 563, baseType: !926, size: 32, align: 32, offset: 3520)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1316, file: !767, line: 572, baseType: !926, size: 32, align: 32, offset: 3552)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1316, file: !767, line: 581, baseType: !926, size: 32, align: 32, offset: 3584)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1316, file: !767, line: 588, baseType: !1380, size: 64, align: 64, offset: 3648)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1058, line: 36, baseType: !1382)
!1382 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1316, file: !767, line: 593, baseType: !926, size: 32, align: 32, offset: 3712)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1316, file: !767, line: 596, baseType: !926, size: 32, align: 32, offset: 3744)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1316, file: !767, line: 599, baseType: !1046, size: 64, align: 64, offset: 3776)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1316, file: !767, line: 605, baseType: !1046, size: 64, align: 64, offset: 3840)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1316, file: !767, line: 616, baseType: !1046, size: 64, align: 64, offset: 3904)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1316, file: !767, line: 626, baseType: !1389, size: 64, align: 64, offset: 3968)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1390, line: 216, baseType: !1136)
!1390 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1316, file: !767, line: 627, baseType: !1389, size: 64, align: 64, offset: 4032)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1316, file: !767, line: 628, baseType: !1389, size: 64, align: 64, offset: 4096)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1316, file: !767, line: 629, baseType: !1389, size: 64, align: 64, offset: 4160)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1316, file: !767, line: 645, baseType: !1046, size: 64, align: 64, offset: 4224)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1198, file: !4, line: 3566, baseType: !1397, size: 64, align: 64, offset: 1408)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DISubroutineType(types: !1399)
!1399 = !{!926, !1188, !966, !1395, !1041}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1198, file: !4, line: 3567, baseType: !1242, size: 64, align: 64, offset: 1472)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1198, file: !4, line: 3576, baseType: !1402, size: 64, align: 64, offset: 1536)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DISubroutineType(types: !1404)
!1404 = !{!926, !1188, !1313}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1198, file: !4, line: 3577, baseType: !1406, size: 64, align: 64, offset: 1600)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DISubroutineType(types: !1408)
!1408 = !{!926, !1188, !1041}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1198, file: !4, line: 3584, baseType: !1410, size: 64, align: 64, offset: 1664)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DISubroutineType(types: !1412)
!1412 = !{!926, !1188, !1413}
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1198, file: !4, line: 3589, baseType: !1415, size: 64, align: 64, offset: 1728)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{null, !1188}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1198, file: !4, line: 3594, baseType: !926, size: 32, align: 32, offset: 1792)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1198, file: !4, line: 3600, baseType: !935, size: 64, align: 64, offset: 1856)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1198, file: !4, line: 3609, baseType: !1421, size: 64, align: 64, offset: 1920)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1424)
!1424 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1190, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1190, file: !4, line: 1581, baseType: !927, size: 32, align: 32, offset: 224)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1190, file: !4, line: 1583, baseType: !966, size: 64, align: 64, offset: 256)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1190, file: !4, line: 1591, baseType: !1429, size: 64, align: 64, offset: 320)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1190, file: !4, line: 1598, baseType: !966, size: 64, align: 64, offset: 384)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1190, file: !4, line: 1606, baseType: !1061, size: 64, align: 64, offset: 448)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1190, file: !4, line: 1614, baseType: !926, size: 32, align: 32, offset: 512)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1190, file: !4, line: 1622, baseType: !926, size: 32, align: 32, offset: 544)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1190, file: !4, line: 1628, baseType: !926, size: 32, align: 32, offset: 576)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1190, file: !4, line: 1636, baseType: !926, size: 32, align: 32, offset: 608)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1190, file: !4, line: 1643, baseType: !926, size: 32, align: 32, offset: 640)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1190, file: !4, line: 1657, baseType: !1056, size: 64, align: 64, offset: 704)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1190, file: !4, line: 1658, baseType: !926, size: 32, align: 32, offset: 768)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1190, file: !4, line: 1679, baseType: !1208, size: 64, align: 32, offset: 800)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1190, file: !4, line: 1688, baseType: !926, size: 32, align: 32, offset: 864)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1190, file: !4, line: 1712, baseType: !926, size: 32, align: 32, offset: 896)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1190, file: !4, line: 1729, baseType: !926, size: 32, align: 32, offset: 928)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1190, file: !4, line: 1729, baseType: !926, size: 32, align: 32, offset: 960)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1190, file: !4, line: 1744, baseType: !926, size: 32, align: 32, offset: 992)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1190, file: !4, line: 1744, baseType: !926, size: 32, align: 32, offset: 1024)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1190, file: !4, line: 1751, baseType: !926, size: 32, align: 32, offset: 1056)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1190, file: !4, line: 1766, baseType: !533, size: 32, align: 32, offset: 1088)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1190, file: !4, line: 1791, baseType: !1450, size: 64, align: 64, offset: 1152)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DISubroutineType(types: !1452)
!1452 = !{null, !1453, !1313, !1395, !926, !926, !926}
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1190, file: !4, line: 1808, baseType: !1455, size: 64, align: 64, offset: 1216)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{!533, !1453, !1215}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1190, file: !4, line: 1816, baseType: !926, size: 32, align: 32, offset: 1280)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1190, file: !4, line: 1825, baseType: !1460, size: 32, align: 32, offset: 1312)
!1460 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1190, file: !4, line: 1830, baseType: !926, size: 32, align: 32, offset: 1344)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1190, file: !4, line: 1838, baseType: !1460, size: 32, align: 32, offset: 1376)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1190, file: !4, line: 1846, baseType: !926, size: 32, align: 32, offset: 1408)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1190, file: !4, line: 1851, baseType: !926, size: 32, align: 32, offset: 1440)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1190, file: !4, line: 1861, baseType: !1460, size: 32, align: 32, offset: 1472)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1190, file: !4, line: 1868, baseType: !1460, size: 32, align: 32, offset: 1504)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1190, file: !4, line: 1875, baseType: !1460, size: 32, align: 32, offset: 1536)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1190, file: !4, line: 1882, baseType: !1460, size: 32, align: 32, offset: 1568)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1190, file: !4, line: 1889, baseType: !1460, size: 32, align: 32, offset: 1600)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1190, file: !4, line: 1896, baseType: !1460, size: 32, align: 32, offset: 1632)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1190, file: !4, line: 1903, baseType: !1460, size: 32, align: 32, offset: 1664)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1190, file: !4, line: 1910, baseType: !926, size: 32, align: 32, offset: 1696)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1190, file: !4, line: 1915, baseType: !926, size: 32, align: 32, offset: 1728)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1190, file: !4, line: 1926, baseType: !1395, size: 64, align: 64, offset: 1792)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1190, file: !4, line: 1935, baseType: !1208, size: 64, align: 32, offset: 1856)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1190, file: !4, line: 1942, baseType: !926, size: 32, align: 32, offset: 1920)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1190, file: !4, line: 1948, baseType: !926, size: 32, align: 32, offset: 1952)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1190, file: !4, line: 1954, baseType: !926, size: 32, align: 32, offset: 1984)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1190, file: !4, line: 1960, baseType: !926, size: 32, align: 32, offset: 2016)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1190, file: !4, line: 1984, baseType: !926, size: 32, align: 32, offset: 2048)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1190, file: !4, line: 1991, baseType: !926, size: 32, align: 32, offset: 2080)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1190, file: !4, line: 1996, baseType: !926, size: 32, align: 32, offset: 2112)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1190, file: !4, line: 2004, baseType: !926, size: 32, align: 32, offset: 2144)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1190, file: !4, line: 2011, baseType: !926, size: 32, align: 32, offset: 2176)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1190, file: !4, line: 2018, baseType: !926, size: 32, align: 32, offset: 2208)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1190, file: !4, line: 2027, baseType: !926, size: 32, align: 32, offset: 2240)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1190, file: !4, line: 2034, baseType: !926, size: 32, align: 32, offset: 2272)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1190, file: !4, line: 2044, baseType: !926, size: 32, align: 32, offset: 2304)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1190, file: !4, line: 2054, baseType: !1490, size: 64, align: 64, offset: 2368)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1190, file: !4, line: 2061, baseType: !1490, size: 64, align: 64, offset: 2432)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1190, file: !4, line: 2066, baseType: !926, size: 32, align: 32, offset: 2496)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1190, file: !4, line: 2070, baseType: !926, size: 32, align: 32, offset: 2528)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1190, file: !4, line: 2078, baseType: !926, size: 32, align: 32, offset: 2560)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1190, file: !4, line: 2085, baseType: !926, size: 32, align: 32, offset: 2592)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1190, file: !4, line: 2092, baseType: !926, size: 32, align: 32, offset: 2624)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1190, file: !4, line: 2099, baseType: !926, size: 32, align: 32, offset: 2656)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1190, file: !4, line: 2106, baseType: !926, size: 32, align: 32, offset: 2688)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1190, file: !4, line: 2113, baseType: !926, size: 32, align: 32, offset: 2720)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1190, file: !4, line: 2120, baseType: !926, size: 32, align: 32, offset: 2752)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1190, file: !4, line: 2125, baseType: !926, size: 32, align: 32, offset: 2784)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1190, file: !4, line: 2133, baseType: !926, size: 32, align: 32, offset: 2816)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1190, file: !4, line: 2140, baseType: !926, size: 32, align: 32, offset: 2848)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1190, file: !4, line: 2145, baseType: !926, size: 32, align: 32, offset: 2880)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1190, file: !4, line: 2153, baseType: !926, size: 32, align: 32, offset: 2912)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1190, file: !4, line: 2158, baseType: !926, size: 32, align: 32, offset: 2944)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1190, file: !4, line: 2166, baseType: !796, size: 32, align: 32, offset: 2976)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1190, file: !4, line: 2173, baseType: !814, size: 32, align: 32, offset: 3008)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1190, file: !4, line: 2180, baseType: !838, size: 32, align: 32, offset: 3040)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1190, file: !4, line: 2187, baseType: !790, size: 32, align: 32, offset: 3072)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1190, file: !4, line: 2194, baseType: !857, size: 32, align: 32, offset: 3104)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1190, file: !4, line: 2203, baseType: !926, size: 32, align: 32, offset: 3136)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1190, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1190, file: !4, line: 2212, baseType: !926, size: 32, align: 32, offset: 3200)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1190, file: !4, line: 2213, baseType: !926, size: 32, align: 32, offset: 3232)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1190, file: !4, line: 2220, baseType: !733, size: 32, align: 32, offset: 3264)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1190, file: !4, line: 2232, baseType: !926, size: 32, align: 32, offset: 3296)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1190, file: !4, line: 2243, baseType: !926, size: 32, align: 32, offset: 3328)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1190, file: !4, line: 2249, baseType: !926, size: 32, align: 32, offset: 3360)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1190, file: !4, line: 2256, baseType: !926, size: 32, align: 32, offset: 3392)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1190, file: !4, line: 2263, baseType: !1226, size: 64, align: 64, offset: 3456)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1190, file: !4, line: 2270, baseType: !1226, size: 64, align: 64, offset: 3520)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1190, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1190, file: !4, line: 2285, baseType: !733, size: 32, align: 32, offset: 3616)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1190, file: !4, line: 2367, baseType: !1526, size: 64, align: 64, offset: 3648)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = !DISubroutineType(types: !1528)
!1528 = !{!926, !1453, !1413, !926}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1190, file: !4, line: 2383, baseType: !926, size: 32, align: 32, offset: 3712)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1190, file: !4, line: 2386, baseType: !1460, size: 32, align: 32, offset: 3744)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1190, file: !4, line: 2387, baseType: !1460, size: 32, align: 32, offset: 3776)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1190, file: !4, line: 2394, baseType: !926, size: 32, align: 32, offset: 3808)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1190, file: !4, line: 2401, baseType: !926, size: 32, align: 32, offset: 3840)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1190, file: !4, line: 2408, baseType: !926, size: 32, align: 32, offset: 3872)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1190, file: !4, line: 2415, baseType: !926, size: 32, align: 32, offset: 3904)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1190, file: !4, line: 2422, baseType: !926, size: 32, align: 32, offset: 3936)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1190, file: !4, line: 2423, baseType: !1538, size: 64, align: 64, offset: 3968)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1540)
!1540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1541)
!1541 = !{!1542, !1543, !1544, !1545}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1540, file: !4, line: 827, baseType: !926, size: 32, align: 32)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1540, file: !4, line: 828, baseType: !926, size: 32, align: 32, offset: 32)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1540, file: !4, line: 829, baseType: !926, size: 32, align: 32, offset: 64)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1540, file: !4, line: 830, baseType: !1460, size: 32, align: 32, offset: 96)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1190, file: !4, line: 2430, baseType: !1061, size: 64, align: 64, offset: 4032)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1190, file: !4, line: 2437, baseType: !1061, size: 64, align: 64, offset: 4096)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1190, file: !4, line: 2444, baseType: !1460, size: 32, align: 32, offset: 4160)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1190, file: !4, line: 2451, baseType: !1460, size: 32, align: 32, offset: 4192)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1190, file: !4, line: 2458, baseType: !926, size: 32, align: 32, offset: 4224)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1190, file: !4, line: 2469, baseType: !926, size: 32, align: 32, offset: 4256)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1190, file: !4, line: 2475, baseType: !926, size: 32, align: 32, offset: 4288)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1190, file: !4, line: 2481, baseType: !926, size: 32, align: 32, offset: 4320)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1190, file: !4, line: 2485, baseType: !926, size: 32, align: 32, offset: 4352)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1190, file: !4, line: 2489, baseType: !926, size: 32, align: 32, offset: 4384)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1190, file: !4, line: 2493, baseType: !926, size: 32, align: 32, offset: 4416)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1190, file: !4, line: 2501, baseType: !926, size: 32, align: 32, offset: 4448)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1190, file: !4, line: 2506, baseType: !926, size: 32, align: 32, offset: 4480)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1190, file: !4, line: 2510, baseType: !926, size: 32, align: 32, offset: 4512)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1190, file: !4, line: 2514, baseType: !1061, size: 64, align: 64, offset: 4544)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1190, file: !4, line: 2528, baseType: !1562, size: 64, align: 64, offset: 4608)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DISubroutineType(types: !1564)
!1564 = !{null, !1453, !966, !926, !926}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1190, file: !4, line: 2534, baseType: !926, size: 32, align: 32, offset: 4672)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1190, file: !4, line: 2545, baseType: !926, size: 32, align: 32, offset: 4704)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1190, file: !4, line: 2547, baseType: !926, size: 32, align: 32, offset: 4736)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1190, file: !4, line: 2549, baseType: !926, size: 32, align: 32, offset: 4768)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1190, file: !4, line: 2551, baseType: !926, size: 32, align: 32, offset: 4800)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1190, file: !4, line: 2553, baseType: !926, size: 32, align: 32, offset: 4832)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1190, file: !4, line: 2555, baseType: !926, size: 32, align: 32, offset: 4864)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1190, file: !4, line: 2557, baseType: !926, size: 32, align: 32, offset: 4896)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1190, file: !4, line: 2559, baseType: !926, size: 32, align: 32, offset: 4928)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1190, file: !4, line: 2563, baseType: !926, size: 32, align: 32, offset: 4960)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1190, file: !4, line: 2571, baseType: !1305, size: 64, align: 64, offset: 4992)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1190, file: !4, line: 2579, baseType: !1305, size: 64, align: 64, offset: 5056)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1190, file: !4, line: 2586, baseType: !926, size: 32, align: 32, offset: 5120)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1190, file: !4, line: 2615, baseType: !926, size: 32, align: 32, offset: 5152)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1190, file: !4, line: 2627, baseType: !926, size: 32, align: 32, offset: 5184)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1190, file: !4, line: 2637, baseType: !926, size: 32, align: 32, offset: 5216)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1190, file: !4, line: 2681, baseType: !926, size: 32, align: 32, offset: 5248)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1190, file: !4, line: 2709, baseType: !1061, size: 64, align: 64, offset: 5312)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1190, file: !4, line: 2716, baseType: !1584, size: 64, align: 64, offset: 5376)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1586)
!1586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1587)
!1587 = !{!1588, !1589, !1590, !1591, !1592, !1593, !1594, !1598, !1602, !1603, !1604, !1605, !1611, !1612, !1613, !1614, !1615}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1586, file: !4, line: 3642, baseType: !935, size: 64, align: 64)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1586, file: !4, line: 3649, baseType: !523, size: 32, align: 32, offset: 64)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1586, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1586, file: !4, line: 3663, baseType: !533, size: 32, align: 32, offset: 128)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1586, file: !4, line: 3669, baseType: !926, size: 32, align: 32, offset: 160)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1586, file: !4, line: 3682, baseType: !1410, size: 64, align: 64, offset: 192)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1586, file: !4, line: 3698, baseType: !1595, size: 64, align: 64, offset: 256)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64, align: 64)
!1596 = !DISubroutineType(types: !1597)
!1597 = !{!926, !1188, !1142, !1273}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1586, file: !4, line: 3712, baseType: !1599, size: 64, align: 64, offset: 320)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DISubroutineType(types: !1601)
!1601 = !{!926, !1188, !926, !1142, !1273}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1586, file: !4, line: 3726, baseType: !1595, size: 64, align: 64, offset: 384)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1586, file: !4, line: 3737, baseType: !1242, size: 64, align: 64, offset: 448)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1586, file: !4, line: 3746, baseType: !926, size: 32, align: 32, offset: 512)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1586, file: !4, line: 3757, baseType: !1606, size: 64, align: 64, offset: 576)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DISubroutineType(types: !1608)
!1608 = !{null, !1609}
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1586, file: !4, line: 3766, baseType: !1242, size: 64, align: 64, offset: 640)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1586, file: !4, line: 3774, baseType: !1242, size: 64, align: 64, offset: 704)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1586, file: !4, line: 3780, baseType: !926, size: 32, align: 32, offset: 768)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1586, file: !4, line: 3785, baseType: !926, size: 32, align: 32, offset: 800)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1586, file: !4, line: 3795, baseType: !1616, size: 64, align: 64, offset: 832)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DISubroutineType(types: !1618)
!1618 = !{!926, !1188, !1046}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1190, file: !4, line: 2728, baseType: !966, size: 64, align: 64, offset: 5440)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1190, file: !4, line: 2735, baseType: !1337, size: 512, align: 64, offset: 5504)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1190, file: !4, line: 2742, baseType: !926, size: 32, align: 32, offset: 6016)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1190, file: !4, line: 2755, baseType: !926, size: 32, align: 32, offset: 6048)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1190, file: !4, line: 2776, baseType: !926, size: 32, align: 32, offset: 6080)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1190, file: !4, line: 2783, baseType: !926, size: 32, align: 32, offset: 6112)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1190, file: !4, line: 2791, baseType: !926, size: 32, align: 32, offset: 6144)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1190, file: !4, line: 2802, baseType: !1413, size: 64, align: 64, offset: 6208)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1190, file: !4, line: 2811, baseType: !926, size: 32, align: 32, offset: 6272)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1190, file: !4, line: 2821, baseType: !926, size: 32, align: 32, offset: 6304)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1190, file: !4, line: 2830, baseType: !926, size: 32, align: 32, offset: 6336)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1190, file: !4, line: 2840, baseType: !926, size: 32, align: 32, offset: 6368)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1190, file: !4, line: 2851, baseType: !1632, size: 64, align: 64, offset: 6400)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{!926, !1453, !1635, !966, !1395, !926, !926}
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{!926, !1453, !966}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1190, file: !4, line: 2871, baseType: !1639, size: 64, align: 64, offset: 6464)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{!926, !1453, !1642, !966, !1395, !926}
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{!926, !1453, !966, !926, !926}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1190, file: !4, line: 2878, baseType: !926, size: 32, align: 32, offset: 6528)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1190, file: !4, line: 2885, baseType: !926, size: 32, align: 32, offset: 6560)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1190, file: !4, line: 3005, baseType: !926, size: 32, align: 32, offset: 6592)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1190, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1190, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1190, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1190, file: !4, line: 3037, baseType: !1056, size: 64, align: 64, offset: 6720)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1190, file: !4, line: 3038, baseType: !926, size: 32, align: 32, offset: 6784)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1190, file: !4, line: 3050, baseType: !1226, size: 64, align: 64, offset: 6848)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1190, file: !4, line: 3065, baseType: !926, size: 32, align: 32, offset: 6912)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1190, file: !4, line: 3083, baseType: !926, size: 32, align: 32, offset: 6944)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1190, file: !4, line: 3092, baseType: !1208, size: 64, align: 32, offset: 6976)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1190, file: !4, line: 3099, baseType: !533, size: 32, align: 32, offset: 7040)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1190, file: !4, line: 3106, baseType: !1208, size: 64, align: 32, offset: 7072)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1190, file: !4, line: 3113, baseType: !1660, size: 64, align: 64, offset: 7168)
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64, align: 64)
!1661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1662)
!1662 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1663)
!1663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1664)
!1664 = !{!1665, !1666, !1667, !1668, !1669, !1670, !1673}
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1663, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1663, file: !4, line: 714, baseType: !523, size: 32, align: 32, offset: 32)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1663, file: !4, line: 720, baseType: !935, size: 64, align: 64, offset: 64)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1663, file: !4, line: 724, baseType: !935, size: 64, align: 64, offset: 128)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1663, file: !4, line: 728, baseType: !926, size: 32, align: 32, offset: 192)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1663, file: !4, line: 734, baseType: !1671, size: 64, align: 64, offset: 256)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1663, file: !4, line: 739, baseType: !1674, size: 64, align: 64, offset: 320)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1233)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1190, file: !4, line: 3129, baseType: !1061, size: 64, align: 64, offset: 7232)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1190, file: !4, line: 3130, baseType: !1061, size: 64, align: 64, offset: 7296)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1190, file: !4, line: 3131, baseType: !1061, size: 64, align: 64, offset: 7360)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1190, file: !4, line: 3132, baseType: !1061, size: 64, align: 64, offset: 7424)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1190, file: !4, line: 3139, baseType: !1305, size: 64, align: 64, offset: 7488)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1190, file: !4, line: 3147, baseType: !926, size: 32, align: 32, offset: 7552)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1190, file: !4, line: 3165, baseType: !926, size: 32, align: 32, offset: 7584)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1190, file: !4, line: 3172, baseType: !926, size: 32, align: 32, offset: 7616)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1190, file: !4, line: 3180, baseType: !926, size: 32, align: 32, offset: 7648)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1190, file: !4, line: 3191, baseType: !1490, size: 64, align: 64, offset: 7680)
