; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--wavenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--wavenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 55, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "libavformat/wavenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!940 = !{!941, !942, !943}
!941 = !DIEnumerator(name: "PEAK_OFF", value: 0)
!942 = !DIEnumerator(name: "PEAK_ON", value: 1)
!943 = !DIEnumerator(name: "PEAK_ONLY", value: 2)
!944 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 61, size: 32, align: 32, elements: !945)
!945 = !{!946, !947}
!946 = !DIEnumerator(name: "PEAK_FORMAT_UINT8", value: 1)
!947 = !DIEnumerator(name: "PEAK_FORMAT_UINT16", value: 2)
!948 = !{!949, !950, !954, !956, !964, !966, !967, !968}
!949 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !952, line: 36, baseType: !953)
!952 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!953 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !952, line: 37, baseType: !955)
!955 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !959, line: 222, size: 16, align: 8, elements: !960)
!959 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!960 = !{!961}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !958, file: !959, line: 222, baseType: !962, size: 16, align: 16)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !952, line: 49, baseType: !963)
!963 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !952, line: 40, baseType: !965)
!965 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !952, line: 51, baseType: !949)
!968 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!969 = !{!970, !2208, !2209, !2210}
!970 = distinct !DIGlobalVariable(name: "ff_wav_muxer", scope: !0, file: !939, line: 519, type: !971, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_wav_muxer)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !973)
!973 = !{!974, !978, !979, !980, !981, !982, !983, !984, !985, !995, !1075, !1077, !1078, !2173, !2174, !2175, !2179, !2183, !2187, !2188, !2193, !2194, !2195, !2196, !2197, !2198, !2202}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !972, file: !919, line: 498, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !972, file: !919, line: 504, baseType: !975, size: 64, align: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !972, file: !919, line: 505, baseType: !975, size: 64, align: 64, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !972, file: !919, line: 506, baseType: !975, size: 64, align: 64, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !972, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !972, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !972, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !972, file: !919, line: 517, baseType: !968, size: 32, align: 32, offset: 352)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !972, file: !919, line: 523, baseType: !986, size: 64, align: 64, offset: 384)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !991, line: 44, size: 64, align: 32, elements: !992)
!991 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!992 = !{!993, !994}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !990, file: !991, line: 45, baseType: !3, size: 32, align: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !990, file: !991, line: 46, baseType: !949, size: 32, align: 32, offset: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !972, file: !919, line: 526, baseType: !996, size: 64, align: 64, offset: 448)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1000)
!1000 = !{!1001, !1002, !1007, !1034, !1035, !1036, !1037, !1041, !1047, !1049, !1053}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !999, file: !486, line: 72, baseType: !975, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !999, file: !486, line: 78, baseType: !1003, size: 64, align: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!975, !1006}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !999, file: !486, line: 85, baseType: !1008, size: 64, align: 64, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016, !1030, !1031, !1032, !1033}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1010, file: !464, line: 247, baseType: !975, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1010, file: !464, line: 253, baseType: !975, size: 64, align: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1010, file: !464, line: 259, baseType: !968, size: 32, align: 32, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1010, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1010, file: !464, line: 271, baseType: !1017, size: 64, align: 64, offset: 192)
!1017 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1010, file: !464, line: 265, size: 64, align: 64, elements: !1018)
!1018 = !{!1019, !1020, !1022, !1023}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1017, file: !464, line: 266, baseType: !964, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1017, file: !464, line: 267, baseType: !1021, size: 64, align: 64)
!1021 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1017, file: !464, line: 268, baseType: !975, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1017, file: !464, line: 270, baseType: !1024, size: 64, align: 32)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1025, line: 61, baseType: !1026)
!1025 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1025, line: 58, size: 64, align: 32, elements: !1027)
!1027 = !{!1028, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1026, file: !1025, line: 59, baseType: !968, size: 32, align: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1026, file: !1025, line: 60, baseType: !968, size: 32, align: 32, offset: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1010, file: !464, line: 272, baseType: !1021, size: 64, align: 64, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1010, file: !464, line: 273, baseType: !1021, size: 64, align: 64, offset: 320)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1010, file: !464, line: 275, baseType: !968, size: 32, align: 32, offset: 384)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1010, file: !464, line: 300, baseType: !975, size: 64, align: 64, offset: 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !999, file: !486, line: 93, baseType: !968, size: 32, align: 32, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !999, file: !486, line: 99, baseType: !968, size: 32, align: 32, offset: 224)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !999, file: !486, line: 108, baseType: !968, size: 32, align: 32, offset: 256)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !999, file: !486, line: 113, baseType: !1038, size: 64, align: 64, offset: 320)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!1006, !1006, !1006}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !999, file: !486, line: 123, baseType: !1042, size: 64, align: 64, offset: 384)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!1045, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !999, file: !486, line: 130, baseType: !1048, size: 32, align: 32, offset: 448)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !999, file: !486, line: 136, baseType: !1050, size: 64, align: 64, offset: 512)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!1048, !1006}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !999, file: !486, line: 142, baseType: !1054, size: 64, align: 64, offset: 576)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!968, !1057, !1006, !975, !968}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1060)
!1060 = !{!1061, !1073, !1074}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1059, file: !464, line: 360, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1070, !1071, !1072}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1065, file: !464, line: 307, baseType: !975, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1065, file: !464, line: 313, baseType: !1021, size: 64, align: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1065, file: !464, line: 313, baseType: !1021, size: 64, align: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1065, file: !464, line: 318, baseType: !1021, size: 64, align: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1065, file: !464, line: 318, baseType: !1021, size: 64, align: 64, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1065, file: !464, line: 323, baseType: !968, size: 32, align: 32, offset: 320)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1059, file: !464, line: 364, baseType: !968, size: 32, align: 32, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1059, file: !464, line: 368, baseType: !968, size: 32, align: 32, offset: 96)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !972, file: !919, line: 535, baseType: !1076, size: 64, align: 64, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !972, file: !919, line: 539, baseType: !968, size: 32, align: 32, offset: 576)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !972, file: !919, line: 541, baseType: !1079, size: 64, align: 64, offset: 640)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!968, !1082}
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1084)
!1084 = !{!1085, !1086, !1184, !1185, !1186, !1252, !1253, !1254, !2027, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2081, !2082, !2083, !2084, !2085, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2136, !2137, !2140, !2141, !2142, !2143, !2144, !2145, !2150, !2151, !2152, !2153, !2161, !2162, !2166, !2170, !2171, !2172}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1083, file: !919, line: 1342, baseType: !996, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1083, file: !919, line: 1349, baseType: !1087, size: 64, align: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1114, !1115, !1155, !1156, !1160, !1165, !1166, !1167, !1171, !1177, !1183}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1088, file: !919, line: 638, baseType: !975, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1088, file: !919, line: 645, baseType: !975, size: 64, align: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1088, file: !919, line: 652, baseType: !968, size: 32, align: 32, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1088, file: !919, line: 659, baseType: !975, size: 64, align: 64, offset: 192)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1088, file: !919, line: 661, baseType: !986, size: 64, align: 64, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1088, file: !919, line: 663, baseType: !996, size: 64, align: 64, offset: 320)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1088, file: !919, line: 670, baseType: !975, size: 64, align: 64, offset: 384)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1088, file: !919, line: 679, baseType: !1087, size: 64, align: 64, offset: 448)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1088, file: !919, line: 684, baseType: !968, size: 32, align: 32, offset: 512)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1088, file: !919, line: 689, baseType: !968, size: 32, align: 32, offset: 544)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1088, file: !919, line: 696, baseType: !1101, size: 64, align: 64, offset: 576)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!968, !1104}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1107)
!1107 = !{!1108, !1109, !1112, !1113}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1106, file: !919, line: 449, baseType: !975, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1106, file: !919, line: 450, baseType: !1110, size: 64, align: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1106, file: !919, line: 451, baseType: !968, size: 32, align: 32, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1106, file: !919, line: 452, baseType: !975, size: 64, align: 64, offset: 192)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1088, file: !919, line: 703, baseType: !1079, size: 64, align: 64, offset: 640)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1088, file: !919, line: 714, baseType: !1116, size: 64, align: 64, offset: 704)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!968, !1082, !1119}
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1122)
!1122 = !{!1123, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1151, !1152, !1153, !1154}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1121, file: !4, line: 1451, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1126, line: 94, baseType: !1127)
!1126 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1126, line: 81, size: 192, align: 64, elements: !1128)
!1128 = !{!1129, !1133, !1136}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1127, file: !1126, line: 82, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1126, line: 73, baseType: !1132)
!1132 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1126, line: 73, flags: DIFlagFwdDecl)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1127, file: !1126, line: 89, baseType: !1134, size: 64, align: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !952, line: 48, baseType: !1111)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1127, file: !1126, line: 93, baseType: !968, size: 32, align: 32, offset: 128)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1121, file: !4, line: 1461, baseType: !964, size: 64, align: 64, offset: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1121, file: !4, line: 1467, baseType: !964, size: 64, align: 64, offset: 128)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1121, file: !4, line: 1468, baseType: !1134, size: 64, align: 64, offset: 192)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1121, file: !4, line: 1469, baseType: !968, size: 32, align: 32, offset: 256)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1121, file: !4, line: 1470, baseType: !968, size: 32, align: 32, offset: 288)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1121, file: !4, line: 1474, baseType: !968, size: 32, align: 32, offset: 320)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1121, file: !4, line: 1479, baseType: !1144, size: 64, align: 64, offset: 384)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1147)
!1147 = !{!1148, !1149, !1150}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1146, file: !4, line: 1412, baseType: !1134, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1146, file: !4, line: 1413, baseType: !968, size: 32, align: 32, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1146, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1121, file: !4, line: 1480, baseType: !968, size: 32, align: 32, offset: 448)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1121, file: !4, line: 1486, baseType: !964, size: 64, align: 64, offset: 512)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1121, file: !4, line: 1488, baseType: !964, size: 64, align: 64, offset: 576)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1121, file: !4, line: 1497, baseType: !964, size: 64, align: 64, offset: 640)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1088, file: !919, line: 720, baseType: !1079, size: 64, align: 64, offset: 768)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1088, file: !919, line: 730, baseType: !1157, size: 64, align: 64, offset: 832)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!968, !1082, !968, !964, !968}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1088, file: !919, line: 737, baseType: !1161, size: 64, align: 64, offset: 896)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!964, !1082, !968, !1164, !964}
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1088, file: !919, line: 744, baseType: !1079, size: 64, align: 64, offset: 960)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1088, file: !919, line: 750, baseType: !1079, size: 64, align: 64, offset: 1024)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1088, file: !919, line: 758, baseType: !1168, size: 64, align: 64, offset: 1088)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!968, !1082, !968, !964, !964, !964, !968}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1088, file: !919, line: 764, baseType: !1172, size: 64, align: 64, offset: 1152)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!968, !1082, !1175}
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1088, file: !919, line: 770, baseType: !1178, size: 64, align: 64, offset: 1216)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!968, !1082, !1181}
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1088, file: !919, line: 776, baseType: !1178, size: 64, align: 64, offset: 1280)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1083, file: !919, line: 1356, baseType: !1076, size: 64, align: 64, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1083, file: !919, line: 1365, baseType: !1006, size: 64, align: 64, offset: 192)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1083, file: !919, line: 1379, baseType: !1187, size: 64, align: 64, offset: 256)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1190)
!1190 = !{!1191, !1192, !1193, !1194, !1195, !1196, !1197, !1201, !1202, !1206, !1207, !1208, !1209, !1210, !1212, !1213, !1219, !1220, !1224, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1242, !1243, !1244, !1245, !1249, !1250, !1251}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1189, file: !537, line: 174, baseType: !996, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1189, file: !537, line: 226, baseType: !1110, size: 64, align: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1189, file: !537, line: 227, baseType: !968, size: 32, align: 32, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1189, file: !537, line: 228, baseType: !1110, size: 64, align: 64, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1189, file: !537, line: 229, baseType: !1110, size: 64, align: 64, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1189, file: !537, line: 233, baseType: !1006, size: 64, align: 64, offset: 320)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1189, file: !537, line: 235, baseType: !1198, size: 64, align: 64, offset: 384)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!968, !1006, !1134, !968}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1189, file: !537, line: 236, baseType: !1198, size: 64, align: 64, offset: 448)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1189, file: !537, line: 237, baseType: !1203, size: 64, align: 64, offset: 512)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!964, !1006, !964, !968}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1189, file: !537, line: 238, baseType: !964, size: 64, align: 64, offset: 576)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1189, file: !537, line: 239, baseType: !968, size: 32, align: 32, offset: 640)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1189, file: !537, line: 240, baseType: !968, size: 32, align: 32, offset: 672)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1189, file: !537, line: 241, baseType: !968, size: 32, align: 32, offset: 704)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1189, file: !537, line: 242, baseType: !1211, size: 64, align: 64, offset: 768)
!1211 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1189, file: !537, line: 243, baseType: !1110, size: 64, align: 64, offset: 832)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1189, file: !537, line: 244, baseType: !1214, size: 64, align: 64, offset: 896)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!1211, !1211, !1217, !949}
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1135)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1189, file: !537, line: 245, baseType: !968, size: 32, align: 32, offset: 960)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1189, file: !537, line: 249, baseType: !1221, size: 64, align: 64, offset: 1024)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!968, !1006, !968}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1189, file: !537, line: 255, baseType: !1225, size: 64, align: 64, offset: 1088)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!964, !1006, !968, !964, !968}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1189, file: !537, line: 260, baseType: !968, size: 32, align: 32, offset: 1152)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1189, file: !537, line: 266, baseType: !964, size: 64, align: 64, offset: 1216)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1189, file: !537, line: 273, baseType: !968, size: 32, align: 32, offset: 1280)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1189, file: !537, line: 279, baseType: !964, size: 64, align: 64, offset: 1344)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1189, file: !537, line: 285, baseType: !968, size: 32, align: 32, offset: 1408)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1189, file: !537, line: 291, baseType: !968, size: 32, align: 32, offset: 1440)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1189, file: !537, line: 298, baseType: !968, size: 32, align: 32, offset: 1472)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1189, file: !537, line: 304, baseType: !968, size: 32, align: 32, offset: 1504)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1189, file: !537, line: 309, baseType: !975, size: 64, align: 64, offset: 1536)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1189, file: !537, line: 314, baseType: !975, size: 64, align: 64, offset: 1600)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1189, file: !537, line: 319, baseType: !1239, size: 64, align: 64, offset: 1664)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!968, !1006, !1134, !968, !536, !964}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1189, file: !537, line: 326, baseType: !968, size: 32, align: 32, offset: 1728)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1189, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1189, file: !537, line: 332, baseType: !964, size: 64, align: 64, offset: 1792)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1189, file: !537, line: 338, baseType: !1246, size: 64, align: 64, offset: 1856)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!968, !1006}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1189, file: !537, line: 340, baseType: !964, size: 64, align: 64, offset: 1920)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1189, file: !537, line: 346, baseType: !1110, size: 64, align: 64, offset: 1984)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1189, file: !537, line: 351, baseType: !968, size: 32, align: 32, offset: 2048)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1083, file: !919, line: 1386, baseType: !968, size: 32, align: 32, offset: 320)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1083, file: !919, line: 1393, baseType: !949, size: 32, align: 32, offset: 352)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1083, file: !919, line: 1405, baseType: !1255, size: 64, align: 64, offset: 384)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1258)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1259)
!1259 = !{!1260, !1261, !1262, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1813, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1913, !1919, !1920, !1924, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1956, !1957, !1958, !1959, !1960, !1961}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1258, file: !919, line: 866, baseType: !968, size: 32, align: 32)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1258, file: !919, line: 872, baseType: !968, size: 32, align: 32, offset: 32)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1258, file: !919, line: 878, baseType: !1263, size: 64, align: 64, offset: 64)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1266)
!1266 = !{!1267, !1268, !1269, !1270, !1488, !1489, !1490, !1491, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1517, !1521, !1522, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1701, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1265, file: !4, line: 1561, baseType: !996, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1265, file: !4, line: 1562, baseType: !968, size: 32, align: 32, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1265, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1265, file: !4, line: 1565, baseType: !1271, size: 64, align: 64, offset: 128)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1274)
!1274 = !{!1275, !1276, !1277, !1278, !1279, !1280, !1283, !1286, !1289, !1292, !1296, !1297, !1298, !1306, !1307, !1308, !1310, !1314, !1320, !1325, !1329, !1330, !1375, !1459, !1463, !1464, !1468, !1472, !1477, !1481, !1482, !1483}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1273, file: !4, line: 3475, baseType: !975, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1273, file: !4, line: 3480, baseType: !975, size: 64, align: 64, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1273, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1273, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1273, file: !4, line: 3487, baseType: !968, size: 32, align: 32, offset: 192)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1273, file: !4, line: 3488, baseType: !1281, size: 64, align: 64, offset: 256)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1024)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1273, file: !4, line: 3489, baseType: !1284, size: 64, align: 64, offset: 320)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1273, file: !4, line: 3490, baseType: !1287, size: 64, align: 64, offset: 384)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1273, file: !4, line: 3491, baseType: !1290, size: 64, align: 64, offset: 448)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1273, file: !4, line: 3492, baseType: !1293, size: 64, align: 64, offset: 512)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1295)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !952, line: 55, baseType: !1211)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1273, file: !4, line: 3493, baseType: !1135, size: 8, align: 8, offset: 576)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1273, file: !4, line: 3494, baseType: !996, size: 64, align: 64, offset: 640)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1273, file: !4, line: 3495, baseType: !1299, size: 64, align: 64, offset: 704)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1301)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1302)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1303)
!1303 = !{!1304, !1305}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1302, file: !4, line: 3402, baseType: !968, size: 32, align: 32)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1302, file: !4, line: 3403, baseType: !975, size: 64, align: 64, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1273, file: !4, line: 3507, baseType: !975, size: 64, align: 64, offset: 768)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1273, file: !4, line: 3516, baseType: !968, size: 32, align: 32, offset: 832)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1273, file: !4, line: 3517, baseType: !1309, size: 64, align: 64, offset: 896)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1273, file: !4, line: 3527, baseType: !1311, size: 64, align: 64, offset: 960)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!968, !1263}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1273, file: !4, line: 3535, baseType: !1315, size: 64, align: 64, offset: 1024)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!968, !1263, !1318}
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1264)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1273, file: !4, line: 3541, baseType: !1321, size: 64, align: 64, offset: 1088)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1323)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1324)
!1324 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1273, file: !4, line: 3549, baseType: !1326, size: 64, align: 64, offset: 1152)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{null, !1309}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1273, file: !4, line: 3551, baseType: !1311, size: 64, align: 64, offset: 1216)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1273, file: !4, line: 3552, baseType: !1331, size: 64, align: 64, offset: 1280)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!968, !1263, !1134, !968, !1334}
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1336)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1337)
!1337 = !{!1338, !1339, !1340, !1341, !1342, !1374}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1336, file: !4, line: 3921, baseType: !962, size: 16, align: 16)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1336, file: !4, line: 3922, baseType: !967, size: 32, align: 32, offset: 32)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1336, file: !4, line: 3923, baseType: !967, size: 32, align: 32, offset: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1336, file: !4, line: 3924, baseType: !949, size: 32, align: 32, offset: 96)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1336, file: !4, line: 3925, baseType: !1343, size: 64, align: 64, offset: 128)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1346)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1347)
!1347 = !{!1348, !1349, !1350, !1351, !1352, !1353, !1363, !1367, !1369, !1370, !1372, !1373}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1346, file: !4, line: 3886, baseType: !968, size: 32, align: 32)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1346, file: !4, line: 3887, baseType: !968, size: 32, align: 32, offset: 32)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1346, file: !4, line: 3888, baseType: !968, size: 32, align: 32, offset: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1346, file: !4, line: 3889, baseType: !968, size: 32, align: 32, offset: 96)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1346, file: !4, line: 3890, baseType: !968, size: 32, align: 32, offset: 128)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1346, file: !4, line: 3897, baseType: !1354, size: 768, align: 64, offset: 192)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1355)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1356)
!1356 = !{!1357, !1361}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1355, file: !4, line: 3855, baseType: !1358, size: 512, align: 64)
!1358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1134, size: 512, align: 64, elements: !1359)
!1359 = !{!1360}
!1360 = !DISubrange(count: 8)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1355, file: !4, line: 3857, baseType: !1362, size: 256, align: 32, offset: 512)
!1362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 256, align: 32, elements: !1359)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1346, file: !4, line: 3903, baseType: !1364, size: 256, align: 64, offset: 960)
!1364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1134, size: 256, align: 64, elements: !1365)
!1365 = !{!1366}
!1366 = !DISubrange(count: 4)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1346, file: !4, line: 3904, baseType: !1368, size: 128, align: 32, offset: 1216)
!1368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 128, align: 32, elements: !1365)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1346, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1346, file: !4, line: 3908, baseType: !1371, size: 64, align: 64, offset: 1408)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1346, file: !4, line: 3915, baseType: !1371, size: 64, align: 64, offset: 1472)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1346, file: !4, line: 3917, baseType: !968, size: 32, align: 32, offset: 1536)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1336, file: !4, line: 3926, baseType: !964, size: 64, align: 64, offset: 192)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1273, file: !4, line: 3564, baseType: !1376, size: 64, align: 64, offset: 1344)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DISubroutineType(types: !1378)
!1378 = !{!968, !1263, !1119, !1379, !1458}
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1381)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1382)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1383)
!1383 = !{!1384, !1385, !1386, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1413, !1415, !1416, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1454, !1455, !1456, !1457}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1382, file: !789, line: 282, baseType: !1358, size: 512, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1382, file: !789, line: 299, baseType: !1362, size: 256, align: 32, offset: 512)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1382, file: !789, line: 315, baseType: !1387, size: 64, align: 64, offset: 768)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1382, file: !789, line: 326, baseType: !968, size: 32, align: 32, offset: 832)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1382, file: !789, line: 326, baseType: !968, size: 32, align: 32, offset: 864)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1382, file: !789, line: 334, baseType: !968, size: 32, align: 32, offset: 896)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1382, file: !789, line: 341, baseType: !968, size: 32, align: 32, offset: 928)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1382, file: !789, line: 346, baseType: !968, size: 32, align: 32, offset: 960)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1382, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1382, file: !789, line: 356, baseType: !1024, size: 64, align: 32, offset: 1024)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1382, file: !789, line: 361, baseType: !964, size: 64, align: 64, offset: 1088)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1382, file: !789, line: 369, baseType: !964, size: 64, align: 64, offset: 1152)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1382, file: !789, line: 377, baseType: !964, size: 64, align: 64, offset: 1216)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1382, file: !789, line: 382, baseType: !968, size: 32, align: 32, offset: 1280)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1382, file: !789, line: 386, baseType: !968, size: 32, align: 32, offset: 1312)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1382, file: !789, line: 391, baseType: !968, size: 32, align: 32, offset: 1344)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1382, file: !789, line: 396, baseType: !1006, size: 64, align: 64, offset: 1408)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1382, file: !789, line: 403, baseType: !1403, size: 512, align: 64, offset: 1472)
!1403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1295, size: 512, align: 64, elements: !1359)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1382, file: !789, line: 410, baseType: !968, size: 32, align: 32, offset: 1984)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1382, file: !789, line: 415, baseType: !968, size: 32, align: 32, offset: 2016)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1382, file: !789, line: 420, baseType: !968, size: 32, align: 32, offset: 2048)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1382, file: !789, line: 425, baseType: !968, size: 32, align: 32, offset: 2080)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1382, file: !789, line: 435, baseType: !964, size: 64, align: 64, offset: 2112)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1382, file: !789, line: 440, baseType: !968, size: 32, align: 32, offset: 2176)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1382, file: !789, line: 445, baseType: !1295, size: 64, align: 64, offset: 2240)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1382, file: !789, line: 459, baseType: !1412, size: 512, align: 64, offset: 2304)
!1412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1124, size: 512, align: 64, elements: !1359)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1382, file: !789, line: 473, baseType: !1414, size: 64, align: 64, offset: 2816)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1382, file: !789, line: 477, baseType: !968, size: 32, align: 32, offset: 2880)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1382, file: !789, line: 479, baseType: !1417, size: 64, align: 64, offset: 2944)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1420)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1421)
!1421 = !{!1422, !1423, !1424, !1425, !1430}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1420, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1420, file: !789, line: 203, baseType: !1134, size: 64, align: 64, offset: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1420, file: !789, line: 204, baseType: !968, size: 32, align: 32, offset: 128)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1420, file: !789, line: 205, baseType: !1426, size: 64, align: 64, offset: 192)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1428, line: 86, baseType: !1429)
!1428 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1429 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1428, line: 86, flags: DIFlagFwdDecl)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1420, file: !789, line: 206, baseType: !1124, size: 64, align: 64, offset: 256)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1382, file: !789, line: 480, baseType: !968, size: 32, align: 32, offset: 3008)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1382, file: !789, line: 505, baseType: !968, size: 32, align: 32, offset: 3040)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1382, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1382, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1382, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1382, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1382, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1382, file: !789, line: 532, baseType: !964, size: 64, align: 64, offset: 3264)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1382, file: !789, line: 539, baseType: !964, size: 64, align: 64, offset: 3328)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1382, file: !789, line: 547, baseType: !964, size: 64, align: 64, offset: 3392)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1382, file: !789, line: 554, baseType: !1426, size: 64, align: 64, offset: 3456)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1382, file: !789, line: 563, baseType: !968, size: 32, align: 32, offset: 3520)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1382, file: !789, line: 572, baseType: !968, size: 32, align: 32, offset: 3552)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1382, file: !789, line: 581, baseType: !968, size: 32, align: 32, offset: 3584)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1382, file: !789, line: 588, baseType: !950, size: 64, align: 64, offset: 3648)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1382, file: !789, line: 593, baseType: !968, size: 32, align: 32, offset: 3712)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1382, file: !789, line: 596, baseType: !968, size: 32, align: 32, offset: 3744)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1382, file: !789, line: 599, baseType: !1124, size: 64, align: 64, offset: 3776)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1382, file: !789, line: 605, baseType: !1124, size: 64, align: 64, offset: 3840)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1382, file: !789, line: 616, baseType: !1124, size: 64, align: 64, offset: 3904)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1382, file: !789, line: 626, baseType: !1452, size: 64, align: 64, offset: 3968)
!1452 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1453, line: 216, baseType: !1211)
!1453 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1382, file: !789, line: 627, baseType: !1452, size: 64, align: 64, offset: 4032)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1382, file: !789, line: 628, baseType: !1452, size: 64, align: 64, offset: 4096)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1382, file: !789, line: 629, baseType: !1452, size: 64, align: 64, offset: 4160)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1382, file: !789, line: 645, baseType: !1124, size: 64, align: 64, offset: 4224)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1273, file: !4, line: 3566, baseType: !1460, size: 64, align: 64, offset: 1408)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DISubroutineType(types: !1462)
!1462 = !{!968, !1263, !1006, !1458, !1119}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1273, file: !4, line: 3567, baseType: !1311, size: 64, align: 64, offset: 1472)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1273, file: !4, line: 3576, baseType: !1465, size: 64, align: 64, offset: 1536)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!968, !1263, !1379}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1273, file: !4, line: 3577, baseType: !1469, size: 64, align: 64, offset: 1600)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DISubroutineType(types: !1471)
!1471 = !{!968, !1263, !1119}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1273, file: !4, line: 3584, baseType: !1473, size: 64, align: 64, offset: 1664)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DISubroutineType(types: !1475)
!1475 = !{!968, !1263, !1476}
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1273, file: !4, line: 3589, baseType: !1478, size: 64, align: 64, offset: 1728)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{null, !1263}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1273, file: !4, line: 3594, baseType: !968, size: 32, align: 32, offset: 1792)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1273, file: !4, line: 3600, baseType: !975, size: 64, align: 64, offset: 1856)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1273, file: !4, line: 3609, baseType: !1484, size: 64, align: 64, offset: 1920)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1487)
!1487 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1265, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1265, file: !4, line: 1581, baseType: !949, size: 32, align: 32, offset: 224)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1265, file: !4, line: 1583, baseType: !1006, size: 64, align: 64, offset: 256)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1265, file: !4, line: 1591, baseType: !1492, size: 64, align: 64, offset: 320)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1265, file: !4, line: 1598, baseType: !1006, size: 64, align: 64, offset: 384)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1265, file: !4, line: 1606, baseType: !964, size: 64, align: 64, offset: 448)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1265, file: !4, line: 1614, baseType: !968, size: 32, align: 32, offset: 512)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1265, file: !4, line: 1622, baseType: !968, size: 32, align: 32, offset: 544)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1265, file: !4, line: 1628, baseType: !968, size: 32, align: 32, offset: 576)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1265, file: !4, line: 1636, baseType: !968, size: 32, align: 32, offset: 608)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1265, file: !4, line: 1643, baseType: !968, size: 32, align: 32, offset: 640)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1265, file: !4, line: 1657, baseType: !1134, size: 64, align: 64, offset: 704)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1265, file: !4, line: 1658, baseType: !968, size: 32, align: 32, offset: 768)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1265, file: !4, line: 1679, baseType: !1024, size: 64, align: 32, offset: 800)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1265, file: !4, line: 1688, baseType: !968, size: 32, align: 32, offset: 864)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1265, file: !4, line: 1712, baseType: !968, size: 32, align: 32, offset: 896)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1265, file: !4, line: 1729, baseType: !968, size: 32, align: 32, offset: 928)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1265, file: !4, line: 1729, baseType: !968, size: 32, align: 32, offset: 960)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1265, file: !4, line: 1744, baseType: !968, size: 32, align: 32, offset: 992)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1265, file: !4, line: 1744, baseType: !968, size: 32, align: 32, offset: 1024)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1265, file: !4, line: 1751, baseType: !968, size: 32, align: 32, offset: 1056)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1265, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1265, file: !4, line: 1791, baseType: !1513, size: 64, align: 64, offset: 1152)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{null, !1516, !1379, !1458, !968, !968, !968}
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1265, file: !4, line: 1808, baseType: !1518, size: 64, align: 64, offset: 1216)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{!555, !1516, !1284}
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1265, file: !4, line: 1816, baseType: !968, size: 32, align: 32, offset: 1280)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1265, file: !4, line: 1825, baseType: !1523, size: 32, align: 32, offset: 1312)
!1523 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1265, file: !4, line: 1830, baseType: !968, size: 32, align: 32, offset: 1344)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1265, file: !4, line: 1838, baseType: !1523, size: 32, align: 32, offset: 1376)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1265, file: !4, line: 1846, baseType: !968, size: 32, align: 32, offset: 1408)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1265, file: !4, line: 1851, baseType: !968, size: 32, align: 32, offset: 1440)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1265, file: !4, line: 1861, baseType: !1523, size: 32, align: 32, offset: 1472)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1265, file: !4, line: 1868, baseType: !1523, size: 32, align: 32, offset: 1504)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1265, file: !4, line: 1875, baseType: !1523, size: 32, align: 32, offset: 1536)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1265, file: !4, line: 1882, baseType: !1523, size: 32, align: 32, offset: 1568)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1265, file: !4, line: 1889, baseType: !1523, size: 32, align: 32, offset: 1600)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1265, file: !4, line: 1896, baseType: !1523, size: 32, align: 32, offset: 1632)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1265, file: !4, line: 1903, baseType: !1523, size: 32, align: 32, offset: 1664)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1265, file: !4, line: 1910, baseType: !968, size: 32, align: 32, offset: 1696)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1265, file: !4, line: 1915, baseType: !968, size: 32, align: 32, offset: 1728)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1265, file: !4, line: 1926, baseType: !1458, size: 64, align: 64, offset: 1792)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1265, file: !4, line: 1935, baseType: !1024, size: 64, align: 32, offset: 1856)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1265, file: !4, line: 1942, baseType: !968, size: 32, align: 32, offset: 1920)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1265, file: !4, line: 1948, baseType: !968, size: 32, align: 32, offset: 1952)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1265, file: !4, line: 1954, baseType: !968, size: 32, align: 32, offset: 1984)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1265, file: !4, line: 1960, baseType: !968, size: 32, align: 32, offset: 2016)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1265, file: !4, line: 1984, baseType: !968, size: 32, align: 32, offset: 2048)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1265, file: !4, line: 1991, baseType: !968, size: 32, align: 32, offset: 2080)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1265, file: !4, line: 1996, baseType: !968, size: 32, align: 32, offset: 2112)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1265, file: !4, line: 2004, baseType: !968, size: 32, align: 32, offset: 2144)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1265, file: !4, line: 2011, baseType: !968, size: 32, align: 32, offset: 2176)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1265, file: !4, line: 2018, baseType: !968, size: 32, align: 32, offset: 2208)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1265, file: !4, line: 2027, baseType: !968, size: 32, align: 32, offset: 2240)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1265, file: !4, line: 2034, baseType: !968, size: 32, align: 32, offset: 2272)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1265, file: !4, line: 2044, baseType: !968, size: 32, align: 32, offset: 2304)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1265, file: !4, line: 2054, baseType: !1553, size: 64, align: 64, offset: 2368)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1265, file: !4, line: 2061, baseType: !1553, size: 64, align: 64, offset: 2432)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1265, file: !4, line: 2066, baseType: !968, size: 32, align: 32, offset: 2496)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1265, file: !4, line: 2070, baseType: !968, size: 32, align: 32, offset: 2528)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1265, file: !4, line: 2078, baseType: !968, size: 32, align: 32, offset: 2560)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1265, file: !4, line: 2085, baseType: !968, size: 32, align: 32, offset: 2592)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1265, file: !4, line: 2092, baseType: !968, size: 32, align: 32, offset: 2624)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1265, file: !4, line: 2099, baseType: !968, size: 32, align: 32, offset: 2656)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1265, file: !4, line: 2106, baseType: !968, size: 32, align: 32, offset: 2688)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1265, file: !4, line: 2113, baseType: !968, size: 32, align: 32, offset: 2720)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1265, file: !4, line: 2120, baseType: !968, size: 32, align: 32, offset: 2752)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1265, file: !4, line: 2125, baseType: !968, size: 32, align: 32, offset: 2784)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1265, file: !4, line: 2133, baseType: !968, size: 32, align: 32, offset: 2816)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1265, file: !4, line: 2140, baseType: !968, size: 32, align: 32, offset: 2848)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1265, file: !4, line: 2145, baseType: !968, size: 32, align: 32, offset: 2880)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1265, file: !4, line: 2153, baseType: !968, size: 32, align: 32, offset: 2912)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1265, file: !4, line: 2158, baseType: !968, size: 32, align: 32, offset: 2944)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1265, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1265, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1265, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1265, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1265, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1265, file: !4, line: 2203, baseType: !968, size: 32, align: 32, offset: 3136)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1265, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1265, file: !4, line: 2212, baseType: !968, size: 32, align: 32, offset: 3200)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1265, file: !4, line: 2213, baseType: !968, size: 32, align: 32, offset: 3232)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1265, file: !4, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1265, file: !4, line: 2232, baseType: !968, size: 32, align: 32, offset: 3296)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1265, file: !4, line: 2243, baseType: !968, size: 32, align: 32, offset: 3328)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1265, file: !4, line: 2249, baseType: !968, size: 32, align: 32, offset: 3360)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1265, file: !4, line: 2256, baseType: !968, size: 32, align: 32, offset: 3392)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1265, file: !4, line: 2263, baseType: !1295, size: 64, align: 64, offset: 3456)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1265, file: !4, line: 2270, baseType: !1295, size: 64, align: 64, offset: 3520)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1265, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1265, file: !4, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1265, file: !4, line: 2367, baseType: !1589, size: 64, align: 64, offset: 3648)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DISubroutineType(types: !1591)
!1591 = !{!968, !1516, !1476, !968}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1265, file: !4, line: 2383, baseType: !968, size: 32, align: 32, offset: 3712)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1265, file: !4, line: 2386, baseType: !1523, size: 32, align: 32, offset: 3744)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1265, file: !4, line: 2387, baseType: !1523, size: 32, align: 32, offset: 3776)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1265, file: !4, line: 2394, baseType: !968, size: 32, align: 32, offset: 3808)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1265, file: !4, line: 2401, baseType: !968, size: 32, align: 32, offset: 3840)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1265, file: !4, line: 2408, baseType: !968, size: 32, align: 32, offset: 3872)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1265, file: !4, line: 2415, baseType: !968, size: 32, align: 32, offset: 3904)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1265, file: !4, line: 2422, baseType: !968, size: 32, align: 32, offset: 3936)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1265, file: !4, line: 2423, baseType: !1601, size: 64, align: 64, offset: 3968)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1603)
!1603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1604)
!1604 = !{!1605, !1606, !1607, !1608}
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1603, file: !4, line: 827, baseType: !968, size: 32, align: 32)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1603, file: !4, line: 828, baseType: !968, size: 32, align: 32, offset: 32)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1603, file: !4, line: 829, baseType: !968, size: 32, align: 32, offset: 64)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1603, file: !4, line: 830, baseType: !1523, size: 32, align: 32, offset: 96)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1265, file: !4, line: 2430, baseType: !964, size: 64, align: 64, offset: 4032)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1265, file: !4, line: 2437, baseType: !964, size: 64, align: 64, offset: 4096)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1265, file: !4, line: 2444, baseType: !1523, size: 32, align: 32, offset: 4160)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1265, file: !4, line: 2451, baseType: !1523, size: 32, align: 32, offset: 4192)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1265, file: !4, line: 2458, baseType: !968, size: 32, align: 32, offset: 4224)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1265, file: !4, line: 2469, baseType: !968, size: 32, align: 32, offset: 4256)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1265, file: !4, line: 2475, baseType: !968, size: 32, align: 32, offset: 4288)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1265, file: !4, line: 2481, baseType: !968, size: 32, align: 32, offset: 4320)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1265, file: !4, line: 2485, baseType: !968, size: 32, align: 32, offset: 4352)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1265, file: !4, line: 2489, baseType: !968, size: 32, align: 32, offset: 4384)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1265, file: !4, line: 2493, baseType: !968, size: 32, align: 32, offset: 4416)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1265, file: !4, line: 2501, baseType: !968, size: 32, align: 32, offset: 4448)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1265, file: !4, line: 2506, baseType: !968, size: 32, align: 32, offset: 4480)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1265, file: !4, line: 2510, baseType: !968, size: 32, align: 32, offset: 4512)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1265, file: !4, line: 2514, baseType: !964, size: 64, align: 64, offset: 4544)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1265, file: !4, line: 2528, baseType: !1625, size: 64, align: 64, offset: 4608)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DISubroutineType(types: !1627)
!1627 = !{null, !1516, !1006, !968, !968}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1265, file: !4, line: 2534, baseType: !968, size: 32, align: 32, offset: 4672)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1265, file: !4, line: 2545, baseType: !968, size: 32, align: 32, offset: 4704)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1265, file: !4, line: 2547, baseType: !968, size: 32, align: 32, offset: 4736)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1265, file: !4, line: 2549, baseType: !968, size: 32, align: 32, offset: 4768)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1265, file: !4, line: 2551, baseType: !968, size: 32, align: 32, offset: 4800)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1265, file: !4, line: 2553, baseType: !968, size: 32, align: 32, offset: 4832)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1265, file: !4, line: 2555, baseType: !968, size: 32, align: 32, offset: 4864)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1265, file: !4, line: 2557, baseType: !968, size: 32, align: 32, offset: 4896)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1265, file: !4, line: 2559, baseType: !968, size: 32, align: 32, offset: 4928)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1265, file: !4, line: 2563, baseType: !968, size: 32, align: 32, offset: 4960)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1265, file: !4, line: 2571, baseType: !1371, size: 64, align: 64, offset: 4992)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1265, file: !4, line: 2579, baseType: !1371, size: 64, align: 64, offset: 5056)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1265, file: !4, line: 2586, baseType: !968, size: 32, align: 32, offset: 5120)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1265, file: !4, line: 2615, baseType: !968, size: 32, align: 32, offset: 5152)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1265, file: !4, line: 2627, baseType: !968, size: 32, align: 32, offset: 5184)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1265, file: !4, line: 2637, baseType: !968, size: 32, align: 32, offset: 5216)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1265, file: !4, line: 2681, baseType: !968, size: 32, align: 32, offset: 5248)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1265, file: !4, line: 2709, baseType: !964, size: 64, align: 64, offset: 5312)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1265, file: !4, line: 2716, baseType: !1647, size: 64, align: 64, offset: 5376)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1649)
!1649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1650)
!1650 = !{!1651, !1652, !1653, !1654, !1655, !1656, !1657, !1661, !1665, !1666, !1667, !1668, !1674, !1675, !1676, !1677, !1678}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1649, file: !4, line: 3642, baseType: !975, size: 64, align: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1649, file: !4, line: 3649, baseType: !545, size: 32, align: 32, offset: 64)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1649, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1649, file: !4, line: 3663, baseType: !555, size: 32, align: 32, offset: 128)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1649, file: !4, line: 3669, baseType: !968, size: 32, align: 32, offset: 160)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1649, file: !4, line: 3682, baseType: !1473, size: 64, align: 64, offset: 192)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1649, file: !4, line: 3698, baseType: !1658, size: 64, align: 64, offset: 256)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{!968, !1263, !1217, !967}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1649, file: !4, line: 3712, baseType: !1662, size: 64, align: 64, offset: 320)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DISubroutineType(types: !1664)
!1664 = !{!968, !1263, !968, !1217, !967}
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1649, file: !4, line: 3726, baseType: !1658, size: 64, align: 64, offset: 384)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1649, file: !4, line: 3737, baseType: !1311, size: 64, align: 64, offset: 448)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1649, file: !4, line: 3746, baseType: !968, size: 32, align: 32, offset: 512)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1649, file: !4, line: 3757, baseType: !1669, size: 64, align: 64, offset: 576)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DISubroutineType(types: !1671)
!1671 = !{null, !1672}
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1649, file: !4, line: 3766, baseType: !1311, size: 64, align: 64, offset: 640)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1649, file: !4, line: 3774, baseType: !1311, size: 64, align: 64, offset: 704)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1649, file: !4, line: 3780, baseType: !968, size: 32, align: 32, offset: 768)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1649, file: !4, line: 3785, baseType: !968, size: 32, align: 32, offset: 800)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1649, file: !4, line: 3795, baseType: !1679, size: 64, align: 64, offset: 832)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DISubroutineType(types: !1681)
!1681 = !{!968, !1263, !1124}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1265, file: !4, line: 2728, baseType: !1006, size: 64, align: 64, offset: 5440)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1265, file: !4, line: 2735, baseType: !1403, size: 512, align: 64, offset: 5504)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1265, file: !4, line: 2742, baseType: !968, size: 32, align: 32, offset: 6016)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1265, file: !4, line: 2755, baseType: !968, size: 32, align: 32, offset: 6048)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1265, file: !4, line: 2776, baseType: !968, size: 32, align: 32, offset: 6080)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1265, file: !4, line: 2783, baseType: !968, size: 32, align: 32, offset: 6112)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1265, file: !4, line: 2791, baseType: !968, size: 32, align: 32, offset: 6144)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1265, file: !4, line: 2802, baseType: !1476, size: 64, align: 64, offset: 6208)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1265, file: !4, line: 2811, baseType: !968, size: 32, align: 32, offset: 6272)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1265, file: !4, line: 2821, baseType: !968, size: 32, align: 32, offset: 6304)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1265, file: !4, line: 2830, baseType: !968, size: 32, align: 32, offset: 6336)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1265, file: !4, line: 2840, baseType: !968, size: 32, align: 32, offset: 6368)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1265, file: !4, line: 2851, baseType: !1695, size: 64, align: 64, offset: 6400)
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64, align: 64)
!1696 = !DISubroutineType(types: !1697)
!1697 = !{!968, !1516, !1698, !1006, !1458, !968, !968}
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DISubroutineType(types: !1700)
!1700 = !{!968, !1516, !1006}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1265, file: !4, line: 2871, baseType: !1702, size: 64, align: 64, offset: 6464)
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
!1703 = !DISubroutineType(types: !1704)
!1704 = !{!968, !1516, !1705, !1006, !1458, !968}
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64, align: 64)
!1706 = !DISubroutineType(types: !1707)
!1707 = !{!968, !1516, !1006, !968, !968}
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1265, file: !4, line: 2878, baseType: !968, size: 32, align: 32, offset: 6528)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1265, file: !4, line: 2885, baseType: !968, size: 32, align: 32, offset: 6560)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1265, file: !4, line: 3005, baseType: !968, size: 32, align: 32, offset: 6592)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1265, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1265, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1265, file: !4, line: 3027, baseType: !909, size: 32, align: 32, offset: 6688)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1265, file: !4, line: 3037, baseType: !1134, size: 64, align: 64, offset: 6720)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1265, file: !4, line: 3038, baseType: !968, size: 32, align: 32, offset: 6784)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1265, file: !4, line: 3050, baseType: !1295, size: 64, align: 64, offset: 6848)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1265, file: !4, line: 3065, baseType: !968, size: 32, align: 32, offset: 6912)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1265, file: !4, line: 3083, baseType: !968, size: 32, align: 32, offset: 6944)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1265, file: !4, line: 3092, baseType: !1024, size: 64, align: 32, offset: 6976)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1265, file: !4, line: 3099, baseType: !555, size: 32, align: 32, offset: 7040)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1265, file: !4, line: 3106, baseType: !1024, size: 64, align: 32, offset: 7072)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1265, file: !4, line: 3113, baseType: !1723, size: 64, align: 64, offset: 7168)
!1723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1724, size: 64, align: 64)
!1724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1725)
!1725 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1726)
!1726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1727)
!1727 = !{!1728, !1729, !1730, !1731, !1732, !1733, !1736}
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1726, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1726, file: !4, line: 714, baseType: !545, size: 32, align: 32, offset: 32)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1726, file: !4, line: 720, baseType: !975, size: 64, align: 64, offset: 64)
