; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpdec_vc2hq.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpdec_vc2hq.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RTPDynamicProtocolHandler = type { i8*, i32, i32, i32, i32, i32, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*, i8*)*, void (%struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, %struct.PayloadContext*, %struct.AVStream*, %struct.AVPacket*, i32*, i8*, i32, i16, i32)*, i32 (%struct.PayloadContext*)*, %struct.RTPDynamicProtocolHandler* }

!894 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!895 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !897)
!897 = !{!898, !899, !900, !901, !902, !903, !904}
!898 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!899 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!900 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!901 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!902 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!903 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!904 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !14, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !474, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DiracParseCodes", file: !917, line: 57, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "./libavcodec/dirac.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!918 = !{!919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934}
!919 = !DIEnumerator(name: "DIRAC_PCODE_SEQ_HEADER", value: 0)
!920 = !DIEnumerator(name: "DIRAC_PCODE_END_SEQ", value: 16)
!921 = !DIEnumerator(name: "DIRAC_PCODE_AUX", value: 32)
!922 = !DIEnumerator(name: "DIRAC_PCODE_PAD", value: 48)
!923 = !DIEnumerator(name: "DIRAC_PCODE_PICTURE_CODED", value: 8)
!924 = !DIEnumerator(name: "DIRAC_PCODE_PICTURE_RAW", value: 72)
!925 = !DIEnumerator(name: "DIRAC_PCODE_PICTURE_LOW_DEL", value: 200)
!926 = !DIEnumerator(name: "DIRAC_PCODE_PICTURE_HQ", value: 232)
!927 = !DIEnumerator(name: "DIRAC_PCODE_INTER_NOREF_CO1", value: 10)
!928 = !DIEnumerator(name: "DIRAC_PCODE_INTER_NOREF_CO2", value: 9)
!929 = !DIEnumerator(name: "DIRAC_PCODE_INTER_REF_CO1", value: 13)
!930 = !DIEnumerator(name: "DIRAC_PCODE_INTER_REF_CO2", value: 14)
!931 = !DIEnumerator(name: "DIRAC_PCODE_INTRA_REF_CO", value: 12)
!932 = !DIEnumerator(name: "DIRAC_PCODE_INTRA_REF_RAW", value: 76)
!933 = !DIEnumerator(name: "DIRAC_PCODE_INTRA_REF_PICT", value: 204)
!934 = !DIEnumerator(name: "DIRAC_PCODE_MAGIC", value: 1111638852)
!935 = !{!936, !937, !938, !945, !947}
!936 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!937 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !940, line: 221, size: 32, align: 8, elements: !941)
!940 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!941 = !{!942}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !939, file: !940, line: 221, baseType: !943, size: 32, align: 32)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !944, line: 51, baseType: !937)
!944 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !940, line: 222, size: 16, align: 8, elements: !950)
!950 = !{!951}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !949, file: !940, line: 222, baseType: !952, size: 16, align: 16)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !944, line: 49, baseType: !953)
!953 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!954 = !{!955, !2128}
!955 = distinct !DIGlobalVariable(name: "ff_vc2hq_dynamic_handler", scope: !0, file: !956, line: 219, type: !957, isLocal: false, isDefinition: true, variable: %struct.RTPDynamicProtocolHandler* @ff_vc2hq_dynamic_handler)
!956 = !DIFile(filename: "libavformat/rtpdec_vc2hq.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTPDynamicProtocolHandler", file: !959, line: 33, baseType: !960)
!959 = !DIFile(filename: "libavformat/rtpdec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RTPDynamicProtocolHandler", file: !959, line: 115, size: 640, align: 64, elements: !961)
!961 = !{!962, !966, !967, !968, !969, !970, !971, !2108, !2112, !2116, !2122, !2126}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "enc_name", scope: !960, file: !959, line: 116, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !960, file: !959, line: 117, baseType: !3, size: 32, align: 32, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !960, file: !959, line: 118, baseType: !13, size: 32, align: 32, offset: 96)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "need_parsing", scope: !960, file: !959, line: 119, baseType: !473, size: 32, align: 32, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "static_payload_id", scope: !960, file: !959, line: 120, baseType: !936, size: 32, align: 32, offset: 160)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !960, file: !959, line: 123, baseType: !936, size: 32, align: 32, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !960, file: !959, line: 126, baseType: !972, size: 64, align: 64, offset: 256)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!936, !975, !936, !2098}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !474, line: 1947, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !474, line: 1337, size: 11968, align: 64, elements: !978)
!978 = !{!979, !1021, !1130, !1278, !1279, !1344, !1345, !1346, !1975, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2029, !2030, !2031, !2032, !2033, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2064, !2065, !2068, !2069, !2070, !2071, !2072, !2073, !2075, !2076, !2077, !2078, !2086, !2087, !2091, !2095, !2096, !2097}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !977, file: !474, line: 1342, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !483, line: 143, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !483, line: 67, size: 640, align: 64, elements: !984)
!984 = !{!985, !986, !991, !995, !996, !997, !998, !1002, !1008, !1010, !1014}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !983, file: !483, line: 72, baseType: !963, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !983, file: !483, line: 78, baseType: !987, size: 64, align: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!963, !990}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !983, file: !483, line: 85, baseType: !992, size: 64, align: 64, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !483, line: 85, flags: DIFlagFwdDecl)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !983, file: !483, line: 93, baseType: !936, size: 32, align: 32, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !983, file: !483, line: 99, baseType: !936, size: 32, align: 32, offset: 224)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !983, file: !483, line: 108, baseType: !936, size: 32, align: 32, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !983, file: !483, line: 113, baseType: !999, size: 64, align: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!990, !990, !990}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !983, file: !483, line: 123, baseType: !1003, size: 64, align: 64, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!1006, !1006}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !983, file: !483, line: 130, baseType: !1009, size: 32, align: 32, offset: 448)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !483, line: 48, baseType: !482)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !983, file: !483, line: 136, baseType: !1011, size: 64, align: 64, offset: 512)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!1009, !990}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !983, file: !483, line: 142, baseType: !1015, size: 64, align: 64, offset: 576)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!936, !1018, !990, !963, !936}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !483, line: 60, flags: DIFlagFwdDecl)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !977, file: !474, line: 1349, baseType: !1022, size: 64, align: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !474, line: 633, size: 1344, align: 64, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1035, !1036, !1037, !1038, !1039, !1040, !1054, !1059, !1101, !1102, !1106, !1111, !1112, !1113, !1117, !1123, !1129}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1023, file: !474, line: 638, baseType: !963, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1023, file: !474, line: 645, baseType: !963, size: 64, align: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1023, file: !474, line: 652, baseType: !936, size: 32, align: 32, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1023, file: !474, line: 659, baseType: !963, size: 64, align: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1023, file: !474, line: 661, baseType: !1030, size: 64, align: 64, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1034 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !474, line: 443, flags: DIFlagFwdDecl)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1023, file: !474, line: 663, baseType: !980, size: 64, align: 64, offset: 320)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1023, file: !474, line: 670, baseType: !963, size: 64, align: 64, offset: 384)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1023, file: !474, line: 679, baseType: !1022, size: 64, align: 64, offset: 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1023, file: !474, line: 684, baseType: !936, size: 32, align: 32, offset: 512)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1023, file: !474, line: 689, baseType: !936, size: 32, align: 32, offset: 544)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1023, file: !474, line: 696, baseType: !1041, size: 64, align: 64, offset: 576)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!936, !1044}
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !474, line: 453, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !474, line: 448, size: 256, align: 64, elements: !1047)
!1047 = !{!1048, !1049, !1052, !1053}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1046, file: !474, line: 449, baseType: !963, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1046, file: !474, line: 450, baseType: !1050, size: 64, align: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1046, file: !474, line: 451, baseType: !936, size: 32, align: 32, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1046, file: !474, line: 452, baseType: !963, size: 64, align: 64, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1023, file: !474, line: 703, baseType: !1055, size: 64, align: 64, offset: 640)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!936, !1058}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1023, file: !474, line: 714, baseType: !1060, size: 64, align: 64, offset: 704)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!936, !1058, !1063}
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1066)
!1066 = !{!1067, !1081, !1084, !1085, !1086, !1087, !1088, !1089, !1097, !1098, !1099, !1100}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1065, file: !14, line: 1451, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1070, line: 94, baseType: !1071)
!1070 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1070, line: 81, size: 192, align: 64, elements: !1072)
!1072 = !{!1073, !1077, !1080}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1071, file: !1070, line: 82, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1070, line: 73, baseType: !1076)
!1076 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1070, line: 73, flags: DIFlagFwdDecl)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1071, file: !1070, line: 89, baseType: !1078, size: 64, align: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !944, line: 48, baseType: !1051)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1071, file: !1070, line: 93, baseType: !936, size: 32, align: 32, offset: 128)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1065, file: !14, line: 1461, baseType: !1082, size: 64, align: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !944, line: 40, baseType: !1083)
!1083 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1065, file: !14, line: 1467, baseType: !1082, size: 64, align: 64, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1065, file: !14, line: 1468, baseType: !1078, size: 64, align: 64, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1065, file: !14, line: 1469, baseType: !936, size: 32, align: 32, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1065, file: !14, line: 1470, baseType: !936, size: 32, align: 32, offset: 288)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1065, file: !14, line: 1474, baseType: !936, size: 32, align: 32, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1065, file: !14, line: 1479, baseType: !1090, size: 64, align: 64, offset: 384)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1093)
!1093 = !{!1094, !1095, !1096}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1092, file: !14, line: 1412, baseType: !1078, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1092, file: !14, line: 1413, baseType: !936, size: 32, align: 32, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1092, file: !14, line: 1414, baseType: !503, size: 32, align: 32, offset: 96)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1065, file: !14, line: 1480, baseType: !936, size: 32, align: 32, offset: 448)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1065, file: !14, line: 1486, baseType: !1082, size: 64, align: 64, offset: 512)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1065, file: !14, line: 1488, baseType: !1082, size: 64, align: 64, offset: 576)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1065, file: !14, line: 1497, baseType: !1082, size: 64, align: 64, offset: 640)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1023, file: !474, line: 720, baseType: !1055, size: 64, align: 64, offset: 768)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1023, file: !474, line: 730, baseType: !1103, size: 64, align: 64, offset: 832)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!936, !1058, !936, !1082, !936}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1023, file: !474, line: 737, baseType: !1107, size: 64, align: 64, offset: 896)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!1082, !1058, !936, !1110, !1082}
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1023, file: !474, line: 744, baseType: !1055, size: 64, align: 64, offset: 960)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1023, file: !474, line: 750, baseType: !1055, size: 64, align: 64, offset: 1024)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1023, file: !474, line: 758, baseType: !1114, size: 64, align: 64, offset: 1088)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!936, !1058, !936, !1082, !1082, !1082, !936}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1023, file: !474, line: 764, baseType: !1118, size: 64, align: 64, offset: 1152)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!936, !1058, !1121}
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !474, line: 328, flags: DIFlagFwdDecl)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1023, file: !474, line: 770, baseType: !1124, size: 64, align: 64, offset: 1216)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!936, !1058, !1127}
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !474, line: 329, flags: DIFlagFwdDecl)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1023, file: !474, line: 776, baseType: !1124, size: 64, align: 64, offset: 1280)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !977, file: !474, line: 1356, baseType: !1131, size: 64, align: 64, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !474, line: 497, size: 1600, align: 64, elements: !1133)
!1133 = !{!1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1153, !1157, !1161, !1168, !1263, !1264, !1265, !1266, !1267, !1268, !1272}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1132, file: !474, line: 498, baseType: !963, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1132, file: !474, line: 504, baseType: !963, size: 64, align: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1132, file: !474, line: 505, baseType: !963, size: 64, align: 64, offset: 128)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1132, file: !474, line: 506, baseType: !963, size: 64, align: 64, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1132, file: !474, line: 508, baseType: !13, size: 32, align: 32, offset: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1132, file: !474, line: 509, baseType: !13, size: 32, align: 32, offset: 288)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1132, file: !474, line: 510, baseType: !13, size: 32, align: 32, offset: 320)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1132, file: !474, line: 517, baseType: !936, size: 32, align: 32, offset: 352)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1132, file: !474, line: 523, baseType: !1030, size: 64, align: 64, offset: 384)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1132, file: !474, line: 526, baseType: !980, size: 64, align: 64, offset: 448)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1132, file: !474, line: 535, baseType: !1131, size: 64, align: 64, offset: 512)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1132, file: !474, line: 539, baseType: !936, size: 32, align: 32, offset: 576)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1132, file: !474, line: 541, baseType: !1055, size: 64, align: 64, offset: 640)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1132, file: !474, line: 549, baseType: !1060, size: 64, align: 64, offset: 704)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1132, file: !474, line: 550, baseType: !1055, size: 64, align: 64, offset: 768)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1132, file: !474, line: 554, baseType: !1150, size: 64, align: 64, offset: 832)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!936, !1058, !1063, !1063, !936}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1132, file: !474, line: 563, baseType: !1154, size: 64, align: 64, offset: 896)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!936, !13, !936}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1132, file: !474, line: 565, baseType: !1158, size: 64, align: 64, offset: 960)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{null, !1058, !936, !1110, !1110}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1132, file: !474, line: 570, baseType: !1162, size: 64, align: 64, offset: 1024)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!936, !1058, !936, !990, !1165}
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1166, line: 216, baseType: !1167)
!1166 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1167 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1132, file: !474, line: 581, baseType: !1169, size: 64, align: 64, offset: 1088)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!936, !1058, !936, !1172, !937}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !544, line: 646, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !544, line: 268, size: 4288, align: 64, elements: !1176)
!1176 = !{!1177, !1181, !1183, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1217, !1219, !1220, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1175, file: !544, line: 282, baseType: !1178, size: 512, align: 64)
!1178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1078, size: 512, align: 64, elements: !1179)
!1179 = !{!1180}
!1180 = !DISubrange(count: 8)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1175, file: !544, line: 299, baseType: !1182, size: 256, align: 32, offset: 512)
!1182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 256, align: 32, elements: !1179)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1175, file: !544, line: 315, baseType: !1184, size: 64, align: 64, offset: 768)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1175, file: !544, line: 326, baseType: !936, size: 32, align: 32, offset: 832)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1175, file: !544, line: 326, baseType: !936, size: 32, align: 32, offset: 864)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1175, file: !544, line: 334, baseType: !936, size: 32, align: 32, offset: 896)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1175, file: !544, line: 341, baseType: !936, size: 32, align: 32, offset: 928)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1175, file: !544, line: 346, baseType: !936, size: 32, align: 32, offset: 960)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1175, file: !544, line: 351, baseType: !533, size: 32, align: 32, offset: 992)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1175, file: !544, line: 356, baseType: !1192, size: 64, align: 32, offset: 1024)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1193, line: 61, baseType: !1194)
!1193 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1193, line: 58, size: 64, align: 32, elements: !1195)
!1195 = !{!1196, !1197}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1194, file: !1193, line: 59, baseType: !936, size: 32, align: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1194, file: !1193, line: 60, baseType: !936, size: 32, align: 32, offset: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1175, file: !544, line: 361, baseType: !1082, size: 64, align: 64, offset: 1088)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1175, file: !544, line: 369, baseType: !1082, size: 64, align: 64, offset: 1152)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1175, file: !544, line: 377, baseType: !1082, size: 64, align: 64, offset: 1216)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1175, file: !544, line: 382, baseType: !936, size: 32, align: 32, offset: 1280)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1175, file: !544, line: 386, baseType: !936, size: 32, align: 32, offset: 1312)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1175, file: !544, line: 391, baseType: !936, size: 32, align: 32, offset: 1344)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1175, file: !544, line: 396, baseType: !990, size: 64, align: 64, offset: 1408)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1175, file: !544, line: 403, baseType: !1206, size: 512, align: 64, offset: 1472)
!1206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1207, size: 512, align: 64, elements: !1179)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !944, line: 55, baseType: !1167)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1175, file: !544, line: 410, baseType: !936, size: 32, align: 32, offset: 1984)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1175, file: !544, line: 415, baseType: !936, size: 32, align: 32, offset: 2016)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1175, file: !544, line: 420, baseType: !936, size: 32, align: 32, offset: 2048)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1175, file: !544, line: 425, baseType: !936, size: 32, align: 32, offset: 2080)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1175, file: !544, line: 435, baseType: !1082, size: 64, align: 64, offset: 2112)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1175, file: !544, line: 440, baseType: !936, size: 32, align: 32, offset: 2176)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1175, file: !544, line: 445, baseType: !1207, size: 64, align: 64, offset: 2240)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1175, file: !544, line: 459, baseType: !1216, size: 512, align: 64, offset: 2304)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1068, size: 512, align: 64, elements: !1179)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1175, file: !544, line: 473, baseType: !1218, size: 64, align: 64, offset: 2816)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1175, file: !544, line: 477, baseType: !936, size: 32, align: 32, offset: 2880)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1175, file: !544, line: 479, baseType: !1221, size: 64, align: 64, offset: 2944)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !544, line: 207, baseType: !1224)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !544, line: 201, size: 320, align: 64, elements: !1225)
!1225 = !{!1226, !1227, !1228, !1229, !1234}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1224, file: !544, line: 202, baseType: !543, size: 32, align: 32)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1224, file: !544, line: 203, baseType: !1078, size: 64, align: 64, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1224, file: !544, line: 204, baseType: !936, size: 32, align: 32, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1224, file: !544, line: 205, baseType: !1230, size: 64, align: 64, offset: 192)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1232, line: 86, baseType: !1233)
!1232 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1233 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1232, line: 86, flags: DIFlagFwdDecl)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1224, file: !544, line: 206, baseType: !1068, size: 64, align: 64, offset: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1175, file: !544, line: 480, baseType: !936, size: 32, align: 32, offset: 3008)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1175, file: !544, line: 505, baseType: !936, size: 32, align: 32, offset: 3040)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1175, file: !544, line: 512, baseType: !567, size: 32, align: 32, offset: 3072)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1175, file: !544, line: 514, baseType: !574, size: 32, align: 32, offset: 3104)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1175, file: !544, line: 516, baseType: !592, size: 32, align: 32, offset: 3136)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1175, file: !544, line: 523, baseType: !616, size: 32, align: 32, offset: 3168)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1175, file: !544, line: 525, baseType: !635, size: 32, align: 32, offset: 3200)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1175, file: !544, line: 532, baseType: !1082, size: 64, align: 64, offset: 3264)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1175, file: !544, line: 539, baseType: !1082, size: 64, align: 64, offset: 3328)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1175, file: !544, line: 547, baseType: !1082, size: 64, align: 64, offset: 3392)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1175, file: !544, line: 554, baseType: !1230, size: 64, align: 64, offset: 3456)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1175, file: !544, line: 563, baseType: !936, size: 32, align: 32, offset: 3520)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1175, file: !544, line: 572, baseType: !936, size: 32, align: 32, offset: 3552)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1175, file: !544, line: 581, baseType: !936, size: 32, align: 32, offset: 3584)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1175, file: !544, line: 588, baseType: !1250, size: 64, align: 64, offset: 3648)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !944, line: 36, baseType: !1252)
!1252 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1175, file: !544, line: 593, baseType: !936, size: 32, align: 32, offset: 3712)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1175, file: !544, line: 596, baseType: !936, size: 32, align: 32, offset: 3744)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1175, file: !544, line: 599, baseType: !1068, size: 64, align: 64, offset: 3776)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1175, file: !544, line: 605, baseType: !1068, size: 64, align: 64, offset: 3840)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1175, file: !544, line: 616, baseType: !1068, size: 64, align: 64, offset: 3904)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1175, file: !544, line: 626, baseType: !1165, size: 64, align: 64, offset: 3968)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1175, file: !544, line: 627, baseType: !1165, size: 64, align: 64, offset: 4032)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1175, file: !544, line: 628, baseType: !1165, size: 64, align: 64, offset: 4096)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1175, file: !544, line: 629, baseType: !1165, size: 64, align: 64, offset: 4160)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1175, file: !544, line: 645, baseType: !1068, size: 64, align: 64, offset: 4224)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1132, file: !474, line: 587, baseType: !1118, size: 64, align: 64, offset: 1152)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1132, file: !474, line: 592, baseType: !1124, size: 64, align: 64, offset: 1216)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1132, file: !474, line: 597, baseType: !1124, size: 64, align: 64, offset: 1280)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1132, file: !474, line: 598, baseType: !13, size: 32, align: 32, offset: 1344)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1132, file: !474, line: 608, baseType: !1055, size: 64, align: 64, offset: 1408)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1132, file: !474, line: 617, baseType: !1269, size: 64, align: 64, offset: 1472)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{null, !1058}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1132, file: !474, line: 623, baseType: !1273, size: 64, align: 64, offset: 1536)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!936, !1058, !1276}
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1064)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !977, file: !474, line: 1365, baseType: !990, size: 64, align: 64, offset: 192)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !977, file: !474, line: 1379, baseType: !1280, size: 64, align: 64, offset: 256)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !646, line: 352, baseType: !1282)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !646, line: 161, size: 2112, align: 64, elements: !1283)
!1283 = !{!1284, !1285, !1286, !1287, !1288, !1289, !1290, !1294, !1295, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1311, !1312, !1316, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1334, !1335, !1336, !1337, !1341, !1342, !1343}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1282, file: !646, line: 174, baseType: !980, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1282, file: !646, line: 226, baseType: !1050, size: 64, align: 64, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1282, file: !646, line: 227, baseType: !936, size: 32, align: 32, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1282, file: !646, line: 228, baseType: !1050, size: 64, align: 64, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1282, file: !646, line: 229, baseType: !1050, size: 64, align: 64, offset: 256)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1282, file: !646, line: 233, baseType: !990, size: 64, align: 64, offset: 320)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1282, file: !646, line: 235, baseType: !1291, size: 64, align: 64, offset: 384)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!936, !990, !1078, !936}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1282, file: !646, line: 236, baseType: !1291, size: 64, align: 64, offset: 448)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1282, file: !646, line: 237, baseType: !1296, size: 64, align: 64, offset: 512)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!1082, !990, !1082, !936}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1282, file: !646, line: 238, baseType: !1082, size: 64, align: 64, offset: 576)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1282, file: !646, line: 239, baseType: !936, size: 32, align: 32, offset: 640)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1282, file: !646, line: 240, baseType: !936, size: 32, align: 32, offset: 672)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1282, file: !646, line: 241, baseType: !936, size: 32, align: 32, offset: 704)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1282, file: !646, line: 242, baseType: !1167, size: 64, align: 64, offset: 768)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1282, file: !646, line: 243, baseType: !1050, size: 64, align: 64, offset: 832)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1282, file: !646, line: 244, baseType: !1306, size: 64, align: 64, offset: 896)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!1167, !1167, !1309, !937}
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1079)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1282, file: !646, line: 245, baseType: !936, size: 32, align: 32, offset: 960)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1282, file: !646, line: 249, baseType: !1313, size: 64, align: 64, offset: 1024)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!936, !990, !936}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1282, file: !646, line: 255, baseType: !1317, size: 64, align: 64, offset: 1088)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!1082, !990, !936, !1082, !936}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1282, file: !646, line: 260, baseType: !936, size: 32, align: 32, offset: 1152)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1282, file: !646, line: 266, baseType: !1082, size: 64, align: 64, offset: 1216)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1282, file: !646, line: 273, baseType: !936, size: 32, align: 32, offset: 1280)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1282, file: !646, line: 279, baseType: !1082, size: 64, align: 64, offset: 1344)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1282, file: !646, line: 285, baseType: !936, size: 32, align: 32, offset: 1408)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1282, file: !646, line: 291, baseType: !936, size: 32, align: 32, offset: 1440)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1282, file: !646, line: 298, baseType: !936, size: 32, align: 32, offset: 1472)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1282, file: !646, line: 304, baseType: !936, size: 32, align: 32, offset: 1504)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1282, file: !646, line: 309, baseType: !963, size: 64, align: 64, offset: 1536)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1282, file: !646, line: 314, baseType: !963, size: 64, align: 64, offset: 1600)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1282, file: !646, line: 319, baseType: !1331, size: 64, align: 64, offset: 1664)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!936, !990, !1078, !936, !645, !1082}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1282, file: !646, line: 326, baseType: !936, size: 32, align: 32, offset: 1728)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1282, file: !646, line: 331, baseType: !645, size: 32, align: 32, offset: 1760)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1282, file: !646, line: 332, baseType: !1082, size: 64, align: 64, offset: 1792)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1282, file: !646, line: 338, baseType: !1338, size: 64, align: 64, offset: 1856)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!936, !990}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1282, file: !646, line: 340, baseType: !1082, size: 64, align: 64, offset: 1920)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1282, file: !646, line: 346, baseType: !1050, size: 64, align: 64, offset: 1984)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1282, file: !646, line: 351, baseType: !936, size: 32, align: 32, offset: 2048)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !977, file: !474, line: 1386, baseType: !936, size: 32, align: 32, offset: 320)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !977, file: !474, line: 1393, baseType: !937, size: 32, align: 32, offset: 352)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !977, file: !474, line: 1405, baseType: !1347, size: 64, align: 64, offset: 384)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !474, line: 1223, baseType: !1350)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !474, line: 865, size: 6144, align: 64, elements: !1351)
!1351 = !{!1352, !1353, !1354, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1822, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1923, !1929, !1930, !1934, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1966, !1967, !1968, !1969, !1970, !1971}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1350, file: !474, line: 866, baseType: !936, size: 32, align: 32)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1350, file: !474, line: 872, baseType: !936, size: 32, align: 32, offset: 32)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1350, file: !474, line: 878, baseType: !1355, size: 64, align: 64, offset: 64)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1357)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1358)
!1358 = !{!1359, !1360, !1361, !1362, !1497, !1498, !1499, !1500, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1526, !1530, !1531, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1710, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1357, file: !14, line: 1561, baseType: !980, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1357, file: !14, line: 1562, baseType: !936, size: 32, align: 32, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1357, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1357, file: !14, line: 1565, baseType: !1363, size: 64, align: 64, offset: 128)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1365)
!1365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1366)
!1366 = !{!1367, !1368, !1369, !1370, !1371, !1372, !1375, !1378, !1381, !1384, !1387, !1388, !1389, !1397, !1398, !1399, !1401, !1405, !1411, !1416, !1420, !1421, !1462, !1469, !1473, !1474, !1478, !1482, !1486, !1490, !1491, !1492}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1365, file: !14, line: 3475, baseType: !963, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1365, file: !14, line: 3480, baseType: !963, size: 64, align: 64, offset: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1365, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1365, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1365, file: !14, line: 3487, baseType: !936, size: 32, align: 32, offset: 192)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1365, file: !14, line: 3488, baseType: !1373, size: 64, align: 64, offset: 256)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1192)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1365, file: !14, line: 3489, baseType: !1376, size: 64, align: 64, offset: 320)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1365, file: !14, line: 3490, baseType: !1379, size: 64, align: 64, offset: 384)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1365, file: !14, line: 3491, baseType: !1382, size: 64, align: 64, offset: 448)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !853)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1365, file: !14, line: 3492, baseType: !1385, size: 64, align: 64, offset: 512)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1207)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1365, file: !14, line: 3493, baseType: !1079, size: 8, align: 8, offset: 576)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1365, file: !14, line: 3494, baseType: !980, size: 64, align: 64, offset: 640)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1365, file: !14, line: 3495, baseType: !1390, size: 64, align: 64, offset: 704)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1392)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1393)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1394)
!1394 = !{!1395, !1396}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1393, file: !14, line: 3402, baseType: !936, size: 32, align: 32)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1393, file: !14, line: 3403, baseType: !963, size: 64, align: 64, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1365, file: !14, line: 3507, baseType: !963, size: 64, align: 64, offset: 768)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1365, file: !14, line: 3516, baseType: !936, size: 32, align: 32, offset: 832)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1365, file: !14, line: 3517, baseType: !1400, size: 64, align: 64, offset: 896)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1365, file: !14, line: 3527, baseType: !1402, size: 64, align: 64, offset: 960)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DISubroutineType(types: !1404)
!1404 = !{!936, !1355}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1365, file: !14, line: 3535, baseType: !1406, size: 64, align: 64, offset: 1024)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DISubroutineType(types: !1408)
!1408 = !{!936, !1355, !1409}
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1356)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1365, file: !14, line: 3541, baseType: !1412, size: 64, align: 64, offset: 1088)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1414)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1415)
!1415 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1365, file: !14, line: 3549, baseType: !1417, size: 64, align: 64, offset: 1152)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DISubroutineType(types: !1419)
!1419 = !{null, !1400}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1365, file: !14, line: 3551, baseType: !1402, size: 64, align: 64, offset: 1216)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1365, file: !14, line: 3552, baseType: !1422, size: 64, align: 64, offset: 1280)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{!936, !1355, !1078, !936, !1425}
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1427)
!1427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1428)
!1428 = !{!1429, !1430, !1431, !1432, !1433, !1461}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1427, file: !14, line: 3921, baseType: !952, size: 16, align: 16)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1427, file: !14, line: 3922, baseType: !943, size: 32, align: 32, offset: 32)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1427, file: !14, line: 3923, baseType: !943, size: 32, align: 32, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1427, file: !14, line: 3924, baseType: !937, size: 32, align: 32, offset: 96)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1427, file: !14, line: 3925, baseType: !1434, size: 64, align: 64, offset: 128)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1437)
!1437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1438)
!1438 = !{!1439, !1440, !1441, !1442, !1443, !1444, !1450, !1454, !1456, !1457, !1459, !1460}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1437, file: !14, line: 3886, baseType: !936, size: 32, align: 32)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1437, file: !14, line: 3887, baseType: !936, size: 32, align: 32, offset: 32)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1437, file: !14, line: 3888, baseType: !936, size: 32, align: 32, offset: 64)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1437, file: !14, line: 3889, baseType: !936, size: 32, align: 32, offset: 96)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1437, file: !14, line: 3890, baseType: !936, size: 32, align: 32, offset: 128)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1437, file: !14, line: 3897, baseType: !1445, size: 768, align: 64, offset: 192)
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1446)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1447)
!1447 = !{!1448, !1449}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1446, file: !14, line: 3855, baseType: !1178, size: 512, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1446, file: !14, line: 3857, baseType: !1182, size: 256, align: 32, offset: 512)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1437, file: !14, line: 3903, baseType: !1451, size: 256, align: 64, offset: 960)
!1451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1078, size: 256, align: 64, elements: !1452)
!1452 = !{!1453}
!1453 = !DISubrange(count: 4)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1437, file: !14, line: 3904, baseType: !1455, size: 128, align: 32, offset: 1216)
!1455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 128, align: 32, elements: !1452)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1437, file: !14, line: 3906, baseType: !870, size: 32, align: 32, offset: 1344)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1437, file: !14, line: 3908, baseType: !1458, size: 64, align: 64, offset: 1408)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1437, file: !14, line: 3915, baseType: !1458, size: 64, align: 64, offset: 1472)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1437, file: !14, line: 3917, baseType: !936, size: 32, align: 32, offset: 1536)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1427, file: !14, line: 3926, baseType: !1082, size: 64, align: 64, offset: 192)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1365, file: !14, line: 3564, baseType: !1463, size: 64, align: 64, offset: 1344)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DISubroutineType(types: !1465)
!1465 = !{!936, !1355, !1063, !1466, !1468}
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1174)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1365, file: !14, line: 3566, baseType: !1470, size: 64, align: 64, offset: 1408)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{!936, !1355, !990, !1468, !1063}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1365, file: !14, line: 3567, baseType: !1402, size: 64, align: 64, offset: 1472)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1365, file: !14, line: 3576, baseType: !1475, size: 64, align: 64, offset: 1536)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!936, !1355, !1466}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1365, file: !14, line: 3577, baseType: !1479, size: 64, align: 64, offset: 1600)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{!936, !1355, !1063}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1365, file: !14, line: 3584, baseType: !1483, size: 64, align: 64, offset: 1664)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DISubroutineType(types: !1485)
!1485 = !{!936, !1355, !1173}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1365, file: !14, line: 3589, baseType: !1487, size: 64, align: 64, offset: 1728)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DISubroutineType(types: !1489)
!1489 = !{null, !1355}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1365, file: !14, line: 3594, baseType: !936, size: 32, align: 32, offset: 1792)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1365, file: !14, line: 3600, baseType: !963, size: 64, align: 64, offset: 1856)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1365, file: !14, line: 3609, baseType: !1493, size: 64, align: 64, offset: 1920)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1496)
!1496 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1357, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1357, file: !14, line: 1581, baseType: !937, size: 32, align: 32, offset: 224)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1357, file: !14, line: 1583, baseType: !990, size: 64, align: 64, offset: 256)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1357, file: !14, line: 1591, baseType: !1501, size: 64, align: 64, offset: 320)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1357, file: !14, line: 1598, baseType: !990, size: 64, align: 64, offset: 384)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1357, file: !14, line: 1606, baseType: !1082, size: 64, align: 64, offset: 448)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1357, file: !14, line: 1614, baseType: !936, size: 32, align: 32, offset: 512)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1357, file: !14, line: 1622, baseType: !936, size: 32, align: 32, offset: 544)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1357, file: !14, line: 1628, baseType: !936, size: 32, align: 32, offset: 576)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1357, file: !14, line: 1636, baseType: !936, size: 32, align: 32, offset: 608)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1357, file: !14, line: 1643, baseType: !936, size: 32, align: 32, offset: 640)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1357, file: !14, line: 1657, baseType: !1078, size: 64, align: 64, offset: 704)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1357, file: !14, line: 1658, baseType: !936, size: 32, align: 32, offset: 768)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1357, file: !14, line: 1679, baseType: !1192, size: 64, align: 32, offset: 800)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1357, file: !14, line: 1688, baseType: !936, size: 32, align: 32, offset: 864)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1357, file: !14, line: 1712, baseType: !936, size: 32, align: 32, offset: 896)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1357, file: !14, line: 1729, baseType: !936, size: 32, align: 32, offset: 928)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1357, file: !14, line: 1729, baseType: !936, size: 32, align: 32, offset: 960)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1357, file: !14, line: 1744, baseType: !936, size: 32, align: 32, offset: 992)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1357, file: !14, line: 1744, baseType: !936, size: 32, align: 32, offset: 1024)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1357, file: !14, line: 1751, baseType: !936, size: 32, align: 32, offset: 1056)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1357, file: !14, line: 1766, baseType: !654, size: 32, align: 32, offset: 1088)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1357, file: !14, line: 1791, baseType: !1522, size: 64, align: 64, offset: 1152)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DISubroutineType(types: !1524)
!1524 = !{null, !1525, !1466, !1468, !936, !936, !936}
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1357, file: !14, line: 1808, baseType: !1527, size: 64, align: 64, offset: 1216)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DISubroutineType(types: !1529)
!1529 = !{!654, !1525, !1376}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1357, file: !14, line: 1816, baseType: !936, size: 32, align: 32, offset: 1280)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1357, file: !14, line: 1825, baseType: !1532, size: 32, align: 32, offset: 1312)
!1532 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1357, file: !14, line: 1830, baseType: !936, size: 32, align: 32, offset: 1344)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1357, file: !14, line: 1838, baseType: !1532, size: 32, align: 32, offset: 1376)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1357, file: !14, line: 1846, baseType: !936, size: 32, align: 32, offset: 1408)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1357, file: !14, line: 1851, baseType: !936, size: 32, align: 32, offset: 1440)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1357, file: !14, line: 1861, baseType: !1532, size: 32, align: 32, offset: 1472)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1357, file: !14, line: 1868, baseType: !1532, size: 32, align: 32, offset: 1504)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1357, file: !14, line: 1875, baseType: !1532, size: 32, align: 32, offset: 1536)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1357, file: !14, line: 1882, baseType: !1532, size: 32, align: 32, offset: 1568)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1357, file: !14, line: 1889, baseType: !1532, size: 32, align: 32, offset: 1600)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1357, file: !14, line: 1896, baseType: !1532, size: 32, align: 32, offset: 1632)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1357, file: !14, line: 1903, baseType: !1532, size: 32, align: 32, offset: 1664)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1357, file: !14, line: 1910, baseType: !936, size: 32, align: 32, offset: 1696)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1357, file: !14, line: 1915, baseType: !936, size: 32, align: 32, offset: 1728)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1357, file: !14, line: 1926, baseType: !1468, size: 64, align: 64, offset: 1792)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1357, file: !14, line: 1935, baseType: !1192, size: 64, align: 32, offset: 1856)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1357, file: !14, line: 1942, baseType: !936, size: 32, align: 32, offset: 1920)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1357, file: !14, line: 1948, baseType: !936, size: 32, align: 32, offset: 1952)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1357, file: !14, line: 1954, baseType: !936, size: 32, align: 32, offset: 1984)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1357, file: !14, line: 1960, baseType: !936, size: 32, align: 32, offset: 2016)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1357, file: !14, line: 1984, baseType: !936, size: 32, align: 32, offset: 2048)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1357, file: !14, line: 1991, baseType: !936, size: 32, align: 32, offset: 2080)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1357, file: !14, line: 1996, baseType: !936, size: 32, align: 32, offset: 2112)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1357, file: !14, line: 2004, baseType: !936, size: 32, align: 32, offset: 2144)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1357, file: !14, line: 2011, baseType: !936, size: 32, align: 32, offset: 2176)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1357, file: !14, line: 2018, baseType: !936, size: 32, align: 32, offset: 2208)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1357, file: !14, line: 2027, baseType: !936, size: 32, align: 32, offset: 2240)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1357, file: !14, line: 2034, baseType: !936, size: 32, align: 32, offset: 2272)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1357, file: !14, line: 2044, baseType: !936, size: 32, align: 32, offset: 2304)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1357, file: !14, line: 2054, baseType: !1562, size: 64, align: 64, offset: 2368)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1357, file: !14, line: 2061, baseType: !1562, size: 64, align: 64, offset: 2432)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1357, file: !14, line: 2066, baseType: !936, size: 32, align: 32, offset: 2496)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1357, file: !14, line: 2070, baseType: !936, size: 32, align: 32, offset: 2528)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1357, file: !14, line: 2078, baseType: !936, size: 32, align: 32, offset: 2560)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1357, file: !14, line: 2085, baseType: !936, size: 32, align: 32, offset: 2592)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1357, file: !14, line: 2092, baseType: !936, size: 32, align: 32, offset: 2624)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1357, file: !14, line: 2099, baseType: !936, size: 32, align: 32, offset: 2656)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1357, file: !14, line: 2106, baseType: !936, size: 32, align: 32, offset: 2688)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1357, file: !14, line: 2113, baseType: !936, size: 32, align: 32, offset: 2720)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1357, file: !14, line: 2120, baseType: !936, size: 32, align: 32, offset: 2752)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1357, file: !14, line: 2125, baseType: !936, size: 32, align: 32, offset: 2784)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1357, file: !14, line: 2133, baseType: !936, size: 32, align: 32, offset: 2816)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1357, file: !14, line: 2140, baseType: !936, size: 32, align: 32, offset: 2848)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1357, file: !14, line: 2145, baseType: !936, size: 32, align: 32, offset: 2880)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1357, file: !14, line: 2153, baseType: !936, size: 32, align: 32, offset: 2912)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1357, file: !14, line: 2158, baseType: !936, size: 32, align: 32, offset: 2944)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1357, file: !14, line: 2166, baseType: !574, size: 32, align: 32, offset: 2976)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1357, file: !14, line: 2173, baseType: !592, size: 32, align: 32, offset: 3008)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1357, file: !14, line: 2180, baseType: !616, size: 32, align: 32, offset: 3040)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1357, file: !14, line: 2187, baseType: !567, size: 32, align: 32, offset: 3072)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1357, file: !14, line: 2194, baseType: !635, size: 32, align: 32, offset: 3104)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1357, file: !14, line: 2203, baseType: !936, size: 32, align: 32, offset: 3136)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1357, file: !14, line: 2209, baseType: !876, size: 32, align: 32, offset: 3168)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1357, file: !14, line: 2212, baseType: !936, size: 32, align: 32, offset: 3200)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1357, file: !14, line: 2213, baseType: !936, size: 32, align: 32, offset: 3232)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1357, file: !14, line: 2220, baseType: !853, size: 32, align: 32, offset: 3264)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1357, file: !14, line: 2232, baseType: !936, size: 32, align: 32, offset: 3296)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1357, file: !14, line: 2243, baseType: !936, size: 32, align: 32, offset: 3328)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1357, file: !14, line: 2249, baseType: !936, size: 32, align: 32, offset: 3360)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1357, file: !14, line: 2256, baseType: !936, size: 32, align: 32, offset: 3392)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1357, file: !14, line: 2263, baseType: !1207, size: 64, align: 64, offset: 3456)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1357, file: !14, line: 2270, baseType: !1207, size: 64, align: 64, offset: 3520)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1357, file: !14, line: 2277, baseType: !884, size: 32, align: 32, offset: 3584)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1357, file: !14, line: 2285, baseType: !853, size: 32, align: 32, offset: 3616)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1357, file: !14, line: 2367, baseType: !1598, size: 64, align: 64, offset: 3648)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DISubroutineType(types: !1600)
!1600 = !{!936, !1525, !1173, !936}
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1357, file: !14, line: 2383, baseType: !936, size: 32, align: 32, offset: 3712)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1357, file: !14, line: 2386, baseType: !1532, size: 32, align: 32, offset: 3744)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1357, file: !14, line: 2387, baseType: !1532, size: 32, align: 32, offset: 3776)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1357, file: !14, line: 2394, baseType: !936, size: 32, align: 32, offset: 3808)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1357, file: !14, line: 2401, baseType: !936, size: 32, align: 32, offset: 3840)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1357, file: !14, line: 2408, baseType: !936, size: 32, align: 32, offset: 3872)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1357, file: !14, line: 2415, baseType: !936, size: 32, align: 32, offset: 3904)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1357, file: !14, line: 2422, baseType: !936, size: 32, align: 32, offset: 3936)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1357, file: !14, line: 2423, baseType: !1610, size: 64, align: 64, offset: 3968)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1612)
!1612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1613)
!1613 = !{!1614, !1615, !1616, !1617}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1612, file: !14, line: 827, baseType: !936, size: 32, align: 32)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1612, file: !14, line: 828, baseType: !936, size: 32, align: 32, offset: 32)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1612, file: !14, line: 829, baseType: !936, size: 32, align: 32, offset: 64)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1612, file: !14, line: 830, baseType: !1532, size: 32, align: 32, offset: 96)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1357, file: !14, line: 2430, baseType: !1082, size: 64, align: 64, offset: 4032)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1357, file: !14, line: 2437, baseType: !1082, size: 64, align: 64, offset: 4096)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1357, file: !14, line: 2444, baseType: !1532, size: 32, align: 32, offset: 4160)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1357, file: !14, line: 2451, baseType: !1532, size: 32, align: 32, offset: 4192)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1357, file: !14, line: 2458, baseType: !936, size: 32, align: 32, offset: 4224)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1357, file: !14, line: 2469, baseType: !936, size: 32, align: 32, offset: 4256)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1357, file: !14, line: 2475, baseType: !936, size: 32, align: 32, offset: 4288)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1357, file: !14, line: 2481, baseType: !936, size: 32, align: 32, offset: 4320)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1357, file: !14, line: 2485, baseType: !936, size: 32, align: 32, offset: 4352)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1357, file: !14, line: 2489, baseType: !936, size: 32, align: 32, offset: 4384)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1357, file: !14, line: 2493, baseType: !936, size: 32, align: 32, offset: 4416)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1357, file: !14, line: 2501, baseType: !936, size: 32, align: 32, offset: 4448)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1357, file: !14, line: 2506, baseType: !936, size: 32, align: 32, offset: 4480)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1357, file: !14, line: 2510, baseType: !936, size: 32, align: 32, offset: 4512)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1357, file: !14, line: 2514, baseType: !1082, size: 64, align: 64, offset: 4544)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1357, file: !14, line: 2528, baseType: !1634, size: 64, align: 64, offset: 4608)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DISubroutineType(types: !1636)
!1636 = !{null, !1525, !990, !936, !936}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1357, file: !14, line: 2534, baseType: !936, size: 32, align: 32, offset: 4672)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1357, file: !14, line: 2545, baseType: !936, size: 32, align: 32, offset: 4704)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1357, file: !14, line: 2547, baseType: !936, size: 32, align: 32, offset: 4736)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1357, file: !14, line: 2549, baseType: !936, size: 32, align: 32, offset: 4768)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1357, file: !14, line: 2551, baseType: !936, size: 32, align: 32, offset: 4800)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1357, file: !14, line: 2553, baseType: !936, size: 32, align: 32, offset: 4832)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1357, file: !14, line: 2555, baseType: !936, size: 32, align: 32, offset: 4864)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1357, file: !14, line: 2557, baseType: !936, size: 32, align: 32, offset: 4896)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1357, file: !14, line: 2559, baseType: !936, size: 32, align: 32, offset: 4928)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1357, file: !14, line: 2563, baseType: !936, size: 32, align: 32, offset: 4960)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1357, file: !14, line: 2571, baseType: !1458, size: 64, align: 64, offset: 4992)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1357, file: !14, line: 2579, baseType: !1458, size: 64, align: 64, offset: 5056)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1357, file: !14, line: 2586, baseType: !936, size: 32, align: 32, offset: 5120)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1357, file: !14, line: 2615, baseType: !936, size: 32, align: 32, offset: 5152)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1357, file: !14, line: 2627, baseType: !936, size: 32, align: 32, offset: 5184)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1357, file: !14, line: 2637, baseType: !936, size: 32, align: 32, offset: 5216)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1357, file: !14, line: 2681, baseType: !936, size: 32, align: 32, offset: 5248)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1357, file: !14, line: 2709, baseType: !1082, size: 64, align: 64, offset: 5312)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1357, file: !14, line: 2716, baseType: !1656, size: 64, align: 64, offset: 5376)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1658)
!1658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1659)
!1659 = !{!1660, !1661, !1662, !1663, !1664, !1665, !1666, !1670, !1674, !1675, !1676, !1677, !1683, !1684, !1685, !1686, !1687}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1658, file: !14, line: 3642, baseType: !963, size: 64, align: 64)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1658, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1658, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1658, file: !14, line: 3663, baseType: !654, size: 32, align: 32, offset: 128)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1658, file: !14, line: 3669, baseType: !936, size: 32, align: 32, offset: 160)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1658, file: !14, line: 3682, baseType: !1483, size: 64, align: 64, offset: 192)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1658, file: !14, line: 3698, baseType: !1667, size: 64, align: 64, offset: 256)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{!936, !1355, !1309, !943}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1658, file: !14, line: 3712, baseType: !1671, size: 64, align: 64, offset: 320)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DISubroutineType(types: !1673)
!1673 = !{!936, !1355, !936, !1309, !943}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1658, file: !14, line: 3726, baseType: !1667, size: 64, align: 64, offset: 384)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1658, file: !14, line: 3737, baseType: !1402, size: 64, align: 64, offset: 448)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1658, file: !14, line: 3746, baseType: !936, size: 32, align: 32, offset: 512)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1658, file: !14, line: 3757, baseType: !1678, size: 64, align: 64, offset: 576)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DISubroutineType(types: !1680)
!1680 = !{null, !1681}
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1658, file: !14, line: 3766, baseType: !1402, size: 64, align: 64, offset: 640)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1658, file: !14, line: 3774, baseType: !1402, size: 64, align: 64, offset: 704)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1658, file: !14, line: 3780, baseType: !936, size: 32, align: 32, offset: 768)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1658, file: !14, line: 3785, baseType: !936, size: 32, align: 32, offset: 800)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1658, file: !14, line: 3795, baseType: !1688, size: 64, align: 64, offset: 832)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!936, !1355, !1068}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1357, file: !14, line: 2728, baseType: !990, size: 64, align: 64, offset: 5440)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1357, file: !14, line: 2735, baseType: !1206, size: 512, align: 64, offset: 5504)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1357, file: !14, line: 2742, baseType: !936, size: 32, align: 32, offset: 6016)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1357, file: !14, line: 2755, baseType: !936, size: 32, align: 32, offset: 6048)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1357, file: !14, line: 2776, baseType: !936, size: 32, align: 32, offset: 6080)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1357, file: !14, line: 2783, baseType: !936, size: 32, align: 32, offset: 6112)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1357, file: !14, line: 2791, baseType: !936, size: 32, align: 32, offset: 6144)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1357, file: !14, line: 2802, baseType: !1173, size: 64, align: 64, offset: 6208)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1357, file: !14, line: 2811, baseType: !936, size: 32, align: 32, offset: 6272)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1357, file: !14, line: 2821, baseType: !936, size: 32, align: 32, offset: 6304)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1357, file: !14, line: 2830, baseType: !936, size: 32, align: 32, offset: 6336)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1357, file: !14, line: 2840, baseType: !936, size: 32, align: 32, offset: 6368)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1357, file: !14, line: 2851, baseType: !1704, size: 64, align: 64, offset: 6400)
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1705, size: 64, align: 64)
!1705 = !DISubroutineType(types: !1706)
!1706 = !{!936, !1525, !1707, !990, !1468, !936, !936}
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64, align: 64)
!1708 = !DISubroutineType(types: !1709)
!1709 = !{!936, !1525, !990}
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1357, file: !14, line: 2871, baseType: !1711, size: 64, align: 64, offset: 6464)
!1711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1712, size: 64, align: 64)
!1712 = !DISubroutineType(types: !1713)
!1713 = !{!936, !1525, !1714, !990, !1468, !936}
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1715, size: 64, align: 64)
!1715 = !DISubroutineType(types: !1716)
!1716 = !{!936, !1525, !990, !936, !936}
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1357, file: !14, line: 2878, baseType: !936, size: 32, align: 32, offset: 6528)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1357, file: !14, line: 2885, baseType: !936, size: 32, align: 32, offset: 6560)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1357, file: !14, line: 3005, baseType: !936, size: 32, align: 32, offset: 6592)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1357, file: !14, line: 3013, baseType: !896, size: 32, align: 32, offset: 6624)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1357, file: !14, line: 3020, baseType: !896, size: 32, align: 32, offset: 6656)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1357, file: !14, line: 3027, baseType: !896, size: 32, align: 32, offset: 6688)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1357, file: !14, line: 3037, baseType: !1078, size: 64, align: 64, offset: 6720)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1357, file: !14, line: 3038, baseType: !936, size: 32, align: 32, offset: 6784)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1357, file: !14, line: 3050, baseType: !1207, size: 64, align: 64, offset: 6848)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1357, file: !14, line: 3065, baseType: !936, size: 32, align: 32, offset: 6912)
