; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--riffenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--riffenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecGuid = type { i32, [16 x i8] }
%struct.AVMetadataConv = type { i8*, i8* }
%struct.AVIOContext = type { %struct.AVClass*, i8*, i32, i8*, i8*, i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i64, i32, i32, i32, i64, i8*, i64 (i64, i8*, i32)*, i32, i32 (i8*, i32)*, i64 (i8*, i32, i64, i32)*, i32, i64, i32, i64, i32, i32, i32, i32, i8*, i8*, i32 (i8*, i8*, i32, i32, i64)*, i32, i32, i64, i32 (i8*)*, i64, i8*, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !34, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !918, !920, !921, !928}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !919, line: 51, baseType: !920)
!919 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!920 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!922 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !923, line: 222, size: 16, align: 8, elements: !924)
!923 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!924 = !{!925}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !922, file: !923, line: 222, baseType: !926, size: 16, align: 16)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !919, line: 49, baseType: !927)
!927 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !923, line: 221, size: 32, align: 8, elements: !930)
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !929, file: !923, line: 221, baseType: !918, size: 32, align: 32)
!932 = !{!933}
!933 = distinct !DIGlobalVariable(name: "riff_tags", scope: !0, file: !934, line: 308, type: !935, isLocal: true, isDefinition: true, variable: [37 x [5 x i8]]* @riff_tags)
!934 = !DIFile(filename: "libavformat/riffenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 1480, align: 8, elements: !938)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!938 = !{!939, !940}
!939 = !DISubrange(count: 37)
!940 = !DISubrange(count: 5)
!941 = !{i32 2, !"Dwarf Version", i32 4}
!942 = !{i32 2, !"Debug Info Version", i32 3}
!943 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!944 = distinct !DISubprogram(name: "ff_start_tag", scope: !934, file: !934, line: 31, type: !945, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1060)
!945 = !DISubroutineType(types: !946)
!946 = !{!947, !949, !960}
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !919, line: 40, baseType: !948)
!948 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !25, line: 352, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !25, line: 161, size: 2112, align: 64, elements: !952)
!952 = !{!953, !996, !999, !1000, !1001, !1002, !1003, !1009, !1010, !1014, !1015, !1016, !1017, !1018, !1020, !1021, !1027, !1028, !1032, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1050, !1051, !1052, !1053, !1057, !1058, !1059}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !951, file: !25, line: 174, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !958)
!958 = !{!959, !961, !965, !969, !971, !972, !973, !977, !983, !985, !989}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !957, file: !4, line: 72, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !957, file: !4, line: 78, baseType: !962, size: 64, align: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!960, !917}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !957, file: !4, line: 85, baseType: !966, size: 64, align: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !957, file: !4, line: 93, baseType: !970, size: 32, align: 32, offset: 192)
!970 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !957, file: !4, line: 99, baseType: !970, size: 32, align: 32, offset: 224)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !957, file: !4, line: 108, baseType: !970, size: 32, align: 32, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !957, file: !4, line: 113, baseType: !974, size: 64, align: 64, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!917, !917, !917}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !957, file: !4, line: 123, baseType: !978, size: 64, align: 64, offset: 384)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!981, !981}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !957, file: !4, line: 130, baseType: !984, size: 32, align: 32, offset: 448)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !957, file: !4, line: 136, baseType: !986, size: 64, align: 64, offset: 512)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!984, !917}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !957, file: !4, line: 142, baseType: !990, size: 64, align: 64, offset: 576)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!970, !993, !917, !960, !970}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !951, file: !25, line: 226, baseType: !997, size: 64, align: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !951, file: !25, line: 227, baseType: !970, size: 32, align: 32, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !951, file: !25, line: 228, baseType: !997, size: 64, align: 64, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !951, file: !25, line: 229, baseType: !997, size: 64, align: 64, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !951, file: !25, line: 233, baseType: !917, size: 64, align: 64, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !951, file: !25, line: 235, baseType: !1004, size: 64, align: 64, offset: 384)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!970, !917, !1007, !970}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !919, line: 48, baseType: !998)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !951, file: !25, line: 236, baseType: !1004, size: 64, align: 64, offset: 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !951, file: !25, line: 237, baseType: !1011, size: 64, align: 64, offset: 512)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!947, !917, !947, !970}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !951, file: !25, line: 238, baseType: !947, size: 64, align: 64, offset: 576)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !951, file: !25, line: 239, baseType: !970, size: 32, align: 32, offset: 640)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !951, file: !25, line: 240, baseType: !970, size: 32, align: 32, offset: 672)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !951, file: !25, line: 241, baseType: !970, size: 32, align: 32, offset: 704)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !951, file: !25, line: 242, baseType: !1019, size: 64, align: 64, offset: 768)
!1019 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !951, file: !25, line: 243, baseType: !997, size: 64, align: 64, offset: 832)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !951, file: !25, line: 244, baseType: !1022, size: 64, align: 64, offset: 896)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1019, !1019, !1025, !920}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !951, file: !25, line: 245, baseType: !970, size: 32, align: 32, offset: 960)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !951, file: !25, line: 249, baseType: !1029, size: 64, align: 64, offset: 1024)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!970, !917, !970}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !951, file: !25, line: 255, baseType: !1033, size: 64, align: 64, offset: 1088)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!947, !917, !970, !947, !970}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !951, file: !25, line: 260, baseType: !970, size: 32, align: 32, offset: 1152)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !951, file: !25, line: 266, baseType: !947, size: 64, align: 64, offset: 1216)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !951, file: !25, line: 273, baseType: !970, size: 32, align: 32, offset: 1280)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !951, file: !25, line: 279, baseType: !947, size: 64, align: 64, offset: 1344)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !951, file: !25, line: 285, baseType: !970, size: 32, align: 32, offset: 1408)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !951, file: !25, line: 291, baseType: !970, size: 32, align: 32, offset: 1440)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !951, file: !25, line: 298, baseType: !970, size: 32, align: 32, offset: 1472)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !951, file: !25, line: 304, baseType: !970, size: 32, align: 32, offset: 1504)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !951, file: !25, line: 309, baseType: !960, size: 64, align: 64, offset: 1536)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !951, file: !25, line: 314, baseType: !960, size: 64, align: 64, offset: 1600)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !951, file: !25, line: 319, baseType: !1047, size: 64, align: 64, offset: 1664)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!970, !917, !1007, !970, !24, !947}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !951, file: !25, line: 326, baseType: !970, size: 32, align: 32, offset: 1728)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !951, file: !25, line: 331, baseType: !24, size: 32, align: 32, offset: 1760)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !951, file: !25, line: 332, baseType: !947, size: 64, align: 64, offset: 1792)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !951, file: !25, line: 338, baseType: !1054, size: 64, align: 64, offset: 1856)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!970, !917}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !951, file: !25, line: 340, baseType: !947, size: 64, align: 64, offset: 1920)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !951, file: !25, line: 346, baseType: !997, size: 64, align: 64, offset: 1984)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !951, file: !25, line: 351, baseType: !970, size: 32, align: 32, offset: 2048)
!1060 = !{}
!1061 = !DILocalVariable(name: "s", arg: 1, scope: !1062, file: !25, line: 557, type: !949)
!1062 = distinct !DISubprogram(name: "avio_tell", scope: !25, file: !25, line: 557, type: !1063, isLocal: true, isDefinition: true, scopeLine: 558, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1060)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!947, !949}
!1065 = !DIExpression()
!1066 = !DILocation(line: 557, column: 77, scope: !1062, inlinedAt: !1067)
!1067 = distinct !DILocation(line: 35, column: 12, scope: !944)
!1068 = !DILocalVariable(name: "pb", arg: 1, scope: !1069, file: !1070, line: 58, type: !949)
!1069 = distinct !DISubprogram(name: "ffio_wfourcc", scope: !1070, file: !1070, line: 58, type: !1071, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1060)
!1070 = !DIFile(filename: "libavformat/avio_internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1071 = !DISubroutineType(types: !1072)
!1072 = !{null, !949, !1025}
!1073 = !DILocation(line: 58, column: 77, scope: !1069, inlinedAt: !1074)
!1074 = distinct !DILocation(line: 33, column: 5, scope: !944)
!1075 = !DILocalVariable(name: "s", arg: 2, scope: !1069, file: !1070, line: 58, type: !1025)
!1076 = !DILocation(line: 58, column: 96, scope: !1069, inlinedAt: !1074)
!1077 = !DILocalVariable(name: "pb", arg: 1, scope: !944, file: !934, line: 31, type: !949)
!1078 = !DILocation(line: 31, column: 35, scope: !944)
!1079 = !DILocalVariable(name: "tag", arg: 2, scope: !944, file: !934, line: 31, type: !960)
!1080 = !DILocation(line: 31, column: 51, scope: !944)
!1081 = !DILocation(line: 33, column: 18, scope: !944)
!1082 = !DILocation(line: 33, column: 22, scope: !944)
!1083 = !DILocation(line: 33, column: 5, scope: !944)
!1084 = !DILocation(line: 60, column: 15, scope: !1069, inlinedAt: !1074)
!1085 = !DILocation(line: 60, column: 21, scope: !1069, inlinedAt: !1074)
!1086 = !DILocation(line: 60, column: 20, scope: !1069, inlinedAt: !1074)
!1087 = !DILocation(line: 60, column: 31, scope: !1069, inlinedAt: !1074)
!1088 = !DILocation(line: 60, column: 30, scope: !1069, inlinedAt: !1074)
!1089 = !DILocation(line: 60, column: 37, scope: !1069, inlinedAt: !1074)
!1090 = !DILocation(line: 60, column: 27, scope: !1069, inlinedAt: !1074)
!1091 = !DILocation(line: 60, column: 47, scope: !1069, inlinedAt: !1074)
!1092 = !DILocation(line: 60, column: 46, scope: !1069, inlinedAt: !1074)
!1093 = !DILocation(line: 60, column: 53, scope: !1069, inlinedAt: !1074)
!1094 = !DILocation(line: 60, column: 43, scope: !1069, inlinedAt: !1074)
!1095 = !DILocation(line: 60, column: 74, scope: !1069, inlinedAt: !1074)
!1096 = !DILocation(line: 60, column: 63, scope: !1069, inlinedAt: !1074)
!1097 = !DILocation(line: 60, column: 80, scope: !1069, inlinedAt: !1074)
!1098 = !DILocation(line: 60, column: 60, scope: !1069, inlinedAt: !1074)
!1099 = !DILocation(line: 60, column: 5, scope: !1069, inlinedAt: !1074)
!1100 = !DILocation(line: 34, column: 15, scope: !944)
!1101 = !DILocation(line: 34, column: 5, scope: !944)
!1102 = !DILocation(line: 35, column: 22, scope: !944)
!1103 = !DILocation(line: 35, column: 12, scope: !944)
!1104 = !DILocation(line: 559, column: 22, scope: !1062, inlinedAt: !1067)
!1105 = !DILocation(line: 559, column: 12, scope: !1062, inlinedAt: !1067)
!1106 = !DILocation(line: 35, column: 5, scope: !944)
!1107 = distinct !DISubprogram(name: "ff_end_tag", scope: !934, file: !934, line: 38, type: !1108, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1060)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{null, !949, !947}
!1110 = !DILocation(line: 557, column: 77, scope: !1062, inlinedAt: !1111)
!1111 = distinct !DILocation(line: 44, column: 11, scope: !1107)
!1112 = !DILocalVariable(name: "pb", arg: 1, scope: !1107, file: !934, line: 38, type: !949)
!1113 = !DILocation(line: 38, column: 30, scope: !1107)
!1114 = !DILocalVariable(name: "start", arg: 2, scope: !1107, file: !934, line: 38, type: !947)
!1115 = !DILocation(line: 38, column: 42, scope: !1107)
!1116 = !DILocalVariable(name: "pos", scope: !1107, file: !934, line: 40, type: !947)
!1117 = !DILocation(line: 40, column: 13, scope: !1107)
!1118 = !DILocation(line: 42, column: 5, scope: !1107)
!1119 = distinct !{!1119, !1118}
!1120 = !DILocation(line: 42, column: 17, scope: !1121)
!1121 = !DILexicalBlockFile(scope: !1122, file: !934, discriminator: 1)
!1122 = distinct !DILexicalBlock(scope: !1123, file: !934, line: 42, column: 14)
!1123 = distinct !DILexicalBlock(scope: !1107, file: !934, line: 42, column: 8)
!1124 = !DILocation(line: 42, column: 22, scope: !1121)
!1125 = !DILocation(line: 42, column: 26, scope: !1121)
!1126 = !DILocation(line: 42, column: 14, scope: !1121)
!1127 = !DILocation(line: 42, column: 35, scope: !1128)
!1128 = !DILexicalBlockFile(scope: !1129, file: !934, discriminator: 2)
!1129 = distinct !DILexicalBlock(scope: !1122, file: !934, line: 42, column: 33)
!1130 = !DILocation(line: 42, column: 91, scope: !1131)
!1131 = !DILexicalBlockFile(scope: !1128, file: !934, discriminator: 4)
!1132 = !DILocation(line: 42, column: 91, scope: !1128)
!1133 = !DILocation(line: 42, column: 102, scope: !1134)
!1134 = !DILexicalBlockFile(scope: !1123, file: !934, discriminator: 3)
!1135 = !DILocation(line: 44, column: 21, scope: !1107)
!1136 = !DILocation(line: 44, column: 11, scope: !1107)
!1137 = !DILocation(line: 559, column: 22, scope: !1062, inlinedAt: !1111)
!1138 = !DILocation(line: 559, column: 12, scope: !1062, inlinedAt: !1111)
!1139 = !DILocation(line: 44, column: 9, scope: !1107)
!1140 = !DILocation(line: 45, column: 9, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1107, file: !934, line: 45, column: 9)
!1142 = !DILocation(line: 45, column: 13, scope: !1141)
!1143 = !DILocation(line: 45, column: 9, scope: !1107)
!1144 = !DILocation(line: 46, column: 17, scope: !1141)
!1145 = !DILocation(line: 46, column: 9, scope: !1141)
!1146 = !DILocation(line: 47, column: 15, scope: !1107)
!1147 = !DILocation(line: 47, column: 19, scope: !1107)
!1148 = !DILocation(line: 47, column: 25, scope: !1107)
!1149 = !DILocation(line: 47, column: 5, scope: !1107)
!1150 = !DILocation(line: 48, column: 15, scope: !1107)
!1151 = !DILocation(line: 48, column: 30, scope: !1107)
!1152 = !DILocation(line: 48, column: 36, scope: !1107)
!1153 = !DILocation(line: 48, column: 34, scope: !1107)
!1154 = !DILocation(line: 48, column: 19, scope: !1107)
!1155 = !DILocation(line: 48, column: 5, scope: !1107)
!1156 = !DILocation(line: 49, column: 15, scope: !1107)
!1157 = !DILocation(line: 49, column: 22, scope: !1107)
!1158 = !DILocation(line: 49, column: 26, scope: !1107)
!1159 = !DILocation(line: 49, column: 30, scope: !1107)
!1160 = !DILocation(line: 49, column: 33, scope: !1107)
!1161 = !DILocation(line: 49, column: 5, scope: !1107)
!1162 = !DILocation(line: 50, column: 1, scope: !1107)
!1163 = distinct !DISubprogram(name: "ff_put_wav_header", scope: !934, file: !934, line: 54, type: !1164, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1060)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!970, !1166, !949, !1872, !970}
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1169)
!1169 = !{!1170, !1171, !1278, !1425, !1426, !1427, !1428, !1429, !2119, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2173, !2174, !2175, !2176, !2177, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2228, !2229, !2232, !2233, !2234, !2235, !2236, !2237, !2239, !2240, !2241, !2242, !2250, !2251, !2255, !2259, !2260, !2261}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1168, file: !897, line: 1342, baseType: !954, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1168, file: !897, line: 1349, baseType: !1172, size: 64, align: 64, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1174)
!1174 = !{!1175, !1176, !1177, !1178, !1179, !1189, !1190, !1191, !1192, !1193, !1194, !1206, !1211, !1249, !1250, !1254, !1259, !1260, !1261, !1265, !1271, !1277}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1173, file: !897, line: 638, baseType: !960, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1173, file: !897, line: 645, baseType: !960, size: 64, align: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1173, file: !897, line: 652, baseType: !970, size: 32, align: 32, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1173, file: !897, line: 659, baseType: !960, size: 64, align: 64, offset: 192)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1173, file: !897, line: 661, baseType: !1180, size: 64, align: 64, offset: 256)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1182)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1185, line: 44, size: 64, align: 32, elements: !1186)
!1185 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1186 = !{!1187, !1188}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1184, file: !1185, line: 45, baseType: !33, size: 32, align: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1184, file: !1185, line: 46, baseType: !920, size: 32, align: 32, offset: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1173, file: !897, line: 663, baseType: !954, size: 64, align: 64, offset: 320)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1173, file: !897, line: 670, baseType: !960, size: 64, align: 64, offset: 384)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1173, file: !897, line: 679, baseType: !1172, size: 64, align: 64, offset: 448)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1173, file: !897, line: 684, baseType: !970, size: 32, align: 32, offset: 512)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1173, file: !897, line: 689, baseType: !970, size: 32, align: 32, offset: 544)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1173, file: !897, line: 696, baseType: !1195, size: 64, align: 64, offset: 576)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!970, !1198}
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1200)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1201)
!1201 = !{!1202, !1203, !1204, !1205}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1200, file: !897, line: 449, baseType: !960, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1200, file: !897, line: 450, baseType: !997, size: 64, align: 64, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1200, file: !897, line: 451, baseType: !970, size: 32, align: 32, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1200, file: !897, line: 452, baseType: !960, size: 64, align: 64, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1173, file: !897, line: 703, baseType: !1207, size: 64, align: 64, offset: 640)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!970, !1210}
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1173, file: !897, line: 714, baseType: !1212, size: 64, align: 64, offset: 704)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!970, !1210, !1215}
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !34, line: 1499, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !34, line: 1445, size: 704, align: 64, elements: !1218)
!1218 = !{!1219, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1245, !1246, !1247, !1248}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1217, file: !34, line: 1451, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1222, line: 94, baseType: !1223)
!1222 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1222, line: 81, size: 192, align: 64, elements: !1224)
!1224 = !{!1225, !1229, !1230}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1223, file: !1222, line: 82, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1222, line: 73, baseType: !1228)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1222, line: 73, flags: DIFlagFwdDecl)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1223, file: !1222, line: 89, baseType: !1007, size: 64, align: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1223, file: !1222, line: 93, baseType: !970, size: 32, align: 32, offset: 128)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1217, file: !34, line: 1461, baseType: !947, size: 64, align: 64, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1217, file: !34, line: 1467, baseType: !947, size: 64, align: 64, offset: 128)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1217, file: !34, line: 1468, baseType: !1007, size: 64, align: 64, offset: 192)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1217, file: !34, line: 1469, baseType: !970, size: 32, align: 32, offset: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1217, file: !34, line: 1470, baseType: !970, size: 32, align: 32, offset: 288)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1217, file: !34, line: 1474, baseType: !970, size: 32, align: 32, offset: 320)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1217, file: !34, line: 1479, baseType: !1238, size: 64, align: 64, offset: 384)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !34, line: 1415, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !34, line: 1411, size: 128, align: 64, elements: !1241)
!1241 = !{!1242, !1243, !1244}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1240, file: !34, line: 1412, baseType: !1007, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1240, file: !34, line: 1413, baseType: !970, size: 32, align: 32, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1240, file: !34, line: 1414, baseType: !493, size: 32, align: 32, offset: 96)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1217, file: !34, line: 1480, baseType: !970, size: 32, align: 32, offset: 448)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1217, file: !34, line: 1486, baseType: !947, size: 64, align: 64, offset: 512)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1217, file: !34, line: 1488, baseType: !947, size: 64, align: 64, offset: 576)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1217, file: !34, line: 1497, baseType: !947, size: 64, align: 64, offset: 640)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1173, file: !897, line: 720, baseType: !1207, size: 64, align: 64, offset: 768)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1173, file: !897, line: 730, baseType: !1251, size: 64, align: 64, offset: 832)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!970, !1210, !970, !947, !970}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1173, file: !897, line: 737, baseType: !1255, size: 64, align: 64, offset: 896)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!947, !1210, !970, !1258, !947}
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1173, file: !897, line: 744, baseType: !1207, size: 64, align: 64, offset: 960)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1173, file: !897, line: 750, baseType: !1207, size: 64, align: 64, offset: 1024)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1173, file: !897, line: 758, baseType: !1262, size: 64, align: 64, offset: 1088)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!970, !1210, !970, !947, !947, !947, !970}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1173, file: !897, line: 764, baseType: !1266, size: 64, align: 64, offset: 1152)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!970, !1210, !1269}
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1173, file: !897, line: 770, baseType: !1272, size: 64, align: 64, offset: 1216)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!970, !1210, !1275}
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1173, file: !897, line: 776, baseType: !1272, size: 64, align: 64, offset: 1280)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1168, file: !897, line: 1356, baseType: !1279, size: 64, align: 64, offset: 128)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1281)
!1281 = !{!1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1301, !1305, !1309, !1315, !1410, !1411, !1412, !1413, !1414, !1415, !1419}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1280, file: !897, line: 498, baseType: !960, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1280, file: !897, line: 504, baseType: !960, size: 64, align: 64, offset: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1280, file: !897, line: 505, baseType: !960, size: 64, align: 64, offset: 128)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1280, file: !897, line: 506, baseType: !960, size: 64, align: 64, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1280, file: !897, line: 508, baseType: !33, size: 32, align: 32, offset: 256)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1280, file: !897, line: 509, baseType: !33, size: 32, align: 32, offset: 288)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1280, file: !897, line: 510, baseType: !33, size: 32, align: 32, offset: 320)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1280, file: !897, line: 517, baseType: !970, size: 32, align: 32, offset: 352)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1280, file: !897, line: 523, baseType: !1180, size: 64, align: 64, offset: 384)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1280, file: !897, line: 526, baseType: !954, size: 64, align: 64, offset: 448)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1280, file: !897, line: 535, baseType: !1279, size: 64, align: 64, offset: 512)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1280, file: !897, line: 539, baseType: !970, size: 32, align: 32, offset: 576)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1280, file: !897, line: 541, baseType: !1207, size: 64, align: 64, offset: 640)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1280, file: !897, line: 549, baseType: !1212, size: 64, align: 64, offset: 704)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1280, file: !897, line: 550, baseType: !1207, size: 64, align: 64, offset: 768)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1280, file: !897, line: 554, baseType: !1298, size: 64, align: 64, offset: 832)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!970, !1210, !1215, !1215, !970}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1280, file: !897, line: 563, baseType: !1302, size: 64, align: 64, offset: 896)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!970, !33, !970}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1280, file: !897, line: 565, baseType: !1306, size: 64, align: 64, offset: 960)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{null, !1210, !970, !1258, !1258}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1280, file: !897, line: 570, baseType: !1310, size: 64, align: 64, offset: 1024)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DISubroutineType(types: !1312)
!1312 = !{!970, !1210, !970, !917, !1313}
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1314, line: 216, baseType: !1019)
!1314 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1280, file: !897, line: 581, baseType: !1316, size: 64, align: 64, offset: 1088)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{!970, !1210, !970, !1319, !920}
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !535, line: 646, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !535, line: 268, size: 4288, align: 64, elements: !1323)
!1323 = !{!1324, !1328, !1330, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1364, !1366, !1367, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1322, file: !535, line: 282, baseType: !1325, size: 512, align: 64)
!1325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1007, size: 512, align: 64, elements: !1326)
!1326 = !{!1327}
!1327 = !DISubrange(count: 8)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1322, file: !535, line: 299, baseType: !1329, size: 256, align: 32, offset: 512)
!1329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !970, size: 256, align: 32, elements: !1326)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1322, file: !535, line: 315, baseType: !1331, size: 64, align: 64, offset: 768)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1322, file: !535, line: 326, baseType: !970, size: 32, align: 32, offset: 832)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1322, file: !535, line: 326, baseType: !970, size: 32, align: 32, offset: 864)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1322, file: !535, line: 334, baseType: !970, size: 32, align: 32, offset: 896)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1322, file: !535, line: 341, baseType: !970, size: 32, align: 32, offset: 928)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1322, file: !535, line: 346, baseType: !970, size: 32, align: 32, offset: 960)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1322, file: !535, line: 351, baseType: !523, size: 32, align: 32, offset: 992)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1322, file: !535, line: 356, baseType: !1339, size: 64, align: 32, offset: 1024)
!1339 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1340, line: 61, baseType: !1341)
!1340 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1340, line: 58, size: 64, align: 32, elements: !1342)
!1342 = !{!1343, !1344}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1341, file: !1340, line: 59, baseType: !970, size: 32, align: 32)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1341, file: !1340, line: 60, baseType: !970, size: 32, align: 32, offset: 32)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1322, file: !535, line: 361, baseType: !947, size: 64, align: 64, offset: 1088)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1322, file: !535, line: 369, baseType: !947, size: 64, align: 64, offset: 1152)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1322, file: !535, line: 377, baseType: !947, size: 64, align: 64, offset: 1216)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1322, file: !535, line: 382, baseType: !970, size: 32, align: 32, offset: 1280)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1322, file: !535, line: 386, baseType: !970, size: 32, align: 32, offset: 1312)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1322, file: !535, line: 391, baseType: !970, size: 32, align: 32, offset: 1344)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1322, file: !535, line: 396, baseType: !917, size: 64, align: 64, offset: 1408)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1322, file: !535, line: 403, baseType: !1353, size: 512, align: 64, offset: 1472)
!1353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1354, size: 512, align: 64, elements: !1326)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !919, line: 55, baseType: !1019)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1322, file: !535, line: 410, baseType: !970, size: 32, align: 32, offset: 1984)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1322, file: !535, line: 415, baseType: !970, size: 32, align: 32, offset: 2016)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1322, file: !535, line: 420, baseType: !970, size: 32, align: 32, offset: 2048)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1322, file: !535, line: 425, baseType: !970, size: 32, align: 32, offset: 2080)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1322, file: !535, line: 435, baseType: !947, size: 64, align: 64, offset: 2112)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1322, file: !535, line: 440, baseType: !970, size: 32, align: 32, offset: 2176)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1322, file: !535, line: 445, baseType: !1354, size: 64, align: 64, offset: 2240)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1322, file: !535, line: 459, baseType: !1363, size: 512, align: 64, offset: 2304)
!1363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1220, size: 512, align: 64, elements: !1326)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1322, file: !535, line: 473, baseType: !1365, size: 64, align: 64, offset: 2816)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1322, file: !535, line: 477, baseType: !970, size: 32, align: 32, offset: 2880)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1322, file: !535, line: 479, baseType: !1368, size: 64, align: 64, offset: 2944)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !535, line: 207, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !535, line: 201, size: 320, align: 64, elements: !1372)
!1372 = !{!1373, !1374, !1375, !1376, !1381}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1371, file: !535, line: 202, baseType: !534, size: 32, align: 32)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1371, file: !535, line: 203, baseType: !1007, size: 64, align: 64, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1371, file: !535, line: 204, baseType: !970, size: 32, align: 32, offset: 128)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1371, file: !535, line: 205, baseType: !1377, size: 64, align: 64, offset: 192)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1379, line: 86, baseType: !1380)
!1379 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1380 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1379, line: 86, flags: DIFlagFwdDecl)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1371, file: !535, line: 206, baseType: !1220, size: 64, align: 64, offset: 256)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1322, file: !535, line: 480, baseType: !970, size: 32, align: 32, offset: 3008)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1322, file: !535, line: 505, baseType: !970, size: 32, align: 32, offset: 3040)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1322, file: !535, line: 512, baseType: !558, size: 32, align: 32, offset: 3072)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1322, file: !535, line: 514, baseType: !565, size: 32, align: 32, offset: 3104)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1322, file: !535, line: 516, baseType: !583, size: 32, align: 32, offset: 3136)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1322, file: !535, line: 523, baseType: !607, size: 32, align: 32, offset: 3168)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1322, file: !535, line: 525, baseType: !626, size: 32, align: 32, offset: 3200)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1322, file: !535, line: 532, baseType: !947, size: 64, align: 64, offset: 3264)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1322, file: !535, line: 539, baseType: !947, size: 64, align: 64, offset: 3328)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1322, file: !535, line: 547, baseType: !947, size: 64, align: 64, offset: 3392)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1322, file: !535, line: 554, baseType: !1377, size: 64, align: 64, offset: 3456)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1322, file: !535, line: 563, baseType: !970, size: 32, align: 32, offset: 3520)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1322, file: !535, line: 572, baseType: !970, size: 32, align: 32, offset: 3552)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1322, file: !535, line: 581, baseType: !970, size: 32, align: 32, offset: 3584)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1322, file: !535, line: 588, baseType: !1397, size: 64, align: 64, offset: 3648)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !919, line: 36, baseType: !1399)
!1399 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1322, file: !535, line: 593, baseType: !970, size: 32, align: 32, offset: 3712)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1322, file: !535, line: 596, baseType: !970, size: 32, align: 32, offset: 3744)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1322, file: !535, line: 599, baseType: !1220, size: 64, align: 64, offset: 3776)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1322, file: !535, line: 605, baseType: !1220, size: 64, align: 64, offset: 3840)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1322, file: !535, line: 616, baseType: !1220, size: 64, align: 64, offset: 3904)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1322, file: !535, line: 626, baseType: !1313, size: 64, align: 64, offset: 3968)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1322, file: !535, line: 627, baseType: !1313, size: 64, align: 64, offset: 4032)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1322, file: !535, line: 628, baseType: !1313, size: 64, align: 64, offset: 4096)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1322, file: !535, line: 629, baseType: !1313, size: 64, align: 64, offset: 4160)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1322, file: !535, line: 645, baseType: !1220, size: 64, align: 64, offset: 4224)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1280, file: !897, line: 587, baseType: !1266, size: 64, align: 64, offset: 1152)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1280, file: !897, line: 592, baseType: !1272, size: 64, align: 64, offset: 1216)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1280, file: !897, line: 597, baseType: !1272, size: 64, align: 64, offset: 1280)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1280, file: !897, line: 598, baseType: !33, size: 32, align: 32, offset: 1344)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1280, file: !897, line: 608, baseType: !1207, size: 64, align: 64, offset: 1408)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1280, file: !897, line: 617, baseType: !1416, size: 64, align: 64, offset: 1472)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{null, !1210}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1280, file: !897, line: 623, baseType: !1420, size: 64, align: 64, offset: 1536)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DISubroutineType(types: !1422)
!1422 = !{!970, !1210, !1423}
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1216)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1168, file: !897, line: 1365, baseType: !917, size: 64, align: 64, offset: 192)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1168, file: !897, line: 1379, baseType: !949, size: 64, align: 64, offset: 256)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1168, file: !897, line: 1386, baseType: !970, size: 32, align: 32, offset: 320)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1168, file: !897, line: 1393, baseType: !920, size: 32, align: 32, offset: 352)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1168, file: !897, line: 1405, baseType: !1430, size: 64, align: 64, offset: 384)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1433)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1434)
!1434 = !{!1435, !1436, !1437, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1905, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !2005, !2011, !2012, !2016, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2048, !2049, !2050, !2051, !2052, !2053}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1433, file: !897, line: 866, baseType: !970, size: 32, align: 32)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1433, file: !897, line: 872, baseType: !970, size: 32, align: 32, offset: 32)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1433, file: !897, line: 878, baseType: !1438, size: 64, align: 64, offset: 64)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !34, line: 3360, baseType: !1440)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !34, line: 1556, size: 8448, align: 64, elements: !1441)
!1441 = !{!1442, !1443, !1444, !1445, !1580, !1581, !1582, !1583, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1609, !1613, !1614, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1793, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1440, file: !34, line: 1561, baseType: !954, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1440, file: !34, line: 1562, baseType: !970, size: 32, align: 32, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1440, file: !34, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1440, file: !34, line: 1565, baseType: !1446, size: 64, align: 64, offset: 128)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1448)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !34, line: 3468, size: 1984, align: 64, elements: !1449)
!1449 = !{!1450, !1451, !1452, !1453, !1454, !1455, !1458, !1461, !1464, !1467, !1470, !1471, !1472, !1480, !1481, !1482, !1484, !1488, !1494, !1499, !1503, !1504, !1545, !1552, !1556, !1557, !1561, !1565, !1569, !1573, !1574, !1575}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1448, file: !34, line: 3475, baseType: !960, size: 64, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1448, file: !34, line: 3480, baseType: !960, size: 64, align: 64, offset: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1448, file: !34, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1448, file: !34, line: 3482, baseType: !33, size: 32, align: 32, offset: 160)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1448, file: !34, line: 3487, baseType: !970, size: 32, align: 32, offset: 192)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1448, file: !34, line: 3488, baseType: !1456, size: 64, align: 64, offset: 256)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1339)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1448, file: !34, line: 3489, baseType: !1459, size: 64, align: 64, offset: 320)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1448, file: !34, line: 3490, baseType: !1462, size: 64, align: 64, offset: 384)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1448, file: !34, line: 3491, baseType: !1465, size: 64, align: 64, offset: 448)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1448, file: !34, line: 3492, baseType: !1468, size: 64, align: 64, offset: 512)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1354)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1448, file: !34, line: 3493, baseType: !1008, size: 8, align: 8, offset: 576)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1448, file: !34, line: 3494, baseType: !954, size: 64, align: 64, offset: 640)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1448, file: !34, line: 3495, baseType: !1473, size: 64, align: 64, offset: 704)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1475)
!1475 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !34, line: 3404, baseType: !1476)
!1476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !34, line: 3401, size: 128, align: 64, elements: !1477)
!1477 = !{!1478, !1479}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1476, file: !34, line: 3402, baseType: !970, size: 32, align: 32)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1476, file: !34, line: 3403, baseType: !960, size: 64, align: 64, offset: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1448, file: !34, line: 3507, baseType: !960, size: 64, align: 64, offset: 768)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1448, file: !34, line: 3516, baseType: !970, size: 32, align: 32, offset: 832)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1448, file: !34, line: 3517, baseType: !1483, size: 64, align: 64, offset: 896)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1448, file: !34, line: 3527, baseType: !1485, size: 64, align: 64, offset: 960)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{!970, !1438}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1448, file: !34, line: 3535, baseType: !1489, size: 64, align: 64, offset: 1024)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{!970, !1438, !1492}
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1439)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1448, file: !34, line: 3541, baseType: !1495, size: 64, align: 64, offset: 1088)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1497)
!1497 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !34, line: 3461, baseType: !1498)
!1498 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !34, line: 3461, flags: DIFlagFwdDecl)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1448, file: !34, line: 3549, baseType: !1500, size: 64, align: 64, offset: 1152)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{null, !1483}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1448, file: !34, line: 3551, baseType: !1485, size: 64, align: 64, offset: 1216)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1448, file: !34, line: 3552, baseType: !1505, size: 64, align: 64, offset: 1280)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DISubroutineType(types: !1507)
!1507 = !{!970, !1438, !1007, !970, !1508}
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1510)
!1510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !34, line: 3920, size: 256, align: 64, elements: !1511)
!1511 = !{!1512, !1513, !1514, !1515, !1516, !1544}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1510, file: !34, line: 3921, baseType: !926, size: 16, align: 16)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1510, file: !34, line: 3922, baseType: !918, size: 32, align: 32, offset: 32)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1510, file: !34, line: 3923, baseType: !918, size: 32, align: 32, offset: 64)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1510, file: !34, line: 3924, baseType: !920, size: 32, align: 32, offset: 96)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1510, file: !34, line: 3925, baseType: !1517, size: 64, align: 64, offset: 128)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !34, line: 3918, baseType: !1520)
!1520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !34, line: 3885, size: 1600, align: 64, elements: !1521)
!1521 = !{!1522, !1523, !1524, !1525, !1526, !1527, !1533, !1537, !1539, !1540, !1542, !1543}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1520, file: !34, line: 3886, baseType: !970, size: 32, align: 32)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1520, file: !34, line: 3887, baseType: !970, size: 32, align: 32, offset: 32)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1520, file: !34, line: 3888, baseType: !970, size: 32, align: 32, offset: 64)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1520, file: !34, line: 3889, baseType: !970, size: 32, align: 32, offset: 96)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1520, file: !34, line: 3890, baseType: !970, size: 32, align: 32, offset: 128)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1520, file: !34, line: 3897, baseType: !1528, size: 768, align: 64, offset: 192)
!1528 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !34, line: 3858, baseType: !1529)
!1529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !34, line: 3853, size: 768, align: 64, elements: !1530)
!1530 = !{!1531, !1532}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1529, file: !34, line: 3855, baseType: !1325, size: 512, align: 64)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1529, file: !34, line: 3857, baseType: !1329, size: 256, align: 32, offset: 512)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1520, file: !34, line: 3903, baseType: !1534, size: 256, align: 64, offset: 960)
!1534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1007, size: 256, align: 64, elements: !1535)
!1535 = !{!1536}
!1536 = !DISubrange(count: 4)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1520, file: !34, line: 3904, baseType: !1538, size: 128, align: 32, offset: 1216)
!1538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !970, size: 128, align: 32, elements: !1535)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1520, file: !34, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1520, file: !34, line: 3908, baseType: !1541, size: 64, align: 64, offset: 1408)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1520, file: !34, line: 3915, baseType: !1541, size: 64, align: 64, offset: 1472)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1520, file: !34, line: 3917, baseType: !970, size: 32, align: 32, offset: 1536)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1510, file: !34, line: 3926, baseType: !947, size: 64, align: 64, offset: 192)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1448, file: !34, line: 3564, baseType: !1546, size: 64, align: 64, offset: 1344)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DISubroutineType(types: !1548)
!1548 = !{!970, !1438, !1215, !1549, !1551}
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64, align: 64)
!1550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1321)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1448, file: !34, line: 3566, baseType: !1553, size: 64, align: 64, offset: 1408)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DISubroutineType(types: !1555)
!1555 = !{!970, !1438, !917, !1551, !1215}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1448, file: !34, line: 3567, baseType: !1485, size: 64, align: 64, offset: 1472)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1448, file: !34, line: 3576, baseType: !1558, size: 64, align: 64, offset: 1536)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DISubroutineType(types: !1560)
!1560 = !{!970, !1438, !1549}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1448, file: !34, line: 3577, baseType: !1562, size: 64, align: 64, offset: 1600)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DISubroutineType(types: !1564)
!1564 = !{!970, !1438, !1215}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1448, file: !34, line: 3584, baseType: !1566, size: 64, align: 64, offset: 1664)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64, align: 64)
!1567 = !DISubroutineType(types: !1568)
!1568 = !{!970, !1438, !1320}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1448, file: !34, line: 3589, baseType: !1570, size: 64, align: 64, offset: 1728)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DISubroutineType(types: !1572)
!1572 = !{null, !1438}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1448, file: !34, line: 3594, baseType: !970, size: 32, align: 32, offset: 1792)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1448, file: !34, line: 3600, baseType: !960, size: 64, align: 64, offset: 1856)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1448, file: !34, line: 3609, baseType: !1576, size: 64, align: 64, offset: 1920)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1579)
!1579 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !34, line: 3609, flags: DIFlagFwdDecl)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1440, file: !34, line: 1566, baseType: !33, size: 32, align: 32, offset: 192)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1440, file: !34, line: 1581, baseType: !920, size: 32, align: 32, offset: 224)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1440, file: !34, line: 1583, baseType: !917, size: 64, align: 64, offset: 256)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1440, file: !34, line: 1591, baseType: !1584, size: 64, align: 64, offset: 320)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !34, line: 1532, flags: DIFlagFwdDecl)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1440, file: !34, line: 1598, baseType: !917, size: 64, align: 64, offset: 384)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1440, file: !34, line: 1606, baseType: !947, size: 64, align: 64, offset: 448)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1440, file: !34, line: 1614, baseType: !970, size: 32, align: 32, offset: 512)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1440, file: !34, line: 1622, baseType: !970, size: 32, align: 32, offset: 544)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1440, file: !34, line: 1628, baseType: !970, size: 32, align: 32, offset: 576)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1440, file: !34, line: 1636, baseType: !970, size: 32, align: 32, offset: 608)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1440, file: !34, line: 1643, baseType: !970, size: 32, align: 32, offset: 640)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1440, file: !34, line: 1657, baseType: !1007, size: 64, align: 64, offset: 704)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1440, file: !34, line: 1658, baseType: !970, size: 32, align: 32, offset: 768)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1440, file: !34, line: 1679, baseType: !1339, size: 64, align: 32, offset: 800)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1440, file: !34, line: 1688, baseType: !970, size: 32, align: 32, offset: 864)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1440, file: !34, line: 1712, baseType: !970, size: 32, align: 32, offset: 896)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1440, file: !34, line: 1729, baseType: !970, size: 32, align: 32, offset: 928)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1440, file: !34, line: 1729, baseType: !970, size: 32, align: 32, offset: 960)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1440, file: !34, line: 1744, baseType: !970, size: 32, align: 32, offset: 992)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1440, file: !34, line: 1744, baseType: !970, size: 32, align: 32, offset: 1024)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1440, file: !34, line: 1751, baseType: !970, size: 32, align: 32, offset: 1056)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1440, file: !34, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1440, file: !34, line: 1791, baseType: !1605, size: 64, align: 64, offset: 1152)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DISubroutineType(types: !1607)
!1607 = !{null, !1608, !1549, !1551, !970, !970, !970}
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1440, file: !34, line: 1808, baseType: !1610, size: 64, align: 64, offset: 1216)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DISubroutineType(types: !1612)
!1612 = !{!645, !1608, !1459}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1440, file: !34, line: 1816, baseType: !970, size: 32, align: 32, offset: 1280)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1440, file: !34, line: 1825, baseType: !1615, size: 32, align: 32, offset: 1312)
!1615 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1440, file: !34, line: 1830, baseType: !970, size: 32, align: 32, offset: 1344)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1440, file: !34, line: 1838, baseType: !1615, size: 32, align: 32, offset: 1376)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1440, file: !34, line: 1846, baseType: !970, size: 32, align: 32, offset: 1408)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1440, file: !34, line: 1851, baseType: !970, size: 32, align: 32, offset: 1440)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1440, file: !34, line: 1861, baseType: !1615, size: 32, align: 32, offset: 1472)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1440, file: !34, line: 1868, baseType: !1615, size: 32, align: 32, offset: 1504)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1440, file: !34, line: 1875, baseType: !1615, size: 32, align: 32, offset: 1536)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1440, file: !34, line: 1882, baseType: !1615, size: 32, align: 32, offset: 1568)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1440, file: !34, line: 1889, baseType: !1615, size: 32, align: 32, offset: 1600)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1440, file: !34, line: 1896, baseType: !1615, size: 32, align: 32, offset: 1632)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1440, file: !34, line: 1903, baseType: !1615, size: 32, align: 32, offset: 1664)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1440, file: !34, line: 1910, baseType: !970, size: 32, align: 32, offset: 1696)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1440, file: !34, line: 1915, baseType: !970, size: 32, align: 32, offset: 1728)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1440, file: !34, line: 1926, baseType: !1551, size: 64, align: 64, offset: 1792)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1440, file: !34, line: 1935, baseType: !1339, size: 64, align: 32, offset: 1856)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1440, file: !34, line: 1942, baseType: !970, size: 32, align: 32, offset: 1920)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1440, file: !34, line: 1948, baseType: !970, size: 32, align: 32, offset: 1952)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1440, file: !34, line: 1954, baseType: !970, size: 32, align: 32, offset: 1984)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1440, file: !34, line: 1960, baseType: !970, size: 32, align: 32, offset: 2016)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1440, file: !34, line: 1984, baseType: !970, size: 32, align: 32, offset: 2048)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1440, file: !34, line: 1991, baseType: !970, size: 32, align: 32, offset: 2080)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1440, file: !34, line: 1996, baseType: !970, size: 32, align: 32, offset: 2112)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1440, file: !34, line: 2004, baseType: !970, size: 32, align: 32, offset: 2144)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1440, file: !34, line: 2011, baseType: !970, size: 32, align: 32, offset: 2176)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1440, file: !34, line: 2018, baseType: !970, size: 32, align: 32, offset: 2208)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1440, file: !34, line: 2027, baseType: !970, size: 32, align: 32, offset: 2240)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1440, file: !34, line: 2034, baseType: !970, size: 32, align: 32, offset: 2272)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1440, file: !34, line: 2044, baseType: !970, size: 32, align: 32, offset: 2304)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1440, file: !34, line: 2054, baseType: !1645, size: 64, align: 64, offset: 2368)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1440, file: !34, line: 2061, baseType: !1645, size: 64, align: 64, offset: 2432)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1440, file: !34, line: 2066, baseType: !970, size: 32, align: 32, offset: 2496)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1440, file: !34, line: 2070, baseType: !970, size: 32, align: 32, offset: 2528)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1440, file: !34, line: 2078, baseType: !970, size: 32, align: 32, offset: 2560)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1440, file: !34, line: 2085, baseType: !970, size: 32, align: 32, offset: 2592)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1440, file: !34, line: 2092, baseType: !970, size: 32, align: 32, offset: 2624)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1440, file: !34, line: 2099, baseType: !970, size: 32, align: 32, offset: 2656)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1440, file: !34, line: 2106, baseType: !970, size: 32, align: 32, offset: 2688)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1440, file: !34, line: 2113, baseType: !970, size: 32, align: 32, offset: 2720)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1440, file: !34, line: 2120, baseType: !970, size: 32, align: 32, offset: 2752)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1440, file: !34, line: 2125, baseType: !970, size: 32, align: 32, offset: 2784)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1440, file: !34, line: 2133, baseType: !970, size: 32, align: 32, offset: 2816)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1440, file: !34, line: 2140, baseType: !970, size: 32, align: 32, offset: 2848)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1440, file: !34, line: 2145, baseType: !970, size: 32, align: 32, offset: 2880)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1440, file: !34, line: 2153, baseType: !970, size: 32, align: 32, offset: 2912)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1440, file: !34, line: 2158, baseType: !970, size: 32, align: 32, offset: 2944)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1440, file: !34, line: 2166, baseType: !565, size: 32, align: 32, offset: 2976)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1440, file: !34, line: 2173, baseType: !583, size: 32, align: 32, offset: 3008)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1440, file: !34, line: 2180, baseType: !607, size: 32, align: 32, offset: 3040)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1440, file: !34, line: 2187, baseType: !558, size: 32, align: 32, offset: 3072)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1440, file: !34, line: 2194, baseType: !626, size: 32, align: 32, offset: 3104)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1440, file: !34, line: 2203, baseType: !970, size: 32, align: 32, offset: 3136)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1440, file: !34, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1440, file: !34, line: 2212, baseType: !970, size: 32, align: 32, offset: 3200)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1440, file: !34, line: 2213, baseType: !970, size: 32, align: 32, offset: 3232)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1440, file: !34, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1440, file: !34, line: 2232, baseType: !970, size: 32, align: 32, offset: 3296)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1440, file: !34, line: 2243, baseType: !970, size: 32, align: 32, offset: 3328)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1440, file: !34, line: 2249, baseType: !970, size: 32, align: 32, offset: 3360)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1440, file: !34, line: 2256, baseType: !970, size: 32, align: 32, offset: 3392)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1440, file: !34, line: 2263, baseType: !1354, size: 64, align: 64, offset: 3456)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1440, file: !34, line: 2270, baseType: !1354, size: 64, align: 64, offset: 3520)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1440, file: !34, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1440, file: !34, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1440, file: !34, line: 2367, baseType: !1681, size: 64, align: 64, offset: 3648)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{!970, !1608, !1320, !970}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1440, file: !34, line: 2383, baseType: !970, size: 32, align: 32, offset: 3712)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1440, file: !34, line: 2386, baseType: !1615, size: 32, align: 32, offset: 3744)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1440, file: !34, line: 2387, baseType: !1615, size: 32, align: 32, offset: 3776)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1440, file: !34, line: 2394, baseType: !970, size: 32, align: 32, offset: 3808)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1440, file: !34, line: 2401, baseType: !970, size: 32, align: 32, offset: 3840)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1440, file: !34, line: 2408, baseType: !970, size: 32, align: 32, offset: 3872)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1440, file: !34, line: 2415, baseType: !970, size: 32, align: 32, offset: 3904)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1440, file: !34, line: 2422, baseType: !970, size: 32, align: 32, offset: 3936)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1440, file: !34, line: 2423, baseType: !1693, size: 64, align: 64, offset: 3968)
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !34, line: 831, baseType: !1695)
!1695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !34, line: 826, size: 128, align: 32, elements: !1696)
!1696 = !{!1697, !1698, !1699, !1700}
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1695, file: !34, line: 827, baseType: !970, size: 32, align: 32)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1695, file: !34, line: 828, baseType: !970, size: 32, align: 32, offset: 32)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1695, file: !34, line: 829, baseType: !970, size: 32, align: 32, offset: 64)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1695, file: !34, line: 830, baseType: !1615, size: 32, align: 32, offset: 96)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1440, file: !34, line: 2430, baseType: !947, size: 64, align: 64, offset: 4032)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1440, file: !34, line: 2437, baseType: !947, size: 64, align: 64, offset: 4096)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1440, file: !34, line: 2444, baseType: !1615, size: 32, align: 32, offset: 4160)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1440, file: !34, line: 2451, baseType: !1615, size: 32, align: 32, offset: 4192)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1440, file: !34, line: 2458, baseType: !970, size: 32, align: 32, offset: 4224)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1440, file: !34, line: 2469, baseType: !970, size: 32, align: 32, offset: 4256)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1440, file: !34, line: 2475, baseType: !970, size: 32, align: 32, offset: 4288)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1440, file: !34, line: 2481, baseType: !970, size: 32, align: 32, offset: 4320)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1440, file: !34, line: 2485, baseType: !970, size: 32, align: 32, offset: 4352)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1440, file: !34, line: 2489, baseType: !970, size: 32, align: 32, offset: 4384)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1440, file: !34, line: 2493, baseType: !970, size: 32, align: 32, offset: 4416)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1440, file: !34, line: 2501, baseType: !970, size: 32, align: 32, offset: 4448)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1440, file: !34, line: 2506, baseType: !970, size: 32, align: 32, offset: 4480)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1440, file: !34, line: 2510, baseType: !970, size: 32, align: 32, offset: 4512)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1440, file: !34, line: 2514, baseType: !947, size: 64, align: 64, offset: 4544)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1440, file: !34, line: 2528, baseType: !1717, size: 64, align: 64, offset: 4608)
!1717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1718, size: 64, align: 64)
!1718 = !DISubroutineType(types: !1719)
!1719 = !{null, !1608, !917, !970, !970}
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1440, file: !34, line: 2534, baseType: !970, size: 32, align: 32, offset: 4672)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1440, file: !34, line: 2545, baseType: !970, size: 32, align: 32, offset: 4704)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1440, file: !34, line: 2547, baseType: !970, size: 32, align: 32, offset: 4736)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1440, file: !34, line: 2549, baseType: !970, size: 32, align: 32, offset: 4768)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1440, file: !34, line: 2551, baseType: !970, size: 32, align: 32, offset: 4800)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1440, file: !34, line: 2553, baseType: !970, size: 32, align: 32, offset: 4832)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1440, file: !34, line: 2555, baseType: !970, size: 32, align: 32, offset: 4864)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1440, file: !34, line: 2557, baseType: !970, size: 32, align: 32, offset: 4896)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1440, file: !34, line: 2559, baseType: !970, size: 32, align: 32, offset: 4928)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1440, file: !34, line: 2563, baseType: !970, size: 32, align: 32, offset: 4960)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1440, file: !34, line: 2571, baseType: !1541, size: 64, align: 64, offset: 4992)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1440, file: !34, line: 2579, baseType: !1541, size: 64, align: 64, offset: 5056)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1440, file: !34, line: 2586, baseType: !970, size: 32, align: 32, offset: 5120)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1440, file: !34, line: 2615, baseType: !970, size: 32, align: 32, offset: 5152)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1440, file: !34, line: 2627, baseType: !970, size: 32, align: 32, offset: 5184)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1440, file: !34, line: 2637, baseType: !970, size: 32, align: 32, offset: 5216)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1440, file: !34, line: 2681, baseType: !970, size: 32, align: 32, offset: 5248)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1440, file: !34, line: 2709, baseType: !947, size: 64, align: 64, offset: 5312)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1440, file: !34, line: 2716, baseType: !1739, size: 64, align: 64, offset: 5376)
!1739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1740, size: 64, align: 64)
!1740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1741)
!1741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !34, line: 3636, size: 896, align: 64, elements: !1742)
!1742 = !{!1743, !1744, !1745, !1746, !1747, !1748, !1749, !1753, !1757, !1758, !1759, !1760, !1766, !1767, !1768, !1769, !1770}
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1741, file: !34, line: 3642, baseType: !960, size: 64, align: 64)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1741, file: !34, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1741, file: !34, line: 3656, baseType: !33, size: 32, align: 32, offset: 96)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1741, file: !34, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1741, file: !34, line: 3669, baseType: !970, size: 32, align: 32, offset: 160)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1741, file: !34, line: 3682, baseType: !1566, size: 64, align: 64, offset: 192)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1741, file: !34, line: 3698, baseType: !1750, size: 64, align: 64, offset: 256)
!1750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1751, size: 64, align: 64)
!1751 = !DISubroutineType(types: !1752)
!1752 = !{!970, !1438, !1025, !918}
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1741, file: !34, line: 3712, baseType: !1754, size: 64, align: 64, offset: 320)
!1754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1755, size: 64, align: 64)
!1755 = !DISubroutineType(types: !1756)
!1756 = !{!970, !1438, !970, !1025, !918}
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1741, file: !34, line: 3726, baseType: !1750, size: 64, align: 64, offset: 384)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1741, file: !34, line: 3737, baseType: !1485, size: 64, align: 64, offset: 448)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1741, file: !34, line: 3746, baseType: !970, size: 32, align: 32, offset: 512)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1741, file: !34, line: 3757, baseType: !1761, size: 64, align: 64, offset: 576)
!1761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1762, size: 64, align: 64)
!1762 = !DISubroutineType(types: !1763)
!1763 = !{null, !1764}
!1764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1765, size: 64, align: 64)
!1765 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !34, line: 3617, flags: DIFlagFwdDecl)
