; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--swfdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--swfdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProbeData = type { i8*, i8*, i32, i8* }

!926 = !DIEnumerator(name: "TAG_DEFINEBUTTON", value: 7)
!927 = !DIEnumerator(name: "TAG_JPEGTABLES", value: 8)
!928 = !DIEnumerator(name: "TAG_SETBACKGROUNDCOLOR", value: 9)
!929 = !DIEnumerator(name: "TAG_DEFINEFONT", value: 10)
!930 = !DIEnumerator(name: "TAG_DEFINETEXT", value: 11)
!931 = !DIEnumerator(name: "TAG_DOACTION", value: 12)
!932 = !DIEnumerator(name: "TAG_DEFINEFONTINFO", value: 13)
!933 = !DIEnumerator(name: "TAG_DEFINESOUND", value: 14)
!934 = !DIEnumerator(name: "TAG_STARTSOUND", value: 15)
!935 = !DIEnumerator(name: "TAG_DEFINEBUTTONSOUND", value: 17)
!936 = !DIEnumerator(name: "TAG_STREAMHEAD", value: 18)
!937 = !DIEnumerator(name: "TAG_STREAMBLOCK", value: 19)
!938 = !DIEnumerator(name: "TAG_DEFINEBITSLOSSLESS", value: 20)
!939 = !DIEnumerator(name: "TAG_JPEG2", value: 21)
!940 = !DIEnumerator(name: "TAG_DEFINESHAPE2", value: 22)
!941 = !DIEnumerator(name: "TAG_DEFINEBUTTONCXFORM", value: 23)
!942 = !DIEnumerator(name: "TAG_PROTECT", value: 24)
!943 = !DIEnumerator(name: "TAG_PLACEOBJECT2", value: 26)
!944 = !DIEnumerator(name: "TAG_REMOVEOBJECT2", value: 28)
!945 = !DIEnumerator(name: "TAG_DEFINESHAPE3", value: 32)
!946 = !DIEnumerator(name: "TAG_DEFINETEXT2", value: 33)
!947 = !DIEnumerator(name: "TAG_DEFINEBUTTON2", value: 34)
!948 = !DIEnumerator(name: "TAG_DEFINEBITSJPEG3", value: 35)
!949 = !DIEnumerator(name: "TAG_DEFINEBITSLOSSLESS2", value: 36)
!950 = !DIEnumerator(name: "TAG_DEFINEEDITTEXT", value: 37)
!951 = !DIEnumerator(name: "TAG_DEFINESPRITE", value: 39)
!952 = !DIEnumerator(name: "TAG_FRAMELABEL", value: 43)
!953 = !DIEnumerator(name: "TAG_STREAMHEAD2", value: 45)
!954 = !DIEnumerator(name: "TAG_DEFINEMORPHSHAPE", value: 46)
!955 = !DIEnumerator(name: "TAG_DEFINEFONT2", value: 48)
!956 = !DIEnumerator(name: "TAG_EXPORTASSETS", value: 56)
!957 = !DIEnumerator(name: "TAG_IMPORTASSETS", value: 57)
!958 = !DIEnumerator(name: "TAG_ENABLEDEBUGGER", value: 58)
!959 = !DIEnumerator(name: "TAG_DOINITACTION", value: 59)
!960 = !DIEnumerator(name: "TAG_VIDEOSTREAM", value: 60)
!961 = !DIEnumerator(name: "TAG_VIDEOFRAME", value: 61)
!962 = !DIEnumerator(name: "TAG_DEFINEFONTINFO2", value: 62)
!963 = !DIEnumerator(name: "TAG_ENABLEDEBUGGER2", value: 64)
!964 = !DIEnumerator(name: "TAG_SCRIPTLIMITS", value: 65)
!965 = !DIEnumerator(name: "TAG_SETTABINDEX", value: 66)
!966 = !DIEnumerator(name: "TAG_FILEATTRIBUTES", value: 69)
!967 = !DIEnumerator(name: "TAG_PLACEOBJECT3", value: 70)
!968 = !DIEnumerator(name: "TAG_IMPORTASSETS2", value: 71)
!969 = !DIEnumerator(name: "TAG_DEFINEFONTALIGNZONES", value: 73)
!970 = !DIEnumerator(name: "TAG_CSMTEXTSETTINGS", value: 74)
!971 = !DIEnumerator(name: "TAG_DEFINEFONT3", value: 75)
!972 = !DIEnumerator(name: "TAG_SYMBOLCLASS", value: 76)
!973 = !DIEnumerator(name: "TAG_METADATA", value: 77)
!974 = !DIEnumerator(name: "TAG_DEFINESCALINGGRID", value: 78)
!975 = !DIEnumerator(name: "TAG_DOABC", value: 82)
!976 = !DIEnumerator(name: "TAG_DEFINESHAPE4", value: 83)
!977 = !DIEnumerator(name: "TAG_DEFINEMORPHSHAPE2", value: 84)
!978 = !DIEnumerator(name: "TAG_DEFINESCENEANDFRAMELABELDATA", value: 86)
!979 = !DIEnumerator(name: "TAG_DEFINEBINARYDATA", value: 87)
!980 = !DIEnumerator(name: "TAG_DEFINEFONTNAME", value: 88)
!981 = !DIEnumerator(name: "TAG_STARTSOUND2", value: 89)
!982 = !DIEnumerator(name: "TAG_DEFINEBITSJPEG4", value: 90)
!983 = !DIEnumerator(name: "TAG_DEFINEFONT4", value: 91)
!984 = !{!985, !990, !991, !992, !987, !999}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !988, line: 48, baseType: !989)
!988 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!989 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!990 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!991 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !995, line: 221, size: 32, align: 8, elements: !996)
!995 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!996 = !{!997}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !994, file: !995, line: 221, baseType: !998, size: 32, align: 32)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !988, line: 51, baseType: !991)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1000 = !{!1001, !2212}
!1001 = distinct !DIGlobalVariable(name: "ff_swf_demuxer", scope: !0, file: !1002, line: 539, type: !1003, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_swf_demuxer)
!1002 = !DIFile(filename: "libavformat/swfdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !897, line: 777, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1005)
!1005 = !{!1006, !1010, !1011, !1012, !1013, !1023, !1064, !1065, !1067, !1068, !1069, !1082, !2193, !2194, !2195, !2199, !2203, !2204, !2205, !2209, !2210, !2211}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1004, file: !897, line: 638, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1009 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1004, file: !897, line: 645, baseType: !1007, size: 64, align: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1004, file: !897, line: 652, baseType: !990, size: 32, align: 32, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1004, file: !897, line: 659, baseType: !1007, size: 64, align: 64, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1004, file: !897, line: 661, baseType: !1014, size: 64, align: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1019, line: 44, size: 64, align: 32, elements: !1020)
!1019 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1020 = !{!1021, !1022}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1018, file: !1019, line: 45, baseType: !3, size: 32, align: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1018, file: !1019, line: 46, baseType: !991, size: 32, align: 32, offset: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1004, file: !897, line: 663, baseType: !1024, size: 64, align: 64, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !1028)
!1028 = !{!1029, !1030, !1034, !1038, !1039, !1040, !1041, !1045, !1051, !1053, !1057}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1027, file: !464, line: 72, baseType: !1007, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1027, file: !464, line: 78, baseType: !1031, size: 64, align: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!1007, !999}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1027, file: !464, line: 85, baseType: !1035, size: 64, align: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1037 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1027, file: !464, line: 93, baseType: !990, size: 32, align: 32, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1027, file: !464, line: 99, baseType: !990, size: 32, align: 32, offset: 224)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1027, file: !464, line: 108, baseType: !990, size: 32, align: 32, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1027, file: !464, line: 113, baseType: !1042, size: 64, align: 64, offset: 320)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!999, !999, !999}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1027, file: !464, line: 123, baseType: !1046, size: 64, align: 64, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!1049, !1049}
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1027)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1027, file: !464, line: 130, baseType: !1052, size: 32, align: 32, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1027, file: !464, line: 136, baseType: !1054, size: 64, align: 64, offset: 512)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!1052, !999}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1027, file: !464, line: 142, baseType: !1058, size: 64, align: 64, offset: 576)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!990, !1061, !999, !1007, !990}
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1004, file: !897, line: 670, baseType: !1007, size: 64, align: 64, offset: 384)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1004, file: !897, line: 679, baseType: !1066, size: 64, align: 64, offset: 448)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1004, file: !897, line: 684, baseType: !990, size: 32, align: 32, offset: 512)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1004, file: !897, line: 689, baseType: !990, size: 32, align: 32, offset: 544)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1004, file: !897, line: 696, baseType: !1070, size: 64, align: 64, offset: 576)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!990, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1076)
!1076 = !{!1077, !1078, !1080, !1081}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1075, file: !897, line: 449, baseType: !1007, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1075, file: !897, line: 450, baseType: !1079, size: 64, align: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1075, file: !897, line: 451, baseType: !990, size: 32, align: 32, offset: 128)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1075, file: !897, line: 452, baseType: !1007, size: 64, align: 64, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1004, file: !897, line: 703, baseType: !1083, size: 64, align: 64, offset: 640)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!990, !1086}
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1291, !1292, !1355, !1356, !1357, !2050, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2104, !2105, !2106, !2107, !2108, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2159, !2160, !2163, !2164, !2165, !2166, !2167, !2168, !2170, !2171, !2172, !2173, !2181, !2182, !2186, !2190, !2191, !2192}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1087, file: !897, line: 1342, baseType: !1024, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1087, file: !897, line: 1349, baseType: !1066, size: 64, align: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1087, file: !897, line: 1356, baseType: !1092, size: 64, align: 64, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1094)
!1094 = !{!1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1150, !1151, !1155, !1159, !1164, !1171, !1266, !1272, !1278, !1279, !1280, !1281, !1285}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1093, file: !897, line: 498, baseType: !1007, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1093, file: !897, line: 504, baseType: !1007, size: 64, align: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1093, file: !897, line: 505, baseType: !1007, size: 64, align: 64, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1093, file: !897, line: 506, baseType: !1007, size: 64, align: 64, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1093, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1093, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1093, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1093, file: !897, line: 517, baseType: !990, size: 32, align: 32, offset: 352)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1093, file: !897, line: 523, baseType: !1014, size: 64, align: 64, offset: 384)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1093, file: !897, line: 526, baseType: !1024, size: 64, align: 64, offset: 448)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1093, file: !897, line: 535, baseType: !1092, size: 64, align: 64, offset: 512)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1093, file: !897, line: 539, baseType: !990, size: 32, align: 32, offset: 576)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1093, file: !897, line: 541, baseType: !1083, size: 64, align: 64, offset: 640)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1093, file: !897, line: 549, baseType: !1109, size: 64, align: 64, offset: 704)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!990, !1086, !1112}
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1115)
!1115 = !{!1116, !1129, !1133, !1134, !1135, !1136, !1137, !1138, !1146, !1147, !1148, !1149}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1114, file: !4, line: 1451, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1119, line: 94, baseType: !1120)
!1119 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1119, line: 81, size: 192, align: 64, elements: !1121)
!1121 = !{!1122, !1126, !1128}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1120, file: !1119, line: 82, baseType: !1123, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1119, line: 73, baseType: !1125)
!1125 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1119, line: 73, flags: DIFlagFwdDecl)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1120, file: !1119, line: 89, baseType: !1127, size: 64, align: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1120, file: !1119, line: 93, baseType: !990, size: 32, align: 32, offset: 128)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1114, file: !4, line: 1461, baseType: !1130, size: 64, align: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1131, line: 197, baseType: !1132)
!1131 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1132 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1114, file: !4, line: 1467, baseType: !1130, size: 64, align: 64, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1114, file: !4, line: 1468, baseType: !1127, size: 64, align: 64, offset: 192)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1114, file: !4, line: 1469, baseType: !990, size: 32, align: 32, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1114, file: !4, line: 1470, baseType: !990, size: 32, align: 32, offset: 288)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1114, file: !4, line: 1474, baseType: !990, size: 32, align: 32, offset: 320)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1114, file: !4, line: 1479, baseType: !1139, size: 64, align: 64, offset: 384)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1142)
!1142 = !{!1143, !1144, !1145}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1141, file: !4, line: 1412, baseType: !1127, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1141, file: !4, line: 1413, baseType: !990, size: 32, align: 32, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1141, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1114, file: !4, line: 1480, baseType: !990, size: 32, align: 32, offset: 448)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1114, file: !4, line: 1486, baseType: !1130, size: 64, align: 64, offset: 512)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1114, file: !4, line: 1488, baseType: !1130, size: 64, align: 64, offset: 576)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1114, file: !4, line: 1497, baseType: !1130, size: 64, align: 64, offset: 640)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1093, file: !897, line: 550, baseType: !1083, size: 64, align: 64, offset: 768)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1093, file: !897, line: 554, baseType: !1152, size: 64, align: 64, offset: 832)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!990, !1086, !1112, !1112, !990}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1093, file: !897, line: 563, baseType: !1156, size: 64, align: 64, offset: 896)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!990, !3, !990}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1093, file: !897, line: 565, baseType: !1160, size: 64, align: 64, offset: 960)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{null, !1086, !990, !1163, !1163}
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1093, file: !897, line: 570, baseType: !1165, size: 64, align: 64, offset: 1024)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!990, !1086, !990, !999, !1168}
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1169, line: 216, baseType: !1170)
!1169 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1170 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1093, file: !897, line: 581, baseType: !1172, size: 64, align: 64, offset: 1088)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!990, !1086, !990, !1175, !991}
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1178)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1179)
!1179 = !{!1180, !1184, !1186, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1220, !1222, !1223, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1178, file: !526, line: 282, baseType: !1181, size: 512, align: 64)
!1181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1127, size: 512, align: 64, elements: !1182)
!1182 = !{!1183}
!1183 = !DISubrange(count: 8)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1178, file: !526, line: 299, baseType: !1185, size: 256, align: 32, offset: 512)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 256, align: 32, elements: !1182)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1178, file: !526, line: 315, baseType: !1187, size: 64, align: 64, offset: 768)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1178, file: !526, line: 326, baseType: !990, size: 32, align: 32, offset: 832)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1178, file: !526, line: 326, baseType: !990, size: 32, align: 32, offset: 864)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1178, file: !526, line: 334, baseType: !990, size: 32, align: 32, offset: 896)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1178, file: !526, line: 341, baseType: !990, size: 32, align: 32, offset: 928)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1178, file: !526, line: 346, baseType: !990, size: 32, align: 32, offset: 960)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1178, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1178, file: !526, line: 356, baseType: !1195, size: 64, align: 32, offset: 1024)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1196, line: 61, baseType: !1197)
!1196 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1196, line: 58, size: 64, align: 32, elements: !1198)
!1198 = !{!1199, !1200}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1197, file: !1196, line: 59, baseType: !990, size: 32, align: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1197, file: !1196, line: 60, baseType: !990, size: 32, align: 32, offset: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1178, file: !526, line: 361, baseType: !1130, size: 64, align: 64, offset: 1088)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1178, file: !526, line: 369, baseType: !1130, size: 64, align: 64, offset: 1152)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1178, file: !526, line: 377, baseType: !1130, size: 64, align: 64, offset: 1216)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1178, file: !526, line: 382, baseType: !990, size: 32, align: 32, offset: 1280)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1178, file: !526, line: 386, baseType: !990, size: 32, align: 32, offset: 1312)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1178, file: !526, line: 391, baseType: !990, size: 32, align: 32, offset: 1344)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1178, file: !526, line: 396, baseType: !999, size: 64, align: 64, offset: 1408)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1178, file: !526, line: 403, baseType: !1209, size: 512, align: 64, offset: 1472)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1210, size: 512, align: 64, elements: !1182)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !988, line: 55, baseType: !1170)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1178, file: !526, line: 410, baseType: !990, size: 32, align: 32, offset: 1984)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1178, file: !526, line: 415, baseType: !990, size: 32, align: 32, offset: 2016)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1178, file: !526, line: 420, baseType: !990, size: 32, align: 32, offset: 2048)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1178, file: !526, line: 425, baseType: !990, size: 32, align: 32, offset: 2080)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1178, file: !526, line: 435, baseType: !1130, size: 64, align: 64, offset: 2112)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1178, file: !526, line: 440, baseType: !990, size: 32, align: 32, offset: 2176)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1178, file: !526, line: 445, baseType: !1210, size: 64, align: 64, offset: 2240)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1178, file: !526, line: 459, baseType: !1219, size: 512, align: 64, offset: 2304)
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1117, size: 512, align: 64, elements: !1182)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1178, file: !526, line: 473, baseType: !1221, size: 64, align: 64, offset: 2816)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1178, file: !526, line: 477, baseType: !990, size: 32, align: 32, offset: 2880)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1178, file: !526, line: 479, baseType: !1224, size: 64, align: 64, offset: 2944)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1227)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1228)
!1228 = !{!1229, !1230, !1231, !1232, !1237}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1227, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1227, file: !526, line: 203, baseType: !1127, size: 64, align: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1227, file: !526, line: 204, baseType: !990, size: 32, align: 32, offset: 128)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1227, file: !526, line: 205, baseType: !1233, size: 64, align: 64, offset: 192)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1235, line: 86, baseType: !1236)
!1235 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1236 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1235, line: 86, flags: DIFlagFwdDecl)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1227, file: !526, line: 206, baseType: !1117, size: 64, align: 64, offset: 256)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1178, file: !526, line: 480, baseType: !990, size: 32, align: 32, offset: 3008)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1178, file: !526, line: 505, baseType: !990, size: 32, align: 32, offset: 3040)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1178, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1178, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1178, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1178, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1178, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1178, file: !526, line: 532, baseType: !1130, size: 64, align: 64, offset: 3264)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1178, file: !526, line: 539, baseType: !1130, size: 64, align: 64, offset: 3328)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1178, file: !526, line: 547, baseType: !1130, size: 64, align: 64, offset: 3392)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1178, file: !526, line: 554, baseType: !1233, size: 64, align: 64, offset: 3456)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1178, file: !526, line: 563, baseType: !990, size: 32, align: 32, offset: 3520)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1178, file: !526, line: 572, baseType: !990, size: 32, align: 32, offset: 3552)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1178, file: !526, line: 581, baseType: !990, size: 32, align: 32, offset: 3584)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1178, file: !526, line: 588, baseType: !1253, size: 64, align: 64, offset: 3648)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1131, line: 194, baseType: !1255)
!1255 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1178, file: !526, line: 593, baseType: !990, size: 32, align: 32, offset: 3712)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1178, file: !526, line: 596, baseType: !990, size: 32, align: 32, offset: 3744)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1178, file: !526, line: 599, baseType: !1117, size: 64, align: 64, offset: 3776)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1178, file: !526, line: 605, baseType: !1117, size: 64, align: 64, offset: 3840)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1178, file: !526, line: 616, baseType: !1117, size: 64, align: 64, offset: 3904)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1178, file: !526, line: 626, baseType: !1168, size: 64, align: 64, offset: 3968)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1178, file: !526, line: 627, baseType: !1168, size: 64, align: 64, offset: 4032)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1178, file: !526, line: 628, baseType: !1168, size: 64, align: 64, offset: 4096)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1178, file: !526, line: 629, baseType: !1168, size: 64, align: 64, offset: 4160)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1178, file: !526, line: 645, baseType: !1117, size: 64, align: 64, offset: 4224)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1093, file: !897, line: 587, baseType: !1267, size: 64, align: 64, offset: 1152)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!990, !1086, !1270}
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1093, file: !897, line: 592, baseType: !1273, size: 64, align: 64, offset: 1216)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!990, !1086, !1276}
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1093, file: !897, line: 597, baseType: !1273, size: 64, align: 64, offset: 1280)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1093, file: !897, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1093, file: !897, line: 608, baseType: !1083, size: 64, align: 64, offset: 1408)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1093, file: !897, line: 617, baseType: !1282, size: 64, align: 64, offset: 1472)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{null, !1086}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1093, file: !897, line: 623, baseType: !1286, size: 64, align: 64, offset: 1536)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!990, !1086, !1289}
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1113)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1087, file: !897, line: 1365, baseType: !999, size: 64, align: 64, offset: 192)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1087, file: !897, line: 1379, baseType: !1293, size: 64, align: 64, offset: 256)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1296)
!1296 = !{!1297, !1298, !1299, !1300, !1301, !1302, !1303, !1307, !1308, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1322, !1323, !1327, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1345, !1346, !1347, !1348, !1352, !1353, !1354}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1295, file: !628, line: 174, baseType: !1024, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1295, file: !628, line: 226, baseType: !1079, size: 64, align: 64, offset: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1295, file: !628, line: 227, baseType: !990, size: 32, align: 32, offset: 128)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1295, file: !628, line: 228, baseType: !1079, size: 64, align: 64, offset: 192)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1295, file: !628, line: 229, baseType: !1079, size: 64, align: 64, offset: 256)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1295, file: !628, line: 233, baseType: !999, size: 64, align: 64, offset: 320)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1295, file: !628, line: 235, baseType: !1304, size: 64, align: 64, offset: 384)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{!990, !999, !1127, !990}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1295, file: !628, line: 236, baseType: !1304, size: 64, align: 64, offset: 448)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1295, file: !628, line: 237, baseType: !1309, size: 64, align: 64, offset: 512)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!1130, !999, !1130, !990}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1295, file: !628, line: 238, baseType: !1130, size: 64, align: 64, offset: 576)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1295, file: !628, line: 239, baseType: !990, size: 32, align: 32, offset: 640)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1295, file: !628, line: 240, baseType: !990, size: 32, align: 32, offset: 672)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1295, file: !628, line: 241, baseType: !990, size: 32, align: 32, offset: 704)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1295, file: !628, line: 242, baseType: !1170, size: 64, align: 64, offset: 768)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1295, file: !628, line: 243, baseType: !1079, size: 64, align: 64, offset: 832)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1295, file: !628, line: 244, baseType: !1319, size: 64, align: 64, offset: 896)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!1170, !1170, !985, !991}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1295, file: !628, line: 245, baseType: !990, size: 32, align: 32, offset: 960)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1295, file: !628, line: 249, baseType: !1324, size: 64, align: 64, offset: 1024)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!990, !999, !990}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1295, file: !628, line: 255, baseType: !1328, size: 64, align: 64, offset: 1088)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DISubroutineType(types: !1330)
!1330 = !{!1130, !999, !990, !1130, !990}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1295, file: !628, line: 260, baseType: !990, size: 32, align: 32, offset: 1152)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1295, file: !628, line: 266, baseType: !1130, size: 64, align: 64, offset: 1216)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1295, file: !628, line: 273, baseType: !990, size: 32, align: 32, offset: 1280)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1295, file: !628, line: 279, baseType: !1130, size: 64, align: 64, offset: 1344)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1295, file: !628, line: 285, baseType: !990, size: 32, align: 32, offset: 1408)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1295, file: !628, line: 291, baseType: !990, size: 32, align: 32, offset: 1440)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1295, file: !628, line: 298, baseType: !990, size: 32, align: 32, offset: 1472)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1295, file: !628, line: 304, baseType: !990, size: 32, align: 32, offset: 1504)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1295, file: !628, line: 309, baseType: !1007, size: 64, align: 64, offset: 1536)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1295, file: !628, line: 314, baseType: !1007, size: 64, align: 64, offset: 1600)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1295, file: !628, line: 319, baseType: !1342, size: 64, align: 64, offset: 1664)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!990, !999, !1127, !990, !627, !1130}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1295, file: !628, line: 326, baseType: !990, size: 32, align: 32, offset: 1728)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1295, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1295, file: !628, line: 332, baseType: !1130, size: 64, align: 64, offset: 1792)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1295, file: !628, line: 338, baseType: !1349, size: 64, align: 64, offset: 1856)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!990, !999}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1295, file: !628, line: 340, baseType: !1130, size: 64, align: 64, offset: 1920)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1295, file: !628, line: 346, baseType: !1079, size: 64, align: 64, offset: 1984)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1295, file: !628, line: 351, baseType: !990, size: 32, align: 32, offset: 2048)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1087, file: !897, line: 1386, baseType: !990, size: 32, align: 32, offset: 320)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1087, file: !897, line: 1393, baseType: !991, size: 32, align: 32, offset: 352)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1087, file: !897, line: 1405, baseType: !1358, size: 64, align: 64, offset: 384)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1362)
!1362 = !{!1363, !1364, !1365, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1835, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1936, !1942, !1943, !1947, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1979, !1980, !1981, !1982, !1983, !1984}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1361, file: !897, line: 866, baseType: !990, size: 32, align: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1361, file: !897, line: 872, baseType: !990, size: 32, align: 32, offset: 32)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1361, file: !897, line: 878, baseType: !1366, size: 64, align: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1368)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1369)
!1369 = !{!1370, !1371, !1372, !1373, !1510, !1511, !1512, !1513, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1539, !1543, !1544, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1723, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1368, file: !4, line: 1561, baseType: !1024, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1368, file: !4, line: 1562, baseType: !990, size: 32, align: 32, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1368, file: !4, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1368, file: !4, line: 1565, baseType: !1374, size: 64, align: 64, offset: 128)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1376)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1377)
!1377 = !{!1378, !1379, !1380, !1381, !1382, !1383, !1386, !1389, !1392, !1395, !1398, !1399, !1400, !1408, !1409, !1410, !1412, !1416, !1422, !1427, !1431, !1432, !1475, !1482, !1486, !1487, !1491, !1495, !1499, !1503, !1504, !1505}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1376, file: !4, line: 3475, baseType: !1007, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1376, file: !4, line: 3480, baseType: !1007, size: 64, align: 64, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1376, file: !4, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1376, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1376, file: !4, line: 3487, baseType: !990, size: 32, align: 32, offset: 192)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1376, file: !4, line: 3488, baseType: !1384, size: 64, align: 64, offset: 256)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1195)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1376, file: !4, line: 3489, baseType: !1387, size: 64, align: 64, offset: 320)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1376, file: !4, line: 3490, baseType: !1390, size: 64, align: 64, offset: 384)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1376, file: !4, line: 3491, baseType: !1393, size: 64, align: 64, offset: 448)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1376, file: !4, line: 3492, baseType: !1396, size: 64, align: 64, offset: 512)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1210)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1376, file: !4, line: 3493, baseType: !987, size: 8, align: 8, offset: 576)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1376, file: !4, line: 3494, baseType: !1024, size: 64, align: 64, offset: 640)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1376, file: !4, line: 3495, baseType: !1401, size: 64, align: 64, offset: 704)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1403)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1404)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1405)
!1405 = !{!1406, !1407}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1404, file: !4, line: 3402, baseType: !990, size: 32, align: 32)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1404, file: !4, line: 3403, baseType: !1007, size: 64, align: 64, offset: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1376, file: !4, line: 3507, baseType: !1007, size: 64, align: 64, offset: 768)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1376, file: !4, line: 3516, baseType: !990, size: 32, align: 32, offset: 832)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1376, file: !4, line: 3517, baseType: !1411, size: 64, align: 64, offset: 896)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1376, file: !4, line: 3527, baseType: !1413, size: 64, align: 64, offset: 960)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DISubroutineType(types: !1415)
!1415 = !{!990, !1366}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1376, file: !4, line: 3535, baseType: !1417, size: 64, align: 64, offset: 1024)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DISubroutineType(types: !1419)
!1419 = !{!990, !1366, !1420}
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1367)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1376, file: !4, line: 3541, baseType: !1423, size: 64, align: 64, offset: 1088)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1425)
!1425 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1426)
!1426 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1376, file: !4, line: 3549, baseType: !1428, size: 64, align: 64, offset: 1152)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{null, !1411}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1376, file: !4, line: 3551, baseType: !1413, size: 64, align: 64, offset: 1216)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1376, file: !4, line: 3552, baseType: !1433, size: 64, align: 64, offset: 1280)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DISubroutineType(types: !1435)
!1435 = !{!990, !1366, !1127, !990, !1436}
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1438)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1439)
!1439 = !{!1440, !1443, !1444, !1445, !1446, !1474}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1438, file: !4, line: 3921, baseType: !1441, size: 16, align: 16)
!1441 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !988, line: 49, baseType: !1442)
!1442 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1438, file: !4, line: 3922, baseType: !998, size: 32, align: 32, offset: 32)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1438, file: !4, line: 3923, baseType: !998, size: 32, align: 32, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1438, file: !4, line: 3924, baseType: !991, size: 32, align: 32, offset: 96)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1438, file: !4, line: 3925, baseType: !1447, size: 64, align: 64, offset: 128)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1450)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1451)
!1451 = !{!1452, !1453, !1454, !1455, !1456, !1457, !1463, !1467, !1469, !1470, !1472, !1473}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1450, file: !4, line: 3886, baseType: !990, size: 32, align: 32)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1450, file: !4, line: 3887, baseType: !990, size: 32, align: 32, offset: 32)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1450, file: !4, line: 3888, baseType: !990, size: 32, align: 32, offset: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1450, file: !4, line: 3889, baseType: !990, size: 32, align: 32, offset: 96)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1450, file: !4, line: 3890, baseType: !990, size: 32, align: 32, offset: 128)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1450, file: !4, line: 3897, baseType: !1458, size: 768, align: 64, offset: 192)
!1458 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1459)
!1459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1460)
!1460 = !{!1461, !1462}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1459, file: !4, line: 3855, baseType: !1181, size: 512, align: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1459, file: !4, line: 3857, baseType: !1185, size: 256, align: 32, offset: 512)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1450, file: !4, line: 3903, baseType: !1464, size: 256, align: 64, offset: 960)
!1464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1127, size: 256, align: 64, elements: !1465)
!1465 = !{!1466}
!1466 = !DISubrange(count: 4)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1450, file: !4, line: 3904, baseType: !1468, size: 128, align: 32, offset: 1216)
!1468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 128, align: 32, elements: !1465)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1450, file: !4, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1450, file: !4, line: 3908, baseType: !1471, size: 64, align: 64, offset: 1408)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1450, file: !4, line: 3915, baseType: !1471, size: 64, align: 64, offset: 1472)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1450, file: !4, line: 3917, baseType: !990, size: 32, align: 32, offset: 1536)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1438, file: !4, line: 3926, baseType: !1130, size: 64, align: 64, offset: 192)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1376, file: !4, line: 3564, baseType: !1476, size: 64, align: 64, offset: 1344)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{!990, !1366, !1112, !1479, !1481}
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1177)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1376, file: !4, line: 3566, baseType: !1483, size: 64, align: 64, offset: 1408)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DISubroutineType(types: !1485)
!1485 = !{!990, !1366, !999, !1481, !1112}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1376, file: !4, line: 3567, baseType: !1413, size: 64, align: 64, offset: 1472)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1376, file: !4, line: 3576, baseType: !1488, size: 64, align: 64, offset: 1536)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!990, !1366, !1479}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1376, file: !4, line: 3577, baseType: !1492, size: 64, align: 64, offset: 1600)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{!990, !1366, !1112}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1376, file: !4, line: 3584, baseType: !1496, size: 64, align: 64, offset: 1664)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{!990, !1366, !1176}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1376, file: !4, line: 3589, baseType: !1500, size: 64, align: 64, offset: 1728)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{null, !1366}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1376, file: !4, line: 3594, baseType: !990, size: 32, align: 32, offset: 1792)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1376, file: !4, line: 3600, baseType: !1007, size: 64, align: 64, offset: 1856)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1376, file: !4, line: 3609, baseType: !1506, size: 64, align: 64, offset: 1920)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1509)
!1509 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1368, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1368, file: !4, line: 1581, baseType: !991, size: 32, align: 32, offset: 224)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1368, file: !4, line: 1583, baseType: !999, size: 64, align: 64, offset: 256)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1368, file: !4, line: 1591, baseType: !1514, size: 64, align: 64, offset: 320)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1368, file: !4, line: 1598, baseType: !999, size: 64, align: 64, offset: 384)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1368, file: !4, line: 1606, baseType: !1130, size: 64, align: 64, offset: 448)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1368, file: !4, line: 1614, baseType: !990, size: 32, align: 32, offset: 512)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1368, file: !4, line: 1622, baseType: !990, size: 32, align: 32, offset: 544)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1368, file: !4, line: 1628, baseType: !990, size: 32, align: 32, offset: 576)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1368, file: !4, line: 1636, baseType: !990, size: 32, align: 32, offset: 608)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1368, file: !4, line: 1643, baseType: !990, size: 32, align: 32, offset: 640)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1368, file: !4, line: 1657, baseType: !1127, size: 64, align: 64, offset: 704)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1368, file: !4, line: 1658, baseType: !990, size: 32, align: 32, offset: 768)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1368, file: !4, line: 1679, baseType: !1195, size: 64, align: 32, offset: 800)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1368, file: !4, line: 1688, baseType: !990, size: 32, align: 32, offset: 864)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1368, file: !4, line: 1712, baseType: !990, size: 32, align: 32, offset: 896)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1368, file: !4, line: 1729, baseType: !990, size: 32, align: 32, offset: 928)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1368, file: !4, line: 1729, baseType: !990, size: 32, align: 32, offset: 960)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1368, file: !4, line: 1744, baseType: !990, size: 32, align: 32, offset: 992)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1368, file: !4, line: 1744, baseType: !990, size: 32, align: 32, offset: 1024)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1368, file: !4, line: 1751, baseType: !990, size: 32, align: 32, offset: 1056)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1368, file: !4, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1368, file: !4, line: 1791, baseType: !1535, size: 64, align: 64, offset: 1152)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{null, !1538, !1479, !1481, !990, !990, !990}
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1368, file: !4, line: 1808, baseType: !1540, size: 64, align: 64, offset: 1216)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DISubroutineType(types: !1542)
!1542 = !{!645, !1538, !1387}
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1368, file: !4, line: 1816, baseType: !990, size: 32, align: 32, offset: 1280)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1368, file: !4, line: 1825, baseType: !1545, size: 32, align: 32, offset: 1312)
!1545 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1368, file: !4, line: 1830, baseType: !990, size: 32, align: 32, offset: 1344)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1368, file: !4, line: 1838, baseType: !1545, size: 32, align: 32, offset: 1376)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1368, file: !4, line: 1846, baseType: !990, size: 32, align: 32, offset: 1408)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1368, file: !4, line: 1851, baseType: !990, size: 32, align: 32, offset: 1440)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1368, file: !4, line: 1861, baseType: !1545, size: 32, align: 32, offset: 1472)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1368, file: !4, line: 1868, baseType: !1545, size: 32, align: 32, offset: 1504)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1368, file: !4, line: 1875, baseType: !1545, size: 32, align: 32, offset: 1536)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1368, file: !4, line: 1882, baseType: !1545, size: 32, align: 32, offset: 1568)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1368, file: !4, line: 1889, baseType: !1545, size: 32, align: 32, offset: 1600)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1368, file: !4, line: 1896, baseType: !1545, size: 32, align: 32, offset: 1632)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1368, file: !4, line: 1903, baseType: !1545, size: 32, align: 32, offset: 1664)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1368, file: !4, line: 1910, baseType: !990, size: 32, align: 32, offset: 1696)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1368, file: !4, line: 1915, baseType: !990, size: 32, align: 32, offset: 1728)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1368, file: !4, line: 1926, baseType: !1481, size: 64, align: 64, offset: 1792)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1368, file: !4, line: 1935, baseType: !1195, size: 64, align: 32, offset: 1856)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1368, file: !4, line: 1942, baseType: !990, size: 32, align: 32, offset: 1920)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1368, file: !4, line: 1948, baseType: !990, size: 32, align: 32, offset: 1952)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1368, file: !4, line: 1954, baseType: !990, size: 32, align: 32, offset: 1984)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1368, file: !4, line: 1960, baseType: !990, size: 32, align: 32, offset: 2016)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1368, file: !4, line: 1984, baseType: !990, size: 32, align: 32, offset: 2048)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1368, file: !4, line: 1991, baseType: !990, size: 32, align: 32, offset: 2080)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1368, file: !4, line: 1996, baseType: !990, size: 32, align: 32, offset: 2112)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1368, file: !4, line: 2004, baseType: !990, size: 32, align: 32, offset: 2144)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1368, file: !4, line: 2011, baseType: !990, size: 32, align: 32, offset: 2176)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1368, file: !4, line: 2018, baseType: !990, size: 32, align: 32, offset: 2208)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1368, file: !4, line: 2027, baseType: !990, size: 32, align: 32, offset: 2240)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1368, file: !4, line: 2034, baseType: !990, size: 32, align: 32, offset: 2272)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1368, file: !4, line: 2044, baseType: !990, size: 32, align: 32, offset: 2304)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1368, file: !4, line: 2054, baseType: !1575, size: 64, align: 64, offset: 2368)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1368, file: !4, line: 2061, baseType: !1575, size: 64, align: 64, offset: 2432)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1368, file: !4, line: 2066, baseType: !990, size: 32, align: 32, offset: 2496)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1368, file: !4, line: 2070, baseType: !990, size: 32, align: 32, offset: 2528)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1368, file: !4, line: 2078, baseType: !990, size: 32, align: 32, offset: 2560)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1368, file: !4, line: 2085, baseType: !990, size: 32, align: 32, offset: 2592)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1368, file: !4, line: 2092, baseType: !990, size: 32, align: 32, offset: 2624)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1368, file: !4, line: 2099, baseType: !990, size: 32, align: 32, offset: 2656)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1368, file: !4, line: 2106, baseType: !990, size: 32, align: 32, offset: 2688)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1368, file: !4, line: 2113, baseType: !990, size: 32, align: 32, offset: 2720)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1368, file: !4, line: 2120, baseType: !990, size: 32, align: 32, offset: 2752)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1368, file: !4, line: 2125, baseType: !990, size: 32, align: 32, offset: 2784)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1368, file: !4, line: 2133, baseType: !990, size: 32, align: 32, offset: 2816)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1368, file: !4, line: 2140, baseType: !990, size: 32, align: 32, offset: 2848)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1368, file: !4, line: 2145, baseType: !990, size: 32, align: 32, offset: 2880)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1368, file: !4, line: 2153, baseType: !990, size: 32, align: 32, offset: 2912)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1368, file: !4, line: 2158, baseType: !990, size: 32, align: 32, offset: 2944)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1368, file: !4, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1368, file: !4, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1368, file: !4, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1368, file: !4, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1368, file: !4, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1368, file: !4, line: 2203, baseType: !990, size: 32, align: 32, offset: 3136)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1368, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1368, file: !4, line: 2212, baseType: !990, size: 32, align: 32, offset: 3200)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1368, file: !4, line: 2213, baseType: !990, size: 32, align: 32, offset: 3232)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1368, file: !4, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1368, file: !4, line: 2232, baseType: !990, size: 32, align: 32, offset: 3296)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1368, file: !4, line: 2243, baseType: !990, size: 32, align: 32, offset: 3328)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1368, file: !4, line: 2249, baseType: !990, size: 32, align: 32, offset: 3360)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1368, file: !4, line: 2256, baseType: !990, size: 32, align: 32, offset: 3392)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1368, file: !4, line: 2263, baseType: !1210, size: 64, align: 64, offset: 3456)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1368, file: !4, line: 2270, baseType: !1210, size: 64, align: 64, offset: 3520)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1368, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1368, file: !4, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1368, file: !4, line: 2367, baseType: !1611, size: 64, align: 64, offset: 3648)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DISubroutineType(types: !1613)
!1613 = !{!990, !1538, !1176, !990}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1368, file: !4, line: 2383, baseType: !990, size: 32, align: 32, offset: 3712)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1368, file: !4, line: 2386, baseType: !1545, size: 32, align: 32, offset: 3744)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1368, file: !4, line: 2387, baseType: !1545, size: 32, align: 32, offset: 3776)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1368, file: !4, line: 2394, baseType: !990, size: 32, align: 32, offset: 3808)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1368, file: !4, line: 2401, baseType: !990, size: 32, align: 32, offset: 3840)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1368, file: !4, line: 2408, baseType: !990, size: 32, align: 32, offset: 3872)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1368, file: !4, line: 2415, baseType: !990, size: 32, align: 32, offset: 3904)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1368, file: !4, line: 2422, baseType: !990, size: 32, align: 32, offset: 3936)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1368, file: !4, line: 2423, baseType: !1623, size: 64, align: 64, offset: 3968)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1625)
!1625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1626)
!1626 = !{!1627, !1628, !1629, !1630}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1625, file: !4, line: 827, baseType: !990, size: 32, align: 32)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1625, file: !4, line: 828, baseType: !990, size: 32, align: 32, offset: 32)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1625, file: !4, line: 829, baseType: !990, size: 32, align: 32, offset: 64)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1625, file: !4, line: 830, baseType: !1545, size: 32, align: 32, offset: 96)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1368, file: !4, line: 2430, baseType: !1130, size: 64, align: 64, offset: 4032)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1368, file: !4, line: 2437, baseType: !1130, size: 64, align: 64, offset: 4096)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1368, file: !4, line: 2444, baseType: !1545, size: 32, align: 32, offset: 4160)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1368, file: !4, line: 2451, baseType: !1545, size: 32, align: 32, offset: 4192)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1368, file: !4, line: 2458, baseType: !990, size: 32, align: 32, offset: 4224)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1368, file: !4, line: 2469, baseType: !990, size: 32, align: 32, offset: 4256)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1368, file: !4, line: 2475, baseType: !990, size: 32, align: 32, offset: 4288)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1368, file: !4, line: 2481, baseType: !990, size: 32, align: 32, offset: 4320)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1368, file: !4, line: 2485, baseType: !990, size: 32, align: 32, offset: 4352)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1368, file: !4, line: 2489, baseType: !990, size: 32, align: 32, offset: 4384)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1368, file: !4, line: 2493, baseType: !990, size: 32, align: 32, offset: 4416)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1368, file: !4, line: 2501, baseType: !990, size: 32, align: 32, offset: 4448)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1368, file: !4, line: 2506, baseType: !990, size: 32, align: 32, offset: 4480)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1368, file: !4, line: 2510, baseType: !990, size: 32, align: 32, offset: 4512)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1368, file: !4, line: 2514, baseType: !1130, size: 64, align: 64, offset: 4544)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1368, file: !4, line: 2528, baseType: !1647, size: 64, align: 64, offset: 4608)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DISubroutineType(types: !1649)
!1649 = !{null, !1538, !999, !990, !990}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1368, file: !4, line: 2534, baseType: !990, size: 32, align: 32, offset: 4672)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1368, file: !4, line: 2545, baseType: !990, size: 32, align: 32, offset: 4704)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1368, file: !4, line: 2547, baseType: !990, size: 32, align: 32, offset: 4736)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1368, file: !4, line: 2549, baseType: !990, size: 32, align: 32, offset: 4768)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1368, file: !4, line: 2551, baseType: !990, size: 32, align: 32, offset: 4800)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1368, file: !4, line: 2553, baseType: !990, size: 32, align: 32, offset: 4832)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1368, file: !4, line: 2555, baseType: !990, size: 32, align: 32, offset: 4864)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1368, file: !4, line: 2557, baseType: !990, size: 32, align: 32, offset: 4896)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1368, file: !4, line: 2559, baseType: !990, size: 32, align: 32, offset: 4928)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1368, file: !4, line: 2563, baseType: !990, size: 32, align: 32, offset: 4960)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1368, file: !4, line: 2571, baseType: !1471, size: 64, align: 64, offset: 4992)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1368, file: !4, line: 2579, baseType: !1471, size: 64, align: 64, offset: 5056)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1368, file: !4, line: 2586, baseType: !990, size: 32, align: 32, offset: 5120)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1368, file: !4, line: 2615, baseType: !990, size: 32, align: 32, offset: 5152)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1368, file: !4, line: 2627, baseType: !990, size: 32, align: 32, offset: 5184)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1368, file: !4, line: 2637, baseType: !990, size: 32, align: 32, offset: 5216)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1368, file: !4, line: 2681, baseType: !990, size: 32, align: 32, offset: 5248)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1368, file: !4, line: 2709, baseType: !1130, size: 64, align: 64, offset: 5312)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1368, file: !4, line: 2716, baseType: !1669, size: 64, align: 64, offset: 5376)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1671)
!1671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1672)
!1672 = !{!1673, !1674, !1675, !1676, !1677, !1678, !1679, !1683, !1687, !1688, !1689, !1690, !1696, !1697, !1698, !1699, !1700}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1671, file: !4, line: 3642, baseType: !1007, size: 64, align: 64)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1671, file: !4, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1671, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1671, file: !4, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1671, file: !4, line: 3669, baseType: !990, size: 32, align: 32, offset: 160)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1671, file: !4, line: 3682, baseType: !1496, size: 64, align: 64, offset: 192)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1671, file: !4, line: 3698, baseType: !1680, size: 64, align: 64, offset: 256)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!990, !1366, !985, !998}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1671, file: !4, line: 3712, baseType: !1684, size: 64, align: 64, offset: 320)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{!990, !1366, !990, !985, !998}
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1671, file: !4, line: 3726, baseType: !1680, size: 64, align: 64, offset: 384)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1671, file: !4, line: 3737, baseType: !1413, size: 64, align: 64, offset: 448)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1671, file: !4, line: 3746, baseType: !990, size: 32, align: 32, offset: 512)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1671, file: !4, line: 3757, baseType: !1691, size: 64, align: 64, offset: 576)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DISubroutineType(types: !1693)
!1693 = !{null, !1694}
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1671, file: !4, line: 3766, baseType: !1413, size: 64, align: 64, offset: 640)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1671, file: !4, line: 3774, baseType: !1413, size: 64, align: 64, offset: 704)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1671, file: !4, line: 3780, baseType: !990, size: 32, align: 32, offset: 768)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1671, file: !4, line: 3785, baseType: !990, size: 32, align: 32, offset: 800)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1671, file: !4, line: 3795, baseType: !1701, size: 64, align: 64, offset: 832)
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DISubroutineType(types: !1703)
!1703 = !{!990, !1366, !1117}
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1368, file: !4, line: 2728, baseType: !999, size: 64, align: 64, offset: 5440)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1368, file: !4, line: 2735, baseType: !1209, size: 512, align: 64, offset: 5504)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1368, file: !4, line: 2742, baseType: !990, size: 32, align: 32, offset: 6016)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1368, file: !4, line: 2755, baseType: !990, size: 32, align: 32, offset: 6048)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1368, file: !4, line: 2776, baseType: !990, size: 32, align: 32, offset: 6080)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1368, file: !4, line: 2783, baseType: !990, size: 32, align: 32, offset: 6112)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1368, file: !4, line: 2791, baseType: !990, size: 32, align: 32, offset: 6144)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1368, file: !4, line: 2802, baseType: !1176, size: 64, align: 64, offset: 6208)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1368, file: !4, line: 2811, baseType: !990, size: 32, align: 32, offset: 6272)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1368, file: !4, line: 2821, baseType: !990, size: 32, align: 32, offset: 6304)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1368, file: !4, line: 2830, baseType: !990, size: 32, align: 32, offset: 6336)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1368, file: !4, line: 2840, baseType: !990, size: 32, align: 32, offset: 6368)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1368, file: !4, line: 2851, baseType: !1717, size: 64, align: 64, offset: 6400)
!1717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1718, size: 64, align: 64)
!1718 = !DISubroutineType(types: !1719)
!1719 = !{!990, !1538, !1720, !999, !1481, !990, !990}
!1720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1721, size: 64, align: 64)
!1721 = !DISubroutineType(types: !1722)
!1722 = !{!990, !1538, !999}
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1368, file: !4, line: 2871, baseType: !1724, size: 64, align: 64, offset: 6464)
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1725, size: 64, align: 64)
!1725 = !DISubroutineType(types: !1726)
!1726 = !{!990, !1538, !1727, !999, !1481, !990}
!1727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1728, size: 64, align: 64)
!1728 = !DISubroutineType(types: !1729)
!1729 = !{!990, !1538, !999, !990, !990}
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1368, file: !4, line: 2878, baseType: !990, size: 32, align: 32, offset: 6528)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1368, file: !4, line: 2885, baseType: !990, size: 32, align: 32, offset: 6560)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1368, file: !4, line: 3005, baseType: !990, size: 32, align: 32, offset: 6592)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1368, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1368, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1368, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1368, file: !4, line: 3037, baseType: !1127, size: 64, align: 64, offset: 6720)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1368, file: !4, line: 3038, baseType: !990, size: 32, align: 32, offset: 6784)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1368, file: !4, line: 3050, baseType: !1210, size: 64, align: 64, offset: 6848)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1368, file: !4, line: 3065, baseType: !990, size: 32, align: 32, offset: 6912)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1368, file: !4, line: 3083, baseType: !990, size: 32, align: 32, offset: 6944)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1368, file: !4, line: 3092, baseType: !1195, size: 64, align: 32, offset: 6976)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1368, file: !4, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1368, file: !4, line: 3106, baseType: !1195, size: 64, align: 32, offset: 7072)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1368, file: !4, line: 3113, baseType: !1745, size: 64, align: 64, offset: 7168)
!1745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1746, size: 64, align: 64)
!1746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1747)
!1747 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1748)
!1748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1749)
!1749 = !{!1750, !1751, !1752, !1753, !1754, !1755, !1758}
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1748, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1748, file: !4, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1748, file: !4, line: 720, baseType: !1007, size: 64, align: 64, offset: 64)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1748, file: !4, line: 724, baseType: !1007, size: 64, align: 64, offset: 128)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1748, file: !4, line: 728, baseType: !990, size: 32, align: 32, offset: 192)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1748, file: !4, line: 734, baseType: !1756, size: 64, align: 64, offset: 256)
!1756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1757, size: 64, align: 64)
!1757 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1748, file: !4, line: 739, baseType: !1759, size: 64, align: 64, offset: 320)
!1759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1760, size: 64, align: 64)
!1760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1404)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1368, file: !4, line: 3129, baseType: !1130, size: 64, align: 64, offset: 7232)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1368, file: !4, line: 3130, baseType: !1130, size: 64, align: 64, offset: 7296)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1368, file: !4, line: 3131, baseType: !1130, size: 64, align: 64, offset: 7360)
