; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--apetag.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--apetag.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFormatContext = type { %struct.AVClass*, %struct.AVInputFormat*, %struct.AVOutputFormat*, i8*, %struct.AVIOContext*, i32, i32, %struct.AVStream**, [1024 x i8], i8*, i64, i64, i64, i32, i32, i32, i64, i64, i8*, i32, i32, %struct.AVProgram**, i32, i32, i32, i32, i32, i32, %struct.AVChapter**, %struct.AVDictionary*, i64, i32, i32, %struct.AVIOInterruptCB, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i8*, i8*, %struct.AVFormatInternal*, i32, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, i32, i8*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i64, i8*, i32, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVIOInterruptCB*, %struct.AVDictionary**)*, i8*, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVDictionary**)*, void (%struct.AVFormatContext*, %struct.AVIOContext*)*, i8*, i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }

!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !25, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !25, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !25, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !918}
!917 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!918 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!919 = !{i32 2, !"Dwarf Version", i32 4}
!920 = !{i32 2, !"Debug Info Version", i32 3}
!921 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!922 = distinct !DISubprogram(name: "ff_ape_parse_tag", scope: !923, file: !923, line: 118, type: !924, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2142)
!923 = !DIFile(filename: "libavformat/apetag.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!924 = !DISubroutineType(types: !925)
!925 = !{!926, !929}
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !927, line: 40, baseType: !928)
!927 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!928 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !932)
!932 = !{!933, !978, !1089, !1237, !1238, !1303, !1304, !1305, !1999, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2053, !2054, !2055, !2056, !2057, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2108, !2109, !2112, !2113, !2114, !2115, !2116, !2117, !2119, !2120, !2121, !2122, !2130, !2131, !2135, !2139, !2140, !2141}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !931, file: !897, line: 1342, baseType: !934, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !938)
!938 = !{!939, !943, !948, !952, !953, !954, !955, !959, !965, !967, !971}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !937, file: !4, line: 72, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!942 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !937, file: !4, line: 78, baseType: !944, size: 64, align: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!940, !947}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !937, file: !4, line: 85, baseType: !949, size: 64, align: 64, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !937, file: !4, line: 93, baseType: !917, size: 32, align: 32, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !937, file: !4, line: 99, baseType: !917, size: 32, align: 32, offset: 224)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !937, file: !4, line: 108, baseType: !917, size: 32, align: 32, offset: 256)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !937, file: !4, line: 113, baseType: !956, size: 64, align: 64, offset: 320)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{!947, !947, !947}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !937, file: !4, line: 123, baseType: !960, size: 64, align: 64, offset: 384)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!963, !963}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !937, file: !4, line: 130, baseType: !966, size: 32, align: 32, offset: 448)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !937, file: !4, line: 136, baseType: !968, size: 64, align: 64, offset: 512)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!966, !947}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !937, file: !4, line: 142, baseType: !972, size: 64, align: 64, offset: 576)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!917, !975, !947, !940, !917}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !931, file: !897, line: 1349, baseType: !979, size: 64, align: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !981)
!981 = !{!982, !983, !984, !985, !986, !996, !997, !998, !999, !1000, !1001, !1015, !1020, !1060, !1061, !1065, !1070, !1071, !1072, !1076, !1082, !1088}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !980, file: !897, line: 638, baseType: !940, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !980, file: !897, line: 645, baseType: !940, size: 64, align: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !980, file: !897, line: 652, baseType: !917, size: 32, align: 32, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !980, file: !897, line: 659, baseType: !940, size: 64, align: 64, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !980, file: !897, line: 661, baseType: !987, size: 64, align: 64, offset: 256)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !992, line: 44, size: 64, align: 32, elements: !993)
!992 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !991, file: !992, line: 45, baseType: !24, size: 32, align: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !991, file: !992, line: 46, baseType: !918, size: 32, align: 32, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !980, file: !897, line: 663, baseType: !934, size: 64, align: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !980, file: !897, line: 670, baseType: !940, size: 64, align: 64, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !980, file: !897, line: 679, baseType: !979, size: 64, align: 64, offset: 448)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !980, file: !897, line: 684, baseType: !917, size: 32, align: 32, offset: 512)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !980, file: !897, line: 689, baseType: !917, size: 32, align: 32, offset: 544)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !980, file: !897, line: 696, baseType: !1002, size: 64, align: 64, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!917, !1005}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1008)
!1008 = !{!1009, !1010, !1013, !1014}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1007, file: !897, line: 449, baseType: !940, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1007, file: !897, line: 450, baseType: !1011, size: 64, align: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1007, file: !897, line: 451, baseType: !917, size: 32, align: 32, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1007, file: !897, line: 452, baseType: !940, size: 64, align: 64, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !980, file: !897, line: 703, baseType: !1016, size: 64, align: 64, offset: 640)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!917, !1019}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !980, file: !897, line: 714, baseType: !1021, size: 64, align: 64, offset: 704)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!917, !1019, !1024}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !25, line: 1499, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !25, line: 1445, size: 704, align: 64, elements: !1027)
!1027 = !{!1028, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1056, !1057, !1058, !1059}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1026, file: !25, line: 1451, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1031, line: 94, baseType: !1032)
!1031 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1031, line: 81, size: 192, align: 64, elements: !1033)
!1033 = !{!1034, !1038, !1041}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1032, file: !1031, line: 82, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1031, line: 73, baseType: !1037)
!1037 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1031, line: 73, flags: DIFlagFwdDecl)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1032, file: !1031, line: 89, baseType: !1039, size: 64, align: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !927, line: 48, baseType: !1012)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1032, file: !1031, line: 93, baseType: !917, size: 32, align: 32, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1026, file: !25, line: 1461, baseType: !926, size: 64, align: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1026, file: !25, line: 1467, baseType: !926, size: 64, align: 64, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1026, file: !25, line: 1468, baseType: !1039, size: 64, align: 64, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1026, file: !25, line: 1469, baseType: !917, size: 32, align: 32, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1026, file: !25, line: 1470, baseType: !917, size: 32, align: 32, offset: 288)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1026, file: !25, line: 1474, baseType: !917, size: 32, align: 32, offset: 320)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1026, file: !25, line: 1479, baseType: !1049, size: 64, align: 64, offset: 384)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !25, line: 1415, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !25, line: 1411, size: 128, align: 64, elements: !1052)
!1052 = !{!1053, !1054, !1055}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1051, file: !25, line: 1412, baseType: !1039, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1051, file: !25, line: 1413, baseType: !917, size: 32, align: 32, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1051, file: !25, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1026, file: !25, line: 1480, baseType: !917, size: 32, align: 32, offset: 448)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1026, file: !25, line: 1486, baseType: !926, size: 64, align: 64, offset: 512)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1026, file: !25, line: 1488, baseType: !926, size: 64, align: 64, offset: 576)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1026, file: !25, line: 1497, baseType: !926, size: 64, align: 64, offset: 640)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !980, file: !897, line: 720, baseType: !1016, size: 64, align: 64, offset: 768)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !980, file: !897, line: 730, baseType: !1062, size: 64, align: 64, offset: 832)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!917, !1019, !917, !926, !917}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !980, file: !897, line: 737, baseType: !1066, size: 64, align: 64, offset: 896)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!926, !1019, !917, !1069, !926}
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !980, file: !897, line: 744, baseType: !1016, size: 64, align: 64, offset: 960)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !980, file: !897, line: 750, baseType: !1016, size: 64, align: 64, offset: 1024)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !980, file: !897, line: 758, baseType: !1073, size: 64, align: 64, offset: 1088)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!917, !1019, !917, !926, !926, !926, !917}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !980, file: !897, line: 764, baseType: !1077, size: 64, align: 64, offset: 1152)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!917, !1019, !1080}
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !980, file: !897, line: 770, baseType: !1083, size: 64, align: 64, offset: 1216)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!917, !1019, !1086}
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !980, file: !897, line: 776, baseType: !1083, size: 64, align: 64, offset: 1280)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !931, file: !897, line: 1356, baseType: !1090, size: 64, align: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1092)
!1092 = !{!1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1112, !1116, !1120, !1127, !1222, !1223, !1224, !1225, !1226, !1227, !1231}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1091, file: !897, line: 498, baseType: !940, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1091, file: !897, line: 504, baseType: !940, size: 64, align: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1091, file: !897, line: 505, baseType: !940, size: 64, align: 64, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1091, file: !897, line: 506, baseType: !940, size: 64, align: 64, offset: 192)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1091, file: !897, line: 508, baseType: !24, size: 32, align: 32, offset: 256)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1091, file: !897, line: 509, baseType: !24, size: 32, align: 32, offset: 288)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1091, file: !897, line: 510, baseType: !24, size: 32, align: 32, offset: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1091, file: !897, line: 517, baseType: !917, size: 32, align: 32, offset: 352)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1091, file: !897, line: 523, baseType: !987, size: 64, align: 64, offset: 384)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1091, file: !897, line: 526, baseType: !934, size: 64, align: 64, offset: 448)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1091, file: !897, line: 535, baseType: !1090, size: 64, align: 64, offset: 512)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1091, file: !897, line: 539, baseType: !917, size: 32, align: 32, offset: 576)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1091, file: !897, line: 541, baseType: !1016, size: 64, align: 64, offset: 640)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1091, file: !897, line: 549, baseType: !1021, size: 64, align: 64, offset: 704)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1091, file: !897, line: 550, baseType: !1016, size: 64, align: 64, offset: 768)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1091, file: !897, line: 554, baseType: !1109, size: 64, align: 64, offset: 832)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!917, !1019, !1024, !1024, !917}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1091, file: !897, line: 563, baseType: !1113, size: 64, align: 64, offset: 896)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!917, !24, !917}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1091, file: !897, line: 565, baseType: !1117, size: 64, align: 64, offset: 960)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{null, !1019, !917, !1069, !1069}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1091, file: !897, line: 570, baseType: !1121, size: 64, align: 64, offset: 1024)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!917, !1019, !917, !947, !1124}
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1125, line: 216, baseType: !1126)
!1125 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1126 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1091, file: !897, line: 581, baseType: !1128, size: 64, align: 64, offset: 1088)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!917, !1019, !917, !1131, !918}
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1134)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1135)
!1135 = !{!1136, !1140, !1142, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1176, !1178, !1179, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1134, file: !526, line: 282, baseType: !1137, size: 512, align: 64)
!1137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 512, align: 64, elements: !1138)
!1138 = !{!1139}
!1139 = !DISubrange(count: 8)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1134, file: !526, line: 299, baseType: !1141, size: 256, align: 32, offset: 512)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 32, elements: !1138)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1134, file: !526, line: 315, baseType: !1143, size: 64, align: 64, offset: 768)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1134, file: !526, line: 326, baseType: !917, size: 32, align: 32, offset: 832)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1134, file: !526, line: 326, baseType: !917, size: 32, align: 32, offset: 864)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1134, file: !526, line: 334, baseType: !917, size: 32, align: 32, offset: 896)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1134, file: !526, line: 341, baseType: !917, size: 32, align: 32, offset: 928)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1134, file: !526, line: 346, baseType: !917, size: 32, align: 32, offset: 960)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1134, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1134, file: !526, line: 356, baseType: !1151, size: 64, align: 32, offset: 1024)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1152, line: 61, baseType: !1153)
!1152 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1152, line: 58, size: 64, align: 32, elements: !1154)
!1154 = !{!1155, !1156}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1153, file: !1152, line: 59, baseType: !917, size: 32, align: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1153, file: !1152, line: 60, baseType: !917, size: 32, align: 32, offset: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1134, file: !526, line: 361, baseType: !926, size: 64, align: 64, offset: 1088)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1134, file: !526, line: 369, baseType: !926, size: 64, align: 64, offset: 1152)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1134, file: !526, line: 377, baseType: !926, size: 64, align: 64, offset: 1216)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1134, file: !526, line: 382, baseType: !917, size: 32, align: 32, offset: 1280)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1134, file: !526, line: 386, baseType: !917, size: 32, align: 32, offset: 1312)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1134, file: !526, line: 391, baseType: !917, size: 32, align: 32, offset: 1344)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1134, file: !526, line: 396, baseType: !947, size: 64, align: 64, offset: 1408)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1134, file: !526, line: 403, baseType: !1165, size: 512, align: 64, offset: 1472)
!1165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1166, size: 512, align: 64, elements: !1138)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !927, line: 55, baseType: !1126)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1134, file: !526, line: 410, baseType: !917, size: 32, align: 32, offset: 1984)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1134, file: !526, line: 415, baseType: !917, size: 32, align: 32, offset: 2016)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1134, file: !526, line: 420, baseType: !917, size: 32, align: 32, offset: 2048)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1134, file: !526, line: 425, baseType: !917, size: 32, align: 32, offset: 2080)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1134, file: !526, line: 435, baseType: !926, size: 64, align: 64, offset: 2112)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1134, file: !526, line: 440, baseType: !917, size: 32, align: 32, offset: 2176)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1134, file: !526, line: 445, baseType: !1166, size: 64, align: 64, offset: 2240)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1134, file: !526, line: 459, baseType: !1175, size: 512, align: 64, offset: 2304)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 512, align: 64, elements: !1138)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1134, file: !526, line: 473, baseType: !1177, size: 64, align: 64, offset: 2816)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1134, file: !526, line: 477, baseType: !917, size: 32, align: 32, offset: 2880)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1134, file: !526, line: 479, baseType: !1180, size: 64, align: 64, offset: 2944)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1184)
!1184 = !{!1185, !1186, !1187, !1188, !1193}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1183, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1183, file: !526, line: 203, baseType: !1039, size: 64, align: 64, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1183, file: !526, line: 204, baseType: !917, size: 32, align: 32, offset: 128)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1183, file: !526, line: 205, baseType: !1189, size: 64, align: 64, offset: 192)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1191, line: 86, baseType: !1192)
!1191 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1192 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1191, line: 86, flags: DIFlagFwdDecl)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1183, file: !526, line: 206, baseType: !1029, size: 64, align: 64, offset: 256)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1134, file: !526, line: 480, baseType: !917, size: 32, align: 32, offset: 3008)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1134, file: !526, line: 505, baseType: !917, size: 32, align: 32, offset: 3040)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1134, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1134, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1134, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1134, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1134, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1134, file: !526, line: 532, baseType: !926, size: 64, align: 64, offset: 3264)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1134, file: !526, line: 539, baseType: !926, size: 64, align: 64, offset: 3328)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1134, file: !526, line: 547, baseType: !926, size: 64, align: 64, offset: 3392)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1134, file: !526, line: 554, baseType: !1189, size: 64, align: 64, offset: 3456)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1134, file: !526, line: 563, baseType: !917, size: 32, align: 32, offset: 3520)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1134, file: !526, line: 572, baseType: !917, size: 32, align: 32, offset: 3552)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1134, file: !526, line: 581, baseType: !917, size: 32, align: 32, offset: 3584)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1134, file: !526, line: 588, baseType: !1209, size: 64, align: 64, offset: 3648)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !927, line: 36, baseType: !1211)
!1211 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1134, file: !526, line: 593, baseType: !917, size: 32, align: 32, offset: 3712)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1134, file: !526, line: 596, baseType: !917, size: 32, align: 32, offset: 3744)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1134, file: !526, line: 599, baseType: !1029, size: 64, align: 64, offset: 3776)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1134, file: !526, line: 605, baseType: !1029, size: 64, align: 64, offset: 3840)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1134, file: !526, line: 616, baseType: !1029, size: 64, align: 64, offset: 3904)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1134, file: !526, line: 626, baseType: !1124, size: 64, align: 64, offset: 3968)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1134, file: !526, line: 627, baseType: !1124, size: 64, align: 64, offset: 4032)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1134, file: !526, line: 628, baseType: !1124, size: 64, align: 64, offset: 4096)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1134, file: !526, line: 629, baseType: !1124, size: 64, align: 64, offset: 4160)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1134, file: !526, line: 645, baseType: !1029, size: 64, align: 64, offset: 4224)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1091, file: !897, line: 587, baseType: !1077, size: 64, align: 64, offset: 1152)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1091, file: !897, line: 592, baseType: !1083, size: 64, align: 64, offset: 1216)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1091, file: !897, line: 597, baseType: !1083, size: 64, align: 64, offset: 1280)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1091, file: !897, line: 598, baseType: !24, size: 32, align: 32, offset: 1344)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1091, file: !897, line: 608, baseType: !1016, size: 64, align: 64, offset: 1408)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1091, file: !897, line: 617, baseType: !1228, size: 64, align: 64, offset: 1472)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{null, !1019}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1091, file: !897, line: 623, baseType: !1232, size: 64, align: 64, offset: 1536)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!917, !1019, !1235}
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !931, file: !897, line: 1365, baseType: !947, size: 64, align: 64, offset: 192)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !931, file: !897, line: 1379, baseType: !1239, size: 64, align: 64, offset: 256)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1241)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1242)
!1242 = !{!1243, !1244, !1245, !1246, !1247, !1248, !1249, !1253, !1254, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1270, !1271, !1275, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1293, !1294, !1295, !1296, !1300, !1301, !1302}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1241, file: !628, line: 174, baseType: !934, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1241, file: !628, line: 226, baseType: !1011, size: 64, align: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1241, file: !628, line: 227, baseType: !917, size: 32, align: 32, offset: 128)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1241, file: !628, line: 228, baseType: !1011, size: 64, align: 64, offset: 192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1241, file: !628, line: 229, baseType: !1011, size: 64, align: 64, offset: 256)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1241, file: !628, line: 233, baseType: !947, size: 64, align: 64, offset: 320)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1241, file: !628, line: 235, baseType: !1250, size: 64, align: 64, offset: 384)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!917, !947, !1039, !917}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1241, file: !628, line: 236, baseType: !1250, size: 64, align: 64, offset: 448)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1241, file: !628, line: 237, baseType: !1255, size: 64, align: 64, offset: 512)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!926, !947, !926, !917}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1241, file: !628, line: 238, baseType: !926, size: 64, align: 64, offset: 576)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1241, file: !628, line: 239, baseType: !917, size: 32, align: 32, offset: 640)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1241, file: !628, line: 240, baseType: !917, size: 32, align: 32, offset: 672)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1241, file: !628, line: 241, baseType: !917, size: 32, align: 32, offset: 704)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1241, file: !628, line: 242, baseType: !1126, size: 64, align: 64, offset: 768)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1241, file: !628, line: 243, baseType: !1011, size: 64, align: 64, offset: 832)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1241, file: !628, line: 244, baseType: !1265, size: 64, align: 64, offset: 896)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!1126, !1126, !1268, !918}
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1241, file: !628, line: 245, baseType: !917, size: 32, align: 32, offset: 960)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1241, file: !628, line: 249, baseType: !1272, size: 64, align: 64, offset: 1024)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!917, !947, !917}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1241, file: !628, line: 255, baseType: !1276, size: 64, align: 64, offset: 1088)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!926, !947, !917, !926, !917}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1241, file: !628, line: 260, baseType: !917, size: 32, align: 32, offset: 1152)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1241, file: !628, line: 266, baseType: !926, size: 64, align: 64, offset: 1216)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1241, file: !628, line: 273, baseType: !917, size: 32, align: 32, offset: 1280)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1241, file: !628, line: 279, baseType: !926, size: 64, align: 64, offset: 1344)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1241, file: !628, line: 285, baseType: !917, size: 32, align: 32, offset: 1408)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1241, file: !628, line: 291, baseType: !917, size: 32, align: 32, offset: 1440)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1241, file: !628, line: 298, baseType: !917, size: 32, align: 32, offset: 1472)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1241, file: !628, line: 304, baseType: !917, size: 32, align: 32, offset: 1504)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1241, file: !628, line: 309, baseType: !940, size: 64, align: 64, offset: 1536)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1241, file: !628, line: 314, baseType: !940, size: 64, align: 64, offset: 1600)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1241, file: !628, line: 319, baseType: !1290, size: 64, align: 64, offset: 1664)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!917, !947, !1039, !917, !627, !926}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1241, file: !628, line: 326, baseType: !917, size: 32, align: 32, offset: 1728)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1241, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1241, file: !628, line: 332, baseType: !926, size: 64, align: 64, offset: 1792)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1241, file: !628, line: 338, baseType: !1297, size: 64, align: 64, offset: 1856)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!917, !947}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1241, file: !628, line: 340, baseType: !926, size: 64, align: 64, offset: 1920)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1241, file: !628, line: 346, baseType: !1011, size: 64, align: 64, offset: 1984)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1241, file: !628, line: 351, baseType: !917, size: 32, align: 32, offset: 2048)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !931, file: !897, line: 1386, baseType: !917, size: 32, align: 32, offset: 320)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !931, file: !897, line: 1393, baseType: !918, size: 32, align: 32, offset: 352)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !931, file: !897, line: 1405, baseType: !1306, size: 64, align: 64, offset: 384)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1309)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1310)
!1310 = !{!1311, !1312, !1313, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1784, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1885, !1891, !1892, !1896, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1928, !1929, !1930, !1931, !1932, !1933}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1309, file: !897, line: 866, baseType: !917, size: 32, align: 32)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1309, file: !897, line: 872, baseType: !917, size: 32, align: 32, offset: 32)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1309, file: !897, line: 878, baseType: !1314, size: 64, align: 64, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !25, line: 3360, baseType: !1316)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !25, line: 1556, size: 8448, align: 64, elements: !1317)
!1317 = !{!1318, !1319, !1320, !1321, !1459, !1460, !1461, !1462, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1488, !1492, !1493, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1672, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1316, file: !25, line: 1561, baseType: !934, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1316, file: !25, line: 1562, baseType: !917, size: 32, align: 32, offset: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1316, file: !25, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1316, file: !25, line: 1565, baseType: !1322, size: 64, align: 64, offset: 128)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1324)
!1324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !25, line: 3468, size: 1984, align: 64, elements: !1325)
!1325 = !{!1326, !1327, !1328, !1329, !1330, !1331, !1334, !1337, !1340, !1343, !1346, !1347, !1348, !1356, !1357, !1358, !1360, !1364, !1370, !1375, !1379, !1380, !1424, !1431, !1435, !1436, !1440, !1444, !1448, !1452, !1453, !1454}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1324, file: !25, line: 3475, baseType: !940, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1324, file: !25, line: 3480, baseType: !940, size: 64, align: 64, offset: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1324, file: !25, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1324, file: !25, line: 3482, baseType: !24, size: 32, align: 32, offset: 160)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1324, file: !25, line: 3487, baseType: !917, size: 32, align: 32, offset: 192)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1324, file: !25, line: 3488, baseType: !1332, size: 64, align: 64, offset: 256)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1151)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1324, file: !25, line: 3489, baseType: !1335, size: 64, align: 64, offset: 320)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1324, file: !25, line: 3490, baseType: !1338, size: 64, align: 64, offset: 384)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1324, file: !25, line: 3491, baseType: !1341, size: 64, align: 64, offset: 448)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1324, file: !25, line: 3492, baseType: !1344, size: 64, align: 64, offset: 512)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1166)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1324, file: !25, line: 3493, baseType: !1040, size: 8, align: 8, offset: 576)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1324, file: !25, line: 3494, baseType: !934, size: 64, align: 64, offset: 640)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1324, file: !25, line: 3495, baseType: !1349, size: 64, align: 64, offset: 704)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1351)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !25, line: 3404, baseType: !1352)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !25, line: 3401, size: 128, align: 64, elements: !1353)
!1353 = !{!1354, !1355}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1352, file: !25, line: 3402, baseType: !917, size: 32, align: 32)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1352, file: !25, line: 3403, baseType: !940, size: 64, align: 64, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1324, file: !25, line: 3507, baseType: !940, size: 64, align: 64, offset: 768)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1324, file: !25, line: 3516, baseType: !917, size: 32, align: 32, offset: 832)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1324, file: !25, line: 3517, baseType: !1359, size: 64, align: 64, offset: 896)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1324, file: !25, line: 3527, baseType: !1361, size: 64, align: 64, offset: 960)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{!917, !1314}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1324, file: !25, line: 3535, baseType: !1365, size: 64, align: 64, offset: 1024)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{!917, !1314, !1368}
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1315)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1324, file: !25, line: 3541, baseType: !1371, size: 64, align: 64, offset: 1088)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1373)
!1373 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !25, line: 3461, baseType: !1374)
!1374 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !25, line: 3461, flags: DIFlagFwdDecl)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1324, file: !25, line: 3549, baseType: !1376, size: 64, align: 64, offset: 1152)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DISubroutineType(types: !1378)
!1378 = !{null, !1359}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1324, file: !25, line: 3551, baseType: !1361, size: 64, align: 64, offset: 1216)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1324, file: !25, line: 3552, baseType: !1381, size: 64, align: 64, offset: 1280)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DISubroutineType(types: !1383)
!1383 = !{!917, !1314, !1039, !917, !1384}
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !25, line: 3920, size: 256, align: 64, elements: !1387)
!1387 = !{!1388, !1391, !1393, !1394, !1395, !1423}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1386, file: !25, line: 3921, baseType: !1389, size: 16, align: 16)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !927, line: 49, baseType: !1390)
!1390 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1386, file: !25, line: 3922, baseType: !1392, size: 32, align: 32, offset: 32)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !927, line: 51, baseType: !918)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1386, file: !25, line: 3923, baseType: !1392, size: 32, align: 32, offset: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1386, file: !25, line: 3924, baseType: !918, size: 32, align: 32, offset: 96)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1386, file: !25, line: 3925, baseType: !1396, size: 64, align: 64, offset: 128)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !25, line: 3918, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !25, line: 3885, size: 1600, align: 64, elements: !1400)
!1400 = !{!1401, !1402, !1403, !1404, !1405, !1406, !1412, !1416, !1418, !1419, !1421, !1422}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1399, file: !25, line: 3886, baseType: !917, size: 32, align: 32)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1399, file: !25, line: 3887, baseType: !917, size: 32, align: 32, offset: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1399, file: !25, line: 3888, baseType: !917, size: 32, align: 32, offset: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1399, file: !25, line: 3889, baseType: !917, size: 32, align: 32, offset: 96)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1399, file: !25, line: 3890, baseType: !917, size: 32, align: 32, offset: 128)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1399, file: !25, line: 3897, baseType: !1407, size: 768, align: 64, offset: 192)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !25, line: 3858, baseType: !1408)
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !25, line: 3853, size: 768, align: 64, elements: !1409)
!1409 = !{!1410, !1411}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1408, file: !25, line: 3855, baseType: !1137, size: 512, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1408, file: !25, line: 3857, baseType: !1141, size: 256, align: 32, offset: 512)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1399, file: !25, line: 3903, baseType: !1413, size: 256, align: 64, offset: 960)
!1413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 256, align: 64, elements: !1414)
!1414 = !{!1415}
!1415 = !DISubrange(count: 4)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1399, file: !25, line: 3904, baseType: !1417, size: 128, align: 32, offset: 1216)
!1417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 128, align: 32, elements: !1414)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1399, file: !25, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1399, file: !25, line: 3908, baseType: !1420, size: 64, align: 64, offset: 1408)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1399, file: !25, line: 3915, baseType: !1420, size: 64, align: 64, offset: 1472)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1399, file: !25, line: 3917, baseType: !917, size: 32, align: 32, offset: 1536)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1386, file: !25, line: 3926, baseType: !926, size: 64, align: 64, offset: 192)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1324, file: !25, line: 3564, baseType: !1425, size: 64, align: 64, offset: 1344)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DISubroutineType(types: !1427)
!1427 = !{!917, !1314, !1024, !1428, !1430}
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1133)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1324, file: !25, line: 3566, baseType: !1432, size: 64, align: 64, offset: 1408)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DISubroutineType(types: !1434)
!1434 = !{!917, !1314, !947, !1430, !1024}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1324, file: !25, line: 3567, baseType: !1361, size: 64, align: 64, offset: 1472)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1324, file: !25, line: 3576, baseType: !1437, size: 64, align: 64, offset: 1536)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DISubroutineType(types: !1439)
!1439 = !{!917, !1314, !1428}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1324, file: !25, line: 3577, baseType: !1441, size: 64, align: 64, offset: 1600)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DISubroutineType(types: !1443)
!1443 = !{!917, !1314, !1024}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1324, file: !25, line: 3584, baseType: !1445, size: 64, align: 64, offset: 1664)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DISubroutineType(types: !1447)
!1447 = !{!917, !1314, !1132}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1324, file: !25, line: 3589, baseType: !1449, size: 64, align: 64, offset: 1728)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DISubroutineType(types: !1451)
!1451 = !{null, !1314}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1324, file: !25, line: 3594, baseType: !917, size: 32, align: 32, offset: 1792)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1324, file: !25, line: 3600, baseType: !940, size: 64, align: 64, offset: 1856)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1324, file: !25, line: 3609, baseType: !1455, size: 64, align: 64, offset: 1920)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1458)
!1458 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !25, line: 3609, flags: DIFlagFwdDecl)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1316, file: !25, line: 1566, baseType: !24, size: 32, align: 32, offset: 192)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1316, file: !25, line: 1581, baseType: !918, size: 32, align: 32, offset: 224)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1316, file: !25, line: 1583, baseType: !947, size: 64, align: 64, offset: 256)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1316, file: !25, line: 1591, baseType: !1463, size: 64, align: 64, offset: 320)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !25, line: 1532, flags: DIFlagFwdDecl)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1316, file: !25, line: 1598, baseType: !947, size: 64, align: 64, offset: 384)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1316, file: !25, line: 1606, baseType: !926, size: 64, align: 64, offset: 448)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1316, file: !25, line: 1614, baseType: !917, size: 32, align: 32, offset: 512)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1316, file: !25, line: 1622, baseType: !917, size: 32, align: 32, offset: 544)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1316, file: !25, line: 1628, baseType: !917, size: 32, align: 32, offset: 576)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1316, file: !25, line: 1636, baseType: !917, size: 32, align: 32, offset: 608)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1316, file: !25, line: 1643, baseType: !917, size: 32, align: 32, offset: 640)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1316, file: !25, line: 1657, baseType: !1039, size: 64, align: 64, offset: 704)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1316, file: !25, line: 1658, baseType: !917, size: 32, align: 32, offset: 768)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1316, file: !25, line: 1679, baseType: !1151, size: 64, align: 32, offset: 800)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1316, file: !25, line: 1688, baseType: !917, size: 32, align: 32, offset: 864)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1316, file: !25, line: 1712, baseType: !917, size: 32, align: 32, offset: 896)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1316, file: !25, line: 1729, baseType: !917, size: 32, align: 32, offset: 928)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1316, file: !25, line: 1729, baseType: !917, size: 32, align: 32, offset: 960)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1316, file: !25, line: 1744, baseType: !917, size: 32, align: 32, offset: 992)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1316, file: !25, line: 1744, baseType: !917, size: 32, align: 32, offset: 1024)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1316, file: !25, line: 1751, baseType: !917, size: 32, align: 32, offset: 1056)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1316, file: !25, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1316, file: !25, line: 1791, baseType: !1484, size: 64, align: 64, offset: 1152)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{null, !1487, !1428, !1430, !917, !917, !917}
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1316, file: !25, line: 1808, baseType: !1489, size: 64, align: 64, offset: 1216)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{!645, !1487, !1335}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1316, file: !25, line: 1816, baseType: !917, size: 32, align: 32, offset: 1280)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1316, file: !25, line: 1825, baseType: !1494, size: 32, align: 32, offset: 1312)
!1494 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1316, file: !25, line: 1830, baseType: !917, size: 32, align: 32, offset: 1344)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1316, file: !25, line: 1838, baseType: !1494, size: 32, align: 32, offset: 1376)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1316, file: !25, line: 1846, baseType: !917, size: 32, align: 32, offset: 1408)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1316, file: !25, line: 1851, baseType: !917, size: 32, align: 32, offset: 1440)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1316, file: !25, line: 1861, baseType: !1494, size: 32, align: 32, offset: 1472)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1316, file: !25, line: 1868, baseType: !1494, size: 32, align: 32, offset: 1504)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1316, file: !25, line: 1875, baseType: !1494, size: 32, align: 32, offset: 1536)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1316, file: !25, line: 1882, baseType: !1494, size: 32, align: 32, offset: 1568)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1316, file: !25, line: 1889, baseType: !1494, size: 32, align: 32, offset: 1600)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1316, file: !25, line: 1896, baseType: !1494, size: 32, align: 32, offset: 1632)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1316, file: !25, line: 1903, baseType: !1494, size: 32, align: 32, offset: 1664)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1316, file: !25, line: 1910, baseType: !917, size: 32, align: 32, offset: 1696)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1316, file: !25, line: 1915, baseType: !917, size: 32, align: 32, offset: 1728)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1316, file: !25, line: 1926, baseType: !1430, size: 64, align: 64, offset: 1792)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1316, file: !25, line: 1935, baseType: !1151, size: 64, align: 32, offset: 1856)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1316, file: !25, line: 1942, baseType: !917, size: 32, align: 32, offset: 1920)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1316, file: !25, line: 1948, baseType: !917, size: 32, align: 32, offset: 1952)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1316, file: !25, line: 1954, baseType: !917, size: 32, align: 32, offset: 1984)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1316, file: !25, line: 1960, baseType: !917, size: 32, align: 32, offset: 2016)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1316, file: !25, line: 1984, baseType: !917, size: 32, align: 32, offset: 2048)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1316, file: !25, line: 1991, baseType: !917, size: 32, align: 32, offset: 2080)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1316, file: !25, line: 1996, baseType: !917, size: 32, align: 32, offset: 2112)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1316, file: !25, line: 2004, baseType: !917, size: 32, align: 32, offset: 2144)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1316, file: !25, line: 2011, baseType: !917, size: 32, align: 32, offset: 2176)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1316, file: !25, line: 2018, baseType: !917, size: 32, align: 32, offset: 2208)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1316, file: !25, line: 2027, baseType: !917, size: 32, align: 32, offset: 2240)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1316, file: !25, line: 2034, baseType: !917, size: 32, align: 32, offset: 2272)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1316, file: !25, line: 2044, baseType: !917, size: 32, align: 32, offset: 2304)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1316, file: !25, line: 2054, baseType: !1524, size: 64, align: 64, offset: 2368)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1316, file: !25, line: 2061, baseType: !1524, size: 64, align: 64, offset: 2432)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1316, file: !25, line: 2066, baseType: !917, size: 32, align: 32, offset: 2496)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1316, file: !25, line: 2070, baseType: !917, size: 32, align: 32, offset: 2528)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1316, file: !25, line: 2078, baseType: !917, size: 32, align: 32, offset: 2560)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1316, file: !25, line: 2085, baseType: !917, size: 32, align: 32, offset: 2592)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1316, file: !25, line: 2092, baseType: !917, size: 32, align: 32, offset: 2624)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1316, file: !25, line: 2099, baseType: !917, size: 32, align: 32, offset: 2656)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1316, file: !25, line: 2106, baseType: !917, size: 32, align: 32, offset: 2688)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1316, file: !25, line: 2113, baseType: !917, size: 32, align: 32, offset: 2720)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1316, file: !25, line: 2120, baseType: !917, size: 32, align: 32, offset: 2752)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1316, file: !25, line: 2125, baseType: !917, size: 32, align: 32, offset: 2784)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1316, file: !25, line: 2133, baseType: !917, size: 32, align: 32, offset: 2816)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1316, file: !25, line: 2140, baseType: !917, size: 32, align: 32, offset: 2848)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1316, file: !25, line: 2145, baseType: !917, size: 32, align: 32, offset: 2880)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1316, file: !25, line: 2153, baseType: !917, size: 32, align: 32, offset: 2912)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1316, file: !25, line: 2158, baseType: !917, size: 32, align: 32, offset: 2944)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1316, file: !25, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1316, file: !25, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1316, file: !25, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1316, file: !25, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1316, file: !25, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1316, file: !25, line: 2203, baseType: !917, size: 32, align: 32, offset: 3136)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1316, file: !25, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1316, file: !25, line: 2212, baseType: !917, size: 32, align: 32, offset: 3200)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1316, file: !25, line: 2213, baseType: !917, size: 32, align: 32, offset: 3232)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1316, file: !25, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1316, file: !25, line: 2232, baseType: !917, size: 32, align: 32, offset: 3296)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1316, file: !25, line: 2243, baseType: !917, size: 32, align: 32, offset: 3328)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1316, file: !25, line: 2249, baseType: !917, size: 32, align: 32, offset: 3360)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1316, file: !25, line: 2256, baseType: !917, size: 32, align: 32, offset: 3392)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1316, file: !25, line: 2263, baseType: !1166, size: 64, align: 64, offset: 3456)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1316, file: !25, line: 2270, baseType: !1166, size: 64, align: 64, offset: 3520)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1316, file: !25, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1316, file: !25, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1316, file: !25, line: 2367, baseType: !1560, size: 64, align: 64, offset: 3648)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DISubroutineType(types: !1562)
!1562 = !{!917, !1487, !1132, !917}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1316, file: !25, line: 2383, baseType: !917, size: 32, align: 32, offset: 3712)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1316, file: !25, line: 2386, baseType: !1494, size: 32, align: 32, offset: 3744)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1316, file: !25, line: 2387, baseType: !1494, size: 32, align: 32, offset: 3776)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1316, file: !25, line: 2394, baseType: !917, size: 32, align: 32, offset: 3808)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1316, file: !25, line: 2401, baseType: !917, size: 32, align: 32, offset: 3840)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1316, file: !25, line: 2408, baseType: !917, size: 32, align: 32, offset: 3872)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1316, file: !25, line: 2415, baseType: !917, size: 32, align: 32, offset: 3904)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1316, file: !25, line: 2422, baseType: !917, size: 32, align: 32, offset: 3936)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1316, file: !25, line: 2423, baseType: !1572, size: 64, align: 64, offset: 3968)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !25, line: 831, baseType: !1574)
!1574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !25, line: 826, size: 128, align: 32, elements: !1575)
!1575 = !{!1576, !1577, !1578, !1579}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1574, file: !25, line: 827, baseType: !917, size: 32, align: 32)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1574, file: !25, line: 828, baseType: !917, size: 32, align: 32, offset: 32)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1574, file: !25, line: 829, baseType: !917, size: 32, align: 32, offset: 64)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1574, file: !25, line: 830, baseType: !1494, size: 32, align: 32, offset: 96)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1316, file: !25, line: 2430, baseType: !926, size: 64, align: 64, offset: 4032)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1316, file: !25, line: 2437, baseType: !926, size: 64, align: 64, offset: 4096)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1316, file: !25, line: 2444, baseType: !1494, size: 32, align: 32, offset: 4160)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1316, file: !25, line: 2451, baseType: !1494, size: 32, align: 32, offset: 4192)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1316, file: !25, line: 2458, baseType: !917, size: 32, align: 32, offset: 4224)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1316, file: !25, line: 2469, baseType: !917, size: 32, align: 32, offset: 4256)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1316, file: !25, line: 2475, baseType: !917, size: 32, align: 32, offset: 4288)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1316, file: !25, line: 2481, baseType: !917, size: 32, align: 32, offset: 4320)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1316, file: !25, line: 2485, baseType: !917, size: 32, align: 32, offset: 4352)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1316, file: !25, line: 2489, baseType: !917, size: 32, align: 32, offset: 4384)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1316, file: !25, line: 2493, baseType: !917, size: 32, align: 32, offset: 4416)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1316, file: !25, line: 2501, baseType: !917, size: 32, align: 32, offset: 4448)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1316, file: !25, line: 2506, baseType: !917, size: 32, align: 32, offset: 4480)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1316, file: !25, line: 2510, baseType: !917, size: 32, align: 32, offset: 4512)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1316, file: !25, line: 2514, baseType: !926, size: 64, align: 64, offset: 4544)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1316, file: !25, line: 2528, baseType: !1596, size: 64, align: 64, offset: 4608)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{null, !1487, !947, !917, !917}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1316, file: !25, line: 2534, baseType: !917, size: 32, align: 32, offset: 4672)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1316, file: !25, line: 2545, baseType: !917, size: 32, align: 32, offset: 4704)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1316, file: !25, line: 2547, baseType: !917, size: 32, align: 32, offset: 4736)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1316, file: !25, line: 2549, baseType: !917, size: 32, align: 32, offset: 4768)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1316, file: !25, line: 2551, baseType: !917, size: 32, align: 32, offset: 4800)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1316, file: !25, line: 2553, baseType: !917, size: 32, align: 32, offset: 4832)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1316, file: !25, line: 2555, baseType: !917, size: 32, align: 32, offset: 4864)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1316, file: !25, line: 2557, baseType: !917, size: 32, align: 32, offset: 4896)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1316, file: !25, line: 2559, baseType: !917, size: 32, align: 32, offset: 4928)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1316, file: !25, line: 2563, baseType: !917, size: 32, align: 32, offset: 4960)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1316, file: !25, line: 2571, baseType: !1420, size: 64, align: 64, offset: 4992)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1316, file: !25, line: 2579, baseType: !1420, size: 64, align: 64, offset: 5056)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1316, file: !25, line: 2586, baseType: !917, size: 32, align: 32, offset: 5120)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1316, file: !25, line: 2615, baseType: !917, size: 32, align: 32, offset: 5152)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1316, file: !25, line: 2627, baseType: !917, size: 32, align: 32, offset: 5184)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1316, file: !25, line: 2637, baseType: !917, size: 32, align: 32, offset: 5216)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1316, file: !25, line: 2681, baseType: !917, size: 32, align: 32, offset: 5248)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1316, file: !25, line: 2709, baseType: !926, size: 64, align: 64, offset: 5312)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1316, file: !25, line: 2716, baseType: !1618, size: 64, align: 64, offset: 5376)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1620)
!1620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !25, line: 3636, size: 896, align: 64, elements: !1621)
!1621 = !{!1622, !1623, !1624, !1625, !1626, !1627, !1628, !1632, !1636, !1637, !1638, !1639, !1645, !1646, !1647, !1648, !1649}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1620, file: !25, line: 3642, baseType: !940, size: 64, align: 64)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1620, file: !25, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1620, file: !25, line: 3656, baseType: !24, size: 32, align: 32, offset: 96)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1620, file: !25, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1620, file: !25, line: 3669, baseType: !917, size: 32, align: 32, offset: 160)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1620, file: !25, line: 3682, baseType: !1445, size: 64, align: 64, offset: 192)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1620, file: !25, line: 3698, baseType: !1629, size: 64, align: 64, offset: 256)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DISubroutineType(types: !1631)
!1631 = !{!917, !1314, !1268, !1392}
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1620, file: !25, line: 3712, baseType: !1633, size: 64, align: 64, offset: 320)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DISubroutineType(types: !1635)
!1635 = !{!917, !1314, !917, !1268, !1392}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1620, file: !25, line: 3726, baseType: !1629, size: 64, align: 64, offset: 384)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1620, file: !25, line: 3737, baseType: !1361, size: 64, align: 64, offset: 448)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1620, file: !25, line: 3746, baseType: !917, size: 32, align: 32, offset: 512)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1620, file: !25, line: 3757, baseType: !1640, size: 64, align: 64, offset: 576)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DISubroutineType(types: !1642)
!1642 = !{null, !1643}
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64, align: 64)
!1644 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !25, line: 3617, flags: DIFlagFwdDecl)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1620, file: !25, line: 3766, baseType: !1361, size: 64, align: 64, offset: 640)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1620, file: !25, line: 3774, baseType: !1361, size: 64, align: 64, offset: 704)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1620, file: !25, line: 3780, baseType: !917, size: 32, align: 32, offset: 768)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1620, file: !25, line: 3785, baseType: !917, size: 32, align: 32, offset: 800)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1620, file: !25, line: 3795, baseType: !1650, size: 64, align: 64, offset: 832)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DISubroutineType(types: !1652)
!1652 = !{!917, !1314, !1029}
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1316, file: !25, line: 2728, baseType: !947, size: 64, align: 64, offset: 5440)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1316, file: !25, line: 2735, baseType: !1165, size: 512, align: 64, offset: 5504)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1316, file: !25, line: 2742, baseType: !917, size: 32, align: 32, offset: 6016)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1316, file: !25, line: 2755, baseType: !917, size: 32, align: 32, offset: 6048)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1316, file: !25, line: 2776, baseType: !917, size: 32, align: 32, offset: 6080)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1316, file: !25, line: 2783, baseType: !917, size: 32, align: 32, offset: 6112)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1316, file: !25, line: 2791, baseType: !917, size: 32, align: 32, offset: 6144)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1316, file: !25, line: 2802, baseType: !1132, size: 64, align: 64, offset: 6208)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1316, file: !25, line: 2811, baseType: !917, size: 32, align: 32, offset: 6272)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1316, file: !25, line: 2821, baseType: !917, size: 32, align: 32, offset: 6304)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1316, file: !25, line: 2830, baseType: !917, size: 32, align: 32, offset: 6336)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1316, file: !25, line: 2840, baseType: !917, size: 32, align: 32, offset: 6368)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1316, file: !25, line: 2851, baseType: !1666, size: 64, align: 64, offset: 6400)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DISubroutineType(types: !1668)
!1668 = !{!917, !1487, !1669, !947, !1430, !917, !917}
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DISubroutineType(types: !1671)
!1671 = !{!917, !1487, !947}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1316, file: !25, line: 2871, baseType: !1673, size: 64, align: 64, offset: 6464)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DISubroutineType(types: !1675)
!1675 = !{!917, !1487, !1676, !947, !1430, !917}
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DISubroutineType(types: !1678)
!1678 = !{!917, !1487, !947, !917, !917}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1316, file: !25, line: 2878, baseType: !917, size: 32, align: 32, offset: 6528)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1316, file: !25, line: 2885, baseType: !917, size: 32, align: 32, offset: 6560)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1316, file: !25, line: 3005, baseType: !917, size: 32, align: 32, offset: 6592)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1316, file: !25, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1316, file: !25, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1316, file: !25, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1316, file: !25, line: 3037, baseType: !1039, size: 64, align: 64, offset: 6720)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1316, file: !25, line: 3038, baseType: !917, size: 32, align: 32, offset: 6784)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1316, file: !25, line: 3050, baseType: !1166, size: 64, align: 64, offset: 6848)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1316, file: !25, line: 3065, baseType: !917, size: 32, align: 32, offset: 6912)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1316, file: !25, line: 3083, baseType: !917, size: 32, align: 32, offset: 6944)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1316, file: !25, line: 3092, baseType: !1151, size: 64, align: 32, offset: 6976)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1316, file: !25, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1316, file: !25, line: 3106, baseType: !1151, size: 64, align: 32, offset: 7072)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1316, file: !25, line: 3113, baseType: !1694, size: 64, align: 64, offset: 7168)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1696)
!1696 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !25, line: 740, baseType: !1697)
!1697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !25, line: 712, size: 384, align: 64, elements: !1698)
!1698 = !{!1699, !1700, !1701, !1702, !1703, !1704, !1707}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1697, file: !25, line: 713, baseType: !24, size: 32, align: 32)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1697, file: !25, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1697, file: !25, line: 720, baseType: !940, size: 64, align: 64, offset: 64)
