; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--nutenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--nutenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 43, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "libavformat/nut.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952}
!941 = !DIEnumerator(name: "FLAG_KEY", value: 1)
!942 = !DIEnumerator(name: "FLAG_EOR", value: 2)
!943 = !DIEnumerator(name: "FLAG_CODED_PTS", value: 8)
!944 = !DIEnumerator(name: "FLAG_STREAM_ID", value: 16)
!945 = !DIEnumerator(name: "FLAG_SIZE_MSB", value: 32)
!946 = !DIEnumerator(name: "FLAG_CHECKSUM", value: 64)
!947 = !DIEnumerator(name: "FLAG_RESERVED", value: 128)
!948 = !DIEnumerator(name: "FLAG_SM_DATA", value: 256)
!949 = !DIEnumerator(name: "FLAG_HEADER_IDX", value: 1024)
!950 = !DIEnumerator(name: "FLAG_MATCH_TIME", value: 2048)
!951 = !DIEnumerator(name: "FLAG_CODED", value: 4096)
!952 = !DIEnumerator(name: "FLAG_INVALID", value: 8192)
!953 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVRounding", file: !954, line: 79, size: 32, align: 32, elements: !955)
!954 = !DIFile(filename: "./libavutil/mathematics.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!955 = !{!956, !957, !958, !959, !960, !961}
!956 = !DIEnumerator(name: "AV_ROUND_ZERO", value: 0)
!957 = !DIEnumerator(name: "AV_ROUND_INF", value: 1)
!958 = !DIEnumerator(name: "AV_ROUND_DOWN", value: 2)
!959 = !DIEnumerator(name: "AV_ROUND_UP", value: 3)
!960 = !DIEnumerator(name: "AV_ROUND_NEAR_INF", value: 5)
!961 = !DIEnumerator(name: "AV_ROUND_PASS_MINMAX", value: 8192)
!962 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSideDataParamChangeFlags", file: !4, line: 1522, size: 32, align: 32, elements: !963)
!963 = !{!964, !965, !966, !967}
!964 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_CHANNEL_COUNT", value: 1)
!965 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_CHANNEL_LAYOUT", value: 2)
!966 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_SAMPLE_RATE", value: 4)
!967 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_DIMENSIONS", value: 8)
!968 = !{!969, !970, !973, !976, !983, !985, !990, !982, !992}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !971, line: 40, baseType: !972)
!971 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!972 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !971, line: 48, baseType: !975)
!975 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !978, line: 221, size: 32, align: 8, elements: !979)
!978 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!979 = !{!980}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !977, file: !978, line: 221, baseType: !981, size: 32, align: 32)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !971, line: 51, baseType: !982)
!982 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !971, line: 55, baseType: !984)
!984 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !978, line: 220, size: 64, align: 8, elements: !988)
!988 = !{!989}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !987, file: !978, line: 220, baseType: !983, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!993 = !{!994, !2292, !2293, !2299}
!994 = distinct !DIGlobalVariable(name: "ff_nut_muxer", scope: !0, file: !995, line: 1216, type: !996, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_nut_muxer)
!995 = !DIFile(filename: "libavformat/nutenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !998)
!998 = !{!999, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1011, !1021, !1100, !1102, !1103, !2257, !2258, !2259, !2263, !2267, !2271, !2272, !2277, !2278, !2279, !2280, !2281, !2282, !2286}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !997, file: !919, line: 498, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1002 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !997, file: !919, line: 504, baseType: !1000, size: 64, align: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !997, file: !919, line: 505, baseType: !1000, size: 64, align: 64, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !997, file: !919, line: 506, baseType: !1000, size: 64, align: 64, offset: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !997, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !997, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !997, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !997, file: !919, line: 517, baseType: !1010, size: 32, align: 32, offset: 352)
!1010 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !997, file: !919, line: 523, baseType: !1012, size: 64, align: 64, offset: 384)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1017, line: 44, size: 64, align: 32, elements: !1018)
!1017 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1016, file: !1017, line: 45, baseType: !3, size: 32, align: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1016, file: !1017, line: 46, baseType: !982, size: 32, align: 32, offset: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !997, file: !919, line: 526, baseType: !1022, size: 64, align: 64, offset: 448)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1026)
!1026 = !{!1027, !1028, !1032, !1059, !1060, !1061, !1062, !1066, !1072, !1074, !1078}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1025, file: !486, line: 72, baseType: !1000, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1025, file: !486, line: 78, baseType: !1029, size: 64, align: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!1000, !969}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1025, file: !486, line: 85, baseType: !1033, size: 64, align: 64, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1040, !1041, !1055, !1056, !1057, !1058}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1035, file: !464, line: 247, baseType: !1000, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1035, file: !464, line: 253, baseType: !1000, size: 64, align: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1035, file: !464, line: 259, baseType: !1010, size: 32, align: 32, offset: 128)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1035, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1035, file: !464, line: 271, baseType: !1042, size: 64, align: 64, offset: 192)
!1042 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1035, file: !464, line: 265, size: 64, align: 64, elements: !1043)
!1043 = !{!1044, !1045, !1047, !1048}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1042, file: !464, line: 266, baseType: !970, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1042, file: !464, line: 267, baseType: !1046, size: 64, align: 64)
!1046 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1042, file: !464, line: 268, baseType: !1000, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1042, file: !464, line: 270, baseType: !1049, size: 64, align: 32)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1050, line: 61, baseType: !1051)
!1050 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1050, line: 58, size: 64, align: 32, elements: !1052)
!1052 = !{!1053, !1054}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1051, file: !1050, line: 59, baseType: !1010, size: 32, align: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1051, file: !1050, line: 60, baseType: !1010, size: 32, align: 32, offset: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1035, file: !464, line: 272, baseType: !1046, size: 64, align: 64, offset: 256)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1035, file: !464, line: 273, baseType: !1046, size: 64, align: 64, offset: 320)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1035, file: !464, line: 275, baseType: !1010, size: 32, align: 32, offset: 384)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1035, file: !464, line: 300, baseType: !1000, size: 64, align: 64, offset: 448)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1025, file: !486, line: 93, baseType: !1010, size: 32, align: 32, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1025, file: !486, line: 99, baseType: !1010, size: 32, align: 32, offset: 224)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1025, file: !486, line: 108, baseType: !1010, size: 32, align: 32, offset: 256)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1025, file: !486, line: 113, baseType: !1063, size: 64, align: 64, offset: 320)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!969, !969, !969}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1025, file: !486, line: 123, baseType: !1067, size: 64, align: 64, offset: 384)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!1070, !1070}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1025, file: !486, line: 130, baseType: !1073, size: 32, align: 32, offset: 448)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1025, file: !486, line: 136, baseType: !1075, size: 64, align: 64, offset: 512)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!1073, !969}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1025, file: !486, line: 142, baseType: !1079, size: 64, align: 64, offset: 576)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!1010, !1082, !969, !1000, !1010}
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1085)
!1085 = !{!1086, !1098, !1099}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1084, file: !464, line: 360, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1090, file: !464, line: 307, baseType: !1000, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1090, file: !464, line: 313, baseType: !1046, size: 64, align: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1090, file: !464, line: 313, baseType: !1046, size: 64, align: 64, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1090, file: !464, line: 318, baseType: !1046, size: 64, align: 64, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1090, file: !464, line: 318, baseType: !1046, size: 64, align: 64, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1090, file: !464, line: 323, baseType: !1010, size: 32, align: 32, offset: 320)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1084, file: !464, line: 364, baseType: !1010, size: 32, align: 32, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1084, file: !464, line: 368, baseType: !1010, size: 32, align: 32, offset: 96)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !997, file: !919, line: 535, baseType: !1101, size: 64, align: 64, offset: 512)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !997, file: !919, line: 539, baseType: !1010, size: 32, align: 32, offset: 576)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !997, file: !919, line: 541, baseType: !1104, size: 64, align: 64, offset: 640)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!1010, !1107}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1109)
!1109 = !{!1110, !1111, !1206, !1207, !1208, !1273, !1274, !1275, !2111, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2165, !2166, !2167, !2168, !2169, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2220, !2221, !2224, !2225, !2226, !2227, !2228, !2229, !2234, !2235, !2236, !2237, !2245, !2246, !2250, !2254, !2255, !2256}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1108, file: !919, line: 1342, baseType: !1022, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1108, file: !919, line: 1349, baseType: !1112, size: 64, align: 64, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1138, !1139, !1177, !1178, !1182, !1187, !1188, !1189, !1193, !1199, !1205}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1113, file: !919, line: 638, baseType: !1000, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1113, file: !919, line: 645, baseType: !1000, size: 64, align: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1113, file: !919, line: 652, baseType: !1010, size: 32, align: 32, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1113, file: !919, line: 659, baseType: !1000, size: 64, align: 64, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1113, file: !919, line: 661, baseType: !1012, size: 64, align: 64, offset: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1113, file: !919, line: 663, baseType: !1022, size: 64, align: 64, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1113, file: !919, line: 670, baseType: !1000, size: 64, align: 64, offset: 384)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1113, file: !919, line: 679, baseType: !1112, size: 64, align: 64, offset: 448)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1113, file: !919, line: 684, baseType: !1010, size: 32, align: 32, offset: 512)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1113, file: !919, line: 689, baseType: !1010, size: 32, align: 32, offset: 544)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1113, file: !919, line: 696, baseType: !1126, size: 64, align: 64, offset: 576)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!1010, !1129}
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1132)
!1132 = !{!1133, !1134, !1136, !1137}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1131, file: !919, line: 449, baseType: !1000, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1131, file: !919, line: 450, baseType: !1135, size: 64, align: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1131, file: !919, line: 451, baseType: !1010, size: 32, align: 32, offset: 128)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1131, file: !919, line: 452, baseType: !1000, size: 64, align: 64, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1113, file: !919, line: 703, baseType: !1104, size: 64, align: 64, offset: 640)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1113, file: !919, line: 714, baseType: !1140, size: 64, align: 64, offset: 704)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!1010, !1107, !1143}
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1146)
!1146 = !{!1147, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1173, !1174, !1175, !1176}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1145, file: !4, line: 1451, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1150, line: 94, baseType: !1151)
!1150 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1150, line: 81, size: 192, align: 64, elements: !1152)
!1152 = !{!1153, !1157, !1158}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1151, file: !1150, line: 82, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1150, line: 73, baseType: !1156)
!1156 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1150, line: 73, flags: DIFlagFwdDecl)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1151, file: !1150, line: 89, baseType: !973, size: 64, align: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1151, file: !1150, line: 93, baseType: !1010, size: 32, align: 32, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1145, file: !4, line: 1461, baseType: !970, size: 64, align: 64, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1145, file: !4, line: 1467, baseType: !970, size: 64, align: 64, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1145, file: !4, line: 1468, baseType: !973, size: 64, align: 64, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1145, file: !4, line: 1469, baseType: !1010, size: 32, align: 32, offset: 256)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1145, file: !4, line: 1470, baseType: !1010, size: 32, align: 32, offset: 288)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1145, file: !4, line: 1474, baseType: !1010, size: 32, align: 32, offset: 320)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1145, file: !4, line: 1479, baseType: !1166, size: 64, align: 64, offset: 384)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1169)
!1169 = !{!1170, !1171, !1172}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1168, file: !4, line: 1412, baseType: !973, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1168, file: !4, line: 1413, baseType: !1010, size: 32, align: 32, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1168, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1145, file: !4, line: 1480, baseType: !1010, size: 32, align: 32, offset: 448)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1145, file: !4, line: 1486, baseType: !970, size: 64, align: 64, offset: 512)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1145, file: !4, line: 1488, baseType: !970, size: 64, align: 64, offset: 576)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1145, file: !4, line: 1497, baseType: !970, size: 64, align: 64, offset: 640)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1113, file: !919, line: 720, baseType: !1104, size: 64, align: 64, offset: 768)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1113, file: !919, line: 730, baseType: !1179, size: 64, align: 64, offset: 832)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DISubroutineType(types: !1181)
!1181 = !{!1010, !1107, !1010, !970, !1010}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1113, file: !919, line: 737, baseType: !1183, size: 64, align: 64, offset: 896)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!970, !1107, !1010, !1186, !970}
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1113, file: !919, line: 744, baseType: !1104, size: 64, align: 64, offset: 960)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1113, file: !919, line: 750, baseType: !1104, size: 64, align: 64, offset: 1024)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1113, file: !919, line: 758, baseType: !1190, size: 64, align: 64, offset: 1088)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!1010, !1107, !1010, !970, !970, !970, !1010}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1113, file: !919, line: 764, baseType: !1194, size: 64, align: 64, offset: 1152)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!1010, !1107, !1197}
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1113, file: !919, line: 770, baseType: !1200, size: 64, align: 64, offset: 1216)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!1010, !1107, !1203}
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1113, file: !919, line: 776, baseType: !1200, size: 64, align: 64, offset: 1280)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1108, file: !919, line: 1356, baseType: !1101, size: 64, align: 64, offset: 128)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1108, file: !919, line: 1365, baseType: !969, size: 64, align: 64, offset: 192)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1108, file: !919, line: 1379, baseType: !1209, size: 64, align: 64, offset: 256)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1212)
!1212 = !{!1213, !1214, !1215, !1216, !1217, !1218, !1219, !1223, !1224, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1240, !1241, !1245, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1263, !1264, !1265, !1266, !1270, !1271, !1272}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1211, file: !537, line: 174, baseType: !1022, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1211, file: !537, line: 226, baseType: !1135, size: 64, align: 64, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1211, file: !537, line: 227, baseType: !1010, size: 32, align: 32, offset: 128)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1211, file: !537, line: 228, baseType: !1135, size: 64, align: 64, offset: 192)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1211, file: !537, line: 229, baseType: !1135, size: 64, align: 64, offset: 256)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1211, file: !537, line: 233, baseType: !969, size: 64, align: 64, offset: 320)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1211, file: !537, line: 235, baseType: !1220, size: 64, align: 64, offset: 384)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!1010, !969, !973, !1010}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1211, file: !537, line: 236, baseType: !1220, size: 64, align: 64, offset: 448)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1211, file: !537, line: 237, baseType: !1225, size: 64, align: 64, offset: 512)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!970, !969, !970, !1010}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1211, file: !537, line: 238, baseType: !970, size: 64, align: 64, offset: 576)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1211, file: !537, line: 239, baseType: !1010, size: 32, align: 32, offset: 640)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1211, file: !537, line: 240, baseType: !1010, size: 32, align: 32, offset: 672)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1211, file: !537, line: 241, baseType: !1010, size: 32, align: 32, offset: 704)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1211, file: !537, line: 242, baseType: !984, size: 64, align: 64, offset: 768)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1211, file: !537, line: 243, baseType: !1135, size: 64, align: 64, offset: 832)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1211, file: !537, line: 244, baseType: !1235, size: 64, align: 64, offset: 896)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!984, !984, !1238, !982}
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1211, file: !537, line: 245, baseType: !1010, size: 32, align: 32, offset: 960)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1211, file: !537, line: 249, baseType: !1242, size: 64, align: 64, offset: 1024)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{!1010, !969, !1010}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1211, file: !537, line: 255, baseType: !1246, size: 64, align: 64, offset: 1088)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!970, !969, !1010, !970, !1010}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1211, file: !537, line: 260, baseType: !1010, size: 32, align: 32, offset: 1152)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1211, file: !537, line: 266, baseType: !970, size: 64, align: 64, offset: 1216)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1211, file: !537, line: 273, baseType: !1010, size: 32, align: 32, offset: 1280)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1211, file: !537, line: 279, baseType: !970, size: 64, align: 64, offset: 1344)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1211, file: !537, line: 285, baseType: !1010, size: 32, align: 32, offset: 1408)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1211, file: !537, line: 291, baseType: !1010, size: 32, align: 32, offset: 1440)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1211, file: !537, line: 298, baseType: !1010, size: 32, align: 32, offset: 1472)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1211, file: !537, line: 304, baseType: !1010, size: 32, align: 32, offset: 1504)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1211, file: !537, line: 309, baseType: !1000, size: 64, align: 64, offset: 1536)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1211, file: !537, line: 314, baseType: !1000, size: 64, align: 64, offset: 1600)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1211, file: !537, line: 319, baseType: !1260, size: 64, align: 64, offset: 1664)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!1010, !969, !973, !1010, !536, !970}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1211, file: !537, line: 326, baseType: !1010, size: 32, align: 32, offset: 1728)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1211, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1211, file: !537, line: 332, baseType: !970, size: 64, align: 64, offset: 1792)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1211, file: !537, line: 338, baseType: !1267, size: 64, align: 64, offset: 1856)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!1010, !969}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1211, file: !537, line: 340, baseType: !970, size: 64, align: 64, offset: 1920)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1211, file: !537, line: 346, baseType: !1135, size: 64, align: 64, offset: 1984)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1211, file: !537, line: 351, baseType: !1010, size: 32, align: 32, offset: 2048)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1108, file: !919, line: 1386, baseType: !1010, size: 32, align: 32, offset: 320)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1108, file: !919, line: 1393, baseType: !982, size: 32, align: 32, offset: 352)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1108, file: !919, line: 1405, baseType: !1276, size: 64, align: 64, offset: 384)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1279)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1280)
!1280 = !{!1281, !1282, !1283, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !2036, !2042, !2043, !2047, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2079, !2080, !2081, !2082, !2083, !2084}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1279, file: !919, line: 866, baseType: !1010, size: 32, align: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1279, file: !919, line: 872, baseType: !1010, size: 32, align: 32, offset: 32)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1279, file: !919, line: 878, baseType: !1284, size: 64, align: 64, offset: 64)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1287)
!1287 = !{!1288, !1289, !1290, !1291, !1517, !1518, !1519, !1520, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1673, !1677, !1678, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1857, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1286, file: !4, line: 1561, baseType: !1022, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1286, file: !4, line: 1562, baseType: !1010, size: 32, align: 32, offset: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1286, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1286, file: !4, line: 1565, baseType: !1292, size: 64, align: 64, offset: 128)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1294)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1295)
!1295 = !{!1296, !1297, !1298, !1299, !1300, !1301, !1304, !1307, !1310, !1313, !1316, !1317, !1318, !1326, !1327, !1328, !1330, !1334, !1340, !1349, !1353, !1354, !1401, !1488, !1492, !1493, !1497, !1501, !1506, !1510, !1511, !1512}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1294, file: !4, line: 3475, baseType: !1000, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1294, file: !4, line: 3480, baseType: !1000, size: 64, align: 64, offset: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1294, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1294, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1294, file: !4, line: 3487, baseType: !1010, size: 32, align: 32, offset: 192)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1294, file: !4, line: 3488, baseType: !1302, size: 64, align: 64, offset: 256)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1049)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1294, file: !4, line: 3489, baseType: !1305, size: 64, align: 64, offset: 320)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1294, file: !4, line: 3490, baseType: !1308, size: 64, align: 64, offset: 384)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1294, file: !4, line: 3491, baseType: !1311, size: 64, align: 64, offset: 448)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1294, file: !4, line: 3492, baseType: !1314, size: 64, align: 64, offset: 512)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1294, file: !4, line: 3493, baseType: !974, size: 8, align: 8, offset: 576)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1294, file: !4, line: 3494, baseType: !1022, size: 64, align: 64, offset: 640)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1294, file: !4, line: 3495, baseType: !1319, size: 64, align: 64, offset: 704)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1321)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1323)
!1323 = !{!1324, !1325}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1322, file: !4, line: 3402, baseType: !1010, size: 32, align: 32)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1322, file: !4, line: 3403, baseType: !1000, size: 64, align: 64, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1294, file: !4, line: 3507, baseType: !1000, size: 64, align: 64, offset: 768)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1294, file: !4, line: 3516, baseType: !1010, size: 32, align: 32, offset: 832)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1294, file: !4, line: 3517, baseType: !1329, size: 64, align: 64, offset: 896)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1294, file: !4, line: 3527, baseType: !1331, size: 64, align: 64, offset: 960)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!1010, !1284}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1294, file: !4, line: 3535, baseType: !1335, size: 64, align: 64, offset: 1024)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DISubroutineType(types: !1337)
!1337 = !{!1010, !1284, !1338}
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1285)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1294, file: !4, line: 3541, baseType: !1341, size: 64, align: 64, offset: 1088)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1343)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1344)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1345, line: 223, size: 128, align: 64, elements: !1346)
!1345 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1346 = !{!1347, !1348}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1344, file: !1345, line: 224, baseType: !1238, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1344, file: !1345, line: 225, baseType: !1238, size: 64, align: 64, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1294, file: !4, line: 3549, baseType: !1350, size: 64, align: 64, offset: 1152)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DISubroutineType(types: !1352)
!1352 = !{null, !1329}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1294, file: !4, line: 3551, baseType: !1331, size: 64, align: 64, offset: 1216)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1294, file: !4, line: 3552, baseType: !1355, size: 64, align: 64, offset: 1280)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!1010, !1284, !973, !1010, !1358}
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1360)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1361)
!1361 = !{!1362, !1365, !1366, !1367, !1368, !1400}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1360, file: !4, line: 3921, baseType: !1363, size: 16, align: 16)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !971, line: 49, baseType: !1364)
!1364 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1360, file: !4, line: 3922, baseType: !981, size: 32, align: 32, offset: 32)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1360, file: !4, line: 3923, baseType: !981, size: 32, align: 32, offset: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1360, file: !4, line: 3924, baseType: !982, size: 32, align: 32, offset: 96)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1360, file: !4, line: 3925, baseType: !1369, size: 64, align: 64, offset: 128)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1372)
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1373)
!1373 = !{!1374, !1375, !1376, !1377, !1378, !1379, !1389, !1393, !1395, !1396, !1398, !1399}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1372, file: !4, line: 3886, baseType: !1010, size: 32, align: 32)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1372, file: !4, line: 3887, baseType: !1010, size: 32, align: 32, offset: 32)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1372, file: !4, line: 3888, baseType: !1010, size: 32, align: 32, offset: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1372, file: !4, line: 3889, baseType: !1010, size: 32, align: 32, offset: 96)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1372, file: !4, line: 3890, baseType: !1010, size: 32, align: 32, offset: 128)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1372, file: !4, line: 3897, baseType: !1380, size: 768, align: 64, offset: 192)
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1381)
!1381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1382)
!1382 = !{!1383, !1387}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1381, file: !4, line: 3855, baseType: !1384, size: 512, align: 64)
!1384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !973, size: 512, align: 64, elements: !1385)
!1385 = !{!1386}
!1386 = !DISubrange(count: 8)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1381, file: !4, line: 3857, baseType: !1388, size: 256, align: 32, offset: 512)
!1388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 256, align: 32, elements: !1385)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1372, file: !4, line: 3903, baseType: !1390, size: 256, align: 64, offset: 960)
!1390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !973, size: 256, align: 64, elements: !1391)
!1391 = !{!1392}
!1392 = !DISubrange(count: 4)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1372, file: !4, line: 3904, baseType: !1394, size: 128, align: 32, offset: 1216)
!1394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 128, align: 32, elements: !1391)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1372, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1372, file: !4, line: 3908, baseType: !1397, size: 64, align: 64, offset: 1408)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1372, file: !4, line: 3915, baseType: !1397, size: 64, align: 64, offset: 1472)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1372, file: !4, line: 3917, baseType: !1010, size: 32, align: 32, offset: 1536)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1360, file: !4, line: 3926, baseType: !970, size: 64, align: 64, offset: 192)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1294, file: !4, line: 3564, baseType: !1402, size: 64, align: 64, offset: 1344)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DISubroutineType(types: !1404)
!1404 = !{!1010, !1284, !1143, !1405, !1487}
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1407)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1408)
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1409)
!1409 = !{!1410, !1411, !1412, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1439, !1441, !1442, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1475, !1476, !1477, !1478, !1479, !1480, !1483, !1484, !1485, !1486}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1408, file: !789, line: 282, baseType: !1384, size: 512, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1408, file: !789, line: 299, baseType: !1388, size: 256, align: 32, offset: 512)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1408, file: !789, line: 315, baseType: !1413, size: 64, align: 64, offset: 768)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1408, file: !789, line: 326, baseType: !1010, size: 32, align: 32, offset: 832)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1408, file: !789, line: 326, baseType: !1010, size: 32, align: 32, offset: 864)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1408, file: !789, line: 334, baseType: !1010, size: 32, align: 32, offset: 896)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1408, file: !789, line: 341, baseType: !1010, size: 32, align: 32, offset: 928)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1408, file: !789, line: 346, baseType: !1010, size: 32, align: 32, offset: 960)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1408, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1408, file: !789, line: 356, baseType: !1049, size: 64, align: 32, offset: 1024)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1408, file: !789, line: 361, baseType: !970, size: 64, align: 64, offset: 1088)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1408, file: !789, line: 369, baseType: !970, size: 64, align: 64, offset: 1152)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1408, file: !789, line: 377, baseType: !970, size: 64, align: 64, offset: 1216)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1408, file: !789, line: 382, baseType: !1010, size: 32, align: 32, offset: 1280)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1408, file: !789, line: 386, baseType: !1010, size: 32, align: 32, offset: 1312)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1408, file: !789, line: 391, baseType: !1010, size: 32, align: 32, offset: 1344)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1408, file: !789, line: 396, baseType: !969, size: 64, align: 64, offset: 1408)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1408, file: !789, line: 403, baseType: !1429, size: 512, align: 64, offset: 1472)
!1429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !983, size: 512, align: 64, elements: !1385)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1408, file: !789, line: 410, baseType: !1010, size: 32, align: 32, offset: 1984)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1408, file: !789, line: 415, baseType: !1010, size: 32, align: 32, offset: 2016)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1408, file: !789, line: 420, baseType: !1010, size: 32, align: 32, offset: 2048)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1408, file: !789, line: 425, baseType: !1010, size: 32, align: 32, offset: 2080)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1408, file: !789, line: 435, baseType: !970, size: 64, align: 64, offset: 2112)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1408, file: !789, line: 440, baseType: !1010, size: 32, align: 32, offset: 2176)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1408, file: !789, line: 445, baseType: !983, size: 64, align: 64, offset: 2240)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1408, file: !789, line: 459, baseType: !1438, size: 512, align: 64, offset: 2304)
!1438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1148, size: 512, align: 64, elements: !1385)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1408, file: !789, line: 473, baseType: !1440, size: 64, align: 64, offset: 2816)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1408, file: !789, line: 477, baseType: !1010, size: 32, align: 32, offset: 2880)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1408, file: !789, line: 479, baseType: !1443, size: 64, align: 64, offset: 2944)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1446)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1447)
!1447 = !{!1448, !1449, !1450, !1451, !1456}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1446, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1446, file: !789, line: 203, baseType: !973, size: 64, align: 64, offset: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1446, file: !789, line: 204, baseType: !1010, size: 32, align: 32, offset: 128)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1446, file: !789, line: 205, baseType: !1452, size: 64, align: 64, offset: 192)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1454, line: 86, baseType: !1455)
!1454 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1455 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1454, line: 86, flags: DIFlagFwdDecl)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1446, file: !789, line: 206, baseType: !1148, size: 64, align: 64, offset: 256)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1408, file: !789, line: 480, baseType: !1010, size: 32, align: 32, offset: 3008)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1408, file: !789, line: 505, baseType: !1010, size: 32, align: 32, offset: 3040)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1408, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1408, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1408, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1408, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1408, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1408, file: !789, line: 532, baseType: !970, size: 64, align: 64, offset: 3264)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1408, file: !789, line: 539, baseType: !970, size: 64, align: 64, offset: 3328)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1408, file: !789, line: 547, baseType: !970, size: 64, align: 64, offset: 3392)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1408, file: !789, line: 554, baseType: !1452, size: 64, align: 64, offset: 3456)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1408, file: !789, line: 563, baseType: !1010, size: 32, align: 32, offset: 3520)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1408, file: !789, line: 572, baseType: !1010, size: 32, align: 32, offset: 3552)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1408, file: !789, line: 581, baseType: !1010, size: 32, align: 32, offset: 3584)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1408, file: !789, line: 588, baseType: !1472, size: 64, align: 64, offset: 3648)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !971, line: 36, baseType: !1474)
!1474 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1408, file: !789, line: 593, baseType: !1010, size: 32, align: 32, offset: 3712)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1408, file: !789, line: 596, baseType: !1010, size: 32, align: 32, offset: 3744)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1408, file: !789, line: 599, baseType: !1148, size: 64, align: 64, offset: 3776)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1408, file: !789, line: 605, baseType: !1148, size: 64, align: 64, offset: 3840)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1408, file: !789, line: 616, baseType: !1148, size: 64, align: 64, offset: 3904)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1408, file: !789, line: 626, baseType: !1481, size: 64, align: 64, offset: 3968)
!1481 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1482, line: 216, baseType: !984)
!1482 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1408, file: !789, line: 627, baseType: !1481, size: 64, align: 64, offset: 4032)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1408, file: !789, line: 628, baseType: !1481, size: 64, align: 64, offset: 4096)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1408, file: !789, line: 629, baseType: !1481, size: 64, align: 64, offset: 4160)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1408, file: !789, line: 645, baseType: !1148, size: 64, align: 64, offset: 4224)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1294, file: !4, line: 3566, baseType: !1489, size: 64, align: 64, offset: 1408)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{!1010, !1284, !969, !1487, !1143}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1294, file: !4, line: 3567, baseType: !1331, size: 64, align: 64, offset: 1472)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1294, file: !4, line: 3576, baseType: !1494, size: 64, align: 64, offset: 1536)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DISubroutineType(types: !1496)
!1496 = !{!1010, !1284, !1405}
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1294, file: !4, line: 3577, baseType: !1498, size: 64, align: 64, offset: 1600)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DISubroutineType(types: !1500)
!1500 = !{!1010, !1284, !1143}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1294, file: !4, line: 3584, baseType: !1502, size: 64, align: 64, offset: 1664)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{!1010, !1284, !1505}
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1294, file: !4, line: 3589, baseType: !1507, size: 64, align: 64, offset: 1728)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{null, !1284}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1294, file: !4, line: 3594, baseType: !1010, size: 32, align: 32, offset: 1792)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1294, file: !4, line: 3600, baseType: !1000, size: 64, align: 64, offset: 1856)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1294, file: !4, line: 3609, baseType: !1513, size: 64, align: 64, offset: 1920)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1516)
!1516 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1286, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1286, file: !4, line: 1581, baseType: !982, size: 32, align: 32, offset: 224)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1286, file: !4, line: 1583, baseType: !969, size: 64, align: 64, offset: 256)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1286, file: !4, line: 1591, baseType: !1521, size: 64, align: 64, offset: 320)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1345, line: 129, size: 1664, align: 64, elements: !1523)
!1523 = !{!1524, !1525, !1526, !1527, !1528, !1546, !1547, !1553, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1522, file: !1345, line: 136, baseType: !1010, size: 32, align: 32)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1522, file: !1345, line: 151, baseType: !1010, size: 32, align: 32, offset: 32)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1522, file: !1345, line: 157, baseType: !1010, size: 32, align: 32, offset: 64)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1522, file: !1345, line: 159, baseType: !1505, size: 64, align: 64, offset: 128)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1522, file: !1345, line: 161, baseType: !1529, size: 64, align: 64, offset: 192)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1345, line: 117, baseType: !1531)
!1531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1345, line: 100, size: 832, align: 64, elements: !1532)
!1532 = !{!1533, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1531, file: !1345, line: 105, baseType: !1534, size: 256, align: 64)
!1534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1535, size: 256, align: 64, elements: !1391)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1150, line: 238, baseType: !1537)
!1537 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1150, line: 238, flags: DIFlagFwdDecl)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1531, file: !1345, line: 110, baseType: !1010, size: 32, align: 32, offset: 256)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1531, file: !1345, line: 111, baseType: !1010, size: 32, align: 32, offset: 288)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1531, file: !1345, line: 111, baseType: !1010, size: 32, align: 32, offset: 320)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1531, file: !1345, line: 112, baseType: !1388, size: 256, align: 32, offset: 352)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1531, file: !1345, line: 113, baseType: !1394, size: 128, align: 32, offset: 608)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1531, file: !1345, line: 114, baseType: !1010, size: 32, align: 32, offset: 736)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1531, file: !1345, line: 115, baseType: !1010, size: 32, align: 32, offset: 768)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1531, file: !1345, line: 116, baseType: !1010, size: 32, align: 32, offset: 800)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1522, file: !1345, line: 163, baseType: !969, size: 64, align: 64, offset: 256)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1522, file: !1345, line: 165, baseType: !1548, size: 128, align: 64, offset: 320)
!1548 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1345, line: 122, baseType: !1549)
!1549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1345, line: 119, size: 128, align: 64, elements: !1550)
!1550 = !{!1551, !1552}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1549, file: !1345, line: 120, baseType: !1143, size: 64, align: 64)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1549, file: !1345, line: 121, baseType: !1505, size: 64, align: 64, offset: 64)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1522, file: !1345, line: 166, baseType: !1554, size: 128, align: 64, offset: 448)
!1554 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1345, line: 127, baseType: !1555)
!1555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1345, line: 124, size: 128, align: 64, elements: !1556)
!1556 = !{!1557, !1630}
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1555, file: !1345, line: 125, baseType: !1558, size: 64, align: 64)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64, align: 64)
!1560 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1561)
!1561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1562)
!1562 = !{!1563, !1564, !1588, !1592, !1593, !1627, !1628, !1629}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1561, file: !4, line: 5751, baseType: !1022, size: 64, align: 64)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1561, file: !4, line: 5756, baseType: !1565, size: 64, align: 64, offset: 64)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64, align: 64)
!1566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1567)
!1567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1568)
!1568 = !{!1569, !1570, !1573, !1574, !1575, !1579, !1583, !1587}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1567, file: !4, line: 5797, baseType: !1000, size: 64, align: 64)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1567, file: !4, line: 5804, baseType: !1571, size: 64, align: 64, offset: 64)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1567, file: !4, line: 5815, baseType: !1022, size: 64, align: 64, offset: 128)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1567, file: !4, line: 5825, baseType: !1010, size: 32, align: 32, offset: 192)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1567, file: !4, line: 5826, baseType: !1576, size: 64, align: 64, offset: 256)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{!1010, !1559}
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1567, file: !4, line: 5827, baseType: !1580, size: 64, align: 64, offset: 320)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DISubroutineType(types: !1582)
!1582 = !{!1010, !1559, !1143}
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1567, file: !4, line: 5828, baseType: !1584, size: 64, align: 64, offset: 384)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DISubroutineType(types: !1586)
!1586 = !{null, !1559}
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1567, file: !4, line: 5829, baseType: !1584, size: 64, align: 64, offset: 448)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1561, file: !4, line: 5762, baseType: !1589, size: 64, align: 64, offset: 128)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1591)
!1591 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1561, file: !4, line: 5768, baseType: !969, size: 64, align: 64, offset: 192)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1561, file: !4, line: 5775, baseType: !1594, size: 64, align: 64, offset: 256)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1596)
!1596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1597)
!1597 = !{!1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1596, file: !4, line: 3940, baseType: !545, size: 32, align: 32)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1596, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1596, file: !4, line: 3948, baseType: !981, size: 32, align: 32, offset: 64)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1596, file: !4, line: 3958, baseType: !973, size: 64, align: 64, offset: 128)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1596, file: !4, line: 3962, baseType: !1010, size: 32, align: 32, offset: 192)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1596, file: !4, line: 3968, baseType: !1010, size: 32, align: 32, offset: 224)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1596, file: !4, line: 3973, baseType: !970, size: 64, align: 64, offset: 256)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1596, file: !4, line: 3986, baseType: !1010, size: 32, align: 32, offset: 320)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1596, file: !4, line: 3999, baseType: !1010, size: 32, align: 32, offset: 352)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1596, file: !4, line: 4004, baseType: !1010, size: 32, align: 32, offset: 384)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1596, file: !4, line: 4005, baseType: !1010, size: 32, align: 32, offset: 416)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1596, file: !4, line: 4010, baseType: !1010, size: 32, align: 32, offset: 448)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1596, file: !4, line: 4011, baseType: !1010, size: 32, align: 32, offset: 480)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1596, file: !4, line: 4020, baseType: !1049, size: 64, align: 32, offset: 512)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1596, file: !4, line: 4025, baseType: !889, size: 32, align: 32, offset: 576)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1596, file: !4, line: 4030, baseType: !812, size: 32, align: 32, offset: 608)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1596, file: !4, line: 4031, baseType: !818, size: 32, align: 32, offset: 640)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1596, file: !4, line: 4032, baseType: !836, size: 32, align: 32, offset: 672)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1596, file: !4, line: 4033, baseType: !860, size: 32, align: 32, offset: 704)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1596, file: !4, line: 4034, baseType: !879, size: 32, align: 32, offset: 736)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1596, file: !4, line: 4039, baseType: !1010, size: 32, align: 32, offset: 768)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1596, file: !4, line: 4046, baseType: !983, size: 64, align: 64, offset: 832)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1596, file: !4, line: 4050, baseType: !1010, size: 32, align: 32, offset: 896)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1596, file: !4, line: 4054, baseType: !1010, size: 32, align: 32, offset: 928)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1596, file: !4, line: 4061, baseType: !1010, size: 32, align: 32, offset: 960)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1596, file: !4, line: 4065, baseType: !1010, size: 32, align: 32, offset: 992)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1596, file: !4, line: 4073, baseType: !1010, size: 32, align: 32, offset: 1024)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1596, file: !4, line: 4080, baseType: !1010, size: 32, align: 32, offset: 1056)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1596, file: !4, line: 4084, baseType: !1010, size: 32, align: 32, offset: 1088)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1561, file: !4, line: 5781, baseType: !1594, size: 64, align: 64, offset: 320)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1561, file: !4, line: 5787, baseType: !1049, size: 64, align: 32, offset: 384)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1561, file: !4, line: 5793, baseType: !1049, size: 64, align: 32, offset: 448)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1555, file: !1345, line: 126, baseType: !1010, size: 32, align: 32, offset: 64)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1522, file: !1345, line: 172, baseType: !1143, size: 64, align: 64, offset: 576)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1522, file: !1345, line: 177, baseType: !973, size: 64, align: 64, offset: 640)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1522, file: !1345, line: 178, baseType: !982, size: 32, align: 32, offset: 704)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1522, file: !1345, line: 180, baseType: !969, size: 64, align: 64, offset: 768)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1522, file: !1345, line: 185, baseType: !1010, size: 32, align: 32, offset: 832)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1522, file: !1345, line: 190, baseType: !969, size: 64, align: 64, offset: 896)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1522, file: !1345, line: 195, baseType: !1010, size: 32, align: 32, offset: 960)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1522, file: !1345, line: 200, baseType: !1143, size: 64, align: 64, offset: 1024)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1522, file: !1345, line: 201, baseType: !1010, size: 32, align: 32, offset: 1088)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1522, file: !1345, line: 202, baseType: !1505, size: 64, align: 64, offset: 1152)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1522, file: !1345, line: 203, baseType: !1010, size: 32, align: 32, offset: 1216)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1522, file: !1345, line: 205, baseType: !1010, size: 32, align: 32, offset: 1248)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1522, file: !1345, line: 206, baseType: !1010, size: 32, align: 32, offset: 1280)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1522, file: !1345, line: 209, baseType: !1481, size: 64, align: 64, offset: 1344)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1522, file: !1345, line: 212, baseType: !1481, size: 64, align: 64, offset: 1408)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1522, file: !1345, line: 213, baseType: !1505, size: 64, align: 64, offset: 1472)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1522, file: !1345, line: 215, baseType: !1010, size: 32, align: 32, offset: 1536)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1522, file: !1345, line: 217, baseType: !1010, size: 32, align: 32, offset: 1568)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1522, file: !1345, line: 220, baseType: !1010, size: 32, align: 32, offset: 1600)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1286, file: !4, line: 1598, baseType: !969, size: 64, align: 64, offset: 384)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1286, file: !4, line: 1606, baseType: !970, size: 64, align: 64, offset: 448)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1286, file: !4, line: 1614, baseType: !1010, size: 32, align: 32, offset: 512)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1286, file: !4, line: 1622, baseType: !1010, size: 32, align: 32, offset: 544)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1286, file: !4, line: 1628, baseType: !1010, size: 32, align: 32, offset: 576)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1286, file: !4, line: 1636, baseType: !1010, size: 32, align: 32, offset: 608)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1286, file: !4, line: 1643, baseType: !1010, size: 32, align: 32, offset: 640)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1286, file: !4, line: 1657, baseType: !973, size: 64, align: 64, offset: 704)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1286, file: !4, line: 1658, baseType: !1010, size: 32, align: 32, offset: 768)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1286, file: !4, line: 1679, baseType: !1049, size: 64, align: 32, offset: 800)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1286, file: !4, line: 1688, baseType: !1010, size: 32, align: 32, offset: 864)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1286, file: !4, line: 1712, baseType: !1010, size: 32, align: 32, offset: 896)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1286, file: !4, line: 1729, baseType: !1010, size: 32, align: 32, offset: 928)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1286, file: !4, line: 1729, baseType: !1010, size: 32, align: 32, offset: 960)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1286, file: !4, line: 1744, baseType: !1010, size: 32, align: 32, offset: 992)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1286, file: !4, line: 1744, baseType: !1010, size: 32, align: 32, offset: 1024)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1286, file: !4, line: 1751, baseType: !1010, size: 32, align: 32, offset: 1056)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1286, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1286, file: !4, line: 1791, baseType: !1669, size: 64, align: 64, offset: 1152)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DISubroutineType(types: !1671)
!1671 = !{null, !1672, !1405, !1487, !1010, !1010, !1010}
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1286, file: !4, line: 1808, baseType: !1674, size: 64, align: 64, offset: 1216)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DISubroutineType(types: !1676)
!1676 = !{!555, !1672, !1305}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1286, file: !4, line: 1816, baseType: !1010, size: 32, align: 32, offset: 1280)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1286, file: !4, line: 1825, baseType: !1679, size: 32, align: 32, offset: 1312)
!1679 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1286, file: !4, line: 1830, baseType: !1010, size: 32, align: 32, offset: 1344)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1286, file: !4, line: 1838, baseType: !1679, size: 32, align: 32, offset: 1376)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1286, file: !4, line: 1846, baseType: !1010, size: 32, align: 32, offset: 1408)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1286, file: !4, line: 1851, baseType: !1010, size: 32, align: 32, offset: 1440)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1286, file: !4, line: 1861, baseType: !1679, size: 32, align: 32, offset: 1472)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1286, file: !4, line: 1868, baseType: !1679, size: 32, align: 32, offset: 1504)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1286, file: !4, line: 1875, baseType: !1679, size: 32, align: 32, offset: 1536)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1286, file: !4, line: 1882, baseType: !1679, size: 32, align: 32, offset: 1568)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1286, file: !4, line: 1889, baseType: !1679, size: 32, align: 32, offset: 1600)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1286, file: !4, line: 1896, baseType: !1679, size: 32, align: 32, offset: 1632)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1286, file: !4, line: 1903, baseType: !1679, size: 32, align: 32, offset: 1664)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1286, file: !4, line: 1910, baseType: !1010, size: 32, align: 32, offset: 1696)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1286, file: !4, line: 1915, baseType: !1010, size: 32, align: 32, offset: 1728)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1286, file: !4, line: 1926, baseType: !1487, size: 64, align: 64, offset: 1792)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1286, file: !4, line: 1935, baseType: !1049, size: 64, align: 32, offset: 1856)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1286, file: !4, line: 1942, baseType: !1010, size: 32, align: 32, offset: 1920)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1286, file: !4, line: 1948, baseType: !1010, size: 32, align: 32, offset: 1952)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1286, file: !4, line: 1954, baseType: !1010, size: 32, align: 32, offset: 1984)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1286, file: !4, line: 1960, baseType: !1010, size: 32, align: 32, offset: 2016)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1286, file: !4, line: 1984, baseType: !1010, size: 32, align: 32, offset: 2048)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1286, file: !4, line: 1991, baseType: !1010, size: 32, align: 32, offset: 2080)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1286, file: !4, line: 1996, baseType: !1010, size: 32, align: 32, offset: 2112)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1286, file: !4, line: 2004, baseType: !1010, size: 32, align: 32, offset: 2144)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1286, file: !4, line: 2011, baseType: !1010, size: 32, align: 32, offset: 2176)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1286, file: !4, line: 2018, baseType: !1010, size: 32, align: 32, offset: 2208)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1286, file: !4, line: 2027, baseType: !1010, size: 32, align: 32, offset: 2240)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1286, file: !4, line: 2034, baseType: !1010, size: 32, align: 32, offset: 2272)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1286, file: !4, line: 2044, baseType: !1010, size: 32, align: 32, offset: 2304)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1286, file: !4, line: 2054, baseType: !1709, size: 64, align: 64, offset: 2368)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1286, file: !4, line: 2061, baseType: !1709, size: 64, align: 64, offset: 2432)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1286, file: !4, line: 2066, baseType: !1010, size: 32, align: 32, offset: 2496)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1286, file: !4, line: 2070, baseType: !1010, size: 32, align: 32, offset: 2528)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1286, file: !4, line: 2078, baseType: !1010, size: 32, align: 32, offset: 2560)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1286, file: !4, line: 2085, baseType: !1010, size: 32, align: 32, offset: 2592)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1286, file: !4, line: 2092, baseType: !1010, size: 32, align: 32, offset: 2624)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1286, file: !4, line: 2099, baseType: !1010, size: 32, align: 32, offset: 2656)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1286, file: !4, line: 2106, baseType: !1010, size: 32, align: 32, offset: 2688)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1286, file: !4, line: 2113, baseType: !1010, size: 32, align: 32, offset: 2720)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1286, file: !4, line: 2120, baseType: !1010, size: 32, align: 32, offset: 2752)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1286, file: !4, line: 2125, baseType: !1010, size: 32, align: 32, offset: 2784)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1286, file: !4, line: 2133, baseType: !1010, size: 32, align: 32, offset: 2816)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1286, file: !4, line: 2140, baseType: !1010, size: 32, align: 32, offset: 2848)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1286, file: !4, line: 2145, baseType: !1010, size: 32, align: 32, offset: 2880)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1286, file: !4, line: 2153, baseType: !1010, size: 32, align: 32, offset: 2912)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1286, file: !4, line: 2158, baseType: !1010, size: 32, align: 32, offset: 2944)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1286, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1286, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1286, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1286, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1286, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1286, file: !4, line: 2203, baseType: !1010, size: 32, align: 32, offset: 3136)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1286, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1286, file: !4, line: 2212, baseType: !1010, size: 32, align: 32, offset: 3200)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1286, file: !4, line: 2213, baseType: !1010, size: 32, align: 32, offset: 3232)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1286, file: !4, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1286, file: !4, line: 2232, baseType: !1010, size: 32, align: 32, offset: 3296)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1286, file: !4, line: 2243, baseType: !1010, size: 32, align: 32, offset: 3328)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1286, file: !4, line: 2249, baseType: !1010, size: 32, align: 32, offset: 3360)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1286, file: !4, line: 2256, baseType: !1010, size: 32, align: 32, offset: 3392)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1286, file: !4, line: 2263, baseType: !983, size: 64, align: 64, offset: 3456)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1286, file: !4, line: 2270, baseType: !983, size: 64, align: 64, offset: 3520)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1286, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1286, file: !4, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1286, file: !4, line: 2367, baseType: !1745, size: 64, align: 64, offset: 3648)
!1745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1746, size: 64, align: 64)
!1746 = !DISubroutineType(types: !1747)
!1747 = !{!1010, !1672, !1505, !1010}
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1286, file: !4, line: 2383, baseType: !1010, size: 32, align: 32, offset: 3712)
