; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--unix.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--unix.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }

!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !4, line: 221, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!6 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!7 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!8 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!9 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!10 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!11 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!12 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!13 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!14 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!15 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!16 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!17 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!18 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!19 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!20 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!21 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!22 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!23 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!24 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 29, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!28 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!29 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!30 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!31 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!32 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!33 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!34 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!35 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!36 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!37 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!38 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!39 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!40 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!41 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!42 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!43 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!44 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!45 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !47, line: 24, size: 32, align: 32, elements: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57}
!49 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!50 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!51 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!52 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!53 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!54 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!55 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!56 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!57 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !59, line: 175, size: 32, align: 32, elements: !60)
!59 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79}
!61 = !DIEnumerator(name: "MSG_OOB", value: 1)
!62 = !DIEnumerator(name: "MSG_PEEK", value: 2)
!63 = !DIEnumerator(name: "MSG_DONTROUTE", value: 4)
!64 = !DIEnumerator(name: "MSG_CTRUNC", value: 8)
!65 = !DIEnumerator(name: "MSG_PROXY", value: 16)
!66 = !DIEnumerator(name: "MSG_TRUNC", value: 32)
!67 = !DIEnumerator(name: "MSG_DONTWAIT", value: 64)
!68 = !DIEnumerator(name: "MSG_EOR", value: 128)
!69 = !DIEnumerator(name: "MSG_WAITALL", value: 256)
!70 = !DIEnumerator(name: "MSG_FIN", value: 512)
!71 = !DIEnumerator(name: "MSG_SYN", value: 1024)
!72 = !DIEnumerator(name: "MSG_CONFIRM", value: 2048)
!73 = !DIEnumerator(name: "MSG_RST", value: 4096)
!74 = !DIEnumerator(name: "MSG_ERRQUEUE", value: 8192)
!75 = !DIEnumerator(name: "MSG_NOSIGNAL", value: 16384)
!76 = !DIEnumerator(name: "MSG_MORE", value: 32768)
!77 = !DIEnumerator(name: "MSG_WAITFORONE", value: 65536)
!78 = !DIEnumerator(name: "MSG_FASTOPEN", value: 536870912)
!79 = !DIEnumerator(name: "MSG_CMSG_CLOEXEC", value: 1073741824)
!80 = !{!81, !93, !94}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !59, line: 153, size: 128, align: 16, elements: !83)
!83 = !{!84, !88}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !82, file: !59, line: 155, baseType: !85, size: 16, align: 16)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !86, line: 28, baseType: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!87 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !82, file: !59, line: 156, baseType: !89, size: 112, align: 8, offset: 16)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 112, align: 8, elements: !91)
!90 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!91 = !{!92}
!92 = !DISubrange(count: 14)
!93 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!94 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!95 = !{!96, !304, !305}
!96 = distinct !DIGlobalVariable(name: "ff_unix_protocol", scope: !0, file: !97, line: 148, type: !98, isLocal: false, isDefinition: true, variable: { i8*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }* @ff_unix_protocol)
!97 = !DIFile(filename: "libavformat/unix.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !100, line: 100, baseType: !101)
!100 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !100, line: 54, size: 1600, align: 64, elements: !102)
!102 = !{!103, !106, !221, !230, !235, !239, !245, !251, !255, !256, !260, !264, !265, !271, !272, !273, !274, !275, !276, !277, !278, !297, !298, !299, !303}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !101, file: !100, line: 55, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !101, file: !100, line: 56, baseType: !107, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!93, !110, !104, !93}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !100, line: 52, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !100, line: 38, size: 768, align: 64, elements: !113)
!113 = !{!114, !197, !200, !201, !203, !204, !205, !206, !207, !217, !218, !219, !220}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !112, file: !100, line: 39, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !119)
!119 = !{!120, !121, !126, !156, !157, !158, !159, !163, !169, !171, !175}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !118, file: !26, line: 72, baseType: !104, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !118, file: !26, line: 78, baseType: !122, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!104, !125}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !118, file: !26, line: 85, baseType: !127, size: 64, align: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !152, !153, !154, !155}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !129, file: !4, line: 247, baseType: !104, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !129, file: !4, line: 253, baseType: !104, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !129, file: !4, line: 259, baseType: !93, size: 32, align: 32, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !129, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !129, file: !4, line: 271, baseType: !136, size: 64, align: 64, offset: 192)
!136 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !4, line: 265, size: 64, align: 64, elements: !137)
!137 = !{!138, !142, !144, !145}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !136, file: !4, line: 266, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !140, line: 40, baseType: !141)
!140 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!141 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !136, file: !4, line: 267, baseType: !143, size: 64, align: 64)
!143 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !136, file: !4, line: 268, baseType: !104, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !136, file: !4, line: 270, baseType: !146, size: 64, align: 32)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !147, line: 61, baseType: !148)
!147 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !147, line: 58, size: 64, align: 32, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !148, file: !147, line: 59, baseType: !93, size: 32, align: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !148, file: !147, line: 60, baseType: !93, size: 32, align: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !129, file: !4, line: 272, baseType: !143, size: 64, align: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !129, file: !4, line: 273, baseType: !143, size: 64, align: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !129, file: !4, line: 275, baseType: !93, size: 32, align: 32, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !129, file: !4, line: 300, baseType: !104, size: 64, align: 64, offset: 448)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !118, file: !26, line: 93, baseType: !93, size: 32, align: 32, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !118, file: !26, line: 99, baseType: !93, size: 32, align: 32, offset: 224)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !118, file: !26, line: 108, baseType: !93, size: 32, align: 32, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !118, file: !26, line: 113, baseType: !160, size: 64, align: 64, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!125, !125, !125}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !118, file: !26, line: 123, baseType: !164, size: 64, align: 64, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!167, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !118, file: !26, line: 130, baseType: !170, size: 32, align: 32, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !118, file: !26, line: 136, baseType: !172, size: 64, align: 64, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!170, !125}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !118, file: !26, line: 142, baseType: !176, size: 64, align: 64, offset: 576)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!93, !179, !125, !104, !93}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !182)
!182 = !{!183, !195, !196}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !181, file: !4, line: 360, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !188)
!188 = !{!189, !190, !191, !192, !193, !194}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !187, file: !4, line: 307, baseType: !104, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !187, file: !4, line: 313, baseType: !143, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !187, file: !4, line: 313, baseType: !143, size: 64, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !187, file: !4, line: 318, baseType: !143, size: 64, align: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !187, file: !4, line: 318, baseType: !143, size: 64, align: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !187, file: !4, line: 323, baseType: !93, size: 32, align: 32, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !181, file: !4, line: 364, baseType: !93, size: 32, align: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !181, file: !4, line: 368, baseType: !93, size: 32, align: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !112, file: !100, line: 40, baseType: !198, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !112, file: !100, line: 41, baseType: !125, size: 64, align: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !112, file: !100, line: 42, baseType: !202, size: 64, align: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !112, file: !100, line: 43, baseType: !93, size: 32, align: 32, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !112, file: !100, line: 44, baseType: !93, size: 32, align: 32, offset: 288)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !112, file: !100, line: 45, baseType: !93, size: 32, align: 32, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !112, file: !100, line: 46, baseType: !93, size: 32, align: 32, offset: 352)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !112, file: !100, line: 47, baseType: !208, size: 128, align: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !209, line: 61, baseType: !210)
!209 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !209, line: 58, size: 128, align: 64, elements: !211)
!211 = !{!212, !216}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !210, file: !209, line: 59, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!93, !125}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !210, file: !209, line: 60, baseType: !125, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !112, file: !100, line: 48, baseType: !139, size: 64, align: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !112, file: !100, line: 49, baseType: !104, size: 64, align: 64, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !112, file: !100, line: 50, baseType: !104, size: 64, align: 64, offset: 640)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !112, file: !100, line: 51, baseType: !93, size: 32, align: 32, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !101, file: !100, line: 62, baseType: !222, size: 64, align: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!93, !110, !104, !93, !225}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !228, line: 86, baseType: !229)
!228 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !228, line: 86, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !101, file: !100, line: 63, baseType: !231, size: 64, align: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!93, !110, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !101, file: !100, line: 64, baseType: !236, size: 64, align: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!93, !110}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !101, file: !100, line: 78, baseType: !240, size: 64, align: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!93, !110, !243, !93}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !101, file: !100, line: 79, baseType: !246, size: 64, align: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!93, !110, !249, !93}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !101, file: !100, line: 80, baseType: !252, size: 64, align: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!139, !110, !139, !93}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !101, file: !100, line: 81, baseType: !236, size: 64, align: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !101, file: !100, line: 82, baseType: !257, size: 64, align: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!93, !110, !93}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !101, file: !100, line: 83, baseType: !261, size: 64, align: 64, offset: 640)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!139, !110, !93, !139, !93}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !101, file: !100, line: 85, baseType: !236, size: 64, align: 64, offset: 704)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !101, file: !100, line: 86, baseType: !266, size: 64, align: 64, offset: 768)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!93, !110, !269, !270}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !101, file: !100, line: 88, baseType: !236, size: 64, align: 64, offset: 832)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !101, file: !100, line: 89, baseType: !257, size: 64, align: 64, offset: 896)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !101, file: !100, line: 90, baseType: !93, size: 32, align: 32, offset: 960)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !101, file: !100, line: 91, baseType: !115, size: 64, align: 64, offset: 1024)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !101, file: !100, line: 92, baseType: !93, size: 32, align: 32, offset: 1088)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !101, file: !100, line: 93, baseType: !257, size: 64, align: 64, offset: 1152)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !101, file: !100, line: 94, baseType: !236, size: 64, align: 64, offset: 1216)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !101, file: !100, line: 95, baseType: !279, size: 64, align: 64, offset: 1280)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!93, !110, !282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !209, line: 101, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !209, line: 86, size: 576, align: 64, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295, !296}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !285, file: !209, line: 87, baseType: !202, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !285, file: !209, line: 88, baseType: !93, size: 32, align: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !285, file: !209, line: 89, baseType: !93, size: 32, align: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !285, file: !209, line: 91, baseType: !139, size: 64, align: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !285, file: !209, line: 92, baseType: !139, size: 64, align: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !285, file: !209, line: 94, baseType: !139, size: 64, align: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !285, file: !209, line: 96, baseType: !139, size: 64, align: 64, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !285, file: !209, line: 98, baseType: !139, size: 64, align: 64, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !285, file: !209, line: 99, baseType: !139, size: 64, align: 64, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !285, file: !209, line: 100, baseType: !139, size: 64, align: 64, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !101, file: !100, line: 96, baseType: !236, size: 64, align: 64, offset: 1344)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !101, file: !100, line: 97, baseType: !236, size: 64, align: 64, offset: 1408)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !101, file: !100, line: 98, baseType: !300, size: 64, align: 64, offset: 1472)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!93, !110, !110}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !101, file: !100, line: 99, baseType: !104, size: 64, align: 64, offset: 1536)
!304 = distinct !DIGlobalVariable(name: "unix_class", scope: !0, file: !97, line: 56, type: !116, isLocal: true, isDefinition: true, variable: %struct.AVClass* @unix_class)
!305 = distinct !DIGlobalVariable(name: "unix_options", scope: !0, file: !97, line: 46, type: !306, isLocal: true, isDefinition: true, variable: [7 x %struct.AVOption]* @unix_options)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 3584, align: 64, elements: !309)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !129)
!309 = !{!310}
!310 = !DISubrange(count: 7)
!311 = !{i32 2, !"Dwarf Version", i32 4}
!312 = !{i32 2, !"Debug Info Version", i32 3}
!313 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!314 = distinct !DISubprogram(name: "unix_open", scope: !97, file: !97, line: 63, type: !108, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !315)
!315 = !{}
!316 = !DILocalVariable(name: "h", arg: 1, scope: !314, file: !97, line: 63, type: !110)
!317 = !DIExpression()
!318 = !DILocation(line: 63, column: 34, scope: !314)
!319 = !DILocalVariable(name: "filename", arg: 2, scope: !314, file: !97, line: 63, type: !104)
!320 = !DILocation(line: 63, column: 49, scope: !314)
!321 = !DILocalVariable(name: "flags", arg: 3, scope: !314, file: !97, line: 63, type: !93)
!322 = !DILocation(line: 63, column: 63, scope: !314)
!323 = !DILocalVariable(name: "s", scope: !314, file: !97, line: 65, type: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "UnixContext", file: !97, line: 42, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnixContext", file: !97, line: 35, size: 1088, align: 64, elements: !327)
!327 = !{!328, !329, !338, !339, !340, !341}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !326, file: !97, line: 36, baseType: !115, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !326, file: !97, line: 37, baseType: !330, size: 880, align: 16, offset: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !331, line: 29, size: 880, align: 16, elements: !332)
!331 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/un.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!332 = !{!333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !330, file: !331, line: 31, baseType: !85, size: 16, align: 16)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !330, file: !331, line: 32, baseType: !335, size: 864, align: 8, offset: 16)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 864, align: 8, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 108)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !326, file: !97, line: 38, baseType: !93, size: 32, align: 32, offset: 960)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !326, file: !97, line: 39, baseType: !93, size: 32, align: 32, offset: 992)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !326, file: !97, line: 40, baseType: !93, size: 32, align: 32, offset: 1024)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !326, file: !97, line: 41, baseType: !93, size: 32, align: 32, offset: 1056)
!342 = !DILocation(line: 65, column: 18, scope: !314)
!343 = !DILocation(line: 65, column: 22, scope: !314)
!344 = !DILocation(line: 65, column: 25, scope: !314)
!345 = !DILocalVariable(name: "fd", scope: !314, file: !97, line: 66, type: !93)
!346 = !DILocation(line: 66, column: 9, scope: !314)
!347 = !DILocalVariable(name: "ret", scope: !314, file: !97, line: 66, type: !93)
!348 = !DILocation(line: 66, column: 13, scope: !314)
!349 = !DILocation(line: 68, column: 17, scope: !314)
!350 = !DILocation(line: 68, column: 5, scope: !314)
!351 = !DILocation(line: 69, column: 5, scope: !314)
!352 = !DILocation(line: 69, column: 8, scope: !314)
!353 = !DILocation(line: 69, column: 13, scope: !314)
!354 = !DILocation(line: 69, column: 24, scope: !314)
!355 = !DILocation(line: 70, column: 16, scope: !314)
!356 = !DILocation(line: 70, column: 19, scope: !314)
!357 = !DILocation(line: 70, column: 24, scope: !314)
!358 = !DILocation(line: 70, column: 34, scope: !314)
!359 = !DILocation(line: 70, column: 5, scope: !314)
!360 = !DILocation(line: 72, column: 33, scope: !361)
!361 = distinct !DILexicalBlock(scope: !314, file: !97, line: 72, column: 9)
!362 = !DILocation(line: 72, column: 36, scope: !361)
!363 = !DILocation(line: 72, column: 15, scope: !361)
!364 = !DILocation(line: 72, column: 13, scope: !361)
!365 = !DILocation(line: 72, column: 46, scope: !361)
!366 = !DILocation(line: 72, column: 9, scope: !314)
!367 = !DILocation(line: 73, column: 17, scope: !361)
!368 = !DILocation(line: 73, column: 16, scope: !361)
!369 = !DILocation(line: 73, column: 9, scope: !361)
!370 = !DILocation(line: 75, column: 9, scope: !371)
!371 = distinct !DILexicalBlock(scope: !314, file: !97, line: 75, column: 9)
!372 = !DILocation(line: 75, column: 12, scope: !371)
!373 = !DILocation(line: 75, column: 20, scope: !371)
!374 = !DILocation(line: 75, column: 24, scope: !371)
!375 = !DILocation(line: 75, column: 27, scope: !376)
!376 = !DILexicalBlockFile(scope: !371, file: !97, discriminator: 1)
!377 = !DILocation(line: 75, column: 30, scope: !376)
!378 = !DILocation(line: 75, column: 9, scope: !376)
!379 = !DILocation(line: 76, column: 22, scope: !371)
!380 = !DILocation(line: 76, column: 25, scope: !371)
!381 = !DILocation(line: 76, column: 36, scope: !371)
!382 = !DILocation(line: 76, column: 9, scope: !371)
!383 = !DILocation(line: 76, column: 12, scope: !371)
!384 = !DILocation(line: 76, column: 20, scope: !371)
!385 = !DILocation(line: 78, column: 9, scope: !386)
!386 = distinct !DILexicalBlock(scope: !314, file: !97, line: 78, column: 9)
!387 = !DILocation(line: 78, column: 12, scope: !386)
!388 = !DILocation(line: 78, column: 9, scope: !314)
!389 = !DILocation(line: 79, column: 30, scope: !390)
!390 = distinct !DILexicalBlock(scope: !386, file: !97, line: 78, column: 20)
!391 = !DILocation(line: 79, column: 54, scope: !390)
!392 = !DILocation(line: 79, column: 57, scope: !390)
!393 = !DILocation(line: 79, column: 34, scope: !390)
!394 = !DILocation(line: 80, column: 47, scope: !390)
!395 = !DILocation(line: 80, column: 50, scope: !390)
!396 = !DILocation(line: 80, column: 59, scope: !390)
!397 = !DILocation(line: 79, column: 15, scope: !390)
!398 = !DILocation(line: 79, column: 13, scope: !390)
!399 = !DILocation(line: 81, column: 13, scope: !400)
!400 = distinct !DILexicalBlock(scope: !390, file: !97, line: 81, column: 13)
!401 = !DILocation(line: 81, column: 17, scope: !400)
!402 = !DILocation(line: 81, column: 13, scope: !390)
!403 = !DILocation(line: 82, column: 13, scope: !400)
!404 = !DILocation(line: 83, column: 14, scope: !390)
!405 = !DILocation(line: 83, column: 12, scope: !390)
!406 = !DILocation(line: 84, column: 5, scope: !390)
!407 = !DILocation(line: 85, column: 33, scope: !408)
!408 = distinct !DILexicalBlock(scope: !386, file: !97, line: 84, column: 12)
!409 = !DILocation(line: 85, column: 57, scope: !408)
