; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--mms.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--mms.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MMSContext = type { %struct.URLContext*, %struct.MMSStream*, i8*, [512 x i8], [65536 x i8], i8*, i32, i8*, i32, i32, i32, i32, i32, i32 }
%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!10 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!11 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!12 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!13 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!14 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!15 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!16 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!17 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!18 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!19 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!20 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!21 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!22 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!23 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!24 = !{!25, !26, !27, !28, !37, !43}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!26 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!27 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !31, line: 220, size: 64, align: 8, elements: !32)
!31 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !30, file: !31, line: 220, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !35, line: 55, baseType: !36)
!35 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!36 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !31, line: 221, size: 32, align: 8, elements: !40)
!40 = !{!41}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !39, file: !31, line: 221, baseType: !42, size: 32, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !35, line: 51, baseType: !27)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !31, line: 222, size: 16, align: 8, elements: !46)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !45, file: !31, line: 222, baseType: !48, size: 16, align: 16)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !35, line: 49, baseType: !49)
!49 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!50 = !{i32 2, !"Dwarf Version", i32 4}
!51 = !{i32 2, !"Debug Info Version", i32 3}
!52 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!53 = distinct !DISubprogram(name: "ff_mms_read_header", scope: !54, file: !54, line: 29, type: !55, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !255)
!54 = !DIFile(filename: "libavformat/mms.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!55 = !DISubroutineType(types: !56)
!56 = !{!26, !57, !235, !254}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "MMSContext", file: !59, line: 58, baseType: !60)
!59 = !DIFile(filename: "libavformat/mms.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MMSContext", file: !59, line: 30, size: 528960, align: 64, elements: !61)
!61 = !{!62, !228, !234, !237, !241, !245, !246, !247, !248, !249, !250, !251, !252, !253}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "mms_hd", scope: !60, file: !59, line: 31, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !65, line: 52, baseType: !66)
!65 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !65, line: 38, size: 768, align: 64, elements: !67)
!67 = !{!68, !112, !209, !210, !211, !212, !213, !214, !215, !224, !225, !226, !227}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !66, file: !65, line: 39, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !73)
!73 = !{!74, !78, !82, !86, !87, !88, !89, !93, !99, !101, !105}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !72, file: !4, line: 72, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !72, file: !4, line: 78, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!75, !25}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !72, file: !4, line: 85, baseType: !83, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !72, file: !4, line: 93, baseType: !26, size: 32, align: 32, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !72, file: !4, line: 99, baseType: !26, size: 32, align: 32, offset: 224)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !72, file: !4, line: 108, baseType: !26, size: 32, align: 32, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !72, file: !4, line: 113, baseType: !90, size: 64, align: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!25, !25, !25}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !72, file: !4, line: 123, baseType: !94, size: 64, align: 64, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!97, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !72, file: !4, line: 130, baseType: !100, size: 32, align: 32, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !72, file: !4, line: 136, baseType: !102, size: 64, align: 64, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!100, !25}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !72, file: !4, line: 142, baseType: !106, size: 64, align: 64, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!26, !109, !25, !75, !26}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !66, file: !65, line: 40, baseType: !113, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !65, line: 54, size: 1600, align: 64, elements: !116)
!116 = !{!117, !118, !122, !131, !136, !140, !146, !152, !158, !159, !163, !167, !168, !174, !175, !176, !177, !178, !179, !180, !181, !202, !203, !204, !208}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !115, file: !65, line: 55, baseType: !75, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !115, file: !65, line: 56, baseType: !119, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!26, !63, !75, !26}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !115, file: !65, line: 62, baseType: !123, size: 64, align: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!26, !63, !75, !26, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !129, line: 86, baseType: !130)
!129 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !129, line: 86, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !115, file: !65, line: 63, baseType: !132, size: 64, align: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!26, !63, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !115, file: !65, line: 64, baseType: !137, size: 64, align: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!26, !63}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !115, file: !65, line: 78, baseType: !141, size: 64, align: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!26, !63, !144, !26}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !115, file: !65, line: 79, baseType: !147, size: 64, align: 64, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!26, !63, !150, !26}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !115, file: !65, line: 80, baseType: !153, size: 64, align: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!156, !63, !156, !26}
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !35, line: 40, baseType: !157)
!157 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !115, file: !65, line: 81, baseType: !137, size: 64, align: 64, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !115, file: !65, line: 82, baseType: !160, size: 64, align: 64, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!26, !63, !26}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !115, file: !65, line: 83, baseType: !164, size: 64, align: 64, offset: 640)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!156, !63, !26, !156, !26}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !115, file: !65, line: 85, baseType: !137, size: 64, align: 64, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !115, file: !65, line: 86, baseType: !169, size: 64, align: 64, offset: 768)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!26, !63, !172, !173}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !115, file: !65, line: 88, baseType: !137, size: 64, align: 64, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !115, file: !65, line: 89, baseType: !160, size: 64, align: 64, offset: 896)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !115, file: !65, line: 90, baseType: !26, size: 32, align: 32, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !115, file: !65, line: 91, baseType: !69, size: 64, align: 64, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !115, file: !65, line: 92, baseType: !26, size: 32, align: 32, offset: 1088)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !115, file: !65, line: 93, baseType: !160, size: 64, align: 64, offset: 1152)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !115, file: !65, line: 94, baseType: !137, size: 64, align: 64, offset: 1216)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !115, file: !65, line: 95, baseType: !182, size: 64, align: 64, offset: 1280)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!26, !63, !185}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !188, line: 101, baseType: !189)
!188 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !188, line: 86, size: 576, align: 64, elements: !190)
!190 = !{!191, !193, !194, !195, !196, !197, !198, !199, !200, !201}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !189, file: !188, line: 87, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !189, file: !188, line: 88, baseType: !26, size: 32, align: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !189, file: !188, line: 89, baseType: !26, size: 32, align: 32, offset: 96)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !189, file: !188, line: 91, baseType: !156, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !189, file: !188, line: 92, baseType: !156, size: 64, align: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !189, file: !188, line: 94, baseType: !156, size: 64, align: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !189, file: !188, line: 96, baseType: !156, size: 64, align: 64, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !189, file: !188, line: 98, baseType: !156, size: 64, align: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !189, file: !188, line: 99, baseType: !156, size: 64, align: 64, offset: 448)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !189, file: !188, line: 100, baseType: !156, size: 64, align: 64, offset: 512)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !115, file: !65, line: 96, baseType: !137, size: 64, align: 64, offset: 1344)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !115, file: !65, line: 97, baseType: !137, size: 64, align: 64, offset: 1408)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !115, file: !65, line: 98, baseType: !205, size: 64, align: 64, offset: 1472)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!26, !63, !63}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !115, file: !65, line: 99, baseType: !75, size: 64, align: 64, offset: 1536)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !66, file: !65, line: 41, baseType: !25, size: 64, align: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !66, file: !65, line: 42, baseType: !192, size: 64, align: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !66, file: !65, line: 43, baseType: !26, size: 32, align: 32, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !66, file: !65, line: 44, baseType: !26, size: 32, align: 32, offset: 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !66, file: !65, line: 45, baseType: !26, size: 32, align: 32, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !66, file: !65, line: 46, baseType: !26, size: 32, align: 32, offset: 352)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !66, file: !65, line: 47, baseType: !216, size: 128, align: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !188, line: 61, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !188, line: 58, size: 128, align: 64, elements: !218)
!218 = !{!219, !223}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !217, file: !188, line: 59, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!26, !25}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !217, file: !188, line: 60, baseType: !25, size: 64, align: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !66, file: !65, line: 48, baseType: !156, size: 64, align: 64, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !66, file: !65, line: 49, baseType: !75, size: 64, align: 64, offset: 576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !66, file: !65, line: 50, baseType: !75, size: 64, align: 64, offset: 640)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !66, file: !65, line: 51, baseType: !26, size: 32, align: 32, offset: 704)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !60, file: !59, line: 32, baseType: !229, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "MMSStream", file: !59, line: 28, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MMSStream", file: !59, line: 26, size: 32, align: 32, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !231, file: !59, line: 27, baseType: !26, size: 32, align: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "write_out_ptr", scope: !60, file: !59, line: 36, baseType: !235, size: 64, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !35, line: 48, baseType: !145)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "out_buffer", scope: !60, file: !59, line: 37, baseType: !238, size: 4096, align: 8, offset: 192)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 4096, align: 8, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 512)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer", scope: !60, file: !59, line: 42, baseType: !242, size: 524288, align: 8, offset: 4288)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 524288, align: 8, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 65536)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "read_in_ptr", scope: !60, file: !59, line: 43, baseType: !235, size: 64, align: 64, offset: 528576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_in_len", scope: !60, file: !59, line: 44, baseType: !26, size: 32, align: 32, offset: 528640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "asf_header", scope: !60, file: !59, line: 49, baseType: !235, size: 64, align: 64, offset: 528704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "asf_header_size", scope: !60, file: !59, line: 50, baseType: !26, size: 32, align: 32, offset: 528768)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "header_parsed", scope: !60, file: !59, line: 51, baseType: !26, size: 32, align: 32, offset: 528800)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "asf_packet_len", scope: !60, file: !59, line: 52, baseType: !26, size: 32, align: 32, offset: 528832)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "asf_header_read_size", scope: !60, file: !59, line: 53, baseType: !26, size: 32, align: 32, offset: 528864)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "stream_num", scope: !60, file: !59, line: 56, baseType: !26, size: 32, align: 32, offset: 528896)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams_allocated", scope: !60, file: !59, line: 57, baseType: !27, size: 32, align: 32, offset: 528928)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!255 = !{}
!256 = !DILocalVariable(name: "mms", arg: 1, scope: !53, file: !54, line: 29, type: !57)
!257 = !DIExpression()
!258 = !DILocation(line: 29, column: 36, scope: !53)
!259 = !DILocalVariable(name: "buf", arg: 2, scope: !53, file: !54, line: 29, type: !235)
!260 = !DILocation(line: 29, column: 50, scope: !53)
!261 = !DILocalVariable(name: "size", arg: 3, scope: !53, file: !54, line: 29, type: !254)
!262 = !DILocation(line: 29, column: 65, scope: !53)
!263 = !DILocalVariable(name: "pos", scope: !53, file: !54, line: 31, type: !192)
!264 = !DILocation(line: 31, column: 11, scope: !53)
!265 = !DILocalVariable(name: "size_to_copy", scope: !53, file: !54, line: 32, type: !26)
!266 = !DILocation(line: 32, column: 9, scope: !53)
!267 = !DILocalVariable(name: "remaining_size", scope: !53, file: !54, line: 33, type: !26)
!268 = !DILocation(line: 33, column: 9, scope: !53)
!269 = !DILocation(line: 33, column: 26, scope: !53)
!270 = !DILocation(line: 33, column: 31, scope: !53)
!271 = !DILocation(line: 33, column: 49, scope: !53)
!272 = !DILocation(line: 33, column: 54, scope: !53)
!273 = !DILocation(line: 33, column: 47, scope: !53)
!274 = !DILocation(line: 34, column: 22, scope: !53)
!275 = !DILocation(line: 34, column: 31, scope: !53)
!276 = !DILocation(line: 34, column: 28, scope: !53)
!277 = !DILocation(line: 34, column: 21, scope: !53)
!278 = !DILocation(line: 34, column: 50, scope: !279)
!279 = !DILexicalBlockFile(scope: !53, file: !54, discriminator: 1)
!280 = !DILocation(line: 34, column: 21, scope: !279)
!281 = !DILocation(line: 34, column: 69, scope: !282)
!282 = !DILexicalBlockFile(scope: !53, file: !54, discriminator: 2)
!283 = !DILocation(line: 34, column: 21, scope: !282)
!284 = !DILocation(line: 34, column: 21, scope: !285)
!285 = !DILexicalBlockFile(scope: !53, file: !54, discriminator: 3)
!286 = !DILocation(line: 34, column: 18, scope: !285)
!287 = !DILocation(line: 35, column: 11, scope: !53)
!288 = !DILocation(line: 35, column: 16, scope: !53)
!289 = !DILocation(line: 35, column: 29, scope: !53)
!290 = !DILocation(line: 35, column: 34, scope: !53)
!291 = !DILocation(line: 35, column: 27, scope: !53)
!292 = !DILocation(line: 35, column: 9, scope: !53)
!293 = !DILocation(line: 36, column: 12, scope: !53)
!294 = !DILocation(line: 36, column: 17, scope: !53)
!295 = !DILocation(line: 36, column: 22, scope: !53)
!296 = !DILocation(line: 36, column: 5, scope: !53)
!297 = !DILocation(line: 37, column: 9, scope: !298)
!298 = distinct !DILexicalBlock(scope: !53, file: !54, line: 37, column: 9)
!299 = !DILocation(line: 37, column: 14, scope: !298)
!300 = !DILocation(line: 37, column: 38, scope: !298)
!301 = !DILocation(line: 37, column: 43, scope: !298)
!302 = !DILocation(line: 37, column: 35, scope: !298)
!303 = !DILocation(line: 37, column: 9, scope: !53)
!304 = !DILocation(line: 38, column: 19, scope: !305)
!305 = distinct !DILexicalBlock(scope: !298, file: !54, line: 37, column: 60)
!306 = !DILocation(line: 38, column: 24, scope: !305)
!307 = !DILocation(line: 38, column: 18, scope: !305)
!308 = !DILocation(line: 38, column: 9, scope: !305)
!309 = !DILocation(line: 39, column: 5, scope: !305)
!310 = !DILocation(line: 40, column: 34, scope: !53)
!311 = !DILocation(line: 40, column: 5, scope: !53)
!312 = !DILocation(line: 40, column: 10, scope: !53)
!313 = !DILocation(line: 40, column: 31, scope: !53)
!314 = !DILocation(line: 41, column: 12, scope: !53)
!315 = !DILocation(line: 41, column: 5, scope: !53)
!316 = distinct !DISubprogram(name: "ff_mms_read_data", scope: !54, file: !54, line: 44, type: !55, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !255)
!317 = !DILocalVariable(name: "mms", arg: 1, scope: !316, file: !54, line: 44, type: !57)
