; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtsp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!983 = !DIEnumerator(name: "RTSP_STATUS_UNAUTHORIZED", value: 401)
!984 = !DIEnumerator(name: "RTSP_STATUS_PAYMENT_REQUIRED", value: 402)
!985 = !DIEnumerator(name: "RTSP_STATUS_FORBIDDEN", value: 403)
!986 = !DIEnumerator(name: "RTSP_STATUS_NOT_FOUND", value: 404)
!987 = !DIEnumerator(name: "RTSP_STATUS_METHOD", value: 405)
!988 = !DIEnumerator(name: "RTSP_STATUS_NOT_ACCEPTABLE", value: 406)
!989 = !DIEnumerator(name: "RTSP_STATUS_PROXY_AUTH_REQUIRED", value: 407)
!990 = !DIEnumerator(name: "RTSP_STATUS_REQ_TIME_OUT", value: 408)
!991 = !DIEnumerator(name: "RTSP_STATUS_GONE", value: 410)
!992 = !DIEnumerator(name: "RTSP_STATUS_LENGTH_REQUIRED", value: 411)
!993 = !DIEnumerator(name: "RTSP_STATUS_PRECONDITION_FAILED", value: 412)
!994 = !DIEnumerator(name: "RTSP_STATUS_REQ_ENTITY_2LARGE", value: 413)
!995 = !DIEnumerator(name: "RTSP_STATUS_REQ_URI_2LARGE", value: 414)
!996 = !DIEnumerator(name: "RTSP_STATUS_UNSUPPORTED_MTYPE", value: 415)
!997 = !DIEnumerator(name: "RTSP_STATUS_PARAM_NOT_UNDERSTOOD", value: 451)
!998 = !DIEnumerator(name: "RTSP_STATUS_CONFERENCE_NOT_FOUND", value: 452)
!999 = !DIEnumerator(name: "RTSP_STATUS_BANDWIDTH", value: 453)
!1000 = !DIEnumerator(name: "RTSP_STATUS_SESSION", value: 454)
!1001 = !DIEnumerator(name: "RTSP_STATUS_STATE", value: 455)
!1002 = !DIEnumerator(name: "RTSP_STATUS_INVALID_HEADER_FIELD", value: 456)
!1003 = !DIEnumerator(name: "RTSP_STATUS_INVALID_RANGE", value: 457)
!1004 = !DIEnumerator(name: "RTSP_STATUS_RONLY_PARAMETER", value: 458)
!1005 = !DIEnumerator(name: "RTSP_STATUS_AGGREGATE", value: 459)
!1006 = !DIEnumerator(name: "RTSP_STATUS_ONLY_AGGREGATE", value: 460)
!1007 = !DIEnumerator(name: "RTSP_STATUS_TRANSPORT", value: 461)
!1008 = !DIEnumerator(name: "RTSP_STATUS_UNREACHABLE", value: 462)
!1009 = !DIEnumerator(name: "RTSP_STATUS_INTERNAL", value: 500)
!1010 = !DIEnumerator(name: "RTSP_STATUS_NOT_IMPLEMENTED", value: 501)
!1011 = !DIEnumerator(name: "RTSP_STATUS_BAD_GATEWAY", value: 502)
!1012 = !DIEnumerator(name: "RTSP_STATUS_SERVICE", value: 503)
!1013 = !DIEnumerator(name: "RTSP_STATUS_GATEWAY_TIME_OUT", value: 504)
!1014 = !DIEnumerator(name: "RTSP_STATUS_VERSION", value: 505)
!1015 = !DIEnumerator(name: "RTSP_STATUS_UNSUPPORTED_OPTION", value: 551)
!1016 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HTTPAuthType", file: !1017, line: 28, size: 32, align: 32, elements: !1018)
!1017 = !DIFile(filename: "libavformat/httpauth.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1018 = !{!1019, !1020, !1021}
!1019 = !DIEnumerator(name: "HTTP_AUTH_NONE", value: 0)
!1020 = !DIEnumerator(name: "HTTP_AUTH_BASIC", value: 1)
!1021 = !DIEnumerator(name: "HTTP_AUTH_DIGEST", value: 2)
!1022 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RTCPType", file: !1023, line: 92, size: 32, align: 32, elements: !1024)
!1023 = !DIFile(filename: "libavformat/rtp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039}
!1025 = !DIEnumerator(name: "RTCP_FIR", value: 192)
!1026 = !DIEnumerator(name: "RTCP_NACK", value: 193)
!1027 = !DIEnumerator(name: "RTCP_SMPTETC", value: 194)
!1028 = !DIEnumerator(name: "RTCP_IJ", value: 195)
!1029 = !DIEnumerator(name: "RTCP_SR", value: 200)
!1030 = !DIEnumerator(name: "RTCP_RR", value: 201)
!1031 = !DIEnumerator(name: "RTCP_SDES", value: 202)
!1032 = !DIEnumerator(name: "RTCP_BYE", value: 203)
!1033 = !DIEnumerator(name: "RTCP_APP", value: 204)
!1034 = !DIEnumerator(name: "RTCP_RTPFB", value: 205)
!1035 = !DIEnumerator(name: "RTCP_PSFB", value: 206)
!1036 = !DIEnumerator(name: "RTCP_XR", value: 207)
!1037 = !DIEnumerator(name: "RTCP_AVB", value: 208)
!1038 = !DIEnumerator(name: "RTCP_RSI", value: 209)
!1039 = !DIEnumerator(name: "RTCP_TOKEN", value: 210)
!1040 = !{!1041, !1042, !1043, !2292, !1069, !1151, !2298, !1075, !1317, !2309}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !919, line: 1947, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1046)
!1046 = !{!1047, !1133, !1246, !1388, !1389, !1454, !1455, !1456, !2149, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2203, !2204, !2205, !2206, !2207, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2258, !2259, !2262, !2263, !2264, !2265, !2266, !2267, !2269, !2270, !2271, !2272, !2280, !2281, !2285, !2289, !2290, !2291}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1045, file: !919, line: 1342, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !1052)
!1052 = !{!1053, !1057, !1061, !1092, !1093, !1094, !1095, !1099, !1105, !1107, !1111}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1051, file: !26, line: 72, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1056)
!1056 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1051, file: !26, line: 78, baseType: !1058, size: 64, align: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!1054, !1041}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1051, file: !26, line: 85, baseType: !1062, size: 64, align: 64, offset: 128)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1065)
!1065 = !{!1066, !1067, !1068, !1070, !1071, !1088, !1089, !1090, !1091}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1064, file: !4, line: 247, baseType: !1054, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1064, file: !4, line: 253, baseType: !1054, size: 64, align: 64, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1064, file: !4, line: 259, baseType: !1069, size: 32, align: 32, offset: 128)
!1069 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1064, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1064, file: !4, line: 271, baseType: !1072, size: 64, align: 64, offset: 192)
!1072 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1064, file: !4, line: 265, size: 64, align: 64, elements: !1073)
!1073 = !{!1074, !1078, !1080, !1081}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1072, file: !4, line: 266, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1076, line: 197, baseType: !1077)
!1076 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1077 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1072, file: !4, line: 267, baseType: !1079, size: 64, align: 64)
!1079 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1072, file: !4, line: 268, baseType: !1054, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1072, file: !4, line: 270, baseType: !1082, size: 64, align: 32)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1083, line: 61, baseType: !1084)
!1083 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1083, line: 58, size: 64, align: 32, elements: !1085)
!1085 = !{!1086, !1087}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1084, file: !1083, line: 59, baseType: !1069, size: 32, align: 32)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1084, file: !1083, line: 60, baseType: !1069, size: 32, align: 32, offset: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1064, file: !4, line: 272, baseType: !1079, size: 64, align: 64, offset: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1064, file: !4, line: 273, baseType: !1079, size: 64, align: 64, offset: 320)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1064, file: !4, line: 275, baseType: !1069, size: 32, align: 32, offset: 384)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1064, file: !4, line: 300, baseType: !1054, size: 64, align: 64, offset: 448)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1051, file: !26, line: 93, baseType: !1069, size: 32, align: 32, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1051, file: !26, line: 99, baseType: !1069, size: 32, align: 32, offset: 224)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1051, file: !26, line: 108, baseType: !1069, size: 32, align: 32, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1051, file: !26, line: 113, baseType: !1096, size: 64, align: 64, offset: 320)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!1041, !1041, !1041}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1051, file: !26, line: 123, baseType: !1100, size: 64, align: 64, offset: 384)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!1103, !1103}
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1051, file: !26, line: 130, baseType: !1106, size: 32, align: 32, offset: 448)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1051, file: !26, line: 136, baseType: !1108, size: 64, align: 64, offset: 512)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!1106, !1041}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1051, file: !26, line: 142, baseType: !1112, size: 64, align: 64, offset: 576)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!1069, !1115, !1041, !1054, !1069}
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1118)
!1118 = !{!1119, !1131, !1132}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1117, file: !4, line: 360, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1124)
!1124 = !{!1125, !1126, !1127, !1128, !1129, !1130}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1123, file: !4, line: 307, baseType: !1054, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1123, file: !4, line: 313, baseType: !1079, size: 64, align: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1123, file: !4, line: 313, baseType: !1079, size: 64, align: 64, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1123, file: !4, line: 318, baseType: !1079, size: 64, align: 64, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1123, file: !4, line: 318, baseType: !1079, size: 64, align: 64, offset: 256)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1123, file: !4, line: 323, baseType: !1069, size: 32, align: 32, offset: 320)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1117, file: !4, line: 364, baseType: !1069, size: 32, align: 32, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1117, file: !4, line: 368, baseType: !1069, size: 32, align: 32, offset: 96)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1045, file: !919, line: 1349, baseType: !1134, size: 64, align: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1136)
!1136 = !{!1137, !1138, !1139, !1140, !1141, !1152, !1153, !1154, !1155, !1156, !1157, !1171, !1176, !1217, !1218, !1222, !1227, !1228, !1229, !1233, !1239, !1245}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1135, file: !919, line: 638, baseType: !1054, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1135, file: !919, line: 645, baseType: !1054, size: 64, align: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1135, file: !919, line: 652, baseType: !1069, size: 32, align: 32, offset: 128)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1135, file: !919, line: 659, baseType: !1054, size: 64, align: 64, offset: 192)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1135, file: !919, line: 661, baseType: !1142, size: 64, align: 64, offset: 256)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1147, line: 44, size: 64, align: 32, elements: !1148)
!1147 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1148 = !{!1149, !1150}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1146, file: !1147, line: 45, baseType: !46, size: 32, align: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1146, file: !1147, line: 46, baseType: !1151, size: 32, align: 32, offset: 32)
!1151 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1135, file: !919, line: 663, baseType: !1048, size: 64, align: 64, offset: 320)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1135, file: !919, line: 670, baseType: !1054, size: 64, align: 64, offset: 384)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1135, file: !919, line: 679, baseType: !1134, size: 64, align: 64, offset: 448)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1135, file: !919, line: 684, baseType: !1069, size: 32, align: 32, offset: 512)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1135, file: !919, line: 689, baseType: !1069, size: 32, align: 32, offset: 544)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1135, file: !919, line: 696, baseType: !1158, size: 64, align: 64, offset: 576)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!1069, !1161}
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1164)
!1164 = !{!1165, !1166, !1169, !1170}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1163, file: !919, line: 449, baseType: !1054, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1163, file: !919, line: 450, baseType: !1167, size: 64, align: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1163, file: !919, line: 451, baseType: !1069, size: 32, align: 32, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1163, file: !919, line: 452, baseType: !1054, size: 64, align: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1135, file: !919, line: 703, baseType: !1172, size: 64, align: 64, offset: 640)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!1069, !1175}
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1135, file: !919, line: 714, baseType: !1177, size: 64, align: 64, offset: 704)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!1069, !1175, !1180}
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !47, line: 1499, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !47, line: 1445, size: 704, align: 64, elements: !1183)
!1183 = !{!1184, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1213, !1214, !1215, !1216}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1182, file: !47, line: 1451, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1187, line: 94, baseType: !1188)
!1187 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1187, line: 81, size: 192, align: 64, elements: !1189)
!1189 = !{!1190, !1194, !1198}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1188, file: !1187, line: 82, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1187, line: 73, baseType: !1193)
!1193 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1187, line: 73, flags: DIFlagFwdDecl)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1188, file: !1187, line: 89, baseType: !1195, size: 64, align: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1197, line: 48, baseType: !1168)
!1197 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1188, file: !1187, line: 93, baseType: !1069, size: 32, align: 32, offset: 128)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1182, file: !47, line: 1461, baseType: !1075, size: 64, align: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1182, file: !47, line: 1467, baseType: !1075, size: 64, align: 64, offset: 128)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1182, file: !47, line: 1468, baseType: !1195, size: 64, align: 64, offset: 192)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1182, file: !47, line: 1469, baseType: !1069, size: 32, align: 32, offset: 256)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1182, file: !47, line: 1470, baseType: !1069, size: 32, align: 32, offset: 288)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1182, file: !47, line: 1474, baseType: !1069, size: 32, align: 32, offset: 320)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1182, file: !47, line: 1479, baseType: !1206, size: 64, align: 64, offset: 384)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !47, line: 1415, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !47, line: 1411, size: 128, align: 64, elements: !1209)
!1209 = !{!1210, !1211, !1212}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1208, file: !47, line: 1412, baseType: !1195, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1208, file: !47, line: 1413, baseType: !1069, size: 32, align: 32, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1208, file: !47, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1182, file: !47, line: 1480, baseType: !1069, size: 32, align: 32, offset: 448)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1182, file: !47, line: 1486, baseType: !1075, size: 64, align: 64, offset: 512)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1182, file: !47, line: 1488, baseType: !1075, size: 64, align: 64, offset: 576)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1182, file: !47, line: 1497, baseType: !1075, size: 64, align: 64, offset: 640)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1135, file: !919, line: 720, baseType: !1172, size: 64, align: 64, offset: 768)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1135, file: !919, line: 730, baseType: !1219, size: 64, align: 64, offset: 832)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!1069, !1175, !1069, !1075, !1069}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1135, file: !919, line: 737, baseType: !1223, size: 64, align: 64, offset: 896)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!1075, !1175, !1069, !1226, !1075}
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1135, file: !919, line: 744, baseType: !1172, size: 64, align: 64, offset: 960)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1135, file: !919, line: 750, baseType: !1172, size: 64, align: 64, offset: 1024)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1135, file: !919, line: 758, baseType: !1230, size: 64, align: 64, offset: 1088)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!1069, !1175, !1069, !1075, !1075, !1075, !1069}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1135, file: !919, line: 764, baseType: !1234, size: 64, align: 64, offset: 1152)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!1069, !1175, !1237}
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1135, file: !919, line: 770, baseType: !1240, size: 64, align: 64, offset: 1216)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!1069, !1175, !1243}
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1135, file: !919, line: 776, baseType: !1240, size: 64, align: 64, offset: 1280)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1045, file: !919, line: 1356, baseType: !1247, size: 64, align: 64, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1249)
!1249 = !{!1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1269, !1273, !1277, !1284, !1373, !1374, !1375, !1376, !1377, !1378, !1382}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1248, file: !919, line: 498, baseType: !1054, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1248, file: !919, line: 504, baseType: !1054, size: 64, align: 64, offset: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1248, file: !919, line: 505, baseType: !1054, size: 64, align: 64, offset: 128)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1248, file: !919, line: 506, baseType: !1054, size: 64, align: 64, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1248, file: !919, line: 508, baseType: !46, size: 32, align: 32, offset: 256)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1248, file: !919, line: 509, baseType: !46, size: 32, align: 32, offset: 288)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1248, file: !919, line: 510, baseType: !46, size: 32, align: 32, offset: 320)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1248, file: !919, line: 517, baseType: !1069, size: 32, align: 32, offset: 352)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1248, file: !919, line: 523, baseType: !1142, size: 64, align: 64, offset: 384)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1248, file: !919, line: 526, baseType: !1048, size: 64, align: 64, offset: 448)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1248, file: !919, line: 535, baseType: !1247, size: 64, align: 64, offset: 512)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1248, file: !919, line: 539, baseType: !1069, size: 32, align: 32, offset: 576)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1248, file: !919, line: 541, baseType: !1172, size: 64, align: 64, offset: 640)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1248, file: !919, line: 549, baseType: !1177, size: 64, align: 64, offset: 704)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1248, file: !919, line: 550, baseType: !1172, size: 64, align: 64, offset: 768)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1248, file: !919, line: 554, baseType: !1266, size: 64, align: 64, offset: 832)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!1069, !1175, !1180, !1180, !1069}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1248, file: !919, line: 563, baseType: !1270, size: 64, align: 64, offset: 896)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!1069, !46, !1069}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1248, file: !919, line: 565, baseType: !1274, size: 64, align: 64, offset: 960)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{null, !1175, !1069, !1226, !1226}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1248, file: !919, line: 570, baseType: !1278, size: 64, align: 64, offset: 1024)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!1069, !1175, !1069, !1041, !1281}
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1282, line: 216, baseType: !1283)
!1282 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1283 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1248, file: !919, line: 581, baseType: !1285, size: 64, align: 64, offset: 1088)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!1069, !1175, !1069, !1288, !1151}
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1291)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1292)
!1292 = !{!1293, !1297, !1299, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1327, !1329, !1330, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1291, file: !548, line: 282, baseType: !1294, size: 512, align: 64)
!1294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1195, size: 512, align: 64, elements: !1295)
!1295 = !{!1296}
!1296 = !DISubrange(count: 8)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1291, file: !548, line: 299, baseType: !1298, size: 256, align: 32, offset: 512)
!1298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1069, size: 256, align: 32, elements: !1295)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1291, file: !548, line: 315, baseType: !1300, size: 64, align: 64, offset: 768)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1291, file: !548, line: 326, baseType: !1069, size: 32, align: 32, offset: 832)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1291, file: !548, line: 326, baseType: !1069, size: 32, align: 32, offset: 864)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1291, file: !548, line: 334, baseType: !1069, size: 32, align: 32, offset: 896)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1291, file: !548, line: 341, baseType: !1069, size: 32, align: 32, offset: 928)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1291, file: !548, line: 346, baseType: !1069, size: 32, align: 32, offset: 960)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1291, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1291, file: !548, line: 356, baseType: !1082, size: 64, align: 32, offset: 1024)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1291, file: !548, line: 361, baseType: !1075, size: 64, align: 64, offset: 1088)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1291, file: !548, line: 369, baseType: !1075, size: 64, align: 64, offset: 1152)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1291, file: !548, line: 377, baseType: !1075, size: 64, align: 64, offset: 1216)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1291, file: !548, line: 382, baseType: !1069, size: 32, align: 32, offset: 1280)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1291, file: !548, line: 386, baseType: !1069, size: 32, align: 32, offset: 1312)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1291, file: !548, line: 391, baseType: !1069, size: 32, align: 32, offset: 1344)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1291, file: !548, line: 396, baseType: !1041, size: 64, align: 64, offset: 1408)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1291, file: !548, line: 403, baseType: !1316, size: 512, align: 64, offset: 1472)
!1316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1317, size: 512, align: 64, elements: !1295)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1197, line: 55, baseType: !1283)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1291, file: !548, line: 410, baseType: !1069, size: 32, align: 32, offset: 1984)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1291, file: !548, line: 415, baseType: !1069, size: 32, align: 32, offset: 2016)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1291, file: !548, line: 420, baseType: !1069, size: 32, align: 32, offset: 2048)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1291, file: !548, line: 425, baseType: !1069, size: 32, align: 32, offset: 2080)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1291, file: !548, line: 435, baseType: !1075, size: 64, align: 64, offset: 2112)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1291, file: !548, line: 440, baseType: !1069, size: 32, align: 32, offset: 2176)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1291, file: !548, line: 445, baseType: !1317, size: 64, align: 64, offset: 2240)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1291, file: !548, line: 459, baseType: !1326, size: 512, align: 64, offset: 2304)
!1326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1185, size: 512, align: 64, elements: !1295)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1291, file: !548, line: 473, baseType: !1328, size: 64, align: 64, offset: 2816)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1291, file: !548, line: 477, baseType: !1069, size: 32, align: 32, offset: 2880)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1291, file: !548, line: 479, baseType: !1331, size: 64, align: 64, offset: 2944)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1334)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1335)
!1335 = !{!1336, !1337, !1338, !1339, !1344}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1334, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1334, file: !548, line: 203, baseType: !1195, size: 64, align: 64, offset: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1334, file: !548, line: 204, baseType: !1069, size: 32, align: 32, offset: 128)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1334, file: !548, line: 205, baseType: !1340, size: 64, align: 64, offset: 192)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1342, line: 86, baseType: !1343)
!1342 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1343 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1342, line: 86, flags: DIFlagFwdDecl)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1334, file: !548, line: 206, baseType: !1185, size: 64, align: 64, offset: 256)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1291, file: !548, line: 480, baseType: !1069, size: 32, align: 32, offset: 3008)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1291, file: !548, line: 505, baseType: !1069, size: 32, align: 32, offset: 3040)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1291, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1291, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1291, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1291, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1291, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1291, file: !548, line: 532, baseType: !1075, size: 64, align: 64, offset: 3264)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1291, file: !548, line: 539, baseType: !1075, size: 64, align: 64, offset: 3328)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1291, file: !548, line: 547, baseType: !1075, size: 64, align: 64, offset: 3392)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1291, file: !548, line: 554, baseType: !1340, size: 64, align: 64, offset: 3456)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1291, file: !548, line: 563, baseType: !1069, size: 32, align: 32, offset: 3520)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1291, file: !548, line: 572, baseType: !1069, size: 32, align: 32, offset: 3552)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1291, file: !548, line: 581, baseType: !1069, size: 32, align: 32, offset: 3584)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1291, file: !548, line: 588, baseType: !1360, size: 64, align: 64, offset: 3648)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1076, line: 194, baseType: !1362)
!1362 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1291, file: !548, line: 593, baseType: !1069, size: 32, align: 32, offset: 3712)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1291, file: !548, line: 596, baseType: !1069, size: 32, align: 32, offset: 3744)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1291, file: !548, line: 599, baseType: !1185, size: 64, align: 64, offset: 3776)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1291, file: !548, line: 605, baseType: !1185, size: 64, align: 64, offset: 3840)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1291, file: !548, line: 616, baseType: !1185, size: 64, align: 64, offset: 3904)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1291, file: !548, line: 626, baseType: !1281, size: 64, align: 64, offset: 3968)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1291, file: !548, line: 627, baseType: !1281, size: 64, align: 64, offset: 4032)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1291, file: !548, line: 628, baseType: !1281, size: 64, align: 64, offset: 4096)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1291, file: !548, line: 629, baseType: !1281, size: 64, align: 64, offset: 4160)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1291, file: !548, line: 645, baseType: !1185, size: 64, align: 64, offset: 4224)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1248, file: !919, line: 587, baseType: !1234, size: 64, align: 64, offset: 1152)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1248, file: !919, line: 592, baseType: !1240, size: 64, align: 64, offset: 1216)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1248, file: !919, line: 597, baseType: !1240, size: 64, align: 64, offset: 1280)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1248, file: !919, line: 598, baseType: !46, size: 32, align: 32, offset: 1344)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1248, file: !919, line: 608, baseType: !1172, size: 64, align: 64, offset: 1408)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1248, file: !919, line: 617, baseType: !1379, size: 64, align: 64, offset: 1472)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DISubroutineType(types: !1381)
!1381 = !{null, !1175}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1248, file: !919, line: 623, baseType: !1383, size: 64, align: 64, offset: 1536)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DISubroutineType(types: !1385)
!1385 = !{!1069, !1175, !1386}
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1181)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1045, file: !919, line: 1365, baseType: !1041, size: 64, align: 64, offset: 192)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1045, file: !919, line: 1379, baseType: !1390, size: 64, align: 64, offset: 256)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1393)
!1393 = !{!1394, !1395, !1396, !1397, !1398, !1399, !1400, !1404, !1405, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1421, !1422, !1426, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1444, !1445, !1446, !1447, !1451, !1452, !1453}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1392, file: !650, line: 174, baseType: !1048, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1392, file: !650, line: 226, baseType: !1167, size: 64, align: 64, offset: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1392, file: !650, line: 227, baseType: !1069, size: 32, align: 32, offset: 128)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1392, file: !650, line: 228, baseType: !1167, size: 64, align: 64, offset: 192)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1392, file: !650, line: 229, baseType: !1167, size: 64, align: 64, offset: 256)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1392, file: !650, line: 233, baseType: !1041, size: 64, align: 64, offset: 320)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1392, file: !650, line: 235, baseType: !1401, size: 64, align: 64, offset: 384)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DISubroutineType(types: !1403)
!1403 = !{!1069, !1041, !1195, !1069}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1392, file: !650, line: 236, baseType: !1401, size: 64, align: 64, offset: 448)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1392, file: !650, line: 237, baseType: !1406, size: 64, align: 64, offset: 512)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DISubroutineType(types: !1408)
!1408 = !{!1075, !1041, !1075, !1069}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1392, file: !650, line: 238, baseType: !1075, size: 64, align: 64, offset: 576)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1392, file: !650, line: 239, baseType: !1069, size: 32, align: 32, offset: 640)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1392, file: !650, line: 240, baseType: !1069, size: 32, align: 32, offset: 672)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1392, file: !650, line: 241, baseType: !1069, size: 32, align: 32, offset: 704)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1392, file: !650, line: 242, baseType: !1283, size: 64, align: 64, offset: 768)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1392, file: !650, line: 243, baseType: !1167, size: 64, align: 64, offset: 832)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1392, file: !650, line: 244, baseType: !1416, size: 64, align: 64, offset: 896)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{!1283, !1283, !1419, !1151}
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1196)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1392, file: !650, line: 245, baseType: !1069, size: 32, align: 32, offset: 960)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1392, file: !650, line: 249, baseType: !1423, size: 64, align: 64, offset: 1024)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{!1069, !1041, !1069}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1392, file: !650, line: 255, baseType: !1427, size: 64, align: 64, offset: 1088)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!1075, !1041, !1069, !1075, !1069}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1392, file: !650, line: 260, baseType: !1069, size: 32, align: 32, offset: 1152)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1392, file: !650, line: 266, baseType: !1075, size: 64, align: 64, offset: 1216)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1392, file: !650, line: 273, baseType: !1069, size: 32, align: 32, offset: 1280)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1392, file: !650, line: 279, baseType: !1075, size: 64, align: 64, offset: 1344)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1392, file: !650, line: 285, baseType: !1069, size: 32, align: 32, offset: 1408)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1392, file: !650, line: 291, baseType: !1069, size: 32, align: 32, offset: 1440)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1392, file: !650, line: 298, baseType: !1069, size: 32, align: 32, offset: 1472)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1392, file: !650, line: 304, baseType: !1069, size: 32, align: 32, offset: 1504)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1392, file: !650, line: 309, baseType: !1054, size: 64, align: 64, offset: 1536)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1392, file: !650, line: 314, baseType: !1054, size: 64, align: 64, offset: 1600)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1392, file: !650, line: 319, baseType: !1441, size: 64, align: 64, offset: 1664)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DISubroutineType(types: !1443)
!1443 = !{!1069, !1041, !1195, !1069, !649, !1075}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1392, file: !650, line: 326, baseType: !1069, size: 32, align: 32, offset: 1728)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1392, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1392, file: !650, line: 332, baseType: !1075, size: 64, align: 64, offset: 1792)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1392, file: !650, line: 338, baseType: !1448, size: 64, align: 64, offset: 1856)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!1069, !1041}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1392, file: !650, line: 340, baseType: !1075, size: 64, align: 64, offset: 1920)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1392, file: !650, line: 346, baseType: !1167, size: 64, align: 64, offset: 1984)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1392, file: !650, line: 351, baseType: !1069, size: 32, align: 32, offset: 2048)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1045, file: !919, line: 1386, baseType: !1069, size: 32, align: 32, offset: 320)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1045, file: !919, line: 1393, baseType: !1151, size: 32, align: 32, offset: 352)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1045, file: !919, line: 1405, baseType: !1457, size: 64, align: 64, offset: 384)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1460)
!1460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1461)
!1461 = !{!1462, !1463, !1464, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1935, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !2035, !2041, !2042, !2046, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2078, !2079, !2080, !2081, !2082, !2083}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1460, file: !919, line: 866, baseType: !1069, size: 32, align: 32)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1460, file: !919, line: 872, baseType: !1069, size: 32, align: 32, offset: 32)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1460, file: !919, line: 878, baseType: !1465, size: 64, align: 64, offset: 64)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !47, line: 3360, baseType: !1467)
!1467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !47, line: 1556, size: 8448, align: 64, elements: !1468)
!1468 = !{!1469, !1470, !1471, !1472, !1610, !1611, !1612, !1613, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1639, !1643, !1644, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1823, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1467, file: !47, line: 1561, baseType: !1048, size: 64, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1467, file: !47, line: 1562, baseType: !1069, size: 32, align: 32, offset: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1467, file: !47, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1467, file: !47, line: 1565, baseType: !1473, size: 64, align: 64, offset: 128)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1475)
!1475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !47, line: 3468, size: 1984, align: 64, elements: !1476)
!1476 = !{!1477, !1478, !1479, !1480, !1481, !1482, !1485, !1488, !1491, !1494, !1497, !1498, !1499, !1507, !1508, !1509, !1511, !1515, !1521, !1526, !1530, !1531, !1575, !1582, !1586, !1587, !1591, !1595, !1599, !1603, !1604, !1605}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1475, file: !47, line: 3475, baseType: !1054, size: 64, align: 64)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1475, file: !47, line: 3480, baseType: !1054, size: 64, align: 64, offset: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1475, file: !47, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1475, file: !47, line: 3482, baseType: !46, size: 32, align: 32, offset: 160)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1475, file: !47, line: 3487, baseType: !1069, size: 32, align: 32, offset: 192)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1475, file: !47, line: 3488, baseType: !1483, size: 64, align: 64, offset: 256)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1082)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1475, file: !47, line: 3489, baseType: !1486, size: 64, align: 64, offset: 320)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1475, file: !47, line: 3490, baseType: !1489, size: 64, align: 64, offset: 384)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1069)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1475, file: !47, line: 3491, baseType: !1492, size: 64, align: 64, offset: 448)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1475, file: !47, line: 3492, baseType: !1495, size: 64, align: 64, offset: 512)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1317)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1475, file: !47, line: 3493, baseType: !1196, size: 8, align: 8, offset: 576)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1475, file: !47, line: 3494, baseType: !1048, size: 64, align: 64, offset: 640)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1475, file: !47, line: 3495, baseType: !1500, size: 64, align: 64, offset: 704)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1502)
!1502 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !47, line: 3404, baseType: !1503)
!1503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !47, line: 3401, size: 128, align: 64, elements: !1504)
!1504 = !{!1505, !1506}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1503, file: !47, line: 3402, baseType: !1069, size: 32, align: 32)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1503, file: !47, line: 3403, baseType: !1054, size: 64, align: 64, offset: 64)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1475, file: !47, line: 3507, baseType: !1054, size: 64, align: 64, offset: 768)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1475, file: !47, line: 3516, baseType: !1069, size: 32, align: 32, offset: 832)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1475, file: !47, line: 3517, baseType: !1510, size: 64, align: 64, offset: 896)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64, align: 64)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1475, file: !47, line: 3527, baseType: !1512, size: 64, align: 64, offset: 960)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DISubroutineType(types: !1514)
!1514 = !{!1069, !1465}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1475, file: !47, line: 3535, baseType: !1516, size: 64, align: 64, offset: 1024)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{!1069, !1465, !1519}
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1466)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1475, file: !47, line: 3541, baseType: !1522, size: 64, align: 64, offset: 1088)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1524)
!1524 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !47, line: 3461, baseType: !1525)
!1525 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !47, line: 3461, flags: DIFlagFwdDecl)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1475, file: !47, line: 3549, baseType: !1527, size: 64, align: 64, offset: 1152)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DISubroutineType(types: !1529)
!1529 = !{null, !1510}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1475, file: !47, line: 3551, baseType: !1512, size: 64, align: 64, offset: 1216)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1475, file: !47, line: 3552, baseType: !1532, size: 64, align: 64, offset: 1280)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DISubroutineType(types: !1534)
!1534 = !{!1069, !1465, !1195, !1069, !1535}
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1537)
!1537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !47, line: 3920, size: 256, align: 64, elements: !1538)
!1538 = !{!1539, !1542, !1544, !1545, !1546, !1574}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1537, file: !47, line: 3921, baseType: !1540, size: 16, align: 16)
!1540 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1197, line: 49, baseType: !1541)
!1541 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1537, file: !47, line: 3922, baseType: !1543, size: 32, align: 32, offset: 32)
!1543 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1197, line: 51, baseType: !1151)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1537, file: !47, line: 3923, baseType: !1543, size: 32, align: 32, offset: 64)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1537, file: !47, line: 3924, baseType: !1151, size: 32, align: 32, offset: 96)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1537, file: !47, line: 3925, baseType: !1547, size: 64, align: 64, offset: 128)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !47, line: 3918, baseType: !1550)
!1550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !47, line: 3885, size: 1600, align: 64, elements: !1551)
!1551 = !{!1552, !1553, !1554, !1555, !1556, !1557, !1563, !1567, !1569, !1570, !1572, !1573}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1550, file: !47, line: 3886, baseType: !1069, size: 32, align: 32)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1550, file: !47, line: 3887, baseType: !1069, size: 32, align: 32, offset: 32)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1550, file: !47, line: 3888, baseType: !1069, size: 32, align: 32, offset: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1550, file: !47, line: 3889, baseType: !1069, size: 32, align: 32, offset: 96)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1550, file: !47, line: 3890, baseType: !1069, size: 32, align: 32, offset: 128)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1550, file: !47, line: 3897, baseType: !1558, size: 768, align: 64, offset: 192)
!1558 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !47, line: 3858, baseType: !1559)
!1559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !47, line: 3853, size: 768, align: 64, elements: !1560)
!1560 = !{!1561, !1562}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1559, file: !47, line: 3855, baseType: !1294, size: 512, align: 64)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1559, file: !47, line: 3857, baseType: !1298, size: 256, align: 32, offset: 512)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1550, file: !47, line: 3903, baseType: !1564, size: 256, align: 64, offset: 960)
!1564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1195, size: 256, align: 64, elements: !1565)
!1565 = !{!1566}
!1566 = !DISubrange(count: 4)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1550, file: !47, line: 3904, baseType: !1568, size: 128, align: 32, offset: 1216)
!1568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1069, size: 128, align: 32, elements: !1565)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1550, file: !47, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1550, file: !47, line: 3908, baseType: !1571, size: 64, align: 64, offset: 1408)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1550, file: !47, line: 3915, baseType: !1571, size: 64, align: 64, offset: 1472)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1550, file: !47, line: 3917, baseType: !1069, size: 32, align: 32, offset: 1536)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1537, file: !47, line: 3926, baseType: !1075, size: 64, align: 64, offset: 192)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1475, file: !47, line: 3564, baseType: !1576, size: 64, align: 64, offset: 1344)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{!1069, !1465, !1180, !1579, !1581}
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1290)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1475, file: !47, line: 3566, baseType: !1583, size: 64, align: 64, offset: 1408)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DISubroutineType(types: !1585)
!1585 = !{!1069, !1465, !1041, !1581, !1180}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1475, file: !47, line: 3567, baseType: !1512, size: 64, align: 64, offset: 1472)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1475, file: !47, line: 3576, baseType: !1588, size: 64, align: 64, offset: 1536)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DISubroutineType(types: !1590)
!1590 = !{!1069, !1465, !1579}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1475, file: !47, line: 3577, baseType: !1592, size: 64, align: 64, offset: 1600)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DISubroutineType(types: !1594)
!1594 = !{!1069, !1465, !1180}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1475, file: !47, line: 3584, baseType: !1596, size: 64, align: 64, offset: 1664)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{!1069, !1465, !1289}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1475, file: !47, line: 3589, baseType: !1600, size: 64, align: 64, offset: 1728)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DISubroutineType(types: !1602)
!1602 = !{null, !1465}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1475, file: !47, line: 3594, baseType: !1069, size: 32, align: 32, offset: 1792)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1475, file: !47, line: 3600, baseType: !1054, size: 64, align: 64, offset: 1856)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1475, file: !47, line: 3609, baseType: !1606, size: 64, align: 64, offset: 1920)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1609)
!1609 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !47, line: 3609, flags: DIFlagFwdDecl)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1467, file: !47, line: 1566, baseType: !46, size: 32, align: 32, offset: 192)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1467, file: !47, line: 1581, baseType: !1151, size: 32, align: 32, offset: 224)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1467, file: !47, line: 1583, baseType: !1041, size: 64, align: 64, offset: 256)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1467, file: !47, line: 1591, baseType: !1614, size: 64, align: 64, offset: 320)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64, align: 64)
!1615 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !47, line: 1532, flags: DIFlagFwdDecl)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1467, file: !47, line: 1598, baseType: !1041, size: 64, align: 64, offset: 384)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1467, file: !47, line: 1606, baseType: !1075, size: 64, align: 64, offset: 448)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1467, file: !47, line: 1614, baseType: !1069, size: 32, align: 32, offset: 512)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1467, file: !47, line: 1622, baseType: !1069, size: 32, align: 32, offset: 544)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1467, file: !47, line: 1628, baseType: !1069, size: 32, align: 32, offset: 576)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1467, file: !47, line: 1636, baseType: !1069, size: 32, align: 32, offset: 608)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1467, file: !47, line: 1643, baseType: !1069, size: 32, align: 32, offset: 640)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1467, file: !47, line: 1657, baseType: !1195, size: 64, align: 64, offset: 704)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1467, file: !47, line: 1658, baseType: !1069, size: 32, align: 32, offset: 768)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1467, file: !47, line: 1679, baseType: !1082, size: 64, align: 32, offset: 800)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1467, file: !47, line: 1688, baseType: !1069, size: 32, align: 32, offset: 864)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1467, file: !47, line: 1712, baseType: !1069, size: 32, align: 32, offset: 896)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1467, file: !47, line: 1729, baseType: !1069, size: 32, align: 32, offset: 928)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1467, file: !47, line: 1729, baseType: !1069, size: 32, align: 32, offset: 960)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1467, file: !47, line: 1744, baseType: !1069, size: 32, align: 32, offset: 992)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1467, file: !47, line: 1744, baseType: !1069, size: 32, align: 32, offset: 1024)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1467, file: !47, line: 1751, baseType: !1069, size: 32, align: 32, offset: 1056)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1467, file: !47, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1467, file: !47, line: 1791, baseType: !1635, size: 64, align: 64, offset: 1152)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{null, !1638, !1579, !1581, !1069, !1069, !1069}
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1467, file: !47, line: 1808, baseType: !1640, size: 64, align: 64, offset: 1216)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DISubroutineType(types: !1642)
!1642 = !{!667, !1638, !1486}
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1467, file: !47, line: 1816, baseType: !1069, size: 32, align: 32, offset: 1280)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1467, file: !47, line: 1825, baseType: !1645, size: 32, align: 32, offset: 1312)
!1645 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1467, file: !47, line: 1830, baseType: !1069, size: 32, align: 32, offset: 1344)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1467, file: !47, line: 1838, baseType: !1645, size: 32, align: 32, offset: 1376)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1467, file: !47, line: 1846, baseType: !1069, size: 32, align: 32, offset: 1408)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1467, file: !47, line: 1851, baseType: !1069, size: 32, align: 32, offset: 1440)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1467, file: !47, line: 1861, baseType: !1645, size: 32, align: 32, offset: 1472)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1467, file: !47, line: 1868, baseType: !1645, size: 32, align: 32, offset: 1504)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1467, file: !47, line: 1875, baseType: !1645, size: 32, align: 32, offset: 1536)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1467, file: !47, line: 1882, baseType: !1645, size: 32, align: 32, offset: 1568)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1467, file: !47, line: 1889, baseType: !1645, size: 32, align: 32, offset: 1600)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1467, file: !47, line: 1896, baseType: !1645, size: 32, align: 32, offset: 1632)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1467, file: !47, line: 1903, baseType: !1645, size: 32, align: 32, offset: 1664)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1467, file: !47, line: 1910, baseType: !1069, size: 32, align: 32, offset: 1696)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1467, file: !47, line: 1915, baseType: !1069, size: 32, align: 32, offset: 1728)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1467, file: !47, line: 1926, baseType: !1581, size: 64, align: 64, offset: 1792)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1467, file: !47, line: 1935, baseType: !1082, size: 64, align: 32, offset: 1856)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1467, file: !47, line: 1942, baseType: !1069, size: 32, align: 32, offset: 1920)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1467, file: !47, line: 1948, baseType: !1069, size: 32, align: 32, offset: 1952)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1467, file: !47, line: 1954, baseType: !1069, size: 32, align: 32, offset: 1984)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1467, file: !47, line: 1960, baseType: !1069, size: 32, align: 32, offset: 2016)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1467, file: !47, line: 1984, baseType: !1069, size: 32, align: 32, offset: 2048)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1467, file: !47, line: 1991, baseType: !1069, size: 32, align: 32, offset: 2080)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1467, file: !47, line: 1996, baseType: !1069, size: 32, align: 32, offset: 2112)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1467, file: !47, line: 2004, baseType: !1069, size: 32, align: 32, offset: 2144)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1467, file: !47, line: 2011, baseType: !1069, size: 32, align: 32, offset: 2176)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1467, file: !47, line: 2018, baseType: !1069, size: 32, align: 32, offset: 2208)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1467, file: !47, line: 2027, baseType: !1069, size: 32, align: 32, offset: 2240)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1467, file: !47, line: 2034, baseType: !1069, size: 32, align: 32, offset: 2272)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1467, file: !47, line: 2044, baseType: !1069, size: 32, align: 32, offset: 2304)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1467, file: !47, line: 2054, baseType: !1675, size: 64, align: 64, offset: 2368)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1467, file: !47, line: 2061, baseType: !1675, size: 64, align: 64, offset: 2432)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1467, file: !47, line: 2066, baseType: !1069, size: 32, align: 32, offset: 2496)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1467, file: !47, line: 2070, baseType: !1069, size: 32, align: 32, offset: 2528)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1467, file: !47, line: 2078, baseType: !1069, size: 32, align: 32, offset: 2560)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1467, file: !47, line: 2085, baseType: !1069, size: 32, align: 32, offset: 2592)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1467, file: !47, line: 2092, baseType: !1069, size: 32, align: 32, offset: 2624)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1467, file: !47, line: 2099, baseType: !1069, size: 32, align: 32, offset: 2656)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1467, file: !47, line: 2106, baseType: !1069, size: 32, align: 32, offset: 2688)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1467, file: !47, line: 2113, baseType: !1069, size: 32, align: 32, offset: 2720)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1467, file: !47, line: 2120, baseType: !1069, size: 32, align: 32, offset: 2752)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1467, file: !47, line: 2125, baseType: !1069, size: 32, align: 32, offset: 2784)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1467, file: !47, line: 2133, baseType: !1069, size: 32, align: 32, offset: 2816)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1467, file: !47, line: 2140, baseType: !1069, size: 32, align: 32, offset: 2848)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1467, file: !47, line: 2145, baseType: !1069, size: 32, align: 32, offset: 2880)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1467, file: !47, line: 2153, baseType: !1069, size: 32, align: 32, offset: 2912)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1467, file: !47, line: 2158, baseType: !1069, size: 32, align: 32, offset: 2944)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1467, file: !47, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1467, file: !47, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1467, file: !47, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1467, file: !47, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1467, file: !47, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1467, file: !47, line: 2203, baseType: !1069, size: 32, align: 32, offset: 3136)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1467, file: !47, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1467, file: !47, line: 2212, baseType: !1069, size: 32, align: 32, offset: 3200)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1467, file: !47, line: 2213, baseType: !1069, size: 32, align: 32, offset: 3232)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1467, file: !47, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1467, file: !47, line: 2232, baseType: !1069, size: 32, align: 32, offset: 3296)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1467, file: !47, line: 2243, baseType: !1069, size: 32, align: 32, offset: 3328)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1467, file: !47, line: 2249, baseType: !1069, size: 32, align: 32, offset: 3360)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1467, file: !47, line: 2256, baseType: !1069, size: 32, align: 32, offset: 3392)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1467, file: !47, line: 2263, baseType: !1317, size: 64, align: 64, offset: 3456)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1467, file: !47, line: 2270, baseType: !1317, size: 64, align: 64, offset: 3520)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1467, file: !47, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1467, file: !47, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1467, file: !47, line: 2367, baseType: !1711, size: 64, align: 64, offset: 3648)
!1711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1712, size: 64, align: 64)
!1712 = !DISubroutineType(types: !1713)
!1713 = !{!1069, !1638, !1289, !1069}
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1467, file: !47, line: 2383, baseType: !1069, size: 32, align: 32, offset: 3712)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1467, file: !47, line: 2386, baseType: !1645, size: 32, align: 32, offset: 3744)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1467, file: !47, line: 2387, baseType: !1645, size: 32, align: 32, offset: 3776)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1467, file: !47, line: 2394, baseType: !1069, size: 32, align: 32, offset: 3808)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1467, file: !47, line: 2401, baseType: !1069, size: 32, align: 32, offset: 3840)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1467, file: !47, line: 2408, baseType: !1069, size: 32, align: 32, offset: 3872)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1467, file: !47, line: 2415, baseType: !1069, size: 32, align: 32, offset: 3904)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1467, file: !47, line: 2422, baseType: !1069, size: 32, align: 32, offset: 3936)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1467, file: !47, line: 2423, baseType: !1723, size: 64, align: 64, offset: 3968)
!1723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1724, size: 64, align: 64)
!1724 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !47, line: 831, baseType: !1725)
!1725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !47, line: 826, size: 128, align: 32, elements: !1726)
!1726 = !{!1727, !1728, !1729, !1730}
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1725, file: !47, line: 827, baseType: !1069, size: 32, align: 32)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1725, file: !47, line: 828, baseType: !1069, size: 32, align: 32, offset: 32)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1725, file: !47, line: 829, baseType: !1069, size: 32, align: 32, offset: 64)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1725, file: !47, line: 830, baseType: !1645, size: 32, align: 32, offset: 96)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1467, file: !47, line: 2430, baseType: !1075, size: 64, align: 64, offset: 4032)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1467, file: !47, line: 2437, baseType: !1075, size: 64, align: 64, offset: 4096)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1467, file: !47, line: 2444, baseType: !1645, size: 32, align: 32, offset: 4160)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1467, file: !47, line: 2451, baseType: !1645, size: 32, align: 32, offset: 4192)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1467, file: !47, line: 2458, baseType: !1069, size: 32, align: 32, offset: 4224)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1467, file: !47, line: 2469, baseType: !1069, size: 32, align: 32, offset: 4256)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1467, file: !47, line: 2475, baseType: !1069, size: 32, align: 32, offset: 4288)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1467, file: !47, line: 2481, baseType: !1069, size: 32, align: 32, offset: 4320)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1467, file: !47, line: 2485, baseType: !1069, size: 32, align: 32, offset: 4352)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1467, file: !47, line: 2489, baseType: !1069, size: 32, align: 32, offset: 4384)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1467, file: !47, line: 2493, baseType: !1069, size: 32, align: 32, offset: 4416)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1467, file: !47, line: 2501, baseType: !1069, size: 32, align: 32, offset: 4448)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1467, file: !47, line: 2506, baseType: !1069, size: 32, align: 32, offset: 4480)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1467, file: !47, line: 2510, baseType: !1069, size: 32, align: 32, offset: 4512)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1467, file: !47, line: 2514, baseType: !1075, size: 64, align: 64, offset: 4544)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1467, file: !47, line: 2528, baseType: !1747, size: 64, align: 64, offset: 4608)
!1747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1748, size: 64, align: 64)
!1748 = !DISubroutineType(types: !1749)
!1749 = !{null, !1638, !1041, !1069, !1069}
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1467, file: !47, line: 2534, baseType: !1069, size: 32, align: 32, offset: 4672)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1467, file: !47, line: 2545, baseType: !1069, size: 32, align: 32, offset: 4704)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1467, file: !47, line: 2547, baseType: !1069, size: 32, align: 32, offset: 4736)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1467, file: !47, line: 2549, baseType: !1069, size: 32, align: 32, offset: 4768)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1467, file: !47, line: 2551, baseType: !1069, size: 32, align: 32, offset: 4800)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1467, file: !47, line: 2553, baseType: !1069, size: 32, align: 32, offset: 4832)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1467, file: !47, line: 2555, baseType: !1069, size: 32, align: 32, offset: 4864)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1467, file: !47, line: 2557, baseType: !1069, size: 32, align: 32, offset: 4896)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1467, file: !47, line: 2559, baseType: !1069, size: 32, align: 32, offset: 4928)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1467, file: !47, line: 2563, baseType: !1069, size: 32, align: 32, offset: 4960)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1467, file: !47, line: 2571, baseType: !1571, size: 64, align: 64, offset: 4992)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1467, file: !47, line: 2579, baseType: !1571, size: 64, align: 64, offset: 5056)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1467, file: !47, line: 2586, baseType: !1069, size: 32, align: 32, offset: 5120)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1467, file: !47, line: 2615, baseType: !1069, size: 32, align: 32, offset: 5152)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1467, file: !47, line: 2627, baseType: !1069, size: 32, align: 32, offset: 5184)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1467, file: !47, line: 2637, baseType: !1069, size: 32, align: 32, offset: 5216)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1467, file: !47, line: 2681, baseType: !1069, size: 32, align: 32, offset: 5248)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1467, file: !47, line: 2709, baseType: !1075, size: 64, align: 64, offset: 5312)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1467, file: !47, line: 2716, baseType: !1769, size: 64, align: 64, offset: 5376)
!1769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1770, size: 64, align: 64)
!1770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1771)
!1771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !47, line: 3636, size: 896, align: 64, elements: !1772)
!1772 = !{!1773, !1774, !1775, !1776, !1777, !1778, !1779, !1783, !1787, !1788, !1789, !1790, !1796, !1797, !1798, !1799, !1800}
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1771, file: !47, line: 3642, baseType: !1054, size: 64, align: 64)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1771, file: !47, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1771, file: !47, line: 3656, baseType: !46, size: 32, align: 32, offset: 96)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1771, file: !47, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1771, file: !47, line: 3669, baseType: !1069, size: 32, align: 32, offset: 160)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1771, file: !47, line: 3682, baseType: !1596, size: 64, align: 64, offset: 192)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1771, file: !47, line: 3698, baseType: !1780, size: 64, align: 64, offset: 256)
!1780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1781, size: 64, align: 64)
!1781 = !DISubroutineType(types: !1782)
!1782 = !{!1069, !1465, !1419, !1543}
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1771, file: !47, line: 3712, baseType: !1784, size: 64, align: 64, offset: 320)
!1784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1785, size: 64, align: 64)
!1785 = !DISubroutineType(types: !1786)
!1786 = !{!1069, !1465, !1069, !1419, !1543}
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1771, file: !47, line: 3726, baseType: !1780, size: 64, align: 64, offset: 384)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1771, file: !47, line: 3737, baseType: !1512, size: 64, align: 64, offset: 448)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1771, file: !47, line: 3746, baseType: !1069, size: 32, align: 32, offset: 512)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1771, file: !47, line: 3757, baseType: !1791, size: 64, align: 64, offset: 576)
!1791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1792, size: 64, align: 64)
!1792 = !DISubroutineType(types: !1793)
!1793 = !{null, !1794}
!1794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1795, size: 64, align: 64)
!1795 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !47, line: 3617, flags: DIFlagFwdDecl)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1771, file: !47, line: 3766, baseType: !1512, size: 64, align: 64, offset: 640)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1771, file: !47, line: 3774, baseType: !1512, size: 64, align: 64, offset: 704)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1771, file: !47, line: 3780, baseType: !1069, size: 32, align: 32, offset: 768)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1771, file: !47, line: 3785, baseType: !1069, size: 32, align: 32, offset: 800)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1771, file: !47, line: 3795, baseType: !1801, size: 64, align: 64, offset: 832)
!1801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1802, size: 64, align: 64)
!1802 = !DISubroutineType(types: !1803)
!1803 = !{!1069, !1465, !1185}
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1467, file: !47, line: 2728, baseType: !1041, size: 64, align: 64, offset: 5440)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1467, file: !47, line: 2735, baseType: !1316, size: 512, align: 64, offset: 5504)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1467, file: !47, line: 2742, baseType: !1069, size: 32, align: 32, offset: 6016)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1467, file: !47, line: 2755, baseType: !1069, size: 32, align: 32, offset: 6048)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1467, file: !47, line: 2776, baseType: !1069, size: 32, align: 32, offset: 6080)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1467, file: !47, line: 2783, baseType: !1069, size: 32, align: 32, offset: 6112)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1467, file: !47, line: 2791, baseType: !1069, size: 32, align: 32, offset: 6144)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1467, file: !47, line: 2802, baseType: !1289, size: 64, align: 64, offset: 6208)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1467, file: !47, line: 2811, baseType: !1069, size: 32, align: 32, offset: 6272)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1467, file: !47, line: 2821, baseType: !1069, size: 32, align: 32, offset: 6304)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1467, file: !47, line: 2830, baseType: !1069, size: 32, align: 32, offset: 6336)
