; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--tcp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--tcp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }

!35 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!36 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!37 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!38 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!39 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!40 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!41 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!42 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!43 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!44 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!45 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !47, line: 24, size: 32, align: 32, elements: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57}
!49 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!50 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!51 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!52 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!53 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!54 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!55 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!56 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!57 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !59, line: 40, size: 32, align: 32, elements: !60)
!59 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!61 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!62 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!63 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!64 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!65 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!66 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!67 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!68 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!69 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!70 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!71 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!72 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!73 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!74 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!75 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!76 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!77 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!78 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!79 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!80 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!81 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!82 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!83 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!84 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!85 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!86 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 175, size: 32, align: 32, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108}
!90 = !DIEnumerator(name: "MSG_OOB", value: 1)
!91 = !DIEnumerator(name: "MSG_PEEK", value: 2)
!92 = !DIEnumerator(name: "MSG_DONTROUTE", value: 4)
!93 = !DIEnumerator(name: "MSG_CTRUNC", value: 8)
!94 = !DIEnumerator(name: "MSG_PROXY", value: 16)
!95 = !DIEnumerator(name: "MSG_TRUNC", value: 32)
!96 = !DIEnumerator(name: "MSG_DONTWAIT", value: 64)
!97 = !DIEnumerator(name: "MSG_EOR", value: 128)
!98 = !DIEnumerator(name: "MSG_WAITALL", value: 256)
!99 = !DIEnumerator(name: "MSG_FIN", value: 512)
!100 = !DIEnumerator(name: "MSG_SYN", value: 1024)
!101 = !DIEnumerator(name: "MSG_CONFIRM", value: 2048)
!102 = !DIEnumerator(name: "MSG_RST", value: 4096)
!103 = !DIEnumerator(name: "MSG_ERRQUEUE", value: 8192)
!104 = !DIEnumerator(name: "MSG_NOSIGNAL", value: 16384)
!105 = !DIEnumerator(name: "MSG_MORE", value: 32768)
!106 = !DIEnumerator(name: "MSG_WAITFORONE", value: 65536)
!107 = !DIEnumerator(name: "MSG_FASTOPEN", value: 536870912)
!108 = !DIEnumerator(name: "MSG_CMSG_CLOEXEC", value: 1073741824)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !110, line: 52, size: 32, align: 32, elements: !111)
!110 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/socket.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!111 = !{!112, !113, !114}
!112 = !DIEnumerator(name: "SHUT_RD", value: 0)
!113 = !DIEnumerator(name: "SHUT_WR", value: 1)
!114 = !DIEnumerator(name: "SHUT_RDWR", value: 2)
!115 = !{!116, !143, !144, !129}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !59, line: 254, size: 224, align: 32, elements: !118)
!118 = !{!119, !123, !127, !130, !142}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !117, file: !59, line: 256, baseType: !120, size: 16, align: 16)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !121, line: 28, baseType: !122)
!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!122 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !117, file: !59, line: 257, baseType: !124, size: 16, align: 16, offset: 16)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !59, line: 119, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !126, line: 49, baseType: !122)
!126 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!127 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !117, file: !59, line: 258, baseType: !128, size: 32, align: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !126, line: 51, baseType: !129)
!129 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !117, file: !59, line: 259, baseType: !131, size: 128, align: 8, offset: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !59, line: 211, size: 128, align: 8, elements: !132)
!132 = !{!133}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !131, file: !59, line: 220, baseType: !134, size: 128, align: 8)
!134 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !131, file: !59, line: 213, size: 128, align: 8, elements: !135)
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !134, file: !59, line: 215, baseType: !137, size: 128, align: 8)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 128, align: 8, elements: !140)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !126, line: 48, baseType: !139)
!139 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!140 = !{!141}
!141 = !DISubrange(count: 16)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !117, file: !59, line: 260, baseType: !128, size: 32, align: 32, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!144 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!145 = !{!146, !352, !353}
!146 = distinct !DIGlobalVariable(name: "ff_tcp_protocol", scope: !0, file: !147, line: 313, type: !148, isLocal: false, isDefinition: true, variable: { i8*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }* @ff_tcp_protocol)
!147 = !DIFile(filename: "libavformat/tcp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !150, line: 100, baseType: !151)
!150 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !150, line: 54, size: 1600, align: 64, elements: !152)
!152 = !{!153, !157, !270, !279, !284, !288, !293, !299, !303, !304, !308, !312, !313, !319, !320, !321, !322, !323, !324, !325, !326, !345, !346, !347, !351}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !150, line: 55, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !151, file: !150, line: 56, baseType: !158, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!144, !161, !154, !144}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !150, line: 52, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !150, line: 38, size: 768, align: 64, elements: !164)
!164 = !{!165, !246, !249, !250, !252, !253, !254, !255, !256, !266, !267, !268, !269}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !163, file: !150, line: 39, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !170)
!170 = !{!171, !172, !176, !205, !206, !207, !208, !212, !218, !220, !224}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !169, file: !26, line: 72, baseType: !154, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !169, file: !26, line: 78, baseType: !173, size: 64, align: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!154, !143}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !169, file: !26, line: 85, baseType: !177, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !180)
!180 = !{!181, !182, !183, !184, !185, !201, !202, !203, !204}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !179, file: !4, line: 247, baseType: !154, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !179, file: !4, line: 253, baseType: !154, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !179, file: !4, line: 259, baseType: !144, size: 32, align: 32, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !179, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !179, file: !4, line: 271, baseType: !186, size: 64, align: 64, offset: 192)
!186 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !179, file: !4, line: 265, size: 64, align: 64, elements: !187)
!187 = !{!188, !191, !193, !194}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !186, file: !4, line: 266, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !126, line: 40, baseType: !190)
!190 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !186, file: !4, line: 267, baseType: !192, size: 64, align: 64)
!192 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !186, file: !4, line: 268, baseType: !154, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !186, file: !4, line: 270, baseType: !195, size: 64, align: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !196, line: 61, baseType: !197)
!196 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !196, line: 58, size: 64, align: 32, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !197, file: !196, line: 59, baseType: !144, size: 32, align: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !197, file: !196, line: 60, baseType: !144, size: 32, align: 32, offset: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !179, file: !4, line: 272, baseType: !192, size: 64, align: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !179, file: !4, line: 273, baseType: !192, size: 64, align: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !179, file: !4, line: 275, baseType: !144, size: 32, align: 32, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !179, file: !4, line: 300, baseType: !154, size: 64, align: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !169, file: !26, line: 93, baseType: !144, size: 32, align: 32, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !169, file: !26, line: 99, baseType: !144, size: 32, align: 32, offset: 224)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !169, file: !26, line: 108, baseType: !144, size: 32, align: 32, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !169, file: !26, line: 113, baseType: !209, size: 64, align: 64, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!143, !143, !143}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !169, file: !26, line: 123, baseType: !213, size: 64, align: 64, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!216, !216}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !169, file: !26, line: 130, baseType: !219, size: 32, align: 32, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !169, file: !26, line: 136, baseType: !221, size: 64, align: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!219, !143}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !169, file: !26, line: 142, baseType: !225, size: 64, align: 64, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!144, !228, !143, !154, !144}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !231)
!231 = !{!232, !244, !245}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !230, file: !4, line: 360, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !237)
!237 = !{!238, !239, !240, !241, !242, !243}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !236, file: !4, line: 307, baseType: !154, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !236, file: !4, line: 313, baseType: !192, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !236, file: !4, line: 313, baseType: !192, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !236, file: !4, line: 318, baseType: !192, size: 64, align: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !236, file: !4, line: 318, baseType: !192, size: 64, align: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !236, file: !4, line: 323, baseType: !144, size: 32, align: 32, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !230, file: !4, line: 364, baseType: !144, size: 32, align: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !230, file: !4, line: 368, baseType: !144, size: 32, align: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !163, file: !150, line: 40, baseType: !247, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !163, file: !150, line: 41, baseType: !143, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !163, file: !150, line: 42, baseType: !251, size: 64, align: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !163, file: !150, line: 43, baseType: !144, size: 32, align: 32, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !163, file: !150, line: 44, baseType: !144, size: 32, align: 32, offset: 288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !163, file: !150, line: 45, baseType: !144, size: 32, align: 32, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !163, file: !150, line: 46, baseType: !144, size: 32, align: 32, offset: 352)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !163, file: !150, line: 47, baseType: !257, size: 128, align: 64, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !258, line: 61, baseType: !259)
!258 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !258, line: 58, size: 128, align: 64, elements: !260)
!260 = !{!261, !265}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !259, file: !258, line: 59, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!144, !143}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !259, file: !258, line: 60, baseType: !143, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !163, file: !150, line: 48, baseType: !189, size: 64, align: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !163, file: !150, line: 49, baseType: !154, size: 64, align: 64, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !163, file: !150, line: 50, baseType: !154, size: 64, align: 64, offset: 640)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !163, file: !150, line: 51, baseType: !144, size: 32, align: 32, offset: 704)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !151, file: !150, line: 62, baseType: !271, size: 64, align: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!144, !161, !154, !144, !274}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !277, line: 86, baseType: !278)
!277 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !277, line: 86, flags: DIFlagFwdDecl)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !151, file: !150, line: 63, baseType: !280, size: 64, align: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!144, !161, !283}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !151, file: !150, line: 64, baseType: !285, size: 64, align: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!144, !161}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !151, file: !150, line: 78, baseType: !289, size: 64, align: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!144, !161, !292, !144}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !151, file: !150, line: 79, baseType: !294, size: 64, align: 64, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!144, !161, !297, !144}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !151, file: !150, line: 80, baseType: !300, size: 64, align: 64, offset: 448)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!189, !161, !189, !144}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !151, file: !150, line: 81, baseType: !285, size: 64, align: 64, offset: 512)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !151, file: !150, line: 82, baseType: !305, size: 64, align: 64, offset: 576)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!144, !161, !144}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !151, file: !150, line: 83, baseType: !309, size: 64, align: 64, offset: 640)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!189, !161, !144, !189, !144}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !151, file: !150, line: 85, baseType: !285, size: 64, align: 64, offset: 704)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !151, file: !150, line: 86, baseType: !314, size: 64, align: 64, offset: 768)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!144, !161, !317, !318}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !151, file: !150, line: 88, baseType: !285, size: 64, align: 64, offset: 832)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !151, file: !150, line: 89, baseType: !305, size: 64, align: 64, offset: 896)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !151, file: !150, line: 90, baseType: !144, size: 32, align: 32, offset: 960)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !151, file: !150, line: 91, baseType: !166, size: 64, align: 64, offset: 1024)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !151, file: !150, line: 92, baseType: !144, size: 32, align: 32, offset: 1088)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !151, file: !150, line: 93, baseType: !305, size: 64, align: 64, offset: 1152)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !151, file: !150, line: 94, baseType: !285, size: 64, align: 64, offset: 1216)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !151, file: !150, line: 95, baseType: !327, size: 64, align: 64, offset: 1280)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!144, !161, !330}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !258, line: 101, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !258, line: 86, size: 576, align: 64, elements: !334)
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342, !343, !344}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !333, file: !258, line: 87, baseType: !251, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !333, file: !258, line: 88, baseType: !144, size: 32, align: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !333, file: !258, line: 89, baseType: !144, size: 32, align: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !333, file: !258, line: 91, baseType: !189, size: 64, align: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !333, file: !258, line: 92, baseType: !189, size: 64, align: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !333, file: !258, line: 94, baseType: !189, size: 64, align: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !333, file: !258, line: 96, baseType: !189, size: 64, align: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !333, file: !258, line: 98, baseType: !189, size: 64, align: 64, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !333, file: !258, line: 99, baseType: !189, size: 64, align: 64, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !333, file: !258, line: 100, baseType: !189, size: 64, align: 64, offset: 512)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !151, file: !150, line: 96, baseType: !285, size: 64, align: 64, offset: 1344)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !151, file: !150, line: 97, baseType: !285, size: 64, align: 64, offset: 1408)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !151, file: !150, line: 98, baseType: !348, size: 64, align: 64, offset: 1472)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!144, !161, !161}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !151, file: !150, line: 99, baseType: !154, size: 64, align: 64, offset: 1536)
!352 = distinct !DIGlobalVariable(name: "tcp_class", scope: !0, file: !147, line: 66, type: !167, isLocal: true, isDefinition: true, variable: %struct.AVClass* @tcp_class)
!353 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !147, line: 53, type: !354, isLocal: true, isDefinition: true, variable: [8 x %struct.AVOption]* @options)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 4096, align: 64, elements: !357)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !179)
!357 = !{!358}
!358 = !DISubrange(count: 8)
!359 = !{i32 2, !"Dwarf Version", i32 4}
!360 = !{i32 2, !"Debug Info Version", i32 3}
!361 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!362 = distinct !DISubprogram(name: "tcp_open", scope: !147, file: !147, line: 103, type: !159, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !363)
!363 = !{}
!364 = !DILocalVariable(name: "h", arg: 1, scope: !362, file: !147, line: 103, type: !161)
!365 = !DIExpression()
!366 = !DILocation(line: 103, column: 33, scope: !362)
!367 = !DILocalVariable(name: "uri", arg: 2, scope: !362, file: !147, line: 103, type: !154)
!368 = !DILocation(line: 103, column: 48, scope: !362)
!369 = !DILocalVariable(name: "flags", arg: 3, scope: !362, file: !147, line: 103, type: !144)
!370 = !DILocation(line: 103, column: 57, scope: !362)
!371 = !DILocalVariable(name: "hints", scope: !362, file: !147, line: 105, type: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !373, line: 567, size: 384, align: 64, elements: !374)
!373 = !DIFile(filename: "/usr/include/netdb.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!374 = !{!375, !376, !377, !378, !379, !383, !392, !393}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !372, file: !373, line: 569, baseType: !144, size: 32, align: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !372, file: !373, line: 570, baseType: !144, size: 32, align: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !372, file: !373, line: 571, baseType: !144, size: 32, align: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !372, file: !373, line: 572, baseType: !144, size: 32, align: 32, offset: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !372, file: !373, line: 573, baseType: !380, size: 32, align: 32, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !88, line: 33, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !382, line: 189, baseType: !129)
!382 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !372, file: !373, line: 574, baseType: !384, size: 64, align: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !88, line: 153, size: 128, align: 16, elements: !386)
!386 = !{!387, !388}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !385, file: !88, line: 155, baseType: !120, size: 16, align: 16)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !385, file: !88, line: 156, baseType: !389, size: 112, align: 8, offset: 16)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 112, align: 8, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 14)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !372, file: !373, line: 575, baseType: !251, size: 64, align: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !372, file: !373, line: 576, baseType: !394, size: 64, align: 64, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!395 = !DILocation(line: 105, column: 21, scope: !362)
!396 = !DILocalVariable(name: "ai", scope: !362, file: !147, line: 105, type: !394)
!397 = !DILocation(line: 105, column: 37, scope: !362)
!398 = !DILocalVariable(name: "cur_ai", scope: !362, file: !147, line: 105, type: !394)
!399 = !DILocation(line: 105, column: 42, scope: !362)
!400 = !DILocalVariable(name: "port", scope: !362, file: !147, line: 106, type: !144)
!401 = !DILocation(line: 106, column: 9, scope: !362)
!402 = !DILocalVariable(name: "fd", scope: !362, file: !147, line: 106, type: !144)
!403 = !DILocation(line: 106, column: 15, scope: !362)
!404 = !DILocalVariable(name: "s", scope: !362, file: !147, line: 107, type: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCPContext", file: !147, line: 48, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TCPContext", file: !147, line: 35, size: 384, align: 64, elements: !408)
!408 = !{!409, !410, !411, !412, !413, !414, !415, !416, !417, !418}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !407, file: !147, line: 36, baseType: !166, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !407, file: !147, line: 37, baseType: !144, size: 32, align: 32, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !407, file: !147, line: 38, baseType: !144, size: 32, align: 32, offset: 96)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "open_timeout", scope: !407, file: !147, line: 39, baseType: !144, size: 32, align: 32, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !407, file: !147, line: 40, baseType: !144, size: 32, align: 32, offset: 160)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "listen_timeout", scope: !407, file: !147, line: 41, baseType: !144, size: 32, align: 32, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "recv_buffer_size", scope: !407, file: !147, line: 42, baseType: !144, size: 32, align: 32, offset: 224)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer_size", scope: !407, file: !147, line: 43, baseType: !144, size: 32, align: 32, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !407, file: !147, line: 44, baseType: !144, size: 32, align: 32, offset: 288)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_mss", scope: !407, file: !147, line: 46, baseType: !144, size: 32, align: 32, offset: 320)
!419 = !DILocation(line: 107, column: 17, scope: !362)
!420 = !DILocation(line: 107, column: 21, scope: !362)
!421 = !DILocation(line: 107, column: 24, scope: !362)
!422 = !DILocalVariable(name: "p", scope: !362, file: !147, line: 108, type: !154)
!423 = !DILocation(line: 108, column: 17, scope: !362)
!424 = !DILocalVariable(name: "buf", scope: !362, file: !147, line: 109, type: !425)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 2048, align: 8, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 256)
!428 = !DILocation(line: 109, column: 10, scope: !362)
!429 = !DILocalVariable(name: "ret", scope: !362, file: !147, line: 110, type: !144)
!430 = !DILocation(line: 110, column: 9, scope: !362)
!431 = !DILocalVariable(name: "hostname", scope: !362, file: !147, line: 111, type: !432)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 8192, align: 8, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 1024)
!435 = !DILocation(line: 111, column: 10, scope: !362)
!436 = !DILocalVariable(name: "proto", scope: !362, file: !147, line: 111, type: !432)
!437 = !DILocation(line: 111, column: 25, scope: !362)
!438 = !DILocalVariable(name: "path", scope: !362, file: !147, line: 111, type: !432)
!439 = !DILocation(line: 111, column: 37, scope: !362)
!440 = !DILocalVariable(name: "portstr", scope: !362, file: !147, line: 112, type: !441)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 80, align: 8, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 10)
!444 = !DILocation(line: 112, column: 10, scope: !362)
!445 = !DILocation(line: 113, column: 5, scope: !362)
!446 = !DILocation(line: 113, column: 8, scope: !362)
!447 = !DILocation(line: 113, column: 21, scope: !362)
!448 = !DILocation(line: 115, column: 18, scope: !362)
!449 = !DILocation(line: 115, column: 48, scope: !362)
!450 = !DILocation(line: 116, column: 16, scope: !362)
!451 = !DILocation(line: 116, column: 36, scope: !362)
!452 = !DILocation(line: 115, column: 5, scope: !362)
!453 = !DILocation(line: 117, column: 16, scope: !454)
!454 = distinct !DILexicalBlock(scope: !362, file: !147, line: 117, column: 9)
!455 = !DILocation(line: 117, column: 9, scope: !454)
!456 = !DILocation(line: 117, column: 9, scope: !362)
!457 = !DILocation(line: 118, column: 9, scope: !454)
!458 = !DILocation(line: 119, column: 9, scope: !459)
!459 = distinct !DILexicalBlock(scope: !362, file: !147, line: 119, column: 9)
!460 = !DILocation(line: 119, column: 14, scope: !459)
!461 = !DILocation(line: 119, column: 19, scope: !459)
!462 = !DILocation(line: 119, column: 22, scope: !463)
!463 = !DILexicalBlockFile(scope: !459, file: !147, discriminator: 1)
!464 = !DILocation(line: 119, column: 27, scope: !463)
!465 = !DILocation(line: 119, column: 9, scope: !463)
!466 = !DILocation(line: 120, column: 16, scope: !467)
!467 = distinct !DILexicalBlock(scope: !459, file: !147, line: 119, column: 37)
!468 = !DILocation(line: 120, column: 9, scope: !467)
!469 = !DILocation(line: 121, column: 9, scope: !467)
!470 = !DILocation(line: 123, column: 16, scope: !362)
!471 = !DILocation(line: 123, column: 9, scope: !362)
!472 = !DILocation(line: 123, column: 7, scope: !362)
!473 = !DILocation(line: 124, column: 9, scope: !474)
!474 = distinct !DILexicalBlock(scope: !362, file: !147, line: 124, column: 9)
!475 = !DILocation(line: 124, column: 9, scope: !362)
!476 = !DILocation(line: 125, column: 30, scope: !477)
!477 = distinct !DILexicalBlock(scope: !478, file: !147, line: 125, column: 13)
!478 = distinct !DILexicalBlock(scope: !474, file: !147, line: 124, column: 12)
!479 = !DILocation(line: 125, column: 58, scope: !477)
!480 = !DILocation(line: 125, column: 13, scope: !477)
!481 = !DILocation(line: 125, column: 13, scope: !478)
!482 = !DILocalVariable(name: "endptr", scope: !483, file: !147, line: 126, type: !251)
