; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--mxfenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--mxfenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!955 = !DIEnumerator(name: "INDEX_D10_525_60_30_AUDIO", value: 14)
!956 = !DIEnumerator(name: "INDEX_DV", value: 15)
!957 = !DIEnumerator(name: "INDEX_DV25_525_60", value: 16)
!958 = !DIEnumerator(name: "INDEX_DV25_625_50", value: 17)
!959 = !DIEnumerator(name: "INDEX_DV25_525_60_IEC", value: 18)
!960 = !DIEnumerator(name: "INDEX_DV25_625_50_IEC", value: 19)
!961 = !DIEnumerator(name: "INDEX_DV50_525_60", value: 20)
!962 = !DIEnumerator(name: "INDEX_DV50_625_50", value: 21)
!963 = !DIEnumerator(name: "INDEX_DV100_1080_60", value: 22)
!964 = !DIEnumerator(name: "INDEX_DV100_1080_50", value: 23)
!965 = !DIEnumerator(name: "INDEX_DV100_720_60", value: 24)
!966 = !DIEnumerator(name: "INDEX_DV100_720_50", value: 25)
!967 = !DIEnumerator(name: "INDEX_DNXHD", value: 26)
!968 = !DIEnumerator(name: "INDEX_JPEG2000", value: 27)
!969 = !DIEnumerator(name: "INDEX_H264", value: 28)
!970 = !DIEnumerator(name: "INDEX_S436M", value: 29)
!971 = !DIEnumerator(name: "INDEX_PRORES", value: 30)
!972 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MXFMetadataSetType", file: !973, line: 30, size: 32, align: 32, elements: !974)
!973 = !DIFile(filename: "libavformat/mxf.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!974 = !{!975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994}
!975 = !DIEnumerator(name: "AnyType", value: 0)
!976 = !DIEnumerator(name: "MaterialPackage", value: 1)
!977 = !DIEnumerator(name: "SourcePackage", value: 2)
!978 = !DIEnumerator(name: "SourceClip", value: 3)
!979 = !DIEnumerator(name: "TimecodeComponent", value: 4)
!980 = !DIEnumerator(name: "PulldownComponent", value: 5)
!981 = !DIEnumerator(name: "Sequence", value: 6)
!982 = !DIEnumerator(name: "MultipleDescriptor", value: 7)
!983 = !DIEnumerator(name: "Descriptor", value: 8)
!984 = !DIEnumerator(name: "Track", value: 9)
!985 = !DIEnumerator(name: "CryptoContext", value: 10)
!986 = !DIEnumerator(name: "Preface", value: 11)
!987 = !DIEnumerator(name: "Identification", value: 12)
!988 = !DIEnumerator(name: "ContentStorage", value: 13)
!989 = !DIEnumerator(name: "SubDescriptor", value: 14)
!990 = !DIEnumerator(name: "IndexTableSegment", value: 15)
!991 = !DIEnumerator(name: "EssenceContainerData", value: 16)
!992 = !DIEnumerator(name: "EssenceGroup", value: 17)
!993 = !DIEnumerator(name: "TaggedValue", value: 18)
!994 = !DIEnumerator(name: "TapeDescriptor", value: 19)
!995 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !973, line: 68, size: 32, align: 32, elements: !996)
!996 = !{!997, !998, !999, !1000}
!997 = !DIEnumerator(name: "NormalWrap", value: 0)
!998 = !DIEnumerator(name: "D10D11Wrap", value: 1)
!999 = !DIEnumerator(name: "RawAWrap", value: 2)
!1000 = !DIEnumerator(name: "RawVWrap", value: 3)
!1001 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVTimecodeFlag", file: !1002, line: 35, size: 32, align: 32, elements: !1003)
!1002 = !DIFile(filename: "./libavutil/timecode.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1003 = !{!1004, !1005, !1006}
!1004 = !DIEnumerator(name: "AV_TIMECODE_FLAG_DROPFRAME", value: 1)
!1005 = !DIEnumerator(name: "AV_TIMECODE_FLAG_24HOURSMAX", value: 2)
!1006 = !DIEnumerator(name: "AV_TIMECODE_FLAG_ALLOWNEGATIVE", value: 4)
!1007 = !{!1008, !1011, !1042, !1035, !1081, !1087, !1039, !1091, !1092, !1094}
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1009, line: 40, baseType: !1010)
!1009 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1010 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXFStreamContext", file: !939, line: 102, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXFStreamContext", file: !939, line: 79, size: 1344, align: 64, elements: !1014)
!1014 = !{!1015, !1054, !1059, !1060, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "aic", scope: !1013, file: !939, line: 80, baseType: !1016, size: 448, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "AudioInterleaveContext", file: !1017, line: 37, baseType: !1018)
!1017 = !DIFile(filename: "libavformat/audiointerleave.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AudioInterleaveContext", file: !1017, line: 29, size: 448, align: 64, elements: !1019)
!1019 = !{!1020, !1037, !1038, !1041, !1043, !1046, !1047}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "fifo", scope: !1018, file: !1017, line: 30, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFifoBuffer", file: !1023, line: 35, baseType: !1024)
!1023 = !DIFile(filename: "./libavutil/fifo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFifoBuffer", file: !1023, line: 31, size: 320, align: 64, elements: !1025)
!1025 = !{!1026, !1030, !1031, !1032, !1033, !1036}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1024, file: !1023, line: 32, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1009, line: 48, baseType: !1029)
!1029 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "rptr", scope: !1024, file: !1023, line: 33, baseType: !1027, size: 64, align: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "wptr", scope: !1024, file: !1023, line: 33, baseType: !1027, size: 64, align: 64, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1024, file: !1023, line: 33, baseType: !1027, size: 64, align: 64, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "rndx", scope: !1024, file: !1023, line: 34, baseType: !1034, size: 32, align: 32, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1009, line: 51, baseType: !1035)
!1035 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "wndx", scope: !1024, file: !1023, line: 34, baseType: !1034, size: 32, align: 32, offset: 288)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_size", scope: !1018, file: !1017, line: 31, baseType: !1035, size: 32, align: 32, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1018, file: !1017, line: 32, baseType: !1039, size: 64, align: 64, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1009, line: 55, baseType: !1040)
!1040 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "sample_size", scope: !1018, file: !1017, line: 33, baseType: !1042, size: 32, align: 32, offset: 192)
!1042 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "samples_per_frame", scope: !1018, file: !1017, line: 34, baseType: !1044, size: 64, align: 64, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1042)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1018, file: !1017, line: 35, baseType: !1044, size: 64, align: 64, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1018, file: !1017, line: 36, baseType: !1048, size: 64, align: 32, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1049, line: 61, baseType: !1050)
!1049 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1049, line: 58, size: 64, align: 32, elements: !1051)
!1051 = !{!1052, !1053}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1050, file: !1049, line: 59, baseType: !1042, size: 32, align: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1050, file: !1049, line: 60, baseType: !1042, size: 32, align: 32, offset: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "track_essence_element_key", scope: !1013, file: !939, line: 81, baseType: !1055, size: 128, align: 8, offset: 448)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "UID", file: !973, line: 28, baseType: !1056)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 128, align: 8, elements: !1057)
!1057 = !{!1058}
!1058 = !DISubrange(count: 16)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1013, file: !939, line: 82, baseType: !1042, size: 32, align: 32, offset: 576)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ul", scope: !1013, file: !939, line: 83, baseType: !1061, size: 64, align: 64, offset: 640)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1055)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !1013, file: !939, line: 84, baseType: !1042, size: 32, align: 32, offset: 704)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !1013, file: !939, line: 85, baseType: !1042, size: 32, align: 32, offset: 736)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "field_dominance", scope: !1013, file: !939, line: 86, baseType: !1042, size: 32, align: 32, offset: 768)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "component_depth", scope: !1013, file: !939, line: 87, baseType: !1042, size: 32, align: 32, offset: 800)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "color_siting", scope: !1013, file: !939, line: 88, baseType: !1042, size: 32, align: 32, offset: 832)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "signal_standard", scope: !1013, file: !939, line: 89, baseType: !1042, size: 32, align: 32, offset: 864)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "h_chroma_sub_sample", scope: !1013, file: !939, line: 90, baseType: !1042, size: 32, align: 32, offset: 896)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "v_chroma_sub_sample", scope: !1013, file: !939, line: 91, baseType: !1042, size: 32, align: 32, offset: 928)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_reordering", scope: !1013, file: !939, line: 92, baseType: !1042, size: 32, align: 32, offset: 960)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio", scope: !1013, file: !939, line: 93, baseType: !1048, size: 64, align: 32, offset: 992)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "closed_gop", scope: !1013, file: !939, line: 94, baseType: !1042, size: 32, align: 32, offset: 1056)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "video_bit_rate", scope: !1013, file: !939, line: 95, baseType: !1042, size: 32, align: 32, offset: 1088)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1013, file: !939, line: 96, baseType: !1042, size: 32, align: 32, offset: 1120)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1013, file: !939, line: 97, baseType: !1042, size: 32, align: 32, offset: 1152)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "seq_closed_gop", scope: !1013, file: !939, line: 98, baseType: !1042, size: 32, align: 32, offset: 1184)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "max_gop", scope: !1013, file: !939, line: 99, baseType: !1042, size: 32, align: 32, offset: 1216)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "b_picture_count", scope: !1013, file: !939, line: 100, baseType: !1042, size: 32, align: 32, offset: 1248)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay", scope: !1013, file: !939, line: 101, baseType: !1042, size: 32, align: 32, offset: 1280)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1084, line: 221, size: 32, align: 8, elements: !1085)
!1084 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1085 = !{!1086}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1083, file: !1084, line: 221, baseType: !1034, size: 32, align: 32)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !1084, line: 220, size: 64, align: 8, elements: !1089)
!1089 = !{!1090}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1088, file: !1084, line: 220, baseType: !1039, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !1084, line: 222, size: 16, align: 8, elements: !1097)
!1097 = !{!1098}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1096, file: !1084, line: 222, baseType: !1099, size: 16, align: 16)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1009, line: 49, baseType: !1100)
!1100 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1101 = !{!1102, !2386, !2387, !2388, !2389, !2395, !2404, !2421, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2433, !2442, !2451, !2464, !2476, !2478, !2479, !2480, !2481, !2482, !2492, !2496, !2500, !2502, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2510, !2511, !2512, !2513, !2517, !2518}
!1102 = distinct !DIGlobalVariable(name: "ff_mxf_muxer", scope: !0, file: !939, line: 3108, type: !1103, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_mxf_muxer)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1105)
!1105 = !{!1106, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1127, !1200, !1202, !1203, !2351, !2352, !2353, !2357, !2361, !2365, !2366, !2371, !2372, !2373, !2374, !2375, !2376, !2380}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1104, file: !919, line: 498, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1109)
!1109 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1104, file: !919, line: 504, baseType: !1107, size: 64, align: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1104, file: !919, line: 505, baseType: !1107, size: 64, align: 64, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1104, file: !919, line: 506, baseType: !1107, size: 64, align: 64, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1104, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1104, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1104, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1104, file: !919, line: 517, baseType: !1042, size: 32, align: 32, offset: 352)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1104, file: !919, line: 523, baseType: !1118, size: 64, align: 64, offset: 384)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1123, line: 44, size: 64, align: 32, elements: !1124)
!1123 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1124 = !{!1125, !1126}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1122, file: !1123, line: 45, baseType: !3, size: 32, align: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1122, file: !1123, line: 46, baseType: !1035, size: 32, align: 32, offset: 32)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1104, file: !919, line: 526, baseType: !1128, size: 64, align: 64, offset: 448)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1130)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1132)
!1132 = !{!1133, !1134, !1138, !1159, !1160, !1161, !1162, !1166, !1172, !1174, !1178}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1131, file: !486, line: 72, baseType: !1107, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1131, file: !486, line: 78, baseType: !1135, size: 64, align: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!1107, !1091}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1131, file: !486, line: 85, baseType: !1139, size: 64, align: 64, offset: 128)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1142)
!1142 = !{!1143, !1144, !1145, !1146, !1147, !1155, !1156, !1157, !1158}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1141, file: !464, line: 247, baseType: !1107, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1141, file: !464, line: 253, baseType: !1107, size: 64, align: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1141, file: !464, line: 259, baseType: !1042, size: 32, align: 32, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1141, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1141, file: !464, line: 271, baseType: !1148, size: 64, align: 64, offset: 192)
!1148 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1141, file: !464, line: 265, size: 64, align: 64, elements: !1149)
!1149 = !{!1150, !1151, !1153, !1154}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1148, file: !464, line: 266, baseType: !1008, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1148, file: !464, line: 267, baseType: !1152, size: 64, align: 64)
!1152 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1148, file: !464, line: 268, baseType: !1107, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1148, file: !464, line: 270, baseType: !1048, size: 64, align: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1141, file: !464, line: 272, baseType: !1152, size: 64, align: 64, offset: 256)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1141, file: !464, line: 273, baseType: !1152, size: 64, align: 64, offset: 320)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1141, file: !464, line: 275, baseType: !1042, size: 32, align: 32, offset: 384)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1141, file: !464, line: 300, baseType: !1107, size: 64, align: 64, offset: 448)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1131, file: !486, line: 93, baseType: !1042, size: 32, align: 32, offset: 192)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1131, file: !486, line: 99, baseType: !1042, size: 32, align: 32, offset: 224)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1131, file: !486, line: 108, baseType: !1042, size: 32, align: 32, offset: 256)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1131, file: !486, line: 113, baseType: !1163, size: 64, align: 64, offset: 320)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!1091, !1091, !1091}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1131, file: !486, line: 123, baseType: !1167, size: 64, align: 64, offset: 384)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!1170, !1170}
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1131)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1131, file: !486, line: 130, baseType: !1173, size: 32, align: 32, offset: 448)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1131, file: !486, line: 136, baseType: !1175, size: 64, align: 64, offset: 512)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!1173, !1091}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1131, file: !486, line: 142, baseType: !1179, size: 64, align: 64, offset: 576)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DISubroutineType(types: !1181)
!1181 = !{!1042, !1182, !1091, !1107, !1042}
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1185)
!1185 = !{!1186, !1198, !1199}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1184, file: !464, line: 360, baseType: !1187, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1191)
!1191 = !{!1192, !1193, !1194, !1195, !1196, !1197}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1190, file: !464, line: 307, baseType: !1107, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1190, file: !464, line: 313, baseType: !1152, size: 64, align: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1190, file: !464, line: 313, baseType: !1152, size: 64, align: 64, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1190, file: !464, line: 318, baseType: !1152, size: 64, align: 64, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1190, file: !464, line: 318, baseType: !1152, size: 64, align: 64, offset: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1190, file: !464, line: 323, baseType: !1042, size: 32, align: 32, offset: 320)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1184, file: !464, line: 364, baseType: !1042, size: 32, align: 32, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1184, file: !464, line: 368, baseType: !1042, size: 32, align: 32, offset: 96)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1104, file: !919, line: 535, baseType: !1201, size: 64, align: 64, offset: 512)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1104, file: !919, line: 539, baseType: !1042, size: 32, align: 32, offset: 576)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1104, file: !919, line: 541, baseType: !1204, size: 64, align: 64, offset: 640)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!1042, !1207}
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1209)
!1209 = !{!1210, !1211, !1306, !1307, !1308, !1371, !1372, !1373, !2205, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2259, !2260, !2261, !2262, !2263, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2314, !2315, !2318, !2319, !2320, !2321, !2322, !2323, !2328, !2329, !2330, !2331, !2339, !2340, !2344, !2348, !2349, !2350}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1208, file: !919, line: 1342, baseType: !1128, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1208, file: !919, line: 1349, baseType: !1212, size: 64, align: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1214)
!1214 = !{!1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1238, !1239, !1277, !1278, !1282, !1287, !1288, !1289, !1293, !1299, !1305}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1213, file: !919, line: 638, baseType: !1107, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1213, file: !919, line: 645, baseType: !1107, size: 64, align: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1213, file: !919, line: 652, baseType: !1042, size: 32, align: 32, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1213, file: !919, line: 659, baseType: !1107, size: 64, align: 64, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1213, file: !919, line: 661, baseType: !1118, size: 64, align: 64, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1213, file: !919, line: 663, baseType: !1128, size: 64, align: 64, offset: 320)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1213, file: !919, line: 670, baseType: !1107, size: 64, align: 64, offset: 384)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1213, file: !919, line: 679, baseType: !1212, size: 64, align: 64, offset: 448)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1213, file: !919, line: 684, baseType: !1042, size: 32, align: 32, offset: 512)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1213, file: !919, line: 689, baseType: !1042, size: 32, align: 32, offset: 544)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1213, file: !919, line: 696, baseType: !1226, size: 64, align: 64, offset: 576)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!1042, !1229}
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1232)
!1232 = !{!1233, !1234, !1236, !1237}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1231, file: !919, line: 449, baseType: !1107, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1231, file: !919, line: 450, baseType: !1235, size: 64, align: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1231, file: !919, line: 451, baseType: !1042, size: 32, align: 32, offset: 128)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1231, file: !919, line: 452, baseType: !1107, size: 64, align: 64, offset: 192)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1213, file: !919, line: 703, baseType: !1204, size: 64, align: 64, offset: 640)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1213, file: !919, line: 714, baseType: !1240, size: 64, align: 64, offset: 704)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!1042, !1207, !1243}
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1246)
!1246 = !{!1247, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1273, !1274, !1275, !1276}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1245, file: !4, line: 1451, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1250, line: 94, baseType: !1251)
!1250 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1250, line: 81, size: 192, align: 64, elements: !1252)
!1252 = !{!1253, !1257, !1258}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1251, file: !1250, line: 82, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1250, line: 73, baseType: !1256)
!1256 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1250, line: 73, flags: DIFlagFwdDecl)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1251, file: !1250, line: 89, baseType: !1027, size: 64, align: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1251, file: !1250, line: 93, baseType: !1042, size: 32, align: 32, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1245, file: !4, line: 1461, baseType: !1008, size: 64, align: 64, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1245, file: !4, line: 1467, baseType: !1008, size: 64, align: 64, offset: 128)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1245, file: !4, line: 1468, baseType: !1027, size: 64, align: 64, offset: 192)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1245, file: !4, line: 1469, baseType: !1042, size: 32, align: 32, offset: 256)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1245, file: !4, line: 1470, baseType: !1042, size: 32, align: 32, offset: 288)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1245, file: !4, line: 1474, baseType: !1042, size: 32, align: 32, offset: 320)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1245, file: !4, line: 1479, baseType: !1266, size: 64, align: 64, offset: 384)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1269)
!1269 = !{!1270, !1271, !1272}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1268, file: !4, line: 1412, baseType: !1027, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1268, file: !4, line: 1413, baseType: !1042, size: 32, align: 32, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1268, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1245, file: !4, line: 1480, baseType: !1042, size: 32, align: 32, offset: 448)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1245, file: !4, line: 1486, baseType: !1008, size: 64, align: 64, offset: 512)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1245, file: !4, line: 1488, baseType: !1008, size: 64, align: 64, offset: 576)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1245, file: !4, line: 1497, baseType: !1008, size: 64, align: 64, offset: 640)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1213, file: !919, line: 720, baseType: !1204, size: 64, align: 64, offset: 768)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1213, file: !919, line: 730, baseType: !1279, size: 64, align: 64, offset: 832)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!1042, !1207, !1042, !1008, !1042}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1213, file: !919, line: 737, baseType: !1283, size: 64, align: 64, offset: 896)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!1008, !1207, !1042, !1286, !1008}
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1213, file: !919, line: 744, baseType: !1204, size: 64, align: 64, offset: 960)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1213, file: !919, line: 750, baseType: !1204, size: 64, align: 64, offset: 1024)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1213, file: !919, line: 758, baseType: !1290, size: 64, align: 64, offset: 1088)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!1042, !1207, !1042, !1008, !1008, !1008, !1042}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1213, file: !919, line: 764, baseType: !1294, size: 64, align: 64, offset: 1152)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!1042, !1207, !1297}
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1213, file: !919, line: 770, baseType: !1300, size: 64, align: 64, offset: 1216)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!1042, !1207, !1303}
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1213, file: !919, line: 776, baseType: !1300, size: 64, align: 64, offset: 1280)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1208, file: !919, line: 1356, baseType: !1201, size: 64, align: 64, offset: 128)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1208, file: !919, line: 1365, baseType: !1091, size: 64, align: 64, offset: 192)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1208, file: !919, line: 1379, baseType: !1309, size: 64, align: 64, offset: 256)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1311)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1312)
!1312 = !{!1313, !1314, !1315, !1316, !1317, !1318, !1319, !1323, !1324, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1338, !1339, !1343, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1361, !1362, !1363, !1364, !1368, !1369, !1370}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1311, file: !537, line: 174, baseType: !1128, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1311, file: !537, line: 226, baseType: !1235, size: 64, align: 64, offset: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1311, file: !537, line: 227, baseType: !1042, size: 32, align: 32, offset: 128)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1311, file: !537, line: 228, baseType: !1235, size: 64, align: 64, offset: 192)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1311, file: !537, line: 229, baseType: !1235, size: 64, align: 64, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1311, file: !537, line: 233, baseType: !1091, size: 64, align: 64, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1311, file: !537, line: 235, baseType: !1320, size: 64, align: 64, offset: 384)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!1042, !1091, !1027, !1042}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1311, file: !537, line: 236, baseType: !1320, size: 64, align: 64, offset: 448)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1311, file: !537, line: 237, baseType: !1325, size: 64, align: 64, offset: 512)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{!1008, !1091, !1008, !1042}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1311, file: !537, line: 238, baseType: !1008, size: 64, align: 64, offset: 576)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1311, file: !537, line: 239, baseType: !1042, size: 32, align: 32, offset: 640)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1311, file: !537, line: 240, baseType: !1042, size: 32, align: 32, offset: 672)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1311, file: !537, line: 241, baseType: !1042, size: 32, align: 32, offset: 704)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1311, file: !537, line: 242, baseType: !1040, size: 64, align: 64, offset: 768)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1311, file: !537, line: 243, baseType: !1235, size: 64, align: 64, offset: 832)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1311, file: !537, line: 244, baseType: !1335, size: 64, align: 64, offset: 896)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DISubroutineType(types: !1337)
!1337 = !{!1040, !1040, !1092, !1035}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1311, file: !537, line: 245, baseType: !1042, size: 32, align: 32, offset: 960)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1311, file: !537, line: 249, baseType: !1340, size: 64, align: 64, offset: 1024)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!1042, !1091, !1042}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1311, file: !537, line: 255, baseType: !1344, size: 64, align: 64, offset: 1088)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DISubroutineType(types: !1346)
!1346 = !{!1008, !1091, !1042, !1008, !1042}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1311, file: !537, line: 260, baseType: !1042, size: 32, align: 32, offset: 1152)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1311, file: !537, line: 266, baseType: !1008, size: 64, align: 64, offset: 1216)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1311, file: !537, line: 273, baseType: !1042, size: 32, align: 32, offset: 1280)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1311, file: !537, line: 279, baseType: !1008, size: 64, align: 64, offset: 1344)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1311, file: !537, line: 285, baseType: !1042, size: 32, align: 32, offset: 1408)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1311, file: !537, line: 291, baseType: !1042, size: 32, align: 32, offset: 1440)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1311, file: !537, line: 298, baseType: !1042, size: 32, align: 32, offset: 1472)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1311, file: !537, line: 304, baseType: !1042, size: 32, align: 32, offset: 1504)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1311, file: !537, line: 309, baseType: !1107, size: 64, align: 64, offset: 1536)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1311, file: !537, line: 314, baseType: !1107, size: 64, align: 64, offset: 1600)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1311, file: !537, line: 319, baseType: !1358, size: 64, align: 64, offset: 1664)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DISubroutineType(types: !1360)
!1360 = !{!1042, !1091, !1027, !1042, !536, !1008}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1311, file: !537, line: 326, baseType: !1042, size: 32, align: 32, offset: 1728)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1311, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1311, file: !537, line: 332, baseType: !1008, size: 64, align: 64, offset: 1792)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1311, file: !537, line: 338, baseType: !1365, size: 64, align: 64, offset: 1856)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{!1042, !1091}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1311, file: !537, line: 340, baseType: !1008, size: 64, align: 64, offset: 1920)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1311, file: !537, line: 346, baseType: !1235, size: 64, align: 64, offset: 1984)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1311, file: !537, line: 351, baseType: !1042, size: 32, align: 32, offset: 2048)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1208, file: !919, line: 1386, baseType: !1042, size: 32, align: 32, offset: 320)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1208, file: !919, line: 1393, baseType: !1035, size: 32, align: 32, offset: 352)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1208, file: !919, line: 1405, baseType: !1374, size: 64, align: 64, offset: 384)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1378)
!1378 = !{!1379, !1380, !1381, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2130, !2136, !2137, !2141, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2173, !2174, !2175, !2176, !2177, !2178}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1377, file: !919, line: 866, baseType: !1042, size: 32, align: 32)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1377, file: !919, line: 872, baseType: !1042, size: 32, align: 32, offset: 32)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1377, file: !919, line: 878, baseType: !1382, size: 64, align: 64, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1384)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1385)
!1385 = !{!1386, !1387, !1388, !1389, !1611, !1612, !1613, !1614, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1767, !1771, !1772, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1951, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1384, file: !4, line: 1561, baseType: !1128, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1384, file: !4, line: 1562, baseType: !1042, size: 32, align: 32, offset: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1384, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1384, file: !4, line: 1565, baseType: !1390, size: 64, align: 64, offset: 128)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1393)
!1393 = !{!1394, !1395, !1396, !1397, !1398, !1399, !1402, !1405, !1406, !1409, !1412, !1413, !1414, !1422, !1423, !1424, !1426, !1430, !1436, !1445, !1449, !1450, !1495, !1582, !1586, !1587, !1591, !1595, !1600, !1604, !1605, !1606}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1392, file: !4, line: 3475, baseType: !1107, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1392, file: !4, line: 3480, baseType: !1107, size: 64, align: 64, offset: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1392, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1392, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1392, file: !4, line: 3487, baseType: !1042, size: 32, align: 32, offset: 192)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1392, file: !4, line: 3488, baseType: !1400, size: 64, align: 64, offset: 256)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1392, file: !4, line: 3489, baseType: !1403, size: 64, align: 64, offset: 320)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1392, file: !4, line: 3490, baseType: !1044, size: 64, align: 64, offset: 384)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1392, file: !4, line: 3491, baseType: !1407, size: 64, align: 64, offset: 448)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1392, file: !4, line: 3492, baseType: !1410, size: 64, align: 64, offset: 512)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1392, file: !4, line: 3493, baseType: !1028, size: 8, align: 8, offset: 576)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1392, file: !4, line: 3494, baseType: !1128, size: 64, align: 64, offset: 640)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1392, file: !4, line: 3495, baseType: !1415, size: 64, align: 64, offset: 704)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1417)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1418)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1419)
!1419 = !{!1420, !1421}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1418, file: !4, line: 3402, baseType: !1042, size: 32, align: 32)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1418, file: !4, line: 3403, baseType: !1107, size: 64, align: 64, offset: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1392, file: !4, line: 3507, baseType: !1107, size: 64, align: 64, offset: 768)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1392, file: !4, line: 3516, baseType: !1042, size: 32, align: 32, offset: 832)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1392, file: !4, line: 3517, baseType: !1425, size: 64, align: 64, offset: 896)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1392, file: !4, line: 3527, baseType: !1427, size: 64, align: 64, offset: 960)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!1042, !1382}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1392, file: !4, line: 3535, baseType: !1431, size: 64, align: 64, offset: 1024)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{!1042, !1382, !1434}
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1383)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1392, file: !4, line: 3541, baseType: !1437, size: 64, align: 64, offset: 1088)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1439)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1440)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1441, line: 223, size: 128, align: 64, elements: !1442)
!1441 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1442 = !{!1443, !1444}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1440, file: !1441, line: 224, baseType: !1092, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1440, file: !1441, line: 225, baseType: !1092, size: 64, align: 64, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1392, file: !4, line: 3549, baseType: !1446, size: 64, align: 64, offset: 1152)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DISubroutineType(types: !1448)
!1448 = !{null, !1425}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1392, file: !4, line: 3551, baseType: !1427, size: 64, align: 64, offset: 1216)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1392, file: !4, line: 3552, baseType: !1451, size: 64, align: 64, offset: 1280)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DISubroutineType(types: !1453)
!1453 = !{!1042, !1382, !1027, !1042, !1454}
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1456)
!1456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1457)
!1457 = !{!1458, !1459, !1460, !1461, !1462, !1494}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1456, file: !4, line: 3921, baseType: !1099, size: 16, align: 16)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1456, file: !4, line: 3922, baseType: !1034, size: 32, align: 32, offset: 32)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1456, file: !4, line: 3923, baseType: !1034, size: 32, align: 32, offset: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1456, file: !4, line: 3924, baseType: !1035, size: 32, align: 32, offset: 96)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1456, file: !4, line: 3925, baseType: !1463, size: 64, align: 64, offset: 128)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1466)
!1466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1467)
!1467 = !{!1468, !1469, !1470, !1471, !1472, !1473, !1483, !1487, !1489, !1490, !1492, !1493}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1466, file: !4, line: 3886, baseType: !1042, size: 32, align: 32)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1466, file: !4, line: 3887, baseType: !1042, size: 32, align: 32, offset: 32)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1466, file: !4, line: 3888, baseType: !1042, size: 32, align: 32, offset: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1466, file: !4, line: 3889, baseType: !1042, size: 32, align: 32, offset: 96)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1466, file: !4, line: 3890, baseType: !1042, size: 32, align: 32, offset: 128)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1466, file: !4, line: 3897, baseType: !1474, size: 768, align: 64, offset: 192)
!1474 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1475)
!1475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1476)
!1476 = !{!1477, !1481}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1475, file: !4, line: 3855, baseType: !1478, size: 512, align: 64)
!1478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1027, size: 512, align: 64, elements: !1479)
!1479 = !{!1480}
!1480 = !DISubrange(count: 8)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1475, file: !4, line: 3857, baseType: !1482, size: 256, align: 32, offset: 512)
!1482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 256, align: 32, elements: !1479)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1466, file: !4, line: 3903, baseType: !1484, size: 256, align: 64, offset: 960)
!1484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1027, size: 256, align: 64, elements: !1485)
!1485 = !{!1486}
!1486 = !DISubrange(count: 4)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1466, file: !4, line: 3904, baseType: !1488, size: 128, align: 32, offset: 1216)
!1488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 128, align: 32, elements: !1485)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1466, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1466, file: !4, line: 3908, baseType: !1491, size: 64, align: 64, offset: 1408)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1466, file: !4, line: 3915, baseType: !1491, size: 64, align: 64, offset: 1472)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1466, file: !4, line: 3917, baseType: !1042, size: 32, align: 32, offset: 1536)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1456, file: !4, line: 3926, baseType: !1008, size: 64, align: 64, offset: 192)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1392, file: !4, line: 3564, baseType: !1496, size: 64, align: 64, offset: 1344)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{!1042, !1382, !1243, !1499, !1581}
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1501)
!1501 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1502)
!1502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1503)
!1503 = !{!1504, !1505, !1506, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1533, !1535, !1536, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1569, !1570, !1571, !1572, !1573, !1574, !1577, !1578, !1579, !1580}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1502, file: !789, line: 282, baseType: !1478, size: 512, align: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1502, file: !789, line: 299, baseType: !1482, size: 256, align: 32, offset: 512)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1502, file: !789, line: 315, baseType: !1507, size: 64, align: 64, offset: 768)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1502, file: !789, line: 326, baseType: !1042, size: 32, align: 32, offset: 832)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1502, file: !789, line: 326, baseType: !1042, size: 32, align: 32, offset: 864)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1502, file: !789, line: 334, baseType: !1042, size: 32, align: 32, offset: 896)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1502, file: !789, line: 341, baseType: !1042, size: 32, align: 32, offset: 928)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1502, file: !789, line: 346, baseType: !1042, size: 32, align: 32, offset: 960)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1502, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1502, file: !789, line: 356, baseType: !1048, size: 64, align: 32, offset: 1024)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1502, file: !789, line: 361, baseType: !1008, size: 64, align: 64, offset: 1088)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1502, file: !789, line: 369, baseType: !1008, size: 64, align: 64, offset: 1152)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1502, file: !789, line: 377, baseType: !1008, size: 64, align: 64, offset: 1216)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1502, file: !789, line: 382, baseType: !1042, size: 32, align: 32, offset: 1280)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1502, file: !789, line: 386, baseType: !1042, size: 32, align: 32, offset: 1312)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1502, file: !789, line: 391, baseType: !1042, size: 32, align: 32, offset: 1344)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1502, file: !789, line: 396, baseType: !1091, size: 64, align: 64, offset: 1408)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1502, file: !789, line: 403, baseType: !1523, size: 512, align: 64, offset: 1472)
!1523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 512, align: 64, elements: !1479)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1502, file: !789, line: 410, baseType: !1042, size: 32, align: 32, offset: 1984)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1502, file: !789, line: 415, baseType: !1042, size: 32, align: 32, offset: 2016)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1502, file: !789, line: 420, baseType: !1042, size: 32, align: 32, offset: 2048)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1502, file: !789, line: 425, baseType: !1042, size: 32, align: 32, offset: 2080)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1502, file: !789, line: 435, baseType: !1008, size: 64, align: 64, offset: 2112)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1502, file: !789, line: 440, baseType: !1042, size: 32, align: 32, offset: 2176)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1502, file: !789, line: 445, baseType: !1039, size: 64, align: 64, offset: 2240)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1502, file: !789, line: 459, baseType: !1532, size: 512, align: 64, offset: 2304)
!1532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1248, size: 512, align: 64, elements: !1479)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1502, file: !789, line: 473, baseType: !1534, size: 64, align: 64, offset: 2816)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1502, file: !789, line: 477, baseType: !1042, size: 32, align: 32, offset: 2880)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1502, file: !789, line: 479, baseType: !1537, size: 64, align: 64, offset: 2944)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1540)
!1540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1541)
!1541 = !{!1542, !1543, !1544, !1545, !1550}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1540, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1540, file: !789, line: 203, baseType: !1027, size: 64, align: 64, offset: 64)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1540, file: !789, line: 204, baseType: !1042, size: 32, align: 32, offset: 128)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1540, file: !789, line: 205, baseType: !1546, size: 64, align: 64, offset: 192)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1548, line: 86, baseType: !1549)
!1548 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1549 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1548, line: 86, flags: DIFlagFwdDecl)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1540, file: !789, line: 206, baseType: !1248, size: 64, align: 64, offset: 256)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1502, file: !789, line: 480, baseType: !1042, size: 32, align: 32, offset: 3008)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1502, file: !789, line: 505, baseType: !1042, size: 32, align: 32, offset: 3040)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1502, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1502, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1502, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1502, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1502, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1502, file: !789, line: 532, baseType: !1008, size: 64, align: 64, offset: 3264)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1502, file: !789, line: 539, baseType: !1008, size: 64, align: 64, offset: 3328)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1502, file: !789, line: 547, baseType: !1008, size: 64, align: 64, offset: 3392)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1502, file: !789, line: 554, baseType: !1546, size: 64, align: 64, offset: 3456)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1502, file: !789, line: 563, baseType: !1042, size: 32, align: 32, offset: 3520)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1502, file: !789, line: 572, baseType: !1042, size: 32, align: 32, offset: 3552)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1502, file: !789, line: 581, baseType: !1042, size: 32, align: 32, offset: 3584)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1502, file: !789, line: 588, baseType: !1566, size: 64, align: 64, offset: 3648)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64, align: 64)
!1567 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1009, line: 36, baseType: !1568)
!1568 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1502, file: !789, line: 593, baseType: !1042, size: 32, align: 32, offset: 3712)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1502, file: !789, line: 596, baseType: !1042, size: 32, align: 32, offset: 3744)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1502, file: !789, line: 599, baseType: !1248, size: 64, align: 64, offset: 3776)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1502, file: !789, line: 605, baseType: !1248, size: 64, align: 64, offset: 3840)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1502, file: !789, line: 616, baseType: !1248, size: 64, align: 64, offset: 3904)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1502, file: !789, line: 626, baseType: !1575, size: 64, align: 64, offset: 3968)
!1575 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1576, line: 216, baseType: !1040)
!1576 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1502, file: !789, line: 627, baseType: !1575, size: 64, align: 64, offset: 4032)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1502, file: !789, line: 628, baseType: !1575, size: 64, align: 64, offset: 4096)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1502, file: !789, line: 629, baseType: !1575, size: 64, align: 64, offset: 4160)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1502, file: !789, line: 645, baseType: !1248, size: 64, align: 64, offset: 4224)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1392, file: !4, line: 3566, baseType: !1583, size: 64, align: 64, offset: 1408)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DISubroutineType(types: !1585)
!1585 = !{!1042, !1382, !1091, !1581, !1243}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1392, file: !4, line: 3567, baseType: !1427, size: 64, align: 64, offset: 1472)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1392, file: !4, line: 3576, baseType: !1588, size: 64, align: 64, offset: 1536)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DISubroutineType(types: !1590)
!1590 = !{!1042, !1382, !1499}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1392, file: !4, line: 3577, baseType: !1592, size: 64, align: 64, offset: 1600)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DISubroutineType(types: !1594)
!1594 = !{!1042, !1382, !1243}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1392, file: !4, line: 3584, baseType: !1596, size: 64, align: 64, offset: 1664)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{!1042, !1382, !1599}
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1392, file: !4, line: 3589, baseType: !1601, size: 64, align: 64, offset: 1728)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DISubroutineType(types: !1603)
!1603 = !{null, !1382}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1392, file: !4, line: 3594, baseType: !1042, size: 32, align: 32, offset: 1792)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1392, file: !4, line: 3600, baseType: !1107, size: 64, align: 64, offset: 1856)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1392, file: !4, line: 3609, baseType: !1607, size: 64, align: 64, offset: 1920)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1610)
!1610 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1384, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1384, file: !4, line: 1581, baseType: !1035, size: 32, align: 32, offset: 224)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1384, file: !4, line: 1583, baseType: !1091, size: 64, align: 64, offset: 256)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1384, file: !4, line: 1591, baseType: !1615, size: 64, align: 64, offset: 320)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1441, line: 129, size: 1664, align: 64, elements: !1617)
!1617 = !{!1618, !1619, !1620, !1621, !1622, !1640, !1641, !1647, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1616, file: !1441, line: 136, baseType: !1042, size: 32, align: 32)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1616, file: !1441, line: 151, baseType: !1042, size: 32, align: 32, offset: 32)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1616, file: !1441, line: 157, baseType: !1042, size: 32, align: 32, offset: 64)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1616, file: !1441, line: 159, baseType: !1599, size: 64, align: 64, offset: 128)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1616, file: !1441, line: 161, baseType: !1623, size: 64, align: 64, offset: 192)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1441, line: 117, baseType: !1625)
!1625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1441, line: 100, size: 832, align: 64, elements: !1626)
!1626 = !{!1627, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1625, file: !1441, line: 105, baseType: !1628, size: 256, align: 64)
!1628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1629, size: 256, align: 64, elements: !1485)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1250, line: 238, baseType: !1631)
!1631 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1250, line: 238, flags: DIFlagFwdDecl)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1625, file: !1441, line: 110, baseType: !1042, size: 32, align: 32, offset: 256)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1625, file: !1441, line: 111, baseType: !1042, size: 32, align: 32, offset: 288)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1625, file: !1441, line: 111, baseType: !1042, size: 32, align: 32, offset: 320)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1625, file: !1441, line: 112, baseType: !1482, size: 256, align: 32, offset: 352)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1625, file: !1441, line: 113, baseType: !1488, size: 128, align: 32, offset: 608)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1625, file: !1441, line: 114, baseType: !1042, size: 32, align: 32, offset: 736)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1625, file: !1441, line: 115, baseType: !1042, size: 32, align: 32, offset: 768)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1625, file: !1441, line: 116, baseType: !1042, size: 32, align: 32, offset: 800)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1616, file: !1441, line: 163, baseType: !1091, size: 64, align: 64, offset: 256)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1616, file: !1441, line: 165, baseType: !1642, size: 128, align: 64, offset: 320)
!1642 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1441, line: 122, baseType: !1643)
!1643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1441, line: 119, size: 128, align: 64, elements: !1644)
!1644 = !{!1645, !1646}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1643, file: !1441, line: 120, baseType: !1243, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1643, file: !1441, line: 121, baseType: !1599, size: 64, align: 64, offset: 64)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1616, file: !1441, line: 166, baseType: !1648, size: 128, align: 64, offset: 448)
!1648 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1441, line: 127, baseType: !1649)
!1649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1441, line: 124, size: 128, align: 64, elements: !1650)
!1650 = !{!1651, !1724}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1649, file: !1441, line: 125, baseType: !1652, size: 64, align: 64)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1655)
!1655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1656)
!1656 = !{!1657, !1658, !1682, !1686, !1687, !1721, !1722, !1723}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1655, file: !4, line: 5751, baseType: !1128, size: 64, align: 64)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1655, file: !4, line: 5756, baseType: !1659, size: 64, align: 64, offset: 64)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1661)
!1661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1662)
!1662 = !{!1663, !1664, !1667, !1668, !1669, !1673, !1677, !1681}
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1661, file: !4, line: 5797, baseType: !1107, size: 64, align: 64)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1661, file: !4, line: 5804, baseType: !1665, size: 64, align: 64, offset: 64)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1661, file: !4, line: 5815, baseType: !1128, size: 64, align: 64, offset: 128)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1661, file: !4, line: 5825, baseType: !1042, size: 32, align: 32, offset: 192)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1661, file: !4, line: 5826, baseType: !1670, size: 64, align: 64, offset: 256)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{!1042, !1653}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1661, file: !4, line: 5827, baseType: !1674, size: 64, align: 64, offset: 320)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DISubroutineType(types: !1676)
!1676 = !{!1042, !1653, !1243}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1661, file: !4, line: 5828, baseType: !1678, size: 64, align: 64, offset: 384)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DISubroutineType(types: !1680)
!1680 = !{null, !1653}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1661, file: !4, line: 5829, baseType: !1678, size: 64, align: 64, offset: 448)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1655, file: !4, line: 5762, baseType: !1683, size: 64, align: 64, offset: 128)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1685)
!1685 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1655, file: !4, line: 5768, baseType: !1091, size: 64, align: 64, offset: 192)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1655, file: !4, line: 5775, baseType: !1688, size: 64, align: 64, offset: 256)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1690)
!1690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1691)
!1691 = !{!1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1690, file: !4, line: 3940, baseType: !545, size: 32, align: 32)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1690, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1690, file: !4, line: 3948, baseType: !1034, size: 32, align: 32, offset: 64)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1690, file: !4, line: 3958, baseType: !1027, size: 64, align: 64, offset: 128)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1690, file: !4, line: 3962, baseType: !1042, size: 32, align: 32, offset: 192)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1690, file: !4, line: 3968, baseType: !1042, size: 32, align: 32, offset: 224)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1690, file: !4, line: 3973, baseType: !1008, size: 64, align: 64, offset: 256)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1690, file: !4, line: 3986, baseType: !1042, size: 32, align: 32, offset: 320)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1690, file: !4, line: 3999, baseType: !1042, size: 32, align: 32, offset: 352)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1690, file: !4, line: 4004, baseType: !1042, size: 32, align: 32, offset: 384)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1690, file: !4, line: 4005, baseType: !1042, size: 32, align: 32, offset: 416)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1690, file: !4, line: 4010, baseType: !1042, size: 32, align: 32, offset: 448)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1690, file: !4, line: 4011, baseType: !1042, size: 32, align: 32, offset: 480)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1690, file: !4, line: 4020, baseType: !1048, size: 64, align: 32, offset: 512)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1690, file: !4, line: 4025, baseType: !889, size: 32, align: 32, offset: 576)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1690, file: !4, line: 4030, baseType: !812, size: 32, align: 32, offset: 608)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1690, file: !4, line: 4031, baseType: !818, size: 32, align: 32, offset: 640)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1690, file: !4, line: 4032, baseType: !836, size: 32, align: 32, offset: 672)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1690, file: !4, line: 4033, baseType: !860, size: 32, align: 32, offset: 704)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1690, file: !4, line: 4034, baseType: !879, size: 32, align: 32, offset: 736)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1690, file: !4, line: 4039, baseType: !1042, size: 32, align: 32, offset: 768)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1690, file: !4, line: 4046, baseType: !1039, size: 64, align: 64, offset: 832)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1690, file: !4, line: 4050, baseType: !1042, size: 32, align: 32, offset: 896)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1690, file: !4, line: 4054, baseType: !1042, size: 32, align: 32, offset: 928)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1690, file: !4, line: 4061, baseType: !1042, size: 32, align: 32, offset: 960)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1690, file: !4, line: 4065, baseType: !1042, size: 32, align: 32, offset: 992)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1690, file: !4, line: 4073, baseType: !1042, size: 32, align: 32, offset: 1024)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1690, file: !4, line: 4080, baseType: !1042, size: 32, align: 32, offset: 1056)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1690, file: !4, line: 4084, baseType: !1042, size: 32, align: 32, offset: 1088)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1655, file: !4, line: 5781, baseType: !1688, size: 64, align: 64, offset: 320)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1655, file: !4, line: 5787, baseType: !1048, size: 64, align: 32, offset: 384)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1655, file: !4, line: 5793, baseType: !1048, size: 64, align: 32, offset: 448)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1649, file: !1441, line: 126, baseType: !1042, size: 32, align: 32, offset: 64)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1616, file: !1441, line: 172, baseType: !1243, size: 64, align: 64, offset: 576)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1616, file: !1441, line: 177, baseType: !1027, size: 64, align: 64, offset: 640)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1616, file: !1441, line: 178, baseType: !1035, size: 32, align: 32, offset: 704)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1616, file: !1441, line: 180, baseType: !1091, size: 64, align: 64, offset: 768)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1616, file: !1441, line: 185, baseType: !1042, size: 32, align: 32, offset: 832)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1616, file: !1441, line: 190, baseType: !1091, size: 64, align: 64, offset: 896)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1616, file: !1441, line: 195, baseType: !1042, size: 32, align: 32, offset: 960)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1616, file: !1441, line: 200, baseType: !1243, size: 64, align: 64, offset: 1024)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1616, file: !1441, line: 201, baseType: !1042, size: 32, align: 32, offset: 1088)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1616, file: !1441, line: 202, baseType: !1599, size: 64, align: 64, offset: 1152)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1616, file: !1441, line: 203, baseType: !1042, size: 32, align: 32, offset: 1216)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1616, file: !1441, line: 205, baseType: !1042, size: 32, align: 32, offset: 1248)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1616, file: !1441, line: 206, baseType: !1042, size: 32, align: 32, offset: 1280)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1616, file: !1441, line: 209, baseType: !1575, size: 64, align: 64, offset: 1344)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1616, file: !1441, line: 212, baseType: !1575, size: 64, align: 64, offset: 1408)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1616, file: !1441, line: 213, baseType: !1599, size: 64, align: 64, offset: 1472)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1616, file: !1441, line: 215, baseType: !1042, size: 32, align: 32, offset: 1536)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1616, file: !1441, line: 217, baseType: !1042, size: 32, align: 32, offset: 1568)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1616, file: !1441, line: 220, baseType: !1042, size: 32, align: 32, offset: 1600)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1384, file: !4, line: 1598, baseType: !1091, size: 64, align: 64, offset: 384)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1384, file: !4, line: 1606, baseType: !1008, size: 64, align: 64, offset: 448)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1384, file: !4, line: 1614, baseType: !1042, size: 32, align: 32, offset: 512)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1384, file: !4, line: 1622, baseType: !1042, size: 32, align: 32, offset: 544)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1384, file: !4, line: 1628, baseType: !1042, size: 32, align: 32, offset: 576)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1384, file: !4, line: 1636, baseType: !1042, size: 32, align: 32, offset: 608)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1384, file: !4, line: 1643, baseType: !1042, size: 32, align: 32, offset: 640)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1384, file: !4, line: 1657, baseType: !1027, size: 64, align: 64, offset: 704)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1384, file: !4, line: 1658, baseType: !1042, size: 32, align: 32, offset: 768)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1384, file: !4, line: 1679, baseType: !1048, size: 64, align: 32, offset: 800)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1384, file: !4, line: 1688, baseType: !1042, size: 32, align: 32, offset: 864)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1384, file: !4, line: 1712, baseType: !1042, size: 32, align: 32, offset: 896)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1384, file: !4, line: 1729, baseType: !1042, size: 32, align: 32, offset: 928)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1384, file: !4, line: 1729, baseType: !1042, size: 32, align: 32, offset: 960)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1384, file: !4, line: 1744, baseType: !1042, size: 32, align: 32, offset: 992)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1384, file: !4, line: 1744, baseType: !1042, size: 32, align: 32, offset: 1024)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1384, file: !4, line: 1751, baseType: !1042, size: 32, align: 32, offset: 1056)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1384, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1384, file: !4, line: 1791, baseType: !1763, size: 64, align: 64, offset: 1152)
!1763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1764, size: 64, align: 64)
!1764 = !DISubroutineType(types: !1765)
!1765 = !{null, !1766, !1499, !1581, !1042, !1042, !1042}
!1766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1384, file: !4, line: 1808, baseType: !1768, size: 64, align: 64, offset: 1216)
!1768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1769, size: 64, align: 64)
!1769 = !DISubroutineType(types: !1770)
!1770 = !{!555, !1766, !1403}
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1384, file: !4, line: 1816, baseType: !1042, size: 32, align: 32, offset: 1280)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1384, file: !4, line: 1825, baseType: !1773, size: 32, align: 32, offset: 1312)
!1773 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1384, file: !4, line: 1830, baseType: !1042, size: 32, align: 32, offset: 1344)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1384, file: !4, line: 1838, baseType: !1773, size: 32, align: 32, offset: 1376)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1384, file: !4, line: 1846, baseType: !1042, size: 32, align: 32, offset: 1408)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1384, file: !4, line: 1851, baseType: !1042, size: 32, align: 32, offset: 1440)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1384, file: !4, line: 1861, baseType: !1773, size: 32, align: 32, offset: 1472)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1384, file: !4, line: 1868, baseType: !1773, size: 32, align: 32, offset: 1504)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1384, file: !4, line: 1875, baseType: !1773, size: 32, align: 32, offset: 1536)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1384, file: !4, line: 1882, baseType: !1773, size: 32, align: 32, offset: 1568)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1384, file: !4, line: 1889, baseType: !1773, size: 32, align: 32, offset: 1600)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1384, file: !4, line: 1896, baseType: !1773, size: 32, align: 32, offset: 1632)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1384, file: !4, line: 1903, baseType: !1773, size: 32, align: 32, offset: 1664)
