; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--oggenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--oggenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !{!939, !942, !943, !944, !949, !956, !962, !963}
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !940, line: 40, baseType: !941)
!940 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!941 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!942 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!943 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !940, line: 48, baseType: !948)
!948 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !952, line: 221, size: 32, align: 8, elements: !953)
!952 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!953 = !{!954}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !951, file: !952, line: 221, baseType: !955, size: 32, align: 32)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !940, line: 51, baseType: !942)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !952, line: 222, size: 16, align: 8, elements: !958)
!958 = !{!959}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !957, file: !952, line: 222, baseType: !960, size: 16, align: 16)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !940, line: 49, baseType: !961)
!961 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!964 = !{!965, !2201, !2202, !2203, !2204, !2205, !2206, !2210, !2211, !2212, !2213}
!965 = distinct !DIGlobalVariable(name: "ff_ogg_muxer", scope: !0, file: !966, line: 763, type: !967, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_ogg_muxer)
!966 = !DIFile(filename: "libavformat/oggenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !969)
!969 = !{!970, !974, !975, !976, !977, !978, !979, !980, !981, !991, !1071, !1073, !1074, !2166, !2167, !2168, !2172, !2176, !2180, !2181, !2186, !2187, !2188, !2189, !2190, !2191, !2195}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !968, file: !919, line: 498, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !968, file: !919, line: 504, baseType: !971, size: 64, align: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !968, file: !919, line: 505, baseType: !971, size: 64, align: 64, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !968, file: !919, line: 506, baseType: !971, size: 64, align: 64, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !968, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !968, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !968, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !968, file: !919, line: 517, baseType: !943, size: 32, align: 32, offset: 352)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !968, file: !919, line: 523, baseType: !982, size: 64, align: 64, offset: 384)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !987, line: 44, size: 64, align: 32, elements: !988)
!987 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !986, file: !987, line: 45, baseType: !3, size: 32, align: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !986, file: !987, line: 46, baseType: !942, size: 32, align: 32, offset: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !968, file: !919, line: 526, baseType: !992, size: 64, align: 64, offset: 448)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !996)
!996 = !{!997, !998, !1003, !1030, !1031, !1032, !1033, !1037, !1043, !1045, !1049}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !995, file: !486, line: 72, baseType: !971, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !995, file: !486, line: 78, baseType: !999, size: 64, align: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!971, !1002}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !995, file: !486, line: 85, baseType: !1004, size: 64, align: 64, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1012, !1026, !1027, !1028, !1029}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1006, file: !464, line: 247, baseType: !971, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1006, file: !464, line: 253, baseType: !971, size: 64, align: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1006, file: !464, line: 259, baseType: !943, size: 32, align: 32, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1006, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1006, file: !464, line: 271, baseType: !1013, size: 64, align: 64, offset: 192)
!1013 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1006, file: !464, line: 265, size: 64, align: 64, elements: !1014)
!1014 = !{!1015, !1016, !1018, !1019}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1013, file: !464, line: 266, baseType: !939, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1013, file: !464, line: 267, baseType: !1017, size: 64, align: 64)
!1017 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1013, file: !464, line: 268, baseType: !971, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1013, file: !464, line: 270, baseType: !1020, size: 64, align: 32)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1021, line: 61, baseType: !1022)
!1021 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1021, line: 58, size: 64, align: 32, elements: !1023)
!1023 = !{!1024, !1025}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1022, file: !1021, line: 59, baseType: !943, size: 32, align: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1022, file: !1021, line: 60, baseType: !943, size: 32, align: 32, offset: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1006, file: !464, line: 272, baseType: !1017, size: 64, align: 64, offset: 256)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1006, file: !464, line: 273, baseType: !1017, size: 64, align: 64, offset: 320)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1006, file: !464, line: 275, baseType: !943, size: 32, align: 32, offset: 384)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1006, file: !464, line: 300, baseType: !971, size: 64, align: 64, offset: 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !995, file: !486, line: 93, baseType: !943, size: 32, align: 32, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !995, file: !486, line: 99, baseType: !943, size: 32, align: 32, offset: 224)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !995, file: !486, line: 108, baseType: !943, size: 32, align: 32, offset: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !995, file: !486, line: 113, baseType: !1034, size: 64, align: 64, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!1002, !1002, !1002}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !995, file: !486, line: 123, baseType: !1038, size: 64, align: 64, offset: 384)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!1041, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !995, file: !486, line: 130, baseType: !1044, size: 32, align: 32, offset: 448)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !995, file: !486, line: 136, baseType: !1046, size: 64, align: 64, offset: 512)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!1044, !1002}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !995, file: !486, line: 142, baseType: !1050, size: 64, align: 64, offset: 576)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!943, !1053, !1002, !971, !943}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1056)
!1056 = !{!1057, !1069, !1070}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1055, file: !464, line: 360, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1062)
!1062 = !{!1063, !1064, !1065, !1066, !1067, !1068}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1061, file: !464, line: 307, baseType: !971, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1061, file: !464, line: 313, baseType: !1017, size: 64, align: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1061, file: !464, line: 313, baseType: !1017, size: 64, align: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1061, file: !464, line: 318, baseType: !1017, size: 64, align: 64, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1061, file: !464, line: 318, baseType: !1017, size: 64, align: 64, offset: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1061, file: !464, line: 323, baseType: !943, size: 32, align: 32, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1055, file: !464, line: 364, baseType: !943, size: 32, align: 32, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1055, file: !464, line: 368, baseType: !943, size: 32, align: 32, offset: 96)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !968, file: !919, line: 535, baseType: !1072, size: 64, align: 64, offset: 512)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !968, file: !919, line: 539, baseType: !943, size: 32, align: 32, offset: 576)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !968, file: !919, line: 541, baseType: !1075, size: 64, align: 64, offset: 640)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!943, !1078}
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1080)
!1080 = !{!1081, !1082, !1177, !1178, !1179, !1243, !1244, !1245, !2020, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2074, !2075, !2076, !2077, !2078, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2129, !2130, !2133, !2134, !2135, !2136, !2137, !2138, !2143, !2144, !2145, !2146, !2154, !2155, !2159, !2163, !2164, !2165}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1079, file: !919, line: 1342, baseType: !992, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1079, file: !919, line: 1349, baseType: !1083, size: 64, align: 64, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1085)
!1085 = !{!1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1109, !1110, !1148, !1149, !1153, !1158, !1159, !1160, !1164, !1170, !1176}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1084, file: !919, line: 638, baseType: !971, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1084, file: !919, line: 645, baseType: !971, size: 64, align: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1084, file: !919, line: 652, baseType: !943, size: 32, align: 32, offset: 128)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1084, file: !919, line: 659, baseType: !971, size: 64, align: 64, offset: 192)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1084, file: !919, line: 661, baseType: !982, size: 64, align: 64, offset: 256)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1084, file: !919, line: 663, baseType: !992, size: 64, align: 64, offset: 320)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1084, file: !919, line: 670, baseType: !971, size: 64, align: 64, offset: 384)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1084, file: !919, line: 679, baseType: !1083, size: 64, align: 64, offset: 448)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1084, file: !919, line: 684, baseType: !943, size: 32, align: 32, offset: 512)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1084, file: !919, line: 689, baseType: !943, size: 32, align: 32, offset: 544)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1084, file: !919, line: 696, baseType: !1097, size: 64, align: 64, offset: 576)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!943, !1100}
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1102)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1103)
!1103 = !{!1104, !1105, !1107, !1108}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1102, file: !919, line: 449, baseType: !971, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1102, file: !919, line: 450, baseType: !1106, size: 64, align: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1102, file: !919, line: 451, baseType: !943, size: 32, align: 32, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1102, file: !919, line: 452, baseType: !971, size: 64, align: 64, offset: 192)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1084, file: !919, line: 703, baseType: !1075, size: 64, align: 64, offset: 640)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1084, file: !919, line: 714, baseType: !1111, size: 64, align: 64, offset: 704)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!943, !1078, !1114}
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1117)
!1117 = !{!1118, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1144, !1145, !1146, !1147}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1116, file: !4, line: 1451, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1121, line: 94, baseType: !1122)
!1121 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1121, line: 81, size: 192, align: 64, elements: !1123)
!1123 = !{!1124, !1128, !1129}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1122, file: !1121, line: 82, baseType: !1125, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1121, line: 73, baseType: !1127)
!1127 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1121, line: 73, flags: DIFlagFwdDecl)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1122, file: !1121, line: 89, baseType: !962, size: 64, align: 64, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1122, file: !1121, line: 93, baseType: !943, size: 32, align: 32, offset: 128)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1116, file: !4, line: 1461, baseType: !939, size: 64, align: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1116, file: !4, line: 1467, baseType: !939, size: 64, align: 64, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1116, file: !4, line: 1468, baseType: !962, size: 64, align: 64, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1116, file: !4, line: 1469, baseType: !943, size: 32, align: 32, offset: 256)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1116, file: !4, line: 1470, baseType: !943, size: 32, align: 32, offset: 288)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1116, file: !4, line: 1474, baseType: !943, size: 32, align: 32, offset: 320)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1116, file: !4, line: 1479, baseType: !1137, size: 64, align: 64, offset: 384)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1139)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1140)
!1140 = !{!1141, !1142, !1143}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1139, file: !4, line: 1412, baseType: !962, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1139, file: !4, line: 1413, baseType: !943, size: 32, align: 32, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1139, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1116, file: !4, line: 1480, baseType: !943, size: 32, align: 32, offset: 448)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1116, file: !4, line: 1486, baseType: !939, size: 64, align: 64, offset: 512)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1116, file: !4, line: 1488, baseType: !939, size: 64, align: 64, offset: 576)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1116, file: !4, line: 1497, baseType: !939, size: 64, align: 64, offset: 640)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1084, file: !919, line: 720, baseType: !1075, size: 64, align: 64, offset: 768)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1084, file: !919, line: 730, baseType: !1150, size: 64, align: 64, offset: 832)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!943, !1078, !943, !939, !943}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1084, file: !919, line: 737, baseType: !1154, size: 64, align: 64, offset: 896)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!939, !1078, !943, !1157, !939}
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1084, file: !919, line: 744, baseType: !1075, size: 64, align: 64, offset: 960)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1084, file: !919, line: 750, baseType: !1075, size: 64, align: 64, offset: 1024)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1084, file: !919, line: 758, baseType: !1161, size: 64, align: 64, offset: 1088)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!943, !1078, !943, !939, !939, !939, !943}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1084, file: !919, line: 764, baseType: !1165, size: 64, align: 64, offset: 1152)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!943, !1078, !1168}
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1084, file: !919, line: 770, baseType: !1171, size: 64, align: 64, offset: 1216)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!943, !1078, !1174}
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1084, file: !919, line: 776, baseType: !1171, size: 64, align: 64, offset: 1280)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1079, file: !919, line: 1356, baseType: !1072, size: 64, align: 64, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1079, file: !919, line: 1365, baseType: !1002, size: 64, align: 64, offset: 192)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1079, file: !919, line: 1379, baseType: !1180, size: 64, align: 64, offset: 256)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1183)
!1183 = !{!1184, !1185, !1186, !1187, !1188, !1189, !1190, !1194, !1195, !1199, !1200, !1201, !1202, !1203, !1205, !1206, !1210, !1211, !1215, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1233, !1234, !1235, !1236, !1240, !1241, !1242}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1182, file: !537, line: 174, baseType: !992, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1182, file: !537, line: 226, baseType: !1106, size: 64, align: 64, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1182, file: !537, line: 227, baseType: !943, size: 32, align: 32, offset: 128)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1182, file: !537, line: 228, baseType: !1106, size: 64, align: 64, offset: 192)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1182, file: !537, line: 229, baseType: !1106, size: 64, align: 64, offset: 256)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1182, file: !537, line: 233, baseType: !1002, size: 64, align: 64, offset: 320)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1182, file: !537, line: 235, baseType: !1191, size: 64, align: 64, offset: 384)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!943, !1002, !962, !943}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1182, file: !537, line: 236, baseType: !1191, size: 64, align: 64, offset: 448)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1182, file: !537, line: 237, baseType: !1196, size: 64, align: 64, offset: 512)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!939, !1002, !939, !943}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1182, file: !537, line: 238, baseType: !939, size: 64, align: 64, offset: 576)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1182, file: !537, line: 239, baseType: !943, size: 32, align: 32, offset: 640)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1182, file: !537, line: 240, baseType: !943, size: 32, align: 32, offset: 672)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1182, file: !537, line: 241, baseType: !943, size: 32, align: 32, offset: 704)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1182, file: !537, line: 242, baseType: !1204, size: 64, align: 64, offset: 768)
!1204 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1182, file: !537, line: 243, baseType: !1106, size: 64, align: 64, offset: 832)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1182, file: !537, line: 244, baseType: !1207, size: 64, align: 64, offset: 896)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!1204, !1204, !945, !942}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1182, file: !537, line: 245, baseType: !943, size: 32, align: 32, offset: 960)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1182, file: !537, line: 249, baseType: !1212, size: 64, align: 64, offset: 1024)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!943, !1002, !943}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1182, file: !537, line: 255, baseType: !1216, size: 64, align: 64, offset: 1088)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!939, !1002, !943, !939, !943}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1182, file: !537, line: 260, baseType: !943, size: 32, align: 32, offset: 1152)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1182, file: !537, line: 266, baseType: !939, size: 64, align: 64, offset: 1216)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1182, file: !537, line: 273, baseType: !943, size: 32, align: 32, offset: 1280)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1182, file: !537, line: 279, baseType: !939, size: 64, align: 64, offset: 1344)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1182, file: !537, line: 285, baseType: !943, size: 32, align: 32, offset: 1408)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1182, file: !537, line: 291, baseType: !943, size: 32, align: 32, offset: 1440)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1182, file: !537, line: 298, baseType: !943, size: 32, align: 32, offset: 1472)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1182, file: !537, line: 304, baseType: !943, size: 32, align: 32, offset: 1504)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1182, file: !537, line: 309, baseType: !971, size: 64, align: 64, offset: 1536)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1182, file: !537, line: 314, baseType: !971, size: 64, align: 64, offset: 1600)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1182, file: !537, line: 319, baseType: !1230, size: 64, align: 64, offset: 1664)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!943, !1002, !962, !943, !536, !939}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1182, file: !537, line: 326, baseType: !943, size: 32, align: 32, offset: 1728)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1182, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1182, file: !537, line: 332, baseType: !939, size: 64, align: 64, offset: 1792)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1182, file: !537, line: 338, baseType: !1237, size: 64, align: 64, offset: 1856)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!943, !1002}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1182, file: !537, line: 340, baseType: !939, size: 64, align: 64, offset: 1920)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1182, file: !537, line: 346, baseType: !1106, size: 64, align: 64, offset: 1984)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1182, file: !537, line: 351, baseType: !943, size: 32, align: 32, offset: 2048)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1079, file: !919, line: 1386, baseType: !943, size: 32, align: 32, offset: 320)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1079, file: !919, line: 1393, baseType: !942, size: 32, align: 32, offset: 352)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1079, file: !919, line: 1405, baseType: !1246, size: 64, align: 64, offset: 384)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1249)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1250)
!1250 = !{!1251, !1252, !1253, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1807, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1906, !1912, !1913, !1917, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1949, !1950, !1951, !1952, !1953, !1954}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1249, file: !919, line: 866, baseType: !943, size: 32, align: 32)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1249, file: !919, line: 872, baseType: !943, size: 32, align: 32, offset: 32)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1249, file: !919, line: 878, baseType: !1254, size: 64, align: 64, offset: 64)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1257)
!1257 = !{!1258, !1259, !1260, !1261, !1482, !1483, !1484, !1485, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1511, !1515, !1516, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1695, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1256, file: !4, line: 1561, baseType: !992, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1256, file: !4, line: 1562, baseType: !943, size: 32, align: 32, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1256, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1256, file: !4, line: 1565, baseType: !1262, size: 64, align: 64, offset: 128)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1265)
!1265 = !{!1266, !1267, !1268, !1269, !1270, !1271, !1274, !1277, !1280, !1283, !1287, !1288, !1289, !1297, !1298, !1299, !1301, !1305, !1311, !1316, !1320, !1321, !1366, !1453, !1457, !1458, !1462, !1466, !1471, !1475, !1476, !1477}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1264, file: !4, line: 3475, baseType: !971, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1264, file: !4, line: 3480, baseType: !971, size: 64, align: 64, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1264, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1264, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1264, file: !4, line: 3487, baseType: !943, size: 32, align: 32, offset: 192)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1264, file: !4, line: 3488, baseType: !1272, size: 64, align: 64, offset: 256)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1264, file: !4, line: 3489, baseType: !1275, size: 64, align: 64, offset: 320)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1264, file: !4, line: 3490, baseType: !1278, size: 64, align: 64, offset: 384)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1264, file: !4, line: 3491, baseType: !1281, size: 64, align: 64, offset: 448)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1264, file: !4, line: 3492, baseType: !1284, size: 64, align: 64, offset: 512)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1286)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !940, line: 55, baseType: !1204)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1264, file: !4, line: 3493, baseType: !947, size: 8, align: 8, offset: 576)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1264, file: !4, line: 3494, baseType: !992, size: 64, align: 64, offset: 640)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1264, file: !4, line: 3495, baseType: !1290, size: 64, align: 64, offset: 704)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1292)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1293)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1294)
!1294 = !{!1295, !1296}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1293, file: !4, line: 3402, baseType: !943, size: 32, align: 32)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1293, file: !4, line: 3403, baseType: !971, size: 64, align: 64, offset: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1264, file: !4, line: 3507, baseType: !971, size: 64, align: 64, offset: 768)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1264, file: !4, line: 3516, baseType: !943, size: 32, align: 32, offset: 832)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1264, file: !4, line: 3517, baseType: !1300, size: 64, align: 64, offset: 896)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1264, file: !4, line: 3527, baseType: !1302, size: 64, align: 64, offset: 960)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!943, !1254}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1264, file: !4, line: 3535, baseType: !1306, size: 64, align: 64, offset: 1024)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!943, !1254, !1309}
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1255)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1264, file: !4, line: 3541, baseType: !1312, size: 64, align: 64, offset: 1088)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1314)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1315)
!1315 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1264, file: !4, line: 3549, baseType: !1317, size: 64, align: 64, offset: 1152)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{null, !1300}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1264, file: !4, line: 3551, baseType: !1302, size: 64, align: 64, offset: 1216)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1264, file: !4, line: 3552, baseType: !1322, size: 64, align: 64, offset: 1280)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!943, !1254, !962, !943, !1325}
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1327)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1328)
!1328 = !{!1329, !1330, !1331, !1332, !1333, !1365}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1327, file: !4, line: 3921, baseType: !960, size: 16, align: 16)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1327, file: !4, line: 3922, baseType: !955, size: 32, align: 32, offset: 32)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1327, file: !4, line: 3923, baseType: !955, size: 32, align: 32, offset: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1327, file: !4, line: 3924, baseType: !942, size: 32, align: 32, offset: 96)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1327, file: !4, line: 3925, baseType: !1334, size: 64, align: 64, offset: 128)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1337)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1338)
!1338 = !{!1339, !1340, !1341, !1342, !1343, !1344, !1354, !1358, !1360, !1361, !1363, !1364}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1337, file: !4, line: 3886, baseType: !943, size: 32, align: 32)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1337, file: !4, line: 3887, baseType: !943, size: 32, align: 32, offset: 32)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1337, file: !4, line: 3888, baseType: !943, size: 32, align: 32, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1337, file: !4, line: 3889, baseType: !943, size: 32, align: 32, offset: 96)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1337, file: !4, line: 3890, baseType: !943, size: 32, align: 32, offset: 128)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1337, file: !4, line: 3897, baseType: !1345, size: 768, align: 64, offset: 192)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1346)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1347)
!1347 = !{!1348, !1352}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1346, file: !4, line: 3855, baseType: !1349, size: 512, align: 64)
!1349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 512, align: 64, elements: !1350)
!1350 = !{!1351}
!1351 = !DISubrange(count: 8)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1346, file: !4, line: 3857, baseType: !1353, size: 256, align: 32, offset: 512)
!1353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 256, align: 32, elements: !1350)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1337, file: !4, line: 3903, baseType: !1355, size: 256, align: 64, offset: 960)
!1355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 256, align: 64, elements: !1356)
!1356 = !{!1357}
!1357 = !DISubrange(count: 4)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1337, file: !4, line: 3904, baseType: !1359, size: 128, align: 32, offset: 1216)
!1359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 128, align: 32, elements: !1356)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1337, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1337, file: !4, line: 3908, baseType: !1362, size: 64, align: 64, offset: 1408)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1337, file: !4, line: 3915, baseType: !1362, size: 64, align: 64, offset: 1472)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1337, file: !4, line: 3917, baseType: !943, size: 32, align: 32, offset: 1536)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1327, file: !4, line: 3926, baseType: !939, size: 64, align: 64, offset: 192)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1264, file: !4, line: 3564, baseType: !1367, size: 64, align: 64, offset: 1344)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DISubroutineType(types: !1369)
!1369 = !{!943, !1254, !1114, !1370, !1452}
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1372)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1373)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1374)
!1374 = !{!1375, !1376, !1377, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1404, !1406, !1407, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1440, !1441, !1442, !1443, !1444, !1445, !1448, !1449, !1450, !1451}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1373, file: !789, line: 282, baseType: !1349, size: 512, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1373, file: !789, line: 299, baseType: !1353, size: 256, align: 32, offset: 512)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1373, file: !789, line: 315, baseType: !1378, size: 64, align: 64, offset: 768)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1373, file: !789, line: 326, baseType: !943, size: 32, align: 32, offset: 832)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1373, file: !789, line: 326, baseType: !943, size: 32, align: 32, offset: 864)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1373, file: !789, line: 334, baseType: !943, size: 32, align: 32, offset: 896)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1373, file: !789, line: 341, baseType: !943, size: 32, align: 32, offset: 928)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1373, file: !789, line: 346, baseType: !943, size: 32, align: 32, offset: 960)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1373, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1373, file: !789, line: 356, baseType: !1020, size: 64, align: 32, offset: 1024)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1373, file: !789, line: 361, baseType: !939, size: 64, align: 64, offset: 1088)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1373, file: !789, line: 369, baseType: !939, size: 64, align: 64, offset: 1152)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1373, file: !789, line: 377, baseType: !939, size: 64, align: 64, offset: 1216)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1373, file: !789, line: 382, baseType: !943, size: 32, align: 32, offset: 1280)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1373, file: !789, line: 386, baseType: !943, size: 32, align: 32, offset: 1312)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1373, file: !789, line: 391, baseType: !943, size: 32, align: 32, offset: 1344)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1373, file: !789, line: 396, baseType: !1002, size: 64, align: 64, offset: 1408)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1373, file: !789, line: 403, baseType: !1394, size: 512, align: 64, offset: 1472)
!1394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1286, size: 512, align: 64, elements: !1350)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1373, file: !789, line: 410, baseType: !943, size: 32, align: 32, offset: 1984)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1373, file: !789, line: 415, baseType: !943, size: 32, align: 32, offset: 2016)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1373, file: !789, line: 420, baseType: !943, size: 32, align: 32, offset: 2048)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1373, file: !789, line: 425, baseType: !943, size: 32, align: 32, offset: 2080)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1373, file: !789, line: 435, baseType: !939, size: 64, align: 64, offset: 2112)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1373, file: !789, line: 440, baseType: !943, size: 32, align: 32, offset: 2176)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1373, file: !789, line: 445, baseType: !1286, size: 64, align: 64, offset: 2240)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1373, file: !789, line: 459, baseType: !1403, size: 512, align: 64, offset: 2304)
!1403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1119, size: 512, align: 64, elements: !1350)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1373, file: !789, line: 473, baseType: !1405, size: 64, align: 64, offset: 2816)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1373, file: !789, line: 477, baseType: !943, size: 32, align: 32, offset: 2880)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1373, file: !789, line: 479, baseType: !1408, size: 64, align: 64, offset: 2944)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1411)
!1411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1412)
!1412 = !{!1413, !1414, !1415, !1416, !1421}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1411, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1411, file: !789, line: 203, baseType: !962, size: 64, align: 64, offset: 64)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1411, file: !789, line: 204, baseType: !943, size: 32, align: 32, offset: 128)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1411, file: !789, line: 205, baseType: !1417, size: 64, align: 64, offset: 192)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1419, line: 86, baseType: !1420)
!1419 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1420 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1419, line: 86, flags: DIFlagFwdDecl)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1411, file: !789, line: 206, baseType: !1119, size: 64, align: 64, offset: 256)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1373, file: !789, line: 480, baseType: !943, size: 32, align: 32, offset: 3008)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1373, file: !789, line: 505, baseType: !943, size: 32, align: 32, offset: 3040)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1373, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1373, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1373, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1373, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1373, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1373, file: !789, line: 532, baseType: !939, size: 64, align: 64, offset: 3264)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1373, file: !789, line: 539, baseType: !939, size: 64, align: 64, offset: 3328)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1373, file: !789, line: 547, baseType: !939, size: 64, align: 64, offset: 3392)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1373, file: !789, line: 554, baseType: !1417, size: 64, align: 64, offset: 3456)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1373, file: !789, line: 563, baseType: !943, size: 32, align: 32, offset: 3520)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1373, file: !789, line: 572, baseType: !943, size: 32, align: 32, offset: 3552)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1373, file: !789, line: 581, baseType: !943, size: 32, align: 32, offset: 3584)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1373, file: !789, line: 588, baseType: !1437, size: 64, align: 64, offset: 3648)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !940, line: 36, baseType: !1439)
!1439 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1373, file: !789, line: 593, baseType: !943, size: 32, align: 32, offset: 3712)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1373, file: !789, line: 596, baseType: !943, size: 32, align: 32, offset: 3744)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1373, file: !789, line: 599, baseType: !1119, size: 64, align: 64, offset: 3776)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1373, file: !789, line: 605, baseType: !1119, size: 64, align: 64, offset: 3840)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1373, file: !789, line: 616, baseType: !1119, size: 64, align: 64, offset: 3904)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1373, file: !789, line: 626, baseType: !1446, size: 64, align: 64, offset: 3968)
!1446 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1447, line: 216, baseType: !1204)
!1447 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1373, file: !789, line: 627, baseType: !1446, size: 64, align: 64, offset: 4032)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1373, file: !789, line: 628, baseType: !1446, size: 64, align: 64, offset: 4096)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1373, file: !789, line: 629, baseType: !1446, size: 64, align: 64, offset: 4160)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1373, file: !789, line: 645, baseType: !1119, size: 64, align: 64, offset: 4224)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1264, file: !4, line: 3566, baseType: !1454, size: 64, align: 64, offset: 1408)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DISubroutineType(types: !1456)
!1456 = !{!943, !1254, !1002, !1452, !1114}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1264, file: !4, line: 3567, baseType: !1302, size: 64, align: 64, offset: 1472)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1264, file: !4, line: 3576, baseType: !1459, size: 64, align: 64, offset: 1536)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DISubroutineType(types: !1461)
!1461 = !{!943, !1254, !1370}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1264, file: !4, line: 3577, baseType: !1463, size: 64, align: 64, offset: 1600)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DISubroutineType(types: !1465)
!1465 = !{!943, !1254, !1114}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1264, file: !4, line: 3584, baseType: !1467, size: 64, align: 64, offset: 1664)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DISubroutineType(types: !1469)
!1469 = !{!943, !1254, !1470}
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1264, file: !4, line: 3589, baseType: !1472, size: 64, align: 64, offset: 1728)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{null, !1254}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1264, file: !4, line: 3594, baseType: !943, size: 32, align: 32, offset: 1792)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1264, file: !4, line: 3600, baseType: !971, size: 64, align: 64, offset: 1856)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1264, file: !4, line: 3609, baseType: !1478, size: 64, align: 64, offset: 1920)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1481)
!1481 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1256, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1256, file: !4, line: 1581, baseType: !942, size: 32, align: 32, offset: 224)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1256, file: !4, line: 1583, baseType: !1002, size: 64, align: 64, offset: 256)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1256, file: !4, line: 1591, baseType: !1486, size: 64, align: 64, offset: 320)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1256, file: !4, line: 1598, baseType: !1002, size: 64, align: 64, offset: 384)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1256, file: !4, line: 1606, baseType: !939, size: 64, align: 64, offset: 448)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1256, file: !4, line: 1614, baseType: !943, size: 32, align: 32, offset: 512)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1256, file: !4, line: 1622, baseType: !943, size: 32, align: 32, offset: 544)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1256, file: !4, line: 1628, baseType: !943, size: 32, align: 32, offset: 576)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1256, file: !4, line: 1636, baseType: !943, size: 32, align: 32, offset: 608)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1256, file: !4, line: 1643, baseType: !943, size: 32, align: 32, offset: 640)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1256, file: !4, line: 1657, baseType: !962, size: 64, align: 64, offset: 704)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1256, file: !4, line: 1658, baseType: !943, size: 32, align: 32, offset: 768)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1256, file: !4, line: 1679, baseType: !1020, size: 64, align: 32, offset: 800)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1256, file: !4, line: 1688, baseType: !943, size: 32, align: 32, offset: 864)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1256, file: !4, line: 1712, baseType: !943, size: 32, align: 32, offset: 896)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1256, file: !4, line: 1729, baseType: !943, size: 32, align: 32, offset: 928)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1256, file: !4, line: 1729, baseType: !943, size: 32, align: 32, offset: 960)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1256, file: !4, line: 1744, baseType: !943, size: 32, align: 32, offset: 992)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1256, file: !4, line: 1744, baseType: !943, size: 32, align: 32, offset: 1024)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1256, file: !4, line: 1751, baseType: !943, size: 32, align: 32, offset: 1056)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1256, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1256, file: !4, line: 1791, baseType: !1507, size: 64, align: 64, offset: 1152)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{null, !1510, !1370, !1452, !943, !943, !943}
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1256, file: !4, line: 1808, baseType: !1512, size: 64, align: 64, offset: 1216)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DISubroutineType(types: !1514)
!1514 = !{!555, !1510, !1275}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1256, file: !4, line: 1816, baseType: !943, size: 32, align: 32, offset: 1280)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1256, file: !4, line: 1825, baseType: !1517, size: 32, align: 32, offset: 1312)
!1517 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1256, file: !4, line: 1830, baseType: !943, size: 32, align: 32, offset: 1344)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1256, file: !4, line: 1838, baseType: !1517, size: 32, align: 32, offset: 1376)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1256, file: !4, line: 1846, baseType: !943, size: 32, align: 32, offset: 1408)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1256, file: !4, line: 1851, baseType: !943, size: 32, align: 32, offset: 1440)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1256, file: !4, line: 1861, baseType: !1517, size: 32, align: 32, offset: 1472)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1256, file: !4, line: 1868, baseType: !1517, size: 32, align: 32, offset: 1504)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1256, file: !4, line: 1875, baseType: !1517, size: 32, align: 32, offset: 1536)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1256, file: !4, line: 1882, baseType: !1517, size: 32, align: 32, offset: 1568)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1256, file: !4, line: 1889, baseType: !1517, size: 32, align: 32, offset: 1600)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1256, file: !4, line: 1896, baseType: !1517, size: 32, align: 32, offset: 1632)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1256, file: !4, line: 1903, baseType: !1517, size: 32, align: 32, offset: 1664)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1256, file: !4, line: 1910, baseType: !943, size: 32, align: 32, offset: 1696)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1256, file: !4, line: 1915, baseType: !943, size: 32, align: 32, offset: 1728)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1256, file: !4, line: 1926, baseType: !1452, size: 64, align: 64, offset: 1792)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1256, file: !4, line: 1935, baseType: !1020, size: 64, align: 32, offset: 1856)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1256, file: !4, line: 1942, baseType: !943, size: 32, align: 32, offset: 1920)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1256, file: !4, line: 1948, baseType: !943, size: 32, align: 32, offset: 1952)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1256, file: !4, line: 1954, baseType: !943, size: 32, align: 32, offset: 1984)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1256, file: !4, line: 1960, baseType: !943, size: 32, align: 32, offset: 2016)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1256, file: !4, line: 1984, baseType: !943, size: 32, align: 32, offset: 2048)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1256, file: !4, line: 1991, baseType: !943, size: 32, align: 32, offset: 2080)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1256, file: !4, line: 1996, baseType: !943, size: 32, align: 32, offset: 2112)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1256, file: !4, line: 2004, baseType: !943, size: 32, align: 32, offset: 2144)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1256, file: !4, line: 2011, baseType: !943, size: 32, align: 32, offset: 2176)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1256, file: !4, line: 2018, baseType: !943, size: 32, align: 32, offset: 2208)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1256, file: !4, line: 2027, baseType: !943, size: 32, align: 32, offset: 2240)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1256, file: !4, line: 2034, baseType: !943, size: 32, align: 32, offset: 2272)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1256, file: !4, line: 2044, baseType: !943, size: 32, align: 32, offset: 2304)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1256, file: !4, line: 2054, baseType: !1547, size: 64, align: 64, offset: 2368)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1256, file: !4, line: 2061, baseType: !1547, size: 64, align: 64, offset: 2432)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1256, file: !4, line: 2066, baseType: !943, size: 32, align: 32, offset: 2496)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1256, file: !4, line: 2070, baseType: !943, size: 32, align: 32, offset: 2528)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1256, file: !4, line: 2078, baseType: !943, size: 32, align: 32, offset: 2560)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1256, file: !4, line: 2085, baseType: !943, size: 32, align: 32, offset: 2592)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1256, file: !4, line: 2092, baseType: !943, size: 32, align: 32, offset: 2624)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1256, file: !4, line: 2099, baseType: !943, size: 32, align: 32, offset: 2656)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1256, file: !4, line: 2106, baseType: !943, size: 32, align: 32, offset: 2688)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1256, file: !4, line: 2113, baseType: !943, size: 32, align: 32, offset: 2720)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1256, file: !4, line: 2120, baseType: !943, size: 32, align: 32, offset: 2752)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1256, file: !4, line: 2125, baseType: !943, size: 32, align: 32, offset: 2784)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1256, file: !4, line: 2133, baseType: !943, size: 32, align: 32, offset: 2816)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1256, file: !4, line: 2140, baseType: !943, size: 32, align: 32, offset: 2848)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1256, file: !4, line: 2145, baseType: !943, size: 32, align: 32, offset: 2880)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1256, file: !4, line: 2153, baseType: !943, size: 32, align: 32, offset: 2912)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1256, file: !4, line: 2158, baseType: !943, size: 32, align: 32, offset: 2944)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1256, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1256, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1256, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1256, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1256, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1256, file: !4, line: 2203, baseType: !943, size: 32, align: 32, offset: 3136)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1256, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1256, file: !4, line: 2212, baseType: !943, size: 32, align: 32, offset: 3200)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1256, file: !4, line: 2213, baseType: !943, size: 32, align: 32, offset: 3232)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1256, file: !4, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1256, file: !4, line: 2232, baseType: !943, size: 32, align: 32, offset: 3296)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1256, file: !4, line: 2243, baseType: !943, size: 32, align: 32, offset: 3328)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1256, file: !4, line: 2249, baseType: !943, size: 32, align: 32, offset: 3360)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1256, file: !4, line: 2256, baseType: !943, size: 32, align: 32, offset: 3392)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1256, file: !4, line: 2263, baseType: !1286, size: 64, align: 64, offset: 3456)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1256, file: !4, line: 2270, baseType: !1286, size: 64, align: 64, offset: 3520)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1256, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1256, file: !4, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1256, file: !4, line: 2367, baseType: !1583, size: 64, align: 64, offset: 3648)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DISubroutineType(types: !1585)
!1585 = !{!943, !1510, !1470, !943}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1256, file: !4, line: 2383, baseType: !943, size: 32, align: 32, offset: 3712)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1256, file: !4, line: 2386, baseType: !1517, size: 32, align: 32, offset: 3744)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1256, file: !4, line: 2387, baseType: !1517, size: 32, align: 32, offset: 3776)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1256, file: !4, line: 2394, baseType: !943, size: 32, align: 32, offset: 3808)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1256, file: !4, line: 2401, baseType: !943, size: 32, align: 32, offset: 3840)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1256, file: !4, line: 2408, baseType: !943, size: 32, align: 32, offset: 3872)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1256, file: !4, line: 2415, baseType: !943, size: 32, align: 32, offset: 3904)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1256, file: !4, line: 2422, baseType: !943, size: 32, align: 32, offset: 3936)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1256, file: !4, line: 2423, baseType: !1595, size: 64, align: 64, offset: 3968)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64, align: 64)
!1596 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1597)
!1597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1598)
!1598 = !{!1599, !1600, !1601, !1602}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1597, file: !4, line: 827, baseType: !943, size: 32, align: 32)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1597, file: !4, line: 828, baseType: !943, size: 32, align: 32, offset: 32)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1597, file: !4, line: 829, baseType: !943, size: 32, align: 32, offset: 64)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1597, file: !4, line: 830, baseType: !1517, size: 32, align: 32, offset: 96)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1256, file: !4, line: 2430, baseType: !939, size: 64, align: 64, offset: 4032)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1256, file: !4, line: 2437, baseType: !939, size: 64, align: 64, offset: 4096)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1256, file: !4, line: 2444, baseType: !1517, size: 32, align: 32, offset: 4160)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1256, file: !4, line: 2451, baseType: !1517, size: 32, align: 32, offset: 4192)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1256, file: !4, line: 2458, baseType: !943, size: 32, align: 32, offset: 4224)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1256, file: !4, line: 2469, baseType: !943, size: 32, align: 32, offset: 4256)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1256, file: !4, line: 2475, baseType: !943, size: 32, align: 32, offset: 4288)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1256, file: !4, line: 2481, baseType: !943, size: 32, align: 32, offset: 4320)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1256, file: !4, line: 2485, baseType: !943, size: 32, align: 32, offset: 4352)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1256, file: !4, line: 2489, baseType: !943, size: 32, align: 32, offset: 4384)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1256, file: !4, line: 2493, baseType: !943, size: 32, align: 32, offset: 4416)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1256, file: !4, line: 2501, baseType: !943, size: 32, align: 32, offset: 4448)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1256, file: !4, line: 2506, baseType: !943, size: 32, align: 32, offset: 4480)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1256, file: !4, line: 2510, baseType: !943, size: 32, align: 32, offset: 4512)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1256, file: !4, line: 2514, baseType: !939, size: 64, align: 64, offset: 4544)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1256, file: !4, line: 2528, baseType: !1619, size: 64, align: 64, offset: 4608)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DISubroutineType(types: !1621)
!1621 = !{null, !1510, !1002, !943, !943}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1256, file: !4, line: 2534, baseType: !943, size: 32, align: 32, offset: 4672)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1256, file: !4, line: 2545, baseType: !943, size: 32, align: 32, offset: 4704)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1256, file: !4, line: 2547, baseType: !943, size: 32, align: 32, offset: 4736)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1256, file: !4, line: 2549, baseType: !943, size: 32, align: 32, offset: 4768)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1256, file: !4, line: 2551, baseType: !943, size: 32, align: 32, offset: 4800)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1256, file: !4, line: 2553, baseType: !943, size: 32, align: 32, offset: 4832)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1256, file: !4, line: 2555, baseType: !943, size: 32, align: 32, offset: 4864)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1256, file: !4, line: 2557, baseType: !943, size: 32, align: 32, offset: 4896)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1256, file: !4, line: 2559, baseType: !943, size: 32, align: 32, offset: 4928)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1256, file: !4, line: 2563, baseType: !943, size: 32, align: 32, offset: 4960)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1256, file: !4, line: 2571, baseType: !1362, size: 64, align: 64, offset: 4992)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1256, file: !4, line: 2579, baseType: !1362, size: 64, align: 64, offset: 5056)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1256, file: !4, line: 2586, baseType: !943, size: 32, align: 32, offset: 5120)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1256, file: !4, line: 2615, baseType: !943, size: 32, align: 32, offset: 5152)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1256, file: !4, line: 2627, baseType: !943, size: 32, align: 32, offset: 5184)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1256, file: !4, line: 2637, baseType: !943, size: 32, align: 32, offset: 5216)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1256, file: !4, line: 2681, baseType: !943, size: 32, align: 32, offset: 5248)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1256, file: !4, line: 2709, baseType: !939, size: 64, align: 64, offset: 5312)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1256, file: !4, line: 2716, baseType: !1641, size: 64, align: 64, offset: 5376)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1643)
!1643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1644)
!1644 = !{!1645, !1646, !1647, !1648, !1649, !1650, !1651, !1655, !1659, !1660, !1661, !1662, !1668, !1669, !1670, !1671, !1672}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1643, file: !4, line: 3642, baseType: !971, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1643, file: !4, line: 3649, baseType: !545, size: 32, align: 32, offset: 64)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1643, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1643, file: !4, line: 3663, baseType: !555, size: 32, align: 32, offset: 128)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1643, file: !4, line: 3669, baseType: !943, size: 32, align: 32, offset: 160)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1643, file: !4, line: 3682, baseType: !1467, size: 64, align: 64, offset: 192)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1643, file: !4, line: 3698, baseType: !1652, size: 64, align: 64, offset: 256)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{!943, !1254, !945, !955}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1643, file: !4, line: 3712, baseType: !1656, size: 64, align: 64, offset: 320)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DISubroutineType(types: !1658)
!1658 = !{!943, !1254, !943, !945, !955}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1643, file: !4, line: 3726, baseType: !1652, size: 64, align: 64, offset: 384)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1643, file: !4, line: 3737, baseType: !1302, size: 64, align: 64, offset: 448)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1643, file: !4, line: 3746, baseType: !943, size: 32, align: 32, offset: 512)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1643, file: !4, line: 3757, baseType: !1663, size: 64, align: 64, offset: 576)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{null, !1666}
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1643, file: !4, line: 3766, baseType: !1302, size: 64, align: 64, offset: 640)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1643, file: !4, line: 3774, baseType: !1302, size: 64, align: 64, offset: 704)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1643, file: !4, line: 3780, baseType: !943, size: 32, align: 32, offset: 768)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1643, file: !4, line: 3785, baseType: !943, size: 32, align: 32, offset: 800)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1643, file: !4, line: 3795, baseType: !1673, size: 64, align: 64, offset: 832)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DISubroutineType(types: !1675)
!1675 = !{!943, !1254, !1119}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1256, file: !4, line: 2728, baseType: !1002, size: 64, align: 64, offset: 5440)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1256, file: !4, line: 2735, baseType: !1394, size: 512, align: 64, offset: 5504)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1256, file: !4, line: 2742, baseType: !943, size: 32, align: 32, offset: 6016)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1256, file: !4, line: 2755, baseType: !943, size: 32, align: 32, offset: 6048)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1256, file: !4, line: 2776, baseType: !943, size: 32, align: 32, offset: 6080)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1256, file: !4, line: 2783, baseType: !943, size: 32, align: 32, offset: 6112)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1256, file: !4, line: 2791, baseType: !943, size: 32, align: 32, offset: 6144)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1256, file: !4, line: 2802, baseType: !1470, size: 64, align: 64, offset: 6208)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1256, file: !4, line: 2811, baseType: !943, size: 32, align: 32, offset: 6272)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1256, file: !4, line: 2821, baseType: !943, size: 32, align: 32, offset: 6304)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1256, file: !4, line: 2830, baseType: !943, size: 32, align: 32, offset: 6336)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1256, file: !4, line: 2840, baseType: !943, size: 32, align: 32, offset: 6368)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1256, file: !4, line: 2851, baseType: !1689, size: 64, align: 64, offset: 6400)
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1690 = !DISubroutineType(types: !1691)
!1691 = !{!943, !1510, !1692, !1002, !1452, !943, !943}
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{!943, !1510, !1002}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1256, file: !4, line: 2871, baseType: !1696, size: 64, align: 64, offset: 6464)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!943, !1510, !1699, !1002, !1452, !943}
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{!943, !1510, !1002, !943, !943}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1256, file: !4, line: 2878, baseType: !943, size: 32, align: 32, offset: 6528)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1256, file: !4, line: 2885, baseType: !943, size: 32, align: 32, offset: 6560)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1256, file: !4, line: 3005, baseType: !943, size: 32, align: 32, offset: 6592)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1256, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1256, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1256, file: !4, line: 3027, baseType: !909, size: 32, align: 32, offset: 6688)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1256, file: !4, line: 3037, baseType: !962, size: 64, align: 64, offset: 6720)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1256, file: !4, line: 3038, baseType: !943, size: 32, align: 32, offset: 6784)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1256, file: !4, line: 3050, baseType: !1286, size: 64, align: 64, offset: 6848)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1256, file: !4, line: 3065, baseType: !943, size: 32, align: 32, offset: 6912)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1256, file: !4, line: 3083, baseType: !943, size: 32, align: 32, offset: 6944)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1256, file: !4, line: 3092, baseType: !1020, size: 64, align: 32, offset: 6976)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1256, file: !4, line: 3099, baseType: !555, size: 32, align: 32, offset: 7040)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1256, file: !4, line: 3106, baseType: !1020, size: 64, align: 32, offset: 7072)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1256, file: !4, line: 3113, baseType: !1717, size: 64, align: 64, offset: 7168)
!1717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1718, size: 64, align: 64)
!1718 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1719)
!1719 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1720)
!1720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1721)
!1721 = !{!1722, !1723, !1724, !1725, !1726, !1727, !1730}
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1720, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1720, file: !4, line: 714, baseType: !545, size: 32, align: 32, offset: 32)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1720, file: !4, line: 720, baseType: !971, size: 64, align: 64, offset: 64)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1720, file: !4, line: 724, baseType: !971, size: 64, align: 64, offset: 128)
