; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpdec_qt.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpdec_qt.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RTPDynamicProtocolHandler = type { i8*, i32, i32, i32, i32, i32, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*, i8*)*, void (%struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, %struct.PayloadContext*, %struct.AVStream*, %struct.AVPacket*, i32*, i8*, i32, i16, i32)*, i32 (%struct.PayloadContext*)*, %struct.RTPDynamicProtocolHandler* }

!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!894 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!895 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !897)
!897 = !{!898, !899, !900, !901, !902, !903, !904}
!898 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!899 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!900 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!901 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!902 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!903 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!904 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !14, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !474, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStereo3DType", file: !917, line: 51, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "./libavutil/stereo3d.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!918 = !{!919, !920, !921, !922, !923, !924, !925, !926}
!919 = !DIEnumerator(name: "AV_STEREO3D_2D", value: 0)
!920 = !DIEnumerator(name: "AV_STEREO3D_SIDEBYSIDE", value: 1)
!921 = !DIEnumerator(name: "AV_STEREO3D_TOPBOTTOM", value: 2)
!922 = !DIEnumerator(name: "AV_STEREO3D_FRAMESEQUENCE", value: 3)
!923 = !DIEnumerator(name: "AV_STEREO3D_CHECKERBOARD", value: 4)
!924 = !DIEnumerator(name: "AV_STEREO3D_SIDEBYSIDE_QUINCUNX", value: 5)
!925 = !DIEnumerator(name: "AV_STEREO3D_LINES", value: 6)
!926 = !DIEnumerator(name: "AV_STEREO3D_COLUMNS", value: 7)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStereo3DView", file: !917, line: 147, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931}
!929 = !DIEnumerator(name: "AV_STEREO3D_VIEW_PACKED", value: 0)
!930 = !DIEnumerator(name: "AV_STEREO3D_VIEW_LEFT", value: 1)
!931 = !DIEnumerator(name: "AV_STEREO3D_VIEW_RIGHT", value: 2)
!932 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSphericalProjection", file: !933, line: 51, size: 32, align: 32, elements: !934)
!933 = !DIFile(filename: "./libavutil/spherical.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AV_SPHERICAL_EQUIRECTANGULAR", value: 0)
!936 = !DIEnumerator(name: "AV_SPHERICAL_CUBEMAP", value: 1)
!937 = !DIEnumerator(name: "AV_SPHERICAL_EQUIRECTANGULAR_TILE", value: 2)
!938 = !{!939, !943, !944, !945, !946, !940}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !941, line: 48, baseType: !942)
!941 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!942 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!944 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!945 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !949, line: 221, size: 32, align: 8, elements: !950)
!949 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!950 = !{!951}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !948, file: !949, line: 221, baseType: !952, size: 32, align: 32)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !941, line: 51, baseType: !945)
!953 = !{!954, !2208, !2209, !2210}
!954 = distinct !DIGlobalVariable(name: "ff_qt_rtp_vid_handler", scope: !0, file: !955, line: 253, type: !956, isLocal: false, isDefinition: true, variable: %struct.RTPDynamicProtocolHandler* @ff_qt_rtp_vid_handler)
!955 = !DIFile(filename: "libavformat/rtpdec_qt.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTPDynamicProtocolHandler", file: !957, line: 33, baseType: !958)
!957 = !DIFile(filename: "libavformat/rtpdec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RTPDynamicProtocolHandler", file: !957, line: 115, size: 640, align: 64, elements: !959)
!959 = !{!960, !964, !965, !966, !967, !968, !969, !2188, !2192, !2196, !2202, !2206}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "enc_name", scope: !958, file: !957, line: 116, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !958, file: !957, line: 117, baseType: !3, size: 32, align: 32, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !958, file: !957, line: 118, baseType: !13, size: 32, align: 32, offset: 96)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "need_parsing", scope: !958, file: !957, line: 119, baseType: !473, size: 32, align: 32, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "static_payload_id", scope: !958, file: !957, line: 120, baseType: !944, size: 32, align: 32, offset: 160)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !958, file: !957, line: 123, baseType: !944, size: 32, align: 32, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !958, file: !957, line: 126, baseType: !970, size: 64, align: 64, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!944, !973, !944, !2180}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !474, line: 1947, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !474, line: 1337, size: 11968, align: 64, elements: !976)
!976 = !{!977, !1018, !1128, !1276, !1277, !1342, !1343, !1344, !2037, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2091, !2092, !2093, !2094, !2095, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2146, !2147, !2150, !2151, !2152, !2153, !2154, !2155, !2157, !2158, !2159, !2160, !2168, !2169, !2173, !2177, !2178, !2179}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !975, file: !474, line: 1342, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !483, line: 143, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !483, line: 67, size: 640, align: 64, elements: !982)
!982 = !{!983, !984, !988, !992, !993, !994, !995, !999, !1005, !1007, !1011}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !981, file: !483, line: 72, baseType: !961, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !981, file: !483, line: 78, baseType: !985, size: 64, align: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!961, !943}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !981, file: !483, line: 85, baseType: !989, size: 64, align: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !483, line: 85, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !981, file: !483, line: 93, baseType: !944, size: 32, align: 32, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !981, file: !483, line: 99, baseType: !944, size: 32, align: 32, offset: 224)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !981, file: !483, line: 108, baseType: !944, size: 32, align: 32, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !981, file: !483, line: 113, baseType: !996, size: 64, align: 64, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!943, !943, !943}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !981, file: !483, line: 123, baseType: !1000, size: 64, align: 64, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!1003, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !981, file: !483, line: 130, baseType: !1006, size: 32, align: 32, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !483, line: 48, baseType: !482)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !981, file: !483, line: 136, baseType: !1008, size: 64, align: 64, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!1006, !943}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !981, file: !483, line: 142, baseType: !1012, size: 64, align: 64, offset: 576)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!944, !1015, !943, !961, !944}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !483, line: 60, flags: DIFlagFwdDecl)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !975, file: !474, line: 1349, baseType: !1019, size: 64, align: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !474, line: 633, size: 1344, align: 64, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1036, !1037, !1038, !1039, !1040, !1041, !1054, !1059, !1099, !1100, !1104, !1109, !1110, !1111, !1115, !1121, !1127}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1020, file: !474, line: 638, baseType: !961, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1020, file: !474, line: 645, baseType: !961, size: 64, align: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1020, file: !474, line: 652, baseType: !944, size: 32, align: 32, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1020, file: !474, line: 659, baseType: !961, size: 64, align: 64, offset: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1020, file: !474, line: 661, baseType: !1027, size: 64, align: 64, offset: 256)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1032, line: 44, size: 64, align: 32, elements: !1033)
!1032 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1033 = !{!1034, !1035}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1031, file: !1032, line: 45, baseType: !13, size: 32, align: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1031, file: !1032, line: 46, baseType: !945, size: 32, align: 32, offset: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1020, file: !474, line: 663, baseType: !978, size: 64, align: 64, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1020, file: !474, line: 670, baseType: !961, size: 64, align: 64, offset: 384)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1020, file: !474, line: 679, baseType: !1019, size: 64, align: 64, offset: 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1020, file: !474, line: 684, baseType: !944, size: 32, align: 32, offset: 512)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1020, file: !474, line: 689, baseType: !944, size: 32, align: 32, offset: 544)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1020, file: !474, line: 696, baseType: !1042, size: 64, align: 64, offset: 576)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!944, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !474, line: 453, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !474, line: 448, size: 256, align: 64, elements: !1048)
!1048 = !{!1049, !1050, !1052, !1053}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1047, file: !474, line: 449, baseType: !961, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1047, file: !474, line: 450, baseType: !1051, size: 64, align: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1047, file: !474, line: 451, baseType: !944, size: 32, align: 32, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1047, file: !474, line: 452, baseType: !961, size: 64, align: 64, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1020, file: !474, line: 703, baseType: !1055, size: 64, align: 64, offset: 640)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!944, !1058}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1020, file: !474, line: 714, baseType: !1060, size: 64, align: 64, offset: 704)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!944, !1058, !1063}
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1066)
!1066 = !{!1067, !1079, !1082, !1083, !1084, !1085, !1086, !1087, !1095, !1096, !1097, !1098}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1065, file: !14, line: 1451, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1070, line: 94, baseType: !1071)
!1070 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1070, line: 81, size: 192, align: 64, elements: !1072)
!1072 = !{!1073, !1077, !1078}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1071, file: !1070, line: 82, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1070, line: 73, baseType: !1076)
!1076 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1070, line: 73, flags: DIFlagFwdDecl)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1071, file: !1070, line: 89, baseType: !939, size: 64, align: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1071, file: !1070, line: 93, baseType: !944, size: 32, align: 32, offset: 128)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1065, file: !14, line: 1461, baseType: !1080, size: 64, align: 64, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !941, line: 40, baseType: !1081)
!1081 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1065, file: !14, line: 1467, baseType: !1080, size: 64, align: 64, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1065, file: !14, line: 1468, baseType: !939, size: 64, align: 64, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1065, file: !14, line: 1469, baseType: !944, size: 32, align: 32, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1065, file: !14, line: 1470, baseType: !944, size: 32, align: 32, offset: 288)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1065, file: !14, line: 1474, baseType: !944, size: 32, align: 32, offset: 320)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1065, file: !14, line: 1479, baseType: !1088, size: 64, align: 64, offset: 384)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1091)
!1091 = !{!1092, !1093, !1094}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1090, file: !14, line: 1412, baseType: !939, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1090, file: !14, line: 1413, baseType: !944, size: 32, align: 32, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1090, file: !14, line: 1414, baseType: !503, size: 32, align: 32, offset: 96)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1065, file: !14, line: 1480, baseType: !944, size: 32, align: 32, offset: 448)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1065, file: !14, line: 1486, baseType: !1080, size: 64, align: 64, offset: 512)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1065, file: !14, line: 1488, baseType: !1080, size: 64, align: 64, offset: 576)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1065, file: !14, line: 1497, baseType: !1080, size: 64, align: 64, offset: 640)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1020, file: !474, line: 720, baseType: !1055, size: 64, align: 64, offset: 768)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1020, file: !474, line: 730, baseType: !1101, size: 64, align: 64, offset: 832)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!944, !1058, !944, !1080, !944}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1020, file: !474, line: 737, baseType: !1105, size: 64, align: 64, offset: 896)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!1080, !1058, !944, !1108, !1080}
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1020, file: !474, line: 744, baseType: !1055, size: 64, align: 64, offset: 960)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1020, file: !474, line: 750, baseType: !1055, size: 64, align: 64, offset: 1024)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1020, file: !474, line: 758, baseType: !1112, size: 64, align: 64, offset: 1088)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!944, !1058, !944, !1080, !1080, !1080, !944}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1020, file: !474, line: 764, baseType: !1116, size: 64, align: 64, offset: 1152)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!944, !1058, !1119}
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !474, line: 328, flags: DIFlagFwdDecl)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1020, file: !474, line: 770, baseType: !1122, size: 64, align: 64, offset: 1216)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!944, !1058, !1125}
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !474, line: 329, flags: DIFlagFwdDecl)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1020, file: !474, line: 776, baseType: !1122, size: 64, align: 64, offset: 1280)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !975, file: !474, line: 1356, baseType: !1129, size: 64, align: 64, offset: 128)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !474, line: 497, size: 1600, align: 64, elements: !1131)
!1131 = !{!1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1151, !1155, !1159, !1166, !1261, !1262, !1263, !1264, !1265, !1266, !1270}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1130, file: !474, line: 498, baseType: !961, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1130, file: !474, line: 504, baseType: !961, size: 64, align: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1130, file: !474, line: 505, baseType: !961, size: 64, align: 64, offset: 128)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1130, file: !474, line: 506, baseType: !961, size: 64, align: 64, offset: 192)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1130, file: !474, line: 508, baseType: !13, size: 32, align: 32, offset: 256)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1130, file: !474, line: 509, baseType: !13, size: 32, align: 32, offset: 288)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1130, file: !474, line: 510, baseType: !13, size: 32, align: 32, offset: 320)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1130, file: !474, line: 517, baseType: !944, size: 32, align: 32, offset: 352)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1130, file: !474, line: 523, baseType: !1027, size: 64, align: 64, offset: 384)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1130, file: !474, line: 526, baseType: !978, size: 64, align: 64, offset: 448)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1130, file: !474, line: 535, baseType: !1129, size: 64, align: 64, offset: 512)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1130, file: !474, line: 539, baseType: !944, size: 32, align: 32, offset: 576)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1130, file: !474, line: 541, baseType: !1055, size: 64, align: 64, offset: 640)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1130, file: !474, line: 549, baseType: !1060, size: 64, align: 64, offset: 704)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1130, file: !474, line: 550, baseType: !1055, size: 64, align: 64, offset: 768)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1130, file: !474, line: 554, baseType: !1148, size: 64, align: 64, offset: 832)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!944, !1058, !1063, !1063, !944}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1130, file: !474, line: 563, baseType: !1152, size: 64, align: 64, offset: 896)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!944, !13, !944}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1130, file: !474, line: 565, baseType: !1156, size: 64, align: 64, offset: 960)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{null, !1058, !944, !1108, !1108}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1130, file: !474, line: 570, baseType: !1160, size: 64, align: 64, offset: 1024)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!944, !1058, !944, !943, !1163}
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1164, line: 216, baseType: !1165)
!1164 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1165 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1130, file: !474, line: 581, baseType: !1167, size: 64, align: 64, offset: 1088)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!944, !1058, !944, !1170, !945}
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !544, line: 646, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !544, line: 268, size: 4288, align: 64, elements: !1174)
!1174 = !{!1175, !1179, !1181, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1215, !1217, !1218, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1173, file: !544, line: 282, baseType: !1176, size: 512, align: 64)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 512, align: 64, elements: !1177)
!1177 = !{!1178}
!1178 = !DISubrange(count: 8)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1173, file: !544, line: 299, baseType: !1180, size: 256, align: 32, offset: 512)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 256, align: 32, elements: !1177)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1173, file: !544, line: 315, baseType: !1182, size: 64, align: 64, offset: 768)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1173, file: !544, line: 326, baseType: !944, size: 32, align: 32, offset: 832)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1173, file: !544, line: 326, baseType: !944, size: 32, align: 32, offset: 864)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1173, file: !544, line: 334, baseType: !944, size: 32, align: 32, offset: 896)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1173, file: !544, line: 341, baseType: !944, size: 32, align: 32, offset: 928)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1173, file: !544, line: 346, baseType: !944, size: 32, align: 32, offset: 960)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1173, file: !544, line: 351, baseType: !533, size: 32, align: 32, offset: 992)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1173, file: !544, line: 356, baseType: !1190, size: 64, align: 32, offset: 1024)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1191, line: 61, baseType: !1192)
!1191 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1191, line: 58, size: 64, align: 32, elements: !1193)
!1193 = !{!1194, !1195}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1192, file: !1191, line: 59, baseType: !944, size: 32, align: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1192, file: !1191, line: 60, baseType: !944, size: 32, align: 32, offset: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1173, file: !544, line: 361, baseType: !1080, size: 64, align: 64, offset: 1088)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1173, file: !544, line: 369, baseType: !1080, size: 64, align: 64, offset: 1152)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1173, file: !544, line: 377, baseType: !1080, size: 64, align: 64, offset: 1216)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1173, file: !544, line: 382, baseType: !944, size: 32, align: 32, offset: 1280)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1173, file: !544, line: 386, baseType: !944, size: 32, align: 32, offset: 1312)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1173, file: !544, line: 391, baseType: !944, size: 32, align: 32, offset: 1344)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1173, file: !544, line: 396, baseType: !943, size: 64, align: 64, offset: 1408)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1173, file: !544, line: 403, baseType: !1204, size: 512, align: 64, offset: 1472)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1205, size: 512, align: 64, elements: !1177)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !941, line: 55, baseType: !1165)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1173, file: !544, line: 410, baseType: !944, size: 32, align: 32, offset: 1984)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1173, file: !544, line: 415, baseType: !944, size: 32, align: 32, offset: 2016)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1173, file: !544, line: 420, baseType: !944, size: 32, align: 32, offset: 2048)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1173, file: !544, line: 425, baseType: !944, size: 32, align: 32, offset: 2080)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1173, file: !544, line: 435, baseType: !1080, size: 64, align: 64, offset: 2112)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1173, file: !544, line: 440, baseType: !944, size: 32, align: 32, offset: 2176)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1173, file: !544, line: 445, baseType: !1205, size: 64, align: 64, offset: 2240)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1173, file: !544, line: 459, baseType: !1214, size: 512, align: 64, offset: 2304)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1068, size: 512, align: 64, elements: !1177)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1173, file: !544, line: 473, baseType: !1216, size: 64, align: 64, offset: 2816)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1173, file: !544, line: 477, baseType: !944, size: 32, align: 32, offset: 2880)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1173, file: !544, line: 479, baseType: !1219, size: 64, align: 64, offset: 2944)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !544, line: 207, baseType: !1222)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !544, line: 201, size: 320, align: 64, elements: !1223)
!1223 = !{!1224, !1225, !1226, !1227, !1232}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1222, file: !544, line: 202, baseType: !543, size: 32, align: 32)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1222, file: !544, line: 203, baseType: !939, size: 64, align: 64, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1222, file: !544, line: 204, baseType: !944, size: 32, align: 32, offset: 128)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1222, file: !544, line: 205, baseType: !1228, size: 64, align: 64, offset: 192)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1230, line: 86, baseType: !1231)
!1230 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1231 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1230, line: 86, flags: DIFlagFwdDecl)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1222, file: !544, line: 206, baseType: !1068, size: 64, align: 64, offset: 256)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1173, file: !544, line: 480, baseType: !944, size: 32, align: 32, offset: 3008)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1173, file: !544, line: 505, baseType: !944, size: 32, align: 32, offset: 3040)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1173, file: !544, line: 512, baseType: !567, size: 32, align: 32, offset: 3072)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1173, file: !544, line: 514, baseType: !574, size: 32, align: 32, offset: 3104)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1173, file: !544, line: 516, baseType: !592, size: 32, align: 32, offset: 3136)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1173, file: !544, line: 523, baseType: !616, size: 32, align: 32, offset: 3168)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1173, file: !544, line: 525, baseType: !635, size: 32, align: 32, offset: 3200)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1173, file: !544, line: 532, baseType: !1080, size: 64, align: 64, offset: 3264)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1173, file: !544, line: 539, baseType: !1080, size: 64, align: 64, offset: 3328)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1173, file: !544, line: 547, baseType: !1080, size: 64, align: 64, offset: 3392)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1173, file: !544, line: 554, baseType: !1228, size: 64, align: 64, offset: 3456)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1173, file: !544, line: 563, baseType: !944, size: 32, align: 32, offset: 3520)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1173, file: !544, line: 572, baseType: !944, size: 32, align: 32, offset: 3552)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1173, file: !544, line: 581, baseType: !944, size: 32, align: 32, offset: 3584)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1173, file: !544, line: 588, baseType: !1248, size: 64, align: 64, offset: 3648)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !941, line: 36, baseType: !1250)
!1250 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1173, file: !544, line: 593, baseType: !944, size: 32, align: 32, offset: 3712)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1173, file: !544, line: 596, baseType: !944, size: 32, align: 32, offset: 3744)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1173, file: !544, line: 599, baseType: !1068, size: 64, align: 64, offset: 3776)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1173, file: !544, line: 605, baseType: !1068, size: 64, align: 64, offset: 3840)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1173, file: !544, line: 616, baseType: !1068, size: 64, align: 64, offset: 3904)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1173, file: !544, line: 626, baseType: !1163, size: 64, align: 64, offset: 3968)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1173, file: !544, line: 627, baseType: !1163, size: 64, align: 64, offset: 4032)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1173, file: !544, line: 628, baseType: !1163, size: 64, align: 64, offset: 4096)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1173, file: !544, line: 629, baseType: !1163, size: 64, align: 64, offset: 4160)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1173, file: !544, line: 645, baseType: !1068, size: 64, align: 64, offset: 4224)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1130, file: !474, line: 587, baseType: !1116, size: 64, align: 64, offset: 1152)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1130, file: !474, line: 592, baseType: !1122, size: 64, align: 64, offset: 1216)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1130, file: !474, line: 597, baseType: !1122, size: 64, align: 64, offset: 1280)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1130, file: !474, line: 598, baseType: !13, size: 32, align: 32, offset: 1344)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1130, file: !474, line: 608, baseType: !1055, size: 64, align: 64, offset: 1408)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1130, file: !474, line: 617, baseType: !1267, size: 64, align: 64, offset: 1472)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{null, !1058}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1130, file: !474, line: 623, baseType: !1271, size: 64, align: 64, offset: 1536)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!944, !1058, !1274}
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1064)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !975, file: !474, line: 1365, baseType: !943, size: 64, align: 64, offset: 192)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !975, file: !474, line: 1379, baseType: !1278, size: 64, align: 64, offset: 256)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !646, line: 352, baseType: !1280)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !646, line: 161, size: 2112, align: 64, elements: !1281)
!1281 = !{!1282, !1283, !1284, !1285, !1286, !1287, !1288, !1292, !1293, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1309, !1310, !1314, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1332, !1333, !1334, !1335, !1339, !1340, !1341}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1280, file: !646, line: 174, baseType: !978, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1280, file: !646, line: 226, baseType: !1051, size: 64, align: 64, offset: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1280, file: !646, line: 227, baseType: !944, size: 32, align: 32, offset: 128)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1280, file: !646, line: 228, baseType: !1051, size: 64, align: 64, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1280, file: !646, line: 229, baseType: !1051, size: 64, align: 64, offset: 256)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1280, file: !646, line: 233, baseType: !943, size: 64, align: 64, offset: 320)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1280, file: !646, line: 235, baseType: !1289, size: 64, align: 64, offset: 384)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!944, !943, !939, !944}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1280, file: !646, line: 236, baseType: !1289, size: 64, align: 64, offset: 448)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1280, file: !646, line: 237, baseType: !1294, size: 64, align: 64, offset: 512)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!1080, !943, !1080, !944}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1280, file: !646, line: 238, baseType: !1080, size: 64, align: 64, offset: 576)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1280, file: !646, line: 239, baseType: !944, size: 32, align: 32, offset: 640)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1280, file: !646, line: 240, baseType: !944, size: 32, align: 32, offset: 672)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1280, file: !646, line: 241, baseType: !944, size: 32, align: 32, offset: 704)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1280, file: !646, line: 242, baseType: !1165, size: 64, align: 64, offset: 768)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1280, file: !646, line: 243, baseType: !1051, size: 64, align: 64, offset: 832)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1280, file: !646, line: 244, baseType: !1304, size: 64, align: 64, offset: 896)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{!1165, !1165, !1307, !945}
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1280, file: !646, line: 245, baseType: !944, size: 32, align: 32, offset: 960)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1280, file: !646, line: 249, baseType: !1311, size: 64, align: 64, offset: 1024)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!944, !943, !944}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1280, file: !646, line: 255, baseType: !1315, size: 64, align: 64, offset: 1088)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!1080, !943, !944, !1080, !944}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1280, file: !646, line: 260, baseType: !944, size: 32, align: 32, offset: 1152)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1280, file: !646, line: 266, baseType: !1080, size: 64, align: 64, offset: 1216)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1280, file: !646, line: 273, baseType: !944, size: 32, align: 32, offset: 1280)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1280, file: !646, line: 279, baseType: !1080, size: 64, align: 64, offset: 1344)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1280, file: !646, line: 285, baseType: !944, size: 32, align: 32, offset: 1408)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1280, file: !646, line: 291, baseType: !944, size: 32, align: 32, offset: 1440)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1280, file: !646, line: 298, baseType: !944, size: 32, align: 32, offset: 1472)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1280, file: !646, line: 304, baseType: !944, size: 32, align: 32, offset: 1504)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1280, file: !646, line: 309, baseType: !961, size: 64, align: 64, offset: 1536)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1280, file: !646, line: 314, baseType: !961, size: 64, align: 64, offset: 1600)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1280, file: !646, line: 319, baseType: !1329, size: 64, align: 64, offset: 1664)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{!944, !943, !939, !944, !645, !1080}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1280, file: !646, line: 326, baseType: !944, size: 32, align: 32, offset: 1728)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1280, file: !646, line: 331, baseType: !645, size: 32, align: 32, offset: 1760)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1280, file: !646, line: 332, baseType: !1080, size: 64, align: 64, offset: 1792)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1280, file: !646, line: 338, baseType: !1336, size: 64, align: 64, offset: 1856)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{!944, !943}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1280, file: !646, line: 340, baseType: !1080, size: 64, align: 64, offset: 1920)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1280, file: !646, line: 346, baseType: !1051, size: 64, align: 64, offset: 1984)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1280, file: !646, line: 351, baseType: !944, size: 32, align: 32, offset: 2048)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !975, file: !474, line: 1386, baseType: !944, size: 32, align: 32, offset: 320)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !975, file: !474, line: 1393, baseType: !945, size: 32, align: 32, offset: 352)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !975, file: !474, line: 1405, baseType: !1345, size: 64, align: 64, offset: 384)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !474, line: 1223, baseType: !1348)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !474, line: 865, size: 6144, align: 64, elements: !1349)
!1349 = !{!1350, !1351, !1352, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1822, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1923, !1929, !1930, !1934, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1966, !1967, !1968, !1969, !1970, !1971}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1348, file: !474, line: 866, baseType: !944, size: 32, align: 32)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1348, file: !474, line: 872, baseType: !944, size: 32, align: 32, offset: 32)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1348, file: !474, line: 878, baseType: !1353, size: 64, align: 64, offset: 64)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1355)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1356)
!1356 = !{!1357, !1358, !1359, !1360, !1497, !1498, !1499, !1500, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1526, !1530, !1531, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1710, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1355, file: !14, line: 1561, baseType: !978, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1355, file: !14, line: 1562, baseType: !944, size: 32, align: 32, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1355, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1355, file: !14, line: 1565, baseType: !1361, size: 64, align: 64, offset: 128)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1363)
!1363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1364)
!1364 = !{!1365, !1366, !1367, !1368, !1369, !1370, !1373, !1376, !1379, !1382, !1385, !1386, !1387, !1395, !1396, !1397, !1399, !1403, !1409, !1414, !1418, !1419, !1462, !1469, !1473, !1474, !1478, !1482, !1486, !1490, !1491, !1492}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1363, file: !14, line: 3475, baseType: !961, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1363, file: !14, line: 3480, baseType: !961, size: 64, align: 64, offset: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1363, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1363, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1363, file: !14, line: 3487, baseType: !944, size: 32, align: 32, offset: 192)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1363, file: !14, line: 3488, baseType: !1371, size: 64, align: 64, offset: 256)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1190)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1363, file: !14, line: 3489, baseType: !1374, size: 64, align: 64, offset: 320)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1363, file: !14, line: 3490, baseType: !1377, size: 64, align: 64, offset: 384)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1363, file: !14, line: 3491, baseType: !1380, size: 64, align: 64, offset: 448)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !853)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1363, file: !14, line: 3492, baseType: !1383, size: 64, align: 64, offset: 512)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1205)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1363, file: !14, line: 3493, baseType: !940, size: 8, align: 8, offset: 576)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1363, file: !14, line: 3494, baseType: !978, size: 64, align: 64, offset: 640)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1363, file: !14, line: 3495, baseType: !1388, size: 64, align: 64, offset: 704)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1390)
!1390 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1391)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1392)
!1392 = !{!1393, !1394}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1391, file: !14, line: 3402, baseType: !944, size: 32, align: 32)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1391, file: !14, line: 3403, baseType: !961, size: 64, align: 64, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1363, file: !14, line: 3507, baseType: !961, size: 64, align: 64, offset: 768)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1363, file: !14, line: 3516, baseType: !944, size: 32, align: 32, offset: 832)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1363, file: !14, line: 3517, baseType: !1398, size: 64, align: 64, offset: 896)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1363, file: !14, line: 3527, baseType: !1400, size: 64, align: 64, offset: 960)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DISubroutineType(types: !1402)
!1402 = !{!944, !1353}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1363, file: !14, line: 3535, baseType: !1404, size: 64, align: 64, offset: 1024)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DISubroutineType(types: !1406)
!1406 = !{!944, !1353, !1407}
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1354)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1363, file: !14, line: 3541, baseType: !1410, size: 64, align: 64, offset: 1088)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1412)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1413)
!1413 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1363, file: !14, line: 3549, baseType: !1415, size: 64, align: 64, offset: 1152)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{null, !1398}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1363, file: !14, line: 3551, baseType: !1400, size: 64, align: 64, offset: 1216)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1363, file: !14, line: 3552, baseType: !1420, size: 64, align: 64, offset: 1280)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DISubroutineType(types: !1422)
!1422 = !{!944, !1353, !939, !944, !1423}
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1425)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1426)
!1426 = !{!1427, !1430, !1431, !1432, !1433, !1461}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1425, file: !14, line: 3921, baseType: !1428, size: 16, align: 16)
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !941, line: 49, baseType: !1429)
!1429 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1425, file: !14, line: 3922, baseType: !952, size: 32, align: 32, offset: 32)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1425, file: !14, line: 3923, baseType: !952, size: 32, align: 32, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1425, file: !14, line: 3924, baseType: !945, size: 32, align: 32, offset: 96)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1425, file: !14, line: 3925, baseType: !1434, size: 64, align: 64, offset: 128)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1437)
!1437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1438)
!1438 = !{!1439, !1440, !1441, !1442, !1443, !1444, !1450, !1454, !1456, !1457, !1459, !1460}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1437, file: !14, line: 3886, baseType: !944, size: 32, align: 32)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1437, file: !14, line: 3887, baseType: !944, size: 32, align: 32, offset: 32)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1437, file: !14, line: 3888, baseType: !944, size: 32, align: 32, offset: 64)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1437, file: !14, line: 3889, baseType: !944, size: 32, align: 32, offset: 96)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1437, file: !14, line: 3890, baseType: !944, size: 32, align: 32, offset: 128)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1437, file: !14, line: 3897, baseType: !1445, size: 768, align: 64, offset: 192)
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1446)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1447)
!1447 = !{!1448, !1449}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1446, file: !14, line: 3855, baseType: !1176, size: 512, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1446, file: !14, line: 3857, baseType: !1180, size: 256, align: 32, offset: 512)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1437, file: !14, line: 3903, baseType: !1451, size: 256, align: 64, offset: 960)
!1451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 256, align: 64, elements: !1452)
!1452 = !{!1453}
!1453 = !DISubrange(count: 4)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1437, file: !14, line: 3904, baseType: !1455, size: 128, align: 32, offset: 1216)
!1455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 128, align: 32, elements: !1452)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1437, file: !14, line: 3906, baseType: !870, size: 32, align: 32, offset: 1344)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1437, file: !14, line: 3908, baseType: !1458, size: 64, align: 64, offset: 1408)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1437, file: !14, line: 3915, baseType: !1458, size: 64, align: 64, offset: 1472)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1437, file: !14, line: 3917, baseType: !944, size: 32, align: 32, offset: 1536)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1425, file: !14, line: 3926, baseType: !1080, size: 64, align: 64, offset: 192)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1363, file: !14, line: 3564, baseType: !1463, size: 64, align: 64, offset: 1344)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DISubroutineType(types: !1465)
!1465 = !{!944, !1353, !1063, !1466, !1468}
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1172)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1363, file: !14, line: 3566, baseType: !1470, size: 64, align: 64, offset: 1408)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{!944, !1353, !943, !1468, !1063}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1363, file: !14, line: 3567, baseType: !1400, size: 64, align: 64, offset: 1472)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1363, file: !14, line: 3576, baseType: !1475, size: 64, align: 64, offset: 1536)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!944, !1353, !1466}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1363, file: !14, line: 3577, baseType: !1479, size: 64, align: 64, offset: 1600)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{!944, !1353, !1063}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1363, file: !14, line: 3584, baseType: !1483, size: 64, align: 64, offset: 1664)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DISubroutineType(types: !1485)
!1485 = !{!944, !1353, !1171}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1363, file: !14, line: 3589, baseType: !1487, size: 64, align: 64, offset: 1728)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DISubroutineType(types: !1489)
!1489 = !{null, !1353}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1363, file: !14, line: 3594, baseType: !944, size: 32, align: 32, offset: 1792)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1363, file: !14, line: 3600, baseType: !961, size: 64, align: 64, offset: 1856)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1363, file: !14, line: 3609, baseType: !1493, size: 64, align: 64, offset: 1920)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1496)
!1496 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1355, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1355, file: !14, line: 1581, baseType: !945, size: 32, align: 32, offset: 224)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1355, file: !14, line: 1583, baseType: !943, size: 64, align: 64, offset: 256)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1355, file: !14, line: 1591, baseType: !1501, size: 64, align: 64, offset: 320)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1355, file: !14, line: 1598, baseType: !943, size: 64, align: 64, offset: 384)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1355, file: !14, line: 1606, baseType: !1080, size: 64, align: 64, offset: 448)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1355, file: !14, line: 1614, baseType: !944, size: 32, align: 32, offset: 512)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1355, file: !14, line: 1622, baseType: !944, size: 32, align: 32, offset: 544)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1355, file: !14, line: 1628, baseType: !944, size: 32, align: 32, offset: 576)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1355, file: !14, line: 1636, baseType: !944, size: 32, align: 32, offset: 608)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1355, file: !14, line: 1643, baseType: !944, size: 32, align: 32, offset: 640)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1355, file: !14, line: 1657, baseType: !939, size: 64, align: 64, offset: 704)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1355, file: !14, line: 1658, baseType: !944, size: 32, align: 32, offset: 768)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1355, file: !14, line: 1679, baseType: !1190, size: 64, align: 32, offset: 800)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1355, file: !14, line: 1688, baseType: !944, size: 32, align: 32, offset: 864)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1355, file: !14, line: 1712, baseType: !944, size: 32, align: 32, offset: 896)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1355, file: !14, line: 1729, baseType: !944, size: 32, align: 32, offset: 928)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1355, file: !14, line: 1729, baseType: !944, size: 32, align: 32, offset: 960)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1355, file: !14, line: 1744, baseType: !944, size: 32, align: 32, offset: 992)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1355, file: !14, line: 1744, baseType: !944, size: 32, align: 32, offset: 1024)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1355, file: !14, line: 1751, baseType: !944, size: 32, align: 32, offset: 1056)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1355, file: !14, line: 1766, baseType: !654, size: 32, align: 32, offset: 1088)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1355, file: !14, line: 1791, baseType: !1522, size: 64, align: 64, offset: 1152)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DISubroutineType(types: !1524)
!1524 = !{null, !1525, !1466, !1468, !944, !944, !944}
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1355, file: !14, line: 1808, baseType: !1527, size: 64, align: 64, offset: 1216)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DISubroutineType(types: !1529)
!1529 = !{!654, !1525, !1374}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1355, file: !14, line: 1816, baseType: !944, size: 32, align: 32, offset: 1280)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1355, file: !14, line: 1825, baseType: !1532, size: 32, align: 32, offset: 1312)
!1532 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1355, file: !14, line: 1830, baseType: !944, size: 32, align: 32, offset: 1344)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1355, file: !14, line: 1838, baseType: !1532, size: 32, align: 32, offset: 1376)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1355, file: !14, line: 1846, baseType: !944, size: 32, align: 32, offset: 1408)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1355, file: !14, line: 1851, baseType: !944, size: 32, align: 32, offset: 1440)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1355, file: !14, line: 1861, baseType: !1532, size: 32, align: 32, offset: 1472)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1355, file: !14, line: 1868, baseType: !1532, size: 32, align: 32, offset: 1504)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1355, file: !14, line: 1875, baseType: !1532, size: 32, align: 32, offset: 1536)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1355, file: !14, line: 1882, baseType: !1532, size: 32, align: 32, offset: 1568)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1355, file: !14, line: 1889, baseType: !1532, size: 32, align: 32, offset: 1600)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1355, file: !14, line: 1896, baseType: !1532, size: 32, align: 32, offset: 1632)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1355, file: !14, line: 1903, baseType: !1532, size: 32, align: 32, offset: 1664)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1355, file: !14, line: 1910, baseType: !944, size: 32, align: 32, offset: 1696)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1355, file: !14, line: 1915, baseType: !944, size: 32, align: 32, offset: 1728)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1355, file: !14, line: 1926, baseType: !1468, size: 64, align: 64, offset: 1792)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1355, file: !14, line: 1935, baseType: !1190, size: 64, align: 32, offset: 1856)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1355, file: !14, line: 1942, baseType: !944, size: 32, align: 32, offset: 1920)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1355, file: !14, line: 1948, baseType: !944, size: 32, align: 32, offset: 1952)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1355, file: !14, line: 1954, baseType: !944, size: 32, align: 32, offset: 1984)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1355, file: !14, line: 1960, baseType: !944, size: 32, align: 32, offset: 2016)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1355, file: !14, line: 1984, baseType: !944, size: 32, align: 32, offset: 2048)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1355, file: !14, line: 1991, baseType: !944, size: 32, align: 32, offset: 2080)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1355, file: !14, line: 1996, baseType: !944, size: 32, align: 32, offset: 2112)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1355, file: !14, line: 2004, baseType: !944, size: 32, align: 32, offset: 2144)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1355, file: !14, line: 2011, baseType: !944, size: 32, align: 32, offset: 2176)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1355, file: !14, line: 2018, baseType: !944, size: 32, align: 32, offset: 2208)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1355, file: !14, line: 2027, baseType: !944, size: 32, align: 32, offset: 2240)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1355, file: !14, line: 2034, baseType: !944, size: 32, align: 32, offset: 2272)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1355, file: !14, line: 2044, baseType: !944, size: 32, align: 32, offset: 2304)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1355, file: !14, line: 2054, baseType: !1562, size: 64, align: 64, offset: 2368)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1355, file: !14, line: 2061, baseType: !1562, size: 64, align: 64, offset: 2432)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1355, file: !14, line: 2066, baseType: !944, size: 32, align: 32, offset: 2496)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1355, file: !14, line: 2070, baseType: !944, size: 32, align: 32, offset: 2528)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1355, file: !14, line: 2078, baseType: !944, size: 32, align: 32, offset: 2560)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1355, file: !14, line: 2085, baseType: !944, size: 32, align: 32, offset: 2592)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1355, file: !14, line: 2092, baseType: !944, size: 32, align: 32, offset: 2624)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1355, file: !14, line: 2099, baseType: !944, size: 32, align: 32, offset: 2656)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1355, file: !14, line: 2106, baseType: !944, size: 32, align: 32, offset: 2688)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1355, file: !14, line: 2113, baseType: !944, size: 32, align: 32, offset: 2720)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1355, file: !14, line: 2120, baseType: !944, size: 32, align: 32, offset: 2752)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1355, file: !14, line: 2125, baseType: !944, size: 32, align: 32, offset: 2784)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1355, file: !14, line: 2133, baseType: !944, size: 32, align: 32, offset: 2816)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1355, file: !14, line: 2140, baseType: !944, size: 32, align: 32, offset: 2848)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1355, file: !14, line: 2145, baseType: !944, size: 32, align: 32, offset: 2880)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1355, file: !14, line: 2153, baseType: !944, size: 32, align: 32, offset: 2912)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1355, file: !14, line: 2158, baseType: !944, size: 32, align: 32, offset: 2944)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1355, file: !14, line: 2166, baseType: !574, size: 32, align: 32, offset: 2976)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1355, file: !14, line: 2173, baseType: !592, size: 32, align: 32, offset: 3008)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1355, file: !14, line: 2180, baseType: !616, size: 32, align: 32, offset: 3040)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1355, file: !14, line: 2187, baseType: !567, size: 32, align: 32, offset: 3072)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1355, file: !14, line: 2194, baseType: !635, size: 32, align: 32, offset: 3104)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1355, file: !14, line: 2203, baseType: !944, size: 32, align: 32, offset: 3136)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1355, file: !14, line: 2209, baseType: !876, size: 32, align: 32, offset: 3168)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1355, file: !14, line: 2212, baseType: !944, size: 32, align: 32, offset: 3200)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1355, file: !14, line: 2213, baseType: !944, size: 32, align: 32, offset: 3232)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1355, file: !14, line: 2220, baseType: !853, size: 32, align: 32, offset: 3264)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1355, file: !14, line: 2232, baseType: !944, size: 32, align: 32, offset: 3296)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1355, file: !14, line: 2243, baseType: !944, size: 32, align: 32, offset: 3328)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1355, file: !14, line: 2249, baseType: !944, size: 32, align: 32, offset: 3360)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1355, file: !14, line: 2256, baseType: !944, size: 32, align: 32, offset: 3392)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1355, file: !14, line: 2263, baseType: !1205, size: 64, align: 64, offset: 3456)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1355, file: !14, line: 2270, baseType: !1205, size: 64, align: 64, offset: 3520)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1355, file: !14, line: 2277, baseType: !884, size: 32, align: 32, offset: 3584)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1355, file: !14, line: 2285, baseType: !853, size: 32, align: 32, offset: 3616)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1355, file: !14, line: 2367, baseType: !1598, size: 64, align: 64, offset: 3648)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DISubroutineType(types: !1600)
!1600 = !{!944, !1525, !1171, !944}
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1355, file: !14, line: 2383, baseType: !944, size: 32, align: 32, offset: 3712)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1355, file: !14, line: 2386, baseType: !1532, size: 32, align: 32, offset: 3744)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1355, file: !14, line: 2387, baseType: !1532, size: 32, align: 32, offset: 3776)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1355, file: !14, line: 2394, baseType: !944, size: 32, align: 32, offset: 3808)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1355, file: !14, line: 2401, baseType: !944, size: 32, align: 32, offset: 3840)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1355, file: !14, line: 2408, baseType: !944, size: 32, align: 32, offset: 3872)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1355, file: !14, line: 2415, baseType: !944, size: 32, align: 32, offset: 3904)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1355, file: !14, line: 2422, baseType: !944, size: 32, align: 32, offset: 3936)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1355, file: !14, line: 2423, baseType: !1610, size: 64, align: 64, offset: 3968)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1612)
!1612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1613)
!1613 = !{!1614, !1615, !1616, !1617}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1612, file: !14, line: 827, baseType: !944, size: 32, align: 32)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1612, file: !14, line: 828, baseType: !944, size: 32, align: 32, offset: 32)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1612, file: !14, line: 829, baseType: !944, size: 32, align: 32, offset: 64)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1612, file: !14, line: 830, baseType: !1532, size: 32, align: 32, offset: 96)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1355, file: !14, line: 2430, baseType: !1080, size: 64, align: 64, offset: 4032)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1355, file: !14, line: 2437, baseType: !1080, size: 64, align: 64, offset: 4096)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1355, file: !14, line: 2444, baseType: !1532, size: 32, align: 32, offset: 4160)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1355, file: !14, line: 2451, baseType: !1532, size: 32, align: 32, offset: 4192)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1355, file: !14, line: 2458, baseType: !944, size: 32, align: 32, offset: 4224)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1355, file: !14, line: 2469, baseType: !944, size: 32, align: 32, offset: 4256)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1355, file: !14, line: 2475, baseType: !944, size: 32, align: 32, offset: 4288)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1355, file: !14, line: 2481, baseType: !944, size: 32, align: 32, offset: 4320)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1355, file: !14, line: 2485, baseType: !944, size: 32, align: 32, offset: 4352)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1355, file: !14, line: 2489, baseType: !944, size: 32, align: 32, offset: 4384)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1355, file: !14, line: 2493, baseType: !944, size: 32, align: 32, offset: 4416)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1355, file: !14, line: 2501, baseType: !944, size: 32, align: 32, offset: 4448)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1355, file: !14, line: 2506, baseType: !944, size: 32, align: 32, offset: 4480)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1355, file: !14, line: 2510, baseType: !944, size: 32, align: 32, offset: 4512)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1355, file: !14, line: 2514, baseType: !1080, size: 64, align: 64, offset: 4544)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1355, file: !14, line: 2528, baseType: !1634, size: 64, align: 64, offset: 4608)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DISubroutineType(types: !1636)
!1636 = !{null, !1525, !943, !944, !944}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1355, file: !14, line: 2534, baseType: !944, size: 32, align: 32, offset: 4672)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1355, file: !14, line: 2545, baseType: !944, size: 32, align: 32, offset: 4704)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1355, file: !14, line: 2547, baseType: !944, size: 32, align: 32, offset: 4736)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1355, file: !14, line: 2549, baseType: !944, size: 32, align: 32, offset: 4768)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1355, file: !14, line: 2551, baseType: !944, size: 32, align: 32, offset: 4800)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1355, file: !14, line: 2553, baseType: !944, size: 32, align: 32, offset: 4832)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1355, file: !14, line: 2555, baseType: !944, size: 32, align: 32, offset: 4864)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1355, file: !14, line: 2557, baseType: !944, size: 32, align: 32, offset: 4896)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1355, file: !14, line: 2559, baseType: !944, size: 32, align: 32, offset: 4928)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1355, file: !14, line: 2563, baseType: !944, size: 32, align: 32, offset: 4960)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1355, file: !14, line: 2571, baseType: !1458, size: 64, align: 64, offset: 4992)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1355, file: !14, line: 2579, baseType: !1458, size: 64, align: 64, offset: 5056)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1355, file: !14, line: 2586, baseType: !944, size: 32, align: 32, offset: 5120)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1355, file: !14, line: 2615, baseType: !944, size: 32, align: 32, offset: 5152)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1355, file: !14, line: 2627, baseType: !944, size: 32, align: 32, offset: 5184)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1355, file: !14, line: 2637, baseType: !944, size: 32, align: 32, offset: 5216)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1355, file: !14, line: 2681, baseType: !944, size: 32, align: 32, offset: 5248)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1355, file: !14, line: 2709, baseType: !1080, size: 64, align: 64, offset: 5312)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1355, file: !14, line: 2716, baseType: !1656, size: 64, align: 64, offset: 5376)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1658)
!1658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1659)
!1659 = !{!1660, !1661, !1662, !1663, !1664, !1665, !1666, !1670, !1674, !1675, !1676, !1677, !1683, !1684, !1685, !1686, !1687}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1658, file: !14, line: 3642, baseType: !961, size: 64, align: 64)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1658, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1658, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1658, file: !14, line: 3663, baseType: !654, size: 32, align: 32, offset: 128)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1658, file: !14, line: 3669, baseType: !944, size: 32, align: 32, offset: 160)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1658, file: !14, line: 3682, baseType: !1483, size: 64, align: 64, offset: 192)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1658, file: !14, line: 3698, baseType: !1667, size: 64, align: 64, offset: 256)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{!944, !1353, !1307, !952}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1658, file: !14, line: 3712, baseType: !1671, size: 64, align: 64, offset: 320)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DISubroutineType(types: !1673)
!1673 = !{!944, !1353, !944, !1307, !952}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1658, file: !14, line: 3726, baseType: !1667, size: 64, align: 64, offset: 384)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1658, file: !14, line: 3737, baseType: !1400, size: 64, align: 64, offset: 448)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1658, file: !14, line: 3746, baseType: !944, size: 32, align: 32, offset: 512)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1658, file: !14, line: 3757, baseType: !1678, size: 64, align: 64, offset: 576)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DISubroutineType(types: !1680)
!1680 = !{null, !1681}
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1658, file: !14, line: 3766, baseType: !1400, size: 64, align: 64, offset: 640)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1658, file: !14, line: 3774, baseType: !1400, size: 64, align: 64, offset: 704)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1658, file: !14, line: 3780, baseType: !944, size: 32, align: 32, offset: 768)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1658, file: !14, line: 3785, baseType: !944, size: 32, align: 32, offset: 800)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1658, file: !14, line: 3795, baseType: !1688, size: 64, align: 64, offset: 832)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!944, !1353, !1068}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1355, file: !14, line: 2728, baseType: !943, size: 64, align: 64, offset: 5440)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1355, file: !14, line: 2735, baseType: !1204, size: 512, align: 64, offset: 5504)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1355, file: !14, line: 2742, baseType: !944, size: 32, align: 32, offset: 6016)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1355, file: !14, line: 2755, baseType: !944, size: 32, align: 32, offset: 6048)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1355, file: !14, line: 2776, baseType: !944, size: 32, align: 32, offset: 6080)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1355, file: !14, line: 2783, baseType: !944, size: 32, align: 32, offset: 6112)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1355, file: !14, line: 2791, baseType: !944, size: 32, align: 32, offset: 6144)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1355, file: !14, line: 2802, baseType: !1171, size: 64, align: 64, offset: 6208)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1355, file: !14, line: 2811, baseType: !944, size: 32, align: 32, offset: 6272)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1355, file: !14, line: 2821, baseType: !944, size: 32, align: 32, offset: 6304)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1355, file: !14, line: 2830, baseType: !944, size: 32, align: 32, offset: 6336)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1355, file: !14, line: 2840, baseType: !944, size: 32, align: 32, offset: 6368)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1355, file: !14, line: 2851, baseType: !1704, size: 64, align: 64, offset: 6400)
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1705, size: 64, align: 64)
!1705 = !DISubroutineType(types: !1706)
!1706 = !{!944, !1525, !1707, !943, !1468, !944, !944}
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64, align: 64)
!1708 = !DISubroutineType(types: !1709)
!1709 = !{!944, !1525, !943}
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1355, file: !14, line: 2871, baseType: !1711, size: 64, align: 64, offset: 6464)
!1711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1712, size: 64, align: 64)
!1712 = !DISubroutineType(types: !1713)
!1713 = !{!944, !1525, !1714, !943, !1468, !944}
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1715, size: 64, align: 64)
!1715 = !DISubroutineType(types: !1716)
!1716 = !{!944, !1525, !943, !944, !944}
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1355, file: !14, line: 2878, baseType: !944, size: 32, align: 32, offset: 6528)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1355, file: !14, line: 2885, baseType: !944, size: 32, align: 32, offset: 6560)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1355, file: !14, line: 3005, baseType: !944, size: 32, align: 32, offset: 6592)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1355, file: !14, line: 3013, baseType: !896, size: 32, align: 32, offset: 6624)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1355, file: !14, line: 3020, baseType: !896, size: 32, align: 32, offset: 6656)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1355, file: !14, line: 3027, baseType: !896, size: 32, align: 32, offset: 6688)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1355, file: !14, line: 3037, baseType: !939, size: 64, align: 64, offset: 6720)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1355, file: !14, line: 3038, baseType: !944, size: 32, align: 32, offset: 6784)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1355, file: !14, line: 3050, baseType: !1205, size: 64, align: 64, offset: 6848)
