; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--matroska.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--matroska.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CodecTags = type { [22 x i8], i32 }
%struct.CodecMime = type { [32 x i8], i32 }
%struct.AVMetadataConv = type { i8*, i8* }
%struct.AVStream = type { i32, i32, %struct.AVCodecContext*, i8*, %struct.AVRational, i64, i64, i64, i32, i32, %struct.AVRational, %struct.AVDictionary*, %struct.AVRational, %struct.AVPacket, %struct.AVPacketSideData*, i32, i32, %struct.AVRational, i8*, %struct.AVCodecParameters*, %struct.anon*, i32, i64, i64, i64, i32, i32, i32, i32, %struct.AVCodecParserContext*, %struct.AVPacketList*, %struct.AVProbeData, [17 x i64], %struct.AVIndexEntry*, i32, i32, i32, i32, i32, i32, i64, i64, i32, i32, i32, i64, i64, i64, i32, i64, i64, i32, i32, [17 x i64], [17 x i8], i64, i8, i8, i32, %struct.AVRational, %struct.AVStreamInternal* }

!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !888, line: 782, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!889 = !{!890, !891, !892, !893, !894, !895}
!890 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!891 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!892 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!893 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!894 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!895 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !897)
!897 = !{!898, !899, !900, !901}
!898 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!899 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!900 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!901 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!902 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !903, line: 300, size: 32, align: 32, elements: !904)
!903 = !DIFile(filename: "libavformat/matroska.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!904 = !{!905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920}
!905 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_MONO", value: 0)
!906 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_LEFT_RIGHT", value: 1)
!907 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_BOTTOM_TOP", value: 2)
!908 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_TOP_BOTTOM", value: 3)
!909 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_CHECKERBOARD_RL", value: 4)
!910 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_CHECKERBOARD_LR", value: 5)
!911 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_ROW_INTERLEAVED_RL", value: 6)
!912 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_ROW_INTERLEAVED_LR", value: 7)
!913 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_COL_INTERLEAVED_RL", value: 8)
!914 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_COL_INTERLEAVED_LR", value: 9)
!915 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_ANAGLYPH_CYAN_RED", value: 10)
!916 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_RIGHT_LEFT", value: 11)
!917 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_ANAGLYPH_GREEN_MAG", value: 12)
!918 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_BOTH_EYES_BLOCK_LR", value: 13)
!919 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_BOTH_EYES_BLOCK_RL", value: 14)
!920 = !DIEnumerator(name: "MATROSKA_VIDEO_STEREOMODE_TYPE_NB", value: 15)
!921 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStereo3DType", file: !922, line: 51, size: 32, align: 32, elements: !923)
!922 = !DIFile(filename: "./libavutil/stereo3d.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!923 = !{!924, !925, !926, !927, !928, !929, !930, !931}
!924 = !DIEnumerator(name: "AV_STEREO3D_2D", value: 0)
!925 = !DIEnumerator(name: "AV_STEREO3D_SIDEBYSIDE", value: 1)
!926 = !DIEnumerator(name: "AV_STEREO3D_TOPBOTTOM", value: 2)
!927 = !DIEnumerator(name: "AV_STEREO3D_FRAMESEQUENCE", value: 3)
!928 = !DIEnumerator(name: "AV_STEREO3D_CHECKERBOARD", value: 4)
!929 = !DIEnumerator(name: "AV_STEREO3D_SIDEBYSIDE_QUINCUNX", value: 5)
!930 = !DIEnumerator(name: "AV_STEREO3D_LINES", value: 6)
!931 = !DIEnumerator(name: "AV_STEREO3D_COLUMNS", value: 7)
!932 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStereo3DView", file: !922, line: 147, size: 32, align: 32, elements: !933)
!933 = !{!934, !935, !936}
!934 = !DIEnumerator(name: "AV_STEREO3D_VIEW_PACKED", value: 0)
!935 = !DIEnumerator(name: "AV_STEREO3D_VIEW_LEFT", value: 1)
!936 = !DIEnumerator(name: "AV_STEREO3D_VIEW_RIGHT", value: 2)
!937 = !{!938}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !940, line: 48, baseType: !941)
!940 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!941 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!942 = !{!943, !958, !962, !976, !980, !993, !998}
!943 = distinct !DIGlobalVariable(name: "ff_mkv_codec_tags", scope: !0, file: !944, line: 29, type: !945, isLocal: false, isDefinition: true, variable: [70 x %struct.CodecTags]* @ff_mkv_codec_tags)
!944 = !DIFile(filename: "libavformat/matroska.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 15680, align: 32, elements: !956)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodecTags", file: !903, line: 355, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodecTags", file: !903, line: 352, size: 224, align: 32, elements: !949)
!949 = !{!950, !955}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !948, file: !903, line: 353, baseType: !951, size: 176, align: 8)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 176, align: 8, elements: !953)
!952 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!953 = !{!954}
!954 = !DISubrange(count: 22)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !948, file: !903, line: 354, baseType: !3, size: 32, align: 32, offset: 192)
!956 = !{!957}
!957 = !DISubrange(count: 70)
!958 = distinct !DIGlobalVariable(name: "ff_webm_codec_tags", scope: !0, file: !944, line: 106, type: !959, isLocal: false, isDefinition: true, variable: [10 x %struct.CodecTags]* @ff_webm_codec_tags)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 2240, align: 32, elements: !960)
!960 = !{!961}
!961 = !DISubrange(count: 10)
!962 = distinct !DIGlobalVariable(name: "ff_mkv_image_mime_tags", scope: !0, file: !944, line: 122, type: !963, isLocal: false, isDefinition: true, variable: [5 x %struct.CodecMime]* @ff_mkv_image_mime_tags)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 1440, align: 32, elements: !974)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodecMime", file: !966, line: 52, baseType: !967)
!966 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodecMime", file: !966, line: 49, size: 288, align: 32, elements: !968)
!968 = !{!969, !973}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !967, file: !966, line: 50, baseType: !970, size: 256, align: 8)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 256, align: 8, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !967, file: !966, line: 51, baseType: !3, size: 32, align: 32, offset: 256)
!974 = !{!975}
!975 = !DISubrange(count: 5)
!976 = distinct !DIGlobalVariable(name: "ff_mkv_mime_tags", scope: !0, file: !944, line: 131, type: !977, isLocal: false, isDefinition: true, variable: [6 x %struct.CodecMime]* @ff_mkv_mime_tags)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 1728, align: 32, elements: !978)
!978 = !{!979}
!979 = !DISubrange(count: 6)
!980 = distinct !DIGlobalVariable(name: "ff_mkv_metadata_conv", scope: !0, file: !944, line: 141, type: !981, isLocal: false, isDefinition: true, variable: [3 x %struct.AVMetadataConv]* @ff_mkv_metadata_conv)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 384, align: 64, elements: !991)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVMetadataConv", file: !984, line: 37, baseType: !985)
!984 = !DIFile(filename: "libavformat/metadata.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVMetadataConv", file: !984, line: 34, size: 128, align: 64, elements: !986)
!986 = !{!987, !990}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "native", scope: !985, file: !984, line: 35, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !985, file: !984, line: 36, baseType: !988, size: 64, align: 64, offset: 64)
!991 = !{!992}
!992 = !DISubrange(count: 3)
!993 = distinct !DIGlobalVariable(name: "ff_matroska_video_stereo_mode", scope: !0, file: !944, line: 147, type: !994, isLocal: false, isDefinition: true, variable: [15 x i8*]* @ff_matroska_video_stereo_mode)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !995, size: 960, align: 64, elements: !996)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!996 = !{!997}
!997 = !DISubrange(count: 15)
!998 = distinct !DIGlobalVariable(name: "ff_matroska_video_stereo_plane", scope: !0, file: !944, line: 165, type: !999, isLocal: false, isDefinition: true, variable: [3 x i8*]* @ff_matroska_video_stereo_plane)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !995, size: 192, align: 64, elements: !991)
!1000 = !{i32 2, !"Dwarf Version", i32 4}
!1001 = !{i32 2, !"Debug Info Version", i32 3}
!1002 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1003 = distinct !DISubprogram(name: "ff_mkv_stereo3d_conv", scope: !944, file: !944, line: 171, type: !1004, isLocal: false, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1878)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!1006, !1007, !1877}
!1006 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !888, line: 1223, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !888, line: 865, size: 6144, align: 64, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1656, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1755, !1761, !1770, !1774, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1806, !1807, !1808, !1809, !1810, !1811}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1009, file: !888, line: 866, baseType: !1006, size: 32, align: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1009, file: !888, line: 872, baseType: !1006, size: 32, align: 32, offset: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1009, file: !888, line: 878, baseType: !1014, size: 64, align: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1017)
!1017 = !{!1018, !1060, !1061, !1062, !1330, !1331, !1332, !1333, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1359, !1363, !1364, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1545, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1016, file: !4, line: 1561, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !1023)
!1023 = !{!1024, !1025, !1030, !1034, !1035, !1036, !1037, !1041, !1047, !1049, !1053}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1022, file: !464, line: 72, baseType: !988, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1022, file: !464, line: 78, baseType: !1026, size: 64, align: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!988, !1029}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1022, file: !464, line: 85, baseType: !1031, size: 64, align: 64, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1033)
!1033 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1022, file: !464, line: 93, baseType: !1006, size: 32, align: 32, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1022, file: !464, line: 99, baseType: !1006, size: 32, align: 32, offset: 224)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1022, file: !464, line: 108, baseType: !1006, size: 32, align: 32, offset: 256)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1022, file: !464, line: 113, baseType: !1038, size: 64, align: 64, offset: 320)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!1029, !1029, !1029}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1022, file: !464, line: 123, baseType: !1042, size: 64, align: 64, offset: 384)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!1045, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1022, file: !464, line: 130, baseType: !1048, size: 32, align: 32, offset: 448)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1022, file: !464, line: 136, baseType: !1050, size: 64, align: 64, offset: 512)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!1048, !1029}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1022, file: !464, line: 142, baseType: !1054, size: 64, align: 64, offset: 576)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!1006, !1057, !1029, !988, !1006}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1016, file: !4, line: 1562, baseType: !1006, size: 32, align: 32, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1016, file: !4, line: 1564, baseType: !484, size: 32, align: 32, offset: 96)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1016, file: !4, line: 1565, baseType: !1063, size: 64, align: 64, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1070, !1071, !1072, !1081, !1084, !1087, !1090, !1095, !1096, !1097, !1105, !1106, !1107, !1109, !1113, !1119, !1124, !1128, !1129, !1180, !1301, !1305, !1306, !1310, !1314, !1319, !1323, !1324, !1325}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1065, file: !4, line: 3475, baseType: !988, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1065, file: !4, line: 3480, baseType: !988, size: 64, align: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1065, file: !4, line: 3481, baseType: !484, size: 32, align: 32, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1065, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1065, file: !4, line: 3487, baseType: !1006, size: 32, align: 32, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1065, file: !4, line: 3488, baseType: !1073, size: 64, align: 64, offset: 256)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1075)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1076, line: 61, baseType: !1077)
!1076 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1076, line: 58, size: 64, align: 32, elements: !1078)
!1078 = !{!1079, !1080}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1077, file: !1076, line: 59, baseType: !1006, size: 32, align: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1077, file: !1076, line: 60, baseType: !1006, size: 32, align: 32, offset: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1065, file: !4, line: 3489, baseType: !1082, size: 64, align: 64, offset: 320)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1065, file: !4, line: 3490, baseType: !1085, size: 64, align: 64, offset: 384)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1065, file: !4, line: 3491, baseType: !1088, size: 64, align: 64, offset: 448)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1065, file: !4, line: 3492, baseType: !1091, size: 64, align: 64, offset: 512)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1093)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !940, line: 55, baseType: !1094)
!1094 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1065, file: !4, line: 3493, baseType: !939, size: 8, align: 8, offset: 576)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1065, file: !4, line: 3494, baseType: !1019, size: 64, align: 64, offset: 640)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1065, file: !4, line: 3495, baseType: !1098, size: 64, align: 64, offset: 704)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1100)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1102)
!1102 = !{!1103, !1104}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1101, file: !4, line: 3402, baseType: !1006, size: 32, align: 32)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1101, file: !4, line: 3403, baseType: !988, size: 64, align: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1065, file: !4, line: 3507, baseType: !988, size: 64, align: 64, offset: 768)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1065, file: !4, line: 3516, baseType: !1006, size: 32, align: 32, offset: 832)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1065, file: !4, line: 3517, baseType: !1108, size: 64, align: 64, offset: 896)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1065, file: !4, line: 3527, baseType: !1110, size: 64, align: 64, offset: 960)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!1006, !1014}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1065, file: !4, line: 3535, baseType: !1114, size: 64, align: 64, offset: 1024)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!1006, !1014, !1117}
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1065, file: !4, line: 3541, baseType: !1120, size: 64, align: 64, offset: 1088)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1122)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1123)
!1123 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1065, file: !4, line: 3549, baseType: !1125, size: 64, align: 64, offset: 1152)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{null, !1108}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1065, file: !4, line: 3551, baseType: !1110, size: 64, align: 64, offset: 1216)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1065, file: !4, line: 3552, baseType: !1130, size: 64, align: 64, offset: 1280)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!1006, !1014, !938, !1006, !1133}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1136)
!1136 = !{!1137, !1140, !1143, !1144, !1145, !1177}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1135, file: !4, line: 3921, baseType: !1138, size: 16, align: 16)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !940, line: 49, baseType: !1139)
!1139 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1135, file: !4, line: 3922, baseType: !1141, size: 32, align: 32, offset: 32)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !940, line: 51, baseType: !1142)
!1142 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1135, file: !4, line: 3923, baseType: !1141, size: 32, align: 32, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1135, file: !4, line: 3924, baseType: !1142, size: 32, align: 32, offset: 96)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1135, file: !4, line: 3925, baseType: !1146, size: 64, align: 64, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1149)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1150)
!1150 = !{!1151, !1152, !1153, !1154, !1155, !1156, !1166, !1170, !1172, !1173, !1175, !1176}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1149, file: !4, line: 3886, baseType: !1006, size: 32, align: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1149, file: !4, line: 3887, baseType: !1006, size: 32, align: 32, offset: 32)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1149, file: !4, line: 3888, baseType: !1006, size: 32, align: 32, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1149, file: !4, line: 3889, baseType: !1006, size: 32, align: 32, offset: 96)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1149, file: !4, line: 3890, baseType: !1006, size: 32, align: 32, offset: 128)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1149, file: !4, line: 3897, baseType: !1157, size: 768, align: 64, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1159)
!1159 = !{!1160, !1164}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1158, file: !4, line: 3855, baseType: !1161, size: 512, align: 64)
!1161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 512, align: 64, elements: !1162)
!1162 = !{!1163}
!1163 = !DISubrange(count: 8)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1158, file: !4, line: 3857, baseType: !1165, size: 256, align: 32, offset: 512)
!1165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 256, align: 32, elements: !1162)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1149, file: !4, line: 3903, baseType: !1167, size: 256, align: 64, offset: 960)
!1167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 256, align: 64, elements: !1168)
!1168 = !{!1169}
!1169 = !DISubrange(count: 4)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1149, file: !4, line: 3904, baseType: !1171, size: 128, align: 32, offset: 1216)
!1171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 128, align: 32, elements: !1168)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1149, file: !4, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1149, file: !4, line: 3908, baseType: !1174, size: 64, align: 64, offset: 1408)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1149, file: !4, line: 3915, baseType: !1174, size: 64, align: 64, offset: 1472)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1149, file: !4, line: 3917, baseType: !1006, size: 32, align: 32, offset: 1536)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1135, file: !4, line: 3926, baseType: !1178, size: 64, align: 64, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !940, line: 40, baseType: !1179)
!1179 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1065, file: !4, line: 3564, baseType: !1181, size: 64, align: 64, offset: 1344)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!1006, !1014, !1184, !1218, !1300}
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1187)
!1187 = !{!1188, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1214, !1215, !1216, !1217}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1186, file: !4, line: 1451, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1191, line: 94, baseType: !1192)
!1191 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1191, line: 81, size: 192, align: 64, elements: !1193)
!1193 = !{!1194, !1198, !1199}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1192, file: !1191, line: 82, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1191, line: 73, baseType: !1197)
!1197 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1191, line: 73, flags: DIFlagFwdDecl)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1192, file: !1191, line: 89, baseType: !938, size: 64, align: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1192, file: !1191, line: 93, baseType: !1006, size: 32, align: 32, offset: 128)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1186, file: !4, line: 1461, baseType: !1178, size: 64, align: 64, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1186, file: !4, line: 1467, baseType: !1178, size: 64, align: 64, offset: 128)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1186, file: !4, line: 1468, baseType: !938, size: 64, align: 64, offset: 192)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1186, file: !4, line: 1469, baseType: !1006, size: 32, align: 32, offset: 256)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1186, file: !4, line: 1470, baseType: !1006, size: 32, align: 32, offset: 288)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1186, file: !4, line: 1474, baseType: !1006, size: 32, align: 32, offset: 320)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1186, file: !4, line: 1479, baseType: !1207, size: 64, align: 64, offset: 384)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1210)
!1210 = !{!1211, !1212, !1213}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1209, file: !4, line: 1412, baseType: !938, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1209, file: !4, line: 1413, baseType: !1006, size: 32, align: 32, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1209, file: !4, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1186, file: !4, line: 1480, baseType: !1006, size: 32, align: 32, offset: 448)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1186, file: !4, line: 1486, baseType: !1178, size: 64, align: 64, offset: 512)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1186, file: !4, line: 1488, baseType: !1178, size: 64, align: 64, offset: 576)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1186, file: !4, line: 1497, baseType: !1178, size: 64, align: 64, offset: 640)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1222)
!1222 = !{!1223, !1224, !1225, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1252, !1254, !1255, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1288, !1289, !1290, !1291, !1292, !1293, !1296, !1297, !1298, !1299}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1221, file: !758, line: 282, baseType: !1161, size: 512, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1221, file: !758, line: 299, baseType: !1165, size: 256, align: 32, offset: 512)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1221, file: !758, line: 315, baseType: !1226, size: 64, align: 64, offset: 768)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1221, file: !758, line: 326, baseType: !1006, size: 32, align: 32, offset: 832)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1221, file: !758, line: 326, baseType: !1006, size: 32, align: 32, offset: 864)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1221, file: !758, line: 334, baseType: !1006, size: 32, align: 32, offset: 896)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1221, file: !758, line: 341, baseType: !1006, size: 32, align: 32, offset: 928)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1221, file: !758, line: 346, baseType: !1006, size: 32, align: 32, offset: 960)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1221, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1221, file: !758, line: 356, baseType: !1075, size: 64, align: 32, offset: 1024)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1221, file: !758, line: 361, baseType: !1178, size: 64, align: 64, offset: 1088)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1221, file: !758, line: 369, baseType: !1178, size: 64, align: 64, offset: 1152)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1221, file: !758, line: 377, baseType: !1178, size: 64, align: 64, offset: 1216)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1221, file: !758, line: 382, baseType: !1006, size: 32, align: 32, offset: 1280)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1221, file: !758, line: 386, baseType: !1006, size: 32, align: 32, offset: 1312)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1221, file: !758, line: 391, baseType: !1006, size: 32, align: 32, offset: 1344)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1221, file: !758, line: 396, baseType: !1029, size: 64, align: 64, offset: 1408)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1221, file: !758, line: 403, baseType: !1242, size: 512, align: 64, offset: 1472)
!1242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1093, size: 512, align: 64, elements: !1162)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1221, file: !758, line: 410, baseType: !1006, size: 32, align: 32, offset: 1984)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1221, file: !758, line: 415, baseType: !1006, size: 32, align: 32, offset: 2016)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1221, file: !758, line: 420, baseType: !1006, size: 32, align: 32, offset: 2048)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1221, file: !758, line: 425, baseType: !1006, size: 32, align: 32, offset: 2080)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1221, file: !758, line: 435, baseType: !1178, size: 64, align: 64, offset: 2112)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1221, file: !758, line: 440, baseType: !1006, size: 32, align: 32, offset: 2176)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1221, file: !758, line: 445, baseType: !1093, size: 64, align: 64, offset: 2240)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1221, file: !758, line: 459, baseType: !1251, size: 512, align: 64, offset: 2304)
!1251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1189, size: 512, align: 64, elements: !1162)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1221, file: !758, line: 473, baseType: !1253, size: 64, align: 64, offset: 2816)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1221, file: !758, line: 477, baseType: !1006, size: 32, align: 32, offset: 2880)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1221, file: !758, line: 479, baseType: !1256, size: 64, align: 64, offset: 2944)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1259)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1260)
!1260 = !{!1261, !1262, !1263, !1264, !1269}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1259, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1259, file: !758, line: 203, baseType: !938, size: 64, align: 64, offset: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1259, file: !758, line: 204, baseType: !1006, size: 32, align: 32, offset: 128)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1259, file: !758, line: 205, baseType: !1265, size: 64, align: 64, offset: 192)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1267, line: 86, baseType: !1268)
!1267 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1268 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1267, line: 86, flags: DIFlagFwdDecl)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1259, file: !758, line: 206, baseType: !1189, size: 64, align: 64, offset: 256)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1221, file: !758, line: 480, baseType: !1006, size: 32, align: 32, offset: 3008)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1221, file: !758, line: 505, baseType: !1006, size: 32, align: 32, offset: 3040)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1221, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1221, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1221, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1221, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1221, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1221, file: !758, line: 532, baseType: !1178, size: 64, align: 64, offset: 3264)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1221, file: !758, line: 539, baseType: !1178, size: 64, align: 64, offset: 3328)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1221, file: !758, line: 547, baseType: !1178, size: 64, align: 64, offset: 3392)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1221, file: !758, line: 554, baseType: !1265, size: 64, align: 64, offset: 3456)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1221, file: !758, line: 563, baseType: !1006, size: 32, align: 32, offset: 3520)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1221, file: !758, line: 572, baseType: !1006, size: 32, align: 32, offset: 3552)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1221, file: !758, line: 581, baseType: !1006, size: 32, align: 32, offset: 3584)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1221, file: !758, line: 588, baseType: !1285, size: 64, align: 64, offset: 3648)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !940, line: 36, baseType: !1287)
!1287 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1221, file: !758, line: 593, baseType: !1006, size: 32, align: 32, offset: 3712)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1221, file: !758, line: 596, baseType: !1006, size: 32, align: 32, offset: 3744)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1221, file: !758, line: 599, baseType: !1189, size: 64, align: 64, offset: 3776)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1221, file: !758, line: 605, baseType: !1189, size: 64, align: 64, offset: 3840)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1221, file: !758, line: 616, baseType: !1189, size: 64, align: 64, offset: 3904)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1221, file: !758, line: 626, baseType: !1294, size: 64, align: 64, offset: 3968)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1295, line: 216, baseType: !1094)
!1295 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1221, file: !758, line: 627, baseType: !1294, size: 64, align: 64, offset: 4032)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1221, file: !758, line: 628, baseType: !1294, size: 64, align: 64, offset: 4096)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1221, file: !758, line: 629, baseType: !1294, size: 64, align: 64, offset: 4160)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1221, file: !758, line: 645, baseType: !1189, size: 64, align: 64, offset: 4224)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1065, file: !4, line: 3566, baseType: !1302, size: 64, align: 64, offset: 1408)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!1006, !1014, !1029, !1300, !1184}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1065, file: !4, line: 3567, baseType: !1110, size: 64, align: 64, offset: 1472)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1065, file: !4, line: 3576, baseType: !1307, size: 64, align: 64, offset: 1536)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!1006, !1014, !1218}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1065, file: !4, line: 3577, baseType: !1311, size: 64, align: 64, offset: 1600)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!1006, !1014, !1184}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1065, file: !4, line: 3584, baseType: !1315, size: 64, align: 64, offset: 1664)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!1006, !1014, !1318}
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1065, file: !4, line: 3589, baseType: !1320, size: 64, align: 64, offset: 1728)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{null, !1014}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1065, file: !4, line: 3594, baseType: !1006, size: 32, align: 32, offset: 1792)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1065, file: !4, line: 3600, baseType: !988, size: 64, align: 64, offset: 1856)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1065, file: !4, line: 3609, baseType: !1326, size: 64, align: 64, offset: 1920)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1329)
!1329 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1016, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1016, file: !4, line: 1581, baseType: !1142, size: 32, align: 32, offset: 224)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1016, file: !4, line: 1583, baseType: !1029, size: 64, align: 64, offset: 256)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1016, file: !4, line: 1591, baseType: !1334, size: 64, align: 64, offset: 320)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1016, file: !4, line: 1598, baseType: !1029, size: 64, align: 64, offset: 384)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1016, file: !4, line: 1606, baseType: !1178, size: 64, align: 64, offset: 448)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1016, file: !4, line: 1614, baseType: !1006, size: 32, align: 32, offset: 512)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1016, file: !4, line: 1622, baseType: !1006, size: 32, align: 32, offset: 544)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1016, file: !4, line: 1628, baseType: !1006, size: 32, align: 32, offset: 576)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1016, file: !4, line: 1636, baseType: !1006, size: 32, align: 32, offset: 608)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1016, file: !4, line: 1643, baseType: !1006, size: 32, align: 32, offset: 640)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1016, file: !4, line: 1657, baseType: !938, size: 64, align: 64, offset: 704)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1016, file: !4, line: 1658, baseType: !1006, size: 32, align: 32, offset: 768)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1016, file: !4, line: 1679, baseType: !1075, size: 64, align: 32, offset: 800)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1016, file: !4, line: 1688, baseType: !1006, size: 32, align: 32, offset: 864)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1016, file: !4, line: 1712, baseType: !1006, size: 32, align: 32, offset: 896)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1016, file: !4, line: 1729, baseType: !1006, size: 32, align: 32, offset: 928)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1016, file: !4, line: 1729, baseType: !1006, size: 32, align: 32, offset: 960)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1016, file: !4, line: 1744, baseType: !1006, size: 32, align: 32, offset: 992)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1016, file: !4, line: 1744, baseType: !1006, size: 32, align: 32, offset: 1024)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1016, file: !4, line: 1751, baseType: !1006, size: 32, align: 32, offset: 1056)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1016, file: !4, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1016, file: !4, line: 1791, baseType: !1355, size: 64, align: 64, offset: 1152)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{null, !1358, !1218, !1300, !1006, !1006, !1006}
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1016, file: !4, line: 1808, baseType: !1360, size: 64, align: 64, offset: 1216)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{!494, !1358, !1082}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1016, file: !4, line: 1816, baseType: !1006, size: 32, align: 32, offset: 1280)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1016, file: !4, line: 1825, baseType: !1365, size: 32, align: 32, offset: 1312)
!1365 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1016, file: !4, line: 1830, baseType: !1006, size: 32, align: 32, offset: 1344)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1016, file: !4, line: 1838, baseType: !1365, size: 32, align: 32, offset: 1376)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1016, file: !4, line: 1846, baseType: !1006, size: 32, align: 32, offset: 1408)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1016, file: !4, line: 1851, baseType: !1006, size: 32, align: 32, offset: 1440)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1016, file: !4, line: 1861, baseType: !1365, size: 32, align: 32, offset: 1472)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1016, file: !4, line: 1868, baseType: !1365, size: 32, align: 32, offset: 1504)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1016, file: !4, line: 1875, baseType: !1365, size: 32, align: 32, offset: 1536)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1016, file: !4, line: 1882, baseType: !1365, size: 32, align: 32, offset: 1568)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1016, file: !4, line: 1889, baseType: !1365, size: 32, align: 32, offset: 1600)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1016, file: !4, line: 1896, baseType: !1365, size: 32, align: 32, offset: 1632)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1016, file: !4, line: 1903, baseType: !1365, size: 32, align: 32, offset: 1664)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1016, file: !4, line: 1910, baseType: !1006, size: 32, align: 32, offset: 1696)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1016, file: !4, line: 1915, baseType: !1006, size: 32, align: 32, offset: 1728)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1016, file: !4, line: 1926, baseType: !1300, size: 64, align: 64, offset: 1792)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1016, file: !4, line: 1935, baseType: !1075, size: 64, align: 32, offset: 1856)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1016, file: !4, line: 1942, baseType: !1006, size: 32, align: 32, offset: 1920)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1016, file: !4, line: 1948, baseType: !1006, size: 32, align: 32, offset: 1952)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1016, file: !4, line: 1954, baseType: !1006, size: 32, align: 32, offset: 1984)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1016, file: !4, line: 1960, baseType: !1006, size: 32, align: 32, offset: 2016)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1016, file: !4, line: 1984, baseType: !1006, size: 32, align: 32, offset: 2048)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1016, file: !4, line: 1991, baseType: !1006, size: 32, align: 32, offset: 2080)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1016, file: !4, line: 1996, baseType: !1006, size: 32, align: 32, offset: 2112)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1016, file: !4, line: 2004, baseType: !1006, size: 32, align: 32, offset: 2144)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1016, file: !4, line: 2011, baseType: !1006, size: 32, align: 32, offset: 2176)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1016, file: !4, line: 2018, baseType: !1006, size: 32, align: 32, offset: 2208)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1016, file: !4, line: 2027, baseType: !1006, size: 32, align: 32, offset: 2240)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1016, file: !4, line: 2034, baseType: !1006, size: 32, align: 32, offset: 2272)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1016, file: !4, line: 2044, baseType: !1006, size: 32, align: 32, offset: 2304)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1016, file: !4, line: 2054, baseType: !1395, size: 64, align: 64, offset: 2368)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1016, file: !4, line: 2061, baseType: !1395, size: 64, align: 64, offset: 2432)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1016, file: !4, line: 2066, baseType: !1006, size: 32, align: 32, offset: 2496)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1016, file: !4, line: 2070, baseType: !1006, size: 32, align: 32, offset: 2528)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1016, file: !4, line: 2078, baseType: !1006, size: 32, align: 32, offset: 2560)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1016, file: !4, line: 2085, baseType: !1006, size: 32, align: 32, offset: 2592)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1016, file: !4, line: 2092, baseType: !1006, size: 32, align: 32, offset: 2624)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1016, file: !4, line: 2099, baseType: !1006, size: 32, align: 32, offset: 2656)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1016, file: !4, line: 2106, baseType: !1006, size: 32, align: 32, offset: 2688)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1016, file: !4, line: 2113, baseType: !1006, size: 32, align: 32, offset: 2720)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1016, file: !4, line: 2120, baseType: !1006, size: 32, align: 32, offset: 2752)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1016, file: !4, line: 2125, baseType: !1006, size: 32, align: 32, offset: 2784)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1016, file: !4, line: 2133, baseType: !1006, size: 32, align: 32, offset: 2816)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1016, file: !4, line: 2140, baseType: !1006, size: 32, align: 32, offset: 2848)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1016, file: !4, line: 2145, baseType: !1006, size: 32, align: 32, offset: 2880)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1016, file: !4, line: 2153, baseType: !1006, size: 32, align: 32, offset: 2912)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1016, file: !4, line: 2158, baseType: !1006, size: 32, align: 32, offset: 2944)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1016, file: !4, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1016, file: !4, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1016, file: !4, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1016, file: !4, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1016, file: !4, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1016, file: !4, line: 2203, baseType: !1006, size: 32, align: 32, offset: 3136)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1016, file: !4, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1016, file: !4, line: 2212, baseType: !1006, size: 32, align: 32, offset: 3200)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1016, file: !4, line: 2213, baseType: !1006, size: 32, align: 32, offset: 3232)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1016, file: !4, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1016, file: !4, line: 2232, baseType: !1006, size: 32, align: 32, offset: 3296)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1016, file: !4, line: 2243, baseType: !1006, size: 32, align: 32, offset: 3328)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1016, file: !4, line: 2249, baseType: !1006, size: 32, align: 32, offset: 3360)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1016, file: !4, line: 2256, baseType: !1006, size: 32, align: 32, offset: 3392)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1016, file: !4, line: 2263, baseType: !1093, size: 64, align: 64, offset: 3456)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1016, file: !4, line: 2270, baseType: !1093, size: 64, align: 64, offset: 3520)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1016, file: !4, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1016, file: !4, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1016, file: !4, line: 2367, baseType: !1431, size: 64, align: 64, offset: 3648)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{!1006, !1358, !1318, !1006}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1016, file: !4, line: 2383, baseType: !1006, size: 32, align: 32, offset: 3712)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1016, file: !4, line: 2386, baseType: !1365, size: 32, align: 32, offset: 3744)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1016, file: !4, line: 2387, baseType: !1365, size: 32, align: 32, offset: 3776)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1016, file: !4, line: 2394, baseType: !1006, size: 32, align: 32, offset: 3808)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1016, file: !4, line: 2401, baseType: !1006, size: 32, align: 32, offset: 3840)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1016, file: !4, line: 2408, baseType: !1006, size: 32, align: 32, offset: 3872)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1016, file: !4, line: 2415, baseType: !1006, size: 32, align: 32, offset: 3904)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1016, file: !4, line: 2422, baseType: !1006, size: 32, align: 32, offset: 3936)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1016, file: !4, line: 2423, baseType: !1443, size: 64, align: 64, offset: 3968)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1445)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1446)
!1446 = !{!1447, !1448, !1449, !1450}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1445, file: !4, line: 827, baseType: !1006, size: 32, align: 32)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1445, file: !4, line: 828, baseType: !1006, size: 32, align: 32, offset: 32)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1445, file: !4, line: 829, baseType: !1006, size: 32, align: 32, offset: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1445, file: !4, line: 830, baseType: !1365, size: 32, align: 32, offset: 96)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1016, file: !4, line: 2430, baseType: !1178, size: 64, align: 64, offset: 4032)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1016, file: !4, line: 2437, baseType: !1178, size: 64, align: 64, offset: 4096)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1016, file: !4, line: 2444, baseType: !1365, size: 32, align: 32, offset: 4160)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1016, file: !4, line: 2451, baseType: !1365, size: 32, align: 32, offset: 4192)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1016, file: !4, line: 2458, baseType: !1006, size: 32, align: 32, offset: 4224)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1016, file: !4, line: 2469, baseType: !1006, size: 32, align: 32, offset: 4256)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1016, file: !4, line: 2475, baseType: !1006, size: 32, align: 32, offset: 4288)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1016, file: !4, line: 2481, baseType: !1006, size: 32, align: 32, offset: 4320)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1016, file: !4, line: 2485, baseType: !1006, size: 32, align: 32, offset: 4352)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1016, file: !4, line: 2489, baseType: !1006, size: 32, align: 32, offset: 4384)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1016, file: !4, line: 2493, baseType: !1006, size: 32, align: 32, offset: 4416)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1016, file: !4, line: 2501, baseType: !1006, size: 32, align: 32, offset: 4448)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1016, file: !4, line: 2506, baseType: !1006, size: 32, align: 32, offset: 4480)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1016, file: !4, line: 2510, baseType: !1006, size: 32, align: 32, offset: 4512)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1016, file: !4, line: 2514, baseType: !1178, size: 64, align: 64, offset: 4544)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1016, file: !4, line: 2528, baseType: !1467, size: 64, align: 64, offset: 4608)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DISubroutineType(types: !1469)
!1469 = !{null, !1358, !1029, !1006, !1006}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1016, file: !4, line: 2534, baseType: !1006, size: 32, align: 32, offset: 4672)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1016, file: !4, line: 2545, baseType: !1006, size: 32, align: 32, offset: 4704)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1016, file: !4, line: 2547, baseType: !1006, size: 32, align: 32, offset: 4736)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1016, file: !4, line: 2549, baseType: !1006, size: 32, align: 32, offset: 4768)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1016, file: !4, line: 2551, baseType: !1006, size: 32, align: 32, offset: 4800)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1016, file: !4, line: 2553, baseType: !1006, size: 32, align: 32, offset: 4832)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1016, file: !4, line: 2555, baseType: !1006, size: 32, align: 32, offset: 4864)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1016, file: !4, line: 2557, baseType: !1006, size: 32, align: 32, offset: 4896)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1016, file: !4, line: 2559, baseType: !1006, size: 32, align: 32, offset: 4928)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1016, file: !4, line: 2563, baseType: !1006, size: 32, align: 32, offset: 4960)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1016, file: !4, line: 2571, baseType: !1174, size: 64, align: 64, offset: 4992)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1016, file: !4, line: 2579, baseType: !1174, size: 64, align: 64, offset: 5056)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1016, file: !4, line: 2586, baseType: !1006, size: 32, align: 32, offset: 5120)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1016, file: !4, line: 2615, baseType: !1006, size: 32, align: 32, offset: 5152)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1016, file: !4, line: 2627, baseType: !1006, size: 32, align: 32, offset: 5184)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1016, file: !4, line: 2637, baseType: !1006, size: 32, align: 32, offset: 5216)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1016, file: !4, line: 2681, baseType: !1006, size: 32, align: 32, offset: 5248)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1016, file: !4, line: 2709, baseType: !1178, size: 64, align: 64, offset: 5312)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1016, file: !4, line: 2716, baseType: !1489, size: 64, align: 64, offset: 5376)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1491)
!1491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1492)
!1492 = !{!1493, !1494, !1495, !1496, !1497, !1498, !1499, !1505, !1509, !1510, !1511, !1512, !1518, !1519, !1520, !1521, !1522}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1491, file: !4, line: 3642, baseType: !988, size: 64, align: 64)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1491, file: !4, line: 3649, baseType: !484, size: 32, align: 32, offset: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1491, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1491, file: !4, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1491, file: !4, line: 3669, baseType: !1006, size: 32, align: 32, offset: 160)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1491, file: !4, line: 3682, baseType: !1315, size: 64, align: 64, offset: 192)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1491, file: !4, line: 3698, baseType: !1500, size: 64, align: 64, offset: 256)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{!1006, !1014, !1503, !1141}
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1491, file: !4, line: 3712, baseType: !1506, size: 64, align: 64, offset: 320)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{!1006, !1014, !1006, !1503, !1141}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1491, file: !4, line: 3726, baseType: !1500, size: 64, align: 64, offset: 384)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1491, file: !4, line: 3737, baseType: !1110, size: 64, align: 64, offset: 448)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1491, file: !4, line: 3746, baseType: !1006, size: 32, align: 32, offset: 512)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1491, file: !4, line: 3757, baseType: !1513, size: 64, align: 64, offset: 576)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{null, !1516}
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1491, file: !4, line: 3766, baseType: !1110, size: 64, align: 64, offset: 640)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1491, file: !4, line: 3774, baseType: !1110, size: 64, align: 64, offset: 704)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1491, file: !4, line: 3780, baseType: !1006, size: 32, align: 32, offset: 768)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1491, file: !4, line: 3785, baseType: !1006, size: 32, align: 32, offset: 800)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1491, file: !4, line: 3795, baseType: !1523, size: 64, align: 64, offset: 832)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DISubroutineType(types: !1525)
!1525 = !{!1006, !1014, !1189}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1016, file: !4, line: 2728, baseType: !1029, size: 64, align: 64, offset: 5440)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1016, file: !4, line: 2735, baseType: !1242, size: 512, align: 64, offset: 5504)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1016, file: !4, line: 2742, baseType: !1006, size: 32, align: 32, offset: 6016)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1016, file: !4, line: 2755, baseType: !1006, size: 32, align: 32, offset: 6048)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1016, file: !4, line: 2776, baseType: !1006, size: 32, align: 32, offset: 6080)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1016, file: !4, line: 2783, baseType: !1006, size: 32, align: 32, offset: 6112)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1016, file: !4, line: 2791, baseType: !1006, size: 32, align: 32, offset: 6144)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1016, file: !4, line: 2802, baseType: !1318, size: 64, align: 64, offset: 6208)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1016, file: !4, line: 2811, baseType: !1006, size: 32, align: 32, offset: 6272)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1016, file: !4, line: 2821, baseType: !1006, size: 32, align: 32, offset: 6304)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1016, file: !4, line: 2830, baseType: !1006, size: 32, align: 32, offset: 6336)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1016, file: !4, line: 2840, baseType: !1006, size: 32, align: 32, offset: 6368)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1016, file: !4, line: 2851, baseType: !1539, size: 64, align: 64, offset: 6400)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DISubroutineType(types: !1541)
!1541 = !{!1006, !1358, !1542, !1029, !1300, !1006, !1006}
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DISubroutineType(types: !1544)
!1544 = !{!1006, !1358, !1029}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1016, file: !4, line: 2871, baseType: !1546, size: 64, align: 64, offset: 6464)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DISubroutineType(types: !1548)
!1548 = !{!1006, !1358, !1549, !1029, !1300, !1006}
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64, align: 64)
!1550 = !DISubroutineType(types: !1551)
!1551 = !{!1006, !1358, !1029, !1006, !1006}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1016, file: !4, line: 2878, baseType: !1006, size: 32, align: 32, offset: 6528)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1016, file: !4, line: 2885, baseType: !1006, size: 32, align: 32, offset: 6560)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1016, file: !4, line: 3005, baseType: !1006, size: 32, align: 32, offset: 6592)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1016, file: !4, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1016, file: !4, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1016, file: !4, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1016, file: !4, line: 3037, baseType: !938, size: 64, align: 64, offset: 6720)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1016, file: !4, line: 3038, baseType: !1006, size: 32, align: 32, offset: 6784)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1016, file: !4, line: 3050, baseType: !1093, size: 64, align: 64, offset: 6848)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1016, file: !4, line: 3065, baseType: !1006, size: 32, align: 32, offset: 6912)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1016, file: !4, line: 3083, baseType: !1006, size: 32, align: 32, offset: 6944)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1016, file: !4, line: 3092, baseType: !1075, size: 64, align: 32, offset: 6976)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1016, file: !4, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1016, file: !4, line: 3106, baseType: !1075, size: 64, align: 32, offset: 7072)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1016, file: !4, line: 3113, baseType: !1567, size: 64, align: 64, offset: 7168)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1569)
!1569 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1570)
!1570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1571)
!1571 = !{!1572, !1573, !1574, !1575, !1576, !1577, !1579}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1570, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1570, file: !4, line: 714, baseType: !484, size: 32, align: 32, offset: 32)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1570, file: !4, line: 720, baseType: !988, size: 64, align: 64, offset: 64)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1570, file: !4, line: 724, baseType: !988, size: 64, align: 64, offset: 128)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1570, file: !4, line: 728, baseType: !1006, size: 32, align: 32, offset: 192)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1570, file: !4, line: 734, baseType: !1578, size: 64, align: 64, offset: 256)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1570, file: !4, line: 739, baseType: !1580, size: 64, align: 64, offset: 320)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1101)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1016, file: !4, line: 3129, baseType: !1178, size: 64, align: 64, offset: 7232)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1016, file: !4, line: 3130, baseType: !1178, size: 64, align: 64, offset: 7296)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1016, file: !4, line: 3131, baseType: !1178, size: 64, align: 64, offset: 7360)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1016, file: !4, line: 3132, baseType: !1178, size: 64, align: 64, offset: 7424)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1016, file: !4, line: 3139, baseType: !1174, size: 64, align: 64, offset: 7488)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1016, file: !4, line: 3147, baseType: !1006, size: 32, align: 32, offset: 7552)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1016, file: !4, line: 3165, baseType: !1006, size: 32, align: 32, offset: 7584)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1016, file: !4, line: 3172, baseType: !1006, size: 32, align: 32, offset: 7616)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1016, file: !4, line: 3180, baseType: !1006, size: 32, align: 32, offset: 7648)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1016, file: !4, line: 3191, baseType: !1395, size: 64, align: 64, offset: 7680)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1016, file: !4, line: 3199, baseType: !938, size: 64, align: 64, offset: 7744)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1016, file: !4, line: 3207, baseType: !1174, size: 64, align: 64, offset: 7808)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1016, file: !4, line: 3214, baseType: !1142, size: 32, align: 32, offset: 7872)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1016, file: !4, line: 3224, baseType: !1207, size: 64, align: 64, offset: 7936)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1016, file: !4, line: 3225, baseType: !1006, size: 32, align: 32, offset: 8000)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1016, file: !4, line: 3249, baseType: !1189, size: 64, align: 64, offset: 8064)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1016, file: !4, line: 3256, baseType: !1006, size: 32, align: 32, offset: 8128)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1016, file: !4, line: 3271, baseType: !1006, size: 32, align: 32, offset: 8160)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1016, file: !4, line: 3279, baseType: !1178, size: 64, align: 64, offset: 8192)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1016, file: !4, line: 3301, baseType: !1189, size: 64, align: 64, offset: 8256)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1016, file: !4, line: 3310, baseType: !1006, size: 32, align: 32, offset: 8320)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1016, file: !4, line: 3337, baseType: !1006, size: 32, align: 32, offset: 8352)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1016, file: !4, line: 3351, baseType: !1006, size: 32, align: 32, offset: 8384)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1016, file: !4, line: 3359, baseType: !1006, size: 32, align: 32, offset: 8416)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1009, file: !888, line: 880, baseType: !1029, size: 64, align: 64, offset: 128)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1009, file: !888, line: 894, baseType: !1075, size: 64, align: 32, offset: 192)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !1009, file: !888, line: 904, baseType: !1178, size: 64, align: 64, offset: 256)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1009, file: !888, line: 914, baseType: !1178, size: 64, align: 64, offset: 320)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "nb_frames", scope: !1009, file: !888, line: 916, baseType: !1178, size: 64, align: 64, offset: 384)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "disposition", scope: !1009, file: !888, line: 918, baseType: !1006, size: 32, align: 32, offset: 448)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "discard", scope: !1009, file: !888, line: 920, baseType: !878, size: 32, align: 32, offset: 480)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1009, file: !888, line: 927, baseType: !1075, size: 64, align: 32, offset: 512)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1009, file: !888, line: 929, baseType: !1265, size: 64, align: 64, offset: 576)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "avg_frame_rate", scope: !1009, file: !888, line: 938, baseType: !1075, size: 64, align: 32, offset: 640)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "attached_pic", scope: !1009, file: !888, line: 947, baseType: !1185, size: 704, align: 64, offset: 704)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1009, file: !888, line: 967, baseType: !1207, size: 64, align: 64, offset: 1408)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1009, file: !888, line: 971, baseType: !1006, size: 32, align: 32, offset: 1472)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "event_flags", scope: !1009, file: !888, line: 978, baseType: !1006, size: 32, align: 32, offset: 1504)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "r_frame_rate", scope: !1009, file: !888, line: 989, baseType: !1075, size: 64, align: 32, offset: 1536)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "recommended_encoder_configuration", scope: !1009, file: !888, line: 1000, baseType: !1174, size: 64, align: 64, offset: 1600)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "codecpar", scope: !1009, file: !888, line: 1012, baseType: !1623, size: 64, align: 64, offset: 1664)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1625)
!1625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1626)
!1626 = !{!1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1625, file: !4, line: 3940, baseType: !484, size: 32, align: 32)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1625, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1625, file: !4, line: 3948, baseType: !1141, size: 32, align: 32, offset: 64)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1625, file: !4, line: 3958, baseType: !938, size: 64, align: 64, offset: 128)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1625, file: !4, line: 3962, baseType: !1006, size: 32, align: 32, offset: 192)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1625, file: !4, line: 3968, baseType: !1006, size: 32, align: 32, offset: 224)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1625, file: !4, line: 3973, baseType: !1178, size: 64, align: 64, offset: 256)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1625, file: !4, line: 3986, baseType: !1006, size: 32, align: 32, offset: 320)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1625, file: !4, line: 3999, baseType: !1006, size: 32, align: 32, offset: 352)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1625, file: !4, line: 4004, baseType: !1006, size: 32, align: 32, offset: 384)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1625, file: !4, line: 4005, baseType: !1006, size: 32, align: 32, offset: 416)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1625, file: !4, line: 4010, baseType: !1006, size: 32, align: 32, offset: 448)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1625, file: !4, line: 4011, baseType: !1006, size: 32, align: 32, offset: 480)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1625, file: !4, line: 4020, baseType: !1075, size: 64, align: 32, offset: 512)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1625, file: !4, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1625, file: !4, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1625, file: !4, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1625, file: !4, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1625, file: !4, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1625, file: !4, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1625, file: !4, line: 4039, baseType: !1006, size: 32, align: 32, offset: 768)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1625, file: !4, line: 4046, baseType: !1093, size: 64, align: 64, offset: 832)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1625, file: !4, line: 4050, baseType: !1006, size: 32, align: 32, offset: 896)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1625, file: !4, line: 4054, baseType: !1006, size: 32, align: 32, offset: 928)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1625, file: !4, line: 4061, baseType: !1006, size: 32, align: 32, offset: 960)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1625, file: !4, line: 4065, baseType: !1006, size: 32, align: 32, offset: 992)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1625, file: !4, line: 4073, baseType: !1006, size: 32, align: 32, offset: 1024)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1625, file: !4, line: 4080, baseType: !1006, size: 32, align: 32, offset: 1056)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1625, file: !4, line: 4084, baseType: !1006, size: 32, align: 32, offset: 1088)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1009, file: !888, line: 1055, baseType: !1657, size: 64, align: 64, offset: 1728)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1009, file: !888, line: 1028, size: 832, align: 64, elements: !1659)
!1659 = !{!1660, !1661, !1662, !1663, !1664, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !1658, file: !888, line: 1029, baseType: !1178, size: 64, align: 64)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "duration_gcd", scope: !1658, file: !888, line: 1030, baseType: !1178, size: 64, align: 64, offset: 64)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "duration_count", scope: !1658, file: !888, line: 1031, baseType: !1006, size: 32, align: 32, offset: 128)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "rfps_duration_sum", scope: !1658, file: !888, line: 1032, baseType: !1178, size: 64, align: 64, offset: 192)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "duration_error", scope: !1658, file: !888, line: 1033, baseType: !1665, size: 64, align: 64, offset: 256)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1667, size: 51072, align: 64, elements: !1668)
!1667 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1668 = !{!1669, !1670}
!1669 = !DISubrange(count: 2)
!1670 = !DISubrange(count: 399)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "codec_info_duration", scope: !1658, file: !888, line: 1034, baseType: !1178, size: 64, align: 64, offset: 320)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "codec_info_duration_fields", scope: !1658, file: !888, line: 1035, baseType: !1178, size: 64, align: 64, offset: 384)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "frame_delay_evidence", scope: !1658, file: !888, line: 1036, baseType: !1006, size: 32, align: 32, offset: 448)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "found_decoder", scope: !1658, file: !888, line: 1043, baseType: !1006, size: 32, align: 32, offset: 480)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "last_duration", scope: !1658, file: !888, line: 1045, baseType: !1178, size: 64, align: 64, offset: 512)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "fps_first_dts", scope: !1658, file: !888, line: 1050, baseType: !1178, size: 64, align: 64, offset: 576)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "fps_first_dts_idx", scope: !1658, file: !888, line: 1051, baseType: !1006, size: 32, align: 32, offset: 640)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "fps_last_dts", scope: !1658, file: !888, line: 1052, baseType: !1178, size: 64, align: 64, offset: 704)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "fps_last_dts_idx", scope: !1658, file: !888, line: 1053, baseType: !1006, size: 32, align: 32, offset: 768)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "pts_wrap_bits", scope: !1009, file: !888, line: 1057, baseType: !1006, size: 32, align: 32, offset: 1792)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "first_dts", scope: !1009, file: !888, line: 1067, baseType: !1178, size: 64, align: 64, offset: 1856)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "cur_dts", scope: !1009, file: !888, line: 1068, baseType: !1178, size: 64, align: 64, offset: 1920)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "last_IP_pts", scope: !1009, file: !888, line: 1069, baseType: !1178, size: 64, align: 64, offset: 1984)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "last_IP_duration", scope: !1009, file: !888, line: 1070, baseType: !1006, size: 32, align: 32, offset: 2048)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "probe_packets", scope: !1009, file: !888, line: 1075, baseType: !1006, size: 32, align: 32, offset: 2080)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "codec_info_nb_frames", scope: !1009, file: !888, line: 1080, baseType: !1006, size: 32, align: 32, offset: 2112)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "need_parsing", scope: !1009, file: !888, line: 1083, baseType: !887, size: 32, align: 32, offset: 2144)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !1009, file: !888, line: 1084, baseType: !1689, size: 64, align: 64, offset: 2176)
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !4, line: 5092, size: 2816, align: 64, elements: !1691)
