; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--wavdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--wavdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !{!939, !940, !941, !948, !950, !957, !958, !959}
!939 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!940 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !943, line: 221, size: 32, align: 8, elements: !944)
!943 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!944 = !{!945}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !942, file: !943, line: 221, baseType: !946, size: 32, align: 32)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !947, line: 51, baseType: !940)
!947 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !947, line: 55, baseType: !949)
!949 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !943, line: 222, size: 16, align: 8, elements: !953)
!953 = !{!954}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !952, file: !943, line: 222, baseType: !955, size: 16, align: 16)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !947, line: 49, baseType: !956)
!956 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !947, line: 38, baseType: !939)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !947, line: 40, baseType: !960)
!960 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!961 = !{!962, !2201, !2202, !2203, !2208}
!962 = distinct !DIGlobalVariable(name: "ff_wav_demuxer", scope: !0, file: !963, line: 762, type: !964, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_wav_demuxer)
!963 = !DIFile(filename: "libavformat/wavdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !966)
!966 = !{!967, !971, !972, !973, !974, !984, !1063, !1064, !1066, !1067, !1068, !1082, !2182, !2183, !2184, !2188, !2192, !2193, !2194, !2198, !2199, !2200}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !965, file: !919, line: 638, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!970 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !965, file: !919, line: 645, baseType: !968, size: 64, align: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !965, file: !919, line: 652, baseType: !939, size: 32, align: 32, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !965, file: !919, line: 659, baseType: !968, size: 64, align: 64, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !965, file: !919, line: 661, baseType: !975, size: 64, align: 64, offset: 256)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !980, line: 44, size: 64, align: 32, elements: !981)
!980 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !979, file: !980, line: 45, baseType: !3, size: 32, align: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !979, file: !980, line: 46, baseType: !940, size: 32, align: 32, offset: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !965, file: !919, line: 663, baseType: !985, size: 64, align: 64, offset: 320)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !989)
!989 = !{!990, !991, !995, !1022, !1023, !1024, !1025, !1029, !1035, !1037, !1041}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !988, file: !486, line: 72, baseType: !968, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !988, file: !486, line: 78, baseType: !992, size: 64, align: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!968, !957}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !988, file: !486, line: 85, baseType: !996, size: 64, align: 64, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !999)
!999 = !{!1000, !1001, !1002, !1003, !1004, !1018, !1019, !1020, !1021}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !998, file: !464, line: 247, baseType: !968, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !998, file: !464, line: 253, baseType: !968, size: 64, align: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !998, file: !464, line: 259, baseType: !939, size: 32, align: 32, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !998, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !998, file: !464, line: 271, baseType: !1005, size: 64, align: 64, offset: 192)
!1005 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !998, file: !464, line: 265, size: 64, align: 64, elements: !1006)
!1006 = !{!1007, !1008, !1010, !1011}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1005, file: !464, line: 266, baseType: !959, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1005, file: !464, line: 267, baseType: !1009, size: 64, align: 64)
!1009 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1005, file: !464, line: 268, baseType: !968, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1005, file: !464, line: 270, baseType: !1012, size: 64, align: 32)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1013, line: 61, baseType: !1014)
!1013 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1013, line: 58, size: 64, align: 32, elements: !1015)
!1015 = !{!1016, !1017}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1014, file: !1013, line: 59, baseType: !939, size: 32, align: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1014, file: !1013, line: 60, baseType: !939, size: 32, align: 32, offset: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !998, file: !464, line: 272, baseType: !1009, size: 64, align: 64, offset: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !998, file: !464, line: 273, baseType: !1009, size: 64, align: 64, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !998, file: !464, line: 275, baseType: !939, size: 32, align: 32, offset: 384)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !998, file: !464, line: 300, baseType: !968, size: 64, align: 64, offset: 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !988, file: !486, line: 93, baseType: !939, size: 32, align: 32, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !988, file: !486, line: 99, baseType: !939, size: 32, align: 32, offset: 224)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !988, file: !486, line: 108, baseType: !939, size: 32, align: 32, offset: 256)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !988, file: !486, line: 113, baseType: !1026, size: 64, align: 64, offset: 320)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!957, !957, !957}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !988, file: !486, line: 123, baseType: !1030, size: 64, align: 64, offset: 384)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!1033, !1033}
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !988, file: !486, line: 130, baseType: !1036, size: 32, align: 32, offset: 448)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !988, file: !486, line: 136, baseType: !1038, size: 64, align: 64, offset: 512)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!1036, !957}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !988, file: !486, line: 142, baseType: !1042, size: 64, align: 64, offset: 576)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!939, !1045, !957, !968, !939}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1048)
!1048 = !{!1049, !1061, !1062}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1047, file: !464, line: 360, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059, !1060}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1053, file: !464, line: 307, baseType: !968, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1053, file: !464, line: 313, baseType: !1009, size: 64, align: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1053, file: !464, line: 313, baseType: !1009, size: 64, align: 64, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1053, file: !464, line: 318, baseType: !1009, size: 64, align: 64, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1053, file: !464, line: 318, baseType: !1009, size: 64, align: 64, offset: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1053, file: !464, line: 323, baseType: !939, size: 32, align: 32, offset: 320)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1047, file: !464, line: 364, baseType: !939, size: 32, align: 32, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1047, file: !464, line: 368, baseType: !939, size: 32, align: 32, offset: 96)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !965, file: !919, line: 670, baseType: !968, size: 64, align: 64, offset: 384)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !965, file: !919, line: 679, baseType: !1065, size: 64, align: 64, offset: 448)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !965, file: !919, line: 684, baseType: !939, size: 32, align: 32, offset: 512)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !965, file: !919, line: 689, baseType: !939, size: 32, align: 32, offset: 544)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !965, file: !919, line: 696, baseType: !1069, size: 64, align: 64, offset: 576)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!939, !1072}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1075)
!1075 = !{!1076, !1077, !1080, !1081}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1074, file: !919, line: 449, baseType: !968, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1074, file: !919, line: 450, baseType: !1078, size: 64, align: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1074, file: !919, line: 451, baseType: !939, size: 32, align: 32, offset: 128)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1074, file: !919, line: 452, baseType: !968, size: 64, align: 64, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !965, file: !919, line: 703, baseType: !1083, size: 64, align: 64, offset: 640)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!939, !1086}
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1281, !1282, !1347, !1348, !1349, !2039, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2093, !2094, !2095, !2096, !2097, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2148, !2149, !2152, !2153, !2154, !2155, !2156, !2157, !2159, !2160, !2161, !2162, !2170, !2171, !2175, !2179, !2180, !2181}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1087, file: !919, line: 1342, baseType: !985, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1087, file: !919, line: 1349, baseType: !1065, size: 64, align: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1087, file: !919, line: 1356, baseType: !1092, size: 64, align: 64, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1094)
!1094 = !{!1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1148, !1149, !1153, !1157, !1162, !1168, !1256, !1262, !1268, !1269, !1270, !1271, !1275}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1093, file: !919, line: 498, baseType: !968, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1093, file: !919, line: 504, baseType: !968, size: 64, align: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1093, file: !919, line: 505, baseType: !968, size: 64, align: 64, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1093, file: !919, line: 506, baseType: !968, size: 64, align: 64, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1093, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1093, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1093, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1093, file: !919, line: 517, baseType: !939, size: 32, align: 32, offset: 352)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1093, file: !919, line: 523, baseType: !975, size: 64, align: 64, offset: 384)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1093, file: !919, line: 526, baseType: !985, size: 64, align: 64, offset: 448)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1093, file: !919, line: 535, baseType: !1092, size: 64, align: 64, offset: 512)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1093, file: !919, line: 539, baseType: !939, size: 32, align: 32, offset: 576)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1093, file: !919, line: 541, baseType: !1083, size: 64, align: 64, offset: 640)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1093, file: !919, line: 549, baseType: !1109, size: 64, align: 64, offset: 704)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!939, !1086, !1112}
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1115)
!1115 = !{!1116, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1144, !1145, !1146, !1147}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1114, file: !4, line: 1451, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1119, line: 94, baseType: !1120)
!1119 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1119, line: 81, size: 192, align: 64, elements: !1121)
!1121 = !{!1122, !1126, !1129}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1120, file: !1119, line: 82, baseType: !1123, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1119, line: 73, baseType: !1125)
!1125 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1119, line: 73, flags: DIFlagFwdDecl)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1120, file: !1119, line: 89, baseType: !1127, size: 64, align: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !947, line: 48, baseType: !1079)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1120, file: !1119, line: 93, baseType: !939, size: 32, align: 32, offset: 128)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1114, file: !4, line: 1461, baseType: !959, size: 64, align: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1114, file: !4, line: 1467, baseType: !959, size: 64, align: 64, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1114, file: !4, line: 1468, baseType: !1127, size: 64, align: 64, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1114, file: !4, line: 1469, baseType: !939, size: 32, align: 32, offset: 256)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1114, file: !4, line: 1470, baseType: !939, size: 32, align: 32, offset: 288)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1114, file: !4, line: 1474, baseType: !939, size: 32, align: 32, offset: 320)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1114, file: !4, line: 1479, baseType: !1137, size: 64, align: 64, offset: 384)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1139)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1140)
!1140 = !{!1141, !1142, !1143}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1139, file: !4, line: 1412, baseType: !1127, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1139, file: !4, line: 1413, baseType: !939, size: 32, align: 32, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1139, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1114, file: !4, line: 1480, baseType: !939, size: 32, align: 32, offset: 448)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1114, file: !4, line: 1486, baseType: !959, size: 64, align: 64, offset: 512)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1114, file: !4, line: 1488, baseType: !959, size: 64, align: 64, offset: 576)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1114, file: !4, line: 1497, baseType: !959, size: 64, align: 64, offset: 640)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1093, file: !919, line: 550, baseType: !1083, size: 64, align: 64, offset: 768)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1093, file: !919, line: 554, baseType: !1150, size: 64, align: 64, offset: 832)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!939, !1086, !1112, !1112, !939}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1093, file: !919, line: 563, baseType: !1154, size: 64, align: 64, offset: 896)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!939, !3, !939}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1093, file: !919, line: 565, baseType: !1158, size: 64, align: 64, offset: 960)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{null, !1086, !939, !1161, !1161}
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1093, file: !919, line: 570, baseType: !1163, size: 64, align: 64, offset: 1024)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!939, !1086, !939, !957, !1166}
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1167, line: 216, baseType: !949)
!1167 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1093, file: !919, line: 581, baseType: !1169, size: 64, align: 64, offset: 1088)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!939, !1086, !939, !1172, !940}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1176)
!1176 = !{!1177, !1181, !1183, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1210, !1212, !1213, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1175, file: !548, line: 282, baseType: !1178, size: 512, align: 64)
!1178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1127, size: 512, align: 64, elements: !1179)
!1179 = !{!1180}
!1180 = !DISubrange(count: 8)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1175, file: !548, line: 299, baseType: !1182, size: 256, align: 32, offset: 512)
!1182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 256, align: 32, elements: !1179)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1175, file: !548, line: 315, baseType: !1184, size: 64, align: 64, offset: 768)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1175, file: !548, line: 326, baseType: !939, size: 32, align: 32, offset: 832)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1175, file: !548, line: 326, baseType: !939, size: 32, align: 32, offset: 864)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1175, file: !548, line: 334, baseType: !939, size: 32, align: 32, offset: 896)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1175, file: !548, line: 341, baseType: !939, size: 32, align: 32, offset: 928)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1175, file: !548, line: 346, baseType: !939, size: 32, align: 32, offset: 960)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1175, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1175, file: !548, line: 356, baseType: !1012, size: 64, align: 32, offset: 1024)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1175, file: !548, line: 361, baseType: !959, size: 64, align: 64, offset: 1088)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1175, file: !548, line: 369, baseType: !959, size: 64, align: 64, offset: 1152)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1175, file: !548, line: 377, baseType: !959, size: 64, align: 64, offset: 1216)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1175, file: !548, line: 382, baseType: !939, size: 32, align: 32, offset: 1280)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1175, file: !548, line: 386, baseType: !939, size: 32, align: 32, offset: 1312)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1175, file: !548, line: 391, baseType: !939, size: 32, align: 32, offset: 1344)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1175, file: !548, line: 396, baseType: !957, size: 64, align: 64, offset: 1408)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1175, file: !548, line: 403, baseType: !1200, size: 512, align: 64, offset: 1472)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 512, align: 64, elements: !1179)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1175, file: !548, line: 410, baseType: !939, size: 32, align: 32, offset: 1984)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1175, file: !548, line: 415, baseType: !939, size: 32, align: 32, offset: 2016)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1175, file: !548, line: 420, baseType: !939, size: 32, align: 32, offset: 2048)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1175, file: !548, line: 425, baseType: !939, size: 32, align: 32, offset: 2080)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1175, file: !548, line: 435, baseType: !959, size: 64, align: 64, offset: 2112)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1175, file: !548, line: 440, baseType: !939, size: 32, align: 32, offset: 2176)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1175, file: !548, line: 445, baseType: !948, size: 64, align: 64, offset: 2240)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1175, file: !548, line: 459, baseType: !1209, size: 512, align: 64, offset: 2304)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1117, size: 512, align: 64, elements: !1179)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1175, file: !548, line: 473, baseType: !1211, size: 64, align: 64, offset: 2816)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1175, file: !548, line: 477, baseType: !939, size: 32, align: 32, offset: 2880)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1175, file: !548, line: 479, baseType: !1214, size: 64, align: 64, offset: 2944)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1218)
!1218 = !{!1219, !1220, !1221, !1222, !1227}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1217, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1217, file: !548, line: 203, baseType: !1127, size: 64, align: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1217, file: !548, line: 204, baseType: !939, size: 32, align: 32, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1217, file: !548, line: 205, baseType: !1223, size: 64, align: 64, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1225, line: 86, baseType: !1226)
!1225 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1226 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1225, line: 86, flags: DIFlagFwdDecl)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1217, file: !548, line: 206, baseType: !1117, size: 64, align: 64, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1175, file: !548, line: 480, baseType: !939, size: 32, align: 32, offset: 3008)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1175, file: !548, line: 505, baseType: !939, size: 32, align: 32, offset: 3040)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1175, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1175, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1175, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1175, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1175, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1175, file: !548, line: 532, baseType: !959, size: 64, align: 64, offset: 3264)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1175, file: !548, line: 539, baseType: !959, size: 64, align: 64, offset: 3328)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1175, file: !548, line: 547, baseType: !959, size: 64, align: 64, offset: 3392)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1175, file: !548, line: 554, baseType: !1223, size: 64, align: 64, offset: 3456)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1175, file: !548, line: 563, baseType: !939, size: 32, align: 32, offset: 3520)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1175, file: !548, line: 572, baseType: !939, size: 32, align: 32, offset: 3552)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1175, file: !548, line: 581, baseType: !939, size: 32, align: 32, offset: 3584)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1175, file: !548, line: 588, baseType: !1243, size: 64, align: 64, offset: 3648)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !947, line: 36, baseType: !1245)
!1245 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1175, file: !548, line: 593, baseType: !939, size: 32, align: 32, offset: 3712)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1175, file: !548, line: 596, baseType: !939, size: 32, align: 32, offset: 3744)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1175, file: !548, line: 599, baseType: !1117, size: 64, align: 64, offset: 3776)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1175, file: !548, line: 605, baseType: !1117, size: 64, align: 64, offset: 3840)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1175, file: !548, line: 616, baseType: !1117, size: 64, align: 64, offset: 3904)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1175, file: !548, line: 626, baseType: !1166, size: 64, align: 64, offset: 3968)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1175, file: !548, line: 627, baseType: !1166, size: 64, align: 64, offset: 4032)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1175, file: !548, line: 628, baseType: !1166, size: 64, align: 64, offset: 4096)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1175, file: !548, line: 629, baseType: !1166, size: 64, align: 64, offset: 4160)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1175, file: !548, line: 645, baseType: !1117, size: 64, align: 64, offset: 4224)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1093, file: !919, line: 587, baseType: !1257, size: 64, align: 64, offset: 1152)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!939, !1086, !1260}
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1093, file: !919, line: 592, baseType: !1263, size: 64, align: 64, offset: 1216)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!939, !1086, !1266}
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1093, file: !919, line: 597, baseType: !1263, size: 64, align: 64, offset: 1280)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1093, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1093, file: !919, line: 608, baseType: !1083, size: 64, align: 64, offset: 1408)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1093, file: !919, line: 617, baseType: !1272, size: 64, align: 64, offset: 1472)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{null, !1086}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1093, file: !919, line: 623, baseType: !1276, size: 64, align: 64, offset: 1536)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!939, !1086, !1279}
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1113)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1087, file: !919, line: 1365, baseType: !957, size: 64, align: 64, offset: 192)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1087, file: !919, line: 1379, baseType: !1283, size: 64, align: 64, offset: 256)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1285)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1286)
!1286 = !{!1287, !1288, !1289, !1290, !1291, !1292, !1293, !1297, !1298, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1314, !1315, !1319, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1337, !1338, !1339, !1340, !1344, !1345, !1346}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1285, file: !650, line: 174, baseType: !985, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1285, file: !650, line: 226, baseType: !1078, size: 64, align: 64, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1285, file: !650, line: 227, baseType: !939, size: 32, align: 32, offset: 128)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1285, file: !650, line: 228, baseType: !1078, size: 64, align: 64, offset: 192)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1285, file: !650, line: 229, baseType: !1078, size: 64, align: 64, offset: 256)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1285, file: !650, line: 233, baseType: !957, size: 64, align: 64, offset: 320)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1285, file: !650, line: 235, baseType: !1294, size: 64, align: 64, offset: 384)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!939, !957, !1127, !939}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1285, file: !650, line: 236, baseType: !1294, size: 64, align: 64, offset: 448)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1285, file: !650, line: 237, baseType: !1299, size: 64, align: 64, offset: 512)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DISubroutineType(types: !1301)
!1301 = !{!959, !957, !959, !939}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1285, file: !650, line: 238, baseType: !959, size: 64, align: 64, offset: 576)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1285, file: !650, line: 239, baseType: !939, size: 32, align: 32, offset: 640)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1285, file: !650, line: 240, baseType: !939, size: 32, align: 32, offset: 672)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1285, file: !650, line: 241, baseType: !939, size: 32, align: 32, offset: 704)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1285, file: !650, line: 242, baseType: !949, size: 64, align: 64, offset: 768)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1285, file: !650, line: 243, baseType: !1078, size: 64, align: 64, offset: 832)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1285, file: !650, line: 244, baseType: !1309, size: 64, align: 64, offset: 896)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!949, !949, !1312, !940}
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1128)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1285, file: !650, line: 245, baseType: !939, size: 32, align: 32, offset: 960)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1285, file: !650, line: 249, baseType: !1316, size: 64, align: 64, offset: 1024)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{!939, !957, !939}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1285, file: !650, line: 255, baseType: !1320, size: 64, align: 64, offset: 1088)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!959, !957, !939, !959, !939}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1285, file: !650, line: 260, baseType: !939, size: 32, align: 32, offset: 1152)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1285, file: !650, line: 266, baseType: !959, size: 64, align: 64, offset: 1216)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1285, file: !650, line: 273, baseType: !939, size: 32, align: 32, offset: 1280)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1285, file: !650, line: 279, baseType: !959, size: 64, align: 64, offset: 1344)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1285, file: !650, line: 285, baseType: !939, size: 32, align: 32, offset: 1408)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1285, file: !650, line: 291, baseType: !939, size: 32, align: 32, offset: 1440)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1285, file: !650, line: 298, baseType: !939, size: 32, align: 32, offset: 1472)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1285, file: !650, line: 304, baseType: !939, size: 32, align: 32, offset: 1504)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1285, file: !650, line: 309, baseType: !968, size: 64, align: 64, offset: 1536)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1285, file: !650, line: 314, baseType: !968, size: 64, align: 64, offset: 1600)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1285, file: !650, line: 319, baseType: !1334, size: 64, align: 64, offset: 1664)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DISubroutineType(types: !1336)
!1336 = !{!939, !957, !1127, !939, !649, !959}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1285, file: !650, line: 326, baseType: !939, size: 32, align: 32, offset: 1728)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1285, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1285, file: !650, line: 332, baseType: !959, size: 64, align: 64, offset: 1792)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1285, file: !650, line: 338, baseType: !1341, size: 64, align: 64, offset: 1856)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DISubroutineType(types: !1343)
!1343 = !{!939, !957}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1285, file: !650, line: 340, baseType: !959, size: 64, align: 64, offset: 1920)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1285, file: !650, line: 346, baseType: !1078, size: 64, align: 64, offset: 1984)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1285, file: !650, line: 351, baseType: !939, size: 32, align: 32, offset: 2048)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1087, file: !919, line: 1386, baseType: !939, size: 32, align: 32, offset: 320)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1087, file: !919, line: 1393, baseType: !940, size: 32, align: 32, offset: 352)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1087, file: !919, line: 1405, baseType: !1350, size: 64, align: 64, offset: 384)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1353)
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1354)
!1354 = !{!1355, !1356, !1357, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1825, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1925, !1931, !1932, !1936, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1968, !1969, !1970, !1971, !1972, !1973}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1353, file: !919, line: 866, baseType: !939, size: 32, align: 32)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1353, file: !919, line: 872, baseType: !939, size: 32, align: 32, offset: 32)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1353, file: !919, line: 878, baseType: !1358, size: 64, align: 64, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1360)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1361)
!1361 = !{!1362, !1363, !1364, !1365, !1500, !1501, !1502, !1503, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1529, !1533, !1534, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1713, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1360, file: !4, line: 1561, baseType: !985, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1360, file: !4, line: 1562, baseType: !939, size: 32, align: 32, offset: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1360, file: !4, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1360, file: !4, line: 1565, baseType: !1366, size: 64, align: 64, offset: 128)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1368)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1369)
!1369 = !{!1370, !1371, !1372, !1373, !1374, !1375, !1378, !1381, !1384, !1387, !1390, !1391, !1392, !1400, !1401, !1402, !1404, !1408, !1414, !1419, !1423, !1424, !1465, !1472, !1476, !1477, !1481, !1485, !1489, !1493, !1494, !1495}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1368, file: !4, line: 3475, baseType: !968, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1368, file: !4, line: 3480, baseType: !968, size: 64, align: 64, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1368, file: !4, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1368, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1368, file: !4, line: 3487, baseType: !939, size: 32, align: 32, offset: 192)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1368, file: !4, line: 3488, baseType: !1376, size: 64, align: 64, offset: 256)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1368, file: !4, line: 3489, baseType: !1379, size: 64, align: 64, offset: 320)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1368, file: !4, line: 3490, baseType: !1382, size: 64, align: 64, offset: 384)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1368, file: !4, line: 3491, baseType: !1385, size: 64, align: 64, offset: 448)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1368, file: !4, line: 3492, baseType: !1388, size: 64, align: 64, offset: 512)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1368, file: !4, line: 3493, baseType: !1128, size: 8, align: 8, offset: 576)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1368, file: !4, line: 3494, baseType: !985, size: 64, align: 64, offset: 640)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1368, file: !4, line: 3495, baseType: !1393, size: 64, align: 64, offset: 704)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1395)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1396)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1397)
!1397 = !{!1398, !1399}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1396, file: !4, line: 3402, baseType: !939, size: 32, align: 32)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1396, file: !4, line: 3403, baseType: !968, size: 64, align: 64, offset: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1368, file: !4, line: 3507, baseType: !968, size: 64, align: 64, offset: 768)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1368, file: !4, line: 3516, baseType: !939, size: 32, align: 32, offset: 832)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1368, file: !4, line: 3517, baseType: !1403, size: 64, align: 64, offset: 896)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1368, file: !4, line: 3527, baseType: !1405, size: 64, align: 64, offset: 960)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{!939, !1358}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1368, file: !4, line: 3535, baseType: !1409, size: 64, align: 64, offset: 1024)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{!939, !1358, !1412}
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1359)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1368, file: !4, line: 3541, baseType: !1415, size: 64, align: 64, offset: 1088)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1417)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1418)
!1418 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1368, file: !4, line: 3549, baseType: !1420, size: 64, align: 64, offset: 1152)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DISubroutineType(types: !1422)
!1422 = !{null, !1403}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1368, file: !4, line: 3551, baseType: !1405, size: 64, align: 64, offset: 1216)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1368, file: !4, line: 3552, baseType: !1425, size: 64, align: 64, offset: 1280)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DISubroutineType(types: !1427)
!1427 = !{!939, !1358, !1127, !939, !1428}
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1430)
!1430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1431)
!1431 = !{!1432, !1433, !1434, !1435, !1436, !1464}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1430, file: !4, line: 3921, baseType: !955, size: 16, align: 16)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1430, file: !4, line: 3922, baseType: !946, size: 32, align: 32, offset: 32)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1430, file: !4, line: 3923, baseType: !946, size: 32, align: 32, offset: 64)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1430, file: !4, line: 3924, baseType: !940, size: 32, align: 32, offset: 96)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1430, file: !4, line: 3925, baseType: !1437, size: 64, align: 64, offset: 128)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1440)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1441)
!1441 = !{!1442, !1443, !1444, !1445, !1446, !1447, !1453, !1457, !1459, !1460, !1462, !1463}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1440, file: !4, line: 3886, baseType: !939, size: 32, align: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1440, file: !4, line: 3887, baseType: !939, size: 32, align: 32, offset: 32)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1440, file: !4, line: 3888, baseType: !939, size: 32, align: 32, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1440, file: !4, line: 3889, baseType: !939, size: 32, align: 32, offset: 96)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1440, file: !4, line: 3890, baseType: !939, size: 32, align: 32, offset: 128)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1440, file: !4, line: 3897, baseType: !1448, size: 768, align: 64, offset: 192)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1449)
!1449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1450)
!1450 = !{!1451, !1452}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1449, file: !4, line: 3855, baseType: !1178, size: 512, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1449, file: !4, line: 3857, baseType: !1182, size: 256, align: 32, offset: 512)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1440, file: !4, line: 3903, baseType: !1454, size: 256, align: 64, offset: 960)
!1454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1127, size: 256, align: 64, elements: !1455)
!1455 = !{!1456}
!1456 = !DISubrange(count: 4)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1440, file: !4, line: 3904, baseType: !1458, size: 128, align: 32, offset: 1216)
!1458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 128, align: 32, elements: !1455)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1440, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1440, file: !4, line: 3908, baseType: !1461, size: 64, align: 64, offset: 1408)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1440, file: !4, line: 3915, baseType: !1461, size: 64, align: 64, offset: 1472)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1440, file: !4, line: 3917, baseType: !939, size: 32, align: 32, offset: 1536)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1430, file: !4, line: 3926, baseType: !959, size: 64, align: 64, offset: 192)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1368, file: !4, line: 3564, baseType: !1466, size: 64, align: 64, offset: 1344)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{!939, !1358, !1112, !1469, !1471}
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1174)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1368, file: !4, line: 3566, baseType: !1473, size: 64, align: 64, offset: 1408)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DISubroutineType(types: !1475)
!1475 = !{!939, !1358, !957, !1471, !1112}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1368, file: !4, line: 3567, baseType: !1405, size: 64, align: 64, offset: 1472)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1368, file: !4, line: 3576, baseType: !1478, size: 64, align: 64, offset: 1536)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{!939, !1358, !1469}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1368, file: !4, line: 3577, baseType: !1482, size: 64, align: 64, offset: 1600)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DISubroutineType(types: !1484)
!1484 = !{!939, !1358, !1112}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1368, file: !4, line: 3584, baseType: !1486, size: 64, align: 64, offset: 1664)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DISubroutineType(types: !1488)
!1488 = !{!939, !1358, !1173}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1368, file: !4, line: 3589, baseType: !1490, size: 64, align: 64, offset: 1728)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{null, !1358}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1368, file: !4, line: 3594, baseType: !939, size: 32, align: 32, offset: 1792)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1368, file: !4, line: 3600, baseType: !968, size: 64, align: 64, offset: 1856)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1368, file: !4, line: 3609, baseType: !1496, size: 64, align: 64, offset: 1920)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1499)
!1499 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1360, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1360, file: !4, line: 1581, baseType: !940, size: 32, align: 32, offset: 224)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1360, file: !4, line: 1583, baseType: !957, size: 64, align: 64, offset: 256)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1360, file: !4, line: 1591, baseType: !1504, size: 64, align: 64, offset: 320)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1360, file: !4, line: 1598, baseType: !957, size: 64, align: 64, offset: 384)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1360, file: !4, line: 1606, baseType: !959, size: 64, align: 64, offset: 448)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1360, file: !4, line: 1614, baseType: !939, size: 32, align: 32, offset: 512)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1360, file: !4, line: 1622, baseType: !939, size: 32, align: 32, offset: 544)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1360, file: !4, line: 1628, baseType: !939, size: 32, align: 32, offset: 576)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1360, file: !4, line: 1636, baseType: !939, size: 32, align: 32, offset: 608)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1360, file: !4, line: 1643, baseType: !939, size: 32, align: 32, offset: 640)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1360, file: !4, line: 1657, baseType: !1127, size: 64, align: 64, offset: 704)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1360, file: !4, line: 1658, baseType: !939, size: 32, align: 32, offset: 768)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1360, file: !4, line: 1679, baseType: !1012, size: 64, align: 32, offset: 800)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1360, file: !4, line: 1688, baseType: !939, size: 32, align: 32, offset: 864)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1360, file: !4, line: 1712, baseType: !939, size: 32, align: 32, offset: 896)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1360, file: !4, line: 1729, baseType: !939, size: 32, align: 32, offset: 928)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1360, file: !4, line: 1729, baseType: !939, size: 32, align: 32, offset: 960)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1360, file: !4, line: 1744, baseType: !939, size: 32, align: 32, offset: 992)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1360, file: !4, line: 1744, baseType: !939, size: 32, align: 32, offset: 1024)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1360, file: !4, line: 1751, baseType: !939, size: 32, align: 32, offset: 1056)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1360, file: !4, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1360, file: !4, line: 1791, baseType: !1525, size: 64, align: 64, offset: 1152)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DISubroutineType(types: !1527)
!1527 = !{null, !1528, !1469, !1471, !939, !939, !939}
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1360, file: !4, line: 1808, baseType: !1530, size: 64, align: 64, offset: 1216)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DISubroutineType(types: !1532)
!1532 = !{!667, !1528, !1379}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1360, file: !4, line: 1816, baseType: !939, size: 32, align: 32, offset: 1280)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1360, file: !4, line: 1825, baseType: !1535, size: 32, align: 32, offset: 1312)
!1535 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1360, file: !4, line: 1830, baseType: !939, size: 32, align: 32, offset: 1344)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1360, file: !4, line: 1838, baseType: !1535, size: 32, align: 32, offset: 1376)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1360, file: !4, line: 1846, baseType: !939, size: 32, align: 32, offset: 1408)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1360, file: !4, line: 1851, baseType: !939, size: 32, align: 32, offset: 1440)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1360, file: !4, line: 1861, baseType: !1535, size: 32, align: 32, offset: 1472)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1360, file: !4, line: 1868, baseType: !1535, size: 32, align: 32, offset: 1504)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1360, file: !4, line: 1875, baseType: !1535, size: 32, align: 32, offset: 1536)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1360, file: !4, line: 1882, baseType: !1535, size: 32, align: 32, offset: 1568)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1360, file: !4, line: 1889, baseType: !1535, size: 32, align: 32, offset: 1600)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1360, file: !4, line: 1896, baseType: !1535, size: 32, align: 32, offset: 1632)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1360, file: !4, line: 1903, baseType: !1535, size: 32, align: 32, offset: 1664)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1360, file: !4, line: 1910, baseType: !939, size: 32, align: 32, offset: 1696)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1360, file: !4, line: 1915, baseType: !939, size: 32, align: 32, offset: 1728)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1360, file: !4, line: 1926, baseType: !1471, size: 64, align: 64, offset: 1792)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1360, file: !4, line: 1935, baseType: !1012, size: 64, align: 32, offset: 1856)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1360, file: !4, line: 1942, baseType: !939, size: 32, align: 32, offset: 1920)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1360, file: !4, line: 1948, baseType: !939, size: 32, align: 32, offset: 1952)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1360, file: !4, line: 1954, baseType: !939, size: 32, align: 32, offset: 1984)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1360, file: !4, line: 1960, baseType: !939, size: 32, align: 32, offset: 2016)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1360, file: !4, line: 1984, baseType: !939, size: 32, align: 32, offset: 2048)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1360, file: !4, line: 1991, baseType: !939, size: 32, align: 32, offset: 2080)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1360, file: !4, line: 1996, baseType: !939, size: 32, align: 32, offset: 2112)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1360, file: !4, line: 2004, baseType: !939, size: 32, align: 32, offset: 2144)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1360, file: !4, line: 2011, baseType: !939, size: 32, align: 32, offset: 2176)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1360, file: !4, line: 2018, baseType: !939, size: 32, align: 32, offset: 2208)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1360, file: !4, line: 2027, baseType: !939, size: 32, align: 32, offset: 2240)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1360, file: !4, line: 2034, baseType: !939, size: 32, align: 32, offset: 2272)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1360, file: !4, line: 2044, baseType: !939, size: 32, align: 32, offset: 2304)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1360, file: !4, line: 2054, baseType: !1565, size: 64, align: 64, offset: 2368)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1360, file: !4, line: 2061, baseType: !1565, size: 64, align: 64, offset: 2432)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1360, file: !4, line: 2066, baseType: !939, size: 32, align: 32, offset: 2496)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1360, file: !4, line: 2070, baseType: !939, size: 32, align: 32, offset: 2528)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1360, file: !4, line: 2078, baseType: !939, size: 32, align: 32, offset: 2560)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1360, file: !4, line: 2085, baseType: !939, size: 32, align: 32, offset: 2592)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1360, file: !4, line: 2092, baseType: !939, size: 32, align: 32, offset: 2624)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1360, file: !4, line: 2099, baseType: !939, size: 32, align: 32, offset: 2656)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1360, file: !4, line: 2106, baseType: !939, size: 32, align: 32, offset: 2688)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1360, file: !4, line: 2113, baseType: !939, size: 32, align: 32, offset: 2720)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1360, file: !4, line: 2120, baseType: !939, size: 32, align: 32, offset: 2752)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1360, file: !4, line: 2125, baseType: !939, size: 32, align: 32, offset: 2784)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1360, file: !4, line: 2133, baseType: !939, size: 32, align: 32, offset: 2816)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1360, file: !4, line: 2140, baseType: !939, size: 32, align: 32, offset: 2848)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1360, file: !4, line: 2145, baseType: !939, size: 32, align: 32, offset: 2880)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1360, file: !4, line: 2153, baseType: !939, size: 32, align: 32, offset: 2912)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1360, file: !4, line: 2158, baseType: !939, size: 32, align: 32, offset: 2944)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1360, file: !4, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1360, file: !4, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1360, file: !4, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1360, file: !4, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1360, file: !4, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1360, file: !4, line: 2203, baseType: !939, size: 32, align: 32, offset: 3136)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1360, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1360, file: !4, line: 2212, baseType: !939, size: 32, align: 32, offset: 3200)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1360, file: !4, line: 2213, baseType: !939, size: 32, align: 32, offset: 3232)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1360, file: !4, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1360, file: !4, line: 2232, baseType: !939, size: 32, align: 32, offset: 3296)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1360, file: !4, line: 2243, baseType: !939, size: 32, align: 32, offset: 3328)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1360, file: !4, line: 2249, baseType: !939, size: 32, align: 32, offset: 3360)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1360, file: !4, line: 2256, baseType: !939, size: 32, align: 32, offset: 3392)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1360, file: !4, line: 2263, baseType: !948, size: 64, align: 64, offset: 3456)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1360, file: !4, line: 2270, baseType: !948, size: 64, align: 64, offset: 3520)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1360, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1360, file: !4, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1360, file: !4, line: 2367, baseType: !1601, size: 64, align: 64, offset: 3648)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DISubroutineType(types: !1603)
!1603 = !{!939, !1528, !1173, !939}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1360, file: !4, line: 2383, baseType: !939, size: 32, align: 32, offset: 3712)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1360, file: !4, line: 2386, baseType: !1535, size: 32, align: 32, offset: 3744)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1360, file: !4, line: 2387, baseType: !1535, size: 32, align: 32, offset: 3776)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1360, file: !4, line: 2394, baseType: !939, size: 32, align: 32, offset: 3808)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1360, file: !4, line: 2401, baseType: !939, size: 32, align: 32, offset: 3840)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1360, file: !4, line: 2408, baseType: !939, size: 32, align: 32, offset: 3872)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1360, file: !4, line: 2415, baseType: !939, size: 32, align: 32, offset: 3904)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1360, file: !4, line: 2422, baseType: !939, size: 32, align: 32, offset: 3936)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1360, file: !4, line: 2423, baseType: !1613, size: 64, align: 64, offset: 3968)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1615)
!1615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1616)
!1616 = !{!1617, !1618, !1619, !1620}
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1615, file: !4, line: 827, baseType: !939, size: 32, align: 32)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1615, file: !4, line: 828, baseType: !939, size: 32, align: 32, offset: 32)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1615, file: !4, line: 829, baseType: !939, size: 32, align: 32, offset: 64)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1615, file: !4, line: 830, baseType: !1535, size: 32, align: 32, offset: 96)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1360, file: !4, line: 2430, baseType: !959, size: 64, align: 64, offset: 4032)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1360, file: !4, line: 2437, baseType: !959, size: 64, align: 64, offset: 4096)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1360, file: !4, line: 2444, baseType: !1535, size: 32, align: 32, offset: 4160)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1360, file: !4, line: 2451, baseType: !1535, size: 32, align: 32, offset: 4192)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1360, file: !4, line: 2458, baseType: !939, size: 32, align: 32, offset: 4224)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1360, file: !4, line: 2469, baseType: !939, size: 32, align: 32, offset: 4256)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1360, file: !4, line: 2475, baseType: !939, size: 32, align: 32, offset: 4288)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1360, file: !4, line: 2481, baseType: !939, size: 32, align: 32, offset: 4320)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1360, file: !4, line: 2485, baseType: !939, size: 32, align: 32, offset: 4352)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1360, file: !4, line: 2489, baseType: !939, size: 32, align: 32, offset: 4384)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1360, file: !4, line: 2493, baseType: !939, size: 32, align: 32, offset: 4416)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1360, file: !4, line: 2501, baseType: !939, size: 32, align: 32, offset: 4448)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1360, file: !4, line: 2506, baseType: !939, size: 32, align: 32, offset: 4480)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1360, file: !4, line: 2510, baseType: !939, size: 32, align: 32, offset: 4512)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1360, file: !4, line: 2514, baseType: !959, size: 64, align: 64, offset: 4544)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1360, file: !4, line: 2528, baseType: !1637, size: 64, align: 64, offset: 4608)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DISubroutineType(types: !1639)
!1639 = !{null, !1528, !957, !939, !939}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1360, file: !4, line: 2534, baseType: !939, size: 32, align: 32, offset: 4672)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1360, file: !4, line: 2545, baseType: !939, size: 32, align: 32, offset: 4704)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1360, file: !4, line: 2547, baseType: !939, size: 32, align: 32, offset: 4736)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1360, file: !4, line: 2549, baseType: !939, size: 32, align: 32, offset: 4768)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1360, file: !4, line: 2551, baseType: !939, size: 32, align: 32, offset: 4800)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1360, file: !4, line: 2553, baseType: !939, size: 32, align: 32, offset: 4832)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1360, file: !4, line: 2555, baseType: !939, size: 32, align: 32, offset: 4864)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1360, file: !4, line: 2557, baseType: !939, size: 32, align: 32, offset: 4896)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1360, file: !4, line: 2559, baseType: !939, size: 32, align: 32, offset: 4928)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1360, file: !4, line: 2563, baseType: !939, size: 32, align: 32, offset: 4960)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1360, file: !4, line: 2571, baseType: !1461, size: 64, align: 64, offset: 4992)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1360, file: !4, line: 2579, baseType: !1461, size: 64, align: 64, offset: 5056)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1360, file: !4, line: 2586, baseType: !939, size: 32, align: 32, offset: 5120)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1360, file: !4, line: 2615, baseType: !939, size: 32, align: 32, offset: 5152)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1360, file: !4, line: 2627, baseType: !939, size: 32, align: 32, offset: 5184)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1360, file: !4, line: 2637, baseType: !939, size: 32, align: 32, offset: 5216)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1360, file: !4, line: 2681, baseType: !939, size: 32, align: 32, offset: 5248)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1360, file: !4, line: 2709, baseType: !959, size: 64, align: 64, offset: 5312)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1360, file: !4, line: 2716, baseType: !1659, size: 64, align: 64, offset: 5376)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1661)
!1661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1662)
!1662 = !{!1663, !1664, !1665, !1666, !1667, !1668, !1669, !1673, !1677, !1678, !1679, !1680, !1686, !1687, !1688, !1689, !1690}
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1661, file: !4, line: 3642, baseType: !968, size: 64, align: 64)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1661, file: !4, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1661, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1661, file: !4, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1661, file: !4, line: 3669, baseType: !939, size: 32, align: 32, offset: 160)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1661, file: !4, line: 3682, baseType: !1486, size: 64, align: 64, offset: 192)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1661, file: !4, line: 3698, baseType: !1670, size: 64, align: 64, offset: 256)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{!939, !1358, !1312, !946}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1661, file: !4, line: 3712, baseType: !1674, size: 64, align: 64, offset: 320)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DISubroutineType(types: !1676)
!1676 = !{!939, !1358, !939, !1312, !946}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1661, file: !4, line: 3726, baseType: !1670, size: 64, align: 64, offset: 384)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1661, file: !4, line: 3737, baseType: !1405, size: 64, align: 64, offset: 448)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1661, file: !4, line: 3746, baseType: !939, size: 32, align: 32, offset: 512)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1661, file: !4, line: 3757, baseType: !1681, size: 64, align: 64, offset: 576)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{null, !1684}
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1661, file: !4, line: 3766, baseType: !1405, size: 64, align: 64, offset: 640)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1661, file: !4, line: 3774, baseType: !1405, size: 64, align: 64, offset: 704)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1661, file: !4, line: 3780, baseType: !939, size: 32, align: 32, offset: 768)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1661, file: !4, line: 3785, baseType: !939, size: 32, align: 32, offset: 800)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1661, file: !4, line: 3795, baseType: !1691, size: 64, align: 64, offset: 832)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DISubroutineType(types: !1693)
!1693 = !{!939, !1358, !1117}
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1360, file: !4, line: 2728, baseType: !957, size: 64, align: 64, offset: 5440)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1360, file: !4, line: 2735, baseType: !1200, size: 512, align: 64, offset: 5504)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1360, file: !4, line: 2742, baseType: !939, size: 32, align: 32, offset: 6016)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1360, file: !4, line: 2755, baseType: !939, size: 32, align: 32, offset: 6048)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1360, file: !4, line: 2776, baseType: !939, size: 32, align: 32, offset: 6080)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1360, file: !4, line: 2783, baseType: !939, size: 32, align: 32, offset: 6112)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1360, file: !4, line: 2791, baseType: !939, size: 32, align: 32, offset: 6144)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1360, file: !4, line: 2802, baseType: !1173, size: 64, align: 64, offset: 6208)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1360, file: !4, line: 2811, baseType: !939, size: 32, align: 32, offset: 6272)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1360, file: !4, line: 2821, baseType: !939, size: 32, align: 32, offset: 6304)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1360, file: !4, line: 2830, baseType: !939, size: 32, align: 32, offset: 6336)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1360, file: !4, line: 2840, baseType: !939, size: 32, align: 32, offset: 6368)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1360, file: !4, line: 2851, baseType: !1707, size: 64, align: 64, offset: 6400)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64, align: 64)
!1708 = !DISubroutineType(types: !1709)
!1709 = !{!939, !1528, !1710, !957, !1471, !939, !939}
!1710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1711, size: 64, align: 64)
!1711 = !DISubroutineType(types: !1712)
!1712 = !{!939, !1528, !957}
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1360, file: !4, line: 2871, baseType: !1714, size: 64, align: 64, offset: 6464)
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1715, size: 64, align: 64)
!1715 = !DISubroutineType(types: !1716)
!1716 = !{!939, !1528, !1717, !957, !1471, !939}
!1717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1718, size: 64, align: 64)
!1718 = !DISubroutineType(types: !1719)
!1719 = !{!939, !1528, !957, !939, !939}
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1360, file: !4, line: 2878, baseType: !939, size: 32, align: 32, offset: 6528)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1360, file: !4, line: 2885, baseType: !939, size: 32, align: 32, offset: 6560)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1360, file: !4, line: 3005, baseType: !939, size: 32, align: 32, offset: 6592)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1360, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1360, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1360, file: !4, line: 3027, baseType: !909, size: 32, align: 32, offset: 6688)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1360, file: !4, line: 3037, baseType: !1127, size: 64, align: 64, offset: 6720)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1360, file: !4, line: 3038, baseType: !939, size: 32, align: 32, offset: 6784)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1360, file: !4, line: 3050, baseType: !948, size: 64, align: 64, offset: 6848)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1360, file: !4, line: 3065, baseType: !939, size: 32, align: 32, offset: 6912)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1360, file: !4, line: 3083, baseType: !939, size: 32, align: 32, offset: 6944)
