; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--mmst.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--mmst.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }
%struct.URLProtocol = type { i8*, {}*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }
%struct.AVIOInterruptCB = type { i32 (i8*)*, i8* }
%struct.AVDictionary = type opaque

!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVIODataMarkerType", file: !57, line: 111, size: 32, align: 32, elements: !58)
!57 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!58 = !{!59, !60, !61, !62, !63, !64}
!59 = !DIEnumerator(name: "AVIO_DATA_MARKER_HEADER", value: 0)
!60 = !DIEnumerator(name: "AVIO_DATA_MARKER_SYNC_POINT", value: 1)
!61 = !DIEnumerator(name: "AVIO_DATA_MARKER_BOUNDARY_POINT", value: 2)
!62 = !DIEnumerator(name: "AVIO_DATA_MARKER_UNKNOWN", value: 3)
!63 = !DIEnumerator(name: "AVIO_DATA_MARKER_TRAILER", value: 4)
!64 = !DIEnumerator(name: "AVIO_DATA_MARKER_FLUSH_POINT", value: 5)
!65 = !{!66, !67, !68, !69, !77, !84, !85, !91, !92, !95}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!67 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!68 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !72, line: 221, size: 32, align: 8, elements: !73)
!72 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !71, file: !72, line: 221, baseType: !75, size: 32, align: 32)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !76, line: 51, baseType: !68)
!76 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !72, line: 222, size: 16, align: 8, elements: !80)
!80 = !{!81}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !79, file: !72, line: 222, baseType: !82, size: 16, align: 16)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !76, line: 49, baseType: !83)
!83 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !72, line: 220, size: 64, align: 8, elements: !87)
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !86, file: !72, line: 220, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !76, line: 55, baseType: !90)
!90 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !76, line: 48, baseType: !94)
!94 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "MMSTContext", file: !25, line: 97, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MMSTContext", file: !25, line: 88, size: 532224, align: 64, elements: !98)
!98 = !{!99, !292, !293, !297, !301, !302, !303, !304}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "mms", scope: !97, file: !25, line: 89, baseType: !100, size: 528960, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "MMSContext", file: !101, line: 58, baseType: !102)
!101 = !DIFile(filename: "libavformat/mms.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MMSContext", file: !101, line: 30, size: 528960, align: 64, elements: !103)
!103 = !{!104, !268, !274, !275, !279, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "mms_hd", scope: !102, file: !101, line: 31, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !107, line: 52, baseType: !108)
!107 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !107, line: 38, size: 768, align: 64, elements: !109)
!109 = !{!110, !154, !249, !250, !251, !252, !253, !254, !255, !264, !265, !266, !267}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !108, file: !107, line: 39, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !115)
!115 = !{!116, !120, !124, !128, !129, !130, !131, !135, !141, !143, !147}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !114, file: !4, line: 72, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !114, file: !4, line: 78, baseType: !121, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!117, !66}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !114, file: !4, line: 85, baseType: !125, size: 64, align: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !114, file: !4, line: 93, baseType: !67, size: 32, align: 32, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !114, file: !4, line: 99, baseType: !67, size: 32, align: 32, offset: 224)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !114, file: !4, line: 108, baseType: !67, size: 32, align: 32, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !114, file: !4, line: 113, baseType: !132, size: 64, align: 64, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!66, !66, !66}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !114, file: !4, line: 123, baseType: !136, size: 64, align: 64, offset: 384)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!139, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !114, file: !4, line: 130, baseType: !142, size: 32, align: 32, offset: 448)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !114, file: !4, line: 136, baseType: !144, size: 64, align: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!142, !66}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !114, file: !4, line: 142, baseType: !148, size: 64, align: 64, offset: 576)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!67, !151, !66, !117, !67}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !108, file: !107, line: 40, baseType: !155, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !107, line: 54, size: 1600, align: 64, elements: !158)
!158 = !{!159, !160, !164, !173, !178, !182, !187, !193, !199, !200, !204, !208, !209, !215, !216, !217, !218, !219, !220, !221, !222, !242, !243, !244, !248}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !107, line: 55, baseType: !117, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !157, file: !107, line: 56, baseType: !161, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!67, !105, !117, !67}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !157, file: !107, line: 62, baseType: !165, size: 64, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!67, !105, !117, !67, !168}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !171, line: 86, baseType: !172)
!171 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !171, line: 86, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !157, file: !107, line: 63, baseType: !174, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!67, !105, !177}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !157, file: !107, line: 64, baseType: !179, size: 64, align: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!67, !105}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !157, file: !107, line: 78, baseType: !183, size: 64, align: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!67, !105, !186, !67}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !157, file: !107, line: 79, baseType: !188, size: 64, align: 64, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!67, !105, !191, !67}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !157, file: !107, line: 80, baseType: !194, size: 64, align: 64, offset: 448)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!197, !105, !197, !67}
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !76, line: 40, baseType: !198)
!198 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !157, file: !107, line: 81, baseType: !179, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !157, file: !107, line: 82, baseType: !201, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!67, !105, !67}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !157, file: !107, line: 83, baseType: !205, size: 64, align: 64, offset: 640)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!197, !105, !67, !197, !67}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !157, file: !107, line: 85, baseType: !179, size: 64, align: 64, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !157, file: !107, line: 86, baseType: !210, size: 64, align: 64, offset: 768)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!67, !105, !213, !214}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !157, file: !107, line: 88, baseType: !179, size: 64, align: 64, offset: 832)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !157, file: !107, line: 89, baseType: !201, size: 64, align: 64, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !157, file: !107, line: 90, baseType: !67, size: 32, align: 32, offset: 960)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !157, file: !107, line: 91, baseType: !111, size: 64, align: 64, offset: 1024)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !157, file: !107, line: 92, baseType: !67, size: 32, align: 32, offset: 1088)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !157, file: !107, line: 93, baseType: !201, size: 64, align: 64, offset: 1152)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !157, file: !107, line: 94, baseType: !179, size: 64, align: 64, offset: 1216)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !157, file: !107, line: 95, baseType: !223, size: 64, align: 64, offset: 1280)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!67, !105, !226}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !57, line: 101, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !57, line: 86, size: 576, align: 64, elements: !230)
!230 = !{!231, !233, !234, !235, !236, !237, !238, !239, !240, !241}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !229, file: !57, line: 87, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !229, file: !57, line: 88, baseType: !67, size: 32, align: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !229, file: !57, line: 89, baseType: !67, size: 32, align: 32, offset: 96)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !229, file: !57, line: 91, baseType: !197, size: 64, align: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !229, file: !57, line: 92, baseType: !197, size: 64, align: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !229, file: !57, line: 94, baseType: !197, size: 64, align: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !229, file: !57, line: 96, baseType: !197, size: 64, align: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !229, file: !57, line: 98, baseType: !197, size: 64, align: 64, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !229, file: !57, line: 99, baseType: !197, size: 64, align: 64, offset: 448)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !229, file: !57, line: 100, baseType: !197, size: 64, align: 64, offset: 512)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !157, file: !107, line: 96, baseType: !179, size: 64, align: 64, offset: 1344)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !157, file: !107, line: 97, baseType: !179, size: 64, align: 64, offset: 1408)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !157, file: !107, line: 98, baseType: !245, size: 64, align: 64, offset: 1472)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!67, !105, !105}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !157, file: !107, line: 99, baseType: !117, size: 64, align: 64, offset: 1536)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !108, file: !107, line: 41, baseType: !66, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !108, file: !107, line: 42, baseType: !232, size: 64, align: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !108, file: !107, line: 43, baseType: !67, size: 32, align: 32, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !108, file: !107, line: 44, baseType: !67, size: 32, align: 32, offset: 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !108, file: !107, line: 45, baseType: !67, size: 32, align: 32, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !108, file: !107, line: 46, baseType: !67, size: 32, align: 32, offset: 352)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !108, file: !107, line: 47, baseType: !256, size: 128, align: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !57, line: 61, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !57, line: 58, size: 128, align: 64, elements: !258)
!258 = !{!259, !263}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !257, file: !57, line: 59, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!67, !66}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !257, file: !57, line: 60, baseType: !66, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !108, file: !107, line: 48, baseType: !197, size: 64, align: 64, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !108, file: !107, line: 49, baseType: !117, size: 64, align: 64, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !108, file: !107, line: 50, baseType: !117, size: 64, align: 64, offset: 640)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !108, file: !107, line: 51, baseType: !67, size: 32, align: 32, offset: 704)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !102, file: !101, line: 32, baseType: !269, size: 64, align: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "MMSStream", file: !101, line: 28, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MMSStream", file: !101, line: 26, size: 32, align: 32, elements: !272)
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !271, file: !101, line: 27, baseType: !67, size: 32, align: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "write_out_ptr", scope: !102, file: !101, line: 36, baseType: !92, size: 64, align: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "out_buffer", scope: !102, file: !101, line: 37, baseType: !276, size: 4096, align: 8, offset: 192)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 4096, align: 8, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 512)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer", scope: !102, file: !101, line: 42, baseType: !280, size: 524288, align: 8, offset: 4288)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 524288, align: 8, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 65536)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "read_in_ptr", scope: !102, file: !101, line: 43, baseType: !92, size: 64, align: 64, offset: 528576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_in_len", scope: !102, file: !101, line: 44, baseType: !67, size: 32, align: 32, offset: 528640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "asf_header", scope: !102, file: !101, line: 49, baseType: !92, size: 64, align: 64, offset: 528704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "asf_header_size", scope: !102, file: !101, line: 50, baseType: !67, size: 32, align: 32, offset: 528768)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "header_parsed", scope: !102, file: !101, line: 51, baseType: !67, size: 32, align: 32, offset: 528800)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "asf_packet_len", scope: !102, file: !101, line: 52, baseType: !67, size: 32, align: 32, offset: 528832)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "asf_header_read_size", scope: !102, file: !101, line: 53, baseType: !67, size: 32, align: 32, offset: 528864)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "stream_num", scope: !102, file: !101, line: 56, baseType: !67, size: 32, align: 32, offset: 528896)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams_allocated", scope: !102, file: !101, line: 57, baseType: !68, size: 32, align: 32, offset: 528928)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "outgoing_packet_seq", scope: !97, file: !25, line: 90, baseType: !67, size: 32, align: 32, offset: 528960)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !97, file: !25, line: 91, baseType: !294, size: 2048, align: 8, offset: 528992)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 2048, align: 8, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !97, file: !25, line: 92, baseType: !298, size: 1024, align: 8, offset: 531040)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 1024, align: 8, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_packet_seq", scope: !97, file: !25, line: 93, baseType: !67, size: 32, align: 32, offset: 532064)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_flags", scope: !97, file: !25, line: 94, baseType: !67, size: 32, align: 32, offset: 532096)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !97, file: !25, line: 95, baseType: !67, size: 32, align: 32, offset: 532128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "header_packet_id", scope: !97, file: !25, line: 96, baseType: !68, size: 32, align: 32, offset: 532160)
!305 = !{!306}
!306 = distinct !DIGlobalVariable(name: "ff_mmst_protocol", scope: !0, file: !25, line: 632, type: !307, isLocal: false, isDefinition: true, variable: { i8*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }* @ff_mmst_protocol)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !107, line: 100, baseType: !157)
!309 = !{i32 2, !"Dwarf Version", i32 4}
!310 = !{i32 2, !"Debug Info Version", i32 3}
!311 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!312 = distinct !DISubprogram(name: "mms_open", scope: !25, file: !25, line: 511, type: !162, isLocal: true, isDefinition: true, scopeLine: 512, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!313 = !{}
!314 = !DILocalVariable(name: "h", arg: 1, scope: !312, file: !25, line: 511, type: !105)
!315 = !DIExpression()
!316 = !DILocation(line: 511, column: 33, scope: !312)
!317 = !DILocalVariable(name: "uri", arg: 2, scope: !312, file: !25, line: 511, type: !117)
!318 = !DILocation(line: 511, column: 48, scope: !312)
!319 = !DILocalVariable(name: "flags", arg: 3, scope: !312, file: !25, line: 511, type: !67)
!320 = !DILocation(line: 511, column: 57, scope: !312)
!321 = !DILocalVariable(name: "mmst", scope: !312, file: !25, line: 513, type: !95)
!322 = !DILocation(line: 513, column: 18, scope: !312)
!323 = !DILocation(line: 513, column: 25, scope: !312)
!324 = !DILocation(line: 513, column: 28, scope: !312)
!325 = !DILocalVariable(name: "mms", scope: !312, file: !25, line: 514, type: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!327 = !DILocation(line: 514, column: 17, scope: !312)
!328 = !DILocalVariable(name: "port", scope: !312, file: !25, line: 515, type: !67)
!329 = !DILocation(line: 515, column: 9, scope: !312)
!330 = !DILocalVariable(name: "err", scope: !312, file: !25, line: 515, type: !67)
!331 = !DILocation(line: 515, column: 15, scope: !312)
!332 = !DILocalVariable(name: "tcpname", scope: !312, file: !25, line: 516, type: !294)
!333 = !DILocation(line: 516, column: 10, scope: !312)
!334 = !DILocation(line: 518, column: 5, scope: !312)
!335 = !DILocation(line: 518, column: 8, scope: !312)
!336 = !DILocation(line: 518, column: 20, scope: !312)
!337 = !DILocation(line: 519, column: 12, scope: !312)
!338 = !DILocation(line: 519, column: 18, scope: !312)
!339 = !DILocation(line: 519, column: 9, scope: !312)
!340 = !DILocation(line: 523, column: 13, scope: !312)
!341 = !DILocation(line: 523, column: 19, scope: !312)
!342 = !DILocation(line: 523, column: 52, scope: !312)
!343 = !DILocation(line: 523, column: 58, scope: !312)
!344 = !DILocation(line: 524, column: 33, scope: !312)
!345 = !DILocation(line: 522, column: 5, scope: !312)
!346 = !DILocation(line: 526, column: 8, scope: !347)
!347 = distinct !DILexicalBlock(scope: !312, file: !25, line: 526, column: 8)
!348 = !DILocation(line: 526, column: 12, scope: !347)
!349 = !DILocation(line: 526, column: 8, scope: !312)
!350 = !DILocation(line: 527, column: 14, scope: !347)
!351 = !DILocation(line: 527, column: 9, scope: !347)
!352 = !DILocation(line: 530, column: 17, scope: !312)
!353 = !DILocation(line: 530, column: 55, scope: !312)
!354 = !DILocation(line: 530, column: 61, scope: !312)
!355 = !DILocation(line: 530, column: 67, scope: !312)
!356 = !DILocation(line: 530, column: 5, scope: !312)
!357 = !DILocation(line: 531, column: 33, scope: !312)
!358 = !DILocation(line: 531, column: 38, scope: !312)
!359 = !DILocation(line: 531, column: 46, scope: !312)
!360 = !DILocation(line: 532, column: 33, scope: !312)
!361 = !DILocation(line: 532, column: 36, scope: !312)
!362 = !DILocation(line: 533, column: 32, scope: !312)
!363 = !DILocation(line: 533, column: 35, scope: !312)
!364 = !DILocation(line: 533, column: 55, scope: !312)
!365 = !DILocation(line: 533, column: 58, scope: !312)
!366 = !DILocation(line: 533, column: 78, scope: !312)
!367 = !DILocation(line: 531, column: 11, scope: !312)
!368 = !DILocation(line: 531, column: 9, scope: !312)
!369 = !DILocation(line: 534, column: 9, scope: !370)
!370 = distinct !DILexicalBlock(scope: !312, file: !25, line: 534, column: 9)
!371 = !DILocation(line: 534, column: 9, scope: !312)
!372 = !DILocation(line: 535, column: 9, scope: !370)
!373 = !DILocation(line: 537, column: 5, scope: !312)
!374 = !DILocation(line: 537, column: 11, scope: !312)
!375 = !DILocation(line: 537, column: 21, scope: !312)
!376 = !DILocation(line: 538, column: 5, scope: !312)
!377 = !DILocation(line: 538, column: 11, scope: !312)
!378 = !DILocation(line: 538, column: 28, scope: !312)
!379 = !DILocation(line: 539, column: 30, scope: !312)
!380 = !DILocation(line: 539, column: 11, scope: !312)
!381 = !DILocation(line: 539, column: 9, scope: !312)
!382 = !DILocation(line: 540, column: 9, scope: !383)
!383 = distinct !DILexicalBlock(scope: !312, file: !25, line: 540, column: 9)
!384 = !DILocation(line: 540, column: 9, scope: !312)
!385 = !DILocation(line: 541, column: 9, scope: !383)
!386 = !DILocation(line: 542, column: 30, scope: !312)
!387 = !DILocation(line: 542, column: 11, scope: !312)
!388 = !DILocation(line: 542, column: 9, scope: !312)
!389 = !DILocation(line: 543, column: 9, scope: !390)
!390 = distinct !DILexicalBlock(scope: !312, file: !25, line: 543, column: 9)
!391 = !DILocation(line: 543, column: 9, scope: !312)
!392 = !DILocation(line: 544, column: 9, scope: !390)
!393 = !DILocation(line: 545, column: 30, scope: !312)
!394 = !DILocation(line: 545, column: 11, scope: !312)
!395 = !DILocation(line: 545, column: 9, scope: !312)
!396 = !DILocation(line: 546, column: 9, scope: !397)
!397 = distinct !DILexicalBlock(scope: !312, file: !25, line: 546, column: 9)
!398 = !DILocation(line: 546, column: 9, scope: !312)
!399 = !DILocation(line: 547, column: 9, scope: !397)
!400 = !DILocation(line: 548, column: 30, scope: !312)
!401 = !DILocation(line: 548, column: 11, scope: !312)
!402 = !DILocation(line: 548, column: 9, scope: !312)
!403 = !DILocation(line: 549, column: 9, scope: !404)
!404 = distinct !DILexicalBlock(scope: !312, file: !25, line: 549, column: 9)
!405 = !DILocation(line: 549, column: 9, scope: !312)
!406 = !DILocation(line: 550, column: 9, scope: !404)
!407 = !DILocation(line: 551, column: 30, scope: !312)
!408 = !DILocation(line: 551, column: 11, scope: !312)
!409 = !DILocation(line: 551, column: 9, scope: !312)
!410 = !DILocation(line: 552, column: 9, scope: !411)
!411 = distinct !DILexicalBlock(scope: !312, file: !25, line: 552, column: 9)
!412 = !DILocation(line: 552, column: 9, scope: !312)
!413 = !DILocation(line: 553, column: 9, scope: !411)
!414 = !DILocation(line: 554, column: 30, scope: !312)
!415 = !DILocation(line: 554, column: 11, scope: !312)
!416 = !DILocation(line: 554, column: 9, scope: !312)
!417 = !DILocation(line: 555, column: 9, scope: !418)
!418 = distinct !DILexicalBlock(scope: !312, file: !25, line: 555, column: 9)
!419 = !DILocation(line: 555, column: 9, scope: !312)
!420 = !DILocation(line: 556, column: 9, scope: !418)
!421 = !DILocation(line: 557, column: 9, scope: !422)
!422 = distinct !DILexicalBlock(scope: !312, file: !25, line: 557, column: 8)
!423 = !DILocation(line: 557, column: 15, scope: !422)
!424 = !DILocation(line: 557, column: 30, scope: !422)
!425 = !DILocation(line: 557, column: 39, scope: !422)
!426 = !DILocation(line: 557, column: 43, scope: !427)
!427 = !DILexicalBlockFile(scope: !422, file: !25, discriminator: 1)
!428 = !DILocation(line: 557, column: 49, scope: !427)
!429 = !DILocation(line: 557, column: 64, scope: !427)
!430 = !DILocation(line: 557, column: 8, scope: !427)
!431 = !DILocation(line: 558, column: 9, scope: !432)
!432 = distinct !DILexicalBlock(scope: !422, file: !25, line: 557, column: 74)
!433 = !DILocation(line: 560, column: 13, scope: !432)
!434 = !DILocation(line: 561, column: 9, scope: !432)
!435 = !DILocation(line: 563, column: 36, scope: !312)
!436 = !DILocation(line: 563, column: 11, scope: !312)
!437 = !DILocation(line: 563, column: 9, scope: !312)
!438 = !DILocation(line: 564, column: 9, scope: !439)
!439 = distinct !DILexicalBlock(scope: !312, file: !25, line: 564, column: 9)
!440 = !DILocation(line: 564, column: 9, scope: !312)
!441 = !DILocation(line: 565, column: 9, scope: !442)
!442 = distinct !DILexicalBlock(scope: !439, file: !25, line: 564, column: 14)
!443 = !DILocation(line: 566, column: 9, scope: !442)
!444 = !DILocation(line: 568, column: 5, scope: !312)
!445 = !DILocation(line: 568, column: 10, scope: !312)
!446 = !DILocation(line: 568, column: 24, scope: !312)
!447 = !DILocation(line: 570, column: 10, scope: !448)
!448 = distinct !DILexicalBlock(scope: !312, file: !25, line: 570, column: 9)
!449 = !DILocation(line: 570, column: 15, scope: !448)
!450 = !DILocation(line: 570, column: 30, scope: !448)
!451 = !DILocation(line: 570, column: 34, scope: !452)
!452 = !DILexicalBlockFile(scope: !448, file: !25, discriminator: 1)
!453 = !DILocation(line: 570, column: 39, scope: !452)
!454 = !DILocation(line: 570, column: 9, scope: !452)
!455 = !DILocation(line: 571, column: 9, scope: !448)
!456 = !DILocation(line: 573, column: 26, scope: !312)
!457 = !DILocation(line: 573, column: 5, scope: !312)
!458 = !DILocation(line: 574, column: 30, scope: !312)
!459 = !DILocation(line: 574, column: 11, scope: !312)
!460 = !DILocation(line: 574, column: 9, scope: !312)
!461 = !DILocation(line: 575, column: 9, scope: !462)
!462 = distinct !DILexicalBlock(scope: !312, file: !25, line: 575, column: 9)
!463 = !DILocation(line: 575, column: 9, scope: !312)
!464 = !DILocation(line: 576, column: 9, scope: !462)
!465 = !DILocation(line: 578, column: 30, scope: !312)
!466 = !DILocation(line: 578, column: 11, scope: !312)
!467 = !DILocation(line: 578, column: 9, scope: !312)
!468 = !DILocation(line: 579, column: 9, scope: !469)
!469 = distinct !DILexicalBlock(scope: !312, file: !25, line: 579, column: 9)
!470 = !DILocation(line: 579, column: 9, scope: !312)
!471 = !DILocation(line: 580, column: 9, scope: !472)
!472 = distinct !DILexicalBlock(scope: !469, file: !25, line: 579, column: 14)
!473 = !DILocation(line: 582, column: 5, scope: !312)
!474 = !DILocation(line: 583, column: 5, scope: !312)
!475 = !DILocation(line: 585, column: 15, scope: !312)
!476 = !DILocation(line: 585, column: 5, scope: !312)
!477 = !DILocation(line: 586, column: 53, scope: !312)
!478 = !DILocation(line: 586, column: 5, scope: !312)
!479 = !DILocation(line: 587, column: 12, scope: !312)
!480 = !DILocation(line: 587, column: 5, scope: !312)
!481 = !DILocation(line: 588, column: 1, scope: !312)
!482 = distinct !DISubprogram(name: "mms_read", scope: !25, file: !25, line: 591, type: !483, isLocal: true, isDefinition: true, scopeLine: 592, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!483 = !DISubroutineType(types: !484)
!484 = !{!67, !105, !92, !67}
!485 = !DILocalVariable(name: "h", arg: 1, scope: !482, file: !25, line: 591, type: !105)
!486 = !DILocation(line: 591, column: 33, scope: !482)
!487 = !DILocalVariable(name: "buf", arg: 2, scope: !482, file: !25, line: 591, type: !92)
!488 = !DILocation(line: 591, column: 45, scope: !482)
!489 = !DILocalVariable(name: "size", arg: 3, scope: !482, file: !25, line: 591, type: !67)
!490 = !DILocation(line: 591, column: 54, scope: !482)
!491 = !DILocalVariable(name: "mmst", scope: !482, file: !25, line: 594, type: !95)
!492 = !DILocation(line: 594, column: 18, scope: !482)
!493 = !DILocation(line: 594, column: 25, scope: !482)
!494 = !DILocation(line: 594, column: 28, scope: !482)
!495 = !DILocalVariable(name: "mms", scope: !482, file: !25, line: 595, type: !326)
!496 = !DILocation(line: 595, column: 17, scope: !482)
!497 = !DILocation(line: 595, column: 24, scope: !482)
!498 = !DILocation(line: 595, column: 30, scope: !482)
!499 = !DILocalVariable(name: "result", scope: !482, file: !25, line: 596, type: !67)
!500 = !DILocation(line: 596, column: 9, scope: !482)
!501 = !DILocation(line: 598, column: 5, scope: !482)
!502 = distinct !{!502, !501}
!503 = !DILocation(line: 599, column: 12, scope: !504)
!504 = distinct !DILexicalBlock(scope: !505, file: !25, line: 599, column: 12)
!505 = distinct !DILexicalBlock(scope: !482, file: !25, line: 598, column: 8)
!506 = !DILocation(line: 599, column: 17, scope: !504)
!507 = !DILocation(line: 599, column: 40, scope: !504)
!508 = !DILocation(line: 599, column: 45, scope: !504)
!509 = !DILocation(line: 599, column: 38, scope: !504)
!510 = !DILocation(line: 599, column: 12, scope: !505)
!511 = !DILocation(line: 601, column: 41, scope: !512)
!512 = distinct !DILexicalBlock(scope: !504, file: !25, line: 599, column: 62)
!513 = !DILocation(line: 601, column: 46, scope: !512)
!514 = !DILocation(line: 601, column: 51, scope: !512)
!515 = !DILocation(line: 601, column: 22, scope: !512)
!516 = !DILocation(line: 601, column: 20, scope: !512)
!517 = !DILocation(line: 602, column: 9, scope: !512)
!518 = !DILocation(line: 602, column: 19, scope: !519)
!519 = !DILexicalBlockFile(scope: !520, file: !25, discriminator: 1)
!520 = distinct !DILexicalBlock(scope: !504, file: !25, line: 602, column: 19)
!521 = !DILocation(line: 602, column: 24, scope: !519)
!522 = !DILocation(line: 605, column: 39, scope: !523)
!523 = distinct !DILexicalBlock(scope: !520, file: !25, line: 602, column: 42)
!524 = !DILocation(line: 605, column: 44, scope: !523)
!525 = !DILocation(line: 605, column: 49, scope: !523)
!526 = !DILocation(line: 605, column: 22, scope: !523)
!527 = !DILocation(line: 605, column: 20, scope: !523)
!528 = !DILocation(line: 606, column: 9, scope: !523)
!529 = !DILocalVariable(name: "err", scope: !530, file: !25, line: 608, type: !67)
!530 = distinct !DILexicalBlock(scope: !520, file: !25, line: 606, column: 16)
!531 = !DILocation(line: 608, column: 17, scope: !530)
!532 = !DILocation(line: 608, column: 42, scope: !530)
!533 = !DILocation(line: 608, column: 23, scope: !530)
!534 = !DILocation(line: 609, column: 17, scope: !535)
!535 = distinct !DILexicalBlock(scope: !530, file: !25, line: 609, column: 17)
!536 = !DILocation(line: 609, column: 21, scope: !535)
!537 = !DILocation(line: 609, column: 17, scope: !530)
!538 = !DILocation(line: 610, column: 20, scope: !539)
!539 = distinct !DILexicalBlock(scope: !540, file: !25, line: 610, column: 20)
!540 = distinct !DILexicalBlock(scope: !535, file: !25, line: 609, column: 27)
!541 = !DILocation(line: 610, column: 25, scope: !539)
!542 = !DILocation(line: 610, column: 42, scope: !539)
!543 = !DILocation(line: 610, column: 47, scope: !539)
!544 = !DILocation(line: 610, column: 41, scope: !539)
!545 = !DILocation(line: 610, column: 20, scope: !540)
!546 = !DILocation(line: 613, column: 28, scope: !547)
!547 = distinct !DILexicalBlock(scope: !539, file: !25, line: 610, column: 63)
!548 = !DILocation(line: 613, column: 33, scope: !547)
!549 = !DILocation(line: 613, column: 51, scope: !547)
!550 = !DILocation(line: 613, column: 56, scope: !547)
!551 = !DILocation(line: 611, column: 21, scope: !547)
!552 = !DILocation(line: 614, column: 27, scope: !547)
!553 = !DILocation(line: 615, column: 17, scope: !547)
!554 = !DILocation(line: 617, column: 47, scope: !555)
!555 = distinct !DILexicalBlock(scope: !539, file: !25, line: 615, column: 24)
!556 = !DILocation(line: 617, column: 52, scope: !555)
!557 = !DILocation(line: 617, column: 57, scope: !555)
!558 = !DILocation(line: 617, column: 30, scope: !555)
!559 = !DILocation(line: 617, column: 28, scope: !555)
!560 = !DILocation(line: 618, column: 25, scope: !561)
!561 = distinct !DILexicalBlock(scope: !555, file: !25, line: 618, column: 25)
!562 = !DILocation(line: 618, column: 32, scope: !561)
!563 = !DILocation(line: 618, column: 25, scope: !555)
!564 = !DILocation(line: 619, column: 25, scope: !565)
!565 = distinct !DILexicalBlock(scope: !561, file: !25, line: 618, column: 38)
!566 = !DILocation(line: 620, column: 25, scope: !565)
!567 = !DILocation(line: 623, column: 13, scope: !540)
!568 = !DILocation(line: 624, column: 17, scope: !569)
!569 = distinct !DILexicalBlock(scope: !535, file: !25, line: 623, column: 20)
!570 = !DILocation(line: 625, column: 17, scope: !569)
!571 = !DILocation(line: 628, column: 5, scope: !505)
!572 = !DILocation(line: 628, column: 14, scope: !573)
!573 = !DILexicalBlockFile(scope: !482, file: !25, discriminator: 1)
!574 = !DILocation(line: 628, column: 13, scope: !573)
!575 = !DILocation(line: 628, column: 5, scope: !573)
!576 = !DILocation(line: 629, column: 12, scope: !482)
!577 = !DILocation(line: 629, column: 5, scope: !482)
!578 = distinct !DISubprogram(name: "mms_close", scope: !25, file: !25, line: 470, type: !180, isLocal: true, isDefinition: true, scopeLine: 471, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!579 = !DILocalVariable(name: "h", arg: 1, scope: !578, file: !25, line: 470, type: !105)
!580 = !DILocation(line: 470, column: 34, scope: !578)
!581 = !DILocalVariable(name: "mmst", scope: !578, file: !25, line: 472, type: !95)
!582 = !DILocation(line: 472, column: 18, scope: !578)
!583 = !DILocation(line: 472, column: 40, scope: !578)
!584 = !DILocation(line: 472, column: 43, scope: !578)
!585 = !DILocation(line: 472, column: 25, scope: !578)
!586 = !DILocalVariable(name: "mms", scope: !578, file: !25, line: 473, type: !326)
!587 = !DILocation(line: 473, column: 17, scope: !578)
!588 = !DILocation(line: 473, column: 24, scope: !578)
!589 = !DILocation(line: 473, column: 30, scope: !578)
!590 = !DILocation(line: 474, column: 8, scope: !591)
!591 = distinct !DILexicalBlock(scope: !578, file: !25, line: 474, column: 8)
!592 = !DILocation(line: 474, column: 13, scope: !591)
!593 = !DILocation(line: 474, column: 8, scope: !578)
!594 = !DILocation(line: 475, column: 27, scope: !595)
!595 = distinct !DILexicalBlock(scope: !591, file: !25, line: 474, column: 21)
!596 = !DILocation(line: 475, column: 9, scope: !595)
!597 = !DILocation(line: 476, column: 21, scope: !595)
!598 = !DILocation(line: 476, column: 26, scope: !595)
!599 = !DILocation(line: 476, column: 9, scope: !595)
!600 = !DILocation(line: 477, column: 5, scope: !595)
!601 = !DILocation(line: 480, column: 15, scope: !578)
!602 = !DILocation(line: 480, column: 20, scope: !578)
!603 = !DILocation(line: 480, column: 14, scope: !578)
!604 = !DILocation(line: 480, column: 5, scope: !578)
!605 = !DILocation(line: 481, column: 15, scope: !578)
!606 = !DILocation(line: 481, column: 20, scope: !578)
!607 = !DILocation(line: 481, column: 14, scope: !578)
!608 = !DILocation(line: 481, column: 5, scope: !578)
!609 = !DILocation(line: 483, column: 5, scope: !578)
!610 = distinct !DISubprogram(name: "mms_safe_send_recv", scope: !25, file: !25, line: 379, type: !611, isLocal: true, isDefinition: true, scopeLine: 382, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!611 = !DISubroutineType(types: !612)
!612 = !{!67, !95, !613, !616}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64, align: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!67, !95}
!616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "MMSSCPacketType", file: !25, line: 86, baseType: !24)
!618 = !DILocalVariable(name: "mmst", arg: 1, scope: !610, file: !25, line: 379, type: !95)
!619 = !DILocation(line: 379, column: 44, scope: !610)
!620 = !DILocalVariable(name: "send_fun", arg: 2, scope: !610, file: !25, line: 380, type: !613)
!621 = !DILocation(line: 380, column: 37, scope: !610)
!622 = !DILocalVariable(name: "expect_type", arg: 3, scope: !610, file: !25, line: 381, type: !616)
!623 = !DILocation(line: 381, column: 53, scope: !610)
!624 = !DILocalVariable(name: "type", scope: !610, file: !25, line: 383, type: !617)
!625 = !DILocation(line: 383, column: 21, scope: !610)
!626 = !DILocation(line: 384, column: 8, scope: !627)
!627 = distinct !DILexicalBlock(scope: !610, file: !25, line: 384, column: 8)
!628 = !DILocation(line: 384, column: 8, scope: !610)
!629 = !DILocalVariable(name: "ret", scope: !630, file: !25, line: 385, type: !67)
!630 = distinct !DILexicalBlock(scope: !627, file: !25, line: 384, column: 18)
!631 = !DILocation(line: 385, column: 13, scope: !630)
!632 = !DILocation(line: 385, column: 19, scope: !630)
!633 = !DILocation(line: 385, column: 28, scope: !630)
!634 = !DILocation(line: 386, column: 13, scope: !635)
!635 = distinct !DILexicalBlock(scope: !630, file: !25, line: 386, column: 13)
!636 = !DILocation(line: 386, column: 17, scope: !635)
!637 = !DILocation(line: 386, column: 13, scope: !630)
!638 = !DILocation(line: 387, column: 84, scope: !639)
!639 = distinct !DILexicalBlock(scope: !635, file: !25, line: 386, column: 22)
!640 = !DILocation(line: 387, column: 13, scope: !639)
!641 = !DILocation(line: 388, column: 20, scope: !639)
!642 = !DILocation(line: 388, column: 13, scope: !639)
!643 = !DILocation(line: 390, column: 5, scope: !630)
!644 = !DILocation(line: 392, column: 41, scope: !645)
!645 = distinct !DILexicalBlock(scope: !610, file: !25, line: 392, column: 9)
!646 = !DILocation(line: 392, column: 17, scope: !645)
!647 = !DILocation(line: 392, column: 15, scope: !645)
!648 = !DILocation(line: 392, column: 51, scope: !645)
!649 = !DILocation(line: 392, column: 48, scope: !645)
!650 = !DILocation(line: 392, column: 9, scope: !610)
!651 = !DILocation(line: 395, column: 16, scope: !652)
!652 = distinct !DILexicalBlock(scope: !645, file: !25, line: 392, column: 64)
!653 = !DILocation(line: 395, column: 22, scope: !652)
!654 = !DILocation(line: 393, column: 9, scope: !652)
!655 = !DILocation(line: 396, column: 9, scope: !652)
!656 = !DILocation(line: 398, column: 9, scope: !657)
!657 = distinct !DILexicalBlock(scope: !645, file: !25, line: 397, column: 12)
!658 = !DILocation(line: 400, column: 1, scope: !610)
!659 = distinct !DISubprogram(name: "send_startup_packet", scope: !25, file: !25, line: 424, type: !614, isLocal: true, isDefinition: true, scopeLine: 425, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!660 = !DILocalVariable(name: "b", arg: 1, scope: !661, file: !662, line: 88, type: !665)
!661 = distinct !DISubprogram(name: "bytestream_put_le32", scope: !662, file: !662, line: 88, type: !663, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!662 = !DIFile(filename: "./libavcodec/bytestream.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!663 = !DISubroutineType(types: !664)
!664 = !{null, !665, !666}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!667 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !668)
!668 = distinct !DILocation(line: 439, column: 5, scope: !659)
!669 = !DILocalVariable(name: "value", arg: 2, scope: !661, file: !662, line: 88, type: !666)
!670 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !668)
!671 = !DILocalVariable(name: "mmst", arg: 1, scope: !659, file: !25, line: 424, type: !95)
!672 = !DILocation(line: 424, column: 45, scope: !659)
!673 = !DILocalVariable(name: "data_string", scope: !659, file: !25, line: 426, type: !294)
!674 = !DILocation(line: 426, column: 10, scope: !659)
!675 = !DILocalVariable(name: "ret", scope: !659, file: !25, line: 427, type: !67)
!676 = !DILocation(line: 427, column: 9, scope: !659)
!677 = !DILocalVariable(name: "mms", scope: !659, file: !25, line: 428, type: !326)
!678 = !DILocation(line: 428, column: 17, scope: !659)
!679 = !DILocation(line: 428, column: 24, scope: !659)
!680 = !DILocation(line: 428, column: 30, scope: !659)
!681 = !DILocation(line: 433, column: 14, scope: !659)
!682 = !DILocation(line: 435, column: 53, scope: !659)
!683 = !DILocation(line: 435, column: 59, scope: !659)
!684 = !DILocation(line: 433, column: 5, scope: !659)
!685 = !DILocation(line: 437, column: 26, scope: !659)
!686 = !DILocation(line: 437, column: 5, scope: !659)
!687 = !DILocation(line: 438, column: 29, scope: !659)
!688 = !DILocation(line: 438, column: 5, scope: !659)
!689 = !DILocation(line: 439, column: 26, scope: !659)
!690 = !DILocation(line: 439, column: 31, scope: !659)
!691 = !DILocation(line: 439, column: 5, scope: !659)
!692 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !668)
!693 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !668)
!694 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !668)
!695 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !668)
!696 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !668)
!697 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !668)
!698 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !668)
!699 = !DILocation(line: 440, column: 30, scope: !700)
!700 = distinct !DILexicalBlock(scope: !659, file: !25, line: 440, column: 9)
!701 = !DILocation(line: 440, column: 35, scope: !700)
!702 = !DILocation(line: 440, column: 16, scope: !700)
!703 = !DILocation(line: 440, column: 14, scope: !700)
!704 = !DILocation(line: 440, column: 49, scope: !700)
!705 = !DILocation(line: 440, column: 9, scope: !659)
!706 = !DILocation(line: 441, column: 16, scope: !700)
!707 = !DILocation(line: 441, column: 9, scope: !700)
!708 = !DILocation(line: 442, column: 32, scope: !659)
!709 = !DILocation(line: 442, column: 12, scope: !659)
!710 = !DILocation(line: 442, column: 5, scope: !659)
!711 = !DILocation(line: 443, column: 1, scope: !659)
!712 = distinct !DISubprogram(name: "send_time_test_data", scope: !25, file: !25, line: 170, type: !614, isLocal: true, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!713 = !DILocalVariable(name: "mmst", arg: 1, scope: !712, file: !25, line: 170, type: !95)
!714 = !DILocation(line: 170, column: 45, scope: !712)
!715 = !DILocation(line: 172, column: 26, scope: !712)
!716 = !DILocation(line: 172, column: 5, scope: !712)
!717 = !DILocation(line: 173, column: 30, scope: !712)
!718 = !DILocation(line: 173, column: 36, scope: !712)
!719 = !DILocation(line: 173, column: 5, scope: !712)
!720 = !DILocation(line: 174, column: 32, scope: !712)
!721 = !DILocation(line: 174, column: 12, scope: !712)
!722 = !DILocation(line: 174, column: 5, scope: !712)
!723 = distinct !DISubprogram(name: "send_protocol_select", scope: !25, file: !25, line: 177, type: !614, isLocal: true, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!724 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !725)
!725 = distinct !DILocation(line: 187, column: 5, scope: !723)
!726 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !725)
!727 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !728)
!728 = distinct !DILocation(line: 186, column: 5, scope: !723)
!729 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !728)
!730 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !731)
!731 = distinct !DILocation(line: 185, column: 5, scope: !723)
!732 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !731)
!733 = !DILocalVariable(name: "mmst", arg: 1, scope: !723, file: !25, line: 177, type: !95)
!734 = !DILocation(line: 177, column: 46, scope: !723)
!735 = !DILocalVariable(name: "ret", scope: !723, file: !25, line: 179, type: !67)
!736 = !DILocation(line: 179, column: 9, scope: !723)
!737 = !DILocalVariable(name: "data_string", scope: !723, file: !25, line: 180, type: !294)
!738 = !DILocation(line: 180, column: 10, scope: !723)
!739 = !DILocalVariable(name: "mms", scope: !723, file: !25, line: 181, type: !326)
!740 = !DILocation(line: 181, column: 17, scope: !723)
!741 = !DILocation(line: 181, column: 24, scope: !723)
!742 = !DILocation(line: 181, column: 30, scope: !723)
!743 = !DILocation(line: 183, column: 26, scope: !723)
!744 = !DILocation(line: 183, column: 5, scope: !723)
!745 = !DILocation(line: 184, column: 29, scope: !723)
!746 = !DILocation(line: 184, column: 5, scope: !723)
!747 = !DILocation(line: 185, column: 26, scope: !723)
!748 = !DILocation(line: 185, column: 31, scope: !723)
!749 = !DILocation(line: 185, column: 5, scope: !723)
!750 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !731)
!751 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !731)
!752 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !731)
!753 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !731)
!754 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !731)
!755 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !731)
!756 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !731)
!757 = !DILocation(line: 186, column: 26, scope: !723)
!758 = !DILocation(line: 186, column: 31, scope: !723)
!759 = !DILocation(line: 186, column: 5, scope: !723)
!760 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !728)
!761 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !728)
!762 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !728)
!763 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !728)
!764 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !728)
!765 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !728)
!766 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !728)
!767 = !DILocation(line: 187, column: 26, scope: !723)
!768 = !DILocation(line: 187, column: 31, scope: !723)
!769 = !DILocation(line: 187, column: 5, scope: !723)
!770 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !725)
!771 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !725)
!772 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !725)
!773 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !725)
!774 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !725)
!775 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !725)
!776 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !725)
!777 = !DILocation(line: 188, column: 14, scope: !723)
!778 = !DILocation(line: 188, column: 5, scope: !723)
!779 = !DILocation(line: 196, column: 30, scope: !780)
!780 = distinct !DILexicalBlock(scope: !723, file: !25, line: 196, column: 9)
!781 = !DILocation(line: 196, column: 35, scope: !780)
!782 = !DILocation(line: 196, column: 16, scope: !780)
!783 = !DILocation(line: 196, column: 14, scope: !780)
!784 = !DILocation(line: 196, column: 49, scope: !780)
!785 = !DILocation(line: 196, column: 9, scope: !723)
!786 = !DILocation(line: 197, column: 16, scope: !780)
!787 = !DILocation(line: 197, column: 9, scope: !780)
!788 = !DILocation(line: 198, column: 32, scope: !723)
!789 = !DILocation(line: 198, column: 12, scope: !723)
!790 = !DILocation(line: 198, column: 5, scope: !723)
!791 = !DILocation(line: 199, column: 1, scope: !723)
!792 = distinct !DISubprogram(name: "send_media_file_request", scope: !25, file: !25, line: 201, type: !614, isLocal: true, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!793 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !794)
!794 = distinct !DILocation(line: 208, column: 5, scope: !792)
!795 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !794)
!796 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !797)
!797 = distinct !DILocation(line: 207, column: 5, scope: !792)
!798 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !797)
!799 = !DILocalVariable(name: "mmst", arg: 1, scope: !792, file: !25, line: 201, type: !95)
!800 = !DILocation(line: 201, column: 49, scope: !792)
!801 = !DILocalVariable(name: "ret", scope: !792, file: !25, line: 203, type: !67)
!802 = !DILocation(line: 203, column: 9, scope: !792)
!803 = !DILocalVariable(name: "mms", scope: !792, file: !25, line: 204, type: !326)
!804 = !DILocation(line: 204, column: 17, scope: !792)
!805 = !DILocation(line: 204, column: 24, scope: !792)
!806 = !DILocation(line: 204, column: 30, scope: !792)
!807 = !DILocation(line: 205, column: 26, scope: !792)
!808 = !DILocation(line: 205, column: 5, scope: !792)
!809 = !DILocation(line: 206, column: 29, scope: !792)
!810 = !DILocation(line: 206, column: 5, scope: !792)
!811 = !DILocation(line: 207, column: 26, scope: !792)
!812 = !DILocation(line: 207, column: 31, scope: !792)
!813 = !DILocation(line: 207, column: 5, scope: !792)
!814 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !797)
!815 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !797)
!816 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !797)
!817 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !797)
!818 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !797)
!819 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !797)
!820 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !797)
!821 = !DILocation(line: 208, column: 26, scope: !792)
!822 = !DILocation(line: 208, column: 31, scope: !792)
!823 = !DILocation(line: 208, column: 5, scope: !792)
!824 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !794)
!825 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !794)
!826 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !794)
!827 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !794)
!828 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !794)
!829 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !794)
!830 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !794)
!831 = !DILocation(line: 209, column: 30, scope: !832)
!832 = distinct !DILexicalBlock(scope: !792, file: !25, line: 209, column: 9)
!833 = !DILocation(line: 209, column: 35, scope: !832)
!834 = !DILocation(line: 209, column: 41, scope: !832)
!835 = !DILocation(line: 209, column: 46, scope: !832)
!836 = !DILocation(line: 209, column: 16, scope: !832)
!837 = !DILocation(line: 209, column: 14, scope: !832)
!838 = !DILocation(line: 209, column: 52, scope: !832)
!839 = !DILocation(line: 209, column: 9, scope: !792)
!840 = !DILocation(line: 210, column: 16, scope: !832)
!841 = !DILocation(line: 210, column: 9, scope: !832)
!842 = !DILocation(line: 212, column: 32, scope: !792)
!843 = !DILocation(line: 212, column: 12, scope: !792)
!844 = !DILocation(line: 212, column: 5, scope: !792)
!845 = !DILocation(line: 213, column: 1, scope: !792)
!846 = distinct !DISubprogram(name: "send_media_header_request", scope: !25, file: !25, line: 402, type: !614, isLocal: true, isDefinition: true, scopeLine: 403, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!847 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !848)
!848 = distinct !DILocation(line: 409, column: 5, scope: !846)
!849 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !848)
!850 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !851)
!851 = distinct !DILocation(line: 410, column: 5, scope: !846)
!852 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !851)
!853 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !854)
!854 = distinct !DILocation(line: 411, column: 5, scope: !846)
!855 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !854)
!856 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !857)
!857 = distinct !DILocation(line: 412, column: 5, scope: !846)
!858 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !857)
!859 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !860)
!860 = distinct !DILocation(line: 415, column: 5, scope: !846)
!861 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !860)
!862 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !863)
!863 = distinct !DILocation(line: 416, column: 5, scope: !846)
!864 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !863)
!865 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !866)
!866 = distinct !DILocation(line: 417, column: 5, scope: !846)
!867 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !866)
!868 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !869)
!869 = distinct !DILocation(line: 418, column: 5, scope: !846)
!870 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !869)
!871 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !872)
!872 = distinct !DILocation(line: 408, column: 5, scope: !846)
!873 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !872)
!874 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !875)
!875 = distinct !DILocation(line: 407, column: 5, scope: !846)
!876 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !875)
!877 = !DILocalVariable(name: "mmst", arg: 1, scope: !846, file: !25, line: 402, type: !95)
!878 = !DILocation(line: 402, column: 51, scope: !846)
!879 = !DILocalVariable(name: "mms", scope: !846, file: !25, line: 404, type: !326)
!880 = !DILocation(line: 404, column: 17, scope: !846)
!881 = !DILocation(line: 404, column: 24, scope: !846)
!882 = !DILocation(line: 404, column: 30, scope: !846)
!883 = !DILocation(line: 405, column: 26, scope: !846)
!884 = !DILocation(line: 405, column: 5, scope: !846)
!885 = !DILocation(line: 406, column: 29, scope: !846)
!886 = !DILocation(line: 406, column: 5, scope: !846)
!887 = !DILocation(line: 407, column: 26, scope: !846)
!888 = !DILocation(line: 407, column: 31, scope: !846)
!889 = !DILocation(line: 407, column: 5, scope: !846)
!890 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !875)
!891 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !875)
!892 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !875)
!893 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !875)
!894 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !875)
!895 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !875)
!896 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !875)
!897 = !DILocation(line: 408, column: 26, scope: !846)
!898 = !DILocation(line: 408, column: 31, scope: !846)
!899 = !DILocation(line: 408, column: 5, scope: !846)
!900 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !872)
!901 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !872)
!902 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !872)
!903 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !872)
!904 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !872)
!905 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !872)
!906 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !872)
!907 = !DILocation(line: 409, column: 26, scope: !846)
!908 = !DILocation(line: 409, column: 31, scope: !846)
!909 = !DILocation(line: 409, column: 5, scope: !846)
!910 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !848)
!911 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !848)
!912 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !848)
!913 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !848)
!914 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !848)
!915 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !848)
!916 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !848)
!917 = !DILocation(line: 410, column: 26, scope: !846)
!918 = !DILocation(line: 410, column: 31, scope: !846)
!919 = !DILocation(line: 410, column: 5, scope: !846)
!920 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !851)
!921 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !851)
!922 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !851)
!923 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !851)
!924 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !851)
!925 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !851)
!926 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !851)
!927 = !DILocation(line: 411, column: 26, scope: !846)
!928 = !DILocation(line: 411, column: 31, scope: !846)
!929 = !DILocation(line: 411, column: 5, scope: !846)
!930 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !854)
!931 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !854)
!932 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !854)
!933 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !854)
!934 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !854)
!935 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !854)
!936 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !854)
!937 = !DILocation(line: 412, column: 26, scope: !846)
!938 = !DILocation(line: 412, column: 31, scope: !846)
!939 = !DILocation(line: 412, column: 5, scope: !846)
!940 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !857)
!941 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !857)
!942 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !857)
!943 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !857)
!944 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !857)
!945 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !857)
!946 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !857)
!947 = !DILocation(line: 415, column: 26, scope: !846)
!948 = !DILocation(line: 415, column: 31, scope: !846)
!949 = !DILocation(line: 415, column: 5, scope: !846)
!950 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !860)
!951 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !860)
!952 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !860)
!953 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !860)
!954 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !860)
!955 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !860)
!956 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !860)
!957 = !DILocation(line: 416, column: 26, scope: !846)
!958 = !DILocation(line: 416, column: 31, scope: !846)
!959 = !DILocation(line: 416, column: 5, scope: !846)
!960 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !863)
!961 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !863)
!962 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !863)
!963 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !863)
!964 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !863)
!965 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !863)
!966 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !863)
!967 = !DILocation(line: 417, column: 26, scope: !846)
!968 = !DILocation(line: 417, column: 31, scope: !846)
!969 = !DILocation(line: 417, column: 5, scope: !846)
!970 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !866)
!971 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !866)
!972 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !866)
!973 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !866)
!974 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !866)
!975 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !866)
!976 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !866)
!977 = !DILocation(line: 418, column: 26, scope: !846)
!978 = !DILocation(line: 418, column: 31, scope: !846)
!979 = !DILocation(line: 418, column: 5, scope: !846)
!980 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !869)
!981 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !869)
!982 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !869)
!983 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !869)
!984 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !869)
!985 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !869)
!986 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !869)
!987 = !DILocation(line: 420, column: 32, scope: !846)
!988 = !DILocation(line: 420, column: 12, scope: !846)
!989 = !DILocation(line: 420, column: 5, scope: !846)
!990 = distinct !DISubprogram(name: "clear_stream_buffers", scope: !25, file: !25, line: 505, type: !991, isLocal: true, isDefinition: true, scopeLine: 506, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!991 = !DISubroutineType(types: !992)
!992 = !{null, !326}
!993 = !DILocalVariable(name: "mms", arg: 1, scope: !990, file: !25, line: 505, type: !326)
!994 = !DILocation(line: 505, column: 46, scope: !990)
!995 = !DILocation(line: 507, column: 5, scope: !990)
!996 = !DILocation(line: 507, column: 10, scope: !990)
!997 = !DILocation(line: 507, column: 27, scope: !990)
!998 = !DILocation(line: 508, column: 24, scope: !990)
!999 = !DILocation(line: 508, column: 29, scope: !990)
!1000 = !DILocation(line: 508, column: 5, scope: !990)
!1001 = !DILocation(line: 508, column: 10, scope: !990)
!1002 = !DILocation(line: 508, column: 22, scope: !990)
!1003 = !DILocation(line: 509, column: 1, scope: !990)
!1004 = distinct !DISubprogram(name: "send_stream_selection_request", scope: !25, file: !25, line: 446, type: !614, isLocal: true, isDefinition: true, scopeLine: 447, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!1005 = !DILocalVariable(name: "b", arg: 1, scope: !1006, file: !662, line: 90, type: !665)
!1006 = distinct !DISubprogram(name: "bytestream_put_le16", scope: !662, file: !662, line: 90, type: !663, isLocal: true, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!1007 = !DILocation(line: 90, column: 246, scope: !1006, inlinedAt: !1008)
!1008 = distinct !DILocation(line: 455, column: 9, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1010, file: !25, line: 453, column: 39)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !25, line: 453, column: 5)
!1011 = distinct !DILexicalBlock(scope: !1004, file: !25, line: 453, column: 5)
!1012 = !DILocalVariable(name: "value", arg: 2, scope: !1006, file: !662, line: 90, type: !666)
!1013 = !DILocation(line: 90, column: 268, scope: !1006, inlinedAt: !1008)
!1014 = !DILocation(line: 90, column: 246, scope: !1006, inlinedAt: !1015)
!1015 = distinct !DILocation(line: 456, column: 9, scope: !1009)
!1016 = !DILocation(line: 90, column: 268, scope: !1006, inlinedAt: !1015)
!1017 = !DILocation(line: 90, column: 246, scope: !1006, inlinedAt: !1018)
!1018 = distinct !DILocation(line: 454, column: 9, scope: !1009)
!1019 = !DILocation(line: 90, column: 268, scope: !1006, inlinedAt: !1018)
!1020 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !1021)
!1021 = distinct !DILocation(line: 452, column: 5, scope: !1004)
!1022 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !1021)
!1023 = !DILocalVariable(name: "mmst", arg: 1, scope: !1004, file: !25, line: 446, type: !95)
!1024 = !DILocation(line: 446, column: 55, scope: !1004)
!1025 = !DILocalVariable(name: "i", scope: !1004, file: !25, line: 448, type: !67)
!1026 = !DILocation(line: 448, column: 9, scope: !1004)
!1027 = !DILocalVariable(name: "mms", scope: !1004, file: !25, line: 449, type: !326)
!1028 = !DILocation(line: 449, column: 17, scope: !1004)
!1029 = !DILocation(line: 449, column: 24, scope: !1004)
!1030 = !DILocation(line: 449, column: 30, scope: !1004)
!1031 = !DILocation(line: 451, column: 26, scope: !1004)
!1032 = !DILocation(line: 451, column: 5, scope: !1004)
!1033 = !DILocation(line: 452, column: 26, scope: !1004)
!1034 = !DILocation(line: 452, column: 31, scope: !1004)
!1035 = !DILocation(line: 452, column: 46, scope: !1004)
!1036 = !DILocation(line: 452, column: 51, scope: !1004)
!1037 = !DILocation(line: 452, column: 5, scope: !1004)
!1038 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !1021)
!1039 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !1021)
!1040 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !1021)
!1041 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !1021)
!1042 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !1021)
!1043 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !1021)
!1044 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !1021)
!1045 = !DILocation(line: 453, column: 10, scope: !1011)
!1046 = !DILocation(line: 453, column: 9, scope: !1011)
!1047 = !DILocation(line: 453, column: 15, scope: !1048)
!1048 = !DILexicalBlockFile(scope: !1010, file: !25, discriminator: 1)
!1049 = !DILocation(line: 453, column: 17, scope: !1048)
!1050 = !DILocation(line: 453, column: 22, scope: !1048)
!1051 = !DILocation(line: 453, column: 16, scope: !1048)
!1052 = !DILocation(line: 453, column: 5, scope: !1048)
!1053 = !DILocation(line: 454, column: 30, scope: !1009)
!1054 = !DILocation(line: 454, column: 35, scope: !1009)
!1055 = !DILocation(line: 454, column: 9, scope: !1009)
!1056 = !DILocation(line: 90, column: 316, scope: !1006, inlinedAt: !1018)
!1057 = !DILocation(line: 90, column: 315, scope: !1006, inlinedAt: !1018)
!1058 = !DILocation(line: 90, column: 305, scope: !1006, inlinedAt: !1018)
!1059 = !DILocation(line: 90, column: 304, scope: !1006, inlinedAt: !1018)
!1060 = !DILocation(line: 90, column: 310, scope: !1006, inlinedAt: !1018)
!1061 = !DILocation(line: 90, column: 313, scope: !1006, inlinedAt: !1018)
!1062 = !DILocation(line: 90, column: 327, scope: !1006, inlinedAt: !1018)
!1063 = !DILocation(line: 90, column: 330, scope: !1006, inlinedAt: !1018)
!1064 = !DILocation(line: 455, column: 30, scope: !1009)
!1065 = !DILocation(line: 455, column: 35, scope: !1009)
!1066 = !DILocation(line: 455, column: 63, scope: !1009)
!1067 = !DILocation(line: 455, column: 50, scope: !1009)
!1068 = !DILocation(line: 455, column: 55, scope: !1009)
!1069 = !DILocation(line: 455, column: 66, scope: !1009)
!1070 = !DILocation(line: 455, column: 9, scope: !1009)
!1071 = !DILocation(line: 90, column: 316, scope: !1006, inlinedAt: !1008)
!1072 = !DILocation(line: 90, column: 315, scope: !1006, inlinedAt: !1008)
!1073 = !DILocation(line: 90, column: 305, scope: !1006, inlinedAt: !1008)
!1074 = !DILocation(line: 90, column: 304, scope: !1006, inlinedAt: !1008)
!1075 = !DILocation(line: 90, column: 310, scope: !1006, inlinedAt: !1008)
!1076 = !DILocation(line: 90, column: 313, scope: !1006, inlinedAt: !1008)
!1077 = !DILocation(line: 90, column: 327, scope: !1006, inlinedAt: !1008)
!1078 = !DILocation(line: 90, column: 330, scope: !1006, inlinedAt: !1008)
!1079 = !DILocation(line: 456, column: 30, scope: !1009)
!1080 = !DILocation(line: 456, column: 35, scope: !1009)
!1081 = !DILocation(line: 456, column: 9, scope: !1009)
!1082 = !DILocation(line: 90, column: 316, scope: !1006, inlinedAt: !1015)
!1083 = !DILocation(line: 90, column: 315, scope: !1006, inlinedAt: !1015)
!1084 = !DILocation(line: 90, column: 305, scope: !1006, inlinedAt: !1015)
!1085 = !DILocation(line: 90, column: 304, scope: !1006, inlinedAt: !1015)
!1086 = !DILocation(line: 90, column: 310, scope: !1006, inlinedAt: !1015)
!1087 = !DILocation(line: 90, column: 313, scope: !1006, inlinedAt: !1015)
!1088 = !DILocation(line: 90, column: 327, scope: !1006, inlinedAt: !1015)
!1089 = !DILocation(line: 90, column: 330, scope: !1006, inlinedAt: !1015)
!1090 = !DILocation(line: 457, column: 5, scope: !1009)
!1091 = !DILocation(line: 453, column: 35, scope: !1092)
!1092 = !DILexicalBlockFile(scope: !1010, file: !25, discriminator: 2)
!1093 = !DILocation(line: 453, column: 5, scope: !1092)
!1094 = distinct !{!1094, !1095}
!1095 = !DILocation(line: 453, column: 5, scope: !1004)
!1096 = !DILocation(line: 458, column: 32, scope: !1004)
!1097 = !DILocation(line: 458, column: 12, scope: !1004)
!1098 = !DILocation(line: 458, column: 5, scope: !1004)
!1099 = distinct !DISubprogram(name: "send_media_packet_request", scope: !25, file: !25, line: 486, type: !614, isLocal: true, isDefinition: true, scopeLine: 487, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!1100 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !1101)
!1101 = distinct !DILocation(line: 493, column: 5, scope: !1099)
!1102 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !1101)
!1103 = !DILocalVariable(name: "b", arg: 1, scope: !1104, file: !662, line: 95, type: !665)
!1104 = distinct !DISubprogram(name: "bytestream_put_byte", scope: !662, file: !662, line: 95, type: !663, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!1105 = !DILocation(line: 95, column: 233, scope: !1104, inlinedAt: !1106)
!1106 = distinct !DILocation(line: 494, column: 5, scope: !1099)
!1107 = !DILocalVariable(name: "value", arg: 2, scope: !1104, file: !662, line: 95, type: !666)
!1108 = !DILocation(line: 95, column: 255, scope: !1104, inlinedAt: !1106)
!1109 = !DILocation(line: 95, column: 233, scope: !1104, inlinedAt: !1110)
!1110 = distinct !DILocation(line: 495, column: 5, scope: !1099)
!1111 = !DILocation(line: 95, column: 255, scope: !1104, inlinedAt: !1110)
!1112 = !DILocation(line: 95, column: 233, scope: !1104, inlinedAt: !1113)
!1113 = distinct !DILocation(line: 496, column: 5, scope: !1099)
!1114 = !DILocation(line: 95, column: 255, scope: !1104, inlinedAt: !1113)
!1115 = !DILocation(line: 95, column: 233, scope: !1104, inlinedAt: !1116)
!1116 = distinct !DILocation(line: 497, column: 5, scope: !1099)
!1117 = !DILocation(line: 95, column: 255, scope: !1104, inlinedAt: !1116)
!1118 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !1119)
!1119 = distinct !DILocation(line: 500, column: 5, scope: !1099)
!1120 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !1119)
!1121 = !DILocation(line: 88, column: 246, scope: !661, inlinedAt: !1122)
!1122 = distinct !DILocation(line: 492, column: 5, scope: !1099)
!1123 = !DILocation(line: 88, column: 268, scope: !661, inlinedAt: !1122)
!1124 = !DILocalVariable(name: "b", arg: 1, scope: !1125, file: !662, line: 87, type: !665)
!1125 = distinct !DISubprogram(name: "bytestream_put_le64", scope: !662, file: !662, line: 87, type: !1126, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{null, !665, !1128}
!1128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!1129 = !DILocation(line: 87, column: 242, scope: !1125, inlinedAt: !1130)
!1130 = distinct !DILocation(line: 491, column: 5, scope: !1099)
!1131 = !DILocalVariable(name: "value", arg: 2, scope: !1125, file: !662, line: 87, type: !1128)
!1132 = !DILocation(line: 87, column: 260, scope: !1125, inlinedAt: !1130)
!1133 = !DILocalVariable(name: "mmst", arg: 1, scope: !1099, file: !25, line: 486, type: !95)
!1134 = !DILocation(line: 486, column: 51, scope: !1099)
!1135 = !DILocalVariable(name: "mms", scope: !1099, file: !25, line: 488, type: !326)
!1136 = !DILocation(line: 488, column: 17, scope: !1099)
!1137 = !DILocation(line: 488, column: 24, scope: !1099)
!1138 = !DILocation(line: 488, column: 30, scope: !1099)
!1139 = !DILocation(line: 489, column: 26, scope: !1099)
!1140 = !DILocation(line: 489, column: 5, scope: !1099)
!1141 = !DILocation(line: 490, column: 29, scope: !1099)
!1142 = !DILocation(line: 490, column: 5, scope: !1099)
!1143 = !DILocation(line: 491, column: 26, scope: !1099)
!1144 = !DILocation(line: 491, column: 31, scope: !1099)
!1145 = !DILocation(line: 491, column: 5, scope: !1099)
!1146 = !DILocation(line: 87, column: 308, scope: !1125, inlinedAt: !1130)
!1147 = !DILocation(line: 87, column: 297, scope: !1125, inlinedAt: !1130)
!1148 = !DILocation(line: 87, column: 296, scope: !1125, inlinedAt: !1130)
!1149 = !DILocation(line: 87, column: 302, scope: !1125, inlinedAt: !1130)
!1150 = !DILocation(line: 87, column: 305, scope: !1125, inlinedAt: !1130)
!1151 = !DILocation(line: 87, column: 319, scope: !1125, inlinedAt: !1130)
!1152 = !DILocation(line: 87, column: 322, scope: !1125, inlinedAt: !1130)
!1153 = !DILocation(line: 492, column: 26, scope: !1099)
!1154 = !DILocation(line: 492, column: 31, scope: !1099)
!1155 = !DILocation(line: 492, column: 5, scope: !1099)
!1156 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !1122)
!1157 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !1122)
!1158 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !1122)
!1159 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !1122)
!1160 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !1122)
!1161 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !1122)
!1162 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !1122)
!1163 = !DILocation(line: 493, column: 26, scope: !1099)
!1164 = !DILocation(line: 493, column: 31, scope: !1099)
!1165 = !DILocation(line: 493, column: 5, scope: !1099)
!1166 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !1101)
!1167 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !1101)
!1168 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !1101)
!1169 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !1101)
!1170 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !1101)
!1171 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !1101)
!1172 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !1101)
!1173 = !DILocation(line: 494, column: 26, scope: !1099)
!1174 = !DILocation(line: 494, column: 31, scope: !1099)
!1175 = !DILocation(line: 494, column: 5, scope: !1099)
!1176 = !DILocation(line: 95, column: 292, scope: !1177, inlinedAt: !1106)
!1177 = !DILexicalBlockFile(scope: !1178, file: !662, discriminator: 1)
!1178 = distinct !DILexicalBlock(scope: !1104, file: !662, line: 95, column: 267)
!1179 = !DILocation(line: 95, column: 291, scope: !1177, inlinedAt: !1106)
!1180 = !DILocation(line: 95, column: 282, scope: !1177, inlinedAt: !1106)
!1181 = !DILocation(line: 95, column: 281, scope: !1177, inlinedAt: !1106)
!1182 = !DILocation(line: 95, column: 289, scope: !1177, inlinedAt: !1106)
!1183 = !DILocation(line: 95, column: 314, scope: !1184, inlinedAt: !1106)
!1184 = !DILexicalBlockFile(scope: !1104, file: !662, discriminator: 2)
!1185 = !DILocation(line: 95, column: 317, scope: !1184, inlinedAt: !1106)
!1186 = !DILocation(line: 495, column: 26, scope: !1099)
!1187 = !DILocation(line: 495, column: 31, scope: !1099)
!1188 = !DILocation(line: 495, column: 5, scope: !1099)
!1189 = !DILocation(line: 95, column: 292, scope: !1177, inlinedAt: !1110)
!1190 = !DILocation(line: 95, column: 291, scope: !1177, inlinedAt: !1110)
!1191 = !DILocation(line: 95, column: 282, scope: !1177, inlinedAt: !1110)
!1192 = !DILocation(line: 95, column: 281, scope: !1177, inlinedAt: !1110)
!1193 = !DILocation(line: 95, column: 289, scope: !1177, inlinedAt: !1110)
!1194 = !DILocation(line: 95, column: 314, scope: !1184, inlinedAt: !1110)
!1195 = !DILocation(line: 95, column: 317, scope: !1184, inlinedAt: !1110)
!1196 = !DILocation(line: 496, column: 26, scope: !1099)
!1197 = !DILocation(line: 496, column: 31, scope: !1099)
!1198 = !DILocation(line: 496, column: 5, scope: !1099)
!1199 = !DILocation(line: 95, column: 292, scope: !1177, inlinedAt: !1113)
!1200 = !DILocation(line: 95, column: 291, scope: !1177, inlinedAt: !1113)
!1201 = !DILocation(line: 95, column: 282, scope: !1177, inlinedAt: !1113)
!1202 = !DILocation(line: 95, column: 281, scope: !1177, inlinedAt: !1113)
!1203 = !DILocation(line: 95, column: 289, scope: !1177, inlinedAt: !1113)
!1204 = !DILocation(line: 95, column: 314, scope: !1184, inlinedAt: !1113)
!1205 = !DILocation(line: 95, column: 317, scope: !1184, inlinedAt: !1113)
!1206 = !DILocation(line: 497, column: 26, scope: !1099)
!1207 = !DILocation(line: 497, column: 31, scope: !1099)
!1208 = !DILocation(line: 497, column: 5, scope: !1099)
!1209 = !DILocation(line: 95, column: 292, scope: !1177, inlinedAt: !1116)
!1210 = !DILocation(line: 95, column: 291, scope: !1177, inlinedAt: !1116)
!1211 = !DILocation(line: 95, column: 282, scope: !1177, inlinedAt: !1116)
!1212 = !DILocation(line: 95, column: 281, scope: !1177, inlinedAt: !1116)
!1213 = !DILocation(line: 95, column: 289, scope: !1177, inlinedAt: !1116)
!1214 = !DILocation(line: 95, column: 314, scope: !1184, inlinedAt: !1116)
!1215 = !DILocation(line: 95, column: 317, scope: !1184, inlinedAt: !1116)
!1216 = !DILocation(line: 499, column: 5, scope: !1099)
!1217 = !DILocation(line: 499, column: 11, scope: !1099)
!1218 = !DILocation(line: 499, column: 20, scope: !1099)
!1219 = !DILocation(line: 500, column: 26, scope: !1099)
!1220 = !DILocation(line: 500, column: 31, scope: !1099)
!1221 = !DILocation(line: 500, column: 46, scope: !1099)
!1222 = !DILocation(line: 500, column: 52, scope: !1099)
!1223 = !DILocation(line: 500, column: 5, scope: !1099)
!1224 = !DILocation(line: 88, column: 316, scope: !661, inlinedAt: !1119)
!1225 = !DILocation(line: 88, column: 305, scope: !661, inlinedAt: !1119)
!1226 = !DILocation(line: 88, column: 304, scope: !661, inlinedAt: !1119)
!1227 = !DILocation(line: 88, column: 310, scope: !661, inlinedAt: !1119)
!1228 = !DILocation(line: 88, column: 313, scope: !661, inlinedAt: !1119)
!1229 = !DILocation(line: 88, column: 327, scope: !661, inlinedAt: !1119)
!1230 = !DILocation(line: 88, column: 330, scope: !661, inlinedAt: !1119)
!1231 = !DILocation(line: 501, column: 32, scope: !1099)
!1232 = !DILocation(line: 501, column: 12, scope: !1099)
!1233 = !DILocation(line: 501, column: 5, scope: !1099)
!1234 = distinct !DISubprogram(name: "get_tcp_server_response", scope: !25, file: !25, line: 245, type: !1235, isLocal: true, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!617, !95}
!1237 = !DILocalVariable(name: "mmst", arg: 1, scope: !1234, file: !25, line: 245, type: !95)
!1238 = !DILocation(line: 245, column: 61, scope: !1234)
!1239 = !DILocalVariable(name: "read_result", scope: !1234, file: !25, line: 247, type: !67)
!1240 = !DILocation(line: 247, column: 9, scope: !1234)
!1241 = !DILocalVariable(name: "packet_type", scope: !1234, file: !25, line: 248, type: !617)
!1242 = !DILocation(line: 248, column: 21, scope: !1234)
!1243 = !DILocalVariable(name: "mms", scope: !1234, file: !25, line: 249, type: !326)
!1244 = !DILocation(line: 249, column: 17, scope: !1234)
!1245 = !DILocation(line: 249, column: 24, scope: !1234)
!1246 = !DILocation(line: 249, column: 30, scope: !1234)
!1247 = !DILocation(line: 250, column: 5, scope: !1234)
!1248 = !DILocation(line: 251, column: 43, scope: !1249)
!1249 = distinct !DILexicalBlock(scope: !1250, file: !25, line: 250, column: 13)
!1250 = distinct !DILexicalBlock(scope: !1251, file: !25, line: 250, column: 5)
!1251 = distinct !DILexicalBlock(scope: !1234, file: !25, line: 250, column: 5)
!1252 = !DILocation(line: 251, column: 48, scope: !1249)
!1253 = !DILocation(line: 251, column: 56, scope: !1249)
!1254 = !DILocation(line: 251, column: 61, scope: !1249)
!1255 = !DILocation(line: 251, column: 23, scope: !1249)
!1256 = !DILocation(line: 251, column: 21, scope: !1249)
!1257 = !DILocation(line: 252, column: 13, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1249, file: !25, line: 252, column: 13)
!1259 = !DILocation(line: 252, column: 25, scope: !1258)
!1260 = !DILocation(line: 252, column: 13, scope: !1249)
!1261 = !DILocation(line: 253, column: 16, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1263, file: !25, line: 253, column: 16)
!1263 = distinct !DILexicalBlock(scope: !1258, file: !25, line: 252, column: 31)
!1264 = !DILocation(line: 253, column: 28, scope: !1262)
!1265 = !DILocation(line: 253, column: 16, scope: !1263)
!1266 = !DILocation(line: 256, column: 24, scope: !1267)
!1267 = distinct !DILexicalBlock(scope: !1262, file: !25, line: 253, column: 33)
!1268 = !DILocation(line: 256, column: 49, scope: !1267)
!1269 = !DILocation(line: 256, column: 47, scope: !1267)
!1270 = !DILocation(line: 256, column: 37, scope: !1267)
!1271 = !DILocation(line: 254, column: 17, scope: !1267)
!1272 = !DILocation(line: 257, column: 29, scope: !1267)
!1273 = !DILocation(line: 258, column: 13, scope: !1267)
!1274 = !DILocation(line: 259, column: 17, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1262, file: !25, line: 258, column: 20)
!1276 = !DILocation(line: 261, column: 29, scope: !1275)
!1277 = !DILocation(line: 263, column: 20, scope: !1263)
!1278 = !DILocation(line: 263, column: 13, scope: !1263)
!1279 = !DILocation(line: 267, column: 44, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1249, file: !25, line: 267, column: 12)
!1281 = !DILocation(line: 267, column: 49, scope: !1280)
!1282 = !DILocation(line: 267, column: 59, scope: !1280)
!1283 = !DILocation(line: 267, column: 66, scope: !1280)
!1284 = !DILocation(line: 267, column: 68, scope: !1280)
!1285 = !DILocation(line: 267, column: 12, scope: !1249)
!1286 = !DILocalVariable(name: "length_remaining", scope: !1287, file: !25, line: 268, type: !67)
!1287 = distinct !DILexicalBlock(scope: !1280, file: !25, line: 267, column: 82)
!1288 = !DILocation(line: 268, column: 17, scope: !1287)
!1289 = !DILocalVariable(name: "hr", scope: !1287, file: !25, line: 268, type: !67)
!1290 = !DILocation(line: 268, column: 35, scope: !1287)
!1291 = !DILocation(line: 270, column: 35, scope: !1287)
!1292 = !DILocation(line: 270, column: 40, scope: !1287)
!1293 = !DILocation(line: 270, column: 13, scope: !1287)
!1294 = !DILocation(line: 270, column: 19, scope: !1287)
!1295 = !DILocation(line: 270, column: 33, scope: !1287)
!1296 = !DILocation(line: 271, column: 46, scope: !1287)
!1297 = !DILocation(line: 271, column: 51, scope: !1287)
!1298 = !DILocation(line: 271, column: 59, scope: !1287)
!1299 = !DILocation(line: 271, column: 64, scope: !1287)
!1300 = !DILocation(line: 271, column: 73, scope: !1287)
!1301 = !DILocation(line: 271, column: 26, scope: !1287)
!1302 = !DILocation(line: 271, column: 24, scope: !1287)
!1303 = !DILocation(line: 272, column: 16, scope: !1304)
!1304 = distinct !DILexicalBlock(scope: !1287, file: !25, line: 272, column: 16)
!1305 = !DILocation(line: 272, column: 28, scope: !1304)
!1306 = !DILocation(line: 272, column: 16, scope: !1287)
!1307 = !DILocation(line: 275, column: 24, scope: !1308)
!1308 = distinct !DILexicalBlock(scope: !1304, file: !25, line: 272, column: 34)
!1309 = !DILocation(line: 276, column: 24, scope: !1308)
!1310 = !DILocation(line: 276, column: 36, scope: !1308)
!1311 = !DILocation(line: 276, column: 54, scope: !1312)
!1312 = !DILexicalBlockFile(scope: !1308, file: !25, discriminator: 1)
!1313 = !DILocation(line: 276, column: 52, scope: !1312)
!1314 = !DILocation(line: 276, column: 42, scope: !1312)
!1315 = !DILocation(line: 276, column: 24, scope: !1312)
!1316 = !DILocation(line: 276, column: 24, scope: !1317)
!1317 = !DILexicalBlockFile(scope: !1308, file: !25, discriminator: 2)
!1318 = !DILocation(line: 276, column: 24, scope: !1319)
!1319 = !DILexicalBlockFile(scope: !1308, file: !25, discriminator: 3)
!1320 = !DILocation(line: 273, column: 17, scope: !1308)
!1321 = !DILocation(line: 278, column: 24, scope: !1308)
!1322 = !DILocation(line: 278, column: 36, scope: !1308)
!1323 = !DILocation(line: 278, column: 42, scope: !1312)
!1324 = !DILocation(line: 278, column: 24, scope: !1312)
!1325 = !DILocation(line: 278, column: 24, scope: !1317)
!1326 = !DILocation(line: 278, column: 24, scope: !1319)
!1327 = !DILocation(line: 278, column: 17, scope: !1319)
!1328 = !DILocation(line: 281, column: 63, scope: !1287)
!1329 = !DILocation(line: 281, column: 68, scope: !1287)
!1330 = !DILocation(line: 281, column: 77, scope: !1287)
!1331 = !DILocation(line: 281, column: 83, scope: !1287)
!1332 = !DILocation(line: 281, column: 86, scope: !1287)
!1333 = !DILocation(line: 281, column: 29, scope: !1287)
!1334 = !DILocation(line: 282, column: 57, scope: !1287)
!1335 = !DILocation(line: 282, column: 13, scope: !1287)
!1336 = !DILocation(line: 284, column: 17, scope: !1337)
!1337 = distinct !DILexicalBlock(scope: !1287, file: !25, line: 284, column: 17)
!1338 = !DILocation(line: 284, column: 34, scope: !1337)
!1339 = !DILocation(line: 285, column: 17, scope: !1337)
!1340 = !DILocation(line: 285, column: 20, scope: !1341)
!1341 = !DILexicalBlockFile(scope: !1337, file: !25, discriminator: 1)
!1342 = !DILocation(line: 285, column: 37, scope: !1341)
!1343 = !DILocation(line: 284, column: 17, scope: !1344)
!1344 = !DILexicalBlockFile(scope: !1287, file: !25, discriminator: 1)
!1345 = !DILocation(line: 288, column: 24, scope: !1346)
!1346 = distinct !DILexicalBlock(scope: !1337, file: !25, line: 285, column: 68)
!1347 = !DILocation(line: 286, column: 17, scope: !1346)
!1348 = !DILocation(line: 289, column: 17, scope: !1346)
!1349 = !DILocation(line: 291, column: 47, scope: !1287)
!1350 = !DILocation(line: 291, column: 52, scope: !1287)
!1351 = !DILocation(line: 291, column: 60, scope: !1287)
!1352 = !DILocation(line: 291, column: 65, scope: !1287)
!1353 = !DILocation(line: 291, column: 75, scope: !1287)
!1354 = !DILocation(line: 292, column: 45, scope: !1287)
!1355 = !DILocation(line: 291, column: 27, scope: !1287)
!1356 = !DILocation(line: 291, column: 25, scope: !1287)
!1357 = !DILocation(line: 293, column: 17, scope: !1358)
!1358 = distinct !DILexicalBlock(scope: !1287, file: !25, line: 293, column: 17)
!1359 = !DILocation(line: 293, column: 32, scope: !1358)
!1360 = !DILocation(line: 293, column: 29, scope: !1358)
!1361 = !DILocation(line: 293, column: 17, scope: !1287)
!1362 = !DILocation(line: 296, column: 24, scope: !1363)
!1363 = distinct !DILexicalBlock(scope: !1358, file: !25, line: 293, column: 50)
!1364 = !DILocation(line: 296, column: 42, scope: !1363)
!1365 = !DILocation(line: 297, column: 24, scope: !1363)
!1366 = !DILocation(line: 297, column: 36, scope: !1363)
!1367 = !DILocation(line: 297, column: 54, scope: !1368)
!1368 = !DILexicalBlockFile(scope: !1363, file: !25, discriminator: 1)
!1369 = !DILocation(line: 297, column: 52, scope: !1368)
!1370 = !DILocation(line: 297, column: 42, scope: !1368)
!1371 = !DILocation(line: 297, column: 24, scope: !1368)
!1372 = !DILocation(line: 297, column: 24, scope: !1373)
!1373 = !DILexicalBlockFile(scope: !1363, file: !25, discriminator: 2)
!1374 = !DILocation(line: 297, column: 24, scope: !1375)
!1375 = !DILexicalBlockFile(scope: !1363, file: !25, discriminator: 3)
!1376 = !DILocation(line: 294, column: 17, scope: !1363)
!1377 = !DILocation(line: 299, column: 24, scope: !1363)
!1378 = !DILocation(line: 299, column: 36, scope: !1363)
!1379 = !DILocation(line: 299, column: 42, scope: !1368)
!1380 = !DILocation(line: 299, column: 24, scope: !1368)
!1381 = !DILocation(line: 299, column: 24, scope: !1373)
!1382 = !DILocation(line: 299, column: 24, scope: !1375)
!1383 = !DILocation(line: 299, column: 17, scope: !1375)
!1384 = !DILocation(line: 301, column: 58, scope: !1287)
!1385 = !DILocation(line: 301, column: 63, scope: !1287)
!1386 = !DILocation(line: 301, column: 72, scope: !1287)
!1387 = !DILocation(line: 301, column: 79, scope: !1287)
!1388 = !DILocation(line: 301, column: 26, scope: !1287)
!1389 = !DILocation(line: 301, column: 24, scope: !1287)
!1390 = !DILocation(line: 302, column: 17, scope: !1391)
!1391 = distinct !DILexicalBlock(scope: !1287, file: !25, line: 302, column: 17)
!1392 = !DILocation(line: 302, column: 29, scope: !1391)
!1393 = !DILocation(line: 302, column: 35, scope: !1391)
!1394 = !DILocation(line: 302, column: 76, scope: !1395)
!1395 = !DILexicalBlockFile(scope: !1391, file: !25, discriminator: 1)
!1396 = !DILocation(line: 302, column: 81, scope: !1395)
!1397 = !DILocation(line: 302, column: 91, scope: !1395)
!1398 = !DILocation(line: 302, column: 99, scope: !1395)
!1399 = !DILocation(line: 302, column: 42, scope: !1395)
!1400 = !DILocation(line: 302, column: 17, scope: !1395)
!1401 = !DILocation(line: 304, column: 102, scope: !1402)
!1402 = distinct !DILexicalBlock(scope: !1391, file: !25, line: 302, column: 104)
!1403 = !DILocation(line: 304, column: 115, scope: !1402)
!1404 = !DILocation(line: 303, column: 17, scope: !1402)
!1405 = !DILocation(line: 305, column: 17, scope: !1402)
!1406 = !DILocation(line: 307, column: 9, scope: !1287)
!1407 = !DILocalVariable(name: "length_remaining", scope: !1408, file: !25, line: 308, type: !67)
!1408 = distinct !DILexicalBlock(scope: !1280, file: !25, line: 307, column: 16)
!1409 = !DILocation(line: 308, column: 17, scope: !1408)
!1410 = !DILocalVariable(name: "packet_id_type", scope: !1408, file: !25, line: 309, type: !67)
!1411 = !DILocation(line: 309, column: 17, scope: !1408)
!1412 = !DILocalVariable(name: "tmp", scope: !1408, file: !25, line: 310, type: !67)
!1413 = !DILocation(line: 310, column: 17, scope: !1408)
!1414 = !DILocation(line: 314, column: 51, scope: !1408)
!1415 = !DILocation(line: 314, column: 56, scope: !1408)
