; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--udp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--udp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!17 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!18 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!19 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!20 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!21 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!22 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!23 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!24 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 29, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!28 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!29 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!30 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!31 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!32 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!33 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!34 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!35 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!36 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!37 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!38 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!39 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!40 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!41 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!42 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!43 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!44 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!45 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !47, line: 24, size: 32, align: 32, elements: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57}
!49 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!50 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!51 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!52 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!53 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!54 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!55 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!56 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!57 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !59, line: 40, size: 32, align: 32, elements: !60)
!59 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!61 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!62 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!63 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!64 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!65 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!66 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!67 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!68 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!69 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!70 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!71 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!72 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!73 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!74 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!75 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!76 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!77 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!78 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!79 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!80 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!81 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!82 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!83 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!84 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!85 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!86 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 199, size: 32, align: 32, elements: !89)
!88 = !DIFile(filename: "/usr/include/pthread.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!89 = !{!90, !91}
!90 = !DIEnumerator(name: "PTHREAD_CANCEL_ENABLE", value: 0)
!91 = !DIEnumerator(name: "PTHREAD_CANCEL_DISABLE", value: 1)
!92 = !{!93, !106, !107, !109, !121, !129, !153, !155, !161, !162}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !95, line: 153, size: 128, align: 16, elements: !96)
!95 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!96 = !{!97, !101}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !94, file: !95, line: 155, baseType: !98, size: 16, align: 16)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !99, line: 28, baseType: !100)
!99 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!100 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !94, file: !95, line: 156, baseType: !102, size: 112, align: 8, offset: 16)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 112, align: 8, elements: !104)
!103 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!104 = !{!105}
!105 = !DISubrange(count: 14)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !59, line: 239, size: 128, align: 32, elements: !111)
!111 = !{!112, !113, !117, !124}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !110, file: !59, line: 241, baseType: !98, size: 16, align: 16)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !110, file: !59, line: 242, baseType: !114, size: 16, align: 16, offset: 16)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !59, line: 119, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !116, line: 49, baseType: !100)
!116 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!117 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !110, file: !59, line: 243, baseType: !118, size: 32, align: 32, offset: 32)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !59, line: 31, size: 32, align: 32, elements: !119)
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !118, file: !59, line: 33, baseType: !121, size: 32, align: 32)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !59, line: 30, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !116, line: 51, baseType: !123)
!123 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !110, file: !59, line: 246, baseType: !125, size: 64, align: 8, offset: 64)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 64, align: 8, elements: !127)
!126 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!127 = !{!128}
!128 = !DISubrange(count: 8)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !59, line: 254, size: 224, align: 32, elements: !131)
!131 = !{!132, !133, !134, !135, !152}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !130, file: !59, line: 256, baseType: !98, size: 16, align: 16)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !130, file: !59, line: 257, baseType: !114, size: 16, align: 16, offset: 16)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !130, file: !59, line: 258, baseType: !122, size: 32, align: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !130, file: !59, line: 259, baseType: !136, size: 128, align: 32, offset: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !59, line: 211, size: 128, align: 32, elements: !137)
!137 = !{!138}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !136, file: !59, line: 220, baseType: !139, size: 128, align: 32)
!139 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !136, file: !59, line: 213, size: 128, align: 32, elements: !140)
!140 = !{!141, !146, !148}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !139, file: !59, line: 215, baseType: !142, size: 128, align: 8)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 128, align: 8, elements: !144)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !116, line: 48, baseType: !126)
!144 = !{!145}
!145 = !DISubrange(count: 16)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !139, file: !59, line: 217, baseType: !147, size: 128, align: 16)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 128, align: 16, elements: !127)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !139, file: !59, line: 218, baseType: !149, size: 128, align: 32)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 128, align: 32, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 4)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !130, file: !59, line: 260, baseType: !122, size: 32, align: 32, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !116, line: 40, baseType: !154)
!154 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !158, line: 221, size: 32, align: 8, elements: !159)
!158 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !157, file: !158, line: 221, baseType: !122, size: 32, align: 32)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!163 = !{!164, !368, !369, !370, !376}
!164 = distinct !DIGlobalVariable(name: "ff_udp_protocol", scope: !0, file: !165, line: 1089, type: !166, isLocal: false, isDefinition: true, variable: %struct.URLProtocol* @ff_udp_protocol)
!165 = !DIFile(filename: "libavformat/udp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !168, line: 100, baseType: !169)
!168 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !168, line: 54, size: 1600, align: 64, elements: !170)
!170 = !{!171, !174, !286, !295, !300, !304, !309, !315, !319, !320, !324, !328, !329, !335, !336, !337, !338, !339, !340, !341, !342, !361, !362, !363, !367}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !169, file: !168, line: 55, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !169, file: !168, line: 56, baseType: !175, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!178, !179, !172, !178}
!178 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !168, line: 52, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !168, line: 38, size: 768, align: 64, elements: !182)
!182 = !{!183, !262, !265, !266, !268, !269, !270, !271, !272, !282, !283, !284, !285}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !181, file: !168, line: 39, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !188)
!188 = !{!189, !190, !194, !221, !222, !223, !224, !228, !234, !236, !240}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !187, file: !26, line: 72, baseType: !172, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !187, file: !26, line: 78, baseType: !191, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!172, !106}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !187, file: !26, line: 85, baseType: !195, size: 64, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !198)
!198 = !{!199, !200, !201, !202, !203, !217, !218, !219, !220}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !197, file: !4, line: 247, baseType: !172, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !197, file: !4, line: 253, baseType: !172, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !197, file: !4, line: 259, baseType: !178, size: 32, align: 32, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !197, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !197, file: !4, line: 271, baseType: !204, size: 64, align: 64, offset: 192)
!204 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !197, file: !4, line: 265, size: 64, align: 64, elements: !205)
!205 = !{!206, !207, !209, !210}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !204, file: !4, line: 266, baseType: !153, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !204, file: !4, line: 267, baseType: !208, size: 64, align: 64)
!208 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !204, file: !4, line: 268, baseType: !172, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !204, file: !4, line: 270, baseType: !211, size: 64, align: 32)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !212, line: 61, baseType: !213)
!212 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !212, line: 58, size: 64, align: 32, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !213, file: !212, line: 59, baseType: !178, size: 32, align: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !213, file: !212, line: 60, baseType: !178, size: 32, align: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !197, file: !4, line: 272, baseType: !208, size: 64, align: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !197, file: !4, line: 273, baseType: !208, size: 64, align: 64, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !197, file: !4, line: 275, baseType: !178, size: 32, align: 32, offset: 384)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !197, file: !4, line: 300, baseType: !172, size: 64, align: 64, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !187, file: !26, line: 93, baseType: !178, size: 32, align: 32, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !187, file: !26, line: 99, baseType: !178, size: 32, align: 32, offset: 224)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !187, file: !26, line: 108, baseType: !178, size: 32, align: 32, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !187, file: !26, line: 113, baseType: !225, size: 64, align: 64, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!106, !106, !106}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !187, file: !26, line: 123, baseType: !229, size: 64, align: 64, offset: 384)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!232, !232}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !187, file: !26, line: 130, baseType: !235, size: 32, align: 32, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !187, file: !26, line: 136, baseType: !237, size: 64, align: 64, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!235, !106}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !187, file: !26, line: 142, baseType: !241, size: 64, align: 64, offset: 576)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!178, !244, !106, !172, !178}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !247)
!247 = !{!248, !260, !261}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !246, file: !4, line: 360, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !253)
!253 = !{!254, !255, !256, !257, !258, !259}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !252, file: !4, line: 307, baseType: !172, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !252, file: !4, line: 313, baseType: !208, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !252, file: !4, line: 313, baseType: !208, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !252, file: !4, line: 318, baseType: !208, size: 64, align: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !252, file: !4, line: 318, baseType: !208, size: 64, align: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !252, file: !4, line: 323, baseType: !178, size: 32, align: 32, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !246, file: !4, line: 364, baseType: !178, size: 32, align: 32, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !246, file: !4, line: 368, baseType: !178, size: 32, align: 32, offset: 96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !181, file: !168, line: 40, baseType: !263, size: 64, align: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !181, file: !168, line: 41, baseType: !106, size: 64, align: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !181, file: !168, line: 42, baseType: !267, size: 64, align: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !181, file: !168, line: 43, baseType: !178, size: 32, align: 32, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !181, file: !168, line: 44, baseType: !178, size: 32, align: 32, offset: 288)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !181, file: !168, line: 45, baseType: !178, size: 32, align: 32, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !181, file: !168, line: 46, baseType: !178, size: 32, align: 32, offset: 352)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !181, file: !168, line: 47, baseType: !273, size: 128, align: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !274, line: 61, baseType: !275)
!274 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !274, line: 58, size: 128, align: 64, elements: !276)
!276 = !{!277, !281}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !275, file: !274, line: 59, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!178, !106}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !275, file: !274, line: 60, baseType: !106, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !181, file: !168, line: 48, baseType: !153, size: 64, align: 64, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !181, file: !168, line: 49, baseType: !172, size: 64, align: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !181, file: !168, line: 50, baseType: !172, size: 64, align: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !181, file: !168, line: 51, baseType: !178, size: 32, align: 32, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !169, file: !168, line: 62, baseType: !287, size: 64, align: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!178, !179, !172, !178, !290}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !293, line: 86, baseType: !294)
!293 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !293, line: 86, flags: DIFlagFwdDecl)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !169, file: !168, line: 63, baseType: !296, size: 64, align: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!178, !179, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !169, file: !168, line: 64, baseType: !301, size: 64, align: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!178, !179}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !169, file: !168, line: 78, baseType: !305, size: 64, align: 64, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!178, !179, !308, !178}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !169, file: !168, line: 79, baseType: !310, size: 64, align: 64, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!178, !179, !313, !178}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !169, file: !168, line: 80, baseType: !316, size: 64, align: 64, offset: 448)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!153, !179, !153, !178}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !169, file: !168, line: 81, baseType: !301, size: 64, align: 64, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !169, file: !168, line: 82, baseType: !321, size: 64, align: 64, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!178, !179, !178}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !169, file: !168, line: 83, baseType: !325, size: 64, align: 64, offset: 640)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!153, !179, !178, !153, !178}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !169, file: !168, line: 85, baseType: !301, size: 64, align: 64, offset: 704)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !169, file: !168, line: 86, baseType: !330, size: 64, align: 64, offset: 768)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!178, !179, !333, !334}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !169, file: !168, line: 88, baseType: !301, size: 64, align: 64, offset: 832)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !169, file: !168, line: 89, baseType: !321, size: 64, align: 64, offset: 896)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !169, file: !168, line: 90, baseType: !178, size: 32, align: 32, offset: 960)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !169, file: !168, line: 91, baseType: !184, size: 64, align: 64, offset: 1024)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !169, file: !168, line: 92, baseType: !178, size: 32, align: 32, offset: 1088)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !169, file: !168, line: 93, baseType: !321, size: 64, align: 64, offset: 1152)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !169, file: !168, line: 94, baseType: !301, size: 64, align: 64, offset: 1216)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !169, file: !168, line: 95, baseType: !343, size: 64, align: 64, offset: 1280)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!178, !179, !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !274, line: 101, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !274, line: 86, size: 576, align: 64, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358, !359, !360}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !349, file: !274, line: 87, baseType: !267, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !349, file: !274, line: 88, baseType: !178, size: 32, align: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !349, file: !274, line: 89, baseType: !178, size: 32, align: 32, offset: 96)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !349, file: !274, line: 91, baseType: !153, size: 64, align: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !349, file: !274, line: 92, baseType: !153, size: 64, align: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !349, file: !274, line: 94, baseType: !153, size: 64, align: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !349, file: !274, line: 96, baseType: !153, size: 64, align: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !349, file: !274, line: 98, baseType: !153, size: 64, align: 64, offset: 384)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !349, file: !274, line: 99, baseType: !153, size: 64, align: 64, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !349, file: !274, line: 100, baseType: !153, size: 64, align: 64, offset: 512)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !169, file: !168, line: 96, baseType: !301, size: 64, align: 64, offset: 1344)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !169, file: !168, line: 97, baseType: !301, size: 64, align: 64, offset: 1408)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !169, file: !168, line: 98, baseType: !364, size: 64, align: 64, offset: 1472)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!178, !179, !179}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !169, file: !168, line: 99, baseType: !172, size: 64, align: 64, offset: 1536)
!368 = distinct !DIGlobalVariable(name: "ff_udplite_protocol", scope: !0, file: !165, line: 1101, type: !166, isLocal: false, isDefinition: true, variable: %struct.URLProtocol* @ff_udplite_protocol)
!369 = distinct !DIGlobalVariable(name: "udp_class", scope: !0, file: !165, line: 141, type: !185, isLocal: true, isDefinition: true, variable: %struct.AVClass* @udp_class)
!370 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !165, line: 119, type: !371, isLocal: true, isDefinition: true, variable: <{ %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption }>* @options)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 9728, align: 64, elements: !374)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !197)
!374 = !{!375}
!375 = !DISubrange(count: 19)
!376 = distinct !DIGlobalVariable(name: "udplite_context_class", scope: !0, file: !165, line: 148, type: !185, isLocal: true, isDefinition: true, variable: %struct.AVClass* @udplite_context_class)
!377 = !{i32 2, !"Dwarf Version", i32 4}
!378 = !{i32 2, !"Debug Info Version", i32 3}
!379 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!380 = distinct !DISubprogram(name: "ff_udp_set_remote_url", scope: !165, file: !165, line: 400, type: !381, isLocal: false, isDefinition: true, scopeLine: 401, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !383)
!381 = !DISubroutineType(types: !382)
!382 = !{!178, !179, !172}
!383 = !{}
!384 = !DILocalVariable(name: "h", arg: 1, scope: !380, file: !165, line: 400, type: !179)
!385 = !DIExpression()
!386 = !DILocation(line: 400, column: 39, scope: !380)
!387 = !DILocalVariable(name: "uri", arg: 2, scope: !380, file: !165, line: 400, type: !172)
!388 = !DILocation(line: 400, column: 54, scope: !380)
!389 = !DILocalVariable(name: "s", scope: !380, file: !165, line: 402, type: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "UDPContext", file: !165, line: 114, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UDPContext", file: !165, line: 77, size: 528512, align: 64, elements: !393)
!393 = !{!394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !415, !416, !417, !418, !430, !431, !432, !433, !434, !437, !464, !486, !487, !491, !492, !493, !494, !495, !496, !497}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !392, file: !165, line: 78, baseType: !184, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "udp_fd", scope: !392, file: !165, line: 79, baseType: !178, size: 32, align: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !392, file: !165, line: 80, baseType: !178, size: 32, align: 32, offset: 96)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "udplite_coverage", scope: !392, file: !165, line: 81, baseType: !178, size: 32, align: 32, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !392, file: !165, line: 82, baseType: !178, size: 32, align: 32, offset: 160)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !392, file: !165, line: 83, baseType: !178, size: 32, align: 32, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "is_multicast", scope: !392, file: !165, line: 84, baseType: !178, size: 32, align: 32, offset: 224)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "is_broadcast", scope: !392, file: !165, line: 85, baseType: !178, size: 32, align: 32, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !392, file: !165, line: 86, baseType: !178, size: 32, align: 32, offset: 288)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_socket", scope: !392, file: !165, line: 87, baseType: !178, size: 32, align: 32, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "overrun_nonfatal", scope: !392, file: !165, line: 88, baseType: !178, size: 32, align: 32, offset: 352)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "dest_addr", scope: !392, file: !165, line: 89, baseType: !406, size: 1024, align: 64, offset: 384)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !95, line: 166, size: 1024, align: 64, elements: !407)
!407 = !{!408, !409, !413}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !406, file: !95, line: 168, baseType: !98, size: 16, align: 16)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !406, file: !95, line: 169, baseType: !410, size: 944, align: 8, offset: 16)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 944, align: 8, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 118)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !406, file: !95, line: 170, baseType: !414, size: 64, align: 64, offset: 960)
!414 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dest_addr_len", scope: !392, file: !165, line: 90, baseType: !178, size: 32, align: 32, offset: 1408)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !392, file: !165, line: 91, baseType: !178, size: 32, align: 32, offset: 1440)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "circular_buffer_size", scope: !392, file: !165, line: 94, baseType: !178, size: 32, align: 32, offset: 1472)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "fifo", scope: !392, file: !165, line: 95, baseType: !419, size: 64, align: 64, offset: 1536)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFifoBuffer", file: !421, line: 35, baseType: !422)
!421 = !DIFile(filename: "./libavutil/fifo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFifoBuffer", file: !421, line: 31, size: 320, align: 64, elements: !423)
!423 = !{!424, !425, !426, !427, !428, !429}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !422, file: !421, line: 32, baseType: !162, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rptr", scope: !422, file: !421, line: 33, baseType: !162, size: 64, align: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "wptr", scope: !422, file: !421, line: 33, baseType: !162, size: 64, align: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !422, file: !421, line: 33, baseType: !162, size: 64, align: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "rndx", scope: !422, file: !421, line: 34, baseType: !122, size: 32, align: 32, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "wndx", scope: !422, file: !421, line: 34, baseType: !122, size: 32, align: 32, offset: 288)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "circular_buffer_error", scope: !392, file: !165, line: 96, baseType: !178, size: 32, align: 32, offset: 1600)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "bitrate", scope: !392, file: !165, line: 97, baseType: !153, size: 64, align: 64, offset: 1664)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "burst_bits", scope: !392, file: !165, line: 98, baseType: !153, size: 64, align: 64, offset: 1728)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "close_req", scope: !392, file: !165, line: 99, baseType: !178, size: 32, align: 32, offset: 1792)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "circular_buffer_thread", scope: !392, file: !165, line: 101, baseType: !435, size: 64, align: 64, offset: 1856)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !436, line: 60, baseType: !414)
!436 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !392, file: !165, line: 102, baseType: !438, size: 320, align: 64, offset: 1920)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !436, line: 128, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !436, line: 90, size: 320, align: 64, elements: !440)
!440 = !{!441, !459, !463}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !439, file: !436, line: 125, baseType: !442, size: 320, align: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !436, line: 92, size: 320, align: 64, elements: !443)
!443 = !{!444, !445, !446, !447, !448, !449, !451, !452}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !442, file: !436, line: 94, baseType: !178, size: 32, align: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !442, file: !436, line: 95, baseType: !123, size: 32, align: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !442, file: !436, line: 96, baseType: !178, size: 32, align: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !442, file: !436, line: 98, baseType: !123, size: 32, align: 32, offset: 96)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !442, file: !436, line: 102, baseType: !178, size: 32, align: 32, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !442, file: !436, line: 104, baseType: !450, size: 16, align: 16, offset: 160)
!450 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !442, file: !436, line: 105, baseType: !450, size: 16, align: 16, offset: 176)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !442, file: !436, line: 106, baseType: !453, size: 128, align: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !436, line: 79, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !436, line: 75, size: 128, align: 64, elements: !455)
!455 = !{!456, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !454, file: !436, line: 77, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !454, file: !436, line: 78, baseType: !457, size: 64, align: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !439, file: !436, line: 126, baseType: !460, size: 320, align: 8)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 320, align: 8, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 40)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !439, file: !436, line: 127, baseType: !154, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !392, file: !165, line: 103, baseType: !465, size: 384, align: 64, offset: 2240)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !436, line: 154, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !436, line: 139, size: 384, align: 64, elements: !467)
!467 = !{!468, !480, !484}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !466, file: !436, line: 151, baseType: !469, size: 384, align: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !466, file: !436, line: 141, size: 384, align: 64, elements: !470)
!470 = !{!471, !472, !473, !475, !476, !477, !478, !479}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !469, file: !436, line: 143, baseType: !178, size: 32, align: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__futex", scope: !469, file: !436, line: 144, baseType: !123, size: 32, align: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__total_seq", scope: !469, file: !436, line: 145, baseType: !474, size: 64, align: 64, offset: 64)
!474 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__wakeup_seq", scope: !469, file: !436, line: 146, baseType: !474, size: 64, align: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__woken_seq", scope: !469, file: !436, line: 147, baseType: !474, size: 64, align: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__mutex", scope: !469, file: !436, line: 148, baseType: !106, size: 64, align: 64, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__nwaiters", scope: !469, file: !436, line: 149, baseType: !123, size: 32, align: 32, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__broadcast_seq", scope: !469, file: !436, line: 150, baseType: !123, size: 32, align: 32, offset: 352)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !466, file: !436, line: 152, baseType: !481, size: 384, align: 8)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 384, align: 8, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 48)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !466, file: !436, line: 153, baseType: !485, size: 64, align: 64)
!485 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "thread_started", scope: !392, file: !165, line: 104, baseType: !178, size: 32, align: 32, offset: 2624)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !392, file: !165, line: 106, baseType: !488, size: 524320, align: 8, offset: 2656)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 524320, align: 8, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 65540)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_in_dg", scope: !392, file: !165, line: 107, baseType: !178, size: 32, align: 32, offset: 526976)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "localaddr", scope: !392, file: !165, line: 108, baseType: !267, size: 64, align: 64, offset: 527040)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !392, file: !165, line: 109, baseType: !178, size: 32, align: 32, offset: 527104)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr_storage", scope: !392, file: !165, line: 110, baseType: !406, size: 1024, align: 64, offset: 527168)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "sources", scope: !392, file: !165, line: 111, baseType: !267, size: 64, align: 64, offset: 528192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !392, file: !165, line: 112, baseType: !267, size: 64, align: 64, offset: 528256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !392, file: !165, line: 113, baseType: !498, size: 192, align: 64, offset: 528320)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPSourceFilters", file: !499, line: 34, baseType: !500)
!499 = !DIFile(filename: "libavformat/ip.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IPSourceFilters", file: !499, line: 29, size: 192, align: 64, elements: !501)
!501 = !{!502, !503, !504, !506}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "nb_include_addrs", scope: !500, file: !499, line: 30, baseType: !178, size: 32, align: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "nb_exclude_addrs", scope: !500, file: !499, line: 31, baseType: !178, size: 32, align: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "include_addrs", scope: !500, file: !499, line: 32, baseType: !505, size: 64, align: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_addrs", scope: !500, file: !499, line: 33, baseType: !505, size: 64, align: 64, offset: 128)
!507 = !DILocation(line: 402, column: 17, scope: !380)
!508 = !DILocation(line: 402, column: 21, scope: !380)
!509 = !DILocation(line: 402, column: 24, scope: !380)
!510 = !DILocalVariable(name: "hostname", scope: !380, file: !165, line: 403, type: !511)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 2048, align: 8, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 256)
!514 = !DILocation(line: 403, column: 10, scope: !380)
!515 = !DILocalVariable(name: "buf", scope: !380, file: !165, line: 403, type: !516)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 80, align: 8, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 10)
!519 = !DILocation(line: 403, column: 25, scope: !380)
!520 = !DILocalVariable(name: "port", scope: !380, file: !165, line: 404, type: !178)
!521 = !DILocation(line: 404, column: 9, scope: !380)
!522 = !DILocalVariable(name: "p", scope: !380, file: !165, line: 405, type: !172)
!523 = !DILocation(line: 405, column: 17, scope: !380)
!524 = !DILocation(line: 407, column: 35, scope: !380)
!525 = !DILocation(line: 407, column: 79, scope: !380)
!526 = !DILocation(line: 407, column: 5, scope: !380)
!527 = !DILocation(line: 410, column: 36, scope: !380)
!528 = !DILocation(line: 410, column: 40, scope: !380)
!529 = !DILocation(line: 410, column: 43, scope: !380)
!530 = !DILocation(line: 410, column: 54, scope: !380)
!531 = !DILocation(line: 410, column: 64, scope: !380)
!532 = !DILocation(line: 410, column: 24, scope: !380)
!533 = !DILocation(line: 410, column: 5, scope: !380)
!534 = !DILocation(line: 410, column: 8, scope: !380)
!535 = !DILocation(line: 410, column: 22, scope: !380)
!536 = !DILocation(line: 411, column: 9, scope: !537)
!537 = distinct !DILexicalBlock(scope: !380, file: !165, line: 411, column: 9)
!538 = !DILocation(line: 411, column: 12, scope: !537)
!539 = !DILocation(line: 411, column: 26, scope: !537)
!540 = !DILocation(line: 411, column: 9, scope: !380)
!541 = !DILocation(line: 412, column: 9, scope: !542)
!542 = distinct !DILexicalBlock(scope: !537, file: !165, line: 411, column: 31)
!543 = !DILocation(line: 414, column: 67, scope: !380)
!544 = !DILocation(line: 414, column: 70, scope: !380)
!545 = !DILocation(line: 414, column: 47, scope: !380)
!546 = !DILocation(line: 414, column: 23, scope: !380)
!547 = !DILocation(line: 414, column: 5, scope: !380)
!548 = !DILocation(line: 414, column: 8, scope: !380)
!549 = !DILocation(line: 414, column: 21, scope: !380)
!550 = !DILocation(line: 415, column: 16, scope: !380)
!551 = !DILocation(line: 415, column: 9, scope: !380)
!552 = !DILocation(line: 415, column: 7, scope: !380)
!553 = !DILocation(line: 416, column: 9, scope: !554)
!554 = distinct !DILexicalBlock(scope: !380, file: !165, line: 416, column: 9)
!555 = !DILocation(line: 416, column: 9, scope: !380)
!556 = !DILocation(line: 417, column: 30, scope: !557)
!557 = distinct !DILexicalBlock(scope: !558, file: !165, line: 417, column: 13)
!558 = distinct !DILexicalBlock(scope: !554, file: !165, line: 416, column: 12)
!559 = !DILocation(line: 417, column: 59, scope: !557)
!560 = !DILocation(line: 417, column: 13, scope: !557)
!561 = !DILocation(line: 417, column: 13, scope: !558)
!562 = !DILocalVariable(name: "was_connected", scope: !563, file: !165, line: 418, type: !178)
!563 = distinct !DILexicalBlock(scope: !557, file: !165, line: 417, column: 63)
!564 = !DILocation(line: 418, column: 17, scope: !563)
!565 = !DILocation(line: 418, column: 33, scope: !563)
!566 = !DILocation(line: 418, column: 36, scope: !563)
!567 = !DILocation(line: 419, column: 38, scope: !563)
!568 = !DILocation(line: 419, column: 31, scope: !563)
!569 = !DILocation(line: 419, column: 13, scope: !563)
!570 = !DILocation(line: 419, column: 16, scope: !563)
!571 = !DILocation(line: 419, column: 29, scope: !563)
!572 = !DILocation(line: 420, column: 17, scope: !573)
!573 = distinct !DILexicalBlock(scope: !563, file: !165, line: 420, column: 17)
!574 = !DILocation(line: 420, column: 20, scope: !573)
!575 = !DILocation(line: 420, column: 33, scope: !573)
!576 = !DILocation(line: 420, column: 37, scope: !577)
!577 = !DILexicalBlockFile(scope: !573, file: !165, discriminator: 1)
!578 = !DILocation(line: 420, column: 17, scope: !577)
!579 = !DILocation(line: 421, column: 29, scope: !580)
!580 = distinct !DILexicalBlock(scope: !581, file: !165, line: 421, column: 21)
!581 = distinct !DILexicalBlock(scope: !573, file: !165, line: 420, column: 52)
!582 = !DILocation(line: 421, column: 32, scope: !580)
!583 = !DILocation(line: 421, column: 61, scope: !580)
!584 = !DILocation(line: 421, column: 64, scope: !580)
!585 = !DILocation(line: 421, column: 40, scope: !580)
!586 = !DILocation(line: 422, column: 29, scope: !580)
!587 = !DILocation(line: 422, column: 32, scope: !580)
!588 = !DILocation(line: 421, column: 21, scope: !580)
!589 = !DILocation(line: 421, column: 21, scope: !581)
!590 = !DILocation(line: 423, column: 21, scope: !591)
!591 = distinct !DILexicalBlock(scope: !580, file: !165, line: 422, column: 48)
!592 = !DILocation(line: 423, column: 24, scope: !591)
!593 = !DILocation(line: 423, column: 37, scope: !591)
!594 = !DILocation(line: 424, column: 38, scope: !591)
!595 = !DILocation(line: 424, column: 21, scope: !591)
!596 = !DILocation(line: 425, column: 21, scope: !591)
!597 = !DILocation(line: 427, column: 13, scope: !581)
!598 = !DILocation(line: 428, column: 9, scope: !563)
!599 = !DILocation(line: 429, column: 5, scope: !558)
!600 = !DILocation(line: 431, column: 5, scope: !380)
!601 = !DILocation(line: 432, column: 1, scope: !380)
!602 = distinct !DISubprogram(name: "udp_set_url", scope: !165, file: !165, line: 312, type: !603, isLocal: true, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !383)
!603 = !DISubroutineType(types: !604)
!604 = !{!178, !179, !505, !172, !178}
!605 = !DILocalVariable(name: "h", arg: 1, scope: !602, file: !165, line: 312, type: !179)
!606 = !DILocation(line: 312, column: 36, scope: !602)
!607 = !DILocalVariable(name: "addr", arg: 2, scope: !602, file: !165, line: 313, type: !505)
!608 = !DILocation(line: 313, column: 49, scope: !602)
!609 = !DILocalVariable(name: "hostname", arg: 3, scope: !602, file: !165, line: 314, type: !172)
!610 = !DILocation(line: 314, column: 36, scope: !602)
!611 = !DILocalVariable(name: "port", arg: 4, scope: !602, file: !165, line: 314, type: !178)
!612 = !DILocation(line: 314, column: 50, scope: !602)
!613 = !DILocalVariable(name: "res0", scope: !602, file: !165, line: 316, type: !614)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !616, line: 567, size: 384, align: 64, elements: !617)
!616 = !DIFile(filename: "/usr/include/netdb.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!617 = !{!618, !619, !620, !621, !622, !626, !627, !628}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !615, file: !616, line: 569, baseType: !178, size: 32, align: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !615, file: !616, line: 570, baseType: !178, size: 32, align: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !615, file: !616, line: 571, baseType: !178, size: 32, align: 32, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !615, file: !616, line: 572, baseType: !178, size: 32, align: 32, offset: 96)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !615, file: !616, line: 573, baseType: !623, size: 32, align: 32, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !95, line: 33, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !625, line: 189, baseType: !123)
!625 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !615, file: !616, line: 574, baseType: !93, size: 64, align: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !615, file: !616, line: 575, baseType: !267, size: 64, align: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !615, file: !616, line: 576, baseType: !614, size: 64, align: 64, offset: 320)
!629 = !DILocation(line: 316, column: 22, scope: !602)
!630 = !DILocalVariable(name: "addr_len", scope: !602, file: !165, line: 317, type: !178)
!631 = !DILocation(line: 317, column: 9, scope: !602)
!632 = !DILocation(line: 319, column: 31, scope: !602)
!633 = !DILocation(line: 319, column: 34, scope: !602)
!634 = !DILocation(line: 319, column: 44, scope: !602)
!635 = !DILocation(line: 319, column: 12, scope: !602)
!636 = !DILocation(line: 319, column: 10, scope: !602)
!637 = !DILocation(line: 320, column: 10, scope: !638)
!638 = distinct !DILexicalBlock(scope: !602, file: !165, line: 320, column: 9)
!639 = !DILocation(line: 320, column: 9, scope: !602)
!640 = !DILocation(line: 320, column: 16, scope: !641)
!641 = !DILexicalBlockFile(scope: !638, file: !165, discriminator: 1)
!642 = !DILocation(line: 321, column: 12, scope: !602)
!643 = !DILocation(line: 321, column: 5, scope: !602)
!644 = !DILocation(line: 321, column: 18, scope: !602)
!645 = !DILocation(line: 321, column: 24, scope: !602)
!646 = !DILocation(line: 321, column: 33, scope: !602)
!647 = !DILocation(line: 321, column: 39, scope: !602)
!648 = !DILocation(line: 322, column: 16, scope: !602)
!649 = !DILocation(line: 322, column: 22, scope: !602)
!650 = !DILocation(line: 322, column: 14, scope: !602)
!651 = !DILocation(line: 323, column: 18, scope: !602)
!652 = !DILocation(line: 323, column: 5, scope: !602)
!653 = !DILocation(line: 325, column: 12, scope: !602)
!654 = !DILocation(line: 325, column: 5, scope: !602)
!655 = !DILocation(line: 326, column: 1, scope: !602)
!656 = distinct !DISubprogram(name: "ff_udp_get_local_port", scope: !165, file: !165, line: 439, type: !302, isLocal: false, isDefinition: true, scopeLine: 440, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !383)
!657 = !DILocalVariable(name: "h", arg: 1, scope: !656, file: !165, line: 439, type: !179)
!658 = !DILocation(line: 439, column: 39, scope: !656)
!659 = !DILocalVariable(name: "s", scope: !656, file: !165, line: 441, type: !390)
!660 = !DILocation(line: 441, column: 17, scope: !656)
!661 = !DILocation(line: 441, column: 21, scope: !656)
!662 = !DILocation(line: 441, column: 24, scope: !656)
!663 = !DILocation(line: 442, column: 12, scope: !656)
!664 = !DILocation(line: 442, column: 15, scope: !656)
!665 = !DILocation(line: 442, column: 5, scope: !656)
!666 = distinct !DISubprogram(name: "udp_open", scope: !165, file: !165, line: 624, type: !176, isLocal: true, isDefinition: true, scopeLine: 625, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !383)
!667 = !DILocalVariable(name: "h", arg: 1, scope: !666, file: !165, line: 624, type: !179)
!668 = !DILocation(line: 624, column: 33, scope: !666)
!669 = !DILocalVariable(name: "uri", arg: 2, scope: !666, file: !165, line: 624, type: !172)
!670 = !DILocation(line: 624, column: 48, scope: !666)
!671 = !DILocalVariable(name: "flags", arg: 3, scope: !666, file: !165, line: 624, type: !178)
!672 = !DILocation(line: 624, column: 57, scope: !666)
!673 = !DILocalVariable(name: "hostname", scope: !666, file: !165, line: 626, type: !674)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 8192, align: 8, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 1024)
!677 = !DILocation(line: 626, column: 10, scope: !666)
!678 = !DILocalVariable(name: "localaddr", scope: !666, file: !165, line: 626, type: !674)
!679 = !DILocation(line: 626, column: 26, scope: !666)
!680 = !DILocalVariable(name: "port", scope: !666, file: !165, line: 627, type: !178)
!681 = !DILocation(line: 627, column: 9, scope: !666)
!682 = !DILocalVariable(name: "udp_fd", scope: !666, file: !165, line: 627, type: !178)
!683 = !DILocation(line: 627, column: 15, scope: !666)
!684 = !DILocalVariable(name: "tmp", scope: !666, file: !165, line: 627, type: !178)
!685 = !DILocation(line: 627, column: 28, scope: !666)
!686 = !DILocalVariable(name: "bind_ret", scope: !666, file: !165, line: 627, type: !178)
!687 = !DILocation(line: 627, column: 33, scope: !666)
!688 = !DILocalVariable(name: "dscp", scope: !666, file: !165, line: 627, type: !178)
!689 = !DILocation(line: 627, column: 48, scope: !666)
!690 = !DILocalVariable(name: "s", scope: !666, file: !165, line: 628, type: !390)
!691 = !DILocation(line: 628, column: 17, scope: !666)
!692 = !DILocation(line: 628, column: 21, scope: !666)
!693 = !DILocation(line: 628, column: 24, scope: !666)
!694 = !DILocalVariable(name: "is_output", scope: !666, file: !165, line: 629, type: !178)
!695 = !DILocation(line: 629, column: 9, scope: !666)
!696 = !DILocalVariable(name: "p", scope: !666, file: !165, line: 630, type: !172)
!697 = !DILocation(line: 630, column: 17, scope: !666)
!698 = !DILocalVariable(name: "buf", scope: !666, file: !165, line: 631, type: !511)
!699 = !DILocation(line: 631, column: 10, scope: !666)
!700 = !DILocalVariable(name: "my_addr", scope: !666, file: !165, line: 632, type: !406)
!701 = !DILocation(line: 632, column: 29, scope: !666)
!702 = !DILocalVariable(name: "len", scope: !666, file: !165, line: 633, type: !623)
!703 = !DILocation(line: 633, column: 15, scope: !666)
!704 = !DILocation(line: 635, column: 5, scope: !666)
!705 = !DILocation(line: 635, column: 8, scope: !666)
!706 = !DILocation(line: 635, column: 20, scope: !666)
!707 = !DILocation(line: 637, column: 19, scope: !666)
!708 = !DILocation(line: 637, column: 25, scope: !666)
!709 = !DILocation(line: 637, column: 17, scope: !666)
!710 = !DILocation(line: 637, column: 15, scope: !666)
!711 = !DILocation(line: 638, column: 9, scope: !712)
!712 = distinct !DILexicalBlock(scope: !666, file: !165, line: 638, column: 9)
!713 = !DILocation(line: 638, column: 12, scope: !712)
!714 = !DILocation(line: 638, column: 24, scope: !712)
!715 = !DILocation(line: 638, column: 9, scope: !666)
!716 = !DILocation(line: 639, column: 26, scope: !712)
!717 = !DILocation(line: 639, column: 9, scope: !712)
!718 = !DILocation(line: 639, column: 12, scope: !712)
!719 = !DILocation(line: 639, column: 24, scope: !712)
!720 = !DILocation(line: 641, column: 9, scope: !721)
!721 = distinct !DILexicalBlock(scope: !666, file: !165, line: 641, column: 9)
!722 = !DILocation(line: 641, column: 12, scope: !721)
!723 = !DILocation(line: 641, column: 9, scope: !666)
!724 = !DILocation(line: 642, column: 33, scope: !725)
!725 = distinct !DILexicalBlock(scope: !726, file: !165, line: 642, column: 13)
!726 = distinct !DILexicalBlock(scope: !721, file: !165, line: 641, column: 21)
!727 = !DILocation(line: 642, column: 36, scope: !725)
!728 = !DILocation(line: 642, column: 39, scope: !725)
!729 = !DILocation(line: 642, column: 49, scope: !725)
!730 = !DILocation(line: 642, column: 52, scope: !725)
!731 = !DILocation(line: 642, column: 13, scope: !725)
!732 = !DILocation(line: 642, column: 61, scope: !725)
!733 = !DILocation(line: 642, column: 13, scope: !726)
!734 = !DILocation(line: 643, column: 13, scope: !725)
!735 = !DILocation(line: 644, column: 5, scope: !726)
!736 = !DILocation(line: 646, column: 9, scope: !737)
!737 = distinct !DILexicalBlock(scope: !666, file: !165, line: 646, column: 9)
!738 = !DILocation(line: 646, column: 12, scope: !737)
!739 = !DILocation(line: 646, column: 9, scope: !666)
!740 = !DILocation(line: 647, column: 32, scope: !741)
!741 = distinct !DILexicalBlock(scope: !742, file: !165, line: 647, column: 13)
!742 = distinct !DILexicalBlock(scope: !737, file: !165, line: 646, column: 19)
!743 = !DILocation(line: 647, column: 35, scope: !741)
!744 = !DILocation(line: 647, column: 38, scope: !741)
!745 = !DILocation(line: 647, column: 46, scope: !741)
!746 = !DILocation(line: 647, column: 49, scope: !741)
!747 = !DILocation(line: 647, column: 13, scope: !741)
!748 = !DILocation(line: 647, column: 58, scope: !741)
!749 = !DILocation(line: 647, column: 13, scope: !742)
!750 = !DILocation(line: 648, column: 13, scope: !741)
!751 = !DILocation(line: 649, column: 5, scope: !742)
!752 = !DILocation(line: 651, column: 9, scope: !753)
!753 = distinct !DILexicalBlock(scope: !666, file: !165, line: 651, column: 9)
!754 = !DILocation(line: 651, column: 12, scope: !753)
!755 = !DILocation(line: 651, column: 21, scope: !753)
!756 = !DILocation(line: 651, column: 9, scope: !666)
!757 = !DILocation(line: 652, column: 30, scope: !753)
!758 = !DILocation(line: 652, column: 33, scope: !753)
!759 = !DILocation(line: 652, column: 9, scope: !753)
!760 = !DILocation(line: 652, column: 12, scope: !753)
!761 = !DILocation(line: 652, column: 28, scope: !753)
!762 = !DILocation(line: 654, column: 16, scope: !666)
!763 = !DILocation(line: 654, column: 9, scope: !666)
!764 = !DILocation(line: 654, column: 7, scope: !666)
!765 = !DILocation(line: 655, column: 9, scope: !766)
!766 = distinct !DILexicalBlock(scope: !666, file: !165, line: 655, column: 9)
!767 = !DILocation(line: 655, column: 9, scope: !666)
!768 = !DILocation(line: 656, column: 30, scope: !769)
!769 = distinct !DILexicalBlock(scope: !770, file: !165, line: 656, column: 13)
!770 = distinct !DILexicalBlock(scope: !766, file: !165, line: 655, column: 12)
!771 = !DILocation(line: 656, column: 57, scope: !769)
!772 = !DILocation(line: 656, column: 13, scope: !769)
!773 = !DILocation(line: 656, column: 13, scope: !770)
!774 = !DILocalVariable(name: "endptr", scope: !775, file: !165, line: 657, type: !267)
!775 = distinct !DILexicalBlock(scope: !769, file: !165, line: 656, column: 61)
!776 = !DILocation(line: 657, column: 19, scope: !775)
!777 = !DILocation(line: 658, column: 38, scope: !775)
!778 = !DILocation(line: 658, column: 31, scope: !775)
!779 = !DILocation(line: 658, column: 13, scope: !775)
!780 = !DILocation(line: 658, column: 16, scope: !775)
!781 = !DILocation(line: 658, column: 29, scope: !775)
!782 = !DILocation(line: 660, column: 17, scope: !783)
!783 = distinct !DILexicalBlock(scope: !775, file: !165, line: 660, column: 17)
!784 = !DILocation(line: 660, column: 24, scope: !783)
!785 = !DILocation(line: 660, column: 21, scope: !783)
!786 = !DILocation(line: 660, column: 17, scope: !775)
!787 = !DILocation(line: 661, column: 17, scope: !783)
!788 = !DILocation(line: 661, column: 20, scope: !783)
!789 = !DILocation(line: 661, column: 33, scope: !783)
!790 = !DILocation(line: 662, column: 9, scope: !775)
!791 = !DILocation(line: 663, column: 30, scope: !792)
!792 = distinct !DILexicalBlock(scope: !770, file: !165, line: 663, column: 13)
!793 = !DILocation(line: 663, column: 68, scope: !792)
!794 = !DILocation(line: 663, column: 13, scope: !792)
!795 = !DILocation(line: 663, column: 13, scope: !770)
!796 = !DILocalVariable(name: "endptr", scope: !797, file: !165, line: 664, type: !267)
!797 = distinct !DILexicalBlock(scope: !792, file: !165, line: 663, column: 72)
!798 = !DILocation(line: 664, column: 19, scope: !797)
!799 = !DILocation(line: 665, column: 42, scope: !797)
!800 = !DILocation(line: 665, column: 35, scope: !797)
!801 = !DILocation(line: 665, column: 13, scope: !797)
!802 = !DILocation(line: 665, column: 16, scope: !797)
!803 = !DILocation(line: 665, column: 33, scope: !797)
!804 = !DILocation(line: 667, column: 17, scope: !805)
!805 = distinct !DILexicalBlock(scope: !797, file: !165, line: 667, column: 17)
!806 = !DILocation(line: 667, column: 24, scope: !805)
!807 = !DILocation(line: 667, column: 21, scope: !805)
!808 = !DILocation(line: 667, column: 17, scope: !797)
!809 = !DILocation(line: 668, column: 17, scope: !805)
!810 = !DILocation(line: 668, column: 20, scope: !805)
!811 = !DILocation(line: 668, column: 37, scope: !805)
!812 = !DILocation(line: 673, column: 9, scope: !797)
!813 = !DILocation(line: 674, column: 30, scope: !814)
!814 = distinct !DILexicalBlock(scope: !770, file: !165, line: 674, column: 13)
!815 = !DILocation(line: 674, column: 55, scope: !814)
!816 = !DILocation(line: 674, column: 13, scope: !814)
!817 = !DILocation(line: 674, column: 13, scope: !770)
!818 = !DILocation(line: 675, column: 29, scope: !819)
!819 = distinct !DILexicalBlock(scope: !814, file: !165, line: 674, column: 59)
!820 = !DILocation(line: 675, column: 22, scope: !819)
!821 = !DILocation(line: 675, column: 13, scope: !819)
!822 = !DILocation(line: 675, column: 16, scope: !819)
!823 = !DILocation(line: 675, column: 20, scope: !819)
!824 = !DILocation(line: 676, column: 9, scope: !819)
!825 = !DILocation(line: 677, column: 30, scope: !826)
!826 = distinct !DILexicalBlock(scope: !770, file: !165, line: 677, column: 13)
!827 = !DILocation(line: 677, column: 68, scope: !826)
!828 = !DILocation(line: 677, column: 13, scope: !826)
!829 = !DILocation(line: 677, column: 13, scope: !770)
!830 = !DILocation(line: 678, column: 42, scope: !831)
!831 = distinct !DILexicalBlock(scope: !826, file: !165, line: 677, column: 72)
!832 = !DILocation(line: 678, column: 35, scope: !831)
!833 = !DILocation(line: 678, column: 13, scope: !831)
!834 = !DILocation(line: 678, column: 16, scope: !831)
!835 = !DILocation(line: 678, column: 33, scope: !831)
!836 = !DILocation(line: 679, column: 9, scope: !831)
!837 = !DILocation(line: 680, column: 30, scope: !838)
!838 = distinct !DILexicalBlock(scope: !770, file: !165, line: 680, column: 13)
!839 = !DILocation(line: 680, column: 61, scope: !838)
!840 = !DILocation(line: 680, column: 13, scope: !838)
!841 = !DILocation(line: 680, column: 13, scope: !770)
!842 = !DILocation(line: 681, column: 36, scope: !843)
!843 = distinct !DILexicalBlock(scope: !838, file: !165, line: 680, column: 65)
!844 = !DILocation(line: 681, column: 29, scope: !843)
!845 = !DILocation(line: 681, column: 13, scope: !843)
!846 = !DILocation(line: 681, column: 16, scope: !843)
!847 = !DILocation(line: 681, column: 27, scope: !843)
!848 = !DILocation(line: 682, column: 9, scope: !843)
!849 = !DILocation(line: 683, column: 30, scope: !850)
!850 = distinct !DILexicalBlock(scope: !770, file: !165, line: 683, column: 13)
!851 = !DILocation(line: 683, column: 60, scope: !850)
!852 = !DILocation(line: 683, column: 13, scope: !850)
!853 = !DILocation(line: 683, column: 13, scope: !770)
!854 = !DILocation(line: 684, column: 34, scope: !855)
!855 = distinct !DILexicalBlock(scope: !850, file: !165, line: 683, column: 64)
!856 = !DILocation(line: 684, column: 27, scope: !855)
!857 = !DILocation(line: 684, column: 13, scope: !855)
!858 = !DILocation(line: 684, column: 16, scope: !855)
!859 = !DILocation(line: 684, column: 25, scope: !855)
!860 = !DILocation(line: 685, column: 9, scope: !855)
!861 = !DILocation(line: 686, column: 30, scope: !862)
!862 = distinct !DILexicalBlock(scope: !770, file: !165, line: 686, column: 13)
!863 = !DILocation(line: 686, column: 63, scope: !862)
!864 = !DILocation(line: 686, column: 13, scope: !862)
!865 = !DILocation(line: 686, column: 13, scope: !770)
!866 = !DILocation(line: 687, column: 37, scope: !867)
!867 = distinct !DILexicalBlock(scope: !862, file: !165, line: 686, column: 67)
!868 = !DILocation(line: 687, column: 30, scope: !867)
!869 = !DILocation(line: 687, column: 13, scope: !867)
!870 = !DILocation(line: 687, column: 16, scope: !867)
!871 = !DILocation(line: 687, column: 28, scope: !867)
!872 = !DILocation(line: 688, column: 9, scope: !867)
!873 = !DILocation(line: 689, column: 30, scope: !874)
!874 = distinct !DILexicalBlock(scope: !770, file: !165, line: 689, column: 13)
!875 = !DILocation(line: 689, column: 59, scope: !874)
!876 = !DILocation(line: 689, column: 13, scope: !874)
!877 = !DILocation(line: 689, column: 13, scope: !770)
!878 = !DILocation(line: 690, column: 38, scope: !879)
!879 = distinct !DILexicalBlock(scope: !874, file: !165, line: 689, column: 63)
!880 = !DILocation(line: 690, column: 31, scope: !879)
!881 = !DILocation(line: 690, column: 13, scope: !879)
!882 = !DILocation(line: 690, column: 16, scope: !879)
!883 = !DILocation(line: 690, column: 29, scope: !879)
!884 = !DILocation(line: 691, column: 9, scope: !879)
!885 = !DILocation(line: 692, column: 30, scope: !886)
!886 = distinct !DILexicalBlock(scope: !770, file: !165, line: 692, column: 13)
!887 = !DILocation(line: 692, column: 56, scope: !886)
!888 = !DILocation(line: 692, column: 13, scope: !886)
!889 = !DILocation(line: 692, column: 13, scope: !770)
!890 = !DILocation(line: 693, column: 27, scope: !891)
!891 = distinct !DILexicalBlock(scope: !886, file: !165, line: 692, column: 60)
!892 = !DILocation(line: 693, column: 20, scope: !891)
!893 = !DILocation(line: 693, column: 18, scope: !891)
!894 = !DILocation(line: 694, column: 9, scope: !891)
!895 = !DILocation(line: 695, column: 30, scope: !896)
!896 = distinct !DILexicalBlock(scope: !770, file: !165, line: 695, column: 13)
!897 = !DILocation(line: 695, column: 61, scope: !896)
!898 = !DILocation(line: 695, column: 13, scope: !896)
!899 = !DILocation(line: 695, column: 13, scope: !770)
!900 = !DILocation(line: 696, column: 46, scope: !901)
!901 = distinct !DILexicalBlock(scope: !896, file: !165, line: 695, column: 65)
!902 = !DILocation(line: 696, column: 39, scope: !901)
!903 = !DILocation(line: 696, column: 13, scope: !901)
!904 = !DILocation(line: 696, column: 16, scope: !901)
!905 = !DILocation(line: 696, column: 37, scope: !901)
!906 = !DILocation(line: 701, column: 9, scope: !901)
!907 = !DILocation(line: 702, column: 30, scope: !908)
!908 = distinct !DILexicalBlock(scope: !770, file: !165, line: 702, column: 13)
!909 = !DILocation(line: 702, column: 59, scope: !908)
!910 = !DILocation(line: 702, column: 13, scope: !908)
!911 = !DILocation(line: 702, column: 13, scope: !770)
!912 = !DILocation(line: 703, column: 34, scope: !913)
!913 = distinct !DILexicalBlock(scope: !908, file: !165, line: 702, column: 63)
!914 = !DILocation(line: 703, column: 26, scope: !913)
!915 = !DILocation(line: 703, column: 13, scope: !913)
!916 = !DILocation(line: 703, column: 16, scope: !913)
!917 = !DILocation(line: 703, column: 24, scope: !913)
!918 = !DILocation(line: 708, column: 9, scope: !913)
!919 = !DILocation(line: 709, column: 30, scope: !920)
!920 = distinct !DILexicalBlock(scope: !770, file: !165, line: 709, column: 13)
!921 = !DILocation(line: 709, column: 62, scope: !920)
!922 = !DILocation(line: 709, column: 13, scope: !920)
!923 = !DILocation(line: 709, column: 13, scope: !770)
!924 = !DILocation(line: 710, column: 37, scope: !925)
!925 = distinct !DILexicalBlock(scope: !920, file: !165, line: 709, column: 66)
!926 = !DILocation(line: 710, column: 29, scope: !925)
!927 = !DILocation(line: 710, column: 13, scope: !925)
!928 = !DILocation(line: 710, column: 16, scope: !925)
!929 = !DILocation(line: 710, column: 27, scope: !925)
!930 = !DILocation(line: 711, column: 9, scope: !925)
!931 = !DILocation(line: 712, column: 30, scope: !932)
!932 = distinct !DILexicalBlock(scope: !770, file: !165, line: 712, column: 13)
!933 = !DILocation(line: 712, column: 61, scope: !932)
!934 = !DILocation(line: 712, column: 13, scope: !932)
!935 = !DILocation(line: 712, column: 13, scope: !770)
!936 = !DILocation(line: 713, column: 24, scope: !937)
!937 = distinct !DILexicalBlock(scope: !932, file: !165, line: 712, column: 65)
!938 = !DILocation(line: 713, column: 35, scope: !937)
!939 = !DILocation(line: 713, column: 13, scope: !937)
!940 = !DILocation(line: 714, column: 9, scope: !937)
!941 = !DILocation(line: 715, column: 30, scope: !942)
!942 = distinct !DILexicalBlock(scope: !770, file: !165, line: 715, column: 13)
!943 = !DILocation(line: 715, column: 59, scope: !942)
!944 = !DILocation(line: 715, column: 13, scope: !942)
!945 = !DILocation(line: 715, column: 13, scope: !770)
!946 = !DILocation(line: 716, column: 37, scope: !947)
!947 = distinct !DILexicalBlock(scope: !948, file: !165, line: 716, column: 17)
!948 = distinct !DILexicalBlock(scope: !942, file: !165, line: 715, column: 63)
!949 = !DILocation(line: 716, column: 40, scope: !947)
!950 = !DILocation(line: 716, column: 46, scope: !947)
!951 = !DILocation(line: 716, column: 49, scope: !947)
!952 = !DILocation(line: 716, column: 17, scope: !947)
!953 = !DILocation(line: 716, column: 58, scope: !947)
!954 = !DILocation(line: 716, column: 17, scope: !948)
!955 = !DILocation(line: 717, column: 17, scope: !947)
!956 = !DILocation(line: 718, column: 9, scope: !948)
!957 = !DILocation(line: 719, column: 30, scope: !958)
!958 = distinct !DILexicalBlock(scope: !770, file: !165, line: 719, column: 13)
!959 = !DILocation(line: 719, column: 57, scope: !958)
!960 = !DILocation(line: 719, column: 13, scope: !958)
!961 = !DILocation(line: 719, column: 13, scope: !770)
!962 = !DILocation(line: 720, column: 36, scope: !963)
!963 = distinct !DILexicalBlock(scope: !964, file: !165, line: 720, column: 17)
!964 = distinct !DILexicalBlock(scope: !958, file: !165, line: 719, column: 61)
!965 = !DILocation(line: 720, column: 39, scope: !963)
!966 = !DILocation(line: 720, column: 45, scope: !963)
!967 = !DILocation(line: 720, column: 48, scope: !963)
!968 = !DILocation(line: 720, column: 17, scope: !963)
!969 = !DILocation(line: 720, column: 57, scope: !963)
!970 = !DILocation(line: 720, column: 17, scope: !964)
!971 = !DILocation(line: 721, column: 17, scope: !963)
!972 = !DILocation(line: 722, column: 9, scope: !964)
!973 = !DILocation(line: 723, column: 14, scope: !974)
!974 = distinct !DILexicalBlock(scope: !770, file: !165, line: 723, column: 13)
!975 = !DILocation(line: 723, column: 24, scope: !974)
!976 = !DILocation(line: 723, column: 44, scope: !977)
!977 = !DILexicalBlockFile(scope: !974, file: !165, discriminator: 1)
!978 = !DILocation(line: 723, column: 73, scope: !977)
!979 = !DILocation(line: 723, column: 27, scope: !977)
!980 = !DILocation(line: 723, column: 13, scope: !977)
!981 = !DILocation(line: 724, column: 33, scope: !974)
!982 = !DILocation(line: 724, column: 26, scope: !974)
!983 = !DILocation(line: 724, column: 13, scope: !974)
!984 = !DILocation(line: 724, column: 16, scope: !974)
!985 = !DILocation(line: 724, column: 24, scope: !974)
!986 = !DILocation(line: 725, column: 13, scope: !987)
!987 = distinct !DILexicalBlock(scope: !770, file: !165, line: 725, column: 13)
!988 = !DILocation(line: 725, column: 23, scope: !987)
!989 = !DILocation(line: 725, column: 43, scope: !990)
!990 = !DILexicalBlockFile(scope: !987, file: !165, discriminator: 1)
!991 = !DILocation(line: 725, column: 74, scope: !990)
!992 = !DILocation(line: 725, column: 26, scope: !990)
!993 = !DILocation(line: 725, column: 13, scope: !990)
!994 = !DILocation(line: 726, column: 38, scope: !987)
!995 = !DILocation(line: 726, column: 31, scope: !987)
!996 = !DILocation(line: 726, column: 13, scope: !987)
!997 = !DILocation(line: 726, column: 16, scope: !987)
!998 = !DILocation(line: 726, column: 29, scope: !987)
!999 = !DILocation(line: 727, column: 5, scope: !770)
!1000 = !DILocation(line: 729, column: 5, scope: !666)
!1001 = !DILocation(line: 729, column: 8, scope: !666)
!1002 = !DILocation(line: 729, column: 29, scope: !666)
!1003 = !DILocation(line: 730, column: 9, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !666, file: !165, line: 730, column: 9)
!1005 = !DILocation(line: 730, column: 15, scope: !1004)
!1006 = !DILocation(line: 730, column: 9, scope: !666)
!1007 = !DILocation(line: 731, column: 30, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1004, file: !165, line: 730, column: 20)
!1009 = !DILocation(line: 731, column: 33, scope: !1008)
!1010 = !DILocation(line: 731, column: 9, scope: !1008)
!1011 = !DILocation(line: 731, column: 12, scope: !1008)
!1012 = !DILocation(line: 731, column: 28, scope: !1008)
!1013 = !DILocation(line: 732, column: 5, scope: !1008)
!1014 = !DILocation(line: 733, column: 9, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1004, file: !165, line: 732, column: 12)
!1016 = !DILocation(line: 733, column: 12, scope: !1015)
!1017 = !DILocation(line: 733, column: 28, scope: !1015)
!1018 = !DILocation(line: 735, column: 21, scope: !666)
!1019 = !DILocation(line: 735, column: 24, scope: !666)
!1020 = !DILocation(line: 735, column: 5, scope: !666)
!1021 = !DILocation(line: 735, column: 8, scope: !666)
!1022 = !DILocation(line: 735, column: 19, scope: !666)
!1023 = !DILocation(line: 738, column: 35, scope: !666)
!1024 = !DILocation(line: 738, column: 79, scope: !666)
!1025 = !DILocation(line: 738, column: 5, scope: !666)
!1026 = !DILocation(line: 741, column: 9, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !666, file: !165, line: 741, column: 9)
!1028 = !DILocation(line: 741, column: 21, scope: !1027)
!1029 = !DILocation(line: 741, column: 29, scope: !1027)
!1030 = !DILocation(line: 741, column: 32, scope: !1031)
!1031 = !DILexicalBlockFile(scope: !1027, file: !165, discriminator: 1)
!1032 = !DILocation(line: 741, column: 44, scope: !1031)
!1033 = !DILocation(line: 741, column: 9, scope: !1031)
!1034 = !DILocation(line: 743, column: 15, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !165, line: 743, column: 13)
!1036 = distinct !DILexicalBlock(scope: !1027, file: !165, line: 741, column: 52)
!1037 = !DILocation(line: 743, column: 21, scope: !1035)
!1038 = !DILocation(line: 743, column: 13, scope: !1036)
!1039 = !DILocation(line: 744, column: 13, scope: !1035)
!1040 = !DILocation(line: 745, column: 5, scope: !1036)
!1041 = !DILocation(line: 746, column: 35, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !165, line: 746, column: 13)
!1043 = distinct !DILexicalBlock(scope: !1027, file: !165, line: 745, column: 12)
!1044 = !DILocation(line: 746, column: 38, scope: !1042)
!1045 = !DILocation(line: 746, column: 13, scope: !1042)
!1046 = !DILocation(line: 746, column: 43, scope: !1042)
!1047 = !DILocation(line: 746, column: 13, scope: !1043)
!1048 = !DILocation(line: 747, column: 13, scope: !1042)
!1049 = !DILocation(line: 750, column: 10, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !666, file: !165, line: 750, column: 9)
!1051 = !DILocation(line: 750, column: 13, scope: !1050)
!1052 = !DILocation(line: 750, column: 26, scope: !1050)
!1053 = !DILocation(line: 750, column: 29, scope: !1054)
!1054 = !DILexicalBlockFile(scope: !1050, file: !165, discriminator: 1)
!1055 = !DILocation(line: 750, column: 32, scope: !1054)
!1056 = !DILocation(line: 750, column: 43, scope: !1054)
!1057 = !DILocation(line: 750, column: 49, scope: !1054)
!1058 = !DILocation(line: 750, column: 53, scope: !1059)
!1059 = !DILexicalBlockFile(scope: !1050, file: !165, discriminator: 2)
!1060 = !DILocation(line: 750, column: 56, scope: !1059)
!1061 = !DILocation(line: 750, column: 62, scope: !1059)
!1062 = !DILocation(line: 750, column: 9, scope: !1059)
!1063 = !DILocation(line: 751, column: 25, scope: !1050)
!1064 = !DILocation(line: 751, column: 9, scope: !1050)
!1065 = !DILocation(line: 751, column: 12, scope: !1050)
!1066 = !DILocation(line: 751, column: 23, scope: !1050)
!1067 = !DILocation(line: 753, column: 9, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !666, file: !165, line: 753, column: 9)
!1069 = !DILocation(line: 753, column: 9, scope: !666)
!1070 = !DILocation(line: 754, column: 36, scope: !1068)
!1071 = !DILocation(line: 754, column: 55, scope: !1068)
!1072 = !DILocation(line: 754, column: 18, scope: !1068)
!1073 = !DILocation(line: 754, column: 16, scope: !1068)
!1074 = !DILocation(line: 754, column: 9, scope: !1068)
!1075 = !DILocation(line: 756, column: 36, scope: !1068)
!1076 = !DILocation(line: 756, column: 55, scope: !1068)
!1077 = !DILocation(line: 756, column: 58, scope: !1068)
!1078 = !DILocation(line: 756, column: 18, scope: !1068)
!1079 = !DILocation(line: 756, column: 16, scope: !1068)
!1080 = !DILocation(line: 757, column: 9, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !666, file: !165, line: 757, column: 9)
!1082 = !DILocation(line: 757, column: 16, scope: !1081)
!1083 = !DILocation(line: 757, column: 9, scope: !666)
!1084 = !DILocation(line: 758, column: 9, scope: !1081)
!1085 = !DILocation(line: 760, column: 5, scope: !666)
!1086 = !DILocation(line: 760, column: 8, scope: !666)
!1087 = !DILocation(line: 760, column: 27, scope: !666)
!1088 = !DILocation(line: 765, column: 9, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !666, file: !165, line: 765, column: 9)
!1090 = !DILocation(line: 765, column: 12, scope: !1089)
!1091 = !DILocation(line: 765, column: 25, scope: !1089)
!1092 = !DILocation(line: 765, column: 29, scope: !1089)
!1093 = !DILocation(line: 765, column: 33, scope: !1094)
!1094 = !DILexicalBlockFile(scope: !1089, file: !165, discriminator: 1)
!1095 = !DILocation(line: 765, column: 36, scope: !1094)
!1096 = !DILocation(line: 765, column: 49, scope: !1094)
!1097 = !DILocation(line: 765, column: 52, scope: !1098)
!1098 = !DILexicalBlockFile(scope: !1089, file: !165, discriminator: 2)
!1099 = !DILocation(line: 765, column: 55, scope: !1098)
!1100 = !DILocation(line: 765, column: 68, scope: !1098)
!1101 = !DILocation(line: 765, column: 9, scope: !1098)
!1102 = !DILocation(line: 766, column: 9, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1089, file: !165, line: 765, column: 74)
!1104 = !DILocation(line: 766, column: 12, scope: !1103)
!1105 = !DILocation(line: 766, column: 25, scope: !1103)
!1106 = !DILocation(line: 767, column: 25, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1103, file: !165, line: 767, column: 13)
!1108 = !DILocation(line: 767, column: 60, scope: !1107)
!1109 = !DILocation(line: 767, column: 63, scope: !1107)
!1110 = !DILocation(line: 767, column: 58, scope: !1107)
!1111 = !DILocation(line: 767, column: 13, scope: !1107)
!1112 = !DILocation(line: 767, column: 103, scope: !1107)
!1113 = !DILocation(line: 767, column: 13, scope: !1103)
!1114 = !DILocation(line: 768, column: 13, scope: !1107)
!1115 = !DILocation(line: 769, column: 5, scope: !1103)
!1116 = !DILocation(line: 771, column: 9, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !666, file: !165, line: 771, column: 9)
!1118 = !DILocation(line: 771, column: 12, scope: !1117)
!1119 = !DILocation(line: 771, column: 9, scope: !666)
!1120 = !DILocation(line: 773, column: 25, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1122, file: !165, line: 773, column: 13)
!1122 = distinct !DILexicalBlock(scope: !1117, file: !165, line: 771, column: 26)
!1123 = !DILocation(line: 773, column: 60, scope: !1121)
!1124 = !DILocation(line: 773, column: 63, scope: !1121)
!1125 = !DILocation(line: 773, column: 58, scope: !1121)
!1126 = !DILocation(line: 773, column: 13, scope: !1121)
!1127 = !DILocation(line: 773, column: 103, scope: !1121)
!1128 = !DILocation(line: 773, column: 13, scope: !1122)
!1129 = !DILocation(line: 775, column: 12, scope: !1121)
!1130 = !DILocation(line: 776, column: 5, scope: !1122)
!1131 = !DILocation(line: 782, column: 9, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !666, file: !165, line: 782, column: 9)
!1133 = !DILocation(line: 782, column: 12, scope: !1132)
!1134 = !DILocation(line: 782, column: 9, scope: !666)
!1135 = !DILocation(line: 783, column: 25, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1137, file: !165, line: 783, column: 13)
!1137 = distinct !DILexicalBlock(scope: !1132, file: !165, line: 782, column: 30)
!1138 = !DILocation(line: 783, column: 55, scope: !1136)
!1139 = !DILocation(line: 783, column: 58, scope: !1136)
!1140 = !DILocation(line: 783, column: 53, scope: !1136)
!1141 = !DILocation(line: 783, column: 13, scope: !1136)
!1142 = !DILocation(line: 783, column: 106, scope: !1136)
!1143 = !DILocation(line: 783, column: 13, scope: !1137)
!1144 = !DILocation(line: 784, column: 20, scope: !1136)
!1145 = !DILocation(line: 784, column: 13, scope: !1136)
!1146 = !DILocation(line: 786, column: 25, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1137, file: !165, line: 786, column: 13)
!1148 = !DILocation(line: 786, column: 55, scope: !1147)
!1149 = !DILocation(line: 786, column: 58, scope: !1147)
!1150 = !DILocation(line: 786, column: 53, scope: !1147)
!1151 = !DILocation(line: 786, column: 13, scope: !1147)
!1152 = !DILocation(line: 786, column: 106, scope: !1147)
!1153 = !DILocation(line: 786, column: 13, scope: !1137)
!1154 = !DILocation(line: 787, column: 20, scope: !1147)
!1155 = !DILocation(line: 787, column: 13, scope: !1147)
!1156 = !DILocation(line: 788, column: 5, scope: !1137)
!1157 = !DILocation(line: 790, column: 9, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !666, file: !165, line: 790, column: 9)
!1159 = !DILocation(line: 790, column: 14, scope: !1158)
!1160 = !DILocation(line: 790, column: 9, scope: !666)
!1161 = !DILocation(line: 791, column: 14, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1158, file: !165, line: 790, column: 20)
!1163 = !DILocation(line: 792, column: 25, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1162, file: !165, line: 792, column: 13)
!1165 = !DILocation(line: 792, column: 52, scope: !1164)
!1166 = !DILocation(line: 792, column: 13, scope: !1164)
!1167 = !DILocation(line: 792, column: 73, scope: !1164)
!1168 = !DILocation(line: 792, column: 13, scope: !1162)
!1169 = !DILocation(line: 793, column: 13, scope: !1164)
!1170 = !DILocation(line: 794, column: 5, scope: !1162)
!1171 = !DILocation(line: 800, column: 9, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !666, file: !165, line: 800, column: 9)
!1173 = !DILocation(line: 800, column: 12, scope: !1172)
!1174 = !DILocation(line: 800, column: 25, scope: !1172)
!1175 = !DILocation(line: 800, column: 30, scope: !1176)
!1176 = !DILexicalBlockFile(scope: !1172, file: !165, discriminator: 1)
!1177 = !DILocation(line: 800, column: 33, scope: !1176)
!1178 = !DILocation(line: 800, column: 39, scope: !1176)
!1179 = !DILocation(line: 800, column: 9, scope: !1176)
!1180 = !DILocation(line: 801, column: 25, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1172, file: !165, line: 800, column: 45)
!1182 = !DILocation(line: 801, column: 52, scope: !1181)
!1183 = !DILocation(line: 801, column: 55, scope: !1181)
!1184 = !DILocation(line: 801, column: 32, scope: !1181)
!1185 = !DILocation(line: 801, column: 66, scope: !1181)
!1186 = !DILocation(line: 801, column: 20, scope: !1181)
!1187 = !DILocation(line: 801, column: 18, scope: !1181)
!1188 = !DILocation(line: 802, column: 5, scope: !1181)
!1189 = !DILocation(line: 806, column: 9, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !666, file: !165, line: 806, column: 9)
!1191 = !DILocation(line: 806, column: 18, scope: !1190)
!1192 = !DILocation(line: 806, column: 22, scope: !1190)
!1193 = !DILocation(line: 806, column: 30, scope: !1194)
!1194 = !DILexicalBlockFile(scope: !1190, file: !165, discriminator: 1)
!1195 = !DILocation(line: 806, column: 37, scope: !1194)
!1196 = !DILocation(line: 806, column: 66, scope: !1194)
!1197 = !DILocation(line: 806, column: 25, scope: !1194)
!1198 = !DILocation(line: 806, column: 71, scope: !1194)
!1199 = !DILocation(line: 806, column: 9, scope: !1194)
!1200 = !DILocation(line: 807, column: 26, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1190, file: !165, line: 806, column: 76)
!1202 = !DILocation(line: 807, column: 9, scope: !1201)
!1203 = !DILocation(line: 808, column: 9, scope: !1201)
!1204 = !DILocation(line: 811, column: 9, scope: !666)
!1205 = !DILocation(line: 812, column: 17, scope: !666)
!1206 = !DILocation(line: 812, column: 25, scope: !666)
!1207 = !DILocation(line: 812, column: 5, scope: !666)
!1208 = !DILocation(line: 813, column: 40, scope: !666)
!1209 = !DILocation(line: 813, column: 21, scope: !666)
!1210 = !DILocation(line: 813, column: 5, scope: !666)
!1211 = !DILocation(line: 813, column: 8, scope: !666)
!1212 = !DILocation(line: 813, column: 19, scope: !666)
!1213 = !DILocation(line: 815, column: 9, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !666, file: !165, line: 815, column: 9)
!1215 = !DILocation(line: 815, column: 12, scope: !1214)
!1216 = !DILocation(line: 815, column: 9, scope: !666)
!1217 = !DILocation(line: 816, column: 13, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1219, file: !165, line: 816, column: 13)
!1219 = distinct !DILexicalBlock(scope: !1214, file: !165, line: 815, column: 26)
!1220 = !DILocation(line: 816, column: 16, scope: !1218)
!1221 = !DILocation(line: 816, column: 22, scope: !1218)
!1222 = !DILocation(line: 816, column: 13, scope: !1219)
!1223 = !DILocation(line: 818, column: 39, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1225, file: !165, line: 818, column: 17)
!1225 = distinct !DILexicalBlock(scope: !1218, file: !165, line: 816, column: 27)
!1226 = !DILocation(line: 818, column: 47, scope: !1224)
!1227 = !DILocation(line: 818, column: 50, scope: !1224)
!1228 = !DILocation(line: 818, column: 75, scope: !1224)
!1229 = !DILocation(line: 818, column: 78, scope: !1224)
!1230 = !DILocation(line: 818, column: 55, scope: !1224)
!1231 = !DILocation(line: 818, column: 17, scope: !1224)
!1232 = !DILocation(line: 818, column: 89, scope: !1224)
!1233 = !DILocation(line: 818, column: 17, scope: !1225)
!1234 = !DILocation(line: 819, column: 17, scope: !1224)
!1235 = !DILocation(line: 820, column: 9, scope: !1225)
!1236 = !DILocation(line: 821, column: 13, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1219, file: !165, line: 821, column: 13)
!1238 = !DILocation(line: 821, column: 16, scope: !1237)
!1239 = !DILocation(line: 821, column: 22, scope: !1237)
!1240 = !DILocation(line: 821, column: 13, scope: !1219)
!1241 = !DILocation(line: 823, column: 17, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1243, file: !165, line: 823, column: 17)
!1243 = distinct !DILexicalBlock(scope: !1237, file: !165, line: 821, column: 27)
!1244 = !DILocation(line: 823, column: 20, scope: !1242)
!1245 = !DILocation(line: 823, column: 28, scope: !1242)
!1246 = !DILocation(line: 823, column: 17, scope: !1243)
!1247 = !DILocation(line: 824, column: 47, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1249, file: !165, line: 824, column: 21)
!1249 = distinct !DILexicalBlock(scope: !1242, file: !165, line: 823, column: 46)
!1250 = !DILocation(line: 824, column: 50, scope: !1248)
!1251 = !DILocation(line: 825, column: 67, scope: !1248)
!1252 = !DILocation(line: 825, column: 70, scope: !1248)
!1253 = !DILocation(line: 825, column: 47, scope: !1248)
!1254 = !DILocation(line: 826, column: 47, scope: !1248)
!1255 = !DILocation(line: 826, column: 50, scope: !1248)
!1256 = !DILocation(line: 826, column: 66, scope: !1248)
!1257 = !DILocation(line: 826, column: 69, scope: !1248)
!1258 = !DILocation(line: 827, column: 47, scope: !1248)
!1259 = !DILocation(line: 827, column: 50, scope: !1248)
!1260 = !DILocation(line: 827, column: 58, scope: !1248)
!1261 = !DILocation(line: 828, column: 47, scope: !1248)
!1262 = !DILocation(line: 828, column: 50, scope: !1248)
!1263 = !DILocation(line: 828, column: 58, scope: !1248)
!1264 = !DILocation(line: 824, column: 21, scope: !1248)
!1265 = !DILocation(line: 828, column: 79, scope: !1248)
!1266 = !DILocation(line: 824, column: 21, scope: !1249)
!1267 = !DILocation(line: 829, column: 21, scope: !1248)
!1268 = !DILocation(line: 830, column: 13, scope: !1249)
!1269 = !DILocation(line: 831, column: 46, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1271, file: !165, line: 831, column: 21)
!1271 = distinct !DILexicalBlock(scope: !1242, file: !165, line: 830, column: 20)
!1272 = !DILocation(line: 831, column: 74, scope: !1270)
!1273 = !DILocation(line: 831, column: 77, scope: !1270)
!1274 = !DILocation(line: 831, column: 54, scope: !1270)
!1275 = !DILocation(line: 831, column: 107, scope: !1270)
!1276 = !DILocation(line: 831, column: 110, scope: !1270)
!1277 = !DILocation(line: 831, column: 87, scope: !1270)
!1278 = !DILocation(line: 831, column: 21, scope: !1270)
!1279 = !DILocation(line: 831, column: 130, scope: !1270)
!1280 = !DILocation(line: 831, column: 21, scope: !1271)
!1281 = !DILocation(line: 832, column: 21, scope: !1270)
!1282 = !DILocation(line: 834, column: 17, scope: !1283)
!1283 = distinct !DILexicalBlock(scope: !1243, file: !165, line: 834, column: 17)
!1284 = !DILocation(line: 834, column: 20, scope: !1283)
!1285 = !DILocation(line: 834, column: 28, scope: !1283)
!1286 = !DILocation(line: 834, column: 17, scope: !1243)
!1287 = !DILocation(line: 835, column: 47, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1289, file: !165, line: 835, column: 21)
!1289 = distinct !DILexicalBlock(scope: !1283, file: !165, line: 834, column: 46)
!1290 = !DILocation(line: 835, column: 50, scope: !1288)
!1291 = !DILocation(line: 836, column: 67, scope: !1288)
!1292 = !DILocation(line: 836, column: 70, scope: !1288)
!1293 = !DILocation(line: 836, column: 47, scope: !1288)
!1294 = !DILocation(line: 837, column: 47, scope: !1288)
!1295 = !DILocation(line: 837, column: 50, scope: !1288)
!1296 = !DILocation(line: 837, column: 66, scope: !1288)
!1297 = !DILocation(line: 837, column: 69, scope: !1288)
!1298 = !DILocation(line: 838, column: 47, scope: !1288)
!1299 = !DILocation(line: 838, column: 50, scope: !1288)
!1300 = !DILocation(line: 838, column: 58, scope: !1288)
!1301 = !DILocation(line: 839, column: 47, scope: !1288)
!1302 = !DILocation(line: 839, column: 50, scope: !1288)
