; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpdec_h263.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpdec_h263.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RTPDynamicProtocolHandler = type { i8*, i32, i32, i32, i32, i32, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*, i8*)*, void (%struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, %struct.PayloadContext*, %struct.AVStream*, %struct.AVPacket*, i32*, i8*, i32, i16, i32)*, i32 (%struct.PayloadContext*)*, %struct.RTPDynamicProtocolHandler* }

!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !25, line: 1534, size: 32, align: 32, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !25, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !25, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !25, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !918, !919}
!917 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!918 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !922, line: 222, size: 16, align: 8, elements: !923)
!922 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!923 = !{!924}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !921, file: !922, line: 222, baseType: !925, size: 16, align: 16)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !926, line: 49, baseType: !927)
!926 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!927 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!928 = !{!929, !2096}
!929 = distinct !DIGlobalVariable(name: "ff_h263_1998_dynamic_handler", scope: !0, file: !930, line: 92, type: !931, isLocal: false, isDefinition: true, variable: %struct.RTPDynamicProtocolHandler* @ff_h263_1998_dynamic_handler)
!930 = !DIFile(filename: "libavformat/rtpdec_h263.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTPDynamicProtocolHandler", file: !933, line: 33, baseType: !934)
!933 = !DIFile(filename: "libavformat/rtpdec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RTPDynamicProtocolHandler", file: !933, line: 115, size: 640, align: 64, elements: !935)
!935 = !{!936, !940, !941, !942, !943, !944, !945, !2076, !2080, !2084, !2090, !2094}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "enc_name", scope: !934, file: !933, line: 116, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!939 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !934, file: !933, line: 117, baseType: !636, size: 32, align: 32, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !934, file: !933, line: 118, baseType: !55, size: 32, align: 32, offset: 96)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "need_parsing", scope: !934, file: !933, line: 119, baseType: !896, size: 32, align: 32, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "static_payload_id", scope: !934, file: !933, line: 120, baseType: !917, size: 32, align: 32, offset: 160)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !934, file: !933, line: 123, baseType: !917, size: 32, align: 32, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !934, file: !933, line: 126, baseType: !946, size: 64, align: 64, offset: 256)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!917, !949, !917, !2073}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !952)
!952 = !{!953, !995, !1104, !1252, !1253, !1318, !1319, !1320, !1950, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !2004, !2005, !2006, !2007, !2008, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2039, !2040, !2043, !2044, !2045, !2046, !2047, !2048, !2050, !2051, !2052, !2053, !2061, !2062, !2066, !2070, !2071, !2072}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !951, file: !897, line: 1342, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !958)
!958 = !{!959, !960, !965, !969, !970, !971, !972, !976, !982, !984, !988}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !957, file: !4, line: 72, baseType: !937, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !957, file: !4, line: 78, baseType: !961, size: 64, align: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!937, !964}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !957, file: !4, line: 85, baseType: !966, size: 64, align: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !957, file: !4, line: 93, baseType: !917, size: 32, align: 32, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !957, file: !4, line: 99, baseType: !917, size: 32, align: 32, offset: 224)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !957, file: !4, line: 108, baseType: !917, size: 32, align: 32, offset: 256)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !957, file: !4, line: 113, baseType: !973, size: 64, align: 64, offset: 320)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!964, !964, !964}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !957, file: !4, line: 123, baseType: !977, size: 64, align: 64, offset: 384)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!980, !980}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !957, file: !4, line: 130, baseType: !983, size: 32, align: 32, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !957, file: !4, line: 136, baseType: !985, size: 64, align: 64, offset: 512)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!983, !964}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !957, file: !4, line: 142, baseType: !989, size: 64, align: 64, offset: 576)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!917, !992, !964, !937, !917}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !951, file: !897, line: 1349, baseType: !996, size: 64, align: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !998)
!998 = !{!999, !1000, !1001, !1002, !1003, !1009, !1010, !1011, !1012, !1013, !1014, !1028, !1033, !1075, !1076, !1080, !1085, !1086, !1087, !1091, !1097, !1103}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !997, file: !897, line: 638, baseType: !937, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !997, file: !897, line: 645, baseType: !937, size: 64, align: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !997, file: !897, line: 652, baseType: !917, size: 32, align: 32, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !997, file: !897, line: 659, baseType: !937, size: 64, align: 64, offset: 192)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !997, file: !897, line: 661, baseType: !1004, size: 64, align: 64, offset: 256)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1008 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !897, line: 443, flags: DIFlagFwdDecl)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !997, file: !897, line: 663, baseType: !954, size: 64, align: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !997, file: !897, line: 670, baseType: !937, size: 64, align: 64, offset: 384)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !997, file: !897, line: 679, baseType: !996, size: 64, align: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !997, file: !897, line: 684, baseType: !917, size: 32, align: 32, offset: 512)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !997, file: !897, line: 689, baseType: !917, size: 32, align: 32, offset: 544)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !997, file: !897, line: 696, baseType: !1015, size: 64, align: 64, offset: 576)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!917, !1018}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1021)
!1021 = !{!1022, !1023, !1026, !1027}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1020, file: !897, line: 449, baseType: !937, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1020, file: !897, line: 450, baseType: !1024, size: 64, align: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1020, file: !897, line: 451, baseType: !917, size: 32, align: 32, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1020, file: !897, line: 452, baseType: !937, size: 64, align: 64, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !997, file: !897, line: 703, baseType: !1029, size: 64, align: 64, offset: 640)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!917, !1032}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !997, file: !897, line: 714, baseType: !1034, size: 64, align: 64, offset: 704)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!917, !1032, !1037}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !25, line: 1499, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !25, line: 1445, size: 704, align: 64, elements: !1040)
!1040 = !{!1041, !1055, !1058, !1059, !1060, !1061, !1062, !1063, !1071, !1072, !1073, !1074}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1039, file: !25, line: 1451, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1044, line: 94, baseType: !1045)
!1044 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1044, line: 81, size: 192, align: 64, elements: !1046)
!1046 = !{!1047, !1051, !1054}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1045, file: !1044, line: 82, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1044, line: 73, baseType: !1050)
!1050 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1044, line: 73, flags: DIFlagFwdDecl)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1045, file: !1044, line: 89, baseType: !1052, size: 64, align: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !926, line: 48, baseType: !1025)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1045, file: !1044, line: 93, baseType: !917, size: 32, align: 32, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1039, file: !25, line: 1461, baseType: !1056, size: 64, align: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !926, line: 40, baseType: !1057)
!1057 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1039, file: !25, line: 1467, baseType: !1056, size: 64, align: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1039, file: !25, line: 1468, baseType: !1052, size: 64, align: 64, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1039, file: !25, line: 1469, baseType: !917, size: 32, align: 32, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1039, file: !25, line: 1470, baseType: !917, size: 32, align: 32, offset: 288)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1039, file: !25, line: 1474, baseType: !917, size: 32, align: 32, offset: 320)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1039, file: !25, line: 1479, baseType: !1064, size: 64, align: 64, offset: 384)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !25, line: 1415, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !25, line: 1411, size: 128, align: 64, elements: !1067)
!1067 = !{!1068, !1069, !1070}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1066, file: !25, line: 1412, baseType: !1052, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1066, file: !25, line: 1413, baseType: !917, size: 32, align: 32, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1066, file: !25, line: 1414, baseType: !24, size: 32, align: 32, offset: 96)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1039, file: !25, line: 1480, baseType: !917, size: 32, align: 32, offset: 448)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1039, file: !25, line: 1486, baseType: !1056, size: 64, align: 64, offset: 512)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1039, file: !25, line: 1488, baseType: !1056, size: 64, align: 64, offset: 576)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1039, file: !25, line: 1497, baseType: !1056, size: 64, align: 64, offset: 640)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !997, file: !897, line: 720, baseType: !1029, size: 64, align: 64, offset: 768)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !997, file: !897, line: 730, baseType: !1077, size: 64, align: 64, offset: 832)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!917, !1032, !917, !1056, !917}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !997, file: !897, line: 737, baseType: !1081, size: 64, align: 64, offset: 896)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!1056, !1032, !917, !1084, !1056}
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !997, file: !897, line: 744, baseType: !1029, size: 64, align: 64, offset: 960)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !997, file: !897, line: 750, baseType: !1029, size: 64, align: 64, offset: 1024)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !997, file: !897, line: 758, baseType: !1088, size: 64, align: 64, offset: 1088)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!917, !1032, !917, !1056, !1056, !1056, !917}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !997, file: !897, line: 764, baseType: !1092, size: 64, align: 64, offset: 1152)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!917, !1032, !1095}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !997, file: !897, line: 770, baseType: !1098, size: 64, align: 64, offset: 1216)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!917, !1032, !1101}
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !997, file: !897, line: 776, baseType: !1098, size: 64, align: 64, offset: 1280)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !951, file: !897, line: 1356, baseType: !1105, size: 64, align: 64, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1107)
!1107 = !{!1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1127, !1131, !1135, !1142, !1237, !1238, !1239, !1240, !1241, !1242, !1246}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1106, file: !897, line: 498, baseType: !937, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1106, file: !897, line: 504, baseType: !937, size: 64, align: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1106, file: !897, line: 505, baseType: !937, size: 64, align: 64, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1106, file: !897, line: 506, baseType: !937, size: 64, align: 64, offset: 192)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1106, file: !897, line: 508, baseType: !55, size: 32, align: 32, offset: 256)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1106, file: !897, line: 509, baseType: !55, size: 32, align: 32, offset: 288)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1106, file: !897, line: 510, baseType: !55, size: 32, align: 32, offset: 320)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1106, file: !897, line: 517, baseType: !917, size: 32, align: 32, offset: 352)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1106, file: !897, line: 523, baseType: !1004, size: 64, align: 64, offset: 384)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1106, file: !897, line: 526, baseType: !954, size: 64, align: 64, offset: 448)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1106, file: !897, line: 535, baseType: !1105, size: 64, align: 64, offset: 512)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1106, file: !897, line: 539, baseType: !917, size: 32, align: 32, offset: 576)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1106, file: !897, line: 541, baseType: !1029, size: 64, align: 64, offset: 640)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1106, file: !897, line: 549, baseType: !1034, size: 64, align: 64, offset: 704)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1106, file: !897, line: 550, baseType: !1029, size: 64, align: 64, offset: 768)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1106, file: !897, line: 554, baseType: !1124, size: 64, align: 64, offset: 832)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!917, !1032, !1037, !1037, !917}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1106, file: !897, line: 563, baseType: !1128, size: 64, align: 64, offset: 896)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!917, !55, !917}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1106, file: !897, line: 565, baseType: !1132, size: 64, align: 64, offset: 960)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{null, !1032, !917, !1084, !1084}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1106, file: !897, line: 570, baseType: !1136, size: 64, align: 64, offset: 1024)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!917, !1032, !917, !964, !1139}
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1140, line: 216, baseType: !1141)
!1140 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1141 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1106, file: !897, line: 581, baseType: !1143, size: 64, align: 64, offset: 1088)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!917, !1032, !917, !1146, !918}
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1149)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1150)
!1150 = !{!1151, !1155, !1157, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1191, !1193, !1194, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1149, file: !526, line: 282, baseType: !1152, size: 512, align: 64)
!1152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 512, align: 64, elements: !1153)
!1153 = !{!1154}
!1154 = !DISubrange(count: 8)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1149, file: !526, line: 299, baseType: !1156, size: 256, align: 32, offset: 512)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 32, elements: !1153)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1149, file: !526, line: 315, baseType: !1158, size: 64, align: 64, offset: 768)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1149, file: !526, line: 326, baseType: !917, size: 32, align: 32, offset: 832)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1149, file: !526, line: 326, baseType: !917, size: 32, align: 32, offset: 864)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1149, file: !526, line: 334, baseType: !917, size: 32, align: 32, offset: 896)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1149, file: !526, line: 341, baseType: !917, size: 32, align: 32, offset: 928)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1149, file: !526, line: 346, baseType: !917, size: 32, align: 32, offset: 960)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1149, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1149, file: !526, line: 356, baseType: !1166, size: 64, align: 32, offset: 1024)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1167, line: 61, baseType: !1168)
!1167 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1167, line: 58, size: 64, align: 32, elements: !1169)
!1169 = !{!1170, !1171}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1168, file: !1167, line: 59, baseType: !917, size: 32, align: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1168, file: !1167, line: 60, baseType: !917, size: 32, align: 32, offset: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1149, file: !526, line: 361, baseType: !1056, size: 64, align: 64, offset: 1088)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1149, file: !526, line: 369, baseType: !1056, size: 64, align: 64, offset: 1152)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1149, file: !526, line: 377, baseType: !1056, size: 64, align: 64, offset: 1216)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1149, file: !526, line: 382, baseType: !917, size: 32, align: 32, offset: 1280)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1149, file: !526, line: 386, baseType: !917, size: 32, align: 32, offset: 1312)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1149, file: !526, line: 391, baseType: !917, size: 32, align: 32, offset: 1344)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1149, file: !526, line: 396, baseType: !964, size: 64, align: 64, offset: 1408)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1149, file: !526, line: 403, baseType: !1180, size: 512, align: 64, offset: 1472)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1181, size: 512, align: 64, elements: !1153)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !926, line: 55, baseType: !1141)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1149, file: !526, line: 410, baseType: !917, size: 32, align: 32, offset: 1984)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1149, file: !526, line: 415, baseType: !917, size: 32, align: 32, offset: 2016)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1149, file: !526, line: 420, baseType: !917, size: 32, align: 32, offset: 2048)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1149, file: !526, line: 425, baseType: !917, size: 32, align: 32, offset: 2080)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1149, file: !526, line: 435, baseType: !1056, size: 64, align: 64, offset: 2112)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1149, file: !526, line: 440, baseType: !917, size: 32, align: 32, offset: 2176)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1149, file: !526, line: 445, baseType: !1181, size: 64, align: 64, offset: 2240)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1149, file: !526, line: 459, baseType: !1190, size: 512, align: 64, offset: 2304)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 512, align: 64, elements: !1153)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1149, file: !526, line: 473, baseType: !1192, size: 64, align: 64, offset: 2816)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1149, file: !526, line: 477, baseType: !917, size: 32, align: 32, offset: 2880)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1149, file: !526, line: 479, baseType: !1195, size: 64, align: 64, offset: 2944)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1199)
!1199 = !{!1200, !1201, !1202, !1203, !1208}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1198, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1198, file: !526, line: 203, baseType: !1052, size: 64, align: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1198, file: !526, line: 204, baseType: !917, size: 32, align: 32, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1198, file: !526, line: 205, baseType: !1204, size: 64, align: 64, offset: 192)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1206, line: 86, baseType: !1207)
!1206 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1207 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1206, line: 86, flags: DIFlagFwdDecl)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1198, file: !526, line: 206, baseType: !1042, size: 64, align: 64, offset: 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1149, file: !526, line: 480, baseType: !917, size: 32, align: 32, offset: 3008)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1149, file: !526, line: 505, baseType: !917, size: 32, align: 32, offset: 3040)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1149, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1149, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1149, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1149, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1149, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1149, file: !526, line: 532, baseType: !1056, size: 64, align: 64, offset: 3264)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1149, file: !526, line: 539, baseType: !1056, size: 64, align: 64, offset: 3328)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1149, file: !526, line: 547, baseType: !1056, size: 64, align: 64, offset: 3392)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1149, file: !526, line: 554, baseType: !1204, size: 64, align: 64, offset: 3456)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1149, file: !526, line: 563, baseType: !917, size: 32, align: 32, offset: 3520)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1149, file: !526, line: 572, baseType: !917, size: 32, align: 32, offset: 3552)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1149, file: !526, line: 581, baseType: !917, size: 32, align: 32, offset: 3584)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1149, file: !526, line: 588, baseType: !1224, size: 64, align: 64, offset: 3648)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !926, line: 36, baseType: !1226)
!1226 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1149, file: !526, line: 593, baseType: !917, size: 32, align: 32, offset: 3712)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1149, file: !526, line: 596, baseType: !917, size: 32, align: 32, offset: 3744)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1149, file: !526, line: 599, baseType: !1042, size: 64, align: 64, offset: 3776)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1149, file: !526, line: 605, baseType: !1042, size: 64, align: 64, offset: 3840)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1149, file: !526, line: 616, baseType: !1042, size: 64, align: 64, offset: 3904)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1149, file: !526, line: 626, baseType: !1139, size: 64, align: 64, offset: 3968)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1149, file: !526, line: 627, baseType: !1139, size: 64, align: 64, offset: 4032)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1149, file: !526, line: 628, baseType: !1139, size: 64, align: 64, offset: 4096)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1149, file: !526, line: 629, baseType: !1139, size: 64, align: 64, offset: 4160)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1149, file: !526, line: 645, baseType: !1042, size: 64, align: 64, offset: 4224)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1106, file: !897, line: 587, baseType: !1092, size: 64, align: 64, offset: 1152)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1106, file: !897, line: 592, baseType: !1098, size: 64, align: 64, offset: 1216)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1106, file: !897, line: 597, baseType: !1098, size: 64, align: 64, offset: 1280)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1106, file: !897, line: 598, baseType: !55, size: 32, align: 32, offset: 1344)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1106, file: !897, line: 608, baseType: !1029, size: 64, align: 64, offset: 1408)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1106, file: !897, line: 617, baseType: !1243, size: 64, align: 64, offset: 1472)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{null, !1032}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1106, file: !897, line: 623, baseType: !1247, size: 64, align: 64, offset: 1536)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!917, !1032, !1250}
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !951, file: !897, line: 1365, baseType: !964, size: 64, align: 64, offset: 192)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !951, file: !897, line: 1379, baseType: !1254, size: 64, align: 64, offset: 256)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1257)
!1257 = !{!1258, !1259, !1260, !1261, !1262, !1263, !1264, !1268, !1269, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1285, !1286, !1290, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1308, !1309, !1310, !1311, !1315, !1316, !1317}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1256, file: !628, line: 174, baseType: !954, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1256, file: !628, line: 226, baseType: !1024, size: 64, align: 64, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1256, file: !628, line: 227, baseType: !917, size: 32, align: 32, offset: 128)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1256, file: !628, line: 228, baseType: !1024, size: 64, align: 64, offset: 192)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1256, file: !628, line: 229, baseType: !1024, size: 64, align: 64, offset: 256)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1256, file: !628, line: 233, baseType: !964, size: 64, align: 64, offset: 320)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1256, file: !628, line: 235, baseType: !1265, size: 64, align: 64, offset: 384)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!917, !964, !1052, !917}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1256, file: !628, line: 236, baseType: !1265, size: 64, align: 64, offset: 448)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1256, file: !628, line: 237, baseType: !1270, size: 64, align: 64, offset: 512)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!1056, !964, !1056, !917}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1256, file: !628, line: 238, baseType: !1056, size: 64, align: 64, offset: 576)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1256, file: !628, line: 239, baseType: !917, size: 32, align: 32, offset: 640)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1256, file: !628, line: 240, baseType: !917, size: 32, align: 32, offset: 672)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1256, file: !628, line: 241, baseType: !917, size: 32, align: 32, offset: 704)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1256, file: !628, line: 242, baseType: !1141, size: 64, align: 64, offset: 768)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1256, file: !628, line: 243, baseType: !1024, size: 64, align: 64, offset: 832)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1256, file: !628, line: 244, baseType: !1280, size: 64, align: 64, offset: 896)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!1141, !1141, !1283, !918}
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1256, file: !628, line: 245, baseType: !917, size: 32, align: 32, offset: 960)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1256, file: !628, line: 249, baseType: !1287, size: 64, align: 64, offset: 1024)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!917, !964, !917}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1256, file: !628, line: 255, baseType: !1291, size: 64, align: 64, offset: 1088)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!1056, !964, !917, !1056, !917}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1256, file: !628, line: 260, baseType: !917, size: 32, align: 32, offset: 1152)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1256, file: !628, line: 266, baseType: !1056, size: 64, align: 64, offset: 1216)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1256, file: !628, line: 273, baseType: !917, size: 32, align: 32, offset: 1280)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1256, file: !628, line: 279, baseType: !1056, size: 64, align: 64, offset: 1344)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1256, file: !628, line: 285, baseType: !917, size: 32, align: 32, offset: 1408)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1256, file: !628, line: 291, baseType: !917, size: 32, align: 32, offset: 1440)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1256, file: !628, line: 298, baseType: !917, size: 32, align: 32, offset: 1472)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1256, file: !628, line: 304, baseType: !917, size: 32, align: 32, offset: 1504)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1256, file: !628, line: 309, baseType: !937, size: 64, align: 64, offset: 1536)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1256, file: !628, line: 314, baseType: !937, size: 64, align: 64, offset: 1600)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1256, file: !628, line: 319, baseType: !1305, size: 64, align: 64, offset: 1664)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DISubroutineType(types: !1307)
!1307 = !{!917, !964, !1052, !917, !627, !1056}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1256, file: !628, line: 326, baseType: !917, size: 32, align: 32, offset: 1728)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1256, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1256, file: !628, line: 332, baseType: !1056, size: 64, align: 64, offset: 1792)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1256, file: !628, line: 338, baseType: !1312, size: 64, align: 64, offset: 1856)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!917, !964}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1256, file: !628, line: 340, baseType: !1056, size: 64, align: 64, offset: 1920)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1256, file: !628, line: 346, baseType: !1024, size: 64, align: 64, offset: 1984)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1256, file: !628, line: 351, baseType: !917, size: 32, align: 32, offset: 2048)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !951, file: !897, line: 1386, baseType: !917, size: 32, align: 32, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !951, file: !897, line: 1393, baseType: !918, size: 32, align: 32, offset: 352)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !951, file: !897, line: 1405, baseType: !1321, size: 64, align: 64, offset: 384)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1324)
!1324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1325)
!1325 = !{!1326, !1327, !1328, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1797, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1898, !1904, !1905, !1909, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1941, !1942, !1943, !1944, !1945, !1946}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1324, file: !897, line: 866, baseType: !917, size: 32, align: 32)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1324, file: !897, line: 872, baseType: !917, size: 32, align: 32, offset: 32)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1324, file: !897, line: 878, baseType: !1329, size: 64, align: 64, offset: 64)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !25, line: 3360, baseType: !1331)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !25, line: 1556, size: 8448, align: 64, elements: !1332)
!1332 = !{!1333, !1334, !1335, !1336, !1472, !1473, !1474, !1475, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1501, !1505, !1506, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1685, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1331, file: !25, line: 1561, baseType: !954, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1331, file: !25, line: 1562, baseType: !917, size: 32, align: 32, offset: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1331, file: !25, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1331, file: !25, line: 1565, baseType: !1337, size: 64, align: 64, offset: 128)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1339)
!1339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !25, line: 3468, size: 1984, align: 64, elements: !1340)
!1340 = !{!1341, !1342, !1343, !1344, !1345, !1346, !1349, !1352, !1355, !1358, !1361, !1362, !1363, !1371, !1372, !1373, !1375, !1379, !1385, !1390, !1394, !1395, !1437, !1444, !1448, !1449, !1453, !1457, !1461, !1465, !1466, !1467}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1339, file: !25, line: 3475, baseType: !937, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1339, file: !25, line: 3480, baseType: !937, size: 64, align: 64, offset: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1339, file: !25, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1339, file: !25, line: 3482, baseType: !55, size: 32, align: 32, offset: 160)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1339, file: !25, line: 3487, baseType: !917, size: 32, align: 32, offset: 192)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1339, file: !25, line: 3488, baseType: !1347, size: 64, align: 64, offset: 256)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1166)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1339, file: !25, line: 3489, baseType: !1350, size: 64, align: 64, offset: 320)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1339, file: !25, line: 3490, baseType: !1353, size: 64, align: 64, offset: 384)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1339, file: !25, line: 3491, baseType: !1356, size: 64, align: 64, offset: 448)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1339, file: !25, line: 3492, baseType: !1359, size: 64, align: 64, offset: 512)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1181)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1339, file: !25, line: 3493, baseType: !1053, size: 8, align: 8, offset: 576)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1339, file: !25, line: 3494, baseType: !954, size: 64, align: 64, offset: 640)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1339, file: !25, line: 3495, baseType: !1364, size: 64, align: 64, offset: 704)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1366)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !25, line: 3404, baseType: !1367)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !25, line: 3401, size: 128, align: 64, elements: !1368)
!1368 = !{!1369, !1370}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1367, file: !25, line: 3402, baseType: !917, size: 32, align: 32)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1367, file: !25, line: 3403, baseType: !937, size: 64, align: 64, offset: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1339, file: !25, line: 3507, baseType: !937, size: 64, align: 64, offset: 768)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1339, file: !25, line: 3516, baseType: !917, size: 32, align: 32, offset: 832)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1339, file: !25, line: 3517, baseType: !1374, size: 64, align: 64, offset: 896)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1339, file: !25, line: 3527, baseType: !1376, size: 64, align: 64, offset: 960)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DISubroutineType(types: !1378)
!1378 = !{!917, !1329}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1339, file: !25, line: 3535, baseType: !1380, size: 64, align: 64, offset: 1024)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DISubroutineType(types: !1382)
!1382 = !{!917, !1329, !1383}
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1330)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1339, file: !25, line: 3541, baseType: !1386, size: 64, align: 64, offset: 1088)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1388)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !25, line: 3461, baseType: !1389)
!1389 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !25, line: 3461, flags: DIFlagFwdDecl)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1339, file: !25, line: 3549, baseType: !1391, size: 64, align: 64, offset: 1152)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DISubroutineType(types: !1393)
!1393 = !{null, !1374}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1339, file: !25, line: 3551, baseType: !1376, size: 64, align: 64, offset: 1216)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1339, file: !25, line: 3552, baseType: !1396, size: 64, align: 64, offset: 1280)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DISubroutineType(types: !1398)
!1398 = !{!917, !1329, !1052, !917, !1399}
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1401)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !25, line: 3920, size: 256, align: 64, elements: !1402)
!1402 = !{!1403, !1404, !1406, !1407, !1408, !1436}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1401, file: !25, line: 3921, baseType: !925, size: 16, align: 16)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1401, file: !25, line: 3922, baseType: !1405, size: 32, align: 32, offset: 32)
!1405 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !926, line: 51, baseType: !918)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1401, file: !25, line: 3923, baseType: !1405, size: 32, align: 32, offset: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1401, file: !25, line: 3924, baseType: !918, size: 32, align: 32, offset: 96)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1401, file: !25, line: 3925, baseType: !1409, size: 64, align: 64, offset: 128)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !25, line: 3918, baseType: !1412)
!1412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !25, line: 3885, size: 1600, align: 64, elements: !1413)
!1413 = !{!1414, !1415, !1416, !1417, !1418, !1419, !1425, !1429, !1431, !1432, !1434, !1435}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1412, file: !25, line: 3886, baseType: !917, size: 32, align: 32)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1412, file: !25, line: 3887, baseType: !917, size: 32, align: 32, offset: 32)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1412, file: !25, line: 3888, baseType: !917, size: 32, align: 32, offset: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1412, file: !25, line: 3889, baseType: !917, size: 32, align: 32, offset: 96)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1412, file: !25, line: 3890, baseType: !917, size: 32, align: 32, offset: 128)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1412, file: !25, line: 3897, baseType: !1420, size: 768, align: 64, offset: 192)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !25, line: 3858, baseType: !1421)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !25, line: 3853, size: 768, align: 64, elements: !1422)
!1422 = !{!1423, !1424}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1421, file: !25, line: 3855, baseType: !1152, size: 512, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1421, file: !25, line: 3857, baseType: !1156, size: 256, align: 32, offset: 512)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1412, file: !25, line: 3903, baseType: !1426, size: 256, align: 64, offset: 960)
!1426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 256, align: 64, elements: !1427)
!1427 = !{!1428}
!1428 = !DISubrange(count: 4)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1412, file: !25, line: 3904, baseType: !1430, size: 128, align: 32, offset: 1216)
!1430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 128, align: 32, elements: !1427)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1412, file: !25, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1412, file: !25, line: 3908, baseType: !1433, size: 64, align: 64, offset: 1408)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1412, file: !25, line: 3915, baseType: !1433, size: 64, align: 64, offset: 1472)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1412, file: !25, line: 3917, baseType: !917, size: 32, align: 32, offset: 1536)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1401, file: !25, line: 3926, baseType: !1056, size: 64, align: 64, offset: 192)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1339, file: !25, line: 3564, baseType: !1438, size: 64, align: 64, offset: 1344)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DISubroutineType(types: !1440)
!1440 = !{!917, !1329, !1037, !1441, !1443}
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1148)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1339, file: !25, line: 3566, baseType: !1445, size: 64, align: 64, offset: 1408)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DISubroutineType(types: !1447)
!1447 = !{!917, !1329, !964, !1443, !1037}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1339, file: !25, line: 3567, baseType: !1376, size: 64, align: 64, offset: 1472)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1339, file: !25, line: 3576, baseType: !1450, size: 64, align: 64, offset: 1536)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DISubroutineType(types: !1452)
!1452 = !{!917, !1329, !1441}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1339, file: !25, line: 3577, baseType: !1454, size: 64, align: 64, offset: 1600)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DISubroutineType(types: !1456)
!1456 = !{!917, !1329, !1037}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1339, file: !25, line: 3584, baseType: !1458, size: 64, align: 64, offset: 1664)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{!917, !1329, !1147}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1339, file: !25, line: 3589, baseType: !1462, size: 64, align: 64, offset: 1728)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{null, !1329}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1339, file: !25, line: 3594, baseType: !917, size: 32, align: 32, offset: 1792)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1339, file: !25, line: 3600, baseType: !937, size: 64, align: 64, offset: 1856)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1339, file: !25, line: 3609, baseType: !1468, size: 64, align: 64, offset: 1920)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1471)
!1471 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !25, line: 3609, flags: DIFlagFwdDecl)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1331, file: !25, line: 1566, baseType: !55, size: 32, align: 32, offset: 192)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1331, file: !25, line: 1581, baseType: !918, size: 32, align: 32, offset: 224)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1331, file: !25, line: 1583, baseType: !964, size: 64, align: 64, offset: 256)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1331, file: !25, line: 1591, baseType: !1476, size: 64, align: 64, offset: 320)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !25, line: 1532, flags: DIFlagFwdDecl)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1331, file: !25, line: 1598, baseType: !964, size: 64, align: 64, offset: 384)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1331, file: !25, line: 1606, baseType: !1056, size: 64, align: 64, offset: 448)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1331, file: !25, line: 1614, baseType: !917, size: 32, align: 32, offset: 512)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1331, file: !25, line: 1622, baseType: !917, size: 32, align: 32, offset: 544)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1331, file: !25, line: 1628, baseType: !917, size: 32, align: 32, offset: 576)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1331, file: !25, line: 1636, baseType: !917, size: 32, align: 32, offset: 608)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1331, file: !25, line: 1643, baseType: !917, size: 32, align: 32, offset: 640)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1331, file: !25, line: 1657, baseType: !1052, size: 64, align: 64, offset: 704)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1331, file: !25, line: 1658, baseType: !917, size: 32, align: 32, offset: 768)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1331, file: !25, line: 1679, baseType: !1166, size: 64, align: 32, offset: 800)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1331, file: !25, line: 1688, baseType: !917, size: 32, align: 32, offset: 864)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1331, file: !25, line: 1712, baseType: !917, size: 32, align: 32, offset: 896)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1331, file: !25, line: 1729, baseType: !917, size: 32, align: 32, offset: 928)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1331, file: !25, line: 1729, baseType: !917, size: 32, align: 32, offset: 960)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1331, file: !25, line: 1744, baseType: !917, size: 32, align: 32, offset: 992)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1331, file: !25, line: 1744, baseType: !917, size: 32, align: 32, offset: 1024)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1331, file: !25, line: 1751, baseType: !917, size: 32, align: 32, offset: 1056)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1331, file: !25, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1331, file: !25, line: 1791, baseType: !1497, size: 64, align: 64, offset: 1152)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{null, !1500, !1441, !1443, !917, !917, !917}
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1331, file: !25, line: 1808, baseType: !1502, size: 64, align: 64, offset: 1216)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{!645, !1500, !1350}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1331, file: !25, line: 1816, baseType: !917, size: 32, align: 32, offset: 1280)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1331, file: !25, line: 1825, baseType: !1507, size: 32, align: 32, offset: 1312)
!1507 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1331, file: !25, line: 1830, baseType: !917, size: 32, align: 32, offset: 1344)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1331, file: !25, line: 1838, baseType: !1507, size: 32, align: 32, offset: 1376)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1331, file: !25, line: 1846, baseType: !917, size: 32, align: 32, offset: 1408)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1331, file: !25, line: 1851, baseType: !917, size: 32, align: 32, offset: 1440)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1331, file: !25, line: 1861, baseType: !1507, size: 32, align: 32, offset: 1472)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1331, file: !25, line: 1868, baseType: !1507, size: 32, align: 32, offset: 1504)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1331, file: !25, line: 1875, baseType: !1507, size: 32, align: 32, offset: 1536)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1331, file: !25, line: 1882, baseType: !1507, size: 32, align: 32, offset: 1568)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1331, file: !25, line: 1889, baseType: !1507, size: 32, align: 32, offset: 1600)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1331, file: !25, line: 1896, baseType: !1507, size: 32, align: 32, offset: 1632)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1331, file: !25, line: 1903, baseType: !1507, size: 32, align: 32, offset: 1664)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1331, file: !25, line: 1910, baseType: !917, size: 32, align: 32, offset: 1696)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1331, file: !25, line: 1915, baseType: !917, size: 32, align: 32, offset: 1728)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1331, file: !25, line: 1926, baseType: !1443, size: 64, align: 64, offset: 1792)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1331, file: !25, line: 1935, baseType: !1166, size: 64, align: 32, offset: 1856)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1331, file: !25, line: 1942, baseType: !917, size: 32, align: 32, offset: 1920)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1331, file: !25, line: 1948, baseType: !917, size: 32, align: 32, offset: 1952)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1331, file: !25, line: 1954, baseType: !917, size: 32, align: 32, offset: 1984)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1331, file: !25, line: 1960, baseType: !917, size: 32, align: 32, offset: 2016)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1331, file: !25, line: 1984, baseType: !917, size: 32, align: 32, offset: 2048)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1331, file: !25, line: 1991, baseType: !917, size: 32, align: 32, offset: 2080)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1331, file: !25, line: 1996, baseType: !917, size: 32, align: 32, offset: 2112)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1331, file: !25, line: 2004, baseType: !917, size: 32, align: 32, offset: 2144)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1331, file: !25, line: 2011, baseType: !917, size: 32, align: 32, offset: 2176)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1331, file: !25, line: 2018, baseType: !917, size: 32, align: 32, offset: 2208)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1331, file: !25, line: 2027, baseType: !917, size: 32, align: 32, offset: 2240)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1331, file: !25, line: 2034, baseType: !917, size: 32, align: 32, offset: 2272)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1331, file: !25, line: 2044, baseType: !917, size: 32, align: 32, offset: 2304)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1331, file: !25, line: 2054, baseType: !1537, size: 64, align: 64, offset: 2368)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1331, file: !25, line: 2061, baseType: !1537, size: 64, align: 64, offset: 2432)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1331, file: !25, line: 2066, baseType: !917, size: 32, align: 32, offset: 2496)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1331, file: !25, line: 2070, baseType: !917, size: 32, align: 32, offset: 2528)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1331, file: !25, line: 2078, baseType: !917, size: 32, align: 32, offset: 2560)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1331, file: !25, line: 2085, baseType: !917, size: 32, align: 32, offset: 2592)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1331, file: !25, line: 2092, baseType: !917, size: 32, align: 32, offset: 2624)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1331, file: !25, line: 2099, baseType: !917, size: 32, align: 32, offset: 2656)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1331, file: !25, line: 2106, baseType: !917, size: 32, align: 32, offset: 2688)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1331, file: !25, line: 2113, baseType: !917, size: 32, align: 32, offset: 2720)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1331, file: !25, line: 2120, baseType: !917, size: 32, align: 32, offset: 2752)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1331, file: !25, line: 2125, baseType: !917, size: 32, align: 32, offset: 2784)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1331, file: !25, line: 2133, baseType: !917, size: 32, align: 32, offset: 2816)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1331, file: !25, line: 2140, baseType: !917, size: 32, align: 32, offset: 2848)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1331, file: !25, line: 2145, baseType: !917, size: 32, align: 32, offset: 2880)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1331, file: !25, line: 2153, baseType: !917, size: 32, align: 32, offset: 2912)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1331, file: !25, line: 2158, baseType: !917, size: 32, align: 32, offset: 2944)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1331, file: !25, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1331, file: !25, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1331, file: !25, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1331, file: !25, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1331, file: !25, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1331, file: !25, line: 2203, baseType: !917, size: 32, align: 32, offset: 3136)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1331, file: !25, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1331, file: !25, line: 2212, baseType: !917, size: 32, align: 32, offset: 3200)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1331, file: !25, line: 2213, baseType: !917, size: 32, align: 32, offset: 3232)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1331, file: !25, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1331, file: !25, line: 2232, baseType: !917, size: 32, align: 32, offset: 3296)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1331, file: !25, line: 2243, baseType: !917, size: 32, align: 32, offset: 3328)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1331, file: !25, line: 2249, baseType: !917, size: 32, align: 32, offset: 3360)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1331, file: !25, line: 2256, baseType: !917, size: 32, align: 32, offset: 3392)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1331, file: !25, line: 2263, baseType: !1181, size: 64, align: 64, offset: 3456)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1331, file: !25, line: 2270, baseType: !1181, size: 64, align: 64, offset: 3520)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1331, file: !25, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1331, file: !25, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1331, file: !25, line: 2367, baseType: !1573, size: 64, align: 64, offset: 3648)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DISubroutineType(types: !1575)
!1575 = !{!917, !1500, !1147, !917}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1331, file: !25, line: 2383, baseType: !917, size: 32, align: 32, offset: 3712)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1331, file: !25, line: 2386, baseType: !1507, size: 32, align: 32, offset: 3744)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1331, file: !25, line: 2387, baseType: !1507, size: 32, align: 32, offset: 3776)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1331, file: !25, line: 2394, baseType: !917, size: 32, align: 32, offset: 3808)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1331, file: !25, line: 2401, baseType: !917, size: 32, align: 32, offset: 3840)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1331, file: !25, line: 2408, baseType: !917, size: 32, align: 32, offset: 3872)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1331, file: !25, line: 2415, baseType: !917, size: 32, align: 32, offset: 3904)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1331, file: !25, line: 2422, baseType: !917, size: 32, align: 32, offset: 3936)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1331, file: !25, line: 2423, baseType: !1585, size: 64, align: 64, offset: 3968)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !25, line: 831, baseType: !1587)
!1587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !25, line: 826, size: 128, align: 32, elements: !1588)
!1588 = !{!1589, !1590, !1591, !1592}
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1587, file: !25, line: 827, baseType: !917, size: 32, align: 32)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1587, file: !25, line: 828, baseType: !917, size: 32, align: 32, offset: 32)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1587, file: !25, line: 829, baseType: !917, size: 32, align: 32, offset: 64)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1587, file: !25, line: 830, baseType: !1507, size: 32, align: 32, offset: 96)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1331, file: !25, line: 2430, baseType: !1056, size: 64, align: 64, offset: 4032)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1331, file: !25, line: 2437, baseType: !1056, size: 64, align: 64, offset: 4096)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1331, file: !25, line: 2444, baseType: !1507, size: 32, align: 32, offset: 4160)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1331, file: !25, line: 2451, baseType: !1507, size: 32, align: 32, offset: 4192)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1331, file: !25, line: 2458, baseType: !917, size: 32, align: 32, offset: 4224)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1331, file: !25, line: 2469, baseType: !917, size: 32, align: 32, offset: 4256)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1331, file: !25, line: 2475, baseType: !917, size: 32, align: 32, offset: 4288)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1331, file: !25, line: 2481, baseType: !917, size: 32, align: 32, offset: 4320)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1331, file: !25, line: 2485, baseType: !917, size: 32, align: 32, offset: 4352)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1331, file: !25, line: 2489, baseType: !917, size: 32, align: 32, offset: 4384)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1331, file: !25, line: 2493, baseType: !917, size: 32, align: 32, offset: 4416)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1331, file: !25, line: 2501, baseType: !917, size: 32, align: 32, offset: 4448)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1331, file: !25, line: 2506, baseType: !917, size: 32, align: 32, offset: 4480)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1331, file: !25, line: 2510, baseType: !917, size: 32, align: 32, offset: 4512)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1331, file: !25, line: 2514, baseType: !1056, size: 64, align: 64, offset: 4544)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1331, file: !25, line: 2528, baseType: !1609, size: 64, align: 64, offset: 4608)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DISubroutineType(types: !1611)
!1611 = !{null, !1500, !964, !917, !917}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1331, file: !25, line: 2534, baseType: !917, size: 32, align: 32, offset: 4672)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1331, file: !25, line: 2545, baseType: !917, size: 32, align: 32, offset: 4704)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1331, file: !25, line: 2547, baseType: !917, size: 32, align: 32, offset: 4736)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1331, file: !25, line: 2549, baseType: !917, size: 32, align: 32, offset: 4768)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1331, file: !25, line: 2551, baseType: !917, size: 32, align: 32, offset: 4800)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1331, file: !25, line: 2553, baseType: !917, size: 32, align: 32, offset: 4832)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1331, file: !25, line: 2555, baseType: !917, size: 32, align: 32, offset: 4864)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1331, file: !25, line: 2557, baseType: !917, size: 32, align: 32, offset: 4896)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1331, file: !25, line: 2559, baseType: !917, size: 32, align: 32, offset: 4928)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1331, file: !25, line: 2563, baseType: !917, size: 32, align: 32, offset: 4960)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1331, file: !25, line: 2571, baseType: !1433, size: 64, align: 64, offset: 4992)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1331, file: !25, line: 2579, baseType: !1433, size: 64, align: 64, offset: 5056)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1331, file: !25, line: 2586, baseType: !917, size: 32, align: 32, offset: 5120)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1331, file: !25, line: 2615, baseType: !917, size: 32, align: 32, offset: 5152)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1331, file: !25, line: 2627, baseType: !917, size: 32, align: 32, offset: 5184)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1331, file: !25, line: 2637, baseType: !917, size: 32, align: 32, offset: 5216)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1331, file: !25, line: 2681, baseType: !917, size: 32, align: 32, offset: 5248)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1331, file: !25, line: 2709, baseType: !1056, size: 64, align: 64, offset: 5312)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1331, file: !25, line: 2716, baseType: !1631, size: 64, align: 64, offset: 5376)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64, align: 64)
!1632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1633)
!1633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !25, line: 3636, size: 896, align: 64, elements: !1634)
!1634 = !{!1635, !1636, !1637, !1638, !1639, !1640, !1641, !1645, !1649, !1650, !1651, !1652, !1658, !1659, !1660, !1661, !1662}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1633, file: !25, line: 3642, baseType: !937, size: 64, align: 64)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1633, file: !25, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1633, file: !25, line: 3656, baseType: !55, size: 32, align: 32, offset: 96)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1633, file: !25, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1633, file: !25, line: 3669, baseType: !917, size: 32, align: 32, offset: 160)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1633, file: !25, line: 3682, baseType: !1458, size: 64, align: 64, offset: 192)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1633, file: !25, line: 3698, baseType: !1642, size: 64, align: 64, offset: 256)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{!917, !1329, !1283, !1405}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1633, file: !25, line: 3712, baseType: !1646, size: 64, align: 64, offset: 320)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{!917, !1329, !917, !1283, !1405}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1633, file: !25, line: 3726, baseType: !1642, size: 64, align: 64, offset: 384)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1633, file: !25, line: 3737, baseType: !1376, size: 64, align: 64, offset: 448)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1633, file: !25, line: 3746, baseType: !917, size: 32, align: 32, offset: 512)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1633, file: !25, line: 3757, baseType: !1653, size: 64, align: 64, offset: 576)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DISubroutineType(types: !1655)
!1655 = !{null, !1656}
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !25, line: 3617, flags: DIFlagFwdDecl)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1633, file: !25, line: 3766, baseType: !1376, size: 64, align: 64, offset: 640)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1633, file: !25, line: 3774, baseType: !1376, size: 64, align: 64, offset: 704)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1633, file: !25, line: 3780, baseType: !917, size: 32, align: 32, offset: 768)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1633, file: !25, line: 3785, baseType: !917, size: 32, align: 32, offset: 800)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1633, file: !25, line: 3795, baseType: !1663, size: 64, align: 64, offset: 832)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{!917, !1329, !1042}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1331, file: !25, line: 2728, baseType: !964, size: 64, align: 64, offset: 5440)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1331, file: !25, line: 2735, baseType: !1180, size: 512, align: 64, offset: 5504)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1331, file: !25, line: 2742, baseType: !917, size: 32, align: 32, offset: 6016)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1331, file: !25, line: 2755, baseType: !917, size: 32, align: 32, offset: 6048)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1331, file: !25, line: 2776, baseType: !917, size: 32, align: 32, offset: 6080)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1331, file: !25, line: 2783, baseType: !917, size: 32, align: 32, offset: 6112)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1331, file: !25, line: 2791, baseType: !917, size: 32, align: 32, offset: 6144)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1331, file: !25, line: 2802, baseType: !1147, size: 64, align: 64, offset: 6208)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1331, file: !25, line: 2811, baseType: !917, size: 32, align: 32, offset: 6272)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1331, file: !25, line: 2821, baseType: !917, size: 32, align: 32, offset: 6304)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1331, file: !25, line: 2830, baseType: !917, size: 32, align: 32, offset: 6336)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1331, file: !25, line: 2840, baseType: !917, size: 32, align: 32, offset: 6368)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1331, file: !25, line: 2851, baseType: !1679, size: 64, align: 64, offset: 6400)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DISubroutineType(types: !1681)
!1681 = !{!917, !1500, !1682, !964, !1443, !917, !917}
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64, align: 64)
!1683 = !DISubroutineType(types: !1684)
!1684 = !{!917, !1500, !964}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1331, file: !25, line: 2871, baseType: !1686, size: 64, align: 64, offset: 6464)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64, align: 64)
!1687 = !DISubroutineType(types: !1688)
!1688 = !{!917, !1500, !1689, !964, !1443, !917}
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1690 = !DISubroutineType(types: !1691)
!1691 = !{!917, !1500, !964, !917, !917}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1331, file: !25, line: 2878, baseType: !917, size: 32, align: 32, offset: 6528)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1331, file: !25, line: 2885, baseType: !917, size: 32, align: 32, offset: 6560)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1331, file: !25, line: 3005, baseType: !917, size: 32, align: 32, offset: 6592)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1331, file: !25, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1331, file: !25, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1331, file: !25, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1331, file: !25, line: 3037, baseType: !1052, size: 64, align: 64, offset: 6720)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1331, file: !25, line: 3038, baseType: !917, size: 32, align: 32, offset: 6784)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1331, file: !25, line: 3050, baseType: !1181, size: 64, align: 64, offset: 6848)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1331, file: !25, line: 3065, baseType: !917, size: 32, align: 32, offset: 6912)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1331, file: !25, line: 3083, baseType: !917, size: 32, align: 32, offset: 6944)
