; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--oggparsedaala.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--oggparsedaala.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ogg_codec = type { i8*, i8, i8*, i32 (%struct.AVFormatContext*, i32)*, i32 (%struct.AVFormatContext*, i32)*, i64 (%struct.AVFormatContext*, i32, i64, i64*)*, i32, i32, void (%struct.AVFormatContext*, i32)* }

!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !25, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !25, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !25, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !918, !919, !920, !925, !932}
!917 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!918 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !923, line: 48, baseType: !924)
!923 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!924 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !928, line: 221, size: 32, align: 8, elements: !929)
!928 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!929 = !{!930}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !927, file: !928, line: 221, baseType: !931, size: 32, align: 32)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !923, line: 51, baseType: !918)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !933, line: 197, baseType: !934)
!933 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!934 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!935 = !{!936, !2169}
!936 = distinct !DIGlobalVariable(name: "ff_daala_codec", scope: !0, file: !937, line: 252, type: !938, isLocal: false, isDefinition: true, variable: %struct.ogg_codec* @ff_daala_codec)
!937 = !DIFile(filename: "libavformat/oggparsedaala.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ogg_codec", file: !940, line: 31, size: 512, align: 64, elements: !941)
!940 = !DIFile(filename: "libavformat/oggdec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!941 = !{!942, !947, !948, !949, !2158, !2159, !2163, !2164, !2165}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !939, file: !940, line: 32, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !933, line: 194, baseType: !946)
!946 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "magicsize", scope: !939, file: !940, line: 33, baseType: !922, size: 8, align: 8, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !939, file: !940, line: 34, baseType: !943, size: 64, align: 64, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !939, file: !940, line: 41, baseType: !950, size: 64, align: 64, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!917, !953, !917}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !956)
!956 = !{!957, !1001, !1110, !1256, !1257, !1320, !1321, !1322, !2015, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2069, !2070, !2071, !2072, !2073, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2124, !2125, !2128, !2129, !2130, !2131, !2132, !2133, !2135, !2136, !2137, !2138, !2146, !2147, !2151, !2155, !2156, !2157}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !955, file: !897, line: 1342, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !962)
!962 = !{!963, !967, !971, !975, !976, !977, !978, !982, !988, !990, !994}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !961, file: !4, line: 72, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !961, file: !4, line: 78, baseType: !968, size: 64, align: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!964, !919}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !961, file: !4, line: 85, baseType: !972, size: 64, align: 64, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !961, file: !4, line: 93, baseType: !917, size: 32, align: 32, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !961, file: !4, line: 99, baseType: !917, size: 32, align: 32, offset: 224)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !961, file: !4, line: 108, baseType: !917, size: 32, align: 32, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !961, file: !4, line: 113, baseType: !979, size: 64, align: 64, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!919, !919, !919}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !961, file: !4, line: 123, baseType: !983, size: 64, align: 64, offset: 384)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!986, !986}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !961, file: !4, line: 130, baseType: !989, size: 32, align: 32, offset: 448)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !961, file: !4, line: 136, baseType: !991, size: 64, align: 64, offset: 512)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!989, !919}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !961, file: !4, line: 142, baseType: !995, size: 64, align: 64, offset: 576)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!917, !998, !919, !964, !917}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !955, file: !897, line: 1349, baseType: !1002, size: 64, align: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1019, !1020, !1021, !1022, !1023, !1024, !1037, !1042, !1081, !1082, !1086, !1091, !1092, !1093, !1097, !1103, !1109}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1003, file: !897, line: 638, baseType: !964, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1003, file: !897, line: 645, baseType: !964, size: 64, align: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1003, file: !897, line: 652, baseType: !917, size: 32, align: 32, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1003, file: !897, line: 659, baseType: !964, size: 64, align: 64, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1003, file: !897, line: 661, baseType: !1010, size: 64, align: 64, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1015, line: 44, size: 64, align: 32, elements: !1016)
!1015 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1014, file: !1015, line: 45, baseType: !24, size: 32, align: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1014, file: !1015, line: 46, baseType: !918, size: 32, align: 32, offset: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1003, file: !897, line: 663, baseType: !958, size: 64, align: 64, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1003, file: !897, line: 670, baseType: !964, size: 64, align: 64, offset: 384)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1003, file: !897, line: 679, baseType: !1002, size: 64, align: 64, offset: 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1003, file: !897, line: 684, baseType: !917, size: 32, align: 32, offset: 512)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1003, file: !897, line: 689, baseType: !917, size: 32, align: 32, offset: 544)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1003, file: !897, line: 696, baseType: !1025, size: 64, align: 64, offset: 576)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!917, !1028}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1031)
!1031 = !{!1032, !1033, !1035, !1036}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1030, file: !897, line: 449, baseType: !964, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1030, file: !897, line: 450, baseType: !1034, size: 64, align: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1030, file: !897, line: 451, baseType: !917, size: 32, align: 32, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1030, file: !897, line: 452, baseType: !964, size: 64, align: 64, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1003, file: !897, line: 703, baseType: !1038, size: 64, align: 64, offset: 640)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!917, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1003, file: !897, line: 714, baseType: !1043, size: 64, align: 64, offset: 704)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!917, !1041, !1046}
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !25, line: 1499, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !25, line: 1445, size: 704, align: 64, elements: !1049)
!1049 = !{!1050, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1077, !1078, !1079, !1080}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1048, file: !25, line: 1451, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1053, line: 94, baseType: !1054)
!1053 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1053, line: 81, size: 192, align: 64, elements: !1055)
!1055 = !{!1056, !1060, !1062}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1054, file: !1053, line: 82, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1053, line: 73, baseType: !1059)
!1059 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1053, line: 73, flags: DIFlagFwdDecl)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1054, file: !1053, line: 89, baseType: !1061, size: 64, align: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1054, file: !1053, line: 93, baseType: !917, size: 32, align: 32, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1048, file: !25, line: 1461, baseType: !932, size: 64, align: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1048, file: !25, line: 1467, baseType: !932, size: 64, align: 64, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1048, file: !25, line: 1468, baseType: !1061, size: 64, align: 64, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1048, file: !25, line: 1469, baseType: !917, size: 32, align: 32, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1048, file: !25, line: 1470, baseType: !917, size: 32, align: 32, offset: 288)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1048, file: !25, line: 1474, baseType: !917, size: 32, align: 32, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1048, file: !25, line: 1479, baseType: !1070, size: 64, align: 64, offset: 384)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !25, line: 1415, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !25, line: 1411, size: 128, align: 64, elements: !1073)
!1073 = !{!1074, !1075, !1076}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1072, file: !25, line: 1412, baseType: !1061, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1072, file: !25, line: 1413, baseType: !917, size: 32, align: 32, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1072, file: !25, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1048, file: !25, line: 1480, baseType: !917, size: 32, align: 32, offset: 448)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1048, file: !25, line: 1486, baseType: !932, size: 64, align: 64, offset: 512)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1048, file: !25, line: 1488, baseType: !932, size: 64, align: 64, offset: 576)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1048, file: !25, line: 1497, baseType: !932, size: 64, align: 64, offset: 640)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1003, file: !897, line: 720, baseType: !1038, size: 64, align: 64, offset: 768)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1003, file: !897, line: 730, baseType: !1083, size: 64, align: 64, offset: 832)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!917, !1041, !917, !932, !917}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1003, file: !897, line: 737, baseType: !1087, size: 64, align: 64, offset: 896)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!932, !1041, !917, !1090, !932}
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1003, file: !897, line: 744, baseType: !1038, size: 64, align: 64, offset: 960)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1003, file: !897, line: 750, baseType: !1038, size: 64, align: 64, offset: 1024)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1003, file: !897, line: 758, baseType: !1094, size: 64, align: 64, offset: 1088)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!917, !1041, !917, !932, !932, !932, !917}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1003, file: !897, line: 764, baseType: !1098, size: 64, align: 64, offset: 1152)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!917, !1041, !1101}
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1003, file: !897, line: 770, baseType: !1104, size: 64, align: 64, offset: 1216)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!917, !1041, !1107}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1003, file: !897, line: 776, baseType: !1104, size: 64, align: 64, offset: 1280)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !955, file: !897, line: 1356, baseType: !1111, size: 64, align: 64, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1113)
!1113 = !{!1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1133, !1137, !1141, !1148, !1241, !1242, !1243, !1244, !1245, !1246, !1250}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1112, file: !897, line: 498, baseType: !964, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1112, file: !897, line: 504, baseType: !964, size: 64, align: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1112, file: !897, line: 505, baseType: !964, size: 64, align: 64, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1112, file: !897, line: 506, baseType: !964, size: 64, align: 64, offset: 192)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1112, file: !897, line: 508, baseType: !24, size: 32, align: 32, offset: 256)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1112, file: !897, line: 509, baseType: !24, size: 32, align: 32, offset: 288)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1112, file: !897, line: 510, baseType: !24, size: 32, align: 32, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1112, file: !897, line: 517, baseType: !917, size: 32, align: 32, offset: 352)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1112, file: !897, line: 523, baseType: !1010, size: 64, align: 64, offset: 384)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1112, file: !897, line: 526, baseType: !958, size: 64, align: 64, offset: 448)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1112, file: !897, line: 535, baseType: !1111, size: 64, align: 64, offset: 512)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1112, file: !897, line: 539, baseType: !917, size: 32, align: 32, offset: 576)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1112, file: !897, line: 541, baseType: !1038, size: 64, align: 64, offset: 640)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1112, file: !897, line: 549, baseType: !1043, size: 64, align: 64, offset: 704)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1112, file: !897, line: 550, baseType: !1038, size: 64, align: 64, offset: 768)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1112, file: !897, line: 554, baseType: !1130, size: 64, align: 64, offset: 832)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!917, !1041, !1046, !1046, !917}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1112, file: !897, line: 563, baseType: !1134, size: 64, align: 64, offset: 896)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!917, !24, !917}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1112, file: !897, line: 565, baseType: !1138, size: 64, align: 64, offset: 960)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{null, !1041, !917, !1090, !1090}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1112, file: !897, line: 570, baseType: !1142, size: 64, align: 64, offset: 1024)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!917, !1041, !917, !919, !1145}
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1146, line: 216, baseType: !1147)
!1146 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1147 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1112, file: !897, line: 581, baseType: !1149, size: 64, align: 64, offset: 1088)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!917, !1041, !917, !1152, !918}
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1155)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1156)
!1156 = !{!1157, !1161, !1163, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1197, !1199, !1200, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1155, file: !526, line: 282, baseType: !1158, size: 512, align: 64)
!1158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1061, size: 512, align: 64, elements: !1159)
!1159 = !{!1160}
!1160 = !DISubrange(count: 8)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1155, file: !526, line: 299, baseType: !1162, size: 256, align: 32, offset: 512)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 32, elements: !1159)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1155, file: !526, line: 315, baseType: !1164, size: 64, align: 64, offset: 768)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1155, file: !526, line: 326, baseType: !917, size: 32, align: 32, offset: 832)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1155, file: !526, line: 326, baseType: !917, size: 32, align: 32, offset: 864)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1155, file: !526, line: 334, baseType: !917, size: 32, align: 32, offset: 896)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1155, file: !526, line: 341, baseType: !917, size: 32, align: 32, offset: 928)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1155, file: !526, line: 346, baseType: !917, size: 32, align: 32, offset: 960)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1155, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1155, file: !526, line: 356, baseType: !1172, size: 64, align: 32, offset: 1024)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1173, line: 61, baseType: !1174)
!1173 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1173, line: 58, size: 64, align: 32, elements: !1175)
!1175 = !{!1176, !1177}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1174, file: !1173, line: 59, baseType: !917, size: 32, align: 32)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1174, file: !1173, line: 60, baseType: !917, size: 32, align: 32, offset: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1155, file: !526, line: 361, baseType: !932, size: 64, align: 64, offset: 1088)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1155, file: !526, line: 369, baseType: !932, size: 64, align: 64, offset: 1152)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1155, file: !526, line: 377, baseType: !932, size: 64, align: 64, offset: 1216)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1155, file: !526, line: 382, baseType: !917, size: 32, align: 32, offset: 1280)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1155, file: !526, line: 386, baseType: !917, size: 32, align: 32, offset: 1312)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1155, file: !526, line: 391, baseType: !917, size: 32, align: 32, offset: 1344)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1155, file: !526, line: 396, baseType: !919, size: 64, align: 64, offset: 1408)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1155, file: !526, line: 403, baseType: !1186, size: 512, align: 64, offset: 1472)
!1186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1187, size: 512, align: 64, elements: !1159)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !923, line: 55, baseType: !1147)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1155, file: !526, line: 410, baseType: !917, size: 32, align: 32, offset: 1984)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1155, file: !526, line: 415, baseType: !917, size: 32, align: 32, offset: 2016)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1155, file: !526, line: 420, baseType: !917, size: 32, align: 32, offset: 2048)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1155, file: !526, line: 425, baseType: !917, size: 32, align: 32, offset: 2080)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1155, file: !526, line: 435, baseType: !932, size: 64, align: 64, offset: 2112)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1155, file: !526, line: 440, baseType: !917, size: 32, align: 32, offset: 2176)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1155, file: !526, line: 445, baseType: !1187, size: 64, align: 64, offset: 2240)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1155, file: !526, line: 459, baseType: !1196, size: 512, align: 64, offset: 2304)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1051, size: 512, align: 64, elements: !1159)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1155, file: !526, line: 473, baseType: !1198, size: 64, align: 64, offset: 2816)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1155, file: !526, line: 477, baseType: !917, size: 32, align: 32, offset: 2880)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1155, file: !526, line: 479, baseType: !1201, size: 64, align: 64, offset: 2944)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1205)
!1205 = !{!1206, !1207, !1208, !1209, !1214}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1204, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1204, file: !526, line: 203, baseType: !1061, size: 64, align: 64, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1204, file: !526, line: 204, baseType: !917, size: 32, align: 32, offset: 128)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1204, file: !526, line: 205, baseType: !1210, size: 64, align: 64, offset: 192)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1212, line: 86, baseType: !1213)
!1212 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1213 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1212, line: 86, flags: DIFlagFwdDecl)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1204, file: !526, line: 206, baseType: !1051, size: 64, align: 64, offset: 256)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1155, file: !526, line: 480, baseType: !917, size: 32, align: 32, offset: 3008)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1155, file: !526, line: 505, baseType: !917, size: 32, align: 32, offset: 3040)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1155, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1155, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1155, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1155, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1155, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1155, file: !526, line: 532, baseType: !932, size: 64, align: 64, offset: 3264)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1155, file: !526, line: 539, baseType: !932, size: 64, align: 64, offset: 3328)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1155, file: !526, line: 547, baseType: !932, size: 64, align: 64, offset: 3392)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1155, file: !526, line: 554, baseType: !1210, size: 64, align: 64, offset: 3456)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1155, file: !526, line: 563, baseType: !917, size: 32, align: 32, offset: 3520)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1155, file: !526, line: 572, baseType: !917, size: 32, align: 32, offset: 3552)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1155, file: !526, line: 581, baseType: !917, size: 32, align: 32, offset: 3584)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1155, file: !526, line: 588, baseType: !1230, size: 64, align: 64, offset: 3648)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1155, file: !526, line: 593, baseType: !917, size: 32, align: 32, offset: 3712)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1155, file: !526, line: 596, baseType: !917, size: 32, align: 32, offset: 3744)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1155, file: !526, line: 599, baseType: !1051, size: 64, align: 64, offset: 3776)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1155, file: !526, line: 605, baseType: !1051, size: 64, align: 64, offset: 3840)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1155, file: !526, line: 616, baseType: !1051, size: 64, align: 64, offset: 3904)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1155, file: !526, line: 626, baseType: !1145, size: 64, align: 64, offset: 3968)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1155, file: !526, line: 627, baseType: !1145, size: 64, align: 64, offset: 4032)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1155, file: !526, line: 628, baseType: !1145, size: 64, align: 64, offset: 4096)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1155, file: !526, line: 629, baseType: !1145, size: 64, align: 64, offset: 4160)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1155, file: !526, line: 645, baseType: !1051, size: 64, align: 64, offset: 4224)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1112, file: !897, line: 587, baseType: !1098, size: 64, align: 64, offset: 1152)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1112, file: !897, line: 592, baseType: !1104, size: 64, align: 64, offset: 1216)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1112, file: !897, line: 597, baseType: !1104, size: 64, align: 64, offset: 1280)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1112, file: !897, line: 598, baseType: !24, size: 32, align: 32, offset: 1344)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1112, file: !897, line: 608, baseType: !1038, size: 64, align: 64, offset: 1408)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1112, file: !897, line: 617, baseType: !1247, size: 64, align: 64, offset: 1472)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{null, !1041}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1112, file: !897, line: 623, baseType: !1251, size: 64, align: 64, offset: 1536)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!917, !1041, !1254}
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1047)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !955, file: !897, line: 1365, baseType: !919, size: 64, align: 64, offset: 192)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !955, file: !897, line: 1379, baseType: !1258, size: 64, align: 64, offset: 256)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1260)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1261)
!1261 = !{!1262, !1263, !1264, !1265, !1266, !1267, !1268, !1272, !1273, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1287, !1288, !1292, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1310, !1311, !1312, !1313, !1317, !1318, !1319}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1260, file: !628, line: 174, baseType: !958, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1260, file: !628, line: 226, baseType: !1034, size: 64, align: 64, offset: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1260, file: !628, line: 227, baseType: !917, size: 32, align: 32, offset: 128)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1260, file: !628, line: 228, baseType: !1034, size: 64, align: 64, offset: 192)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1260, file: !628, line: 229, baseType: !1034, size: 64, align: 64, offset: 256)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1260, file: !628, line: 233, baseType: !919, size: 64, align: 64, offset: 320)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1260, file: !628, line: 235, baseType: !1269, size: 64, align: 64, offset: 384)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!917, !919, !1061, !917}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1260, file: !628, line: 236, baseType: !1269, size: 64, align: 64, offset: 448)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1260, file: !628, line: 237, baseType: !1274, size: 64, align: 64, offset: 512)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!932, !919, !932, !917}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1260, file: !628, line: 238, baseType: !932, size: 64, align: 64, offset: 576)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1260, file: !628, line: 239, baseType: !917, size: 32, align: 32, offset: 640)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1260, file: !628, line: 240, baseType: !917, size: 32, align: 32, offset: 672)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1260, file: !628, line: 241, baseType: !917, size: 32, align: 32, offset: 704)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1260, file: !628, line: 242, baseType: !1147, size: 64, align: 64, offset: 768)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1260, file: !628, line: 243, baseType: !1034, size: 64, align: 64, offset: 832)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1260, file: !628, line: 244, baseType: !1284, size: 64, align: 64, offset: 896)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!1147, !1147, !920, !918}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1260, file: !628, line: 245, baseType: !917, size: 32, align: 32, offset: 960)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1260, file: !628, line: 249, baseType: !1289, size: 64, align: 64, offset: 1024)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!917, !919, !917}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1260, file: !628, line: 255, baseType: !1293, size: 64, align: 64, offset: 1088)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!932, !919, !917, !932, !917}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1260, file: !628, line: 260, baseType: !917, size: 32, align: 32, offset: 1152)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1260, file: !628, line: 266, baseType: !932, size: 64, align: 64, offset: 1216)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1260, file: !628, line: 273, baseType: !917, size: 32, align: 32, offset: 1280)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1260, file: !628, line: 279, baseType: !932, size: 64, align: 64, offset: 1344)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1260, file: !628, line: 285, baseType: !917, size: 32, align: 32, offset: 1408)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1260, file: !628, line: 291, baseType: !917, size: 32, align: 32, offset: 1440)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1260, file: !628, line: 298, baseType: !917, size: 32, align: 32, offset: 1472)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1260, file: !628, line: 304, baseType: !917, size: 32, align: 32, offset: 1504)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1260, file: !628, line: 309, baseType: !964, size: 64, align: 64, offset: 1536)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1260, file: !628, line: 314, baseType: !964, size: 64, align: 64, offset: 1600)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1260, file: !628, line: 319, baseType: !1307, size: 64, align: 64, offset: 1664)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!917, !919, !1061, !917, !627, !932}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1260, file: !628, line: 326, baseType: !917, size: 32, align: 32, offset: 1728)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1260, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1260, file: !628, line: 332, baseType: !932, size: 64, align: 64, offset: 1792)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1260, file: !628, line: 338, baseType: !1314, size: 64, align: 64, offset: 1856)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{!917, !919}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1260, file: !628, line: 340, baseType: !932, size: 64, align: 64, offset: 1920)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1260, file: !628, line: 346, baseType: !1034, size: 64, align: 64, offset: 1984)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1260, file: !628, line: 351, baseType: !917, size: 32, align: 32, offset: 2048)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !955, file: !897, line: 1386, baseType: !917, size: 32, align: 32, offset: 320)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !955, file: !897, line: 1393, baseType: !918, size: 32, align: 32, offset: 352)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !955, file: !897, line: 1405, baseType: !1323, size: 64, align: 64, offset: 384)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1326)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1327)
!1327 = !{!1328, !1329, !1330, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1800, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1901, !1907, !1908, !1912, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1944, !1945, !1946, !1947, !1948, !1949}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1326, file: !897, line: 866, baseType: !917, size: 32, align: 32)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1326, file: !897, line: 872, baseType: !917, size: 32, align: 32, offset: 32)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1326, file: !897, line: 878, baseType: !1331, size: 64, align: 64, offset: 64)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !25, line: 3360, baseType: !1333)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !25, line: 1556, size: 8448, align: 64, elements: !1334)
!1334 = !{!1335, !1336, !1337, !1338, !1475, !1476, !1477, !1478, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1504, !1508, !1509, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1688, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1333, file: !25, line: 1561, baseType: !958, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1333, file: !25, line: 1562, baseType: !917, size: 32, align: 32, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1333, file: !25, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1333, file: !25, line: 1565, baseType: !1339, size: 64, align: 64, offset: 128)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1341)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !25, line: 3468, size: 1984, align: 64, elements: !1342)
!1342 = !{!1343, !1344, !1345, !1346, !1347, !1348, !1351, !1354, !1357, !1360, !1363, !1364, !1365, !1373, !1374, !1375, !1377, !1381, !1387, !1392, !1396, !1397, !1440, !1447, !1451, !1452, !1456, !1460, !1464, !1468, !1469, !1470}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1341, file: !25, line: 3475, baseType: !964, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1341, file: !25, line: 3480, baseType: !964, size: 64, align: 64, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1341, file: !25, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1341, file: !25, line: 3482, baseType: !24, size: 32, align: 32, offset: 160)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1341, file: !25, line: 3487, baseType: !917, size: 32, align: 32, offset: 192)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1341, file: !25, line: 3488, baseType: !1349, size: 64, align: 64, offset: 256)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1172)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1341, file: !25, line: 3489, baseType: !1352, size: 64, align: 64, offset: 320)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1341, file: !25, line: 3490, baseType: !1355, size: 64, align: 64, offset: 384)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1341, file: !25, line: 3491, baseType: !1358, size: 64, align: 64, offset: 448)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1341, file: !25, line: 3492, baseType: !1361, size: 64, align: 64, offset: 512)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1187)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1341, file: !25, line: 3493, baseType: !922, size: 8, align: 8, offset: 576)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1341, file: !25, line: 3494, baseType: !958, size: 64, align: 64, offset: 640)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1341, file: !25, line: 3495, baseType: !1366, size: 64, align: 64, offset: 704)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1368)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !25, line: 3404, baseType: !1369)
!1369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !25, line: 3401, size: 128, align: 64, elements: !1370)
!1370 = !{!1371, !1372}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1369, file: !25, line: 3402, baseType: !917, size: 32, align: 32)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1369, file: !25, line: 3403, baseType: !964, size: 64, align: 64, offset: 64)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1341, file: !25, line: 3507, baseType: !964, size: 64, align: 64, offset: 768)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1341, file: !25, line: 3516, baseType: !917, size: 32, align: 32, offset: 832)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1341, file: !25, line: 3517, baseType: !1376, size: 64, align: 64, offset: 896)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1341, file: !25, line: 3527, baseType: !1378, size: 64, align: 64, offset: 960)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DISubroutineType(types: !1380)
!1380 = !{!917, !1331}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1341, file: !25, line: 3535, baseType: !1382, size: 64, align: 64, offset: 1024)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DISubroutineType(types: !1384)
!1384 = !{!917, !1331, !1385}
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1332)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1341, file: !25, line: 3541, baseType: !1388, size: 64, align: 64, offset: 1088)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1390)
!1390 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !25, line: 3461, baseType: !1391)
!1391 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !25, line: 3461, flags: DIFlagFwdDecl)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1341, file: !25, line: 3549, baseType: !1393, size: 64, align: 64, offset: 1152)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DISubroutineType(types: !1395)
!1395 = !{null, !1376}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1341, file: !25, line: 3551, baseType: !1378, size: 64, align: 64, offset: 1216)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1341, file: !25, line: 3552, baseType: !1398, size: 64, align: 64, offset: 1280)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DISubroutineType(types: !1400)
!1400 = !{!917, !1331, !1061, !917, !1401}
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1403)
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !25, line: 3920, size: 256, align: 64, elements: !1404)
!1404 = !{!1405, !1408, !1409, !1410, !1411, !1439}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1403, file: !25, line: 3921, baseType: !1406, size: 16, align: 16)
!1406 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !923, line: 49, baseType: !1407)
!1407 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1403, file: !25, line: 3922, baseType: !931, size: 32, align: 32, offset: 32)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1403, file: !25, line: 3923, baseType: !931, size: 32, align: 32, offset: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1403, file: !25, line: 3924, baseType: !918, size: 32, align: 32, offset: 96)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1403, file: !25, line: 3925, baseType: !1412, size: 64, align: 64, offset: 128)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !25, line: 3918, baseType: !1415)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !25, line: 3885, size: 1600, align: 64, elements: !1416)
!1416 = !{!1417, !1418, !1419, !1420, !1421, !1422, !1428, !1432, !1434, !1435, !1437, !1438}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1415, file: !25, line: 3886, baseType: !917, size: 32, align: 32)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1415, file: !25, line: 3887, baseType: !917, size: 32, align: 32, offset: 32)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1415, file: !25, line: 3888, baseType: !917, size: 32, align: 32, offset: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1415, file: !25, line: 3889, baseType: !917, size: 32, align: 32, offset: 96)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1415, file: !25, line: 3890, baseType: !917, size: 32, align: 32, offset: 128)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1415, file: !25, line: 3897, baseType: !1423, size: 768, align: 64, offset: 192)
!1423 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !25, line: 3858, baseType: !1424)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !25, line: 3853, size: 768, align: 64, elements: !1425)
!1425 = !{!1426, !1427}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1424, file: !25, line: 3855, baseType: !1158, size: 512, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1424, file: !25, line: 3857, baseType: !1162, size: 256, align: 32, offset: 512)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1415, file: !25, line: 3903, baseType: !1429, size: 256, align: 64, offset: 960)
!1429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1061, size: 256, align: 64, elements: !1430)
!1430 = !{!1431}
!1431 = !DISubrange(count: 4)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1415, file: !25, line: 3904, baseType: !1433, size: 128, align: 32, offset: 1216)
!1433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 128, align: 32, elements: !1430)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1415, file: !25, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1415, file: !25, line: 3908, baseType: !1436, size: 64, align: 64, offset: 1408)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1415, file: !25, line: 3915, baseType: !1436, size: 64, align: 64, offset: 1472)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1415, file: !25, line: 3917, baseType: !917, size: 32, align: 32, offset: 1536)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1403, file: !25, line: 3926, baseType: !932, size: 64, align: 64, offset: 192)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1341, file: !25, line: 3564, baseType: !1441, size: 64, align: 64, offset: 1344)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DISubroutineType(types: !1443)
!1443 = !{!917, !1331, !1046, !1444, !1446}
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1154)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1341, file: !25, line: 3566, baseType: !1448, size: 64, align: 64, offset: 1408)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!917, !1331, !919, !1446, !1046}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1341, file: !25, line: 3567, baseType: !1378, size: 64, align: 64, offset: 1472)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1341, file: !25, line: 3576, baseType: !1453, size: 64, align: 64, offset: 1536)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{!917, !1331, !1444}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1341, file: !25, line: 3577, baseType: !1457, size: 64, align: 64, offset: 1600)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!917, !1331, !1046}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1341, file: !25, line: 3584, baseType: !1461, size: 64, align: 64, offset: 1664)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!917, !1331, !1153}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1341, file: !25, line: 3589, baseType: !1465, size: 64, align: 64, offset: 1728)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{null, !1331}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1341, file: !25, line: 3594, baseType: !917, size: 32, align: 32, offset: 1792)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1341, file: !25, line: 3600, baseType: !964, size: 64, align: 64, offset: 1856)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1341, file: !25, line: 3609, baseType: !1471, size: 64, align: 64, offset: 1920)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1474)
!1474 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !25, line: 3609, flags: DIFlagFwdDecl)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1333, file: !25, line: 1566, baseType: !24, size: 32, align: 32, offset: 192)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1333, file: !25, line: 1581, baseType: !918, size: 32, align: 32, offset: 224)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1333, file: !25, line: 1583, baseType: !919, size: 64, align: 64, offset: 256)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1333, file: !25, line: 1591, baseType: !1479, size: 64, align: 64, offset: 320)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !25, line: 1532, flags: DIFlagFwdDecl)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1333, file: !25, line: 1598, baseType: !919, size: 64, align: 64, offset: 384)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1333, file: !25, line: 1606, baseType: !932, size: 64, align: 64, offset: 448)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1333, file: !25, line: 1614, baseType: !917, size: 32, align: 32, offset: 512)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1333, file: !25, line: 1622, baseType: !917, size: 32, align: 32, offset: 544)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1333, file: !25, line: 1628, baseType: !917, size: 32, align: 32, offset: 576)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1333, file: !25, line: 1636, baseType: !917, size: 32, align: 32, offset: 608)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1333, file: !25, line: 1643, baseType: !917, size: 32, align: 32, offset: 640)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1333, file: !25, line: 1657, baseType: !1061, size: 64, align: 64, offset: 704)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1333, file: !25, line: 1658, baseType: !917, size: 32, align: 32, offset: 768)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1333, file: !25, line: 1679, baseType: !1172, size: 64, align: 32, offset: 800)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1333, file: !25, line: 1688, baseType: !917, size: 32, align: 32, offset: 864)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1333, file: !25, line: 1712, baseType: !917, size: 32, align: 32, offset: 896)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1333, file: !25, line: 1729, baseType: !917, size: 32, align: 32, offset: 928)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1333, file: !25, line: 1729, baseType: !917, size: 32, align: 32, offset: 960)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1333, file: !25, line: 1744, baseType: !917, size: 32, align: 32, offset: 992)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1333, file: !25, line: 1744, baseType: !917, size: 32, align: 32, offset: 1024)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1333, file: !25, line: 1751, baseType: !917, size: 32, align: 32, offset: 1056)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1333, file: !25, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1333, file: !25, line: 1791, baseType: !1500, size: 64, align: 64, offset: 1152)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{null, !1503, !1444, !1446, !917, !917, !917}
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1333, file: !25, line: 1808, baseType: !1505, size: 64, align: 64, offset: 1216)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DISubroutineType(types: !1507)
!1507 = !{!645, !1503, !1352}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1333, file: !25, line: 1816, baseType: !917, size: 32, align: 32, offset: 1280)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1333, file: !25, line: 1825, baseType: !1510, size: 32, align: 32, offset: 1312)
!1510 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1333, file: !25, line: 1830, baseType: !917, size: 32, align: 32, offset: 1344)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1333, file: !25, line: 1838, baseType: !1510, size: 32, align: 32, offset: 1376)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1333, file: !25, line: 1846, baseType: !917, size: 32, align: 32, offset: 1408)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1333, file: !25, line: 1851, baseType: !917, size: 32, align: 32, offset: 1440)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1333, file: !25, line: 1861, baseType: !1510, size: 32, align: 32, offset: 1472)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1333, file: !25, line: 1868, baseType: !1510, size: 32, align: 32, offset: 1504)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1333, file: !25, line: 1875, baseType: !1510, size: 32, align: 32, offset: 1536)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1333, file: !25, line: 1882, baseType: !1510, size: 32, align: 32, offset: 1568)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1333, file: !25, line: 1889, baseType: !1510, size: 32, align: 32, offset: 1600)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1333, file: !25, line: 1896, baseType: !1510, size: 32, align: 32, offset: 1632)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1333, file: !25, line: 1903, baseType: !1510, size: 32, align: 32, offset: 1664)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1333, file: !25, line: 1910, baseType: !917, size: 32, align: 32, offset: 1696)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1333, file: !25, line: 1915, baseType: !917, size: 32, align: 32, offset: 1728)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1333, file: !25, line: 1926, baseType: !1446, size: 64, align: 64, offset: 1792)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1333, file: !25, line: 1935, baseType: !1172, size: 64, align: 32, offset: 1856)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1333, file: !25, line: 1942, baseType: !917, size: 32, align: 32, offset: 1920)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1333, file: !25, line: 1948, baseType: !917, size: 32, align: 32, offset: 1952)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1333, file: !25, line: 1954, baseType: !917, size: 32, align: 32, offset: 1984)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1333, file: !25, line: 1960, baseType: !917, size: 32, align: 32, offset: 2016)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1333, file: !25, line: 1984, baseType: !917, size: 32, align: 32, offset: 2048)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1333, file: !25, line: 1991, baseType: !917, size: 32, align: 32, offset: 2080)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1333, file: !25, line: 1996, baseType: !917, size: 32, align: 32, offset: 2112)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1333, file: !25, line: 2004, baseType: !917, size: 32, align: 32, offset: 2144)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1333, file: !25, line: 2011, baseType: !917, size: 32, align: 32, offset: 2176)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1333, file: !25, line: 2018, baseType: !917, size: 32, align: 32, offset: 2208)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1333, file: !25, line: 2027, baseType: !917, size: 32, align: 32, offset: 2240)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1333, file: !25, line: 2034, baseType: !917, size: 32, align: 32, offset: 2272)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1333, file: !25, line: 2044, baseType: !917, size: 32, align: 32, offset: 2304)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1333, file: !25, line: 2054, baseType: !1540, size: 64, align: 64, offset: 2368)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1333, file: !25, line: 2061, baseType: !1540, size: 64, align: 64, offset: 2432)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1333, file: !25, line: 2066, baseType: !917, size: 32, align: 32, offset: 2496)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1333, file: !25, line: 2070, baseType: !917, size: 32, align: 32, offset: 2528)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1333, file: !25, line: 2078, baseType: !917, size: 32, align: 32, offset: 2560)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1333, file: !25, line: 2085, baseType: !917, size: 32, align: 32, offset: 2592)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1333, file: !25, line: 2092, baseType: !917, size: 32, align: 32, offset: 2624)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1333, file: !25, line: 2099, baseType: !917, size: 32, align: 32, offset: 2656)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1333, file: !25, line: 2106, baseType: !917, size: 32, align: 32, offset: 2688)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1333, file: !25, line: 2113, baseType: !917, size: 32, align: 32, offset: 2720)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1333, file: !25, line: 2120, baseType: !917, size: 32, align: 32, offset: 2752)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1333, file: !25, line: 2125, baseType: !917, size: 32, align: 32, offset: 2784)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1333, file: !25, line: 2133, baseType: !917, size: 32, align: 32, offset: 2816)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1333, file: !25, line: 2140, baseType: !917, size: 32, align: 32, offset: 2848)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1333, file: !25, line: 2145, baseType: !917, size: 32, align: 32, offset: 2880)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1333, file: !25, line: 2153, baseType: !917, size: 32, align: 32, offset: 2912)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1333, file: !25, line: 2158, baseType: !917, size: 32, align: 32, offset: 2944)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1333, file: !25, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1333, file: !25, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1333, file: !25, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1333, file: !25, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1333, file: !25, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1333, file: !25, line: 2203, baseType: !917, size: 32, align: 32, offset: 3136)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1333, file: !25, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1333, file: !25, line: 2212, baseType: !917, size: 32, align: 32, offset: 3200)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1333, file: !25, line: 2213, baseType: !917, size: 32, align: 32, offset: 3232)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1333, file: !25, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1333, file: !25, line: 2232, baseType: !917, size: 32, align: 32, offset: 3296)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1333, file: !25, line: 2243, baseType: !917, size: 32, align: 32, offset: 3328)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1333, file: !25, line: 2249, baseType: !917, size: 32, align: 32, offset: 3360)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1333, file: !25, line: 2256, baseType: !917, size: 32, align: 32, offset: 3392)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1333, file: !25, line: 2263, baseType: !1187, size: 64, align: 64, offset: 3456)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1333, file: !25, line: 2270, baseType: !1187, size: 64, align: 64, offset: 3520)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1333, file: !25, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1333, file: !25, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1333, file: !25, line: 2367, baseType: !1576, size: 64, align: 64, offset: 3648)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{!917, !1503, !1153, !917}
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1333, file: !25, line: 2383, baseType: !917, size: 32, align: 32, offset: 3712)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1333, file: !25, line: 2386, baseType: !1510, size: 32, align: 32, offset: 3744)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1333, file: !25, line: 2387, baseType: !1510, size: 32, align: 32, offset: 3776)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1333, file: !25, line: 2394, baseType: !917, size: 32, align: 32, offset: 3808)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1333, file: !25, line: 2401, baseType: !917, size: 32, align: 32, offset: 3840)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1333, file: !25, line: 2408, baseType: !917, size: 32, align: 32, offset: 3872)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1333, file: !25, line: 2415, baseType: !917, size: 32, align: 32, offset: 3904)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1333, file: !25, line: 2422, baseType: !917, size: 32, align: 32, offset: 3936)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1333, file: !25, line: 2423, baseType: !1588, size: 64, align: 64, offset: 3968)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !25, line: 831, baseType: !1590)
!1590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !25, line: 826, size: 128, align: 32, elements: !1591)
!1591 = !{!1592, !1593, !1594, !1595}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1590, file: !25, line: 827, baseType: !917, size: 32, align: 32)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1590, file: !25, line: 828, baseType: !917, size: 32, align: 32, offset: 32)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1590, file: !25, line: 829, baseType: !917, size: 32, align: 32, offset: 64)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1590, file: !25, line: 830, baseType: !1510, size: 32, align: 32, offset: 96)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1333, file: !25, line: 2430, baseType: !932, size: 64, align: 64, offset: 4032)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1333, file: !25, line: 2437, baseType: !932, size: 64, align: 64, offset: 4096)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1333, file: !25, line: 2444, baseType: !1510, size: 32, align: 32, offset: 4160)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1333, file: !25, line: 2451, baseType: !1510, size: 32, align: 32, offset: 4192)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1333, file: !25, line: 2458, baseType: !917, size: 32, align: 32, offset: 4224)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1333, file: !25, line: 2469, baseType: !917, size: 32, align: 32, offset: 4256)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1333, file: !25, line: 2475, baseType: !917, size: 32, align: 32, offset: 4288)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1333, file: !25, line: 2481, baseType: !917, size: 32, align: 32, offset: 4320)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1333, file: !25, line: 2485, baseType: !917, size: 32, align: 32, offset: 4352)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1333, file: !25, line: 2489, baseType: !917, size: 32, align: 32, offset: 4384)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1333, file: !25, line: 2493, baseType: !917, size: 32, align: 32, offset: 4416)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1333, file: !25, line: 2501, baseType: !917, size: 32, align: 32, offset: 4448)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1333, file: !25, line: 2506, baseType: !917, size: 32, align: 32, offset: 4480)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1333, file: !25, line: 2510, baseType: !917, size: 32, align: 32, offset: 4512)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1333, file: !25, line: 2514, baseType: !932, size: 64, align: 64, offset: 4544)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1333, file: !25, line: 2528, baseType: !1612, size: 64, align: 64, offset: 4608)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DISubroutineType(types: !1614)
!1614 = !{null, !1503, !919, !917, !917}
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1333, file: !25, line: 2534, baseType: !917, size: 32, align: 32, offset: 4672)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1333, file: !25, line: 2545, baseType: !917, size: 32, align: 32, offset: 4704)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1333, file: !25, line: 2547, baseType: !917, size: 32, align: 32, offset: 4736)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1333, file: !25, line: 2549, baseType: !917, size: 32, align: 32, offset: 4768)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1333, file: !25, line: 2551, baseType: !917, size: 32, align: 32, offset: 4800)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1333, file: !25, line: 2553, baseType: !917, size: 32, align: 32, offset: 4832)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1333, file: !25, line: 2555, baseType: !917, size: 32, align: 32, offset: 4864)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1333, file: !25, line: 2557, baseType: !917, size: 32, align: 32, offset: 4896)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1333, file: !25, line: 2559, baseType: !917, size: 32, align: 32, offset: 4928)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1333, file: !25, line: 2563, baseType: !917, size: 32, align: 32, offset: 4960)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1333, file: !25, line: 2571, baseType: !1436, size: 64, align: 64, offset: 4992)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1333, file: !25, line: 2579, baseType: !1436, size: 64, align: 64, offset: 5056)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1333, file: !25, line: 2586, baseType: !917, size: 32, align: 32, offset: 5120)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1333, file: !25, line: 2615, baseType: !917, size: 32, align: 32, offset: 5152)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1333, file: !25, line: 2627, baseType: !917, size: 32, align: 32, offset: 5184)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1333, file: !25, line: 2637, baseType: !917, size: 32, align: 32, offset: 5216)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1333, file: !25, line: 2681, baseType: !917, size: 32, align: 32, offset: 5248)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1333, file: !25, line: 2709, baseType: !932, size: 64, align: 64, offset: 5312)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1333, file: !25, line: 2716, baseType: !1634, size: 64, align: 64, offset: 5376)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1636)
!1636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !25, line: 3636, size: 896, align: 64, elements: !1637)
!1637 = !{!1638, !1639, !1640, !1641, !1642, !1643, !1644, !1648, !1652, !1653, !1654, !1655, !1661, !1662, !1663, !1664, !1665}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1636, file: !25, line: 3642, baseType: !964, size: 64, align: 64)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1636, file: !25, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1636, file: !25, line: 3656, baseType: !24, size: 32, align: 32, offset: 96)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1636, file: !25, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1636, file: !25, line: 3669, baseType: !917, size: 32, align: 32, offset: 160)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1636, file: !25, line: 3682, baseType: !1461, size: 64, align: 64, offset: 192)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1636, file: !25, line: 3698, baseType: !1645, size: 64, align: 64, offset: 256)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{!917, !1331, !920, !931}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1636, file: !25, line: 3712, baseType: !1649, size: 64, align: 64, offset: 320)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DISubroutineType(types: !1651)
!1651 = !{!917, !1331, !917, !920, !931}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1636, file: !25, line: 3726, baseType: !1645, size: 64, align: 64, offset: 384)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1636, file: !25, line: 3737, baseType: !1378, size: 64, align: 64, offset: 448)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1636, file: !25, line: 3746, baseType: !917, size: 32, align: 32, offset: 512)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1636, file: !25, line: 3757, baseType: !1656, size: 64, align: 64, offset: 576)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DISubroutineType(types: !1658)
!1658 = !{null, !1659}
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !25, line: 3617, flags: DIFlagFwdDecl)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1636, file: !25, line: 3766, baseType: !1378, size: 64, align: 64, offset: 640)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1636, file: !25, line: 3774, baseType: !1378, size: 64, align: 64, offset: 704)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1636, file: !25, line: 3780, baseType: !917, size: 32, align: 32, offset: 768)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1636, file: !25, line: 3785, baseType: !917, size: 32, align: 32, offset: 800)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1636, file: !25, line: 3795, baseType: !1666, size: 64, align: 64, offset: 832)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DISubroutineType(types: !1668)
!1668 = !{!917, !1331, !1051}
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1333, file: !25, line: 2728, baseType: !919, size: 64, align: 64, offset: 5440)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1333, file: !25, line: 2735, baseType: !1186, size: 512, align: 64, offset: 5504)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1333, file: !25, line: 2742, baseType: !917, size: 32, align: 32, offset: 6016)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1333, file: !25, line: 2755, baseType: !917, size: 32, align: 32, offset: 6048)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1333, file: !25, line: 2776, baseType: !917, size: 32, align: 32, offset: 6080)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1333, file: !25, line: 2783, baseType: !917, size: 32, align: 32, offset: 6112)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1333, file: !25, line: 2791, baseType: !917, size: 32, align: 32, offset: 6144)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1333, file: !25, line: 2802, baseType: !1153, size: 64, align: 64, offset: 6208)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1333, file: !25, line: 2811, baseType: !917, size: 32, align: 32, offset: 6272)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1333, file: !25, line: 2821, baseType: !917, size: 32, align: 32, offset: 6304)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1333, file: !25, line: 2830, baseType: !917, size: 32, align: 32, offset: 6336)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1333, file: !25, line: 2840, baseType: !917, size: 32, align: 32, offset: 6368)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1333, file: !25, line: 2851, baseType: !1682, size: 64, align: 64, offset: 6400)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64, align: 64)
!1683 = !DISubroutineType(types: !1684)
!1684 = !{!917, !1503, !1685, !919, !1446, !917, !917}
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DISubroutineType(types: !1687)
!1687 = !{!917, !1503, !919}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1333, file: !25, line: 2871, baseType: !1689, size: 64, align: 64, offset: 6464)
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1690 = !DISubroutineType(types: !1691)
!1691 = !{!917, !1503, !1692, !919, !1446, !917}
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{!917, !1503, !919, !917, !917}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1333, file: !25, line: 2878, baseType: !917, size: 32, align: 32, offset: 6528)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1333, file: !25, line: 2885, baseType: !917, size: 32, align: 32, offset: 6560)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1333, file: !25, line: 3005, baseType: !917, size: 32, align: 32, offset: 6592)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1333, file: !25, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1333, file: !25, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1333, file: !25, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1333, file: !25, line: 3037, baseType: !1061, size: 64, align: 64, offset: 6720)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1333, file: !25, line: 3038, baseType: !917, size: 32, align: 32, offset: 6784)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1333, file: !25, line: 3050, baseType: !1187, size: 64, align: 64, offset: 6848)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1333, file: !25, line: 3065, baseType: !917, size: 32, align: 32, offset: 6912)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1333, file: !25, line: 3083, baseType: !917, size: 32, align: 32, offset: 6944)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1333, file: !25, line: 3092, baseType: !1172, size: 64, align: 32, offset: 6976)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1333, file: !25, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1333, file: !25, line: 3106, baseType: !1172, size: 64, align: 32, offset: 7072)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1333, file: !25, line: 3113, baseType: !1710, size: 64, align: 64, offset: 7168)
