; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--iff.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--iff.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProbeData = type { i8*, i8*, i32, i8* }

!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !917, line: 102, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavformat/iff.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!918 = !{!919, !920, !921}
!919 = !DIEnumerator(name: "COMP_NONE", value: 0)
!920 = !DIEnumerator(name: "COMP_FIB", value: 1)
!921 = !DIEnumerator(name: "COMP_EXP", value: 2)
!922 = !{!923, !931, !932, !933, !935, !936, !942}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !926, line: 221, size: 32, align: 8, elements: !927)
!926 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!927 = !{!928}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !925, file: !926, line: 221, baseType: !929, size: 32, align: 32)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !930, line: 51, baseType: !931)
!930 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!931 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!932 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !930, line: 40, baseType: !934)
!934 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !926, line: 222, size: 16, align: 8, elements: !938)
!938 = !{!939}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !937, file: !926, line: 222, baseType: !940, size: 16, align: 16)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !930, line: 49, baseType: !941)
!941 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !930, line: 48, baseType: !944)
!944 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!945 = !{!946, !2152, !2156, !2157, !2158, !2159, !2160, !2172, !2175, !2177, !2181, !2185, !2187, !2189}
!946 = distinct !DIGlobalVariable(name: "ff_iff_demuxer", scope: !0, file: !917, line: 887, type: !947, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_iff_demuxer)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !897, line: 777, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !949)
!949 = !{!950, !954, !955, !956, !957, !967, !1008, !1009, !1011, !1012, !1013, !1026, !2133, !2134, !2135, !2139, !2143, !2144, !2145, !2149, !2150, !2151}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !948, file: !897, line: 638, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !948, file: !897, line: 645, baseType: !951, size: 64, align: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !948, file: !897, line: 652, baseType: !932, size: 32, align: 32, offset: 128)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !948, file: !897, line: 659, baseType: !951, size: 64, align: 64, offset: 192)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !948, file: !897, line: 661, baseType: !958, size: 64, align: 64, offset: 256)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !963, line: 44, size: 64, align: 32, elements: !964)
!963 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!964 = !{!965, !966}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !962, file: !963, line: 45, baseType: !3, size: 32, align: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !962, file: !963, line: 46, baseType: !931, size: 32, align: 32, offset: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !948, file: !897, line: 663, baseType: !968, size: 64, align: 64, offset: 320)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !972)
!972 = !{!973, !974, !978, !982, !983, !984, !985, !989, !995, !997, !1001}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !971, file: !464, line: 72, baseType: !951, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !971, file: !464, line: 78, baseType: !975, size: 64, align: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!951, !935}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !971, file: !464, line: 85, baseType: !979, size: 64, align: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !971, file: !464, line: 93, baseType: !932, size: 32, align: 32, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !971, file: !464, line: 99, baseType: !932, size: 32, align: 32, offset: 224)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !971, file: !464, line: 108, baseType: !932, size: 32, align: 32, offset: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !971, file: !464, line: 113, baseType: !986, size: 64, align: 64, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!935, !935, !935}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !971, file: !464, line: 123, baseType: !990, size: 64, align: 64, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!993, !993}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !971, file: !464, line: 130, baseType: !996, size: 32, align: 32, offset: 448)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !971, file: !464, line: 136, baseType: !998, size: 64, align: 64, offset: 512)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!996, !935}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !971, file: !464, line: 142, baseType: !1002, size: 64, align: 64, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!932, !1005, !935, !951, !932}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !948, file: !897, line: 670, baseType: !951, size: 64, align: 64, offset: 384)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !948, file: !897, line: 679, baseType: !1010, size: 64, align: 64, offset: 448)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !948, file: !897, line: 684, baseType: !932, size: 32, align: 32, offset: 512)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !948, file: !897, line: 689, baseType: !932, size: 32, align: 32, offset: 544)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !948, file: !897, line: 696, baseType: !1014, size: 64, align: 64, offset: 576)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!932, !1017}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1020)
!1020 = !{!1021, !1022, !1024, !1025}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1019, file: !897, line: 449, baseType: !951, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1019, file: !897, line: 450, baseType: !1023, size: 64, align: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1019, file: !897, line: 451, baseType: !932, size: 32, align: 32, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1019, file: !897, line: 452, baseType: !951, size: 64, align: 64, offset: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !948, file: !897, line: 703, baseType: !1027, size: 64, align: 64, offset: 640)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!932, !1030}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1231, !1232, !1297, !1298, !1299, !1990, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2044, !2045, !2046, !2047, !2048, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2099, !2100, !2103, !2104, !2105, !2106, !2107, !2108, !2110, !2111, !2112, !2113, !2121, !2122, !2126, !2130, !2131, !2132}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1031, file: !897, line: 1342, baseType: !968, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1031, file: !897, line: 1349, baseType: !1010, size: 64, align: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1031, file: !897, line: 1356, baseType: !1036, size: 64, align: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1090, !1091, !1095, !1099, !1104, !1111, !1206, !1212, !1218, !1219, !1220, !1221, !1225}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1037, file: !897, line: 498, baseType: !951, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1037, file: !897, line: 504, baseType: !951, size: 64, align: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1037, file: !897, line: 505, baseType: !951, size: 64, align: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1037, file: !897, line: 506, baseType: !951, size: 64, align: 64, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1037, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1037, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1037, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1037, file: !897, line: 517, baseType: !932, size: 32, align: 32, offset: 352)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1037, file: !897, line: 523, baseType: !958, size: 64, align: 64, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1037, file: !897, line: 526, baseType: !968, size: 64, align: 64, offset: 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1037, file: !897, line: 535, baseType: !1036, size: 64, align: 64, offset: 512)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1037, file: !897, line: 539, baseType: !932, size: 32, align: 32, offset: 576)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1037, file: !897, line: 541, baseType: !1027, size: 64, align: 64, offset: 640)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1037, file: !897, line: 549, baseType: !1053, size: 64, align: 64, offset: 704)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!932, !1030, !1056}
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1059)
!1059 = !{!1060, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1086, !1087, !1088, !1089}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1058, file: !4, line: 1451, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1063, line: 94, baseType: !1064)
!1063 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1063, line: 81, size: 192, align: 64, elements: !1065)
!1065 = !{!1066, !1070, !1071}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1064, file: !1063, line: 82, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1063, line: 73, baseType: !1069)
!1069 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1063, line: 73, flags: DIFlagFwdDecl)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1064, file: !1063, line: 89, baseType: !942, size: 64, align: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1064, file: !1063, line: 93, baseType: !932, size: 32, align: 32, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1058, file: !4, line: 1461, baseType: !933, size: 64, align: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1058, file: !4, line: 1467, baseType: !933, size: 64, align: 64, offset: 128)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1058, file: !4, line: 1468, baseType: !942, size: 64, align: 64, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1058, file: !4, line: 1469, baseType: !932, size: 32, align: 32, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1058, file: !4, line: 1470, baseType: !932, size: 32, align: 32, offset: 288)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1058, file: !4, line: 1474, baseType: !932, size: 32, align: 32, offset: 320)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1058, file: !4, line: 1479, baseType: !1079, size: 64, align: 64, offset: 384)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1082)
!1082 = !{!1083, !1084, !1085}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1081, file: !4, line: 1412, baseType: !942, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1081, file: !4, line: 1413, baseType: !932, size: 32, align: 32, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1081, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1058, file: !4, line: 1480, baseType: !932, size: 32, align: 32, offset: 448)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1058, file: !4, line: 1486, baseType: !933, size: 64, align: 64, offset: 512)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1058, file: !4, line: 1488, baseType: !933, size: 64, align: 64, offset: 576)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1058, file: !4, line: 1497, baseType: !933, size: 64, align: 64, offset: 640)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1037, file: !897, line: 550, baseType: !1027, size: 64, align: 64, offset: 768)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1037, file: !897, line: 554, baseType: !1092, size: 64, align: 64, offset: 832)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!932, !1030, !1056, !1056, !932}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1037, file: !897, line: 563, baseType: !1096, size: 64, align: 64, offset: 896)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!932, !3, !932}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1037, file: !897, line: 565, baseType: !1100, size: 64, align: 64, offset: 960)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{null, !1030, !932, !1103, !1103}
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1037, file: !897, line: 570, baseType: !1105, size: 64, align: 64, offset: 1024)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!932, !1030, !932, !935, !1108}
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1109, line: 216, baseType: !1110)
!1109 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1110 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1037, file: !897, line: 581, baseType: !1112, size: 64, align: 64, offset: 1088)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!932, !1030, !932, !1115, !931}
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1119)
!1119 = !{!1120, !1124, !1126, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1160, !1162, !1163, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1118, file: !526, line: 282, baseType: !1121, size: 512, align: 64)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !942, size: 512, align: 64, elements: !1122)
!1122 = !{!1123}
!1123 = !DISubrange(count: 8)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1118, file: !526, line: 299, baseType: !1125, size: 256, align: 32, offset: 512)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 256, align: 32, elements: !1122)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1118, file: !526, line: 315, baseType: !1127, size: 64, align: 64, offset: 768)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1118, file: !526, line: 326, baseType: !932, size: 32, align: 32, offset: 832)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1118, file: !526, line: 326, baseType: !932, size: 32, align: 32, offset: 864)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1118, file: !526, line: 334, baseType: !932, size: 32, align: 32, offset: 896)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1118, file: !526, line: 341, baseType: !932, size: 32, align: 32, offset: 928)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1118, file: !526, line: 346, baseType: !932, size: 32, align: 32, offset: 960)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1118, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1118, file: !526, line: 356, baseType: !1135, size: 64, align: 32, offset: 1024)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1136, line: 61, baseType: !1137)
!1136 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1136, line: 58, size: 64, align: 32, elements: !1138)
!1138 = !{!1139, !1140}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1137, file: !1136, line: 59, baseType: !932, size: 32, align: 32)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1137, file: !1136, line: 60, baseType: !932, size: 32, align: 32, offset: 32)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1118, file: !526, line: 361, baseType: !933, size: 64, align: 64, offset: 1088)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1118, file: !526, line: 369, baseType: !933, size: 64, align: 64, offset: 1152)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1118, file: !526, line: 377, baseType: !933, size: 64, align: 64, offset: 1216)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1118, file: !526, line: 382, baseType: !932, size: 32, align: 32, offset: 1280)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1118, file: !526, line: 386, baseType: !932, size: 32, align: 32, offset: 1312)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1118, file: !526, line: 391, baseType: !932, size: 32, align: 32, offset: 1344)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1118, file: !526, line: 396, baseType: !935, size: 64, align: 64, offset: 1408)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1118, file: !526, line: 403, baseType: !1149, size: 512, align: 64, offset: 1472)
!1149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1150, size: 512, align: 64, elements: !1122)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !930, line: 55, baseType: !1110)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1118, file: !526, line: 410, baseType: !932, size: 32, align: 32, offset: 1984)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1118, file: !526, line: 415, baseType: !932, size: 32, align: 32, offset: 2016)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1118, file: !526, line: 420, baseType: !932, size: 32, align: 32, offset: 2048)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1118, file: !526, line: 425, baseType: !932, size: 32, align: 32, offset: 2080)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1118, file: !526, line: 435, baseType: !933, size: 64, align: 64, offset: 2112)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1118, file: !526, line: 440, baseType: !932, size: 32, align: 32, offset: 2176)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1118, file: !526, line: 445, baseType: !1150, size: 64, align: 64, offset: 2240)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1118, file: !526, line: 459, baseType: !1159, size: 512, align: 64, offset: 2304)
!1159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1061, size: 512, align: 64, elements: !1122)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1118, file: !526, line: 473, baseType: !1161, size: 64, align: 64, offset: 2816)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1118, file: !526, line: 477, baseType: !932, size: 32, align: 32, offset: 2880)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1118, file: !526, line: 479, baseType: !1164, size: 64, align: 64, offset: 2944)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1168)
!1168 = !{!1169, !1170, !1171, !1172, !1177}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1167, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1167, file: !526, line: 203, baseType: !942, size: 64, align: 64, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1167, file: !526, line: 204, baseType: !932, size: 32, align: 32, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1167, file: !526, line: 205, baseType: !1173, size: 64, align: 64, offset: 192)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1175, line: 86, baseType: !1176)
!1175 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1176 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1175, line: 86, flags: DIFlagFwdDecl)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1167, file: !526, line: 206, baseType: !1061, size: 64, align: 64, offset: 256)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1118, file: !526, line: 480, baseType: !932, size: 32, align: 32, offset: 3008)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1118, file: !526, line: 505, baseType: !932, size: 32, align: 32, offset: 3040)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1118, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1118, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1118, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1118, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1118, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1118, file: !526, line: 532, baseType: !933, size: 64, align: 64, offset: 3264)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1118, file: !526, line: 539, baseType: !933, size: 64, align: 64, offset: 3328)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1118, file: !526, line: 547, baseType: !933, size: 64, align: 64, offset: 3392)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1118, file: !526, line: 554, baseType: !1173, size: 64, align: 64, offset: 3456)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1118, file: !526, line: 563, baseType: !932, size: 32, align: 32, offset: 3520)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1118, file: !526, line: 572, baseType: !932, size: 32, align: 32, offset: 3552)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1118, file: !526, line: 581, baseType: !932, size: 32, align: 32, offset: 3584)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1118, file: !526, line: 588, baseType: !1193, size: 64, align: 64, offset: 3648)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !930, line: 36, baseType: !1195)
!1195 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1118, file: !526, line: 593, baseType: !932, size: 32, align: 32, offset: 3712)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1118, file: !526, line: 596, baseType: !932, size: 32, align: 32, offset: 3744)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1118, file: !526, line: 599, baseType: !1061, size: 64, align: 64, offset: 3776)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1118, file: !526, line: 605, baseType: !1061, size: 64, align: 64, offset: 3840)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1118, file: !526, line: 616, baseType: !1061, size: 64, align: 64, offset: 3904)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1118, file: !526, line: 626, baseType: !1108, size: 64, align: 64, offset: 3968)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1118, file: !526, line: 627, baseType: !1108, size: 64, align: 64, offset: 4032)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1118, file: !526, line: 628, baseType: !1108, size: 64, align: 64, offset: 4096)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1118, file: !526, line: 629, baseType: !1108, size: 64, align: 64, offset: 4160)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1118, file: !526, line: 645, baseType: !1061, size: 64, align: 64, offset: 4224)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1037, file: !897, line: 587, baseType: !1207, size: 64, align: 64, offset: 1152)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!932, !1030, !1210}
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1037, file: !897, line: 592, baseType: !1213, size: 64, align: 64, offset: 1216)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{!932, !1030, !1216}
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1037, file: !897, line: 597, baseType: !1213, size: 64, align: 64, offset: 1280)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1037, file: !897, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1037, file: !897, line: 608, baseType: !1027, size: 64, align: 64, offset: 1408)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1037, file: !897, line: 617, baseType: !1222, size: 64, align: 64, offset: 1472)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{null, !1030}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1037, file: !897, line: 623, baseType: !1226, size: 64, align: 64, offset: 1536)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!932, !1030, !1229}
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1057)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1031, file: !897, line: 1365, baseType: !935, size: 64, align: 64, offset: 192)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1031, file: !897, line: 1379, baseType: !1233, size: 64, align: 64, offset: 256)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1236)
!1236 = !{!1237, !1238, !1239, !1240, !1241, !1242, !1243, !1247, !1248, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1264, !1265, !1269, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1287, !1288, !1289, !1290, !1294, !1295, !1296}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1235, file: !628, line: 174, baseType: !968, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1235, file: !628, line: 226, baseType: !1023, size: 64, align: 64, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1235, file: !628, line: 227, baseType: !932, size: 32, align: 32, offset: 128)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1235, file: !628, line: 228, baseType: !1023, size: 64, align: 64, offset: 192)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1235, file: !628, line: 229, baseType: !1023, size: 64, align: 64, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1235, file: !628, line: 233, baseType: !935, size: 64, align: 64, offset: 320)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1235, file: !628, line: 235, baseType: !1244, size: 64, align: 64, offset: 384)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!932, !935, !942, !932}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1235, file: !628, line: 236, baseType: !1244, size: 64, align: 64, offset: 448)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1235, file: !628, line: 237, baseType: !1249, size: 64, align: 64, offset: 512)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!933, !935, !933, !932}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1235, file: !628, line: 238, baseType: !933, size: 64, align: 64, offset: 576)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1235, file: !628, line: 239, baseType: !932, size: 32, align: 32, offset: 640)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1235, file: !628, line: 240, baseType: !932, size: 32, align: 32, offset: 672)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1235, file: !628, line: 241, baseType: !932, size: 32, align: 32, offset: 704)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1235, file: !628, line: 242, baseType: !1110, size: 64, align: 64, offset: 768)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1235, file: !628, line: 243, baseType: !1023, size: 64, align: 64, offset: 832)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1235, file: !628, line: 244, baseType: !1259, size: 64, align: 64, offset: 896)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!1110, !1110, !1262, !931}
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1235, file: !628, line: 245, baseType: !932, size: 32, align: 32, offset: 960)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1235, file: !628, line: 249, baseType: !1266, size: 64, align: 64, offset: 1024)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!932, !935, !932}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1235, file: !628, line: 255, baseType: !1270, size: 64, align: 64, offset: 1088)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!933, !935, !932, !933, !932}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1235, file: !628, line: 260, baseType: !932, size: 32, align: 32, offset: 1152)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1235, file: !628, line: 266, baseType: !933, size: 64, align: 64, offset: 1216)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1235, file: !628, line: 273, baseType: !932, size: 32, align: 32, offset: 1280)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1235, file: !628, line: 279, baseType: !933, size: 64, align: 64, offset: 1344)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1235, file: !628, line: 285, baseType: !932, size: 32, align: 32, offset: 1408)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1235, file: !628, line: 291, baseType: !932, size: 32, align: 32, offset: 1440)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1235, file: !628, line: 298, baseType: !932, size: 32, align: 32, offset: 1472)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1235, file: !628, line: 304, baseType: !932, size: 32, align: 32, offset: 1504)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1235, file: !628, line: 309, baseType: !951, size: 64, align: 64, offset: 1536)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1235, file: !628, line: 314, baseType: !951, size: 64, align: 64, offset: 1600)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1235, file: !628, line: 319, baseType: !1284, size: 64, align: 64, offset: 1664)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!932, !935, !942, !932, !627, !933}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1235, file: !628, line: 326, baseType: !932, size: 32, align: 32, offset: 1728)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1235, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1235, file: !628, line: 332, baseType: !933, size: 64, align: 64, offset: 1792)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1235, file: !628, line: 338, baseType: !1291, size: 64, align: 64, offset: 1856)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!932, !935}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1235, file: !628, line: 340, baseType: !933, size: 64, align: 64, offset: 1920)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1235, file: !628, line: 346, baseType: !1023, size: 64, align: 64, offset: 1984)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1235, file: !628, line: 351, baseType: !932, size: 32, align: 32, offset: 2048)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1031, file: !897, line: 1386, baseType: !932, size: 32, align: 32, offset: 320)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1031, file: !897, line: 1393, baseType: !931, size: 32, align: 32, offset: 352)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1031, file: !897, line: 1405, baseType: !1300, size: 64, align: 64, offset: 384)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1304)
!1304 = !{!1305, !1306, !1307, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1775, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1876, !1882, !1883, !1887, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1919, !1920, !1921, !1922, !1923, !1924}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1303, file: !897, line: 866, baseType: !932, size: 32, align: 32)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1303, file: !897, line: 872, baseType: !932, size: 32, align: 32, offset: 32)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1303, file: !897, line: 878, baseType: !1308, size: 64, align: 64, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1311)
!1311 = !{!1312, !1313, !1314, !1315, !1450, !1451, !1452, !1453, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1479, !1483, !1484, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1663, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1310, file: !4, line: 1561, baseType: !968, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1310, file: !4, line: 1562, baseType: !932, size: 32, align: 32, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1310, file: !4, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1310, file: !4, line: 1565, baseType: !1316, size: 64, align: 64, offset: 128)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1318)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1319)
!1319 = !{!1320, !1321, !1322, !1323, !1324, !1325, !1328, !1331, !1334, !1337, !1340, !1341, !1342, !1350, !1351, !1352, !1354, !1358, !1364, !1369, !1373, !1374, !1415, !1422, !1426, !1427, !1431, !1435, !1439, !1443, !1444, !1445}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1318, file: !4, line: 3475, baseType: !951, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1318, file: !4, line: 3480, baseType: !951, size: 64, align: 64, offset: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1318, file: !4, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1318, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1318, file: !4, line: 3487, baseType: !932, size: 32, align: 32, offset: 192)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1318, file: !4, line: 3488, baseType: !1326, size: 64, align: 64, offset: 256)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1135)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1318, file: !4, line: 3489, baseType: !1329, size: 64, align: 64, offset: 320)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1318, file: !4, line: 3490, baseType: !1332, size: 64, align: 64, offset: 384)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1318, file: !4, line: 3491, baseType: !1335, size: 64, align: 64, offset: 448)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1318, file: !4, line: 3492, baseType: !1338, size: 64, align: 64, offset: 512)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1150)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1318, file: !4, line: 3493, baseType: !943, size: 8, align: 8, offset: 576)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1318, file: !4, line: 3494, baseType: !968, size: 64, align: 64, offset: 640)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1318, file: !4, line: 3495, baseType: !1343, size: 64, align: 64, offset: 704)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1345)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1346)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1347)
!1347 = !{!1348, !1349}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1346, file: !4, line: 3402, baseType: !932, size: 32, align: 32)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1346, file: !4, line: 3403, baseType: !951, size: 64, align: 64, offset: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1318, file: !4, line: 3507, baseType: !951, size: 64, align: 64, offset: 768)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1318, file: !4, line: 3516, baseType: !932, size: 32, align: 32, offset: 832)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1318, file: !4, line: 3517, baseType: !1353, size: 64, align: 64, offset: 896)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1318, file: !4, line: 3527, baseType: !1355, size: 64, align: 64, offset: 960)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!932, !1308}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1318, file: !4, line: 3535, baseType: !1359, size: 64, align: 64, offset: 1024)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{!932, !1308, !1362}
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1309)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1318, file: !4, line: 3541, baseType: !1365, size: 64, align: 64, offset: 1088)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1367)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1368)
!1368 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1318, file: !4, line: 3549, baseType: !1370, size: 64, align: 64, offset: 1152)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{null, !1353}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1318, file: !4, line: 3551, baseType: !1355, size: 64, align: 64, offset: 1216)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1318, file: !4, line: 3552, baseType: !1375, size: 64, align: 64, offset: 1280)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DISubroutineType(types: !1377)
!1377 = !{!932, !1308, !942, !932, !1378}
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1380)
!1380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1381)
!1381 = !{!1382, !1383, !1384, !1385, !1386, !1414}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1380, file: !4, line: 3921, baseType: !940, size: 16, align: 16)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1380, file: !4, line: 3922, baseType: !929, size: 32, align: 32, offset: 32)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1380, file: !4, line: 3923, baseType: !929, size: 32, align: 32, offset: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1380, file: !4, line: 3924, baseType: !931, size: 32, align: 32, offset: 96)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1380, file: !4, line: 3925, baseType: !1387, size: 64, align: 64, offset: 128)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1390)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1391)
!1391 = !{!1392, !1393, !1394, !1395, !1396, !1397, !1403, !1407, !1409, !1410, !1412, !1413}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1390, file: !4, line: 3886, baseType: !932, size: 32, align: 32)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1390, file: !4, line: 3887, baseType: !932, size: 32, align: 32, offset: 32)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1390, file: !4, line: 3888, baseType: !932, size: 32, align: 32, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1390, file: !4, line: 3889, baseType: !932, size: 32, align: 32, offset: 96)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1390, file: !4, line: 3890, baseType: !932, size: 32, align: 32, offset: 128)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1390, file: !4, line: 3897, baseType: !1398, size: 768, align: 64, offset: 192)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1400)
!1400 = !{!1401, !1402}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1399, file: !4, line: 3855, baseType: !1121, size: 512, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1399, file: !4, line: 3857, baseType: !1125, size: 256, align: 32, offset: 512)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1390, file: !4, line: 3903, baseType: !1404, size: 256, align: 64, offset: 960)
!1404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !942, size: 256, align: 64, elements: !1405)
!1405 = !{!1406}
!1406 = !DISubrange(count: 4)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1390, file: !4, line: 3904, baseType: !1408, size: 128, align: 32, offset: 1216)
!1408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 128, align: 32, elements: !1405)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1390, file: !4, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1390, file: !4, line: 3908, baseType: !1411, size: 64, align: 64, offset: 1408)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1390, file: !4, line: 3915, baseType: !1411, size: 64, align: 64, offset: 1472)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1390, file: !4, line: 3917, baseType: !932, size: 32, align: 32, offset: 1536)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1380, file: !4, line: 3926, baseType: !933, size: 64, align: 64, offset: 192)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1318, file: !4, line: 3564, baseType: !1416, size: 64, align: 64, offset: 1344)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{!932, !1308, !1056, !1419, !1421}
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1117)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1318, file: !4, line: 3566, baseType: !1423, size: 64, align: 64, offset: 1408)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{!932, !1308, !935, !1421, !1056}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1318, file: !4, line: 3567, baseType: !1355, size: 64, align: 64, offset: 1472)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1318, file: !4, line: 3576, baseType: !1428, size: 64, align: 64, offset: 1536)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{!932, !1308, !1419}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1318, file: !4, line: 3577, baseType: !1432, size: 64, align: 64, offset: 1600)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DISubroutineType(types: !1434)
!1434 = !{!932, !1308, !1056}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1318, file: !4, line: 3584, baseType: !1436, size: 64, align: 64, offset: 1664)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DISubroutineType(types: !1438)
!1438 = !{!932, !1308, !1116}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1318, file: !4, line: 3589, baseType: !1440, size: 64, align: 64, offset: 1728)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{null, !1308}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1318, file: !4, line: 3594, baseType: !932, size: 32, align: 32, offset: 1792)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1318, file: !4, line: 3600, baseType: !951, size: 64, align: 64, offset: 1856)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1318, file: !4, line: 3609, baseType: !1446, size: 64, align: 64, offset: 1920)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1449)
!1449 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1310, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1310, file: !4, line: 1581, baseType: !931, size: 32, align: 32, offset: 224)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1310, file: !4, line: 1583, baseType: !935, size: 64, align: 64, offset: 256)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1310, file: !4, line: 1591, baseType: !1454, size: 64, align: 64, offset: 320)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1310, file: !4, line: 1598, baseType: !935, size: 64, align: 64, offset: 384)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1310, file: !4, line: 1606, baseType: !933, size: 64, align: 64, offset: 448)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1310, file: !4, line: 1614, baseType: !932, size: 32, align: 32, offset: 512)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1310, file: !4, line: 1622, baseType: !932, size: 32, align: 32, offset: 544)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1310, file: !4, line: 1628, baseType: !932, size: 32, align: 32, offset: 576)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1310, file: !4, line: 1636, baseType: !932, size: 32, align: 32, offset: 608)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1310, file: !4, line: 1643, baseType: !932, size: 32, align: 32, offset: 640)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1310, file: !4, line: 1657, baseType: !942, size: 64, align: 64, offset: 704)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1310, file: !4, line: 1658, baseType: !932, size: 32, align: 32, offset: 768)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1310, file: !4, line: 1679, baseType: !1135, size: 64, align: 32, offset: 800)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1310, file: !4, line: 1688, baseType: !932, size: 32, align: 32, offset: 864)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1310, file: !4, line: 1712, baseType: !932, size: 32, align: 32, offset: 896)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1310, file: !4, line: 1729, baseType: !932, size: 32, align: 32, offset: 928)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1310, file: !4, line: 1729, baseType: !932, size: 32, align: 32, offset: 960)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1310, file: !4, line: 1744, baseType: !932, size: 32, align: 32, offset: 992)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1310, file: !4, line: 1744, baseType: !932, size: 32, align: 32, offset: 1024)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1310, file: !4, line: 1751, baseType: !932, size: 32, align: 32, offset: 1056)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1310, file: !4, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1310, file: !4, line: 1791, baseType: !1475, size: 64, align: 64, offset: 1152)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{null, !1478, !1419, !1421, !932, !932, !932}
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1310, file: !4, line: 1808, baseType: !1480, size: 64, align: 64, offset: 1216)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DISubroutineType(types: !1482)
!1482 = !{!645, !1478, !1329}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1310, file: !4, line: 1816, baseType: !932, size: 32, align: 32, offset: 1280)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1310, file: !4, line: 1825, baseType: !1485, size: 32, align: 32, offset: 1312)
!1485 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1310, file: !4, line: 1830, baseType: !932, size: 32, align: 32, offset: 1344)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1310, file: !4, line: 1838, baseType: !1485, size: 32, align: 32, offset: 1376)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1310, file: !4, line: 1846, baseType: !932, size: 32, align: 32, offset: 1408)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1310, file: !4, line: 1851, baseType: !932, size: 32, align: 32, offset: 1440)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1310, file: !4, line: 1861, baseType: !1485, size: 32, align: 32, offset: 1472)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1310, file: !4, line: 1868, baseType: !1485, size: 32, align: 32, offset: 1504)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1310, file: !4, line: 1875, baseType: !1485, size: 32, align: 32, offset: 1536)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1310, file: !4, line: 1882, baseType: !1485, size: 32, align: 32, offset: 1568)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1310, file: !4, line: 1889, baseType: !1485, size: 32, align: 32, offset: 1600)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1310, file: !4, line: 1896, baseType: !1485, size: 32, align: 32, offset: 1632)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1310, file: !4, line: 1903, baseType: !1485, size: 32, align: 32, offset: 1664)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1310, file: !4, line: 1910, baseType: !932, size: 32, align: 32, offset: 1696)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1310, file: !4, line: 1915, baseType: !932, size: 32, align: 32, offset: 1728)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1310, file: !4, line: 1926, baseType: !1421, size: 64, align: 64, offset: 1792)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1310, file: !4, line: 1935, baseType: !1135, size: 64, align: 32, offset: 1856)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1310, file: !4, line: 1942, baseType: !932, size: 32, align: 32, offset: 1920)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1310, file: !4, line: 1948, baseType: !932, size: 32, align: 32, offset: 1952)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1310, file: !4, line: 1954, baseType: !932, size: 32, align: 32, offset: 1984)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1310, file: !4, line: 1960, baseType: !932, size: 32, align: 32, offset: 2016)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1310, file: !4, line: 1984, baseType: !932, size: 32, align: 32, offset: 2048)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1310, file: !4, line: 1991, baseType: !932, size: 32, align: 32, offset: 2080)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1310, file: !4, line: 1996, baseType: !932, size: 32, align: 32, offset: 2112)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1310, file: !4, line: 2004, baseType: !932, size: 32, align: 32, offset: 2144)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1310, file: !4, line: 2011, baseType: !932, size: 32, align: 32, offset: 2176)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1310, file: !4, line: 2018, baseType: !932, size: 32, align: 32, offset: 2208)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1310, file: !4, line: 2027, baseType: !932, size: 32, align: 32, offset: 2240)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1310, file: !4, line: 2034, baseType: !932, size: 32, align: 32, offset: 2272)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1310, file: !4, line: 2044, baseType: !932, size: 32, align: 32, offset: 2304)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1310, file: !4, line: 2054, baseType: !1515, size: 64, align: 64, offset: 2368)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1310, file: !4, line: 2061, baseType: !1515, size: 64, align: 64, offset: 2432)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1310, file: !4, line: 2066, baseType: !932, size: 32, align: 32, offset: 2496)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1310, file: !4, line: 2070, baseType: !932, size: 32, align: 32, offset: 2528)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1310, file: !4, line: 2078, baseType: !932, size: 32, align: 32, offset: 2560)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1310, file: !4, line: 2085, baseType: !932, size: 32, align: 32, offset: 2592)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1310, file: !4, line: 2092, baseType: !932, size: 32, align: 32, offset: 2624)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1310, file: !4, line: 2099, baseType: !932, size: 32, align: 32, offset: 2656)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1310, file: !4, line: 2106, baseType: !932, size: 32, align: 32, offset: 2688)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1310, file: !4, line: 2113, baseType: !932, size: 32, align: 32, offset: 2720)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1310, file: !4, line: 2120, baseType: !932, size: 32, align: 32, offset: 2752)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1310, file: !4, line: 2125, baseType: !932, size: 32, align: 32, offset: 2784)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1310, file: !4, line: 2133, baseType: !932, size: 32, align: 32, offset: 2816)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1310, file: !4, line: 2140, baseType: !932, size: 32, align: 32, offset: 2848)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1310, file: !4, line: 2145, baseType: !932, size: 32, align: 32, offset: 2880)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1310, file: !4, line: 2153, baseType: !932, size: 32, align: 32, offset: 2912)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1310, file: !4, line: 2158, baseType: !932, size: 32, align: 32, offset: 2944)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1310, file: !4, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1310, file: !4, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1310, file: !4, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1310, file: !4, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1310, file: !4, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1310, file: !4, line: 2203, baseType: !932, size: 32, align: 32, offset: 3136)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1310, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1310, file: !4, line: 2212, baseType: !932, size: 32, align: 32, offset: 3200)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1310, file: !4, line: 2213, baseType: !932, size: 32, align: 32, offset: 3232)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1310, file: !4, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1310, file: !4, line: 2232, baseType: !932, size: 32, align: 32, offset: 3296)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1310, file: !4, line: 2243, baseType: !932, size: 32, align: 32, offset: 3328)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1310, file: !4, line: 2249, baseType: !932, size: 32, align: 32, offset: 3360)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1310, file: !4, line: 2256, baseType: !932, size: 32, align: 32, offset: 3392)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1310, file: !4, line: 2263, baseType: !1150, size: 64, align: 64, offset: 3456)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1310, file: !4, line: 2270, baseType: !1150, size: 64, align: 64, offset: 3520)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1310, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1310, file: !4, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1310, file: !4, line: 2367, baseType: !1551, size: 64, align: 64, offset: 3648)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64, align: 64)
!1552 = !DISubroutineType(types: !1553)
!1553 = !{!932, !1478, !1116, !932}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1310, file: !4, line: 2383, baseType: !932, size: 32, align: 32, offset: 3712)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1310, file: !4, line: 2386, baseType: !1485, size: 32, align: 32, offset: 3744)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1310, file: !4, line: 2387, baseType: !1485, size: 32, align: 32, offset: 3776)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1310, file: !4, line: 2394, baseType: !932, size: 32, align: 32, offset: 3808)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1310, file: !4, line: 2401, baseType: !932, size: 32, align: 32, offset: 3840)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1310, file: !4, line: 2408, baseType: !932, size: 32, align: 32, offset: 3872)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1310, file: !4, line: 2415, baseType: !932, size: 32, align: 32, offset: 3904)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1310, file: !4, line: 2422, baseType: !932, size: 32, align: 32, offset: 3936)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1310, file: !4, line: 2423, baseType: !1563, size: 64, align: 64, offset: 3968)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1565)
!1565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1566)
!1566 = !{!1567, !1568, !1569, !1570}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1565, file: !4, line: 827, baseType: !932, size: 32, align: 32)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1565, file: !4, line: 828, baseType: !932, size: 32, align: 32, offset: 32)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1565, file: !4, line: 829, baseType: !932, size: 32, align: 32, offset: 64)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1565, file: !4, line: 830, baseType: !1485, size: 32, align: 32, offset: 96)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1310, file: !4, line: 2430, baseType: !933, size: 64, align: 64, offset: 4032)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1310, file: !4, line: 2437, baseType: !933, size: 64, align: 64, offset: 4096)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1310, file: !4, line: 2444, baseType: !1485, size: 32, align: 32, offset: 4160)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1310, file: !4, line: 2451, baseType: !1485, size: 32, align: 32, offset: 4192)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1310, file: !4, line: 2458, baseType: !932, size: 32, align: 32, offset: 4224)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1310, file: !4, line: 2469, baseType: !932, size: 32, align: 32, offset: 4256)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1310, file: !4, line: 2475, baseType: !932, size: 32, align: 32, offset: 4288)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1310, file: !4, line: 2481, baseType: !932, size: 32, align: 32, offset: 4320)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1310, file: !4, line: 2485, baseType: !932, size: 32, align: 32, offset: 4352)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1310, file: !4, line: 2489, baseType: !932, size: 32, align: 32, offset: 4384)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1310, file: !4, line: 2493, baseType: !932, size: 32, align: 32, offset: 4416)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1310, file: !4, line: 2501, baseType: !932, size: 32, align: 32, offset: 4448)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1310, file: !4, line: 2506, baseType: !932, size: 32, align: 32, offset: 4480)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1310, file: !4, line: 2510, baseType: !932, size: 32, align: 32, offset: 4512)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1310, file: !4, line: 2514, baseType: !933, size: 64, align: 64, offset: 4544)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1310, file: !4, line: 2528, baseType: !1587, size: 64, align: 64, offset: 4608)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64, align: 64)
!1588 = !DISubroutineType(types: !1589)
!1589 = !{null, !1478, !935, !932, !932}
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1310, file: !4, line: 2534, baseType: !932, size: 32, align: 32, offset: 4672)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1310, file: !4, line: 2545, baseType: !932, size: 32, align: 32, offset: 4704)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1310, file: !4, line: 2547, baseType: !932, size: 32, align: 32, offset: 4736)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1310, file: !4, line: 2549, baseType: !932, size: 32, align: 32, offset: 4768)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1310, file: !4, line: 2551, baseType: !932, size: 32, align: 32, offset: 4800)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1310, file: !4, line: 2553, baseType: !932, size: 32, align: 32, offset: 4832)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1310, file: !4, line: 2555, baseType: !932, size: 32, align: 32, offset: 4864)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1310, file: !4, line: 2557, baseType: !932, size: 32, align: 32, offset: 4896)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1310, file: !4, line: 2559, baseType: !932, size: 32, align: 32, offset: 4928)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1310, file: !4, line: 2563, baseType: !932, size: 32, align: 32, offset: 4960)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1310, file: !4, line: 2571, baseType: !1411, size: 64, align: 64, offset: 4992)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1310, file: !4, line: 2579, baseType: !1411, size: 64, align: 64, offset: 5056)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1310, file: !4, line: 2586, baseType: !932, size: 32, align: 32, offset: 5120)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1310, file: !4, line: 2615, baseType: !932, size: 32, align: 32, offset: 5152)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1310, file: !4, line: 2627, baseType: !932, size: 32, align: 32, offset: 5184)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1310, file: !4, line: 2637, baseType: !932, size: 32, align: 32, offset: 5216)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1310, file: !4, line: 2681, baseType: !932, size: 32, align: 32, offset: 5248)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1310, file: !4, line: 2709, baseType: !933, size: 64, align: 64, offset: 5312)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1310, file: !4, line: 2716, baseType: !1609, size: 64, align: 64, offset: 5376)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1611)
!1611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1612)
!1612 = !{!1613, !1614, !1615, !1616, !1617, !1618, !1619, !1623, !1627, !1628, !1629, !1630, !1636, !1637, !1638, !1639, !1640}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1611, file: !4, line: 3642, baseType: !951, size: 64, align: 64)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1611, file: !4, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1611, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1611, file: !4, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1611, file: !4, line: 3669, baseType: !932, size: 32, align: 32, offset: 160)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1611, file: !4, line: 3682, baseType: !1436, size: 64, align: 64, offset: 192)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1611, file: !4, line: 3698, baseType: !1620, size: 64, align: 64, offset: 256)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64, align: 64)
!1621 = !DISubroutineType(types: !1622)
!1622 = !{!932, !1308, !1262, !929}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1611, file: !4, line: 3712, baseType: !1624, size: 64, align: 64, offset: 320)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DISubroutineType(types: !1626)
!1626 = !{!932, !1308, !932, !1262, !929}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1611, file: !4, line: 3726, baseType: !1620, size: 64, align: 64, offset: 384)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1611, file: !4, line: 3737, baseType: !1355, size: 64, align: 64, offset: 448)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1611, file: !4, line: 3746, baseType: !932, size: 32, align: 32, offset: 512)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1611, file: !4, line: 3757, baseType: !1631, size: 64, align: 64, offset: 576)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64, align: 64)
!1632 = !DISubroutineType(types: !1633)
!1633 = !{null, !1634}
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1611, file: !4, line: 3766, baseType: !1355, size: 64, align: 64, offset: 640)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1611, file: !4, line: 3774, baseType: !1355, size: 64, align: 64, offset: 704)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1611, file: !4, line: 3780, baseType: !932, size: 32, align: 32, offset: 768)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1611, file: !4, line: 3785, baseType: !932, size: 32, align: 32, offset: 800)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1611, file: !4, line: 3795, baseType: !1641, size: 64, align: 64, offset: 832)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{!932, !1308, !1061}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1310, file: !4, line: 2728, baseType: !935, size: 64, align: 64, offset: 5440)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1310, file: !4, line: 2735, baseType: !1149, size: 512, align: 64, offset: 5504)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1310, file: !4, line: 2742, baseType: !932, size: 32, align: 32, offset: 6016)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1310, file: !4, line: 2755, baseType: !932, size: 32, align: 32, offset: 6048)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1310, file: !4, line: 2776, baseType: !932, size: 32, align: 32, offset: 6080)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1310, file: !4, line: 2783, baseType: !932, size: 32, align: 32, offset: 6112)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1310, file: !4, line: 2791, baseType: !932, size: 32, align: 32, offset: 6144)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1310, file: !4, line: 2802, baseType: !1116, size: 64, align: 64, offset: 6208)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1310, file: !4, line: 2811, baseType: !932, size: 32, align: 32, offset: 6272)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1310, file: !4, line: 2821, baseType: !932, size: 32, align: 32, offset: 6304)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1310, file: !4, line: 2830, baseType: !932, size: 32, align: 32, offset: 6336)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1310, file: !4, line: 2840, baseType: !932, size: 32, align: 32, offset: 6368)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1310, file: !4, line: 2851, baseType: !1657, size: 64, align: 64, offset: 6400)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DISubroutineType(types: !1659)
!1659 = !{!932, !1478, !1660, !935, !1421, !932, !932}
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64, align: 64)
!1661 = !DISubroutineType(types: !1662)
!1662 = !{!932, !1478, !935}
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1310, file: !4, line: 2871, baseType: !1664, size: 64, align: 64, offset: 6464)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DISubroutineType(types: !1666)
!1666 = !{!932, !1478, !1667, !935, !1421, !932}
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{!932, !1478, !935, !932, !932}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1310, file: !4, line: 2878, baseType: !932, size: 32, align: 32, offset: 6528)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1310, file: !4, line: 2885, baseType: !932, size: 32, align: 32, offset: 6560)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1310, file: !4, line: 3005, baseType: !932, size: 32, align: 32, offset: 6592)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1310, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1310, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1310, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1310, file: !4, line: 3037, baseType: !942, size: 64, align: 64, offset: 6720)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1310, file: !4, line: 3038, baseType: !932, size: 32, align: 32, offset: 6784)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1310, file: !4, line: 3050, baseType: !1150, size: 64, align: 64, offset: 6848)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1310, file: !4, line: 3065, baseType: !932, size: 32, align: 32, offset: 6912)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1310, file: !4, line: 3083, baseType: !932, size: 32, align: 32, offset: 6944)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1310, file: !4, line: 3092, baseType: !1135, size: 64, align: 32, offset: 6976)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1310, file: !4, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1310, file: !4, line: 3106, baseType: !1135, size: 64, align: 32, offset: 7072)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1310, file: !4, line: 3113, baseType: !1685, size: 64, align: 64, offset: 7168)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1687)
!1687 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1688)
!1688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1689)
!1689 = !{!1690, !1691, !1692, !1693, !1694, !1695, !1698}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1688, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1688, file: !4, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1688, file: !4, line: 720, baseType: !951, size: 64, align: 64, offset: 64)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1688, file: !4, line: 724, baseType: !951, size: 64, align: 64, offset: 128)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1688, file: !4, line: 728, baseType: !932, size: 32, align: 32, offset: 192)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1688, file: !4, line: 734, baseType: !1696, size: 64, align: 64, offset: 256)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1688, file: !4, line: 739, baseType: !1699, size: 64, align: 64, offset: 320)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1346)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1310, file: !4, line: 3129, baseType: !933, size: 64, align: 64, offset: 7232)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1310, file: !4, line: 3130, baseType: !933, size: 64, align: 64, offset: 7296)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1310, file: !4, line: 3131, baseType: !933, size: 64, align: 64, offset: 7360)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1310, file: !4, line: 3132, baseType: !933, size: 64, align: 64, offset: 7424)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1310, file: !4, line: 3139, baseType: !1411, size: 64, align: 64, offset: 7488)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1310, file: !4, line: 3147, baseType: !932, size: 32, align: 32, offset: 7552)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1310, file: !4, line: 3165, baseType: !932, size: 32, align: 32, offset: 7584)
