; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--flvenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--flvenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!965 = !DIEnumerator(name: "FLV_CODECID_PCM_MULAW", value: 128)
!966 = !DIEnumerator(name: "FLV_CODECID_AAC", value: 160)
!967 = !DIEnumerator(name: "FLV_CODECID_SPEEX", value: 176)
!968 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 83, size: 32, align: 32, elements: !969)
!969 = !{!970, !971, !972, !973}
!970 = !DIEnumerator(name: "FLV_SAMPLERATE_SPECIAL", value: 0)
!971 = !DIEnumerator(name: "FLV_SAMPLERATE_11025HZ", value: 4)
!972 = !DIEnumerator(name: "FLV_SAMPLERATE_22050HZ", value: 8)
!973 = !DIEnumerator(name: "FLV_SAMPLERATE_44100HZ", value: 12)
!974 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 73, size: 32, align: 32, elements: !975)
!975 = !{!976, !977}
!976 = !DIEnumerator(name: "FLV_MONO", value: 0)
!977 = !DIEnumerator(name: "FLV_STEREO", value: 1)
!978 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FlvTagType", file: !939, line: 59, size: 32, align: 32, elements: !979)
!979 = !{!980, !981, !982}
!980 = !DIEnumerator(name: "FLV_TAG_TYPE_AUDIO", value: 8)
!981 = !DIEnumerator(name: "FLV_TAG_TYPE_VIDEO", value: 9)
!982 = !DIEnumerator(name: "FLV_TAG_TYPE_META", value: 18)
!983 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 123, size: 32, align: 32, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997}
!985 = !DIEnumerator(name: "AMF_DATA_TYPE_NUMBER", value: 0)
!986 = !DIEnumerator(name: "AMF_DATA_TYPE_BOOL", value: 1)
!987 = !DIEnumerator(name: "AMF_DATA_TYPE_STRING", value: 2)
!988 = !DIEnumerator(name: "AMF_DATA_TYPE_OBJECT", value: 3)
!989 = !DIEnumerator(name: "AMF_DATA_TYPE_NULL", value: 5)
!990 = !DIEnumerator(name: "AMF_DATA_TYPE_UNDEFINED", value: 6)
!991 = !DIEnumerator(name: "AMF_DATA_TYPE_REFERENCE", value: 7)
!992 = !DIEnumerator(name: "AMF_DATA_TYPE_MIXEDARRAY", value: 8)
!993 = !DIEnumerator(name: "AMF_DATA_TYPE_OBJECT_END", value: 9)
!994 = !DIEnumerator(name: "AMF_DATA_TYPE_ARRAY", value: 10)
!995 = !DIEnumerator(name: "AMF_DATA_TYPE_DATE", value: 11)
!996 = !DIEnumerator(name: "AMF_DATA_TYPE_LONG_STRING", value: 12)
!997 = !DIEnumerator(name: "AMF_DATA_TYPE_UNSUPPORTED", value: 13)
!998 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 115, size: 32, align: 32, elements: !999)
!999 = !{!1000, !1001, !1002, !1003, !1004}
!1000 = !DIEnumerator(name: "FLV_FRAME_KEY", value: 16)
!1001 = !DIEnumerator(name: "FLV_FRAME_INTER", value: 32)
!1002 = !DIEnumerator(name: "FLV_FRAME_DISP_INTER", value: 48)
!1003 = !DIEnumerator(name: "FLV_FRAME_GENERATED_KEY", value: 64)
!1004 = !DIEnumerator(name: "FLV_FRAME_VIDEO_INFO_CMD", value: 80)
!1005 = !{!1006, !1007, !1008, !1011, !1012, !1018, !1019, !1022}
!1006 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1007 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1009, line: 40, baseType: !1010)
!1009 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1010 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1011 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1014, line: 221, size: 32, align: 8, elements: !1015)
!1014 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1015 = !{!1016}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1013, file: !1014, line: 221, baseType: !1017, size: 32, align: 32)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1009, line: 51, baseType: !1007)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1009, line: 48, baseType: !1021)
!1021 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !1014, line: 222, size: 16, align: 8, elements: !1025)
!1025 = !{!1026}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1024, file: !1014, line: 222, baseType: !1027, size: 16, align: 16)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1009, line: 49, baseType: !1028)
!1028 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1029 = !{!1030, !2325, !2331, !2335, !2336, !2342}
!1030 = distinct !DIGlobalVariable(name: "ff_flv_muxer", scope: !0, file: !944, line: 1094, type: !1031, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_flv_muxer)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1033)
!1033 = !{!1034, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1055, !1133, !1135, !1136, !2290, !2291, !2292, !2296, !2300, !2304, !2305, !2310, !2311, !2312, !2313, !2314, !2315, !2319}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1032, file: !919, line: 498, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1037 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1032, file: !919, line: 504, baseType: !1035, size: 64, align: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1032, file: !919, line: 505, baseType: !1035, size: 64, align: 64, offset: 128)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1032, file: !919, line: 506, baseType: !1035, size: 64, align: 64, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1032, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1032, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1032, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1032, file: !919, line: 517, baseType: !1006, size: 32, align: 32, offset: 352)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1032, file: !919, line: 523, baseType: !1046, size: 64, align: 64, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1051, line: 44, size: 64, align: 32, elements: !1052)
!1051 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1052 = !{!1053, !1054}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1050, file: !1051, line: 45, baseType: !3, size: 32, align: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1050, file: !1051, line: 46, baseType: !1007, size: 32, align: 32, offset: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1032, file: !919, line: 526, baseType: !1056, size: 64, align: 64, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1058)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1060)
!1060 = !{!1061, !1062, !1066, !1092, !1093, !1094, !1095, !1099, !1105, !1107, !1111}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1059, file: !486, line: 72, baseType: !1035, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1059, file: !486, line: 78, baseType: !1063, size: 64, align: 64, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!1035, !1018}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1059, file: !486, line: 85, baseType: !1067, size: 64, align: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1069)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1070)
!1070 = !{!1071, !1072, !1073, !1074, !1075, !1088, !1089, !1090, !1091}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1069, file: !464, line: 247, baseType: !1035, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1069, file: !464, line: 253, baseType: !1035, size: 64, align: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1069, file: !464, line: 259, baseType: !1006, size: 32, align: 32, offset: 128)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1069, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1069, file: !464, line: 271, baseType: !1076, size: 64, align: 64, offset: 192)
!1076 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1069, file: !464, line: 265, size: 64, align: 64, elements: !1077)
!1077 = !{!1078, !1079, !1080, !1081}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1076, file: !464, line: 266, baseType: !1008, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1076, file: !464, line: 267, baseType: !1011, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1076, file: !464, line: 268, baseType: !1035, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1076, file: !464, line: 270, baseType: !1082, size: 64, align: 32)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1083, line: 61, baseType: !1084)
!1083 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1083, line: 58, size: 64, align: 32, elements: !1085)
!1085 = !{!1086, !1087}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1084, file: !1083, line: 59, baseType: !1006, size: 32, align: 32)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1084, file: !1083, line: 60, baseType: !1006, size: 32, align: 32, offset: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1069, file: !464, line: 272, baseType: !1011, size: 64, align: 64, offset: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1069, file: !464, line: 273, baseType: !1011, size: 64, align: 64, offset: 320)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1069, file: !464, line: 275, baseType: !1006, size: 32, align: 32, offset: 384)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1069, file: !464, line: 300, baseType: !1035, size: 64, align: 64, offset: 448)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1059, file: !486, line: 93, baseType: !1006, size: 32, align: 32, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1059, file: !486, line: 99, baseType: !1006, size: 32, align: 32, offset: 224)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1059, file: !486, line: 108, baseType: !1006, size: 32, align: 32, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1059, file: !486, line: 113, baseType: !1096, size: 64, align: 64, offset: 320)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!1018, !1018, !1018}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1059, file: !486, line: 123, baseType: !1100, size: 64, align: 64, offset: 384)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!1103, !1103}
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1059, file: !486, line: 130, baseType: !1106, size: 32, align: 32, offset: 448)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1059, file: !486, line: 136, baseType: !1108, size: 64, align: 64, offset: 512)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!1106, !1018}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1059, file: !486, line: 142, baseType: !1112, size: 64, align: 64, offset: 576)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!1006, !1115, !1018, !1035, !1006}
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1118)
!1118 = !{!1119, !1131, !1132}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1117, file: !464, line: 360, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1124)
!1124 = !{!1125, !1126, !1127, !1128, !1129, !1130}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1123, file: !464, line: 307, baseType: !1035, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1123, file: !464, line: 313, baseType: !1011, size: 64, align: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1123, file: !464, line: 313, baseType: !1011, size: 64, align: 64, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1123, file: !464, line: 318, baseType: !1011, size: 64, align: 64, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1123, file: !464, line: 318, baseType: !1011, size: 64, align: 64, offset: 256)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1123, file: !464, line: 323, baseType: !1006, size: 32, align: 32, offset: 320)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1117, file: !464, line: 364, baseType: !1006, size: 32, align: 32, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1117, file: !464, line: 368, baseType: !1006, size: 32, align: 32, offset: 96)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1032, file: !919, line: 535, baseType: !1134, size: 64, align: 64, offset: 512)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1032, file: !919, line: 539, baseType: !1006, size: 32, align: 32, offset: 576)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1032, file: !919, line: 541, baseType: !1137, size: 64, align: 64, offset: 640)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!1006, !1140}
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1142)
!1142 = !{!1143, !1144, !1239, !1240, !1241, !1307, !1308, !1309, !2144, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2198, !2199, !2200, !2201, !2202, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2253, !2254, !2257, !2258, !2259, !2260, !2261, !2262, !2267, !2268, !2269, !2270, !2278, !2279, !2283, !2287, !2288, !2289}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1141, file: !919, line: 1342, baseType: !1056, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1141, file: !919, line: 1349, baseType: !1145, size: 64, align: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1147)
!1147 = !{!1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1171, !1172, !1210, !1211, !1215, !1220, !1221, !1222, !1226, !1232, !1238}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1146, file: !919, line: 638, baseType: !1035, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1146, file: !919, line: 645, baseType: !1035, size: 64, align: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1146, file: !919, line: 652, baseType: !1006, size: 32, align: 32, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1146, file: !919, line: 659, baseType: !1035, size: 64, align: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1146, file: !919, line: 661, baseType: !1046, size: 64, align: 64, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1146, file: !919, line: 663, baseType: !1056, size: 64, align: 64, offset: 320)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1146, file: !919, line: 670, baseType: !1035, size: 64, align: 64, offset: 384)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1146, file: !919, line: 679, baseType: !1145, size: 64, align: 64, offset: 448)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1146, file: !919, line: 684, baseType: !1006, size: 32, align: 32, offset: 512)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1146, file: !919, line: 689, baseType: !1006, size: 32, align: 32, offset: 544)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1146, file: !919, line: 696, baseType: !1159, size: 64, align: 64, offset: 576)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!1006, !1162}
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1165)
!1165 = !{!1166, !1167, !1169, !1170}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1164, file: !919, line: 449, baseType: !1035, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1164, file: !919, line: 450, baseType: !1168, size: 64, align: 64, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1164, file: !919, line: 451, baseType: !1006, size: 32, align: 32, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1164, file: !919, line: 452, baseType: !1035, size: 64, align: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1146, file: !919, line: 703, baseType: !1137, size: 64, align: 64, offset: 640)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1146, file: !919, line: 714, baseType: !1173, size: 64, align: 64, offset: 704)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!1006, !1140, !1176}
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1178)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1179)
!1179 = !{!1180, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1206, !1207, !1208, !1209}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1178, file: !4, line: 1451, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1183, line: 94, baseType: !1184)
!1183 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1183, line: 81, size: 192, align: 64, elements: !1185)
!1185 = !{!1186, !1190, !1191}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1184, file: !1183, line: 82, baseType: !1187, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1183, line: 73, baseType: !1189)
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1183, line: 73, flags: DIFlagFwdDecl)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1184, file: !1183, line: 89, baseType: !1019, size: 64, align: 64, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1184, file: !1183, line: 93, baseType: !1006, size: 32, align: 32, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1178, file: !4, line: 1461, baseType: !1008, size: 64, align: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1178, file: !4, line: 1467, baseType: !1008, size: 64, align: 64, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1178, file: !4, line: 1468, baseType: !1019, size: 64, align: 64, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1178, file: !4, line: 1469, baseType: !1006, size: 32, align: 32, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1178, file: !4, line: 1470, baseType: !1006, size: 32, align: 32, offset: 288)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1178, file: !4, line: 1474, baseType: !1006, size: 32, align: 32, offset: 320)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1178, file: !4, line: 1479, baseType: !1199, size: 64, align: 64, offset: 384)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1202)
!1202 = !{!1203, !1204, !1205}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1201, file: !4, line: 1412, baseType: !1019, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1201, file: !4, line: 1413, baseType: !1006, size: 32, align: 32, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1201, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1178, file: !4, line: 1480, baseType: !1006, size: 32, align: 32, offset: 448)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1178, file: !4, line: 1486, baseType: !1008, size: 64, align: 64, offset: 512)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1178, file: !4, line: 1488, baseType: !1008, size: 64, align: 64, offset: 576)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1178, file: !4, line: 1497, baseType: !1008, size: 64, align: 64, offset: 640)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1146, file: !919, line: 720, baseType: !1137, size: 64, align: 64, offset: 768)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1146, file: !919, line: 730, baseType: !1212, size: 64, align: 64, offset: 832)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!1006, !1140, !1006, !1008, !1006}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1146, file: !919, line: 737, baseType: !1216, size: 64, align: 64, offset: 896)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!1008, !1140, !1006, !1219, !1008}
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1146, file: !919, line: 744, baseType: !1137, size: 64, align: 64, offset: 960)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1146, file: !919, line: 750, baseType: !1137, size: 64, align: 64, offset: 1024)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1146, file: !919, line: 758, baseType: !1223, size: 64, align: 64, offset: 1088)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!1006, !1140, !1006, !1008, !1008, !1008, !1006}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1146, file: !919, line: 764, baseType: !1227, size: 64, align: 64, offset: 1152)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!1006, !1140, !1230}
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1146, file: !919, line: 770, baseType: !1233, size: 64, align: 64, offset: 1216)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!1006, !1140, !1236}
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1146, file: !919, line: 776, baseType: !1233, size: 64, align: 64, offset: 1280)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1141, file: !919, line: 1356, baseType: !1134, size: 64, align: 64, offset: 128)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1141, file: !919, line: 1365, baseType: !1018, size: 64, align: 64, offset: 192)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1141, file: !919, line: 1379, baseType: !1242, size: 64, align: 64, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1244)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1245)
!1245 = !{!1246, !1247, !1248, !1249, !1250, !1251, !1252, !1256, !1257, !1261, !1262, !1263, !1264, !1265, !1267, !1268, !1274, !1275, !1279, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1297, !1298, !1299, !1300, !1304, !1305, !1306}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1244, file: !537, line: 174, baseType: !1056, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1244, file: !537, line: 226, baseType: !1168, size: 64, align: 64, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1244, file: !537, line: 227, baseType: !1006, size: 32, align: 32, offset: 128)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1244, file: !537, line: 228, baseType: !1168, size: 64, align: 64, offset: 192)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1244, file: !537, line: 229, baseType: !1168, size: 64, align: 64, offset: 256)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1244, file: !537, line: 233, baseType: !1018, size: 64, align: 64, offset: 320)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1244, file: !537, line: 235, baseType: !1253, size: 64, align: 64, offset: 384)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!1006, !1018, !1019, !1006}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1244, file: !537, line: 236, baseType: !1253, size: 64, align: 64, offset: 448)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1244, file: !537, line: 237, baseType: !1258, size: 64, align: 64, offset: 512)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!1008, !1018, !1008, !1006}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1244, file: !537, line: 238, baseType: !1008, size: 64, align: 64, offset: 576)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1244, file: !537, line: 239, baseType: !1006, size: 32, align: 32, offset: 640)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1244, file: !537, line: 240, baseType: !1006, size: 32, align: 32, offset: 672)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1244, file: !537, line: 241, baseType: !1006, size: 32, align: 32, offset: 704)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1244, file: !537, line: 242, baseType: !1266, size: 64, align: 64, offset: 768)
!1266 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1244, file: !537, line: 243, baseType: !1168, size: 64, align: 64, offset: 832)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1244, file: !537, line: 244, baseType: !1269, size: 64, align: 64, offset: 896)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!1266, !1266, !1272, !1007}
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1244, file: !537, line: 245, baseType: !1006, size: 32, align: 32, offset: 960)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1244, file: !537, line: 249, baseType: !1276, size: 64, align: 64, offset: 1024)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!1006, !1018, !1006}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1244, file: !537, line: 255, baseType: !1280, size: 64, align: 64, offset: 1088)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!1008, !1018, !1006, !1008, !1006}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1244, file: !537, line: 260, baseType: !1006, size: 32, align: 32, offset: 1152)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1244, file: !537, line: 266, baseType: !1008, size: 64, align: 64, offset: 1216)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1244, file: !537, line: 273, baseType: !1006, size: 32, align: 32, offset: 1280)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1244, file: !537, line: 279, baseType: !1008, size: 64, align: 64, offset: 1344)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1244, file: !537, line: 285, baseType: !1006, size: 32, align: 32, offset: 1408)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1244, file: !537, line: 291, baseType: !1006, size: 32, align: 32, offset: 1440)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1244, file: !537, line: 298, baseType: !1006, size: 32, align: 32, offset: 1472)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1244, file: !537, line: 304, baseType: !1006, size: 32, align: 32, offset: 1504)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1244, file: !537, line: 309, baseType: !1035, size: 64, align: 64, offset: 1536)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1244, file: !537, line: 314, baseType: !1035, size: 64, align: 64, offset: 1600)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1244, file: !537, line: 319, baseType: !1294, size: 64, align: 64, offset: 1664)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!1006, !1018, !1019, !1006, !536, !1008}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1244, file: !537, line: 326, baseType: !1006, size: 32, align: 32, offset: 1728)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1244, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1244, file: !537, line: 332, baseType: !1008, size: 64, align: 64, offset: 1792)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1244, file: !537, line: 338, baseType: !1301, size: 64, align: 64, offset: 1856)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!1006, !1018}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1244, file: !537, line: 340, baseType: !1008, size: 64, align: 64, offset: 1920)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1244, file: !537, line: 346, baseType: !1168, size: 64, align: 64, offset: 1984)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1244, file: !537, line: 351, baseType: !1006, size: 32, align: 32, offset: 2048)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1141, file: !919, line: 1386, baseType: !1006, size: 32, align: 32, offset: 320)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1141, file: !919, line: 1393, baseType: !1007, size: 32, align: 32, offset: 352)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1141, file: !919, line: 1405, baseType: !1310, size: 64, align: 64, offset: 384)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1313)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1314)
!1314 = !{!1315, !1316, !1317, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2069, !2075, !2076, !2080, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2112, !2113, !2114, !2115, !2116, !2117}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1313, file: !919, line: 866, baseType: !1006, size: 32, align: 32)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1313, file: !919, line: 872, baseType: !1006, size: 32, align: 32, offset: 32)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1313, file: !919, line: 878, baseType: !1318, size: 64, align: 64, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1320)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1321)
!1321 = !{!1322, !1323, !1324, !1325, !1550, !1551, !1552, !1553, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1706, !1710, !1711, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1890, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1320, file: !4, line: 1561, baseType: !1056, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1320, file: !4, line: 1562, baseType: !1006, size: 32, align: 32, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1320, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1320, file: !4, line: 1565, baseType: !1326, size: 64, align: 64, offset: 128)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1328)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1329)
!1329 = !{!1330, !1331, !1332, !1333, !1334, !1335, !1338, !1341, !1344, !1347, !1351, !1352, !1353, !1361, !1362, !1363, !1365, !1369, !1375, !1384, !1388, !1389, !1434, !1521, !1525, !1526, !1530, !1534, !1539, !1543, !1544, !1545}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1328, file: !4, line: 3475, baseType: !1035, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1328, file: !4, line: 3480, baseType: !1035, size: 64, align: 64, offset: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1328, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1328, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1328, file: !4, line: 3487, baseType: !1006, size: 32, align: 32, offset: 192)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1328, file: !4, line: 3488, baseType: !1336, size: 64, align: 64, offset: 256)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1082)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1328, file: !4, line: 3489, baseType: !1339, size: 64, align: 64, offset: 320)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1328, file: !4, line: 3490, baseType: !1342, size: 64, align: 64, offset: 384)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1328, file: !4, line: 3491, baseType: !1345, size: 64, align: 64, offset: 448)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1328, file: !4, line: 3492, baseType: !1348, size: 64, align: 64, offset: 512)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1350)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1009, line: 55, baseType: !1266)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1328, file: !4, line: 3493, baseType: !1020, size: 8, align: 8, offset: 576)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1328, file: !4, line: 3494, baseType: !1056, size: 64, align: 64, offset: 640)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1328, file: !4, line: 3495, baseType: !1354, size: 64, align: 64, offset: 704)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1356)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1357)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1358)
!1358 = !{!1359, !1360}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1357, file: !4, line: 3402, baseType: !1006, size: 32, align: 32)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1357, file: !4, line: 3403, baseType: !1035, size: 64, align: 64, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1328, file: !4, line: 3507, baseType: !1035, size: 64, align: 64, offset: 768)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1328, file: !4, line: 3516, baseType: !1006, size: 32, align: 32, offset: 832)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1328, file: !4, line: 3517, baseType: !1364, size: 64, align: 64, offset: 896)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1328, file: !4, line: 3527, baseType: !1366, size: 64, align: 64, offset: 960)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{!1006, !1318}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1328, file: !4, line: 3535, baseType: !1370, size: 64, align: 64, offset: 1024)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{!1006, !1318, !1373}
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1319)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1328, file: !4, line: 3541, baseType: !1376, size: 64, align: 64, offset: 1088)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1378)
!1378 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1379)
!1379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1380, line: 223, size: 128, align: 64, elements: !1381)
!1380 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1381 = !{!1382, !1383}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1379, file: !1380, line: 224, baseType: !1272, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1379, file: !1380, line: 225, baseType: !1272, size: 64, align: 64, offset: 64)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1328, file: !4, line: 3549, baseType: !1385, size: 64, align: 64, offset: 1152)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DISubroutineType(types: !1387)
!1387 = !{null, !1364}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1328, file: !4, line: 3551, baseType: !1366, size: 64, align: 64, offset: 1216)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1328, file: !4, line: 3552, baseType: !1390, size: 64, align: 64, offset: 1280)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{!1006, !1318, !1019, !1006, !1393}
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1395)
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1396)
!1396 = !{!1397, !1398, !1399, !1400, !1401, !1433}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1395, file: !4, line: 3921, baseType: !1027, size: 16, align: 16)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1395, file: !4, line: 3922, baseType: !1017, size: 32, align: 32, offset: 32)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1395, file: !4, line: 3923, baseType: !1017, size: 32, align: 32, offset: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1395, file: !4, line: 3924, baseType: !1007, size: 32, align: 32, offset: 96)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1395, file: !4, line: 3925, baseType: !1402, size: 64, align: 64, offset: 128)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1405)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1406)
!1406 = !{!1407, !1408, !1409, !1410, !1411, !1412, !1422, !1426, !1428, !1429, !1431, !1432}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1405, file: !4, line: 3886, baseType: !1006, size: 32, align: 32)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1405, file: !4, line: 3887, baseType: !1006, size: 32, align: 32, offset: 32)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1405, file: !4, line: 3888, baseType: !1006, size: 32, align: 32, offset: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1405, file: !4, line: 3889, baseType: !1006, size: 32, align: 32, offset: 96)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1405, file: !4, line: 3890, baseType: !1006, size: 32, align: 32, offset: 128)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1405, file: !4, line: 3897, baseType: !1413, size: 768, align: 64, offset: 192)
!1413 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1414)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1415)
!1415 = !{!1416, !1420}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1414, file: !4, line: 3855, baseType: !1417, size: 512, align: 64)
!1417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1019, size: 512, align: 64, elements: !1418)
!1418 = !{!1419}
!1419 = !DISubrange(count: 8)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1414, file: !4, line: 3857, baseType: !1421, size: 256, align: 32, offset: 512)
!1421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 256, align: 32, elements: !1418)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1405, file: !4, line: 3903, baseType: !1423, size: 256, align: 64, offset: 960)
!1423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1019, size: 256, align: 64, elements: !1424)
!1424 = !{!1425}
!1425 = !DISubrange(count: 4)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1405, file: !4, line: 3904, baseType: !1427, size: 128, align: 32, offset: 1216)
!1427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 128, align: 32, elements: !1424)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1405, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1405, file: !4, line: 3908, baseType: !1430, size: 64, align: 64, offset: 1408)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1405, file: !4, line: 3915, baseType: !1430, size: 64, align: 64, offset: 1472)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1405, file: !4, line: 3917, baseType: !1006, size: 32, align: 32, offset: 1536)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1395, file: !4, line: 3926, baseType: !1008, size: 64, align: 64, offset: 192)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1328, file: !4, line: 3564, baseType: !1435, size: 64, align: 64, offset: 1344)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{!1006, !1318, !1176, !1438, !1520}
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1440)
!1440 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1441)
!1441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1442)
!1442 = !{!1443, !1444, !1445, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1472, !1474, !1475, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1508, !1509, !1510, !1511, !1512, !1513, !1516, !1517, !1518, !1519}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1441, file: !789, line: 282, baseType: !1417, size: 512, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1441, file: !789, line: 299, baseType: !1421, size: 256, align: 32, offset: 512)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1441, file: !789, line: 315, baseType: !1446, size: 64, align: 64, offset: 768)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1441, file: !789, line: 326, baseType: !1006, size: 32, align: 32, offset: 832)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1441, file: !789, line: 326, baseType: !1006, size: 32, align: 32, offset: 864)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1441, file: !789, line: 334, baseType: !1006, size: 32, align: 32, offset: 896)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1441, file: !789, line: 341, baseType: !1006, size: 32, align: 32, offset: 928)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1441, file: !789, line: 346, baseType: !1006, size: 32, align: 32, offset: 960)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1441, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1441, file: !789, line: 356, baseType: !1082, size: 64, align: 32, offset: 1024)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1441, file: !789, line: 361, baseType: !1008, size: 64, align: 64, offset: 1088)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1441, file: !789, line: 369, baseType: !1008, size: 64, align: 64, offset: 1152)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1441, file: !789, line: 377, baseType: !1008, size: 64, align: 64, offset: 1216)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1441, file: !789, line: 382, baseType: !1006, size: 32, align: 32, offset: 1280)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1441, file: !789, line: 386, baseType: !1006, size: 32, align: 32, offset: 1312)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1441, file: !789, line: 391, baseType: !1006, size: 32, align: 32, offset: 1344)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1441, file: !789, line: 396, baseType: !1018, size: 64, align: 64, offset: 1408)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1441, file: !789, line: 403, baseType: !1462, size: 512, align: 64, offset: 1472)
!1462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1350, size: 512, align: 64, elements: !1418)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1441, file: !789, line: 410, baseType: !1006, size: 32, align: 32, offset: 1984)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1441, file: !789, line: 415, baseType: !1006, size: 32, align: 32, offset: 2016)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1441, file: !789, line: 420, baseType: !1006, size: 32, align: 32, offset: 2048)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1441, file: !789, line: 425, baseType: !1006, size: 32, align: 32, offset: 2080)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1441, file: !789, line: 435, baseType: !1008, size: 64, align: 64, offset: 2112)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1441, file: !789, line: 440, baseType: !1006, size: 32, align: 32, offset: 2176)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1441, file: !789, line: 445, baseType: !1350, size: 64, align: 64, offset: 2240)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1441, file: !789, line: 459, baseType: !1471, size: 512, align: 64, offset: 2304)
!1471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1181, size: 512, align: 64, elements: !1418)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1441, file: !789, line: 473, baseType: !1473, size: 64, align: 64, offset: 2816)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1441, file: !789, line: 477, baseType: !1006, size: 32, align: 32, offset: 2880)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1441, file: !789, line: 479, baseType: !1476, size: 64, align: 64, offset: 2944)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1479)
!1479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1480)
!1480 = !{!1481, !1482, !1483, !1484, !1489}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1479, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1479, file: !789, line: 203, baseType: !1019, size: 64, align: 64, offset: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1479, file: !789, line: 204, baseType: !1006, size: 32, align: 32, offset: 128)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1479, file: !789, line: 205, baseType: !1485, size: 64, align: 64, offset: 192)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1487, line: 86, baseType: !1488)
!1487 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1488 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1487, line: 86, flags: DIFlagFwdDecl)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1479, file: !789, line: 206, baseType: !1181, size: 64, align: 64, offset: 256)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1441, file: !789, line: 480, baseType: !1006, size: 32, align: 32, offset: 3008)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1441, file: !789, line: 505, baseType: !1006, size: 32, align: 32, offset: 3040)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1441, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1441, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1441, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1441, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1441, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1441, file: !789, line: 532, baseType: !1008, size: 64, align: 64, offset: 3264)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1441, file: !789, line: 539, baseType: !1008, size: 64, align: 64, offset: 3328)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1441, file: !789, line: 547, baseType: !1008, size: 64, align: 64, offset: 3392)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1441, file: !789, line: 554, baseType: !1485, size: 64, align: 64, offset: 3456)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1441, file: !789, line: 563, baseType: !1006, size: 32, align: 32, offset: 3520)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1441, file: !789, line: 572, baseType: !1006, size: 32, align: 32, offset: 3552)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1441, file: !789, line: 581, baseType: !1006, size: 32, align: 32, offset: 3584)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1441, file: !789, line: 588, baseType: !1505, size: 64, align: 64, offset: 3648)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1009, line: 36, baseType: !1507)
!1507 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1441, file: !789, line: 593, baseType: !1006, size: 32, align: 32, offset: 3712)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1441, file: !789, line: 596, baseType: !1006, size: 32, align: 32, offset: 3744)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1441, file: !789, line: 599, baseType: !1181, size: 64, align: 64, offset: 3776)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1441, file: !789, line: 605, baseType: !1181, size: 64, align: 64, offset: 3840)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1441, file: !789, line: 616, baseType: !1181, size: 64, align: 64, offset: 3904)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1441, file: !789, line: 626, baseType: !1514, size: 64, align: 64, offset: 3968)
!1514 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1515, line: 216, baseType: !1266)
!1515 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1441, file: !789, line: 627, baseType: !1514, size: 64, align: 64, offset: 4032)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1441, file: !789, line: 628, baseType: !1514, size: 64, align: 64, offset: 4096)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1441, file: !789, line: 629, baseType: !1514, size: 64, align: 64, offset: 4160)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1441, file: !789, line: 645, baseType: !1181, size: 64, align: 64, offset: 4224)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1328, file: !4, line: 3566, baseType: !1522, size: 64, align: 64, offset: 1408)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DISubroutineType(types: !1524)
!1524 = !{!1006, !1318, !1018, !1520, !1176}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1328, file: !4, line: 3567, baseType: !1366, size: 64, align: 64, offset: 1472)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1328, file: !4, line: 3576, baseType: !1527, size: 64, align: 64, offset: 1536)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DISubroutineType(types: !1529)
!1529 = !{!1006, !1318, !1438}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1328, file: !4, line: 3577, baseType: !1531, size: 64, align: 64, offset: 1600)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DISubroutineType(types: !1533)
!1533 = !{!1006, !1318, !1176}
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1328, file: !4, line: 3584, baseType: !1535, size: 64, align: 64, offset: 1664)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!1006, !1318, !1538}
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1328, file: !4, line: 3589, baseType: !1540, size: 64, align: 64, offset: 1728)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DISubroutineType(types: !1542)
!1542 = !{null, !1318}
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1328, file: !4, line: 3594, baseType: !1006, size: 32, align: 32, offset: 1792)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1328, file: !4, line: 3600, baseType: !1035, size: 64, align: 64, offset: 1856)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1328, file: !4, line: 3609, baseType: !1546, size: 64, align: 64, offset: 1920)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1549)
!1549 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1320, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1320, file: !4, line: 1581, baseType: !1007, size: 32, align: 32, offset: 224)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1320, file: !4, line: 1583, baseType: !1018, size: 64, align: 64, offset: 256)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1320, file: !4, line: 1591, baseType: !1554, size: 64, align: 64, offset: 320)
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1555, size: 64, align: 64)
!1555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1380, line: 129, size: 1664, align: 64, elements: !1556)
!1556 = !{!1557, !1558, !1559, !1560, !1561, !1579, !1580, !1586, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682}
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1555, file: !1380, line: 136, baseType: !1006, size: 32, align: 32)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1555, file: !1380, line: 151, baseType: !1006, size: 32, align: 32, offset: 32)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1555, file: !1380, line: 157, baseType: !1006, size: 32, align: 32, offset: 64)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1555, file: !1380, line: 159, baseType: !1538, size: 64, align: 64, offset: 128)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1555, file: !1380, line: 161, baseType: !1562, size: 64, align: 64, offset: 192)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1380, line: 117, baseType: !1564)
!1564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1380, line: 100, size: 832, align: 64, elements: !1565)
!1565 = !{!1566, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578}
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1564, file: !1380, line: 105, baseType: !1567, size: 256, align: 64)
!1567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1568, size: 256, align: 64, elements: !1424)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1183, line: 238, baseType: !1570)
!1570 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1183, line: 238, flags: DIFlagFwdDecl)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1564, file: !1380, line: 110, baseType: !1006, size: 32, align: 32, offset: 256)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1564, file: !1380, line: 111, baseType: !1006, size: 32, align: 32, offset: 288)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1564, file: !1380, line: 111, baseType: !1006, size: 32, align: 32, offset: 320)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1564, file: !1380, line: 112, baseType: !1421, size: 256, align: 32, offset: 352)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1564, file: !1380, line: 113, baseType: !1427, size: 128, align: 32, offset: 608)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1564, file: !1380, line: 114, baseType: !1006, size: 32, align: 32, offset: 736)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1564, file: !1380, line: 115, baseType: !1006, size: 32, align: 32, offset: 768)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1564, file: !1380, line: 116, baseType: !1006, size: 32, align: 32, offset: 800)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1555, file: !1380, line: 163, baseType: !1018, size: 64, align: 64, offset: 256)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1555, file: !1380, line: 165, baseType: !1581, size: 128, align: 64, offset: 320)
!1581 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1380, line: 122, baseType: !1582)
!1582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1380, line: 119, size: 128, align: 64, elements: !1583)
!1583 = !{!1584, !1585}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1582, file: !1380, line: 120, baseType: !1176, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1582, file: !1380, line: 121, baseType: !1538, size: 64, align: 64, offset: 64)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1555, file: !1380, line: 166, baseType: !1587, size: 128, align: 64, offset: 448)
!1587 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1380, line: 127, baseType: !1588)
!1588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1380, line: 124, size: 128, align: 64, elements: !1589)
!1589 = !{!1590, !1663}
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1588, file: !1380, line: 125, baseType: !1591, size: 64, align: 64)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1594)
!1594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1595)
!1595 = !{!1596, !1597, !1621, !1625, !1626, !1660, !1661, !1662}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1594, file: !4, line: 5751, baseType: !1056, size: 64, align: 64)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1594, file: !4, line: 5756, baseType: !1598, size: 64, align: 64, offset: 64)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1600)
!1600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1601)
!1601 = !{!1602, !1603, !1606, !1607, !1608, !1612, !1616, !1620}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1600, file: !4, line: 5797, baseType: !1035, size: 64, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1600, file: !4, line: 5804, baseType: !1604, size: 64, align: 64, offset: 64)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1600, file: !4, line: 5815, baseType: !1056, size: 64, align: 64, offset: 128)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1600, file: !4, line: 5825, baseType: !1006, size: 32, align: 32, offset: 192)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1600, file: !4, line: 5826, baseType: !1609, size: 64, align: 64, offset: 256)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DISubroutineType(types: !1611)
!1611 = !{!1006, !1592}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1600, file: !4, line: 5827, baseType: !1613, size: 64, align: 64, offset: 320)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{!1006, !1592, !1176}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1600, file: !4, line: 5828, baseType: !1617, size: 64, align: 64, offset: 384)
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64, align: 64)
!1618 = !DISubroutineType(types: !1619)
!1619 = !{null, !1592}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1600, file: !4, line: 5829, baseType: !1617, size: 64, align: 64, offset: 448)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1594, file: !4, line: 5762, baseType: !1622, size: 64, align: 64, offset: 128)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1624)
!1624 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1594, file: !4, line: 5768, baseType: !1018, size: 64, align: 64, offset: 192)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1594, file: !4, line: 5775, baseType: !1627, size: 64, align: 64, offset: 256)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1629)
!1629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1630)
!1630 = !{!1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1629, file: !4, line: 3940, baseType: !545, size: 32, align: 32)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1629, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1629, file: !4, line: 3948, baseType: !1017, size: 32, align: 32, offset: 64)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1629, file: !4, line: 3958, baseType: !1019, size: 64, align: 64, offset: 128)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1629, file: !4, line: 3962, baseType: !1006, size: 32, align: 32, offset: 192)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1629, file: !4, line: 3968, baseType: !1006, size: 32, align: 32, offset: 224)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1629, file: !4, line: 3973, baseType: !1008, size: 64, align: 64, offset: 256)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1629, file: !4, line: 3986, baseType: !1006, size: 32, align: 32, offset: 320)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1629, file: !4, line: 3999, baseType: !1006, size: 32, align: 32, offset: 352)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1629, file: !4, line: 4004, baseType: !1006, size: 32, align: 32, offset: 384)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1629, file: !4, line: 4005, baseType: !1006, size: 32, align: 32, offset: 416)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1629, file: !4, line: 4010, baseType: !1006, size: 32, align: 32, offset: 448)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1629, file: !4, line: 4011, baseType: !1006, size: 32, align: 32, offset: 480)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1629, file: !4, line: 4020, baseType: !1082, size: 64, align: 32, offset: 512)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1629, file: !4, line: 4025, baseType: !889, size: 32, align: 32, offset: 576)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1629, file: !4, line: 4030, baseType: !812, size: 32, align: 32, offset: 608)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1629, file: !4, line: 4031, baseType: !818, size: 32, align: 32, offset: 640)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1629, file: !4, line: 4032, baseType: !836, size: 32, align: 32, offset: 672)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1629, file: !4, line: 4033, baseType: !860, size: 32, align: 32, offset: 704)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1629, file: !4, line: 4034, baseType: !879, size: 32, align: 32, offset: 736)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1629, file: !4, line: 4039, baseType: !1006, size: 32, align: 32, offset: 768)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1629, file: !4, line: 4046, baseType: !1350, size: 64, align: 64, offset: 832)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1629, file: !4, line: 4050, baseType: !1006, size: 32, align: 32, offset: 896)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1629, file: !4, line: 4054, baseType: !1006, size: 32, align: 32, offset: 928)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1629, file: !4, line: 4061, baseType: !1006, size: 32, align: 32, offset: 960)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1629, file: !4, line: 4065, baseType: !1006, size: 32, align: 32, offset: 992)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1629, file: !4, line: 4073, baseType: !1006, size: 32, align: 32, offset: 1024)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1629, file: !4, line: 4080, baseType: !1006, size: 32, align: 32, offset: 1056)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1629, file: !4, line: 4084, baseType: !1006, size: 32, align: 32, offset: 1088)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1594, file: !4, line: 5781, baseType: !1627, size: 64, align: 64, offset: 320)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1594, file: !4, line: 5787, baseType: !1082, size: 64, align: 32, offset: 384)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1594, file: !4, line: 5793, baseType: !1082, size: 64, align: 32, offset: 448)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1588, file: !1380, line: 126, baseType: !1006, size: 32, align: 32, offset: 64)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1555, file: !1380, line: 172, baseType: !1176, size: 64, align: 64, offset: 576)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1555, file: !1380, line: 177, baseType: !1019, size: 64, align: 64, offset: 640)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1555, file: !1380, line: 178, baseType: !1007, size: 32, align: 32, offset: 704)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1555, file: !1380, line: 180, baseType: !1018, size: 64, align: 64, offset: 768)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1555, file: !1380, line: 185, baseType: !1006, size: 32, align: 32, offset: 832)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1555, file: !1380, line: 190, baseType: !1018, size: 64, align: 64, offset: 896)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1555, file: !1380, line: 195, baseType: !1006, size: 32, align: 32, offset: 960)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1555, file: !1380, line: 200, baseType: !1176, size: 64, align: 64, offset: 1024)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1555, file: !1380, line: 201, baseType: !1006, size: 32, align: 32, offset: 1088)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1555, file: !1380, line: 202, baseType: !1538, size: 64, align: 64, offset: 1152)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1555, file: !1380, line: 203, baseType: !1006, size: 32, align: 32, offset: 1216)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1555, file: !1380, line: 205, baseType: !1006, size: 32, align: 32, offset: 1248)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1555, file: !1380, line: 206, baseType: !1006, size: 32, align: 32, offset: 1280)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1555, file: !1380, line: 209, baseType: !1514, size: 64, align: 64, offset: 1344)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1555, file: !1380, line: 212, baseType: !1514, size: 64, align: 64, offset: 1408)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1555, file: !1380, line: 213, baseType: !1538, size: 64, align: 64, offset: 1472)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1555, file: !1380, line: 215, baseType: !1006, size: 32, align: 32, offset: 1536)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1555, file: !1380, line: 217, baseType: !1006, size: 32, align: 32, offset: 1568)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1555, file: !1380, line: 220, baseType: !1006, size: 32, align: 32, offset: 1600)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1320, file: !4, line: 1598, baseType: !1018, size: 64, align: 64, offset: 384)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1320, file: !4, line: 1606, baseType: !1008, size: 64, align: 64, offset: 448)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1320, file: !4, line: 1614, baseType: !1006, size: 32, align: 32, offset: 512)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1320, file: !4, line: 1622, baseType: !1006, size: 32, align: 32, offset: 544)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1320, file: !4, line: 1628, baseType: !1006, size: 32, align: 32, offset: 576)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1320, file: !4, line: 1636, baseType: !1006, size: 32, align: 32, offset: 608)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1320, file: !4, line: 1643, baseType: !1006, size: 32, align: 32, offset: 640)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1320, file: !4, line: 1657, baseType: !1019, size: 64, align: 64, offset: 704)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1320, file: !4, line: 1658, baseType: !1006, size: 32, align: 32, offset: 768)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1320, file: !4, line: 1679, baseType: !1082, size: 64, align: 32, offset: 800)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1320, file: !4, line: 1688, baseType: !1006, size: 32, align: 32, offset: 864)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1320, file: !4, line: 1712, baseType: !1006, size: 32, align: 32, offset: 896)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1320, file: !4, line: 1729, baseType: !1006, size: 32, align: 32, offset: 928)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1320, file: !4, line: 1729, baseType: !1006, size: 32, align: 32, offset: 960)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1320, file: !4, line: 1744, baseType: !1006, size: 32, align: 32, offset: 992)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1320, file: !4, line: 1744, baseType: !1006, size: 32, align: 32, offset: 1024)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1320, file: !4, line: 1751, baseType: !1006, size: 32, align: 32, offset: 1056)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1320, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1320, file: !4, line: 1791, baseType: !1702, size: 64, align: 64, offset: 1152)
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
!1703 = !DISubroutineType(types: !1704)
!1704 = !{null, !1705, !1438, !1520, !1006, !1006, !1006}
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1320, file: !4, line: 1808, baseType: !1707, size: 64, align: 64, offset: 1216)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64, align: 64)
!1708 = !DISubroutineType(types: !1709)
!1709 = !{!555, !1705, !1339}
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1320, file: !4, line: 1816, baseType: !1006, size: 32, align: 32, offset: 1280)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1320, file: !4, line: 1825, baseType: !1712, size: 32, align: 32, offset: 1312)
!1712 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1320, file: !4, line: 1830, baseType: !1006, size: 32, align: 32, offset: 1344)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1320, file: !4, line: 1838, baseType: !1712, size: 32, align: 32, offset: 1376)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1320, file: !4, line: 1846, baseType: !1006, size: 32, align: 32, offset: 1408)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1320, file: !4, line: 1851, baseType: !1006, size: 32, align: 32, offset: 1440)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1320, file: !4, line: 1861, baseType: !1712, size: 32, align: 32, offset: 1472)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1320, file: !4, line: 1868, baseType: !1712, size: 32, align: 32, offset: 1504)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1320, file: !4, line: 1875, baseType: !1712, size: 32, align: 32, offset: 1536)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1320, file: !4, line: 1882, baseType: !1712, size: 32, align: 32, offset: 1568)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1320, file: !4, line: 1889, baseType: !1712, size: 32, align: 32, offset: 1600)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1320, file: !4, line: 1896, baseType: !1712, size: 32, align: 32, offset: 1632)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1320, file: !4, line: 1903, baseType: !1712, size: 32, align: 32, offset: 1664)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1320, file: !4, line: 1910, baseType: !1006, size: 32, align: 32, offset: 1696)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1320, file: !4, line: 1915, baseType: !1006, size: 32, align: 32, offset: 1728)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1320, file: !4, line: 1926, baseType: !1520, size: 64, align: 64, offset: 1792)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1320, file: !4, line: 1935, baseType: !1082, size: 64, align: 32, offset: 1856)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1320, file: !4, line: 1942, baseType: !1006, size: 32, align: 32, offset: 1920)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1320, file: !4, line: 1948, baseType: !1006, size: 32, align: 32, offset: 1952)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1320, file: !4, line: 1954, baseType: !1006, size: 32, align: 32, offset: 1984)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1320, file: !4, line: 1960, baseType: !1006, size: 32, align: 32, offset: 2016)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1320, file: !4, line: 1984, baseType: !1006, size: 32, align: 32, offset: 2048)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1320, file: !4, line: 1991, baseType: !1006, size: 32, align: 32, offset: 2080)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1320, file: !4, line: 1996, baseType: !1006, size: 32, align: 32, offset: 2112)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1320, file: !4, line: 2004, baseType: !1006, size: 32, align: 32, offset: 2144)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1320, file: !4, line: 2011, baseType: !1006, size: 32, align: 32, offset: 2176)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1320, file: !4, line: 2018, baseType: !1006, size: 32, align: 32, offset: 2208)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1320, file: !4, line: 2027, baseType: !1006, size: 32, align: 32, offset: 2240)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1320, file: !4, line: 2034, baseType: !1006, size: 32, align: 32, offset: 2272)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1320, file: !4, line: 2044, baseType: !1006, size: 32, align: 32, offset: 2304)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1320, file: !4, line: 2054, baseType: !1742, size: 64, align: 64, offset: 2368)
!1742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1320, file: !4, line: 2061, baseType: !1742, size: 64, align: 64, offset: 2432)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1320, file: !4, line: 2066, baseType: !1006, size: 32, align: 32, offset: 2496)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1320, file: !4, line: 2070, baseType: !1006, size: 32, align: 32, offset: 2528)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1320, file: !4, line: 2078, baseType: !1006, size: 32, align: 32, offset: 2560)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1320, file: !4, line: 2085, baseType: !1006, size: 32, align: 32, offset: 2592)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1320, file: !4, line: 2092, baseType: !1006, size: 32, align: 32, offset: 2624)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1320, file: !4, line: 2099, baseType: !1006, size: 32, align: 32, offset: 2656)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1320, file: !4, line: 2106, baseType: !1006, size: 32, align: 32, offset: 2688)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1320, file: !4, line: 2113, baseType: !1006, size: 32, align: 32, offset: 2720)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1320, file: !4, line: 2120, baseType: !1006, size: 32, align: 32, offset: 2752)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1320, file: !4, line: 2125, baseType: !1006, size: 32, align: 32, offset: 2784)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1320, file: !4, line: 2133, baseType: !1006, size: 32, align: 32, offset: 2816)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1320, file: !4, line: 2140, baseType: !1006, size: 32, align: 32, offset: 2848)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1320, file: !4, line: 2145, baseType: !1006, size: 32, align: 32, offset: 2880)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1320, file: !4, line: 2153, baseType: !1006, size: 32, align: 32, offset: 2912)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1320, file: !4, line: 2158, baseType: !1006, size: 32, align: 32, offset: 2944)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1320, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1320, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1320, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1320, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1320, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1320, file: !4, line: 2203, baseType: !1006, size: 32, align: 32, offset: 3136)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1320, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1320, file: !4, line: 2212, baseType: !1006, size: 32, align: 32, offset: 3200)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1320, file: !4, line: 2213, baseType: !1006, size: 32, align: 32, offset: 3232)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1320, file: !4, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1320, file: !4, line: 2232, baseType: !1006, size: 32, align: 32, offset: 3296)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1320, file: !4, line: 2243, baseType: !1006, size: 32, align: 32, offset: 3328)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1320, file: !4, line: 2249, baseType: !1006, size: 32, align: 32, offset: 3360)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1320, file: !4, line: 2256, baseType: !1006, size: 32, align: 32, offset: 3392)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1320, file: !4, line: 2263, baseType: !1350, size: 64, align: 64, offset: 3456)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1320, file: !4, line: 2270, baseType: !1350, size: 64, align: 64, offset: 3520)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1320, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1320, file: !4, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1320, file: !4, line: 2367, baseType: !1778, size: 64, align: 64, offset: 3648)
!1778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1779, size: 64, align: 64)
!1779 = !DISubroutineType(types: !1780)
!1780 = !{!1006, !1705, !1538, !1006}
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1320, file: !4, line: 2383, baseType: !1006, size: 32, align: 32, offset: 3712)
