; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--utils.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--utils.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.AVRational = type { i32, i32 }
%struct.anon.1 = type { i8*, i32, i32 }
%struct.AVStream = type { i32, i32, %struct.AVCodecContext*, i8*, %struct.AVRational, i64, i64, i64, i32, i32, %struct.AVRational, %struct.AVDictionary*, %struct.AVRational, %struct.AVPacket, %struct.AVPacketSideData*, i32, i32, %struct.AVRational, i8*, %struct.AVCodecParameters*, %struct.anon*, i32, i64, i64, i64, i32, i32, i32, i32, %struct.AVCodecParserContext*, %struct.AVPacketList*, %struct.AVProbeData, [17 x i64], %struct.AVIndexEntry*, i32, i32, i32, i32, i32, i32, i64, i64, i32, i32, i32, i64, i64, i64, i32, i64, i64, i32, i32, [17 x i64], [17 x i8], i64, i8, i8, i32, %struct.AVRational, %struct.AVStreamInternal* }

!898 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !57, line: 798, size: 32, align: 32, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908}
!902 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!903 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!904 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!905 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!906 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!907 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!908 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !910, line: 782, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!911 = !{!912, !913, !914, !915, !916, !917}
!912 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!913 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!914 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!915 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!916 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!917 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !57, line: 5085, size: 32, align: 32, elements: !919)
!919 = !{!920, !921, !922, !923}
!920 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!921 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!922 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!923 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!924 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVIODataMarkerType", file: !925, line: 111, size: 32, align: 32, elements: !926)
!925 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!926 = !{!927, !928, !929, !930, !931, !932}
!927 = !DIEnumerator(name: "AVIO_DATA_MARKER_HEADER", value: 0)
!928 = !DIEnumerator(name: "AVIO_DATA_MARKER_SYNC_POINT", value: 1)
!929 = !DIEnumerator(name: "AVIO_DATA_MARKER_BOUNDARY_POINT", value: 2)
!930 = !DIEnumerator(name: "AVIO_DATA_MARKER_UNKNOWN", value: 3)
!931 = !DIEnumerator(name: "AVIO_DATA_MARKER_TRAILER", value: 4)
!932 = !DIEnumerator(name: "AVIO_DATA_MARKER_FLUSH_POINT", value: 5)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !910, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVRounding", file: !939, line: 79, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "./libavutil/mathematics.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!940 = !{!941, !942, !943, !944, !945, !946}
!941 = !DIEnumerator(name: "AV_ROUND_ZERO", value: 0)
!942 = !DIEnumerator(name: "AV_ROUND_INF", value: 1)
!943 = !DIEnumerator(name: "AV_ROUND_DOWN", value: 2)
!944 = !DIEnumerator(name: "AV_ROUND_UP", value: 3)
!945 = !DIEnumerator(name: "AV_ROUND_NEAR_INF", value: 5)
!946 = !DIEnumerator(name: "AV_ROUND_PASS_MINMAX", value: 8192)
!947 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSideDataParamChangeFlags", file: !57, line: 1522, size: 32, align: 32, elements: !948)
!948 = !{!949, !950, !951, !952}
!949 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_CHANNEL_COUNT", value: 1)
!950 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_CHANNEL_LAYOUT", value: 2)
!951 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_SAMPLE_RATE", value: 4)
!952 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_DIMENSIONS", value: 8)
!953 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVTimebaseSource", file: !910, line: 3051, size: 32, align: 32, elements: !954)
!954 = !{!955, !956, !957, !958}
!955 = !DIEnumerator(name: "AVFMT_TBCF_AUTO", value: -1)
!956 = !DIEnumerator(name: "AVFMT_TBCF_DECODER", value: 0)
!957 = !DIEnumerator(name: "AVFMT_TBCF_DEMUXER", value: 1)
!958 = !DIEnumerator(name: "AVFMT_TBCF_R_FRAMERATE", value: 2)
!959 = !{!960, !963, !964, !986, !1047, !1048, !993, !1050, !1076, !1727, !1733, !1394, !1734}
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !961, line: 40, baseType: !962)
!961 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!962 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !969)
!969 = !{!970, !974, !978, !1006, !1007, !1008, !1009, !1013, !1019, !1021, !1025}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !968, file: !26, line: 72, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !968, file: !26, line: 78, baseType: !975, size: 64, align: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!971, !963}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !968, file: !26, line: 85, baseType: !979, size: 64, align: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !982)
!982 = !{!983, !984, !985, !987, !988, !1002, !1003, !1004, !1005}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !981, file: !4, line: 247, baseType: !971, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !981, file: !4, line: 253, baseType: !971, size: 64, align: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !981, file: !4, line: 259, baseType: !986, size: 32, align: 32, offset: 128)
!986 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !981, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !981, file: !4, line: 271, baseType: !989, size: 64, align: 64, offset: 192)
!989 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !981, file: !4, line: 265, size: 64, align: 64, elements: !990)
!990 = !{!991, !992, !994, !995}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !989, file: !4, line: 266, baseType: !960, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !989, file: !4, line: 267, baseType: !993, size: 64, align: 64)
!993 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !989, file: !4, line: 268, baseType: !971, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !989, file: !4, line: 270, baseType: !996, size: 64, align: 32)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !997, line: 61, baseType: !998)
!997 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !997, line: 58, size: 64, align: 32, elements: !999)
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !998, file: !997, line: 59, baseType: !986, size: 32, align: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !998, file: !997, line: 60, baseType: !986, size: 32, align: 32, offset: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !981, file: !4, line: 272, baseType: !993, size: 64, align: 64, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !981, file: !4, line: 273, baseType: !993, size: 64, align: 64, offset: 320)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !981, file: !4, line: 275, baseType: !986, size: 32, align: 32, offset: 384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !981, file: !4, line: 300, baseType: !971, size: 64, align: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !968, file: !26, line: 93, baseType: !986, size: 32, align: 32, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !968, file: !26, line: 99, baseType: !986, size: 32, align: 32, offset: 224)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !968, file: !26, line: 108, baseType: !986, size: 32, align: 32, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !968, file: !26, line: 113, baseType: !1010, size: 64, align: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!963, !963, !963}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !968, file: !26, line: 123, baseType: !1014, size: 64, align: 64, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!1017, !1017}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !968, file: !26, line: 130, baseType: !1020, size: 32, align: 32, offset: 448)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !968, file: !26, line: 136, baseType: !1022, size: 64, align: 64, offset: 512)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1020, !963}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !968, file: !26, line: 142, baseType: !1026, size: 64, align: 64, offset: 576)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!986, !1029, !963, !971, !986}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1032)
!1032 = !{!1033, !1045, !1046}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1031, file: !4, line: 360, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1044}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1037, file: !4, line: 307, baseType: !971, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1037, file: !4, line: 313, baseType: !993, size: 64, align: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1037, file: !4, line: 313, baseType: !993, size: 64, align: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1037, file: !4, line: 318, baseType: !993, size: 64, align: 64, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1037, file: !4, line: 318, baseType: !993, size: 64, align: 64, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1037, file: !4, line: 323, baseType: !986, size: 32, align: 32, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1031, file: !4, line: 364, baseType: !986, size: 32, align: 32, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1031, file: !4, line: 368, baseType: !986, size: 32, align: 32, offset: 96)
!1047 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !961, line: 55, baseType: !1049)
!1049 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !57, line: 3610, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1059, !1062, !1065, !1068, !1071, !1074, !1077, !1078, !1086, !1087, !1088, !1090, !1642, !1648, !1656, !1660, !1661, !1698, !1702, !1706, !1707, !1711, !1715, !1716, !1720, !1721, !1722}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1052, file: !57, line: 3475, baseType: !971, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1052, file: !57, line: 3480, baseType: !971, size: 64, align: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1052, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1052, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1052, file: !57, line: 3487, baseType: !986, size: 32, align: 32, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1052, file: !57, line: 3488, baseType: !1060, size: 64, align: 64, offset: 256)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1052, file: !57, line: 3489, baseType: !1063, size: 64, align: 64, offset: 320)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1052, file: !57, line: 3490, baseType: !1066, size: 64, align: 64, offset: 384)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1052, file: !57, line: 3491, baseType: !1069, size: 64, align: 64, offset: 448)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1052, file: !57, line: 3492, baseType: !1072, size: 64, align: 64, offset: 512)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1052, file: !57, line: 3493, baseType: !1075, size: 8, align: 8, offset: 576)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !961, line: 48, baseType: !1076)
!1076 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1052, file: !57, line: 3494, baseType: !965, size: 64, align: 64, offset: 640)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1052, file: !57, line: 3495, baseType: !1079, size: 64, align: 64, offset: 704)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1083)
!1083 = !{!1084, !1085}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1082, file: !57, line: 3402, baseType: !986, size: 32, align: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1082, file: !57, line: 3403, baseType: !971, size: 64, align: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1052, file: !57, line: 3507, baseType: !971, size: 64, align: 64, offset: 768)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1052, file: !57, line: 3516, baseType: !986, size: 32, align: 32, offset: 832)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1052, file: !57, line: 3517, baseType: !1089, size: 64, align: 64, offset: 896)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1052, file: !57, line: 3527, baseType: !1091, size: 64, align: 64, offset: 960)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!986, !1094}
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1097)
!1097 = !{!1098, !1099, !1100, !1101, !1104, !1105, !1106, !1107, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1388, !1392, !1393, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1580, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1096, file: !57, line: 1561, baseType: !965, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1096, file: !57, line: 1562, baseType: !986, size: 32, align: 32, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1096, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1096, file: !57, line: 1565, baseType: !1102, size: 64, align: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1096, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1096, file: !57, line: 1581, baseType: !1047, size: 32, align: 32, offset: 224)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1096, file: !57, line: 1583, baseType: !963, size: 64, align: 64, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1096, file: !57, line: 1591, baseType: !1108, size: 64, align: 64, offset: 320)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1110, line: 129, size: 1664, align: 64, elements: !1111)
!1110 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1111 = !{!1112, !1113, !1114, !1115, !1213, !1234, !1235, !1264, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1109, file: !1110, line: 136, baseType: !986, size: 32, align: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1109, file: !1110, line: 151, baseType: !986, size: 32, align: 32, offset: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1109, file: !1110, line: 157, baseType: !986, size: 32, align: 32, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1109, file: !1110, line: 159, baseType: !1116, size: 64, align: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1119)
!1119 = !{!1120, !1125, !1127, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1165, !1167, !1168, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1201, !1202, !1203, !1204, !1205, !1206, !1209, !1210, !1211, !1212}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1118, file: !780, line: 282, baseType: !1121, size: 512, align: 64)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1122, size: 512, align: 64, elements: !1123)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1123 = !{!1124}
!1124 = !DISubrange(count: 8)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1118, file: !780, line: 299, baseType: !1126, size: 256, align: 32, offset: 512)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 256, align: 32, elements: !1123)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1118, file: !780, line: 315, baseType: !1128, size: 64, align: 64, offset: 768)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1118, file: !780, line: 326, baseType: !986, size: 32, align: 32, offset: 832)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1118, file: !780, line: 326, baseType: !986, size: 32, align: 32, offset: 864)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1118, file: !780, line: 334, baseType: !986, size: 32, align: 32, offset: 896)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1118, file: !780, line: 341, baseType: !986, size: 32, align: 32, offset: 928)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1118, file: !780, line: 346, baseType: !986, size: 32, align: 32, offset: 960)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1118, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1118, file: !780, line: 356, baseType: !996, size: 64, align: 32, offset: 1024)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1118, file: !780, line: 361, baseType: !960, size: 64, align: 64, offset: 1088)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1118, file: !780, line: 369, baseType: !960, size: 64, align: 64, offset: 1152)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1118, file: !780, line: 377, baseType: !960, size: 64, align: 64, offset: 1216)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1118, file: !780, line: 382, baseType: !986, size: 32, align: 32, offset: 1280)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1118, file: !780, line: 386, baseType: !986, size: 32, align: 32, offset: 1312)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1118, file: !780, line: 391, baseType: !986, size: 32, align: 32, offset: 1344)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1118, file: !780, line: 396, baseType: !963, size: 64, align: 64, offset: 1408)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1118, file: !780, line: 403, baseType: !1144, size: 512, align: 64, offset: 1472)
!1144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1048, size: 512, align: 64, elements: !1123)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1118, file: !780, line: 410, baseType: !986, size: 32, align: 32, offset: 1984)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1118, file: !780, line: 415, baseType: !986, size: 32, align: 32, offset: 2016)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1118, file: !780, line: 420, baseType: !986, size: 32, align: 32, offset: 2048)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1118, file: !780, line: 425, baseType: !986, size: 32, align: 32, offset: 2080)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1118, file: !780, line: 435, baseType: !960, size: 64, align: 64, offset: 2112)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1118, file: !780, line: 440, baseType: !986, size: 32, align: 32, offset: 2176)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1118, file: !780, line: 445, baseType: !1048, size: 64, align: 64, offset: 2240)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1118, file: !780, line: 459, baseType: !1153, size: 512, align: 64, offset: 2304)
!1153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1154, size: 512, align: 64, elements: !1123)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1156, line: 94, baseType: !1157)
!1156 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1156, line: 81, size: 192, align: 64, elements: !1158)
!1158 = !{!1159, !1163, !1164}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1157, file: !1156, line: 82, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1156, line: 73, baseType: !1162)
!1162 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1156, line: 73, flags: DIFlagFwdDecl)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1157, file: !1156, line: 89, baseType: !1122, size: 64, align: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1157, file: !1156, line: 93, baseType: !986, size: 32, align: 32, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1118, file: !780, line: 473, baseType: !1166, size: 64, align: 64, offset: 2816)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1118, file: !780, line: 477, baseType: !986, size: 32, align: 32, offset: 2880)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1118, file: !780, line: 479, baseType: !1169, size: 64, align: 64, offset: 2944)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1172)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1173)
!1173 = !{!1174, !1175, !1176, !1177, !1182}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1172, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1172, file: !780, line: 203, baseType: !1122, size: 64, align: 64, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1172, file: !780, line: 204, baseType: !986, size: 32, align: 32, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1172, file: !780, line: 205, baseType: !1178, size: 64, align: 64, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1180, line: 86, baseType: !1181)
!1180 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1181 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1180, line: 86, flags: DIFlagFwdDecl)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1172, file: !780, line: 206, baseType: !1154, size: 64, align: 64, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1118, file: !780, line: 480, baseType: !986, size: 32, align: 32, offset: 3008)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1118, file: !780, line: 505, baseType: !986, size: 32, align: 32, offset: 3040)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1118, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1118, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1118, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1118, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1118, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1118, file: !780, line: 532, baseType: !960, size: 64, align: 64, offset: 3264)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1118, file: !780, line: 539, baseType: !960, size: 64, align: 64, offset: 3328)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1118, file: !780, line: 547, baseType: !960, size: 64, align: 64, offset: 3392)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1118, file: !780, line: 554, baseType: !1178, size: 64, align: 64, offset: 3456)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1118, file: !780, line: 563, baseType: !986, size: 32, align: 32, offset: 3520)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1118, file: !780, line: 572, baseType: !986, size: 32, align: 32, offset: 3552)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1118, file: !780, line: 581, baseType: !986, size: 32, align: 32, offset: 3584)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1118, file: !780, line: 588, baseType: !1198, size: 64, align: 64, offset: 3648)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !961, line: 36, baseType: !1200)
!1200 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1118, file: !780, line: 593, baseType: !986, size: 32, align: 32, offset: 3712)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1118, file: !780, line: 596, baseType: !986, size: 32, align: 32, offset: 3744)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1118, file: !780, line: 599, baseType: !1154, size: 64, align: 64, offset: 3776)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1118, file: !780, line: 605, baseType: !1154, size: 64, align: 64, offset: 3840)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1118, file: !780, line: 616, baseType: !1154, size: 64, align: 64, offset: 3904)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1118, file: !780, line: 626, baseType: !1207, size: 64, align: 64, offset: 3968)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1208, line: 216, baseType: !1049)
!1208 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1118, file: !780, line: 627, baseType: !1207, size: 64, align: 64, offset: 4032)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1118, file: !780, line: 628, baseType: !1207, size: 64, align: 64, offset: 4096)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1118, file: !780, line: 629, baseType: !1207, size: 64, align: 64, offset: 4160)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1118, file: !780, line: 645, baseType: !1154, size: 64, align: 64, offset: 4224)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1109, file: !1110, line: 161, baseType: !1214, size: 64, align: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1110, line: 117, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1110, line: 100, size: 832, align: 64, elements: !1217)
!1217 = !{!1218, !1225, !1226, !1227, !1228, !1229, !1231, !1232, !1233}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1216, file: !1110, line: 105, baseType: !1219, size: 256, align: 64)
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1220, size: 256, align: 64, elements: !1223)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1156, line: 238, baseType: !1222)
!1222 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1156, line: 238, flags: DIFlagFwdDecl)
!1223 = !{!1224}
!1224 = !DISubrange(count: 4)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1216, file: !1110, line: 110, baseType: !986, size: 32, align: 32, offset: 256)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1216, file: !1110, line: 111, baseType: !986, size: 32, align: 32, offset: 288)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1216, file: !1110, line: 111, baseType: !986, size: 32, align: 32, offset: 320)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1216, file: !1110, line: 112, baseType: !1126, size: 256, align: 32, offset: 352)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1216, file: !1110, line: 113, baseType: !1230, size: 128, align: 32, offset: 608)
!1230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 128, align: 32, elements: !1223)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1216, file: !1110, line: 114, baseType: !986, size: 32, align: 32, offset: 736)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1216, file: !1110, line: 115, baseType: !986, size: 32, align: 32, offset: 768)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1216, file: !1110, line: 116, baseType: !986, size: 32, align: 32, offset: 800)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1109, file: !1110, line: 163, baseType: !963, size: 64, align: 64, offset: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1109, file: !1110, line: 165, baseType: !1236, size: 128, align: 64, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1110, line: 122, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1110, line: 119, size: 128, align: 64, elements: !1238)
!1238 = !{!1239, !1263}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1237, file: !1110, line: 120, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1243)
!1243 = !{!1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1259, !1260, !1261, !1262}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1242, file: !57, line: 1451, baseType: !1154, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1242, file: !57, line: 1461, baseType: !960, size: 64, align: 64, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1242, file: !57, line: 1467, baseType: !960, size: 64, align: 64, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1242, file: !57, line: 1468, baseType: !1122, size: 64, align: 64, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1242, file: !57, line: 1469, baseType: !986, size: 32, align: 32, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1242, file: !57, line: 1470, baseType: !986, size: 32, align: 32, offset: 288)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1242, file: !57, line: 1474, baseType: !986, size: 32, align: 32, offset: 320)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1242, file: !57, line: 1479, baseType: !1252, size: 64, align: 64, offset: 384)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1255)
!1255 = !{!1256, !1257, !1258}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1254, file: !57, line: 1412, baseType: !1122, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1254, file: !57, line: 1413, baseType: !986, size: 32, align: 32, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1254, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1242, file: !57, line: 1480, baseType: !986, size: 32, align: 32, offset: 448)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1242, file: !57, line: 1486, baseType: !960, size: 64, align: 64, offset: 512)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1242, file: !57, line: 1488, baseType: !960, size: 64, align: 64, offset: 576)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1242, file: !57, line: 1497, baseType: !960, size: 64, align: 64, offset: 640)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1237, file: !1110, line: 121, baseType: !1116, size: 64, align: 64, offset: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1109, file: !1110, line: 166, baseType: !1265, size: 128, align: 64, offset: 448)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1110, line: 127, baseType: !1266)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1110, line: 124, size: 128, align: 64, elements: !1267)
!1267 = !{!1268, !1342}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1266, file: !1110, line: 125, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1272)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1273)
!1273 = !{!1274, !1275, !1299, !1303, !1304, !1339, !1340, !1341}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1272, file: !57, line: 5751, baseType: !965, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1272, file: !57, line: 5756, baseType: !1276, size: 64, align: 64, offset: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1278)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1279)
!1279 = !{!1280, !1281, !1284, !1285, !1286, !1290, !1294, !1298}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1278, file: !57, line: 5797, baseType: !971, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1278, file: !57, line: 5804, baseType: !1282, size: 64, align: 64, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1278, file: !57, line: 5815, baseType: !965, size: 64, align: 64, offset: 128)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1278, file: !57, line: 5825, baseType: !986, size: 32, align: 32, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1278, file: !57, line: 5826, baseType: !1287, size: 64, align: 64, offset: 256)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!986, !1270}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1278, file: !57, line: 5827, baseType: !1291, size: 64, align: 64, offset: 320)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!986, !1270, !1240}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1278, file: !57, line: 5828, baseType: !1295, size: 64, align: 64, offset: 384)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{null, !1270}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1278, file: !57, line: 5829, baseType: !1295, size: 64, align: 64, offset: 448)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1272, file: !57, line: 5762, baseType: !1300, size: 64, align: 64, offset: 128)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1302)
!1302 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1272, file: !57, line: 5768, baseType: !963, size: 64, align: 64, offset: 192)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1272, file: !57, line: 5775, baseType: !1305, size: 64, align: 64, offset: 256)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1307)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1308)
!1308 = !{!1309, !1310, !1311, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1307, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1307, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1307, file: !57, line: 3948, baseType: !1312, size: 32, align: 32, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !961, line: 51, baseType: !1047)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1307, file: !57, line: 3958, baseType: !1122, size: 64, align: 64, offset: 128)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1307, file: !57, line: 3962, baseType: !986, size: 32, align: 32, offset: 192)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1307, file: !57, line: 3968, baseType: !986, size: 32, align: 32, offset: 224)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1307, file: !57, line: 3973, baseType: !960, size: 64, align: 64, offset: 256)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1307, file: !57, line: 3986, baseType: !986, size: 32, align: 32, offset: 320)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1307, file: !57, line: 3999, baseType: !986, size: 32, align: 32, offset: 352)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1307, file: !57, line: 4004, baseType: !986, size: 32, align: 32, offset: 384)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1307, file: !57, line: 4005, baseType: !986, size: 32, align: 32, offset: 416)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1307, file: !57, line: 4010, baseType: !986, size: 32, align: 32, offset: 448)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1307, file: !57, line: 4011, baseType: !986, size: 32, align: 32, offset: 480)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1307, file: !57, line: 4020, baseType: !996, size: 64, align: 32, offset: 512)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1307, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1307, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1307, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1307, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1307, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1307, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1307, file: !57, line: 4039, baseType: !986, size: 32, align: 32, offset: 768)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1307, file: !57, line: 4046, baseType: !1048, size: 64, align: 64, offset: 832)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1307, file: !57, line: 4050, baseType: !986, size: 32, align: 32, offset: 896)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1307, file: !57, line: 4054, baseType: !986, size: 32, align: 32, offset: 928)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1307, file: !57, line: 4061, baseType: !986, size: 32, align: 32, offset: 960)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1307, file: !57, line: 4065, baseType: !986, size: 32, align: 32, offset: 992)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1307, file: !57, line: 4073, baseType: !986, size: 32, align: 32, offset: 1024)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1307, file: !57, line: 4080, baseType: !986, size: 32, align: 32, offset: 1056)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1307, file: !57, line: 4084, baseType: !986, size: 32, align: 32, offset: 1088)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1272, file: !57, line: 5781, baseType: !1305, size: 64, align: 64, offset: 320)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1272, file: !57, line: 5787, baseType: !996, size: 64, align: 32, offset: 384)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1272, file: !57, line: 5793, baseType: !996, size: 64, align: 32, offset: 448)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1266, file: !1110, line: 126, baseType: !986, size: 32, align: 32, offset: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1109, file: !1110, line: 172, baseType: !1240, size: 64, align: 64, offset: 576)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1109, file: !1110, line: 177, baseType: !1122, size: 64, align: 64, offset: 640)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1109, file: !1110, line: 178, baseType: !1047, size: 32, align: 32, offset: 704)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1109, file: !1110, line: 180, baseType: !963, size: 64, align: 64, offset: 768)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1109, file: !1110, line: 185, baseType: !986, size: 32, align: 32, offset: 832)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1109, file: !1110, line: 190, baseType: !963, size: 64, align: 64, offset: 896)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1109, file: !1110, line: 195, baseType: !986, size: 32, align: 32, offset: 960)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1109, file: !1110, line: 200, baseType: !1240, size: 64, align: 64, offset: 1024)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1109, file: !1110, line: 201, baseType: !986, size: 32, align: 32, offset: 1088)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1109, file: !1110, line: 202, baseType: !1116, size: 64, align: 64, offset: 1152)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1109, file: !1110, line: 203, baseType: !986, size: 32, align: 32, offset: 1216)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1109, file: !1110, line: 205, baseType: !986, size: 32, align: 32, offset: 1248)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1109, file: !1110, line: 206, baseType: !986, size: 32, align: 32, offset: 1280)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1109, file: !1110, line: 209, baseType: !1207, size: 64, align: 64, offset: 1344)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1109, file: !1110, line: 212, baseType: !1207, size: 64, align: 64, offset: 1408)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1109, file: !1110, line: 213, baseType: !1116, size: 64, align: 64, offset: 1472)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1109, file: !1110, line: 215, baseType: !986, size: 32, align: 32, offset: 1536)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1109, file: !1110, line: 217, baseType: !986, size: 32, align: 32, offset: 1568)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1109, file: !1110, line: 220, baseType: !986, size: 32, align: 32, offset: 1600)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1096, file: !57, line: 1598, baseType: !963, size: 64, align: 64, offset: 384)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1096, file: !57, line: 1606, baseType: !960, size: 64, align: 64, offset: 448)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1096, file: !57, line: 1614, baseType: !986, size: 32, align: 32, offset: 512)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1096, file: !57, line: 1622, baseType: !986, size: 32, align: 32, offset: 544)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1096, file: !57, line: 1628, baseType: !986, size: 32, align: 32, offset: 576)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1096, file: !57, line: 1636, baseType: !986, size: 32, align: 32, offset: 608)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1096, file: !57, line: 1643, baseType: !986, size: 32, align: 32, offset: 640)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1096, file: !57, line: 1657, baseType: !1122, size: 64, align: 64, offset: 704)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1096, file: !57, line: 1658, baseType: !986, size: 32, align: 32, offset: 768)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1096, file: !57, line: 1679, baseType: !996, size: 64, align: 32, offset: 800)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1096, file: !57, line: 1688, baseType: !986, size: 32, align: 32, offset: 864)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1096, file: !57, line: 1712, baseType: !986, size: 32, align: 32, offset: 896)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1096, file: !57, line: 1729, baseType: !986, size: 32, align: 32, offset: 928)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1096, file: !57, line: 1729, baseType: !986, size: 32, align: 32, offset: 960)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1096, file: !57, line: 1744, baseType: !986, size: 32, align: 32, offset: 992)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1096, file: !57, line: 1744, baseType: !986, size: 32, align: 32, offset: 1024)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1096, file: !57, line: 1751, baseType: !986, size: 32, align: 32, offset: 1056)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1096, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1096, file: !57, line: 1791, baseType: !1381, size: 64, align: 64, offset: 1152)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DISubroutineType(types: !1383)
!1383 = !{null, !1384, !1385, !1387, !986, !986, !986}
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1117)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1096, file: !57, line: 1808, baseType: !1389, size: 64, align: 64, offset: 1216)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DISubroutineType(types: !1391)
!1391 = !{!516, !1384, !1063}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1096, file: !57, line: 1816, baseType: !986, size: 32, align: 32, offset: 1280)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1096, file: !57, line: 1825, baseType: !1394, size: 32, align: 32, offset: 1312)
!1394 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1096, file: !57, line: 1830, baseType: !986, size: 32, align: 32, offset: 1344)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1096, file: !57, line: 1838, baseType: !1394, size: 32, align: 32, offset: 1376)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1096, file: !57, line: 1846, baseType: !986, size: 32, align: 32, offset: 1408)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1096, file: !57, line: 1851, baseType: !986, size: 32, align: 32, offset: 1440)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1096, file: !57, line: 1861, baseType: !1394, size: 32, align: 32, offset: 1472)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1096, file: !57, line: 1868, baseType: !1394, size: 32, align: 32, offset: 1504)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1096, file: !57, line: 1875, baseType: !1394, size: 32, align: 32, offset: 1536)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1096, file: !57, line: 1882, baseType: !1394, size: 32, align: 32, offset: 1568)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1096, file: !57, line: 1889, baseType: !1394, size: 32, align: 32, offset: 1600)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1096, file: !57, line: 1896, baseType: !1394, size: 32, align: 32, offset: 1632)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1096, file: !57, line: 1903, baseType: !1394, size: 32, align: 32, offset: 1664)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1096, file: !57, line: 1910, baseType: !986, size: 32, align: 32, offset: 1696)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1096, file: !57, line: 1915, baseType: !986, size: 32, align: 32, offset: 1728)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1096, file: !57, line: 1926, baseType: !1387, size: 64, align: 64, offset: 1792)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1096, file: !57, line: 1935, baseType: !996, size: 64, align: 32, offset: 1856)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1096, file: !57, line: 1942, baseType: !986, size: 32, align: 32, offset: 1920)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1096, file: !57, line: 1948, baseType: !986, size: 32, align: 32, offset: 1952)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1096, file: !57, line: 1954, baseType: !986, size: 32, align: 32, offset: 1984)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1096, file: !57, line: 1960, baseType: !986, size: 32, align: 32, offset: 2016)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1096, file: !57, line: 1984, baseType: !986, size: 32, align: 32, offset: 2048)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1096, file: !57, line: 1991, baseType: !986, size: 32, align: 32, offset: 2080)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1096, file: !57, line: 1996, baseType: !986, size: 32, align: 32, offset: 2112)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1096, file: !57, line: 2004, baseType: !986, size: 32, align: 32, offset: 2144)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1096, file: !57, line: 2011, baseType: !986, size: 32, align: 32, offset: 2176)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1096, file: !57, line: 2018, baseType: !986, size: 32, align: 32, offset: 2208)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1096, file: !57, line: 2027, baseType: !986, size: 32, align: 32, offset: 2240)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1096, file: !57, line: 2034, baseType: !986, size: 32, align: 32, offset: 2272)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1096, file: !57, line: 2044, baseType: !986, size: 32, align: 32, offset: 2304)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1096, file: !57, line: 2054, baseType: !1424, size: 64, align: 64, offset: 2368)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !961, line: 49, baseType: !1426)
!1426 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1096, file: !57, line: 2061, baseType: !1424, size: 64, align: 64, offset: 2432)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1096, file: !57, line: 2066, baseType: !986, size: 32, align: 32, offset: 2496)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1096, file: !57, line: 2070, baseType: !986, size: 32, align: 32, offset: 2528)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1096, file: !57, line: 2078, baseType: !986, size: 32, align: 32, offset: 2560)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1096, file: !57, line: 2085, baseType: !986, size: 32, align: 32, offset: 2592)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1096, file: !57, line: 2092, baseType: !986, size: 32, align: 32, offset: 2624)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1096, file: !57, line: 2099, baseType: !986, size: 32, align: 32, offset: 2656)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1096, file: !57, line: 2106, baseType: !986, size: 32, align: 32, offset: 2688)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1096, file: !57, line: 2113, baseType: !986, size: 32, align: 32, offset: 2720)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1096, file: !57, line: 2120, baseType: !986, size: 32, align: 32, offset: 2752)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1096, file: !57, line: 2125, baseType: !986, size: 32, align: 32, offset: 2784)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1096, file: !57, line: 2133, baseType: !986, size: 32, align: 32, offset: 2816)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1096, file: !57, line: 2140, baseType: !986, size: 32, align: 32, offset: 2848)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1096, file: !57, line: 2145, baseType: !986, size: 32, align: 32, offset: 2880)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1096, file: !57, line: 2153, baseType: !986, size: 32, align: 32, offset: 2912)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1096, file: !57, line: 2158, baseType: !986, size: 32, align: 32, offset: 2944)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1096, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1096, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1096, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1096, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1096, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1096, file: !57, line: 2203, baseType: !986, size: 32, align: 32, offset: 3136)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1096, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1096, file: !57, line: 2212, baseType: !986, size: 32, align: 32, offset: 3200)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1096, file: !57, line: 2213, baseType: !986, size: 32, align: 32, offset: 3232)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1096, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1096, file: !57, line: 2232, baseType: !986, size: 32, align: 32, offset: 3296)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1096, file: !57, line: 2243, baseType: !986, size: 32, align: 32, offset: 3328)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1096, file: !57, line: 2249, baseType: !986, size: 32, align: 32, offset: 3360)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1096, file: !57, line: 2256, baseType: !986, size: 32, align: 32, offset: 3392)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1096, file: !57, line: 2263, baseType: !1048, size: 64, align: 64, offset: 3456)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1096, file: !57, line: 2270, baseType: !1048, size: 64, align: 64, offset: 3520)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1096, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1096, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1096, file: !57, line: 2367, baseType: !1462, size: 64, align: 64, offset: 3648)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{!986, !1384, !1116, !986}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1096, file: !57, line: 2383, baseType: !986, size: 32, align: 32, offset: 3712)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1096, file: !57, line: 2386, baseType: !1394, size: 32, align: 32, offset: 3744)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1096, file: !57, line: 2387, baseType: !1394, size: 32, align: 32, offset: 3776)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1096, file: !57, line: 2394, baseType: !986, size: 32, align: 32, offset: 3808)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1096, file: !57, line: 2401, baseType: !986, size: 32, align: 32, offset: 3840)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1096, file: !57, line: 2408, baseType: !986, size: 32, align: 32, offset: 3872)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1096, file: !57, line: 2415, baseType: !986, size: 32, align: 32, offset: 3904)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1096, file: !57, line: 2422, baseType: !986, size: 32, align: 32, offset: 3936)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1096, file: !57, line: 2423, baseType: !1474, size: 64, align: 64, offset: 3968)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64, align: 64)
!1475 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1476)
!1476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1477)
!1477 = !{!1478, !1479, !1480, !1481}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1476, file: !57, line: 827, baseType: !986, size: 32, align: 32)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1476, file: !57, line: 828, baseType: !986, size: 32, align: 32, offset: 32)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1476, file: !57, line: 829, baseType: !986, size: 32, align: 32, offset: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1476, file: !57, line: 830, baseType: !1394, size: 32, align: 32, offset: 96)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1096, file: !57, line: 2430, baseType: !960, size: 64, align: 64, offset: 4032)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1096, file: !57, line: 2437, baseType: !960, size: 64, align: 64, offset: 4096)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1096, file: !57, line: 2444, baseType: !1394, size: 32, align: 32, offset: 4160)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1096, file: !57, line: 2451, baseType: !1394, size: 32, align: 32, offset: 4192)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1096, file: !57, line: 2458, baseType: !986, size: 32, align: 32, offset: 4224)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1096, file: !57, line: 2469, baseType: !986, size: 32, align: 32, offset: 4256)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1096, file: !57, line: 2475, baseType: !986, size: 32, align: 32, offset: 4288)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1096, file: !57, line: 2481, baseType: !986, size: 32, align: 32, offset: 4320)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1096, file: !57, line: 2485, baseType: !986, size: 32, align: 32, offset: 4352)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1096, file: !57, line: 2489, baseType: !986, size: 32, align: 32, offset: 4384)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1096, file: !57, line: 2493, baseType: !986, size: 32, align: 32, offset: 4416)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1096, file: !57, line: 2501, baseType: !986, size: 32, align: 32, offset: 4448)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1096, file: !57, line: 2506, baseType: !986, size: 32, align: 32, offset: 4480)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1096, file: !57, line: 2510, baseType: !986, size: 32, align: 32, offset: 4512)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1096, file: !57, line: 2514, baseType: !960, size: 64, align: 64, offset: 4544)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1096, file: !57, line: 2528, baseType: !1498, size: 64, align: 64, offset: 4608)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DISubroutineType(types: !1500)
!1500 = !{null, !1384, !963, !986, !986}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1096, file: !57, line: 2534, baseType: !986, size: 32, align: 32, offset: 4672)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1096, file: !57, line: 2545, baseType: !986, size: 32, align: 32, offset: 4704)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1096, file: !57, line: 2547, baseType: !986, size: 32, align: 32, offset: 4736)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1096, file: !57, line: 2549, baseType: !986, size: 32, align: 32, offset: 4768)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1096, file: !57, line: 2551, baseType: !986, size: 32, align: 32, offset: 4800)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1096, file: !57, line: 2553, baseType: !986, size: 32, align: 32, offset: 4832)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1096, file: !57, line: 2555, baseType: !986, size: 32, align: 32, offset: 4864)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1096, file: !57, line: 2557, baseType: !986, size: 32, align: 32, offset: 4896)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1096, file: !57, line: 2559, baseType: !986, size: 32, align: 32, offset: 4928)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1096, file: !57, line: 2563, baseType: !986, size: 32, align: 32, offset: 4960)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1096, file: !57, line: 2571, baseType: !1512, size: 64, align: 64, offset: 4992)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1096, file: !57, line: 2579, baseType: !1512, size: 64, align: 64, offset: 5056)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1096, file: !57, line: 2586, baseType: !986, size: 32, align: 32, offset: 5120)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1096, file: !57, line: 2615, baseType: !986, size: 32, align: 32, offset: 5152)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1096, file: !57, line: 2627, baseType: !986, size: 32, align: 32, offset: 5184)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1096, file: !57, line: 2637, baseType: !986, size: 32, align: 32, offset: 5216)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1096, file: !57, line: 2681, baseType: !986, size: 32, align: 32, offset: 5248)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1096, file: !57, line: 2709, baseType: !960, size: 64, align: 64, offset: 5312)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1096, file: !57, line: 2716, baseType: !1521, size: 64, align: 64, offset: 5376)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1523)
!1523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1524)
!1524 = !{!1525, !1526, !1527, !1528, !1529, !1530, !1534, !1540, !1544, !1545, !1546, !1547, !1553, !1554, !1555, !1556, !1557}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1523, file: !57, line: 3642, baseType: !971, size: 64, align: 64)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1523, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1523, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1523, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1523, file: !57, line: 3669, baseType: !986, size: 32, align: 32, offset: 160)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1523, file: !57, line: 3682, baseType: !1531, size: 64, align: 64, offset: 192)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DISubroutineType(types: !1533)
!1533 = !{!986, !1094, !1116}
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1523, file: !57, line: 3698, baseType: !1535, size: 64, align: 64, offset: 256)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!986, !1094, !1538, !1312}
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1075)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1523, file: !57, line: 3712, baseType: !1541, size: 64, align: 64, offset: 320)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{!986, !1094, !986, !1538, !1312}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1523, file: !57, line: 3726, baseType: !1535, size: 64, align: 64, offset: 384)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1523, file: !57, line: 3737, baseType: !1091, size: 64, align: 64, offset: 448)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1523, file: !57, line: 3746, baseType: !986, size: 32, align: 32, offset: 512)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1523, file: !57, line: 3757, baseType: !1548, size: 64, align: 64, offset: 576)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DISubroutineType(types: !1550)
!1550 = !{null, !1551}
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64, align: 64)
!1552 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !57, line: 3617, flags: DIFlagFwdDecl)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1523, file: !57, line: 3766, baseType: !1091, size: 64, align: 64, offset: 640)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1523, file: !57, line: 3774, baseType: !1091, size: 64, align: 64, offset: 704)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1523, file: !57, line: 3780, baseType: !986, size: 32, align: 32, offset: 768)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1523, file: !57, line: 3785, baseType: !986, size: 32, align: 32, offset: 800)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1523, file: !57, line: 3795, baseType: !1558, size: 64, align: 64, offset: 832)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DISubroutineType(types: !1560)
!1560 = !{!986, !1094, !1154}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1096, file: !57, line: 2728, baseType: !963, size: 64, align: 64, offset: 5440)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1096, file: !57, line: 2735, baseType: !1144, size: 512, align: 64, offset: 5504)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1096, file: !57, line: 2742, baseType: !986, size: 32, align: 32, offset: 6016)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1096, file: !57, line: 2755, baseType: !986, size: 32, align: 32, offset: 6048)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1096, file: !57, line: 2776, baseType: !986, size: 32, align: 32, offset: 6080)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1096, file: !57, line: 2783, baseType: !986, size: 32, align: 32, offset: 6112)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1096, file: !57, line: 2791, baseType: !986, size: 32, align: 32, offset: 6144)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1096, file: !57, line: 2802, baseType: !1116, size: 64, align: 64, offset: 6208)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1096, file: !57, line: 2811, baseType: !986, size: 32, align: 32, offset: 6272)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1096, file: !57, line: 2821, baseType: !986, size: 32, align: 32, offset: 6304)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1096, file: !57, line: 2830, baseType: !986, size: 32, align: 32, offset: 6336)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1096, file: !57, line: 2840, baseType: !986, size: 32, align: 32, offset: 6368)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1096, file: !57, line: 2851, baseType: !1574, size: 64, align: 64, offset: 6400)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DISubroutineType(types: !1576)
!1576 = !{!986, !1384, !1577, !963, !1387, !986, !986}
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DISubroutineType(types: !1579)
!1579 = !{!986, !1384, !963}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1096, file: !57, line: 2871, baseType: !1581, size: 64, align: 64, offset: 6464)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DISubroutineType(types: !1583)
!1583 = !{!986, !1384, !1584, !963, !1387, !986}
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DISubroutineType(types: !1586)
!1586 = !{!986, !1384, !963, !986, !986}
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1096, file: !57, line: 2878, baseType: !986, size: 32, align: 32, offset: 6528)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1096, file: !57, line: 2885, baseType: !986, size: 32, align: 32, offset: 6560)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1096, file: !57, line: 3005, baseType: !986, size: 32, align: 32, offset: 6592)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1096, file: !57, line: 3013, baseType: !900, size: 32, align: 32, offset: 6624)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1096, file: !57, line: 3020, baseType: !900, size: 32, align: 32, offset: 6656)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1096, file: !57, line: 3027, baseType: !900, size: 32, align: 32, offset: 6688)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1096, file: !57, line: 3037, baseType: !1122, size: 64, align: 64, offset: 6720)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1096, file: !57, line: 3038, baseType: !986, size: 32, align: 32, offset: 6784)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1096, file: !57, line: 3050, baseType: !1048, size: 64, align: 64, offset: 6848)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1096, file: !57, line: 3065, baseType: !986, size: 32, align: 32, offset: 6912)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1096, file: !57, line: 3083, baseType: !986, size: 32, align: 32, offset: 6944)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1096, file: !57, line: 3092, baseType: !996, size: 64, align: 32, offset: 6976)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1096, file: !57, line: 3099, baseType: !516, size: 32, align: 32, offset: 7040)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1096, file: !57, line: 3106, baseType: !996, size: 64, align: 32, offset: 7072)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1096, file: !57, line: 3113, baseType: !1602, size: 64, align: 64, offset: 7168)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1604)
!1604 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !57, line: 740, baseType: !1605)
!1605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !57, line: 712, size: 384, align: 64, elements: !1606)
!1606 = !{!1607, !1608, !1609, !1610, !1611, !1612, !1615}
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1605, file: !57, line: 713, baseType: !56, size: 32, align: 32)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1605, file: !57, line: 714, baseType: !46, size: 32, align: 32, offset: 32)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1605, file: !57, line: 720, baseType: !971, size: 64, align: 64, offset: 64)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1605, file: !57, line: 724, baseType: !971, size: 64, align: 64, offset: 128)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1605, file: !57, line: 728, baseType: !986, size: 32, align: 32, offset: 192)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1605, file: !57, line: 734, baseType: !1613, size: 64, align: 64, offset: 256)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1605, file: !57, line: 739, baseType: !1616, size: 64, align: 64, offset: 320)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1082)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1096, file: !57, line: 3129, baseType: !960, size: 64, align: 64, offset: 7232)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1096, file: !57, line: 3130, baseType: !960, size: 64, align: 64, offset: 7296)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1096, file: !57, line: 3131, baseType: !960, size: 64, align: 64, offset: 7360)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1096, file: !57, line: 3132, baseType: !960, size: 64, align: 64, offset: 7424)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1096, file: !57, line: 3139, baseType: !1512, size: 64, align: 64, offset: 7488)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1096, file: !57, line: 3147, baseType: !986, size: 32, align: 32, offset: 7552)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1096, file: !57, line: 3165, baseType: !986, size: 32, align: 32, offset: 7584)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1096, file: !57, line: 3172, baseType: !986, size: 32, align: 32, offset: 7616)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1096, file: !57, line: 3180, baseType: !986, size: 32, align: 32, offset: 7648)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1096, file: !57, line: 3191, baseType: !1424, size: 64, align: 64, offset: 7680)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1096, file: !57, line: 3199, baseType: !1122, size: 64, align: 64, offset: 7744)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1096, file: !57, line: 3207, baseType: !1512, size: 64, align: 64, offset: 7808)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1096, file: !57, line: 3214, baseType: !1047, size: 32, align: 32, offset: 7872)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1096, file: !57, line: 3224, baseType: !1252, size: 64, align: 64, offset: 7936)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1096, file: !57, line: 3225, baseType: !986, size: 32, align: 32, offset: 8000)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1096, file: !57, line: 3249, baseType: !1154, size: 64, align: 64, offset: 8064)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1096, file: !57, line: 3256, baseType: !986, size: 32, align: 32, offset: 8128)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1096, file: !57, line: 3271, baseType: !986, size: 32, align: 32, offset: 8160)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1096, file: !57, line: 3279, baseType: !960, size: 64, align: 64, offset: 8192)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1096, file: !57, line: 3301, baseType: !1154, size: 64, align: 64, offset: 8256)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1096, file: !57, line: 3310, baseType: !986, size: 32, align: 32, offset: 8320)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1096, file: !57, line: 3337, baseType: !986, size: 32, align: 32, offset: 8352)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1096, file: !57, line: 3351, baseType: !986, size: 32, align: 32, offset: 8384)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1096, file: !57, line: 3359, baseType: !986, size: 32, align: 32, offset: 8416)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1052, file: !57, line: 3535, baseType: !1643, size: 64, align: 64, offset: 1024)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64, align: 64)
!1644 = !DISubroutineType(types: !1645)
!1645 = !{!986, !1094, !1646}
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1095)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1052, file: !57, line: 3541, baseType: !1649, size: 64, align: 64, offset: 1088)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1651)
!1651 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1652)
!1652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1110, line: 223, size: 128, align: 64, elements: !1653)
!1653 = !{!1654, !1655}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1652, file: !1110, line: 224, baseType: !1538, size: 64, align: 64)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1652, file: !1110, line: 225, baseType: !1538, size: 64, align: 64, offset: 64)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1052, file: !57, line: 3549, baseType: !1657, size: 64, align: 64, offset: 1152)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DISubroutineType(types: !1659)
!1659 = !{null, !1089}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1052, file: !57, line: 3551, baseType: !1091, size: 64, align: 64, offset: 1216)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1052, file: !57, line: 3552, baseType: !1662, size: 64, align: 64, offset: 1280)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DISubroutineType(types: !1664)
!1664 = !{!986, !1094, !1122, !986, !1665}
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1667)
!1667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1668)
!1668 = !{!1669, !1670, !1671, !1672, !1673, !1697}
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1667, file: !57, line: 3921, baseType: !1425, size: 16, align: 16)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1667, file: !57, line: 3922, baseType: !1312, size: 32, align: 32, offset: 32)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1667, file: !57, line: 3923, baseType: !1312, size: 32, align: 32, offset: 64)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1667, file: !57, line: 3924, baseType: !1047, size: 32, align: 32, offset: 96)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1667, file: !57, line: 3925, baseType: !1674, size: 64, align: 64, offset: 128)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1677)
!1677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1678)
!1678 = !{!1679, !1680, !1681, !1682, !1683, !1684, !1690, !1692, !1693, !1694, !1695, !1696}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1677, file: !57, line: 3886, baseType: !986, size: 32, align: 32)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1677, file: !57, line: 3887, baseType: !986, size: 32, align: 32, offset: 32)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1677, file: !57, line: 3888, baseType: !986, size: 32, align: 32, offset: 64)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1677, file: !57, line: 3889, baseType: !986, size: 32, align: 32, offset: 96)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1677, file: !57, line: 3890, baseType: !986, size: 32, align: 32, offset: 128)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1677, file: !57, line: 3897, baseType: !1685, size: 768, align: 64, offset: 192)
!1685 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1686)
!1686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1687)
!1687 = !{!1688, !1689}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1686, file: !57, line: 3855, baseType: !1121, size: 512, align: 64)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1686, file: !57, line: 3857, baseType: !1126, size: 256, align: 32, offset: 512)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1677, file: !57, line: 3903, baseType: !1691, size: 256, align: 64, offset: 960)
!1691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1122, size: 256, align: 64, elements: !1223)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1677, file: !57, line: 3904, baseType: !1230, size: 128, align: 32, offset: 1216)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1677, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1677, file: !57, line: 3908, baseType: !1512, size: 64, align: 64, offset: 1408)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1677, file: !57, line: 3915, baseType: !1512, size: 64, align: 64, offset: 1472)
