; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--dump.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--dump.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.AVPacket = type { %struct.AVBufferRef*, i64, i64, i8*, i32, i32, i32, %struct.AVPacketSideData*, i32, i64, i64, i64 }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque
%struct.AVPacketSideData = type { i8*, i32, i32 }

!925 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!926 = !{!927, !928, !929, !930, !931, !932}
!927 = !DIEnumerator(name: "AVIO_DATA_MARKER_HEADER", value: 0)
!928 = !DIEnumerator(name: "AVIO_DATA_MARKER_SYNC_POINT", value: 1)
!929 = !DIEnumerator(name: "AVIO_DATA_MARKER_BOUNDARY_POINT", value: 2)
!930 = !DIEnumerator(name: "AVIO_DATA_MARKER_UNKNOWN", value: 3)
!931 = !DIEnumerator(name: "AVIO_DATA_MARKER_TRAILER", value: 4)
!932 = !DIEnumerator(name: "AVIO_DATA_MARKER_FLUSH_POINT", value: 5)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !910, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSideDataParamChangeFlags", file: !4, line: 1522, size: 32, align: 32, elements: !939)
!939 = !{!940, !941, !942, !943}
!940 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_CHANNEL_COUNT", value: 1)
!941 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_CHANNEL_LAYOUT", value: 2)
!942 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_SAMPLE_RATE", value: 4)
!943 = !DIEnumerator(name: "AV_SIDE_DATA_PARAM_CHANGE_DIMENSIONS", value: 8)
!944 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStereo3DType", file: !945, line: 51, size: 32, align: 32, elements: !946)
!945 = !DIFile(filename: "./libavutil/stereo3d.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!946 = !{!947, !948, !949, !950, !951, !952, !953, !954}
!947 = !DIEnumerator(name: "AV_STEREO3D_2D", value: 0)
!948 = !DIEnumerator(name: "AV_STEREO3D_SIDEBYSIDE", value: 1)
!949 = !DIEnumerator(name: "AV_STEREO3D_TOPBOTTOM", value: 2)
!950 = !DIEnumerator(name: "AV_STEREO3D_FRAMESEQUENCE", value: 3)
!951 = !DIEnumerator(name: "AV_STEREO3D_CHECKERBOARD", value: 4)
!952 = !DIEnumerator(name: "AV_STEREO3D_SIDEBYSIDE_QUINCUNX", value: 5)
!953 = !DIEnumerator(name: "AV_STEREO3D_LINES", value: 6)
!954 = !DIEnumerator(name: "AV_STEREO3D_COLUMNS", value: 7)
!955 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStereo3DView", file: !945, line: 147, size: 32, align: 32, elements: !956)
!956 = !{!957, !958, !959}
!957 = !DIEnumerator(name: "AV_STEREO3D_VIEW_PACKED", value: 0)
!958 = !DIEnumerator(name: "AV_STEREO3D_VIEW_LEFT", value: 1)
!959 = !DIEnumerator(name: "AV_STEREO3D_VIEW_RIGHT", value: 2)
!960 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSphericalProjection", file: !961, line: 51, size: 32, align: 32, elements: !962)
!961 = !DIFile(filename: "./libavutil/spherical.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!962 = !{!963, !964, !965}
!963 = !DIEnumerator(name: "AV_SPHERICAL_EQUIRECTANGULAR", value: 0)
!964 = !DIEnumerator(name: "AV_SPHERICAL_CUBEMAP", value: 1)
!965 = !DIEnumerator(name: "AV_SPHERICAL_EQUIRECTANGULAR_TILE", value: 2)
!966 = !{!967, !968, !971, !972, !973, !975, !983, !990, !999, !1000, !1007, !1008, !1017, !1040, !1053}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !969, line: 40, baseType: !970)
!969 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!970 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!971 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!972 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !969, line: 38, baseType: !971)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !978, line: 221, size: 32, align: 8, elements: !979)
!978 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!979 = !{!980}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !977, file: !978, line: 221, baseType: !981, size: 32, align: 32)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !969, line: 51, baseType: !982)
!982 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !978, line: 220, size: 64, align: 8, elements: !986)
!986 = !{!987}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !985, file: !978, line: 220, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !969, line: 55, baseType: !989)
!989 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVReplayGain", file: !992, line: 48, baseType: !993)
!992 = !DIFile(filename: "./libavutil/replaygain.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVReplayGain", file: !992, line: 29, size: 128, align: 32, elements: !994)
!994 = !{!995, !996, !997, !998}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "track_gain", scope: !993, file: !992, line: 34, baseType: !974, size: 32, align: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "track_peak", scope: !993, file: !992, line: 39, baseType: !981, size: 32, align: 32, offset: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "album_gain", scope: !993, file: !992, line: 43, baseType: !974, size: 32, align: 32, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "album_peak", scope: !993, file: !992, line: 47, baseType: !981, size: 32, align: 32, offset: 96)
!999 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStereo3D", file: !945, line: 191, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStereo3D", file: !945, line: 176, size: 96, align: 32, elements: !1003)
!1003 = !{!1004, !1005, !1006}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1002, file: !945, line: 180, baseType: !944, size: 32, align: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1002, file: !945, line: 185, baseType: !971, size: 32, align: 32, offset: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1002, file: !945, line: 190, baseType: !955, size: 32, align: 32, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCPBProperties", file: !4, line: 1162, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCPBProperties", file: !4, line: 1119, size: 192, align: 64, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "max_bitrate", scope: !1010, file: !4, line: 1125, baseType: !971, size: 32, align: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "min_bitrate", scope: !1010, file: !4, line: 1134, baseType: !971, size: 32, align: 32, offset: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "avg_bitrate", scope: !1010, file: !4, line: 1143, baseType: !971, size: 32, align: 32, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1010, file: !4, line: 1152, baseType: !971, size: 32, align: 32, offset: 96)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1010, file: !4, line: 1161, baseType: !988, size: 64, align: 64, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVMasteringDisplayMetadata", file: !1019, line: 69, baseType: !1020)
!1019 = !DIFile(filename: "./libavutil/mastering_display_metadata.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVMasteringDisplayMetadata", file: !1019, line: 38, size: 704, align: 32, elements: !1021)
!1021 = !{!1022, !1033, !1036, !1037, !1038, !1039}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "display_primaries", scope: !1020, file: !1019, line: 42, baseType: !1023, size: 384, align: 32)
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1024, size: 384, align: 32, elements: !1030)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1025, line: 61, baseType: !1026)
!1025 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1025, line: 58, size: 64, align: 32, elements: !1027)
!1027 = !{!1028, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1026, file: !1025, line: 59, baseType: !971, size: 32, align: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1026, file: !1025, line: 60, baseType: !971, size: 32, align: 32, offset: 32)
!1030 = !{!1031, !1032}
!1031 = !DISubrange(count: 3)
!1032 = !DISubrange(count: 2)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !1020, file: !1019, line: 47, baseType: !1034, size: 128, align: 32, offset: 384)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1024, size: 128, align: 32, elements: !1035)
!1035 = !{!1032}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "min_luminance", scope: !1020, file: !1019, line: 52, baseType: !1024, size: 64, align: 32, offset: 512)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "max_luminance", scope: !1020, file: !1019, line: 57, baseType: !1024, size: 64, align: 32, offset: 576)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "has_primaries", scope: !1020, file: !1019, line: 62, baseType: !971, size: 32, align: 32, offset: 640)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "has_luminance", scope: !1020, file: !1019, line: 67, baseType: !971, size: 32, align: 32, offset: 672)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSphericalMapping", file: !961, line: 183, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSphericalMapping", file: !961, line: 82, size: 288, align: 32, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !1042, file: !961, line: 86, baseType: !960, size: 32, align: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "yaw", scope: !1042, file: !961, line: 126, baseType: !974, size: 32, align: 32, offset: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !1042, file: !961, line: 127, baseType: !974, size: 32, align: 32, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !1042, file: !961, line: 128, baseType: !974, size: 32, align: 32, offset: 96)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "bound_left", scope: !1042, file: !961, line: 167, baseType: !981, size: 32, align: 32, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "bound_top", scope: !1042, file: !961, line: 168, baseType: !981, size: 32, align: 32, offset: 160)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "bound_right", scope: !1042, file: !961, line: 169, baseType: !981, size: 32, align: 32, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "bound_bottom", scope: !1042, file: !961, line: 170, baseType: !981, size: 32, align: 32, offset: 224)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !1042, file: !961, line: 182, baseType: !981, size: 32, align: 32, offset: 256)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVContentLightMetadata", file: !1019, line: 108, baseType: !1055)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVContentLightMetadata", file: !1019, line: 98, size: 64, align: 32, elements: !1056)
!1056 = !{!1057, !1058}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "MaxCLL", scope: !1055, file: !1019, line: 102, baseType: !982, size: 32, align: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFALL", scope: !1055, file: !1019, line: 107, baseType: !982, size: 32, align: 32, offset: 32)
!1059 = !{i32 2, !"Dwarf Version", i32 4}
!1060 = !{i32 2, !"Debug Info Version", i32 3}
!1061 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1062 = distinct !DISubprogram(name: "av_hex_dump", scope: !1063, file: !1063, line: 74, type: !1064, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1129)
!1063 = !DIFile(filename: "libavformat/dump.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1064 = !DISubroutineType(types: !1065)
!1065 = !{null, !1066, !1125, !971}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1068, line: 48, baseType: !1069)
!1068 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1070, line: 241, size: 1728, align: 64, elements: !1071)
!1070 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1071 = !{!1072, !1073, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1094, !1095, !1096, !1097, !1100, !1102, !1104, !1108, !1111, !1113, !1114, !1115, !1116, !1117, !1120, !1121}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1069, file: !1070, line: 242, baseType: !971, size: 32, align: 32)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1069, file: !1070, line: 247, baseType: !1074, size: 64, align: 64, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1069, file: !1070, line: 248, baseType: !1074, size: 64, align: 64, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1069, file: !1070, line: 249, baseType: !1074, size: 64, align: 64, offset: 192)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1069, file: !1070, line: 250, baseType: !1074, size: 64, align: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1069, file: !1070, line: 251, baseType: !1074, size: 64, align: 64, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1069, file: !1070, line: 252, baseType: !1074, size: 64, align: 64, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1069, file: !1070, line: 253, baseType: !1074, size: 64, align: 64, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1069, file: !1070, line: 254, baseType: !1074, size: 64, align: 64, offset: 512)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1069, file: !1070, line: 256, baseType: !1074, size: 64, align: 64, offset: 576)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1069, file: !1070, line: 257, baseType: !1074, size: 64, align: 64, offset: 640)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1069, file: !1070, line: 258, baseType: !1074, size: 64, align: 64, offset: 704)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1069, file: !1070, line: 260, baseType: !1087, size: 64, align: 64, offset: 768)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1070, line: 156, size: 192, align: 64, elements: !1089)
!1089 = !{!1090, !1091, !1093}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1088, file: !1070, line: 157, baseType: !1087, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1088, file: !1070, line: 158, baseType: !1092, size: 64, align: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1088, file: !1070, line: 162, baseType: !971, size: 32, align: 32, offset: 128)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1069, file: !1070, line: 262, baseType: !1092, size: 64, align: 64, offset: 832)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1069, file: !1070, line: 264, baseType: !971, size: 32, align: 32, offset: 896)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1069, file: !1070, line: 268, baseType: !971, size: 32, align: 32, offset: 928)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1069, file: !1070, line: 270, baseType: !1098, size: 64, align: 64, offset: 960)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !1099, line: 131, baseType: !970)
!1099 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1069, file: !1070, line: 274, baseType: !1101, size: 16, align: 16, offset: 1024)
!1101 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1069, file: !1070, line: 275, baseType: !1103, size: 8, align: 8, offset: 1040)
!1103 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1069, file: !1070, line: 276, baseType: !1105, size: 8, align: 8, offset: 1048)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1075, size: 8, align: 8, elements: !1106)
!1106 = !{!1107}
!1107 = !DISubrange(count: 1)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1069, file: !1070, line: 280, baseType: !1109, size: 64, align: 64, offset: 1088)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1070, line: 150, baseType: null)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1069, file: !1070, line: 289, baseType: !1112, size: 64, align: 64, offset: 1152)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !1099, line: 132, baseType: !970)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1069, file: !1070, line: 297, baseType: !967, size: 64, align: 64, offset: 1216)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1069, file: !1070, line: 298, baseType: !967, size: 64, align: 64, offset: 1280)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1069, file: !1070, line: 299, baseType: !967, size: 64, align: 64, offset: 1344)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1069, file: !1070, line: 300, baseType: !967, size: 64, align: 64, offset: 1408)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1069, file: !1070, line: 302, baseType: !1118, size: 64, align: 64, offset: 1472)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1119, line: 216, baseType: !989)
!1119 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1069, file: !1070, line: 303, baseType: !971, size: 32, align: 32, offset: 1536)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1069, file: !1070, line: 305, baseType: !1122, size: 160, align: 8, offset: 1568)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1075, size: 160, align: 8, elements: !1123)
!1123 = !{!1124}
!1124 = !DISubrange(count: 20)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1127)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !969, line: 48, baseType: !1128)
!1128 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1129 = !{}
!1130 = !DILocalVariable(name: "f", arg: 1, scope: !1062, file: !1063, line: 74, type: !1066)
!1131 = !DIExpression()
!1132 = !DILocation(line: 74, column: 24, scope: !1062)
!1133 = !DILocalVariable(name: "buf", arg: 2, scope: !1062, file: !1063, line: 74, type: !1125)
!1134 = !DILocation(line: 74, column: 42, scope: !1062)
!1135 = !DILocalVariable(name: "size", arg: 3, scope: !1062, file: !1063, line: 74, type: !971)
!1136 = !DILocation(line: 74, column: 51, scope: !1062)
!1137 = !DILocation(line: 76, column: 28, scope: !1062)
!1138 = !DILocation(line: 76, column: 34, scope: !1062)
!1139 = !DILocation(line: 76, column: 39, scope: !1062)
!1140 = !DILocation(line: 76, column: 5, scope: !1062)
!1141 = !DILocation(line: 77, column: 1, scope: !1062)
!1142 = distinct !DISubprogram(name: "hex_dump_internal", scope: !1063, file: !1063, line: 47, type: !1143, isLocal: true, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1129)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{null, !967, !1066, !971, !1125, !971}
!1145 = !DILocalVariable(name: "avcl", arg: 1, scope: !1142, file: !1063, line: 47, type: !967)
!1146 = !DILocation(line: 47, column: 37, scope: !1142)
!1147 = !DILocalVariable(name: "f", arg: 2, scope: !1142, file: !1063, line: 47, type: !1066)
!1148 = !DILocation(line: 47, column: 49, scope: !1142)
!1149 = !DILocalVariable(name: "level", arg: 3, scope: !1142, file: !1063, line: 47, type: !971)
!1150 = !DILocation(line: 47, column: 56, scope: !1142)
!1151 = !DILocalVariable(name: "buf", arg: 4, scope: !1142, file: !1063, line: 48, type: !1125)
!1152 = !DILocation(line: 48, column: 46, scope: !1142)
!1153 = !DILocalVariable(name: "size", arg: 5, scope: !1142, file: !1063, line: 48, type: !971)
!1154 = !DILocation(line: 48, column: 55, scope: !1142)
!1155 = !DILocalVariable(name: "len", scope: !1142, file: !1063, line: 50, type: !971)
!1156 = !DILocation(line: 50, column: 9, scope: !1142)
!1157 = !DILocalVariable(name: "i", scope: !1142, file: !1063, line: 50, type: !971)
!1158 = !DILocation(line: 50, column: 14, scope: !1142)
!1159 = !DILocalVariable(name: "j", scope: !1142, file: !1063, line: 50, type: !971)
!1160 = !DILocation(line: 50, column: 17, scope: !1142)
!1161 = !DILocalVariable(name: "c", scope: !1142, file: !1063, line: 50, type: !971)
!1162 = !DILocation(line: 50, column: 20, scope: !1142)
!1163 = !DILocation(line: 52, column: 12, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1142, file: !1063, line: 52, column: 5)
!1165 = !DILocation(line: 52, column: 10, scope: !1164)
!1166 = !DILocation(line: 52, column: 17, scope: !1167)
!1167 = !DILexicalBlockFile(scope: !1168, file: !1063, discriminator: 1)
!1168 = distinct !DILexicalBlock(scope: !1164, file: !1063, line: 52, column: 5)
!1169 = !DILocation(line: 52, column: 21, scope: !1167)
!1170 = !DILocation(line: 52, column: 19, scope: !1167)
!1171 = !DILocation(line: 52, column: 5, scope: !1167)
!1172 = !DILocation(line: 53, column: 15, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1168, file: !1063, line: 52, column: 36)
!1174 = !DILocation(line: 53, column: 22, scope: !1173)
!1175 = !DILocation(line: 53, column: 20, scope: !1173)
!1176 = !DILocation(line: 53, column: 13, scope: !1173)
!1177 = !DILocation(line: 54, column: 13, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1173, file: !1063, line: 54, column: 13)
!1179 = !DILocation(line: 54, column: 17, scope: !1178)
!1180 = !DILocation(line: 54, column: 13, scope: !1173)
!1181 = !DILocation(line: 55, column: 17, scope: !1178)
!1182 = !DILocation(line: 55, column: 13, scope: !1178)
!1183 = !DILocation(line: 56, column: 9, scope: !1173)
!1184 = distinct !{!1184, !1183}
!1185 = !DILocation(line: 56, column: 19, scope: !1186)
!1186 = !DILexicalBlockFile(scope: !1187, file: !1063, discriminator: 1)
!1187 = distinct !DILexicalBlock(scope: !1188, file: !1063, line: 56, column: 18)
!1188 = distinct !DILexicalBlock(scope: !1173, file: !1063, line: 56, column: 12)
!1189 = !DILocation(line: 56, column: 18, scope: !1186)
!1190 = !DILocation(line: 56, column: 29, scope: !1191)
!1191 = !DILexicalBlockFile(scope: !1187, file: !1063, discriminator: 2)
!1192 = !DILocation(line: 56, column: 35, scope: !1191)
!1193 = !DILocation(line: 56, column: 51, scope: !1191)
!1194 = !DILocation(line: 56, column: 22, scope: !1191)
!1195 = !DILocation(line: 56, column: 68, scope: !1196)
!1196 = !DILexicalBlockFile(scope: !1187, file: !1063, discriminator: 3)
!1197 = !DILocation(line: 56, column: 80, scope: !1196)
!1198 = !DILocation(line: 56, column: 60, scope: !1196)
!1199 = !DILocation(line: 56, column: 84, scope: !1200)
!1200 = !DILexicalBlockFile(scope: !1188, file: !1063, discriminator: 4)
!1201 = !DILocation(line: 57, column: 16, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1173, file: !1063, line: 57, column: 9)
!1203 = !DILocation(line: 57, column: 14, scope: !1202)
!1204 = !DILocation(line: 57, column: 21, scope: !1205)
!1205 = !DILexicalBlockFile(scope: !1206, file: !1063, discriminator: 1)
!1206 = distinct !DILexicalBlock(scope: !1202, file: !1063, line: 57, column: 9)
!1207 = !DILocation(line: 57, column: 23, scope: !1205)
!1208 = !DILocation(line: 57, column: 9, scope: !1205)
!1209 = !DILocation(line: 58, column: 17, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1211, file: !1063, line: 58, column: 17)
!1211 = distinct !DILexicalBlock(scope: !1206, file: !1063, line: 57, column: 34)
!1212 = !DILocation(line: 58, column: 21, scope: !1210)
!1213 = !DILocation(line: 58, column: 19, scope: !1210)
!1214 = !DILocation(line: 58, column: 17, scope: !1211)
!1215 = !DILocation(line: 59, column: 17, scope: !1210)
!1216 = distinct !{!1216, !1215}
!1217 = !DILocation(line: 59, column: 27, scope: !1218)
!1218 = !DILexicalBlockFile(scope: !1219, file: !1063, discriminator: 1)
!1219 = distinct !DILexicalBlock(scope: !1220, file: !1063, line: 59, column: 26)
!1220 = distinct !DILexicalBlock(scope: !1210, file: !1063, line: 59, column: 20)
!1221 = !DILocation(line: 59, column: 26, scope: !1218)
!1222 = !DILocation(line: 59, column: 37, scope: !1223)
!1223 = !DILexicalBlockFile(scope: !1219, file: !1063, discriminator: 2)
!1224 = !DILocation(line: 59, column: 43, scope: !1223)
!1225 = !DILocation(line: 59, column: 63, scope: !1223)
!1226 = !DILocation(line: 59, column: 67, scope: !1223)
!1227 = !DILocation(line: 59, column: 65, scope: !1223)
!1228 = !DILocation(line: 59, column: 59, scope: !1223)
!1229 = !DILocation(line: 59, column: 30, scope: !1223)
!1230 = !DILocation(line: 59, column: 85, scope: !1231)
!1231 = !DILexicalBlockFile(scope: !1219, file: !1063, discriminator: 3)
!1232 = !DILocation(line: 59, column: 101, scope: !1231)
!1233 = !DILocation(line: 59, column: 105, scope: !1231)
!1234 = !DILocation(line: 59, column: 103, scope: !1231)
!1235 = !DILocation(line: 59, column: 97, scope: !1231)
!1236 = !DILocation(line: 59, column: 77, scope: !1231)
!1237 = !DILocation(line: 59, column: 110, scope: !1238)
!1238 = !DILexicalBlockFile(scope: !1220, file: !1063, discriminator: 4)
!1239 = !DILocation(line: 59, column: 110, scope: !1240)
!1240 = !DILexicalBlockFile(scope: !1220, file: !1063, discriminator: 5)
!1241 = !DILocation(line: 61, column: 17, scope: !1210)
!1242 = distinct !{!1242, !1241}
!1243 = !DILocation(line: 61, column: 27, scope: !1244)
!1244 = !DILexicalBlockFile(scope: !1245, file: !1063, discriminator: 1)
!1245 = distinct !DILexicalBlock(scope: !1246, file: !1063, line: 61, column: 26)
!1246 = distinct !DILexicalBlock(scope: !1210, file: !1063, line: 61, column: 20)
!1247 = !DILocation(line: 61, column: 26, scope: !1244)
!1248 = !DILocation(line: 61, column: 37, scope: !1249)
!1249 = !DILexicalBlockFile(scope: !1245, file: !1063, discriminator: 2)
!1250 = !DILocation(line: 61, column: 43, scope: !1249)
!1251 = !DILocation(line: 61, column: 30, scope: !1249)
!1252 = !DILocation(line: 61, column: 71, scope: !1253)
!1253 = !DILexicalBlockFile(scope: !1245, file: !1063, discriminator: 3)
!1254 = !DILocation(line: 61, column: 63, scope: !1253)
!1255 = !DILocation(line: 61, column: 82, scope: !1256)
!1256 = !DILexicalBlockFile(scope: !1246, file: !1063, discriminator: 4)
!1257 = !DILocation(line: 62, column: 9, scope: !1211)
!1258 = !DILocation(line: 57, column: 30, scope: !1259)
!1259 = !DILexicalBlockFile(scope: !1206, file: !1063, discriminator: 2)
!1260 = !DILocation(line: 57, column: 9, scope: !1259)
!1261 = distinct !{!1261, !1262}
!1262 = !DILocation(line: 57, column: 9, scope: !1173)
!1263 = !DILocation(line: 63, column: 9, scope: !1173)
!1264 = distinct !{!1264, !1263}
!1265 = !DILocation(line: 63, column: 19, scope: !1266)
!1266 = !DILexicalBlockFile(scope: !1267, file: !1063, discriminator: 1)
!1267 = distinct !DILexicalBlock(scope: !1268, file: !1063, line: 63, column: 18)
!1268 = distinct !DILexicalBlock(scope: !1173, file: !1063, line: 63, column: 12)
!1269 = !DILocation(line: 63, column: 18, scope: !1266)
!1270 = !DILocation(line: 63, column: 29, scope: !1271)
!1271 = !DILexicalBlockFile(scope: !1267, file: !1063, discriminator: 2)
!1272 = !DILocation(line: 63, column: 35, scope: !1271)
!1273 = !DILocation(line: 63, column: 22, scope: !1271)
!1274 = !DILocation(line: 63, column: 61, scope: !1275)
!1275 = !DILexicalBlockFile(scope: !1267, file: !1063, discriminator: 3)
!1276 = !DILocation(line: 63, column: 53, scope: !1275)
!1277 = !DILocation(line: 63, column: 70, scope: !1278)
!1278 = !DILexicalBlockFile(scope: !1268, file: !1063, discriminator: 4)
!1279 = !DILocation(line: 64, column: 16, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1173, file: !1063, line: 64, column: 9)
!1281 = !DILocation(line: 64, column: 14, scope: !1280)
!1282 = !DILocation(line: 64, column: 21, scope: !1283)
!1283 = !DILexicalBlockFile(scope: !1284, file: !1063, discriminator: 1)
!1284 = distinct !DILexicalBlock(scope: !1280, file: !1063, line: 64, column: 9)
!1285 = !DILocation(line: 64, column: 25, scope: !1283)
!1286 = !DILocation(line: 64, column: 23, scope: !1283)
!1287 = !DILocation(line: 64, column: 9, scope: !1283)
!1288 = !DILocation(line: 65, column: 21, scope: !1289)
!1289 = distinct !DILexicalBlock(scope: !1284, file: !1063, line: 64, column: 35)
!1290 = !DILocation(line: 65, column: 25, scope: !1289)
!1291 = !DILocation(line: 65, column: 23, scope: !1289)
!1292 = !DILocation(line: 65, column: 17, scope: !1289)
!1293 = !DILocation(line: 65, column: 15, scope: !1289)
!1294 = !DILocation(line: 66, column: 17, scope: !1295)
!1295 = distinct !DILexicalBlock(scope: !1289, file: !1063, line: 66, column: 17)
!1296 = !DILocation(line: 66, column: 19, scope: !1295)
!1297 = !DILocation(line: 66, column: 25, scope: !1295)
!1298 = !DILocation(line: 66, column: 28, scope: !1299)
!1299 = !DILexicalBlockFile(scope: !1295, file: !1063, discriminator: 1)
!1300 = !DILocation(line: 66, column: 30, scope: !1299)
!1301 = !DILocation(line: 66, column: 17, scope: !1299)
!1302 = !DILocation(line: 67, column: 19, scope: !1295)
!1303 = !DILocation(line: 67, column: 17, scope: !1295)
!1304 = !DILocation(line: 68, column: 13, scope: !1289)
!1305 = distinct !{!1305, !1304}
!1306 = !DILocation(line: 68, column: 23, scope: !1307)
!1307 = !DILexicalBlockFile(scope: !1308, file: !1063, discriminator: 1)
!1308 = distinct !DILexicalBlock(scope: !1309, file: !1063, line: 68, column: 22)
!1309 = distinct !DILexicalBlock(scope: !1289, file: !1063, line: 68, column: 16)
!1310 = !DILocation(line: 68, column: 22, scope: !1307)
!1311 = !DILocation(line: 68, column: 33, scope: !1312)
!1312 = !DILexicalBlockFile(scope: !1308, file: !1063, discriminator: 2)
!1313 = !DILocation(line: 68, column: 39, scope: !1312)
!1314 = !DILocation(line: 68, column: 52, scope: !1312)
!1315 = !DILocation(line: 68, column: 26, scope: !1312)
!1316 = !DILocation(line: 68, column: 69, scope: !1317)
!1317 = !DILexicalBlockFile(scope: !1308, file: !1063, discriminator: 3)
!1318 = !DILocation(line: 68, column: 78, scope: !1317)
!1319 = !DILocation(line: 68, column: 61, scope: !1317)
!1320 = !DILocation(line: 68, column: 82, scope: !1321)
!1321 = !DILexicalBlockFile(scope: !1309, file: !1063, discriminator: 4)
!1322 = !DILocation(line: 69, column: 9, scope: !1289)
!1323 = !DILocation(line: 64, column: 31, scope: !1324)
!1324 = !DILexicalBlockFile(scope: !1284, file: !1063, discriminator: 2)
!1325 = !DILocation(line: 64, column: 9, scope: !1324)
!1326 = distinct !{!1326, !1327}
!1327 = !DILocation(line: 64, column: 9, scope: !1173)
!1328 = !DILocation(line: 70, column: 9, scope: !1173)
!1329 = distinct !{!1329, !1328}
!1330 = !DILocation(line: 70, column: 19, scope: !1331)
!1331 = !DILexicalBlockFile(scope: !1332, file: !1063, discriminator: 1)
!1332 = distinct !DILexicalBlock(scope: !1333, file: !1063, line: 70, column: 18)
!1333 = distinct !DILexicalBlock(scope: !1173, file: !1063, line: 70, column: 12)
!1334 = !DILocation(line: 70, column: 18, scope: !1331)
!1335 = !DILocation(line: 70, column: 29, scope: !1336)
!1336 = !DILexicalBlockFile(scope: !1332, file: !1063, discriminator: 2)
!1337 = !DILocation(line: 70, column: 35, scope: !1336)
!1338 = !DILocation(line: 70, column: 22, scope: !1336)
!1339 = !DILocation(line: 70, column: 62, scope: !1340)
!1340 = !DILexicalBlockFile(scope: !1332, file: !1063, discriminator: 3)
!1341 = !DILocation(line: 70, column: 54, scope: !1340)
!1342 = !DILocation(line: 70, column: 72, scope: !1343)
!1343 = !DILexicalBlockFile(scope: !1333, file: !1063, discriminator: 4)
!1344 = !DILocation(line: 71, column: 5, scope: !1173)
!1345 = !DILocation(line: 52, column: 29, scope: !1346)
!1346 = !DILexicalBlockFile(scope: !1168, file: !1063, discriminator: 2)
!1347 = !DILocation(line: 52, column: 5, scope: !1346)
!1348 = distinct !{!1348, !1349}
!1349 = !DILocation(line: 52, column: 5, scope: !1142)
!1350 = !DILocation(line: 72, column: 1, scope: !1142)
!1351 = distinct !DISubprogram(name: "av_hex_dump_log", scope: !1063, file: !1063, line: 79, type: !1352, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1129)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{null, !967, !971, !1125, !971}
!1354 = !DILocalVariable(name: "avcl", arg: 1, scope: !1351, file: !1063, line: 79, type: !967)
!1355 = !DILocation(line: 79, column: 28, scope: !1351)
!1356 = !DILocalVariable(name: "level", arg: 2, scope: !1351, file: !1063, line: 79, type: !971)
!1357 = !DILocation(line: 79, column: 38, scope: !1351)
!1358 = !DILocalVariable(name: "buf", arg: 3, scope: !1351, file: !1063, line: 79, type: !1125)
!1359 = !DILocation(line: 79, column: 60, scope: !1351)
!1360 = !DILocalVariable(name: "size", arg: 4, scope: !1351, file: !1063, line: 79, type: !971)
!1361 = !DILocation(line: 79, column: 69, scope: !1351)
!1362 = !DILocation(line: 81, column: 23, scope: !1351)
!1363 = !DILocation(line: 81, column: 34, scope: !1351)
!1364 = !DILocation(line: 81, column: 41, scope: !1351)
!1365 = !DILocation(line: 81, column: 46, scope: !1351)
!1366 = !DILocation(line: 81, column: 5, scope: !1351)
!1367 = !DILocation(line: 82, column: 1, scope: !1351)
!1368 = distinct !DISubprogram(name: "av_pkt_dump2", scope: !1063, file: !1063, line: 108, type: !1369, isLocal: false, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1129)
!1369 = !DISubroutineType(types: !1370)
!1370 = !{null, !1066, !1371, !971, !1407}
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1373)
!1373 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1374)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1375)
!1375 = !{!1376, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1403, !1404, !1405, !1406}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1374, file: !4, line: 1451, baseType: !1377, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1379, line: 94, baseType: !1380)
!1379 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1379, line: 81, size: 192, align: 64, elements: !1381)
!1381 = !{!1382, !1386, !1388}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1380, file: !1379, line: 82, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1379, line: 73, baseType: !1385)
!1385 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1379, line: 73, flags: DIFlagFwdDecl)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1380, file: !1379, line: 89, baseType: !1387, size: 64, align: 64, offset: 64)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1380, file: !1379, line: 93, baseType: !971, size: 32, align: 32, offset: 128)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1374, file: !4, line: 1461, baseType: !968, size: 64, align: 64, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1374, file: !4, line: 1467, baseType: !968, size: 64, align: 64, offset: 128)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1374, file: !4, line: 1468, baseType: !1387, size: 64, align: 64, offset: 192)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1374, file: !4, line: 1469, baseType: !971, size: 32, align: 32, offset: 256)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1374, file: !4, line: 1470, baseType: !971, size: 32, align: 32, offset: 288)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1374, file: !4, line: 1474, baseType: !971, size: 32, align: 32, offset: 320)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1374, file: !4, line: 1479, baseType: !1396, size: 64, align: 64, offset: 384)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1398)
!1398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1399)
!1399 = !{!1400, !1401, !1402}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1398, file: !4, line: 1412, baseType: !1387, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1398, file: !4, line: 1413, baseType: !971, size: 32, align: 32, offset: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1398, file: !4, line: 1414, baseType: !3, size: 32, align: 32, offset: 96)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1374, file: !4, line: 1480, baseType: !971, size: 32, align: 32, offset: 448)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1374, file: !4, line: 1486, baseType: !968, size: 64, align: 64, offset: 512)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1374, file: !4, line: 1488, baseType: !968, size: 64, align: 64, offset: 576)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1374, file: !4, line: 1497, baseType: !968, size: 64, align: 64, offset: 640)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1409)
!1409 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !910, line: 1223, baseType: !1410)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !910, line: 865, size: 6144, align: 64, elements: !1411)
!1411 = !{!1412, !1413, !1414, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2037, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2136, !2142, !2151, !2155, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2187, !2188, !2189, !2190, !2191, !2192}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1410, file: !910, line: 866, baseType: !971, size: 32, align: 32)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1410, file: !910, line: 872, baseType: !971, size: 32, align: 32, offset: 32)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1410, file: !910, line: 878, baseType: !1415, size: 64, align: 64, offset: 64)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1417)
!1417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1418)
!1418 = !{!1419, !1493, !1494, !1495, !1713, !1714, !1715, !1716, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1742, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1925, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1417, file: !4, line: 1561, baseType: !1420, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1422)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !57, line: 143, baseType: !1423)
!1423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !57, line: 67, size: 640, align: 64, elements: !1424)
!1424 = !{!1425, !1428, !1432, !1452, !1453, !1454, !1455, !1459, !1465, !1467, !1471}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1423, file: !57, line: 72, baseType: !1426, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1075)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1423, file: !57, line: 78, baseType: !1429, size: 64, align: 64, offset: 64)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{!1426, !967}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1423, file: !57, line: 85, baseType: !1433, size: 64, align: 64, offset: 128)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1435)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !35, line: 246, size: 512, align: 64, elements: !1436)
!1436 = !{!1437, !1438, !1439, !1440, !1441, !1448, !1449, !1450, !1451}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1435, file: !35, line: 247, baseType: !1426, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1435, file: !35, line: 253, baseType: !1426, size: 64, align: 64, offset: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1435, file: !35, line: 259, baseType: !971, size: 32, align: 32, offset: 128)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1435, file: !35, line: 260, baseType: !34, size: 32, align: 32, offset: 160)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1435, file: !35, line: 271, baseType: !1442, size: 64, align: 64, offset: 192)
!1442 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1435, file: !35, line: 265, size: 64, align: 64, elements: !1443)
!1443 = !{!1444, !1445, !1446, !1447}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1442, file: !35, line: 266, baseType: !968, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1442, file: !35, line: 267, baseType: !972, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1442, file: !35, line: 268, baseType: !1426, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1442, file: !35, line: 270, baseType: !1024, size: 64, align: 32)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1435, file: !35, line: 272, baseType: !972, size: 64, align: 64, offset: 256)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1435, file: !35, line: 273, baseType: !972, size: 64, align: 64, offset: 320)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1435, file: !35, line: 275, baseType: !971, size: 32, align: 32, offset: 384)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1435, file: !35, line: 300, baseType: !1426, size: 64, align: 64, offset: 448)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1423, file: !57, line: 93, baseType: !971, size: 32, align: 32, offset: 192)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1423, file: !57, line: 99, baseType: !971, size: 32, align: 32, offset: 224)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1423, file: !57, line: 108, baseType: !971, size: 32, align: 32, offset: 256)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1423, file: !57, line: 113, baseType: !1456, size: 64, align: 64, offset: 320)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DISubroutineType(types: !1458)
!1458 = !{!967, !967, !967}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1423, file: !57, line: 123, baseType: !1460, size: 64, align: 64, offset: 384)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DISubroutineType(types: !1462)
!1462 = !{!1463, !1463}
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1423)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1423, file: !57, line: 130, baseType: !1466, size: 32, align: 32, offset: 448)
!1466 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !57, line: 48, baseType: !56)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1423, file: !57, line: 136, baseType: !1468, size: 64, align: 64, offset: 512)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!1466, !967}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1423, file: !57, line: 142, baseType: !1472, size: 64, align: 64, offset: 576)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{!971, !1475, !967, !1426, !971}
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !35, line: 329, size: 128, align: 64, elements: !1478)
!1478 = !{!1479, !1491, !1492}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1477, file: !35, line: 360, baseType: !1480, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !35, line: 324, baseType: !1483)
!1483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !35, line: 306, size: 384, align: 64, elements: !1484)
!1484 = !{!1485, !1486, !1487, !1488, !1489, !1490}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1483, file: !35, line: 307, baseType: !1426, size: 64, align: 64)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1483, file: !35, line: 313, baseType: !972, size: 64, align: 64, offset: 64)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1483, file: !35, line: 313, baseType: !972, size: 64, align: 64, offset: 128)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1483, file: !35, line: 318, baseType: !972, size: 64, align: 64, offset: 192)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1483, file: !35, line: 318, baseType: !972, size: 64, align: 64, offset: 256)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1483, file: !35, line: 323, baseType: !971, size: 32, align: 32, offset: 320)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1477, file: !35, line: 364, baseType: !971, size: 32, align: 32, offset: 64)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1477, file: !35, line: 368, baseType: !971, size: 32, align: 32, offset: 96)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1417, file: !4, line: 1562, baseType: !971, size: 32, align: 32, offset: 64)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1417, file: !4, line: 1564, baseType: !77, size: 32, align: 32, offset: 96)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1417, file: !4, line: 1565, baseType: !1496, size: 64, align: 64, offset: 128)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1498)
!1498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1499)
!1499 = !{!1500, !1501, !1502, !1503, !1504, !1505, !1508, !1511, !1514, !1517, !1520, !1521, !1522, !1530, !1531, !1532, !1534, !1538, !1544, !1549, !1553, !1554, !1599, !1684, !1688, !1689, !1693, !1697, !1702, !1706, !1707, !1708}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1498, file: !4, line: 3475, baseType: !1426, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1498, file: !4, line: 3480, baseType: !1426, size: 64, align: 64, offset: 64)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1498, file: !4, line: 3481, baseType: !77, size: 32, align: 32, offset: 128)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1498, file: !4, line: 3482, baseType: !87, size: 32, align: 32, offset: 160)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1498, file: !4, line: 3487, baseType: !971, size: 32, align: 32, offset: 192)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1498, file: !4, line: 3488, baseType: !1506, size: 64, align: 64, offset: 256)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1024)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1498, file: !4, line: 3489, baseType: !1509, size: 64, align: 64, offset: 320)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !546)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1498, file: !4, line: 3490, baseType: !1512, size: 64, align: 64, offset: 384)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1498, file: !4, line: 3491, baseType: !1515, size: 64, align: 64, offset: 448)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !746)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1498, file: !4, line: 3492, baseType: !1518, size: 64, align: 64, offset: 512)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1498, file: !4, line: 3493, baseType: !1127, size: 8, align: 8, offset: 576)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1498, file: !4, line: 3494, baseType: !1420, size: 64, align: 64, offset: 640)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1498, file: !4, line: 3495, baseType: !1523, size: 64, align: 64, offset: 704)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1525)
!1525 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1526)
!1526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1527)
!1527 = !{!1528, !1529}
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1526, file: !4, line: 3402, baseType: !971, size: 32, align: 32)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1526, file: !4, line: 3403, baseType: !1426, size: 64, align: 64, offset: 64)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1498, file: !4, line: 3507, baseType: !1426, size: 64, align: 64, offset: 768)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1498, file: !4, line: 3516, baseType: !971, size: 32, align: 32, offset: 832)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1498, file: !4, line: 3517, baseType: !1533, size: 64, align: 64, offset: 896)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1498, file: !4, line: 3527, baseType: !1535, size: 64, align: 64, offset: 960)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!971, !1415}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1498, file: !4, line: 3535, baseType: !1539, size: 64, align: 64, offset: 1024)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DISubroutineType(types: !1541)
!1541 = !{!971, !1415, !1542}
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1416)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1498, file: !4, line: 3541, baseType: !1545, size: 64, align: 64, offset: 1088)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1547)
!1547 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1548)
!1548 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1498, file: !4, line: 3549, baseType: !1550, size: 64, align: 64, offset: 1152)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{null, !1533}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1498, file: !4, line: 3551, baseType: !1535, size: 64, align: 64, offset: 1216)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1498, file: !4, line: 3552, baseType: !1555, size: 64, align: 64, offset: 1280)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DISubroutineType(types: !1557)
!1557 = !{!971, !1415, !1387, !971, !1558}
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1560)
!1560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1561)
!1561 = !{!1562, !1564, !1565, !1566, !1567, !1598}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1560, file: !4, line: 3921, baseType: !1563, size: 16, align: 16)
!1563 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !969, line: 49, baseType: !1101)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1560, file: !4, line: 3922, baseType: !981, size: 32, align: 32, offset: 32)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1560, file: !4, line: 3923, baseType: !981, size: 32, align: 32, offset: 64)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1560, file: !4, line: 3924, baseType: !982, size: 32, align: 32, offset: 96)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1560, file: !4, line: 3925, baseType: !1568, size: 64, align: 64, offset: 128)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1571)
!1571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1572)
!1572 = !{!1573, !1574, !1575, !1576, !1577, !1578, !1588, !1592, !1594, !1595, !1596, !1597}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1571, file: !4, line: 3886, baseType: !971, size: 32, align: 32)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1571, file: !4, line: 3887, baseType: !971, size: 32, align: 32, offset: 32)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1571, file: !4, line: 3888, baseType: !971, size: 32, align: 32, offset: 64)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1571, file: !4, line: 3889, baseType: !971, size: 32, align: 32, offset: 96)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1571, file: !4, line: 3890, baseType: !971, size: 32, align: 32, offset: 128)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1571, file: !4, line: 3897, baseType: !1579, size: 768, align: 64, offset: 192)
!1579 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1580)
!1580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1581)
!1581 = !{!1582, !1586}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1580, file: !4, line: 3855, baseType: !1583, size: 512, align: 64)
!1583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1387, size: 512, align: 64, elements: !1584)
!1584 = !{!1585}
!1585 = !DISubrange(count: 8)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1580, file: !4, line: 3857, baseType: !1587, size: 256, align: 32, offset: 512)
!1587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 256, align: 32, elements: !1584)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1571, file: !4, line: 3903, baseType: !1589, size: 256, align: 64, offset: 960)
!1589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1387, size: 256, align: 64, elements: !1590)
!1590 = !{!1591}
!1591 = !DISubrange(count: 4)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1571, file: !4, line: 3904, baseType: !1593, size: 128, align: 32, offset: 1216)
!1593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 128, align: 32, elements: !1590)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1571, file: !4, line: 3906, baseType: !763, size: 32, align: 32, offset: 1344)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1571, file: !4, line: 3908, baseType: !1074, size: 64, align: 64, offset: 1408)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1571, file: !4, line: 3915, baseType: !1074, size: 64, align: 64, offset: 1472)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1571, file: !4, line: 3917, baseType: !971, size: 32, align: 32, offset: 1536)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1560, file: !4, line: 3926, baseType: !968, size: 64, align: 64, offset: 192)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1498, file: !4, line: 3564, baseType: !1600, size: 64, align: 64, offset: 1344)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DISubroutineType(types: !1602)
!1602 = !{!971, !1415, !1603, !1604, !1683}
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1606)
!1606 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1607)
!1607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1608)
!1608 = !{!1609, !1610, !1611, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1638, !1640, !1641, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1607, file: !780, line: 282, baseType: !1583, size: 512, align: 64)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1607, file: !780, line: 299, baseType: !1587, size: 256, align: 32, offset: 512)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1607, file: !780, line: 315, baseType: !1612, size: 64, align: 64, offset: 768)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1607, file: !780, line: 326, baseType: !971, size: 32, align: 32, offset: 832)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1607, file: !780, line: 326, baseType: !971, size: 32, align: 32, offset: 864)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1607, file: !780, line: 334, baseType: !971, size: 32, align: 32, offset: 896)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1607, file: !780, line: 341, baseType: !971, size: 32, align: 32, offset: 928)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1607, file: !780, line: 346, baseType: !971, size: 32, align: 32, offset: 960)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1607, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1607, file: !780, line: 356, baseType: !1024, size: 64, align: 32, offset: 1024)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1607, file: !780, line: 361, baseType: !968, size: 64, align: 64, offset: 1088)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1607, file: !780, line: 369, baseType: !968, size: 64, align: 64, offset: 1152)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1607, file: !780, line: 377, baseType: !968, size: 64, align: 64, offset: 1216)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1607, file: !780, line: 382, baseType: !971, size: 32, align: 32, offset: 1280)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1607, file: !780, line: 386, baseType: !971, size: 32, align: 32, offset: 1312)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1607, file: !780, line: 391, baseType: !971, size: 32, align: 32, offset: 1344)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1607, file: !780, line: 396, baseType: !967, size: 64, align: 64, offset: 1408)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1607, file: !780, line: 403, baseType: !1628, size: 512, align: 64, offset: 1472)
!1628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !988, size: 512, align: 64, elements: !1584)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1607, file: !780, line: 410, baseType: !971, size: 32, align: 32, offset: 1984)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1607, file: !780, line: 415, baseType: !971, size: 32, align: 32, offset: 2016)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1607, file: !780, line: 420, baseType: !971, size: 32, align: 32, offset: 2048)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1607, file: !780, line: 425, baseType: !971, size: 32, align: 32, offset: 2080)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1607, file: !780, line: 435, baseType: !968, size: 64, align: 64, offset: 2112)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1607, file: !780, line: 440, baseType: !971, size: 32, align: 32, offset: 2176)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1607, file: !780, line: 445, baseType: !988, size: 64, align: 64, offset: 2240)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1607, file: !780, line: 459, baseType: !1637, size: 512, align: 64, offset: 2304)
!1637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1377, size: 512, align: 64, elements: !1584)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1607, file: !780, line: 473, baseType: !1639, size: 64, align: 64, offset: 2816)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1607, file: !780, line: 477, baseType: !971, size: 32, align: 32, offset: 2880)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1607, file: !780, line: 479, baseType: !1642, size: 64, align: 64, offset: 2944)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64, align: 64)
!1644 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1645)
!1645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1646)
!1646 = !{!1647, !1648, !1649, !1650, !1655}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1645, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1645, file: !780, line: 203, baseType: !1387, size: 64, align: 64, offset: 64)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1645, file: !780, line: 204, baseType: !971, size: 32, align: 32, offset: 128)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1645, file: !780, line: 205, baseType: !1651, size: 64, align: 64, offset: 192)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1653, line: 86, baseType: !1654)
!1653 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1654 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1653, line: 86, flags: DIFlagFwdDecl)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1645, file: !780, line: 206, baseType: !1377, size: 64, align: 64, offset: 256)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1607, file: !780, line: 480, baseType: !971, size: 32, align: 32, offset: 3008)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1607, file: !780, line: 505, baseType: !971, size: 32, align: 32, offset: 3040)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1607, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1607, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1607, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1607, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1607, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1607, file: !780, line: 532, baseType: !968, size: 64, align: 64, offset: 3264)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1607, file: !780, line: 539, baseType: !968, size: 64, align: 64, offset: 3328)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1607, file: !780, line: 547, baseType: !968, size: 64, align: 64, offset: 3392)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1607, file: !780, line: 554, baseType: !1651, size: 64, align: 64, offset: 3456)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1607, file: !780, line: 563, baseType: !971, size: 32, align: 32, offset: 3520)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1607, file: !780, line: 572, baseType: !971, size: 32, align: 32, offset: 3552)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1607, file: !780, line: 581, baseType: !971, size: 32, align: 32, offset: 3584)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1607, file: !780, line: 588, baseType: !1671, size: 64, align: 64, offset: 3648)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !969, line: 36, baseType: !1103)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1607, file: !780, line: 593, baseType: !971, size: 32, align: 32, offset: 3712)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1607, file: !780, line: 596, baseType: !971, size: 32, align: 32, offset: 3744)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1607, file: !780, line: 599, baseType: !1377, size: 64, align: 64, offset: 3776)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1607, file: !780, line: 605, baseType: !1377, size: 64, align: 64, offset: 3840)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1607, file: !780, line: 616, baseType: !1377, size: 64, align: 64, offset: 3904)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1607, file: !780, line: 626, baseType: !1118, size: 64, align: 64, offset: 3968)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1607, file: !780, line: 627, baseType: !1118, size: 64, align: 64, offset: 4032)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1607, file: !780, line: 628, baseType: !1118, size: 64, align: 64, offset: 4096)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1607, file: !780, line: 629, baseType: !1118, size: 64, align: 64, offset: 4160)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1607, file: !780, line: 645, baseType: !1377, size: 64, align: 64, offset: 4224)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1498, file: !4, line: 3566, baseType: !1685, size: 64, align: 64, offset: 1408)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DISubroutineType(types: !1687)
!1687 = !{!971, !1415, !967, !1683, !1603}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1498, file: !4, line: 3567, baseType: !1535, size: 64, align: 64, offset: 1472)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1498, file: !4, line: 3576, baseType: !1690, size: 64, align: 64, offset: 1536)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DISubroutineType(types: !1692)
!1692 = !{!971, !1415, !1604}
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1498, file: !4, line: 3577, baseType: !1694, size: 64, align: 64, offset: 1600)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DISubroutineType(types: !1696)
!1696 = !{!971, !1415, !1603}
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1498, file: !4, line: 3584, baseType: !1698, size: 64, align: 64, offset: 1664)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DISubroutineType(types: !1700)
!1700 = !{!971, !1415, !1701}
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1498, file: !4, line: 3589, baseType: !1703, size: 64, align: 64, offset: 1728)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DISubroutineType(types: !1705)
!1705 = !{null, !1415}
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1498, file: !4, line: 3594, baseType: !971, size: 32, align: 32, offset: 1792)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1498, file: !4, line: 3600, baseType: !1426, size: 64, align: 64, offset: 1856)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1498, file: !4, line: 3609, baseType: !1709, size: 64, align: 64, offset: 1920)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1711, size: 64, align: 64)
!1711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1712)
!1712 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1417, file: !4, line: 1566, baseType: !87, size: 32, align: 32, offset: 192)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1417, file: !4, line: 1581, baseType: !982, size: 32, align: 32, offset: 224)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1417, file: !4, line: 1583, baseType: !967, size: 64, align: 64, offset: 256)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1417, file: !4, line: 1591, baseType: !1717, size: 64, align: 64, offset: 320)
!1717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1718, size: 64, align: 64)
!1718 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1417, file: !4, line: 1598, baseType: !967, size: 64, align: 64, offset: 384)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1417, file: !4, line: 1606, baseType: !968, size: 64, align: 64, offset: 448)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1417, file: !4, line: 1614, baseType: !971, size: 32, align: 32, offset: 512)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1417, file: !4, line: 1622, baseType: !971, size: 32, align: 32, offset: 544)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1417, file: !4, line: 1628, baseType: !971, size: 32, align: 32, offset: 576)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1417, file: !4, line: 1636, baseType: !971, size: 32, align: 32, offset: 608)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1417, file: !4, line: 1643, baseType: !971, size: 32, align: 32, offset: 640)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1417, file: !4, line: 1657, baseType: !1387, size: 64, align: 64, offset: 704)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1417, file: !4, line: 1658, baseType: !971, size: 32, align: 32, offset: 768)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1417, file: !4, line: 1679, baseType: !1024, size: 64, align: 32, offset: 800)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1417, file: !4, line: 1688, baseType: !971, size: 32, align: 32, offset: 864)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1417, file: !4, line: 1712, baseType: !971, size: 32, align: 32, offset: 896)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1417, file: !4, line: 1729, baseType: !971, size: 32, align: 32, offset: 928)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1417, file: !4, line: 1729, baseType: !971, size: 32, align: 32, offset: 960)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1417, file: !4, line: 1744, baseType: !971, size: 32, align: 32, offset: 992)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1417, file: !4, line: 1744, baseType: !971, size: 32, align: 32, offset: 1024)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1417, file: !4, line: 1751, baseType: !971, size: 32, align: 32, offset: 1056)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1417, file: !4, line: 1766, baseType: !546, size: 32, align: 32, offset: 1088)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1417, file: !4, line: 1791, baseType: !1738, size: 64, align: 64, offset: 1152)
!1738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1739, size: 64, align: 64)
!1739 = !DISubroutineType(types: !1740)
!1740 = !{null, !1741, !1604, !1683, !971, !971, !971}
!1741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1417, file: !4, line: 1808, baseType: !1743, size: 64, align: 64, offset: 1216)
!1743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1744, size: 64, align: 64)
!1744 = !DISubroutineType(types: !1745)
!1745 = !{!546, !1741, !1509}
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1417, file: !4, line: 1816, baseType: !971, size: 32, align: 32, offset: 1280)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1417, file: !4, line: 1825, baseType: !999, size: 32, align: 32, offset: 1312)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1417, file: !4, line: 1830, baseType: !971, size: 32, align: 32, offset: 1344)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1417, file: !4, line: 1838, baseType: !999, size: 32, align: 32, offset: 1376)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1417, file: !4, line: 1846, baseType: !971, size: 32, align: 32, offset: 1408)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1417, file: !4, line: 1851, baseType: !971, size: 32, align: 32, offset: 1440)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1417, file: !4, line: 1861, baseType: !999, size: 32, align: 32, offset: 1472)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1417, file: !4, line: 1868, baseType: !999, size: 32, align: 32, offset: 1504)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1417, file: !4, line: 1875, baseType: !999, size: 32, align: 32, offset: 1536)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1417, file: !4, line: 1882, baseType: !999, size: 32, align: 32, offset: 1568)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1417, file: !4, line: 1889, baseType: !999, size: 32, align: 32, offset: 1600)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1417, file: !4, line: 1896, baseType: !999, size: 32, align: 32, offset: 1632)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1417, file: !4, line: 1903, baseType: !999, size: 32, align: 32, offset: 1664)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1417, file: !4, line: 1910, baseType: !971, size: 32, align: 32, offset: 1696)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1417, file: !4, line: 1915, baseType: !971, size: 32, align: 32, offset: 1728)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1417, file: !4, line: 1926, baseType: !1683, size: 64, align: 64, offset: 1792)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1417, file: !4, line: 1935, baseType: !1024, size: 64, align: 32, offset: 1856)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1417, file: !4, line: 1942, baseType: !971, size: 32, align: 32, offset: 1920)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1417, file: !4, line: 1948, baseType: !971, size: 32, align: 32, offset: 1952)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1417, file: !4, line: 1954, baseType: !971, size: 32, align: 32, offset: 1984)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1417, file: !4, line: 1960, baseType: !971, size: 32, align: 32, offset: 2016)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1417, file: !4, line: 1984, baseType: !971, size: 32, align: 32, offset: 2048)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1417, file: !4, line: 1991, baseType: !971, size: 32, align: 32, offset: 2080)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1417, file: !4, line: 1996, baseType: !971, size: 32, align: 32, offset: 2112)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1417, file: !4, line: 2004, baseType: !971, size: 32, align: 32, offset: 2144)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1417, file: !4, line: 2011, baseType: !971, size: 32, align: 32, offset: 2176)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1417, file: !4, line: 2018, baseType: !971, size: 32, align: 32, offset: 2208)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1417, file: !4, line: 2027, baseType: !971, size: 32, align: 32, offset: 2240)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1417, file: !4, line: 2034, baseType: !971, size: 32, align: 32, offset: 2272)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1417, file: !4, line: 2044, baseType: !971, size: 32, align: 32, offset: 2304)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1417, file: !4, line: 2054, baseType: !1777, size: 64, align: 64, offset: 2368)
!1777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1417, file: !4, line: 2061, baseType: !1777, size: 64, align: 64, offset: 2432)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1417, file: !4, line: 2066, baseType: !971, size: 32, align: 32, offset: 2496)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1417, file: !4, line: 2070, baseType: !971, size: 32, align: 32, offset: 2528)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1417, file: !4, line: 2078, baseType: !971, size: 32, align: 32, offset: 2560)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1417, file: !4, line: 2085, baseType: !971, size: 32, align: 32, offset: 2592)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1417, file: !4, line: 2092, baseType: !971, size: 32, align: 32, offset: 2624)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1417, file: !4, line: 2099, baseType: !971, size: 32, align: 32, offset: 2656)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1417, file: !4, line: 2106, baseType: !971, size: 32, align: 32, offset: 2688)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1417, file: !4, line: 2113, baseType: !971, size: 32, align: 32, offset: 2720)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1417, file: !4, line: 2120, baseType: !971, size: 32, align: 32, offset: 2752)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1417, file: !4, line: 2125, baseType: !971, size: 32, align: 32, offset: 2784)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1417, file: !4, line: 2133, baseType: !971, size: 32, align: 32, offset: 2816)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1417, file: !4, line: 2140, baseType: !971, size: 32, align: 32, offset: 2848)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1417, file: !4, line: 2145, baseType: !971, size: 32, align: 32, offset: 2880)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1417, file: !4, line: 2153, baseType: !971, size: 32, align: 32, offset: 2912)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1417, file: !4, line: 2158, baseType: !971, size: 32, align: 32, offset: 2944)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1417, file: !4, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1417, file: !4, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1417, file: !4, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1417, file: !4, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1417, file: !4, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1417, file: !4, line: 2203, baseType: !971, size: 32, align: 32, offset: 3136)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1417, file: !4, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1417, file: !4, line: 2212, baseType: !971, size: 32, align: 32, offset: 3200)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1417, file: !4, line: 2213, baseType: !971, size: 32, align: 32, offset: 3232)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1417, file: !4, line: 2220, baseType: !746, size: 32, align: 32, offset: 3264)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1417, file: !4, line: 2232, baseType: !971, size: 32, align: 32, offset: 3296)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1417, file: !4, line: 2243, baseType: !971, size: 32, align: 32, offset: 3328)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1417, file: !4, line: 2249, baseType: !971, size: 32, align: 32, offset: 3360)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1417, file: !4, line: 2256, baseType: !971, size: 32, align: 32, offset: 3392)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1417, file: !4, line: 2263, baseType: !988, size: 64, align: 64, offset: 3456)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1417, file: !4, line: 2270, baseType: !988, size: 64, align: 64, offset: 3520)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1417, file: !4, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1417, file: !4, line: 2285, baseType: !746, size: 32, align: 32, offset: 3616)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1417, file: !4, line: 2367, baseType: !1813, size: 64, align: 64, offset: 3648)
!1813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1814, size: 64, align: 64)
!1814 = !DISubroutineType(types: !1815)
!1815 = !{!971, !1741, !1701, !971}
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1417, file: !4, line: 2383, baseType: !971, size: 32, align: 32, offset: 3712)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1417, file: !4, line: 2386, baseType: !999, size: 32, align: 32, offset: 3744)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1417, file: !4, line: 2387, baseType: !999, size: 32, align: 32, offset: 3776)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1417, file: !4, line: 2394, baseType: !971, size: 32, align: 32, offset: 3808)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1417, file: !4, line: 2401, baseType: !971, size: 32, align: 32, offset: 3840)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1417, file: !4, line: 2408, baseType: !971, size: 32, align: 32, offset: 3872)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1417, file: !4, line: 2415, baseType: !971, size: 32, align: 32, offset: 3904)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1417, file: !4, line: 2422, baseType: !971, size: 32, align: 32, offset: 3936)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1417, file: !4, line: 2423, baseType: !1825, size: 64, align: 64, offset: 3968)
!1825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1826, size: 64, align: 64)
!1826 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1827)
!1827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1828)
!1828 = !{!1829, !1830, !1831, !1832}
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1827, file: !4, line: 827, baseType: !971, size: 32, align: 32)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1827, file: !4, line: 828, baseType: !971, size: 32, align: 32, offset: 32)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1827, file: !4, line: 829, baseType: !971, size: 32, align: 32, offset: 64)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1827, file: !4, line: 830, baseType: !999, size: 32, align: 32, offset: 96)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1417, file: !4, line: 2430, baseType: !968, size: 64, align: 64, offset: 4032)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1417, file: !4, line: 2437, baseType: !968, size: 64, align: 64, offset: 4096)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1417, file: !4, line: 2444, baseType: !999, size: 32, align: 32, offset: 4160)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1417, file: !4, line: 2451, baseType: !999, size: 32, align: 32, offset: 4192)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1417, file: !4, line: 2458, baseType: !971, size: 32, align: 32, offset: 4224)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1417, file: !4, line: 2469, baseType: !971, size: 32, align: 32, offset: 4256)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1417, file: !4, line: 2475, baseType: !971, size: 32, align: 32, offset: 4288)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1417, file: !4, line: 2481, baseType: !971, size: 32, align: 32, offset: 4320)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1417, file: !4, line: 2485, baseType: !971, size: 32, align: 32, offset: 4352)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1417, file: !4, line: 2489, baseType: !971, size: 32, align: 32, offset: 4384)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1417, file: !4, line: 2493, baseType: !971, size: 32, align: 32, offset: 4416)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1417, file: !4, line: 2501, baseType: !971, size: 32, align: 32, offset: 4448)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1417, file: !4, line: 2506, baseType: !971, size: 32, align: 32, offset: 4480)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1417, file: !4, line: 2510, baseType: !971, size: 32, align: 32, offset: 4512)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1417, file: !4, line: 2514, baseType: !968, size: 64, align: 64, offset: 4544)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1417, file: !4, line: 2528, baseType: !1849, size: 64, align: 64, offset: 4608)
!1849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1850, size: 64, align: 64)
!1850 = !DISubroutineType(types: !1851)
!1851 = !{null, !1741, !967, !971, !971}
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1417, file: !4, line: 2534, baseType: !971, size: 32, align: 32, offset: 4672)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1417, file: !4, line: 2545, baseType: !971, size: 32, align: 32, offset: 4704)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1417, file: !4, line: 2547, baseType: !971, size: 32, align: 32, offset: 4736)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1417, file: !4, line: 2549, baseType: !971, size: 32, align: 32, offset: 4768)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1417, file: !4, line: 2551, baseType: !971, size: 32, align: 32, offset: 4800)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1417, file: !4, line: 2553, baseType: !971, size: 32, align: 32, offset: 4832)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1417, file: !4, line: 2555, baseType: !971, size: 32, align: 32, offset: 4864)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1417, file: !4, line: 2557, baseType: !971, size: 32, align: 32, offset: 4896)
