; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--ip.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--ip.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sockaddr_storage = type { i16, [118 x i8], i64 }
%struct.IPSourceFilters = type { i32, i32, %struct.sockaddr_storage*, %struct.sockaddr_storage* }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [16 x i8] }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }

@.str = private unnamed_addr constant [2 x i8] c"0\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.2 = private unnamed_addr constant [25 x i8] c"getaddrinfo(%s, %s): %s\0A\00", align 1
@.str.3 = private unnamed_addr constant [8 x i8] c"unknown\00", align 1
@.str.4 = private unnamed_addr constant [66 x i8] c"Simultaneously including and excluding sources is not supported.\0A\00", align 1
@.str.5 = private unnamed_addr constant [2 x i8] c",\00", align 1

; Function Attrs: nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--ip.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !4, line: 24, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!7 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!8 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!9 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!10 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!11 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!12 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!13 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!14 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!15 = !{!16, !41, !60, !62}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !19, line: 239, size: 128, align: 32, elements: !20)
!19 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!20 = !{!21, !25, !29, !36}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !18, file: !19, line: 241, baseType: !22, size: 16, align: 16)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !23, line: 28, baseType: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!24 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !18, file: !19, line: 242, baseType: !26, size: 16, align: 16, offset: 16)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !19, line: 119, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !28, line: 49, baseType: !24)
!28 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!29 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !18, file: !19, line: 243, baseType: !30, size: 32, align: 32, offset: 32)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !19, line: 31, size: 32, align: 32, elements: !31)
!31 = !{!32}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !30, file: !19, line: 33, baseType: !33, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !19, line: 30, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !28, line: 51, baseType: !35)
!35 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !18, file: !19, line: 246, baseType: !37, size: 64, align: 8, offset: 64)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 64, align: 8, elements: !39)
!38 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!39 = !{!40}
!40 = !DISubrange(count: 8)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !19, line: 254, size: 224, align: 32, elements: !44)
!44 = !{!45, !46, !47, !48, !59}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !43, file: !19, line: 256, baseType: !22, size: 16, align: 16)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !43, file: !19, line: 257, baseType: !26, size: 16, align: 16, offset: 16)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !43, file: !19, line: 258, baseType: !34, size: 32, align: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !43, file: !19, line: 259, baseType: !49, size: 128, align: 8, offset: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !19, line: 211, size: 128, align: 8, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !49, file: !19, line: 220, baseType: !52, size: 128, align: 8)
!52 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !49, file: !19, line: 213, size: 128, align: 8, elements: !53)
!53 = !{!54}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !52, file: !19, line: 215, baseType: !55, size: 128, align: 8)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 128, align: 8, elements: !57)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !28, line: 48, baseType: !38)
!57 = !{!58}
!58 = !DISubrange(count: 16)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !43, file: !19, line: 260, baseType: !34, size: 32, align: 32, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!63 = !{i32 2, !"Dwarf Version", i32 4}
!64 = !{i32 2, !"Debug Info Version", i32 3}
!65 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!66 = distinct !DISubprogram(name: "ff_ip_check_source_lists", scope: !67, file: !67, line: 44, type: !68, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !92)
!67 = !DIFile(filename: "libavformat/ip.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !71, !83}
!70 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !73, line: 166, size: 1024, align: 64, elements: !74)
!73 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!74 = !{!75, !76, !81}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !72, file: !73, line: 168, baseType: !22, size: 16, align: 16)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !72, file: !73, line: 169, baseType: !77, size: 944, align: 8, offset: 16)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 944, align: 8, elements: !79)
!78 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!79 = !{!80}
!80 = !DISubrange(count: 118)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !72, file: !73, line: 170, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPSourceFilters", file: !85, line: 34, baseType: !86)
!85 = !DIFile(filename: "libavformat/ip.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IPSourceFilters", file: !85, line: 29, size: 192, align: 64, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "nb_include_addrs", scope: !86, file: !85, line: 30, baseType: !70, size: 32, align: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "nb_exclude_addrs", scope: !86, file: !85, line: 31, baseType: !70, size: 32, align: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "include_addrs", scope: !86, file: !85, line: 32, baseType: !71, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_addrs", scope: !86, file: !85, line: 33, baseType: !71, size: 64, align: 64, offset: 128)
!92 = !{}
!93 = !DILocalVariable(name: "source_addr_ptr", arg: 1, scope: !66, file: !67, line: 44, type: !71)
!94 = !DIExpression()
!95 = !DILocation(line: 44, column: 55, scope: !66)
!96 = !DILocalVariable(name: "s", arg: 2, scope: !66, file: !67, line: 44, type: !83)
!97 = !DILocation(line: 44, column: 89, scope: !66)
!98 = !DILocalVariable(name: "i", scope: !66, file: !67, line: 46, type: !70)
!99 = !DILocation(line: 46, column: 9, scope: !66)
!100 = !DILocation(line: 47, column: 9, scope: !101)
!101 = distinct !DILexicalBlock(scope: !66, file: !67, line: 47, column: 9)
!102 = !DILocation(line: 47, column: 12, scope: !101)
!103 = !DILocation(line: 47, column: 9, scope: !66)
!104 = !DILocation(line: 48, column: 16, scope: !105)
!105 = distinct !DILexicalBlock(scope: !106, file: !67, line: 48, column: 9)
!106 = distinct !DILexicalBlock(scope: !101, file: !67, line: 47, column: 30)
!107 = !DILocation(line: 48, column: 14, scope: !105)
!108 = !DILocation(line: 48, column: 21, scope: !109)
!109 = !DILexicalBlockFile(scope: !110, file: !67, discriminator: 1)
!110 = distinct !DILexicalBlock(scope: !105, file: !67, line: 48, column: 9)
!111 = !DILocation(line: 48, column: 25, scope: !109)
!112 = !DILocation(line: 48, column: 28, scope: !109)
!113 = !DILocation(line: 48, column: 23, scope: !109)
!114 = !DILocation(line: 48, column: 9, scope: !109)
!115 = !DILocation(line: 49, column: 31, scope: !116)
!116 = distinct !DILexicalBlock(scope: !117, file: !67, line: 49, column: 17)
!117 = distinct !DILexicalBlock(scope: !110, file: !67, line: 48, column: 51)
!118 = !DILocation(line: 49, column: 66, scope: !116)
!119 = !DILocation(line: 49, column: 49, scope: !116)
!120 = !DILocation(line: 49, column: 52, scope: !116)
!121 = !DILocation(line: 49, column: 18, scope: !116)
!122 = !DILocation(line: 49, column: 17, scope: !117)
!123 = !DILocation(line: 50, column: 17, scope: !116)
!124 = !DILocation(line: 51, column: 9, scope: !117)
!125 = !DILocation(line: 48, column: 47, scope: !126)
!126 = !DILexicalBlockFile(scope: !110, file: !67, discriminator: 2)
!127 = !DILocation(line: 48, column: 9, scope: !126)
!128 = distinct !{!128, !129}
!129 = !DILocation(line: 48, column: 9, scope: !106)
!130 = !DILocation(line: 52, column: 5, scope: !106)
!131 = !DILocation(line: 53, column: 9, scope: !132)
!132 = distinct !DILexicalBlock(scope: !66, file: !67, line: 53, column: 9)
!133 = !DILocation(line: 53, column: 12, scope: !132)
!134 = !DILocation(line: 53, column: 9, scope: !66)
!135 = !DILocation(line: 54, column: 16, scope: !136)
!136 = distinct !DILexicalBlock(scope: !137, file: !67, line: 54, column: 9)
!137 = distinct !DILexicalBlock(scope: !132, file: !67, line: 53, column: 30)
!138 = !DILocation(line: 54, column: 14, scope: !136)
!139 = !DILocation(line: 54, column: 21, scope: !140)
!140 = !DILexicalBlockFile(scope: !141, file: !67, discriminator: 1)
!141 = distinct !DILexicalBlock(scope: !136, file: !67, line: 54, column: 9)
!142 = !DILocation(line: 54, column: 25, scope: !140)
!143 = !DILocation(line: 54, column: 28, scope: !140)
!144 = !DILocation(line: 54, column: 23, scope: !140)
!145 = !DILocation(line: 54, column: 9, scope: !140)
!146 = !DILocation(line: 55, column: 31, scope: !147)
!147 = distinct !DILexicalBlock(scope: !148, file: !67, line: 55, column: 17)
!148 = distinct !DILexicalBlock(scope: !141, file: !67, line: 54, column: 51)
!149 = !DILocation(line: 55, column: 66, scope: !147)
!150 = !DILocation(line: 55, column: 49, scope: !147)
!151 = !DILocation(line: 55, column: 52, scope: !147)
!152 = !DILocation(line: 55, column: 18, scope: !147)
!153 = !DILocation(line: 55, column: 17, scope: !148)
!154 = !DILocation(line: 56, column: 17, scope: !147)
!155 = !DILocation(line: 57, column: 9, scope: !148)
!156 = !DILocation(line: 54, column: 47, scope: !157)
!157 = !DILexicalBlockFile(scope: !141, file: !67, discriminator: 2)
!158 = !DILocation(line: 54, column: 9, scope: !157)
!159 = distinct !{!159, !160}
!160 = !DILocation(line: 54, column: 9, scope: !137)
!161 = !DILocation(line: 58, column: 9, scope: !137)
!162 = !DILocation(line: 60, column: 5, scope: !66)
!163 = !DILocation(line: 61, column: 1, scope: !66)
!164 = distinct !DISubprogram(name: "compare_addr", scope: !67, file: !67, line: 24, type: !165, isLocal: true, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !92)
!165 = !DISubroutineType(types: !166)
!166 = !{!70, !167, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!169 = !DILocalVariable(name: "a", arg: 1, scope: !164, file: !67, line: 24, type: !167)
!170 = !DILocation(line: 24, column: 56, scope: !164)
!171 = !DILocalVariable(name: "b", arg: 2, scope: !164, file: !67, line: 25, type: !167)
!172 = !DILocation(line: 25, column: 56, scope: !164)
!173 = !DILocation(line: 27, column: 9, scope: !174)
!174 = distinct !DILexicalBlock(scope: !164, file: !67, line: 27, column: 9)
!175 = !DILocation(line: 27, column: 12, scope: !174)
!176 = !DILocation(line: 27, column: 25, scope: !174)
!177 = !DILocation(line: 27, column: 28, scope: !174)
!178 = !DILocation(line: 27, column: 22, scope: !174)
!179 = !DILocation(line: 27, column: 9, scope: !164)
!180 = !DILocation(line: 28, column: 9, scope: !174)
!181 = !DILocation(line: 29, column: 9, scope: !182)
!182 = distinct !DILexicalBlock(scope: !164, file: !67, line: 29, column: 9)
!183 = !DILocation(line: 29, column: 12, scope: !182)
!184 = !DILocation(line: 29, column: 22, scope: !182)
!185 = !DILocation(line: 29, column: 9, scope: !164)
!186 = !DILocation(line: 30, column: 46, scope: !187)
!187 = distinct !DILexicalBlock(scope: !182, file: !67, line: 29, column: 33)
!188 = !DILocation(line: 30, column: 50, scope: !187)
!189 = !DILocation(line: 30, column: 59, scope: !187)
!190 = !DILocation(line: 31, column: 46, scope: !187)
!191 = !DILocation(line: 31, column: 50, scope: !187)
!192 = !DILocation(line: 31, column: 59, scope: !187)
!193 = !DILocation(line: 30, column: 66, scope: !187)
!194 = !DILocation(line: 30, column: 9, scope: !187)
!195 = !DILocation(line: 35, column: 9, scope: !196)
!196 = distinct !DILexicalBlock(scope: !164, file: !67, line: 35, column: 9)
!197 = !DILocation(line: 35, column: 12, scope: !196)
!198 = !DILocation(line: 35, column: 22, scope: !196)
!199 = !DILocation(line: 35, column: 9, scope: !164)
!200 = !DILocalVariable(name: "s6_addr_a", scope: !201, file: !67, line: 36, type: !202)
!201 = distinct !DILexicalBlock(scope: !196, file: !67, line: 35, column: 34)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!204 = !DILocation(line: 36, column: 24, scope: !201)
!205 = !DILocation(line: 36, column: 66, scope: !201)
!206 = !DILocation(line: 36, column: 70, scope: !201)
!207 = !DILocation(line: 36, column: 79, scope: !201)
!208 = !DILocation(line: 36, column: 87, scope: !201)
!209 = !DILocation(line: 36, column: 36, scope: !201)
!210 = !DILocalVariable(name: "s6_addr_b", scope: !201, file: !67, line: 37, type: !202)
!211 = !DILocation(line: 37, column: 24, scope: !201)
!212 = !DILocation(line: 37, column: 66, scope: !201)
!213 = !DILocation(line: 37, column: 70, scope: !201)
!214 = !DILocation(line: 37, column: 79, scope: !201)
!215 = !DILocation(line: 37, column: 87, scope: !201)
!216 = !DILocation(line: 37, column: 36, scope: !201)
!217 = !DILocation(line: 38, column: 23, scope: !201)
!218 = !DILocation(line: 38, column: 34, scope: !201)
!219 = !DILocation(line: 38, column: 16, scope: !201)
!220 = !DILocation(line: 38, column: 9, scope: !201)
!221 = !DILocation(line: 41, column: 5, scope: !164)
!222 = !DILocation(line: 42, column: 1, scope: !164)
!223 = distinct !DISubprogram(name: "ff_ip_resolve_host", scope: !67, file: !67, line: 63, type: !224, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !92)
!224 = !DISubroutineType(types: !225)
!225 = !{!226, !61, !250, !70, !70, !70, !70}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !228, line: 567, size: 384, align: 64, elements: !229)
!228 = !DIFile(filename: "/usr/include/netdb.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!229 = !{!230, !231, !232, !233, !234, !238, !247, !249}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !227, file: !228, line: 569, baseType: !70, size: 32, align: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !227, file: !228, line: 570, baseType: !70, size: 32, align: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !227, file: !228, line: 571, baseType: !70, size: 32, align: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !227, file: !228, line: 572, baseType: !70, size: 32, align: 32, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !227, file: !228, line: 573, baseType: !235, size: 32, align: 32, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !73, line: 33, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !237, line: 189, baseType: !35)
!237 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !227, file: !228, line: 574, baseType: !239, size: 64, align: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !73, line: 153, size: 128, align: 16, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !240, file: !73, line: 155, baseType: !22, size: 16, align: 16)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !240, file: !73, line: 156, baseType: !244, size: 112, align: 8, offset: 16)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 112, align: 8, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 14)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !227, file: !228, line: 575, baseType: !248, size: 64, align: 64, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !227, file: !228, line: 576, baseType: !226, size: 64, align: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!252 = !DILocalVariable(name: "log_ctx", arg: 1, scope: !223, file: !67, line: 63, type: !61)
!253 = !DILocation(line: 63, column: 43, scope: !223)
!254 = !DILocalVariable(name: "hostname", arg: 2, scope: !223, file: !67, line: 64, type: !250)
!255 = !DILocation(line: 64, column: 49, scope: !223)
!256 = !DILocalVariable(name: "port", arg: 3, scope: !223, file: !67, line: 64, type: !70)
!257 = !DILocation(line: 64, column: 63, scope: !223)
!258 = !DILocalVariable(name: "type", arg: 4, scope: !223, file: !67, line: 65, type: !70)
!259 = !DILocation(line: 65, column: 41, scope: !223)
!260 = !DILocalVariable(name: "family", arg: 5, scope: !223, file: !67, line: 65, type: !70)
!261 = !DILocation(line: 65, column: 51, scope: !223)
!262 = !DILocalVariable(name: "flags", arg: 6, scope: !223, file: !67, line: 65, type: !70)
!263 = !DILocation(line: 65, column: 63, scope: !223)
!264 = !DILocalVariable(name: "hints", scope: !223, file: !67, line: 67, type: !227)
!265 = !DILocation(line: 67, column: 21, scope: !223)
!266 = !DILocalVariable(name: "res", scope: !223, file: !67, line: 67, type: !226)
!267 = !DILocation(line: 67, column: 37, scope: !223)
!268 = !DILocalVariable(name: "error", scope: !223, file: !67, line: 68, type: !70)
!269 = !DILocation(line: 68, column: 9, scope: !223)
!270 = !DILocalVariable(name: "sport", scope: !223, file: !67, line: 69, type: !271)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 128, align: 8, elements: !57)
!272 = !DILocation(line: 69, column: 10, scope: !223)
!273 = !DILocalVariable(name: "node", scope: !223, file: !67, line: 70, type: !250)
!274 = !DILocation(line: 70, column: 17, scope: !223)
!275 = !DILocalVariable(name: "service", scope: !223, file: !67, line: 70, type: !250)
!276 = !DILocation(line: 70, column: 28, scope: !223)
!277 = !DILocation(line: 72, column: 9, scope: !278)
!278 = distinct !DILexicalBlock(scope: !223, file: !67, line: 72, column: 9)
!279 = !DILocation(line: 72, column: 14, scope: !278)
!280 = !DILocation(line: 72, column: 9, scope: !223)
!281 = !DILocation(line: 73, column: 18, scope: !282)
!282 = distinct !DILexicalBlock(scope: !278, file: !67, line: 72, column: 19)
!283 = !DILocation(line: 73, column: 46, scope: !282)
!284 = !DILocation(line: 73, column: 9, scope: !282)
!285 = !DILocation(line: 74, column: 19, scope: !282)
!286 = !DILocation(line: 74, column: 17, scope: !282)
!287 = !DILocation(line: 75, column: 5, scope: !282)
!288 = !DILocation(line: 76, column: 10, scope: !289)
!289 = distinct !DILexicalBlock(scope: !223, file: !67, line: 76, column: 9)
!290 = !DILocation(line: 76, column: 9, scope: !289)
!291 = !DILocation(line: 76, column: 20, scope: !289)
!292 = !DILocation(line: 76, column: 24, scope: !293)
!293 = !DILexicalBlockFile(scope: !289, file: !67, discriminator: 1)
!294 = !DILocation(line: 76, column: 36, scope: !293)
!295 = !DILocation(line: 76, column: 45, scope: !293)
!296 = !DILocation(line: 76, column: 49, scope: !297)
!297 = !DILexicalBlockFile(scope: !289, file: !67, discriminator: 2)
!298 = !DILocation(line: 76, column: 61, scope: !297)
!299 = !DILocation(line: 76, column: 9, scope: !297)
!300 = !DILocation(line: 77, column: 16, scope: !301)
!301 = distinct !DILexicalBlock(scope: !289, file: !67, line: 76, column: 70)
!302 = !DILocation(line: 77, column: 14, scope: !301)
!303 = !DILocation(line: 78, column: 5, scope: !301)
!304 = !DILocation(line: 79, column: 25, scope: !223)
!305 = !DILocation(line: 79, column: 11, scope: !223)
!306 = !DILocation(line: 79, column: 23, scope: !223)
!307 = !DILocation(line: 80, column: 23, scope: !223)
!308 = !DILocation(line: 80, column: 11, scope: !223)
!309 = !DILocation(line: 80, column: 21, scope: !223)
