; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--framehash.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--framehash.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFormatContext = type { %struct.AVClass*, %struct.AVInputFormat*, %struct.AVOutputFormat*, i8*, %struct.AVIOContext*, i32, i32, %struct.AVStream**, [1024 x i8], i8*, i64, i64, i64, i32, i32, i32, i64, i64, i8*, i32, i32, %struct.AVProgram**, i32, i32, i32, i32, i32, i32, %struct.AVChapter**, %struct.AVDictionary*, i64, i32, i32, %struct.AVIOInterruptCB, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i8*, i8*, %struct.AVFormatInternal*, i32, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, i32, i8*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i64, i8*, i32, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVIOInterruptCB*, %struct.AVDictionary**)*, i8*, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVDictionary**)*, void (%struct.AVFormatContext*, %struct.AVIOContext*)*, i8*, i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }

!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !25, line: 1534, size: 32, align: 32, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !25, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !25, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !25, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{i32 2, !"Dwarf Version", i32 4}
!917 = !{i32 2, !"Debug Info Version", i32 3}
!918 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!919 = distinct !DISubprogram(name: "ff_framehash_write_header", scope: !920, file: !920, line: 23, type: !921, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2141)
!920 = !DIFile(filename: "libavformat/framehash.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!921 = !DISubroutineType(types: !922)
!922 = !{!923, !924}
!923 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !927)
!927 = !{!928, !973, !1088, !1236, !1237, !1302, !1303, !1304, !1998, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2052, !2053, !2054, !2055, !2056, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2107, !2108, !2111, !2112, !2113, !2114, !2115, !2116, !2118, !2119, !2120, !2121, !2129, !2130, !2134, !2138, !2139, !2140}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !926, file: !897, line: 1342, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !933)
!933 = !{!934, !938, !943, !947, !948, !949, !950, !954, !960, !962, !966}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !932, file: !4, line: 72, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !932, file: !4, line: 78, baseType: !939, size: 64, align: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!935, !942}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !932, file: !4, line: 85, baseType: !944, size: 64, align: 64, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !932, file: !4, line: 93, baseType: !923, size: 32, align: 32, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !932, file: !4, line: 99, baseType: !923, size: 32, align: 32, offset: 224)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !932, file: !4, line: 108, baseType: !923, size: 32, align: 32, offset: 256)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !932, file: !4, line: 113, baseType: !951, size: 64, align: 64, offset: 320)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!942, !942, !942}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !932, file: !4, line: 123, baseType: !955, size: 64, align: 64, offset: 384)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!958, !958}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !932, file: !4, line: 130, baseType: !961, size: 32, align: 32, offset: 448)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !932, file: !4, line: 136, baseType: !963, size: 64, align: 64, offset: 512)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!961, !942}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !932, file: !4, line: 142, baseType: !967, size: 64, align: 64, offset: 576)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!923, !970, !942, !935, !923}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !926, file: !897, line: 1349, baseType: !974, size: 64, align: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !976)
!976 = !{!977, !978, !979, !980, !981, !992, !993, !994, !995, !996, !997, !1011, !1016, !1059, !1060, !1064, !1069, !1070, !1071, !1075, !1081, !1087}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !975, file: !897, line: 638, baseType: !935, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !975, file: !897, line: 645, baseType: !935, size: 64, align: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !975, file: !897, line: 652, baseType: !923, size: 32, align: 32, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !975, file: !897, line: 659, baseType: !935, size: 64, align: 64, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !975, file: !897, line: 661, baseType: !982, size: 64, align: 64, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !987, line: 44, size: 64, align: 32, elements: !988)
!987 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !986, file: !987, line: 45, baseType: !24, size: 32, align: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !986, file: !987, line: 46, baseType: !991, size: 32, align: 32, offset: 32)
!991 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !975, file: !897, line: 663, baseType: !929, size: 64, align: 64, offset: 320)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !975, file: !897, line: 670, baseType: !935, size: 64, align: 64, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !975, file: !897, line: 679, baseType: !974, size: 64, align: 64, offset: 448)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !975, file: !897, line: 684, baseType: !923, size: 32, align: 32, offset: 512)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !975, file: !897, line: 689, baseType: !923, size: 32, align: 32, offset: 544)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !975, file: !897, line: 696, baseType: !998, size: 64, align: 64, offset: 576)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!923, !1001}
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1004)
!1004 = !{!1005, !1006, !1009, !1010}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1003, file: !897, line: 449, baseType: !935, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1003, file: !897, line: 450, baseType: !1007, size: 64, align: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1003, file: !897, line: 451, baseType: !923, size: 32, align: 32, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1003, file: !897, line: 452, baseType: !935, size: 64, align: 64, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !975, file: !897, line: 703, baseType: !1012, size: 64, align: 64, offset: 640)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!923, !1015}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !975, file: !897, line: 714, baseType: !1017, size: 64, align: 64, offset: 704)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!923, !1015, !1020}
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !25, line: 1499, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !25, line: 1445, size: 704, align: 64, elements: !1023)
!1023 = !{!1024, !1039, !1042, !1043, !1044, !1045, !1046, !1047, !1055, !1056, !1057, !1058}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1022, file: !25, line: 1451, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1027, line: 94, baseType: !1028)
!1027 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1027, line: 81, size: 192, align: 64, elements: !1029)
!1029 = !{!1030, !1034, !1038}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1028, file: !1027, line: 82, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1027, line: 73, baseType: !1033)
!1033 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1027, line: 73, flags: DIFlagFwdDecl)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1028, file: !1027, line: 89, baseType: !1035, size: 64, align: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1037, line: 48, baseType: !1008)
!1037 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1028, file: !1027, line: 93, baseType: !923, size: 32, align: 32, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1022, file: !25, line: 1461, baseType: !1040, size: 64, align: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1037, line: 40, baseType: !1041)
!1041 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1022, file: !25, line: 1467, baseType: !1040, size: 64, align: 64, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1022, file: !25, line: 1468, baseType: !1035, size: 64, align: 64, offset: 192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1022, file: !25, line: 1469, baseType: !923, size: 32, align: 32, offset: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1022, file: !25, line: 1470, baseType: !923, size: 32, align: 32, offset: 288)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1022, file: !25, line: 1474, baseType: !923, size: 32, align: 32, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1022, file: !25, line: 1479, baseType: !1048, size: 64, align: 64, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !25, line: 1415, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !25, line: 1411, size: 128, align: 64, elements: !1051)
!1051 = !{!1052, !1053, !1054}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1050, file: !25, line: 1412, baseType: !1035, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1050, file: !25, line: 1413, baseType: !923, size: 32, align: 32, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1050, file: !25, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1022, file: !25, line: 1480, baseType: !923, size: 32, align: 32, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1022, file: !25, line: 1486, baseType: !1040, size: 64, align: 64, offset: 512)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1022, file: !25, line: 1488, baseType: !1040, size: 64, align: 64, offset: 576)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1022, file: !25, line: 1497, baseType: !1040, size: 64, align: 64, offset: 640)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !975, file: !897, line: 720, baseType: !1012, size: 64, align: 64, offset: 768)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !975, file: !897, line: 730, baseType: !1061, size: 64, align: 64, offset: 832)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!923, !1015, !923, !1040, !923}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !975, file: !897, line: 737, baseType: !1065, size: 64, align: 64, offset: 896)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!1040, !1015, !923, !1068, !1040}
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !975, file: !897, line: 744, baseType: !1012, size: 64, align: 64, offset: 960)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !975, file: !897, line: 750, baseType: !1012, size: 64, align: 64, offset: 1024)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !975, file: !897, line: 758, baseType: !1072, size: 64, align: 64, offset: 1088)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!923, !1015, !923, !1040, !1040, !1040, !923}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !975, file: !897, line: 764, baseType: !1076, size: 64, align: 64, offset: 1152)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!923, !1015, !1079}
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !975, file: !897, line: 770, baseType: !1082, size: 64, align: 64, offset: 1216)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!923, !1015, !1085}
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !975, file: !897, line: 776, baseType: !1082, size: 64, align: 64, offset: 1280)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !926, file: !897, line: 1356, baseType: !1089, size: 64, align: 64, offset: 128)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1111, !1115, !1119, !1126, !1221, !1222, !1223, !1224, !1225, !1226, !1230}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1090, file: !897, line: 498, baseType: !935, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1090, file: !897, line: 504, baseType: !935, size: 64, align: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1090, file: !897, line: 505, baseType: !935, size: 64, align: 64, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1090, file: !897, line: 506, baseType: !935, size: 64, align: 64, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1090, file: !897, line: 508, baseType: !24, size: 32, align: 32, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1090, file: !897, line: 509, baseType: !24, size: 32, align: 32, offset: 288)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1090, file: !897, line: 510, baseType: !24, size: 32, align: 32, offset: 320)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1090, file: !897, line: 517, baseType: !923, size: 32, align: 32, offset: 352)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1090, file: !897, line: 523, baseType: !982, size: 64, align: 64, offset: 384)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1090, file: !897, line: 526, baseType: !929, size: 64, align: 64, offset: 448)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1090, file: !897, line: 535, baseType: !1089, size: 64, align: 64, offset: 512)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1090, file: !897, line: 539, baseType: !923, size: 32, align: 32, offset: 576)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1090, file: !897, line: 541, baseType: !1012, size: 64, align: 64, offset: 640)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1090, file: !897, line: 549, baseType: !1017, size: 64, align: 64, offset: 704)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1090, file: !897, line: 550, baseType: !1012, size: 64, align: 64, offset: 768)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1090, file: !897, line: 554, baseType: !1108, size: 64, align: 64, offset: 832)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!923, !1015, !1020, !1020, !923}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1090, file: !897, line: 563, baseType: !1112, size: 64, align: 64, offset: 896)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!923, !24, !923}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1090, file: !897, line: 565, baseType: !1116, size: 64, align: 64, offset: 960)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{null, !1015, !923, !1068, !1068}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1090, file: !897, line: 570, baseType: !1120, size: 64, align: 64, offset: 1024)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!923, !1015, !923, !942, !1123}
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1124, line: 216, baseType: !1125)
!1124 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1125 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1090, file: !897, line: 581, baseType: !1127, size: 64, align: 64, offset: 1088)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!923, !1015, !923, !1130, !991}
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1134)
!1134 = !{!1135, !1139, !1141, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1175, !1177, !1178, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1133, file: !526, line: 282, baseType: !1136, size: 512, align: 64)
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1035, size: 512, align: 64, elements: !1137)
!1137 = !{!1138}
!1138 = !DISubrange(count: 8)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1133, file: !526, line: 299, baseType: !1140, size: 256, align: 32, offset: 512)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 256, align: 32, elements: !1137)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1133, file: !526, line: 315, baseType: !1142, size: 64, align: 64, offset: 768)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1133, file: !526, line: 326, baseType: !923, size: 32, align: 32, offset: 832)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1133, file: !526, line: 326, baseType: !923, size: 32, align: 32, offset: 864)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1133, file: !526, line: 334, baseType: !923, size: 32, align: 32, offset: 896)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1133, file: !526, line: 341, baseType: !923, size: 32, align: 32, offset: 928)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1133, file: !526, line: 346, baseType: !923, size: 32, align: 32, offset: 960)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1133, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1133, file: !526, line: 356, baseType: !1150, size: 64, align: 32, offset: 1024)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1151, line: 61, baseType: !1152)
!1151 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1151, line: 58, size: 64, align: 32, elements: !1153)
!1153 = !{!1154, !1155}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1152, file: !1151, line: 59, baseType: !923, size: 32, align: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1152, file: !1151, line: 60, baseType: !923, size: 32, align: 32, offset: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1133, file: !526, line: 361, baseType: !1040, size: 64, align: 64, offset: 1088)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1133, file: !526, line: 369, baseType: !1040, size: 64, align: 64, offset: 1152)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1133, file: !526, line: 377, baseType: !1040, size: 64, align: 64, offset: 1216)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1133, file: !526, line: 382, baseType: !923, size: 32, align: 32, offset: 1280)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1133, file: !526, line: 386, baseType: !923, size: 32, align: 32, offset: 1312)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1133, file: !526, line: 391, baseType: !923, size: 32, align: 32, offset: 1344)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1133, file: !526, line: 396, baseType: !942, size: 64, align: 64, offset: 1408)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1133, file: !526, line: 403, baseType: !1164, size: 512, align: 64, offset: 1472)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1165, size: 512, align: 64, elements: !1137)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1037, line: 55, baseType: !1125)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1133, file: !526, line: 410, baseType: !923, size: 32, align: 32, offset: 1984)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1133, file: !526, line: 415, baseType: !923, size: 32, align: 32, offset: 2016)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1133, file: !526, line: 420, baseType: !923, size: 32, align: 32, offset: 2048)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1133, file: !526, line: 425, baseType: !923, size: 32, align: 32, offset: 2080)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1133, file: !526, line: 435, baseType: !1040, size: 64, align: 64, offset: 2112)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1133, file: !526, line: 440, baseType: !923, size: 32, align: 32, offset: 2176)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1133, file: !526, line: 445, baseType: !1165, size: 64, align: 64, offset: 2240)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1133, file: !526, line: 459, baseType: !1174, size: 512, align: 64, offset: 2304)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 512, align: 64, elements: !1137)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1133, file: !526, line: 473, baseType: !1176, size: 64, align: 64, offset: 2816)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1133, file: !526, line: 477, baseType: !923, size: 32, align: 32, offset: 2880)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1133, file: !526, line: 479, baseType: !1179, size: 64, align: 64, offset: 2944)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1183)
!1183 = !{!1184, !1185, !1186, !1187, !1192}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1182, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1182, file: !526, line: 203, baseType: !1035, size: 64, align: 64, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1182, file: !526, line: 204, baseType: !923, size: 32, align: 32, offset: 128)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1182, file: !526, line: 205, baseType: !1188, size: 64, align: 64, offset: 192)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1190, line: 86, baseType: !1191)
!1190 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1191 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1190, line: 86, flags: DIFlagFwdDecl)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1182, file: !526, line: 206, baseType: !1025, size: 64, align: 64, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1133, file: !526, line: 480, baseType: !923, size: 32, align: 32, offset: 3008)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1133, file: !526, line: 505, baseType: !923, size: 32, align: 32, offset: 3040)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1133, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1133, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1133, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1133, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1133, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1133, file: !526, line: 532, baseType: !1040, size: 64, align: 64, offset: 3264)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1133, file: !526, line: 539, baseType: !1040, size: 64, align: 64, offset: 3328)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1133, file: !526, line: 547, baseType: !1040, size: 64, align: 64, offset: 3392)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1133, file: !526, line: 554, baseType: !1188, size: 64, align: 64, offset: 3456)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1133, file: !526, line: 563, baseType: !923, size: 32, align: 32, offset: 3520)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1133, file: !526, line: 572, baseType: !923, size: 32, align: 32, offset: 3552)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1133, file: !526, line: 581, baseType: !923, size: 32, align: 32, offset: 3584)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1133, file: !526, line: 588, baseType: !1208, size: 64, align: 64, offset: 3648)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1037, line: 36, baseType: !1210)
!1210 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1133, file: !526, line: 593, baseType: !923, size: 32, align: 32, offset: 3712)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1133, file: !526, line: 596, baseType: !923, size: 32, align: 32, offset: 3744)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1133, file: !526, line: 599, baseType: !1025, size: 64, align: 64, offset: 3776)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1133, file: !526, line: 605, baseType: !1025, size: 64, align: 64, offset: 3840)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1133, file: !526, line: 616, baseType: !1025, size: 64, align: 64, offset: 3904)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1133, file: !526, line: 626, baseType: !1123, size: 64, align: 64, offset: 3968)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1133, file: !526, line: 627, baseType: !1123, size: 64, align: 64, offset: 4032)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1133, file: !526, line: 628, baseType: !1123, size: 64, align: 64, offset: 4096)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1133, file: !526, line: 629, baseType: !1123, size: 64, align: 64, offset: 4160)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1133, file: !526, line: 645, baseType: !1025, size: 64, align: 64, offset: 4224)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1090, file: !897, line: 587, baseType: !1076, size: 64, align: 64, offset: 1152)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1090, file: !897, line: 592, baseType: !1082, size: 64, align: 64, offset: 1216)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1090, file: !897, line: 597, baseType: !1082, size: 64, align: 64, offset: 1280)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1090, file: !897, line: 598, baseType: !24, size: 32, align: 32, offset: 1344)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1090, file: !897, line: 608, baseType: !1012, size: 64, align: 64, offset: 1408)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1090, file: !897, line: 617, baseType: !1227, size: 64, align: 64, offset: 1472)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{null, !1015}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1090, file: !897, line: 623, baseType: !1231, size: 64, align: 64, offset: 1536)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!923, !1015, !1234}
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !926, file: !897, line: 1365, baseType: !942, size: 64, align: 64, offset: 192)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !926, file: !897, line: 1379, baseType: !1238, size: 64, align: 64, offset: 256)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1241)
!1241 = !{!1242, !1243, !1244, !1245, !1246, !1247, !1248, !1252, !1253, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1269, !1270, !1274, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1292, !1293, !1294, !1295, !1299, !1300, !1301}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1240, file: !628, line: 174, baseType: !929, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1240, file: !628, line: 226, baseType: !1007, size: 64, align: 64, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1240, file: !628, line: 227, baseType: !923, size: 32, align: 32, offset: 128)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1240, file: !628, line: 228, baseType: !1007, size: 64, align: 64, offset: 192)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1240, file: !628, line: 229, baseType: !1007, size: 64, align: 64, offset: 256)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1240, file: !628, line: 233, baseType: !942, size: 64, align: 64, offset: 320)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1240, file: !628, line: 235, baseType: !1249, size: 64, align: 64, offset: 384)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!923, !942, !1035, !923}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1240, file: !628, line: 236, baseType: !1249, size: 64, align: 64, offset: 448)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1240, file: !628, line: 237, baseType: !1254, size: 64, align: 64, offset: 512)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!1040, !942, !1040, !923}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1240, file: !628, line: 238, baseType: !1040, size: 64, align: 64, offset: 576)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1240, file: !628, line: 239, baseType: !923, size: 32, align: 32, offset: 640)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1240, file: !628, line: 240, baseType: !923, size: 32, align: 32, offset: 672)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1240, file: !628, line: 241, baseType: !923, size: 32, align: 32, offset: 704)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1240, file: !628, line: 242, baseType: !1125, size: 64, align: 64, offset: 768)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1240, file: !628, line: 243, baseType: !1007, size: 64, align: 64, offset: 832)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1240, file: !628, line: 244, baseType: !1264, size: 64, align: 64, offset: 896)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!1125, !1125, !1267, !991}
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1240, file: !628, line: 245, baseType: !923, size: 32, align: 32, offset: 960)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1240, file: !628, line: 249, baseType: !1271, size: 64, align: 64, offset: 1024)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!923, !942, !923}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1240, file: !628, line: 255, baseType: !1275, size: 64, align: 64, offset: 1088)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!1040, !942, !923, !1040, !923}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1240, file: !628, line: 260, baseType: !923, size: 32, align: 32, offset: 1152)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1240, file: !628, line: 266, baseType: !1040, size: 64, align: 64, offset: 1216)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1240, file: !628, line: 273, baseType: !923, size: 32, align: 32, offset: 1280)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1240, file: !628, line: 279, baseType: !1040, size: 64, align: 64, offset: 1344)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1240, file: !628, line: 285, baseType: !923, size: 32, align: 32, offset: 1408)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1240, file: !628, line: 291, baseType: !923, size: 32, align: 32, offset: 1440)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1240, file: !628, line: 298, baseType: !923, size: 32, align: 32, offset: 1472)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1240, file: !628, line: 304, baseType: !923, size: 32, align: 32, offset: 1504)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1240, file: !628, line: 309, baseType: !935, size: 64, align: 64, offset: 1536)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1240, file: !628, line: 314, baseType: !935, size: 64, align: 64, offset: 1600)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1240, file: !628, line: 319, baseType: !1289, size: 64, align: 64, offset: 1664)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!923, !942, !1035, !923, !627, !1040}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1240, file: !628, line: 326, baseType: !923, size: 32, align: 32, offset: 1728)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1240, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1240, file: !628, line: 332, baseType: !1040, size: 64, align: 64, offset: 1792)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1240, file: !628, line: 338, baseType: !1296, size: 64, align: 64, offset: 1856)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!923, !942}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1240, file: !628, line: 340, baseType: !1040, size: 64, align: 64, offset: 1920)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1240, file: !628, line: 346, baseType: !1007, size: 64, align: 64, offset: 1984)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1240, file: !628, line: 351, baseType: !923, size: 32, align: 32, offset: 2048)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !926, file: !897, line: 1386, baseType: !923, size: 32, align: 32, offset: 320)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !926, file: !897, line: 1393, baseType: !991, size: 32, align: 32, offset: 352)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !926, file: !897, line: 1405, baseType: !1305, size: 64, align: 64, offset: 384)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1308)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1309)
!1309 = !{!1310, !1311, !1312, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1783, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1884, !1890, !1891, !1895, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1927, !1928, !1929, !1930, !1931, !1932}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1308, file: !897, line: 866, baseType: !923, size: 32, align: 32)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1308, file: !897, line: 872, baseType: !923, size: 32, align: 32, offset: 32)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1308, file: !897, line: 878, baseType: !1313, size: 64, align: 64, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !25, line: 3360, baseType: !1315)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !25, line: 1556, size: 8448, align: 64, elements: !1316)
!1316 = !{!1317, !1318, !1319, !1320, !1458, !1459, !1460, !1461, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1487, !1491, !1492, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1671, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1315, file: !25, line: 1561, baseType: !929, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1315, file: !25, line: 1562, baseType: !923, size: 32, align: 32, offset: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1315, file: !25, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1315, file: !25, line: 1565, baseType: !1321, size: 64, align: 64, offset: 128)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1323)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !25, line: 3468, size: 1984, align: 64, elements: !1324)
!1324 = !{!1325, !1326, !1327, !1328, !1329, !1330, !1333, !1336, !1339, !1342, !1345, !1346, !1347, !1355, !1356, !1357, !1359, !1363, !1369, !1374, !1378, !1379, !1423, !1430, !1434, !1435, !1439, !1443, !1447, !1451, !1452, !1453}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1323, file: !25, line: 3475, baseType: !935, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1323, file: !25, line: 3480, baseType: !935, size: 64, align: 64, offset: 64)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1323, file: !25, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1323, file: !25, line: 3482, baseType: !24, size: 32, align: 32, offset: 160)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1323, file: !25, line: 3487, baseType: !923, size: 32, align: 32, offset: 192)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1323, file: !25, line: 3488, baseType: !1331, size: 64, align: 64, offset: 256)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1150)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1323, file: !25, line: 3489, baseType: !1334, size: 64, align: 64, offset: 320)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1323, file: !25, line: 3490, baseType: !1337, size: 64, align: 64, offset: 384)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1323, file: !25, line: 3491, baseType: !1340, size: 64, align: 64, offset: 448)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1323, file: !25, line: 3492, baseType: !1343, size: 64, align: 64, offset: 512)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1165)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1323, file: !25, line: 3493, baseType: !1036, size: 8, align: 8, offset: 576)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1323, file: !25, line: 3494, baseType: !929, size: 64, align: 64, offset: 640)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1323, file: !25, line: 3495, baseType: !1348, size: 64, align: 64, offset: 704)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1350)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !25, line: 3404, baseType: !1351)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !25, line: 3401, size: 128, align: 64, elements: !1352)
!1352 = !{!1353, !1354}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1351, file: !25, line: 3402, baseType: !923, size: 32, align: 32)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1351, file: !25, line: 3403, baseType: !935, size: 64, align: 64, offset: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1323, file: !25, line: 3507, baseType: !935, size: 64, align: 64, offset: 768)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1323, file: !25, line: 3516, baseType: !923, size: 32, align: 32, offset: 832)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1323, file: !25, line: 3517, baseType: !1358, size: 64, align: 64, offset: 896)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1323, file: !25, line: 3527, baseType: !1360, size: 64, align: 64, offset: 960)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{!923, !1313}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1323, file: !25, line: 3535, baseType: !1364, size: 64, align: 64, offset: 1024)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DISubroutineType(types: !1366)
!1366 = !{!923, !1313, !1367}
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1314)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1323, file: !25, line: 3541, baseType: !1370, size: 64, align: 64, offset: 1088)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1372)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !25, line: 3461, baseType: !1373)
!1373 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !25, line: 3461, flags: DIFlagFwdDecl)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1323, file: !25, line: 3549, baseType: !1375, size: 64, align: 64, offset: 1152)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DISubroutineType(types: !1377)
!1377 = !{null, !1358}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1323, file: !25, line: 3551, baseType: !1360, size: 64, align: 64, offset: 1216)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1323, file: !25, line: 3552, baseType: !1380, size: 64, align: 64, offset: 1280)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DISubroutineType(types: !1382)
!1382 = !{!923, !1313, !1035, !923, !1383}
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1385)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !25, line: 3920, size: 256, align: 64, elements: !1386)
!1386 = !{!1387, !1390, !1392, !1393, !1394, !1422}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1385, file: !25, line: 3921, baseType: !1388, size: 16, align: 16)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1037, line: 49, baseType: !1389)
!1389 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1385, file: !25, line: 3922, baseType: !1391, size: 32, align: 32, offset: 32)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1037, line: 51, baseType: !991)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1385, file: !25, line: 3923, baseType: !1391, size: 32, align: 32, offset: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1385, file: !25, line: 3924, baseType: !991, size: 32, align: 32, offset: 96)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1385, file: !25, line: 3925, baseType: !1395, size: 64, align: 64, offset: 128)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !25, line: 3918, baseType: !1398)
!1398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !25, line: 3885, size: 1600, align: 64, elements: !1399)
!1399 = !{!1400, !1401, !1402, !1403, !1404, !1405, !1411, !1415, !1417, !1418, !1420, !1421}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1398, file: !25, line: 3886, baseType: !923, size: 32, align: 32)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1398, file: !25, line: 3887, baseType: !923, size: 32, align: 32, offset: 32)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1398, file: !25, line: 3888, baseType: !923, size: 32, align: 32, offset: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1398, file: !25, line: 3889, baseType: !923, size: 32, align: 32, offset: 96)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1398, file: !25, line: 3890, baseType: !923, size: 32, align: 32, offset: 128)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1398, file: !25, line: 3897, baseType: !1406, size: 768, align: 64, offset: 192)
!1406 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !25, line: 3858, baseType: !1407)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !25, line: 3853, size: 768, align: 64, elements: !1408)
!1408 = !{!1409, !1410}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1407, file: !25, line: 3855, baseType: !1136, size: 512, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1407, file: !25, line: 3857, baseType: !1140, size: 256, align: 32, offset: 512)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1398, file: !25, line: 3903, baseType: !1412, size: 256, align: 64, offset: 960)
!1412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1035, size: 256, align: 64, elements: !1413)
!1413 = !{!1414}
!1414 = !DISubrange(count: 4)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1398, file: !25, line: 3904, baseType: !1416, size: 128, align: 32, offset: 1216)
!1416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 128, align: 32, elements: !1413)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1398, file: !25, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1398, file: !25, line: 3908, baseType: !1419, size: 64, align: 64, offset: 1408)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1398, file: !25, line: 3915, baseType: !1419, size: 64, align: 64, offset: 1472)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1398, file: !25, line: 3917, baseType: !923, size: 32, align: 32, offset: 1536)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1385, file: !25, line: 3926, baseType: !1040, size: 64, align: 64, offset: 192)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1323, file: !25, line: 3564, baseType: !1424, size: 64, align: 64, offset: 1344)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DISubroutineType(types: !1426)
!1426 = !{!923, !1313, !1020, !1427, !1429}
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1132)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1323, file: !25, line: 3566, baseType: !1431, size: 64, align: 64, offset: 1408)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{!923, !1313, !942, !1429, !1020}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1323, file: !25, line: 3567, baseType: !1360, size: 64, align: 64, offset: 1472)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1323, file: !25, line: 3576, baseType: !1436, size: 64, align: 64, offset: 1536)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DISubroutineType(types: !1438)
!1438 = !{!923, !1313, !1427}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1323, file: !25, line: 3577, baseType: !1440, size: 64, align: 64, offset: 1600)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{!923, !1313, !1020}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1323, file: !25, line: 3584, baseType: !1444, size: 64, align: 64, offset: 1664)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DISubroutineType(types: !1446)
!1446 = !{!923, !1313, !1131}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1323, file: !25, line: 3589, baseType: !1448, size: 64, align: 64, offset: 1728)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{null, !1313}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1323, file: !25, line: 3594, baseType: !923, size: 32, align: 32, offset: 1792)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1323, file: !25, line: 3600, baseType: !935, size: 64, align: 64, offset: 1856)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1323, file: !25, line: 3609, baseType: !1454, size: 64, align: 64, offset: 1920)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1457)
!1457 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !25, line: 3609, flags: DIFlagFwdDecl)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1315, file: !25, line: 1566, baseType: !24, size: 32, align: 32, offset: 192)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1315, file: !25, line: 1581, baseType: !991, size: 32, align: 32, offset: 224)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1315, file: !25, line: 1583, baseType: !942, size: 64, align: 64, offset: 256)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1315, file: !25, line: 1591, baseType: !1462, size: 64, align: 64, offset: 320)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !25, line: 1532, flags: DIFlagFwdDecl)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1315, file: !25, line: 1598, baseType: !942, size: 64, align: 64, offset: 384)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1315, file: !25, line: 1606, baseType: !1040, size: 64, align: 64, offset: 448)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1315, file: !25, line: 1614, baseType: !923, size: 32, align: 32, offset: 512)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1315, file: !25, line: 1622, baseType: !923, size: 32, align: 32, offset: 544)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1315, file: !25, line: 1628, baseType: !923, size: 32, align: 32, offset: 576)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1315, file: !25, line: 1636, baseType: !923, size: 32, align: 32, offset: 608)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1315, file: !25, line: 1643, baseType: !923, size: 32, align: 32, offset: 640)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1315, file: !25, line: 1657, baseType: !1035, size: 64, align: 64, offset: 704)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1315, file: !25, line: 1658, baseType: !923, size: 32, align: 32, offset: 768)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1315, file: !25, line: 1679, baseType: !1150, size: 64, align: 32, offset: 800)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1315, file: !25, line: 1688, baseType: !923, size: 32, align: 32, offset: 864)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1315, file: !25, line: 1712, baseType: !923, size: 32, align: 32, offset: 896)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1315, file: !25, line: 1729, baseType: !923, size: 32, align: 32, offset: 928)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1315, file: !25, line: 1729, baseType: !923, size: 32, align: 32, offset: 960)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1315, file: !25, line: 1744, baseType: !923, size: 32, align: 32, offset: 992)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1315, file: !25, line: 1744, baseType: !923, size: 32, align: 32, offset: 1024)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1315, file: !25, line: 1751, baseType: !923, size: 32, align: 32, offset: 1056)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1315, file: !25, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1315, file: !25, line: 1791, baseType: !1483, size: 64, align: 64, offset: 1152)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DISubroutineType(types: !1485)
!1485 = !{null, !1486, !1427, !1429, !923, !923, !923}
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1315, file: !25, line: 1808, baseType: !1488, size: 64, align: 64, offset: 1216)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!645, !1486, !1334}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1315, file: !25, line: 1816, baseType: !923, size: 32, align: 32, offset: 1280)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1315, file: !25, line: 1825, baseType: !1493, size: 32, align: 32, offset: 1312)
!1493 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1315, file: !25, line: 1830, baseType: !923, size: 32, align: 32, offset: 1344)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1315, file: !25, line: 1838, baseType: !1493, size: 32, align: 32, offset: 1376)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1315, file: !25, line: 1846, baseType: !923, size: 32, align: 32, offset: 1408)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1315, file: !25, line: 1851, baseType: !923, size: 32, align: 32, offset: 1440)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1315, file: !25, line: 1861, baseType: !1493, size: 32, align: 32, offset: 1472)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1315, file: !25, line: 1868, baseType: !1493, size: 32, align: 32, offset: 1504)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1315, file: !25, line: 1875, baseType: !1493, size: 32, align: 32, offset: 1536)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1315, file: !25, line: 1882, baseType: !1493, size: 32, align: 32, offset: 1568)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1315, file: !25, line: 1889, baseType: !1493, size: 32, align: 32, offset: 1600)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1315, file: !25, line: 1896, baseType: !1493, size: 32, align: 32, offset: 1632)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1315, file: !25, line: 1903, baseType: !1493, size: 32, align: 32, offset: 1664)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1315, file: !25, line: 1910, baseType: !923, size: 32, align: 32, offset: 1696)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1315, file: !25, line: 1915, baseType: !923, size: 32, align: 32, offset: 1728)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1315, file: !25, line: 1926, baseType: !1429, size: 64, align: 64, offset: 1792)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1315, file: !25, line: 1935, baseType: !1150, size: 64, align: 32, offset: 1856)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1315, file: !25, line: 1942, baseType: !923, size: 32, align: 32, offset: 1920)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1315, file: !25, line: 1948, baseType: !923, size: 32, align: 32, offset: 1952)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1315, file: !25, line: 1954, baseType: !923, size: 32, align: 32, offset: 1984)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1315, file: !25, line: 1960, baseType: !923, size: 32, align: 32, offset: 2016)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1315, file: !25, line: 1984, baseType: !923, size: 32, align: 32, offset: 2048)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1315, file: !25, line: 1991, baseType: !923, size: 32, align: 32, offset: 2080)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1315, file: !25, line: 1996, baseType: !923, size: 32, align: 32, offset: 2112)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1315, file: !25, line: 2004, baseType: !923, size: 32, align: 32, offset: 2144)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1315, file: !25, line: 2011, baseType: !923, size: 32, align: 32, offset: 2176)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1315, file: !25, line: 2018, baseType: !923, size: 32, align: 32, offset: 2208)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1315, file: !25, line: 2027, baseType: !923, size: 32, align: 32, offset: 2240)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1315, file: !25, line: 2034, baseType: !923, size: 32, align: 32, offset: 2272)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1315, file: !25, line: 2044, baseType: !923, size: 32, align: 32, offset: 2304)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1315, file: !25, line: 2054, baseType: !1523, size: 64, align: 64, offset: 2368)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1315, file: !25, line: 2061, baseType: !1523, size: 64, align: 64, offset: 2432)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1315, file: !25, line: 2066, baseType: !923, size: 32, align: 32, offset: 2496)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1315, file: !25, line: 2070, baseType: !923, size: 32, align: 32, offset: 2528)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1315, file: !25, line: 2078, baseType: !923, size: 32, align: 32, offset: 2560)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1315, file: !25, line: 2085, baseType: !923, size: 32, align: 32, offset: 2592)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1315, file: !25, line: 2092, baseType: !923, size: 32, align: 32, offset: 2624)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1315, file: !25, line: 2099, baseType: !923, size: 32, align: 32, offset: 2656)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1315, file: !25, line: 2106, baseType: !923, size: 32, align: 32, offset: 2688)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1315, file: !25, line: 2113, baseType: !923, size: 32, align: 32, offset: 2720)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1315, file: !25, line: 2120, baseType: !923, size: 32, align: 32, offset: 2752)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1315, file: !25, line: 2125, baseType: !923, size: 32, align: 32, offset: 2784)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1315, file: !25, line: 2133, baseType: !923, size: 32, align: 32, offset: 2816)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1315, file: !25, line: 2140, baseType: !923, size: 32, align: 32, offset: 2848)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1315, file: !25, line: 2145, baseType: !923, size: 32, align: 32, offset: 2880)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1315, file: !25, line: 2153, baseType: !923, size: 32, align: 32, offset: 2912)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1315, file: !25, line: 2158, baseType: !923, size: 32, align: 32, offset: 2944)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1315, file: !25, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1315, file: !25, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1315, file: !25, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1315, file: !25, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1315, file: !25, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1315, file: !25, line: 2203, baseType: !923, size: 32, align: 32, offset: 3136)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1315, file: !25, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1315, file: !25, line: 2212, baseType: !923, size: 32, align: 32, offset: 3200)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1315, file: !25, line: 2213, baseType: !923, size: 32, align: 32, offset: 3232)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1315, file: !25, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1315, file: !25, line: 2232, baseType: !923, size: 32, align: 32, offset: 3296)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1315, file: !25, line: 2243, baseType: !923, size: 32, align: 32, offset: 3328)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1315, file: !25, line: 2249, baseType: !923, size: 32, align: 32, offset: 3360)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1315, file: !25, line: 2256, baseType: !923, size: 32, align: 32, offset: 3392)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1315, file: !25, line: 2263, baseType: !1165, size: 64, align: 64, offset: 3456)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1315, file: !25, line: 2270, baseType: !1165, size: 64, align: 64, offset: 3520)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1315, file: !25, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1315, file: !25, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1315, file: !25, line: 2367, baseType: !1559, size: 64, align: 64, offset: 3648)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64, align: 64)
!1560 = !DISubroutineType(types: !1561)
!1561 = !{!923, !1486, !1131, !923}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1315, file: !25, line: 2383, baseType: !923, size: 32, align: 32, offset: 3712)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1315, file: !25, line: 2386, baseType: !1493, size: 32, align: 32, offset: 3744)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1315, file: !25, line: 2387, baseType: !1493, size: 32, align: 32, offset: 3776)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1315, file: !25, line: 2394, baseType: !923, size: 32, align: 32, offset: 3808)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1315, file: !25, line: 2401, baseType: !923, size: 32, align: 32, offset: 3840)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1315, file: !25, line: 2408, baseType: !923, size: 32, align: 32, offset: 3872)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1315, file: !25, line: 2415, baseType: !923, size: 32, align: 32, offset: 3904)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1315, file: !25, line: 2422, baseType: !923, size: 32, align: 32, offset: 3936)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1315, file: !25, line: 2423, baseType: !1571, size: 64, align: 64, offset: 3968)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !25, line: 831, baseType: !1573)
!1573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !25, line: 826, size: 128, align: 32, elements: !1574)
!1574 = !{!1575, !1576, !1577, !1578}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1573, file: !25, line: 827, baseType: !923, size: 32, align: 32)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1573, file: !25, line: 828, baseType: !923, size: 32, align: 32, offset: 32)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1573, file: !25, line: 829, baseType: !923, size: 32, align: 32, offset: 64)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1573, file: !25, line: 830, baseType: !1493, size: 32, align: 32, offset: 96)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1315, file: !25, line: 2430, baseType: !1040, size: 64, align: 64, offset: 4032)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1315, file: !25, line: 2437, baseType: !1040, size: 64, align: 64, offset: 4096)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1315, file: !25, line: 2444, baseType: !1493, size: 32, align: 32, offset: 4160)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1315, file: !25, line: 2451, baseType: !1493, size: 32, align: 32, offset: 4192)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1315, file: !25, line: 2458, baseType: !923, size: 32, align: 32, offset: 4224)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1315, file: !25, line: 2469, baseType: !923, size: 32, align: 32, offset: 4256)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1315, file: !25, line: 2475, baseType: !923, size: 32, align: 32, offset: 4288)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1315, file: !25, line: 2481, baseType: !923, size: 32, align: 32, offset: 4320)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1315, file: !25, line: 2485, baseType: !923, size: 32, align: 32, offset: 4352)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1315, file: !25, line: 2489, baseType: !923, size: 32, align: 32, offset: 4384)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1315, file: !25, line: 2493, baseType: !923, size: 32, align: 32, offset: 4416)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1315, file: !25, line: 2501, baseType: !923, size: 32, align: 32, offset: 4448)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1315, file: !25, line: 2506, baseType: !923, size: 32, align: 32, offset: 4480)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1315, file: !25, line: 2510, baseType: !923, size: 32, align: 32, offset: 4512)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1315, file: !25, line: 2514, baseType: !1040, size: 64, align: 64, offset: 4544)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1315, file: !25, line: 2528, baseType: !1595, size: 64, align: 64, offset: 4608)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64, align: 64)
!1596 = !DISubroutineType(types: !1597)
!1597 = !{null, !1486, !942, !923, !923}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1315, file: !25, line: 2534, baseType: !923, size: 32, align: 32, offset: 4672)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1315, file: !25, line: 2545, baseType: !923, size: 32, align: 32, offset: 4704)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1315, file: !25, line: 2547, baseType: !923, size: 32, align: 32, offset: 4736)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1315, file: !25, line: 2549, baseType: !923, size: 32, align: 32, offset: 4768)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1315, file: !25, line: 2551, baseType: !923, size: 32, align: 32, offset: 4800)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1315, file: !25, line: 2553, baseType: !923, size: 32, align: 32, offset: 4832)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1315, file: !25, line: 2555, baseType: !923, size: 32, align: 32, offset: 4864)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1315, file: !25, line: 2557, baseType: !923, size: 32, align: 32, offset: 4896)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1315, file: !25, line: 2559, baseType: !923, size: 32, align: 32, offset: 4928)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1315, file: !25, line: 2563, baseType: !923, size: 32, align: 32, offset: 4960)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1315, file: !25, line: 2571, baseType: !1419, size: 64, align: 64, offset: 4992)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1315, file: !25, line: 2579, baseType: !1419, size: 64, align: 64, offset: 5056)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1315, file: !25, line: 2586, baseType: !923, size: 32, align: 32, offset: 5120)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1315, file: !25, line: 2615, baseType: !923, size: 32, align: 32, offset: 5152)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1315, file: !25, line: 2627, baseType: !923, size: 32, align: 32, offset: 5184)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1315, file: !25, line: 2637, baseType: !923, size: 32, align: 32, offset: 5216)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1315, file: !25, line: 2681, baseType: !923, size: 32, align: 32, offset: 5248)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1315, file: !25, line: 2709, baseType: !1040, size: 64, align: 64, offset: 5312)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1315, file: !25, line: 2716, baseType: !1617, size: 64, align: 64, offset: 5376)
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64, align: 64)
!1618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1619)
!1619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !25, line: 3636, size: 896, align: 64, elements: !1620)
!1620 = !{!1621, !1622, !1623, !1624, !1625, !1626, !1627, !1631, !1635, !1636, !1637, !1638, !1644, !1645, !1646, !1647, !1648}
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1619, file: !25, line: 3642, baseType: !935, size: 64, align: 64)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1619, file: !25, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1619, file: !25, line: 3656, baseType: !24, size: 32, align: 32, offset: 96)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1619, file: !25, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1619, file: !25, line: 3669, baseType: !923, size: 32, align: 32, offset: 160)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1619, file: !25, line: 3682, baseType: !1444, size: 64, align: 64, offset: 192)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1619, file: !25, line: 3698, baseType: !1628, size: 64, align: 64, offset: 256)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DISubroutineType(types: !1630)
!1630 = !{!923, !1313, !1267, !1391}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1619, file: !25, line: 3712, baseType: !1632, size: 64, align: 64, offset: 320)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{!923, !1313, !923, !1267, !1391}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1619, file: !25, line: 3726, baseType: !1628, size: 64, align: 64, offset: 384)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1619, file: !25, line: 3737, baseType: !1360, size: 64, align: 64, offset: 448)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1619, file: !25, line: 3746, baseType: !923, size: 32, align: 32, offset: 512)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1619, file: !25, line: 3757, baseType: !1639, size: 64, align: 64, offset: 576)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{null, !1642}
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !25, line: 3617, flags: DIFlagFwdDecl)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1619, file: !25, line: 3766, baseType: !1360, size: 64, align: 64, offset: 640)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1619, file: !25, line: 3774, baseType: !1360, size: 64, align: 64, offset: 704)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1619, file: !25, line: 3780, baseType: !923, size: 32, align: 32, offset: 768)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1619, file: !25, line: 3785, baseType: !923, size: 32, align: 32, offset: 800)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1619, file: !25, line: 3795, baseType: !1649, size: 64, align: 64, offset: 832)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DISubroutineType(types: !1651)
!1651 = !{!923, !1313, !1025}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1315, file: !25, line: 2728, baseType: !942, size: 64, align: 64, offset: 5440)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1315, file: !25, line: 2735, baseType: !1164, size: 512, align: 64, offset: 5504)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1315, file: !25, line: 2742, baseType: !923, size: 32, align: 32, offset: 6016)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1315, file: !25, line: 2755, baseType: !923, size: 32, align: 32, offset: 6048)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1315, file: !25, line: 2776, baseType: !923, size: 32, align: 32, offset: 6080)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1315, file: !25, line: 2783, baseType: !923, size: 32, align: 32, offset: 6112)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1315, file: !25, line: 2791, baseType: !923, size: 32, align: 32, offset: 6144)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1315, file: !25, line: 2802, baseType: !1131, size: 64, align: 64, offset: 6208)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1315, file: !25, line: 2811, baseType: !923, size: 32, align: 32, offset: 6272)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1315, file: !25, line: 2821, baseType: !923, size: 32, align: 32, offset: 6304)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1315, file: !25, line: 2830, baseType: !923, size: 32, align: 32, offset: 6336)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1315, file: !25, line: 2840, baseType: !923, size: 32, align: 32, offset: 6368)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1315, file: !25, line: 2851, baseType: !1665, size: 64, align: 64, offset: 6400)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DISubroutineType(types: !1667)
!1667 = !{!923, !1486, !1668, !942, !1429, !923, !923}
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{!923, !1486, !942}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1315, file: !25, line: 2871, baseType: !1672, size: 64, align: 64, offset: 6464)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{!923, !1486, !1675, !942, !1429, !923}
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DISubroutineType(types: !1677)
!1677 = !{!923, !1486, !942, !923, !923}
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1315, file: !25, line: 2878, baseType: !923, size: 32, align: 32, offset: 6528)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1315, file: !25, line: 2885, baseType: !923, size: 32, align: 32, offset: 6560)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1315, file: !25, line: 3005, baseType: !923, size: 32, align: 32, offset: 6592)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1315, file: !25, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1315, file: !25, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1315, file: !25, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1315, file: !25, line: 3037, baseType: !1035, size: 64, align: 64, offset: 6720)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1315, file: !25, line: 3038, baseType: !923, size: 32, align: 32, offset: 6784)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1315, file: !25, line: 3050, baseType: !1165, size: 64, align: 64, offset: 6848)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1315, file: !25, line: 3065, baseType: !923, size: 32, align: 32, offset: 6912)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1315, file: !25, line: 3083, baseType: !923, size: 32, align: 32, offset: 6944)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1315, file: !25, line: 3092, baseType: !1150, size: 64, align: 32, offset: 6976)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1315, file: !25, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1315, file: !25, line: 3106, baseType: !1150, size: 64, align: 32, offset: 7072)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1315, file: !25, line: 3113, baseType: !1693, size: 64, align: 64, offset: 7168)
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1695)
!1695 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !25, line: 740, baseType: !1696)
!1696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !25, line: 712, size: 384, align: 64, elements: !1697)
