; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--file.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--file.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }

!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!6 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!7 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!8 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!9 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!10 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!11 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!12 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!13 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!14 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!15 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!16 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!17 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!18 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!19 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!20 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!21 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!22 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!23 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!24 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 29, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!28 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!29 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!30 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!31 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!32 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!33 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!34 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!35 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!36 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!37 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!38 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!39 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!40 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!41 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!42 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!43 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!44 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!45 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVIODirEntryType", file: !47, line: 66, size: 32, align: 32, elements: !48)
!47 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59}
!49 = !DIEnumerator(name: "AVIO_ENTRY_UNKNOWN", value: 0)
!50 = !DIEnumerator(name: "AVIO_ENTRY_BLOCK_DEVICE", value: 1)
!51 = !DIEnumerator(name: "AVIO_ENTRY_CHARACTER_DEVICE", value: 2)
!52 = !DIEnumerator(name: "AVIO_ENTRY_DIRECTORY", value: 3)
!53 = !DIEnumerator(name: "AVIO_ENTRY_NAMED_PIPE", value: 4)
!54 = !DIEnumerator(name: "AVIO_ENTRY_SYMBOLIC_LINK", value: 5)
!55 = !DIEnumerator(name: "AVIO_ENTRY_SOCKET", value: 6)
!56 = !DIEnumerator(name: "AVIO_ENTRY_FILE", value: 7)
!57 = !DIEnumerator(name: "AVIO_ENTRY_SERVER", value: 8)
!58 = !DIEnumerator(name: "AVIO_ENTRY_SHARE", value: 9)
!59 = !DIEnumerator(name: "AVIO_ENTRY_WORKGROUP", value: 10)
!60 = !{!61, !62}
!61 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!62 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!63 = !{!64, !272, !273, !274, !280, !281}
!64 = distinct !DIGlobalVariable(name: "ff_file_protocol", scope: !0, file: !65, line: 351, type: !66, isLocal: false, isDefinition: true, variable: { i8*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }* @ff_file_protocol)
!65 = !DIFile(filename: "libavformat/file.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !68, line: 100, baseType: !69)
!68 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !68, line: 54, size: 1600, align: 64, elements: !70)
!70 = !{!71, !75, !189, !198, !203, !207, !213, !219, !223, !224, !228, !232, !233, !239, !240, !241, !242, !243, !244, !245, !246, !265, !266, !267, !271}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !69, file: !68, line: 55, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!74 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !69, file: !68, line: 56, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!61, !79, !72, !61}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !68, line: 52, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !68, line: 38, size: 768, align: 64, elements: !82)
!82 = !{!83, !166, !169, !170, !172, !173, !174, !175, !176, !185, !186, !187, !188}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !81, file: !68, line: 39, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !88)
!88 = !{!89, !90, !95, !125, !126, !127, !128, !132, !138, !140, !144}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !87, file: !26, line: 72, baseType: !72, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !87, file: !26, line: 78, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!72, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !87, file: !26, line: 85, baseType: !96, size: 64, align: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !121, !122, !123, !124}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !98, file: !4, line: 247, baseType: !72, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !98, file: !4, line: 253, baseType: !72, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !98, file: !4, line: 259, baseType: !61, size: 32, align: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !98, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !98, file: !4, line: 271, baseType: !105, size: 64, align: 64, offset: 192)
!105 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !98, file: !4, line: 265, size: 64, align: 64, elements: !106)
!106 = !{!107, !111, !113, !114}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !105, file: !4, line: 266, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !109, line: 40, baseType: !110)
!109 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!110 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !105, file: !4, line: 267, baseType: !112, size: 64, align: 64)
!112 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !105, file: !4, line: 268, baseType: !72, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !105, file: !4, line: 270, baseType: !115, size: 64, align: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !116, line: 61, baseType: !117)
!116 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !116, line: 58, size: 64, align: 32, elements: !118)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !117, file: !116, line: 59, baseType: !61, size: 32, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !117, file: !116, line: 60, baseType: !61, size: 32, align: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !98, file: !4, line: 272, baseType: !112, size: 64, align: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !98, file: !4, line: 273, baseType: !112, size: 64, align: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !98, file: !4, line: 275, baseType: !61, size: 32, align: 32, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !98, file: !4, line: 300, baseType: !72, size: 64, align: 64, offset: 448)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !87, file: !26, line: 93, baseType: !61, size: 32, align: 32, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !87, file: !26, line: 99, baseType: !61, size: 32, align: 32, offset: 224)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !87, file: !26, line: 108, baseType: !61, size: 32, align: 32, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !87, file: !26, line: 113, baseType: !129, size: 64, align: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!94, !94, !94}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !87, file: !26, line: 123, baseType: !133, size: 64, align: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !87, file: !26, line: 130, baseType: !139, size: 32, align: 32, offset: 448)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !87, file: !26, line: 136, baseType: !141, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!139, !94}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !87, file: !26, line: 142, baseType: !145, size: 64, align: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!61, !148, !94, !72, !61}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !151)
!151 = !{!152, !164, !165}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !150, file: !4, line: 360, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !157)
!157 = !{!158, !159, !160, !161, !162, !163}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !156, file: !4, line: 307, baseType: !72, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !156, file: !4, line: 313, baseType: !112, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !156, file: !4, line: 313, baseType: !112, size: 64, align: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !156, file: !4, line: 318, baseType: !112, size: 64, align: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !156, file: !4, line: 318, baseType: !112, size: 64, align: 64, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !156, file: !4, line: 323, baseType: !61, size: 32, align: 32, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !150, file: !4, line: 364, baseType: !61, size: 32, align: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !150, file: !4, line: 368, baseType: !61, size: 32, align: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !81, file: !68, line: 40, baseType: !167, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !81, file: !68, line: 41, baseType: !94, size: 64, align: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !81, file: !68, line: 42, baseType: !171, size: 64, align: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !81, file: !68, line: 43, baseType: !61, size: 32, align: 32, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !81, file: !68, line: 44, baseType: !61, size: 32, align: 32, offset: 288)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !81, file: !68, line: 45, baseType: !61, size: 32, align: 32, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !81, file: !68, line: 46, baseType: !61, size: 32, align: 32, offset: 352)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !81, file: !68, line: 47, baseType: !177, size: 128, align: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !47, line: 61, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !47, line: 58, size: 128, align: 64, elements: !179)
!179 = !{!180, !184}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !178, file: !47, line: 59, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!61, !94}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !178, file: !47, line: 60, baseType: !94, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !81, file: !68, line: 48, baseType: !108, size: 64, align: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !81, file: !68, line: 49, baseType: !72, size: 64, align: 64, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !81, file: !68, line: 50, baseType: !72, size: 64, align: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !81, file: !68, line: 51, baseType: !61, size: 32, align: 32, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !69, file: !68, line: 62, baseType: !190, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!61, !79, !72, !61, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !196, line: 86, baseType: !197)
!196 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !196, line: 86, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !69, file: !68, line: 63, baseType: !199, size: 64, align: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!61, !79, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !69, file: !68, line: 64, baseType: !204, size: 64, align: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!61, !79}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !69, file: !68, line: 78, baseType: !208, size: 64, align: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!61, !79, !211, !61}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !69, file: !68, line: 79, baseType: !214, size: 64, align: 64, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!61, !79, !217, !61}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !212)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !69, file: !68, line: 80, baseType: !220, size: 64, align: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!108, !79, !108, !61}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !69, file: !68, line: 81, baseType: !204, size: 64, align: 64, offset: 512)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !69, file: !68, line: 82, baseType: !225, size: 64, align: 64, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!61, !79, !61}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !69, file: !68, line: 83, baseType: !229, size: 64, align: 64, offset: 640)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!108, !79, !61, !108, !61}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !69, file: !68, line: 85, baseType: !204, size: 64, align: 64, offset: 704)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !69, file: !68, line: 86, baseType: !234, size: 64, align: 64, offset: 768)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!61, !79, !237, !238}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !69, file: !68, line: 88, baseType: !204, size: 64, align: 64, offset: 832)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !69, file: !68, line: 89, baseType: !225, size: 64, align: 64, offset: 896)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !69, file: !68, line: 90, baseType: !61, size: 32, align: 32, offset: 960)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !69, file: !68, line: 91, baseType: !84, size: 64, align: 64, offset: 1024)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !69, file: !68, line: 92, baseType: !61, size: 32, align: 32, offset: 1088)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !69, file: !68, line: 93, baseType: !225, size: 64, align: 64, offset: 1152)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !69, file: !68, line: 94, baseType: !204, size: 64, align: 64, offset: 1216)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !69, file: !68, line: 95, baseType: !247, size: 64, align: 64, offset: 1280)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!61, !79, !250}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !47, line: 101, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !47, line: 86, size: 576, align: 64, elements: !254)
!254 = !{!255, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !253, file: !47, line: 87, baseType: !171, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !253, file: !47, line: 88, baseType: !61, size: 32, align: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !253, file: !47, line: 89, baseType: !61, size: 32, align: 32, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !253, file: !47, line: 91, baseType: !108, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !253, file: !47, line: 92, baseType: !108, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !253, file: !47, line: 94, baseType: !108, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !253, file: !47, line: 96, baseType: !108, size: 64, align: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !253, file: !47, line: 98, baseType: !108, size: 64, align: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !253, file: !47, line: 99, baseType: !108, size: 64, align: 64, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !253, file: !47, line: 100, baseType: !108, size: 64, align: 64, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !69, file: !68, line: 96, baseType: !204, size: 64, align: 64, offset: 1344)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !69, file: !68, line: 97, baseType: !204, size: 64, align: 64, offset: 1408)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !69, file: !68, line: 98, baseType: !268, size: 64, align: 64, offset: 1472)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!61, !79, !79}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !69, file: !68, line: 99, baseType: !72, size: 64, align: 64, offset: 1536)
!272 = distinct !DIGlobalVariable(name: "ff_pipe_protocol", scope: !0, file: !65, line: 397, type: !66, isLocal: false, isDefinition: true, variable: { i8*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }* @ff_pipe_protocol)
!273 = distinct !DIGlobalVariable(name: "file_class", scope: !0, file: !65, line: 93, type: !85, isLocal: true, isDefinition: true, variable: %struct.AVClass* @file_class)
!274 = distinct !DIGlobalVariable(name: "file_options", scope: !0, file: !65, line: 81, type: !275, isLocal: true, isDefinition: true, variable: [4 x %struct.AVOption]* @file_options)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 2048, align: 64, elements: !278)
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !98)
!278 = !{!279}
!279 = !DISubrange(count: 4)
!280 = distinct !DIGlobalVariable(name: "pipe_class", scope: !0, file: !65, line: 100, type: !85, isLocal: true, isDefinition: true, variable: %struct.AVClass* @pipe_class)
!281 = distinct !DIGlobalVariable(name: "pipe_options", scope: !0, file: !65, line: 88, type: !282, isLocal: true, isDefinition: true, variable: [2 x %struct.AVOption]* @pipe_options)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 1024, align: 64, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 2)
!285 = !{i32 2, !"Dwarf Version", i32 4}
!286 = !{i32 2, !"Debug Info Version", i32 3}
!287 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!288 = distinct !DISubprogram(name: "file_open", scope: !65, file: !65, line: 206, type: !77, isLocal: true, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !289)
!289 = !{}
!290 = !DILocalVariable(name: "h", arg: 1, scope: !288, file: !65, line: 206, type: !79)
!291 = !DIExpression()
!292 = !DILocation(line: 206, column: 34, scope: !288)
!293 = !DILocalVariable(name: "filename", arg: 2, scope: !288, file: !65, line: 206, type: !72)
!294 = !DILocation(line: 206, column: 49, scope: !288)
!295 = !DILocalVariable(name: "flags", arg: 3, scope: !288, file: !65, line: 206, type: !61)
!296 = !DILocation(line: 206, column: 63, scope: !288)
!297 = !DILocalVariable(name: "c", scope: !288, file: !65, line: 208, type: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "FileContext", file: !65, line: 79, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileContext", file: !65, line: 70, size: 256, align: 64, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !300, file: !65, line: 71, baseType: !84, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !300, file: !65, line: 72, baseType: !61, size: 32, align: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "trunc", scope: !300, file: !65, line: 73, baseType: !61, size: 32, align: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !300, file: !65, line: 74, baseType: !61, size: 32, align: 32, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "follow", scope: !300, file: !65, line: 75, baseType: !61, size: 32, align: 32, offset: 160)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !300, file: !65, line: 77, baseType: !308, size: 64, align: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !310, line: 127, baseType: !311)
!310 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !310, line: 127, flags: DIFlagFwdDecl)
!312 = !DILocation(line: 208, column: 18, scope: !288)
!313 = !DILocation(line: 208, column: 22, scope: !288)
!314 = !DILocation(line: 208, column: 25, scope: !288)
!315 = !DILocalVariable(name: "access", scope: !288, file: !65, line: 209, type: !61)
!316 = !DILocation(line: 209, column: 9, scope: !288)
!317 = !DILocalVariable(name: "fd", scope: !288, file: !65, line: 210, type: !61)
!318 = !DILocation(line: 210, column: 9, scope: !288)
!319 = !DILocalVariable(name: "st", scope: !288, file: !65, line: 211, type: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !321, line: 46, size: 1152, align: 64, elements: !322)
!321 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!322 = !{!323, !327, !329, !331, !333, !335, !337, !338, !339, !341, !343, !345, !347, !349, !350, !351, !352, !353}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !320, file: !321, line: 48, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !325, line: 124, baseType: !326)
!325 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!326 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !320, file: !321, line: 53, baseType: !328, size: 64, align: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !325, line: 127, baseType: !326)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !320, file: !321, line: 61, baseType: !330, size: 64, align: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !325, line: 130, baseType: !326)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !320, file: !321, line: 62, baseType: !332, size: 32, align: 32, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !325, line: 129, baseType: !62)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !320, file: !321, line: 64, baseType: !334, size: 32, align: 32, offset: 224)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !325, line: 125, baseType: !62)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !320, file: !321, line: 65, baseType: !336, size: 32, align: 32, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !325, line: 126, baseType: !62)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !320, file: !321, line: 67, baseType: !61, size: 32, align: 32, offset: 288)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !320, file: !321, line: 69, baseType: !324, size: 64, align: 64, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !320, file: !321, line: 74, baseType: !340, size: 64, align: 64, offset: 384)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !325, line: 131, baseType: !110)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !320, file: !321, line: 78, baseType: !342, size: 64, align: 64, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !325, line: 153, baseType: !110)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !320, file: !321, line: 80, baseType: !344, size: 64, align: 64, offset: 512)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !325, line: 158, baseType: !110)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "st_atime", scope: !320, file: !321, line: 98, baseType: !346, size: 64, align: 64, offset: 576)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !325, line: 139, baseType: !110)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimensec", scope: !320, file: !321, line: 99, baseType: !348, size: 64, align: 64, offset: 640)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_ulong_t", file: !325, line: 177, baseType: !326)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtime", scope: !320, file: !321, line: 100, baseType: !346, size: 64, align: 64, offset: 704)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimensec", scope: !320, file: !321, line: 101, baseType: !348, size: 64, align: 64, offset: 768)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctime", scope: !320, file: !321, line: 102, baseType: !346, size: 64, align: 64, offset: 832)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimensec", scope: !320, file: !321, line: 103, baseType: !348, size: 64, align: 64, offset: 896)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !320, file: !321, line: 106, baseType: !354, size: 192, align: 64, offset: 960)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 192, align: 64, elements: !356)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !325, line: 175, baseType: !110)
!356 = !{!357}
!357 = !DISubrange(count: 3)
!358 = !DILocation(line: 211, column: 17, scope: !288)
!359 = !DILocation(line: 213, column: 17, scope: !288)
!360 = !DILocation(line: 213, column: 5, scope: !288)
!361 = !DILocation(line: 215, column: 9, scope: !362)
!362 = distinct !DILexicalBlock(scope: !288, file: !65, line: 215, column: 9)
!363 = !DILocation(line: 215, column: 15, scope: !362)
!364 = !DILocation(line: 215, column: 19, scope: !362)
!365 = !DILocation(line: 215, column: 22, scope: !366)
!366 = !DILexicalBlockFile(scope: !362, file: !65, discriminator: 1)
!367 = !DILocation(line: 215, column: 28, scope: !366)
!368 = !DILocation(line: 215, column: 9, scope: !366)
!369 = !DILocation(line: 216, column: 16, scope: !370)
!370 = distinct !DILexicalBlock(scope: !362, file: !65, line: 215, column: 33)
!371 = !DILocation(line: 217, column: 13, scope: !372)
!372 = distinct !DILexicalBlock(scope: !370, file: !65, line: 217, column: 13)
!373 = !DILocation(line: 217, column: 16, scope: !372)
!374 = !DILocation(line: 217, column: 13, scope: !370)
!375 = !DILocation(line: 218, column: 20, scope: !372)
!376 = !DILocation(line: 218, column: 13, scope: !372)
!377 = !DILocation(line: 219, column: 5, scope: !370)
!378 = !DILocation(line: 219, column: 16, scope: !379)
!379 = !DILexicalBlockFile(scope: !380, file: !65, discriminator: 1)
!380 = distinct !DILexicalBlock(scope: !362, file: !65, line: 219, column: 16)
!381 = !DILocation(line: 219, column: 22, scope: !379)
!382 = !DILocation(line: 220, column: 16, scope: !383)
!383 = distinct !DILexicalBlock(scope: !380, file: !65, line: 219, column: 27)
!384 = !DILocation(line: 221, column: 13, scope: !385)
!385 = distinct !DILexicalBlock(scope: !383, file: !65, line: 221, column: 13)
!386 = !DILocation(line: 221, column: 16, scope: !385)
!387 = !DILocation(line: 221, column: 13, scope: !383)
!388 = !DILocation(line: 222, column: 20, scope: !385)
!389 = !DILocation(line: 222, column: 13, scope: !385)
!390 = !DILocation(line: 223, column: 5, scope: !383)
!391 = !DILocation(line: 224, column: 16, scope: !392)
!392 = distinct !DILexicalBlock(scope: !380, file: !65, line: 223, column: 12)
!393 = !DILocation(line: 229, column: 22, scope: !288)
!394 = !DILocation(line: 229, column: 32, scope: !288)
!395 = !DILocation(line: 229, column: 10, scope: !288)
!396 = !DILocation(line: 229, column: 8, scope: !288)
!397 = !DILocation(line: 230, column: 9, scope: !398)
!398 = distinct !DILexicalBlock(scope: !288, file: !65, line: 230, column: 9)
!399 = !DILocation(line: 230, column: 12, scope: !398)
!400 = !DILocation(line: 230, column: 9, scope: !288)
!401 = !DILocation(line: 231, column: 17, scope: !398)
!402 = !DILocation(line: 231, column: 16, scope: !398)
!403 = !DILocation(line: 231, column: 9, scope: !398)
!404 = !DILocation(line: 232, column: 13, scope: !288)
!405 = !DILocation(line: 232, column: 5, scope: !288)
!406 = !DILocation(line: 232, column: 8, scope: !288)
!407 = !DILocation(line: 232, column: 11, scope: !288)
!408 = !DILocation(line: 234, column: 29, scope: !288)
!409 = !DILocation(line: 234, column: 23, scope: !288)
!410 = !DILocation(line: 234, column: 38, scope: !288)
!411 = !DILocation(line: 234, column: 43, scope: !412)
!412 = !DILexicalBlockFile(scope: !288, file: !65, discriminator: 1)
!413 = !DILocation(line: 234, column: 54, scope: !412)
!414 = !DILocation(line: 234, column: 38, scope: !415)
!415 = !DILexicalBlockFile(scope: !288, file: !65, discriminator: 2)
!416 = !DILocation(line: 234, column: 5, scope: !415)
!417 = !DILocation(line: 234, column: 8, scope: !415)
!418 = !DILocation(line: 234, column: 20, scope: !415)
!419 = !DILocation(line: 238, column: 10, scope: !420)
!420 = distinct !DILexicalBlock(scope: !288, file: !65, line: 238, column: 9)
!421 = !DILocation(line: 238, column: 13, scope: !420)
!422 = !DILocation(line: 238, column: 25, scope: !420)
!423 = !DILocation(line: 238, column: 28, scope: !424)
!424 = !DILexicalBlockFile(scope: !420, file: !65, discriminator: 1)
!425 = !DILocation(line: 238, column: 34, scope: !424)
!426 = !DILocation(line: 238, column: 9, scope: !424)
!427 = !DILocation(line: 239, column: 30, scope: !420)
!428 = !DILocation(line: 239, column: 33, scope: !420)
!429 = !DILocation(line: 239, column: 49, scope: !420)
!430 = !DILocation(line: 239, column: 9, scope: !420)
!431 = !DILocation(line: 239, column: 12, scope: !420)
!432 = !DILocation(line: 239, column: 28, scope: !420)
!433 = !DILocation(line: 241, column: 5, scope: !288)
!434 = !DILocation(line: 242, column: 1, scope: !288)
!435 = distinct !DISubprogram(name: "file_read", scope: !65, file: !65, line: 107, type: !209, isLocal: true, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !289)
!436 = !DILocalVariable(name: "h", arg: 1, scope: !435, file: !65, line: 107, type: !79)
!437 = !DILocation(line: 107, column: 34, scope: !435)
!438 = !DILocalVariable(name: "buf", arg: 2, scope: !435, file: !65, line: 107, type: !211)
!439 = !DILocation(line: 107, column: 52, scope: !435)
!440 = !DILocalVariable(name: "size", arg: 3, scope: !435, file: !65, line: 107, type: !61)
!441 = !DILocation(line: 107, column: 61, scope: !435)
!442 = !DILocalVariable(name: "c", scope: !435, file: !65, line: 109, type: !298)
!443 = !DILocation(line: 109, column: 18, scope: !435)
!444 = !DILocation(line: 109, column: 22, scope: !435)
!445 = !DILocation(line: 109, column: 25, scope: !435)
!446 = !DILocalVariable(name: "ret", scope: !435, file: !65, line: 110, type: !61)
!447 = !DILocation(line: 110, column: 9, scope: !435)
!448 = !DILocation(line: 111, column: 14, scope: !435)
!449 = !DILocation(line: 111, column: 23, scope: !435)
!450 = !DILocation(line: 111, column: 26, scope: !435)
!451 = !DILocation(line: 111, column: 20, scope: !435)
!452 = !DILocation(line: 111, column: 13, scope: !435)
!453 = !DILocation(line: 111, column: 40, scope: !454)
!454 = !DILexicalBlockFile(scope: !435, file: !65, discriminator: 1)
!455 = !DILocation(line: 111, column: 43, scope: !454)
!456 = !DILocation(line: 111, column: 13, scope: !454)
!457 = !DILocation(line: 111, column: 57, scope: !458)
!458 = !DILexicalBlockFile(scope: !435, file: !65, discriminator: 2)
!459 = !DILocation(line: 111, column: 13, scope: !458)
!460 = !DILocation(line: 111, column: 13, scope: !461)
!461 = !DILexicalBlockFile(scope: !435, file: !65, discriminator: 3)
!462 = !DILocation(line: 111, column: 10, scope: !461)
!463 = !DILocation(line: 112, column: 16, scope: !435)
!464 = !DILocation(line: 112, column: 19, scope: !435)
!465 = !DILocation(line: 112, column: 23, scope: !435)
!466 = !DILocation(line: 112, column: 28, scope: !435)
!467 = !DILocation(line: 112, column: 11, scope: !435)
!468 = !DILocation(line: 112, column: 9, scope: !435)
!469 = !DILocation(line: 113, column: 9, scope: !470)
!470 = distinct !DILexicalBlock(scope: !435, file: !65, line: 113, column: 9)
!471 = !DILocation(line: 113, column: 13, scope: !470)
!472 = !DILocation(line: 113, column: 18, scope: !470)
!473 = !DILocation(line: 113, column: 21, scope: !474)
!474 = !DILexicalBlockFile(scope: !470, file: !65, discriminator: 1)
!475 = !DILocation(line: 113, column: 24, scope: !474)
!476 = !DILocation(line: 113, column: 9, scope: !474)
!477 = !DILocation(line: 114, column: 9, scope: !470)
!478 = !DILocation(line: 115, column: 9, scope: !479)
!479 = distinct !DILexicalBlock(scope: !435, file: !65, line: 115, column: 9)
!480 = !DILocation(line: 115, column: 13, scope: !479)
!481 = !DILocation(line: 115, column: 9, scope: !435)
!482 = !DILocation(line: 116, column: 9, scope: !479)
!483 = !DILocation(line: 117, column: 13, scope: !435)
!484 = !DILocation(line: 117, column: 17, scope: !435)
!485 = !DILocation(line: 117, column: 12, scope: !435)
!486 = !DILocation(line: 117, column: 27, scope: !454)
!487 = !DILocation(line: 117, column: 26, scope: !454)
!488 = !DILocation(line: 117, column: 12, scope: !454)
!489 = !DILocation(line: 117, column: 30, scope: !458)
!490 = !DILocation(line: 117, column: 12, scope: !458)
!491 = !DILocation(line: 117, column: 12, scope: !461)
!492 = !DILocation(line: 117, column: 5, scope: !461)
!493 = !DILocation(line: 118, column: 1, scope: !435)
!494 = distinct !DISubprogram(name: "file_write", scope: !65, file: !65, line: 120, type: !215, isLocal: true, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !289)
!495 = !DILocalVariable(name: "h", arg: 1, scope: !494, file: !65, line: 120, type: !79)
!496 = !DILocation(line: 120, column: 35, scope: !494)
!497 = !DILocalVariable(name: "buf", arg: 2, scope: !494, file: !65, line: 120, type: !217)
!498 = !DILocation(line: 120, column: 59, scope: !494)
!499 = !DILocalVariable(name: "size", arg: 3, scope: !494, file: !65, line: 120, type: !61)
!500 = !DILocation(line: 120, column: 68, scope: !494)
!501 = !DILocalVariable(name: "c", scope: !494, file: !65, line: 122, type: !298)
!502 = !DILocation(line: 122, column: 18, scope: !494)
!503 = !DILocation(line: 122, column: 22, scope: !494)
!504 = !DILocation(line: 122, column: 25, scope: !494)
!505 = !DILocalVariable(name: "ret", scope: !494, file: !65, line: 123, type: !61)
!506 = !DILocation(line: 123, column: 9, scope: !494)
!507 = !DILocation(line: 124, column: 14, scope: !494)
!508 = !DILocation(line: 124, column: 23, scope: !494)
!509 = !DILocation(line: 124, column: 26, scope: !494)
!510 = !DILocation(line: 124, column: 20, scope: !494)
!511 = !DILocation(line: 124, column: 13, scope: !494)
!512 = !DILocation(line: 124, column: 40, scope: !513)
!513 = !DILexicalBlockFile(scope: !494, file: !65, discriminator: 1)
!514 = !DILocation(line: 124, column: 43, scope: !513)
!515 = !DILocation(line: 124, column: 13, scope: !513)
!516 = !DILocation(line: 124, column: 57, scope: !517)
!517 = !DILexicalBlockFile(scope: !494, file: !65, discriminator: 2)
!518 = !DILocation(line: 124, column: 13, scope: !517)
!519 = !DILocation(line: 124, column: 13, scope: !520)
!520 = !DILexicalBlockFile(scope: !494, file: !65, discriminator: 3)
!521 = !DILocation(line: 124, column: 10, scope: !520)
!522 = !DILocation(line: 125, column: 17, scope: !494)
!523 = !DILocation(line: 125, column: 20, scope: !494)
!524 = !DILocation(line: 125, column: 24, scope: !494)
!525 = !DILocation(line: 125, column: 29, scope: !494)
!526 = !DILocation(line: 125, column: 11, scope: !494)
!527 = !DILocation(line: 125, column: 9, scope: !494)
!528 = !DILocation(line: 126, column: 13, scope: !494)
!529 = !DILocation(line: 126, column: 17, scope: !494)
!530 = !DILocation(line: 126, column: 12, scope: !494)
!531 = !DILocation(line: 126, column: 27, scope: !513)
!532 = !DILocation(line: 126, column: 26, scope: !513)
!533 = !DILocation(line: 126, column: 12, scope: !513)
!534 = !DILocation(line: 126, column: 30, scope: !517)
!535 = !DILocation(line: 126, column: 12, scope: !517)
!536 = !DILocation(line: 126, column: 12, scope: !520)
!537 = !DILocation(line: 126, column: 5, scope: !520)
!538 = distinct !DISubprogram(name: "file_seek", scope: !65, file: !65, line: 245, type: !221, isLocal: true, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !289)
!539 = !DILocalVariable(name: "h", arg: 1, scope: !538, file: !65, line: 245, type: !79)
!540 = !DILocation(line: 245, column: 38, scope: !538)
!541 = !DILocalVariable(name: "pos", arg: 2, scope: !538, file: !65, line: 245, type: !108)
!542 = !DILocation(line: 245, column: 49, scope: !538)
!543 = !DILocalVariable(name: "whence", arg: 3, scope: !538, file: !65, line: 245, type: !61)
!544 = !DILocation(line: 245, column: 58, scope: !538)
!545 = !DILocalVariable(name: "c", scope: !538, file: !65, line: 247, type: !298)
!546 = !DILocation(line: 247, column: 18, scope: !538)
!547 = !DILocation(line: 247, column: 22, scope: !538)
!548 = !DILocation(line: 247, column: 25, scope: !538)
!549 = !DILocalVariable(name: "ret", scope: !538, file: !65, line: 248, type: !108)
!550 = !DILocation(line: 248, column: 13, scope: !538)
!551 = !DILocation(line: 250, column: 9, scope: !552)
!552 = distinct !DILexicalBlock(scope: !538, file: !65, line: 250, column: 9)
!553 = !DILocation(line: 250, column: 16, scope: !552)
!554 = !DILocation(line: 250, column: 9, scope: !538)
!555 = !DILocalVariable(name: "st", scope: !556, file: !65, line: 251, type: !320)
!556 = distinct !DILexicalBlock(scope: !552, file: !65, line: 250, column: 28)
!557 = !DILocation(line: 251, column: 21, scope: !556)
!558 = !DILocation(line: 252, column: 21, scope: !556)
!559 = !DILocation(line: 252, column: 24, scope: !556)
!560 = !DILocation(line: 252, column: 15, scope: !556)
!561 = !DILocation(line: 252, column: 13, scope: !556)
!562 = !DILocation(line: 253, column: 16, scope: !556)
!563 = !DILocation(line: 253, column: 20, scope: !556)
!564 = !DILocation(line: 253, column: 27, scope: !565)
!565 = !DILexicalBlockFile(scope: !556, file: !65, discriminator: 1)
!566 = !DILocation(line: 253, column: 26, scope: !565)
!567 = !DILocation(line: 253, column: 16, scope: !565)
!568 = !DILocation(line: 253, column: 46, scope: !569)
!569 = !DILexicalBlockFile(scope: !556, file: !65, discriminator: 2)
!570 = !DILocation(line: 253, column: 57, scope: !569)
!571 = !DILocation(line: 253, column: 43, scope: !569)
!572 = !DILocation(line: 253, column: 43, scope: !573)
!573 = !DILexicalBlockFile(scope: !556, file: !65, discriminator: 3)
!574 = !DILocation(line: 253, column: 73, scope: !575)
!575 = !DILexicalBlockFile(scope: !556, file: !65, discriminator: 4)
!576 = !DILocation(line: 253, column: 43, scope: !575)
!577 = !DILocation(line: 253, column: 43, scope: !578)
!578 = !DILexicalBlockFile(scope: !556, file: !65, discriminator: 5)
!579 = !DILocation(line: 253, column: 16, scope: !578)
!580 = !DILocation(line: 253, column: 16, scope: !581)
!581 = !DILexicalBlockFile(scope: !556, file: !65, discriminator: 6)
!582 = !DILocation(line: 253, column: 9, scope: !581)
!583 = !DILocation(line: 256, column: 17, scope: !538)
!584 = !DILocation(line: 256, column: 20, scope: !538)
!585 = !DILocation(line: 256, column: 24, scope: !538)
!586 = !DILocation(line: 256, column: 29, scope: !538)
!587 = !DILocation(line: 256, column: 11, scope: !538)
!588 = !DILocation(line: 256, column: 9, scope: !538)
!589 = !DILocation(line: 258, column: 12, scope: !538)
!590 = !DILocation(line: 258, column: 16, scope: !538)
!591 = !DILocation(line: 258, column: 23, scope: !592)
!592 = !DILexicalBlockFile(scope: !538, file: !65, discriminator: 1)
!593 = !DILocation(line: 258, column: 22, scope: !592)
!594 = !DILocation(line: 258, column: 12, scope: !592)
!595 = !DILocation(line: 258, column: 26, scope: !596)
!596 = !DILexicalBlockFile(scope: !538, file: !65, discriminator: 2)
!597 = !DILocation(line: 258, column: 12, scope: !596)
!598 = !DILocation(line: 258, column: 12, scope: !599)
!599 = !DILexicalBlockFile(scope: !538, file: !65, discriminator: 3)
!600 = !DILocation(line: 258, column: 5, scope: !599)
!601 = !DILocation(line: 259, column: 1, scope: !538)
!602 = distinct !DISubprogram(name: "file_close", scope: !65, file: !65, line: 261, type: !205, isLocal: true, isDefinition: true, scopeLine: 262, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !289)
!603 = !DILocalVariable(name: "h", arg: 1, scope: !602, file: !65, line: 261, type: !79)
!604 = !DILocation(line: 261, column: 35, scope: !602)
!605 = !DILocalVariable(name: "c", scope: !602, file: !65, line: 263, type: !298)
!606 = !DILocation(line: 263, column: 18, scope: !602)
!607 = !DILocation(line: 263, column: 22, scope: !602)
!608 = !DILocation(line: 263, column: 25, scope: !602)
!609 = !DILocation(line: 264, column: 18, scope: !602)
!610 = !DILocation(line: 264, column: 21, scope: !602)
!611 = !DILocation(line: 264, column: 12, scope: !602)
!612 = !DILocation(line: 264, column: 5, scope: !602)
!613 = distinct !DISubprogram(name: "file_get_handle", scope: !65, file: !65, line: 129, type: !205, isLocal: true, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !289)
!614 = !DILocalVariable(name: "h", arg: 1, scope: !613, file: !65, line: 129, type: !79)
!615 = !DILocation(line: 129, column: 40, scope: !613)
!616 = !DILocalVariable(name: "c", scope: !613, file: !65, line: 131, type: !298)
!617 = !DILocation(line: 131, column: 18, scope: !613)
!618 = !DILocation(line: 131, column: 22, scope: !613)
!619 = !DILocation(line: 131, column: 25, scope: !613)
!620 = !DILocation(line: 132, column: 12, scope: !613)
!621 = !DILocation(line: 132, column: 15, scope: !613)
!622 = !DILocation(line: 132, column: 5, scope: !613)
!623 = distinct !DISubprogram(name: "file_check", scope: !65, file: !65, line: 135, type: !226, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !289)
!624 = !DILocalVariable(name: "h", arg: 1, scope: !623, file: !65, line: 135, type: !79)
!625 = !DILocation(line: 135, column: 35, scope: !623)
!626 = !DILocalVariable(name: "mask", arg: 2, scope: !623, file: !65, line: 135, type: !61)
!627 = !DILocation(line: 135, column: 42, scope: !623)
!628 = !DILocalVariable(name: "ret", scope: !623, file: !65, line: 137, type: !61)
!629 = !DILocation(line: 137, column: 9, scope: !623)
!630 = !DILocalVariable(name: "filename", scope: !623, file: !65, line: 138, type: !72)
!631 = !DILocation(line: 138, column: 17, scope: !623)
!632 = !DILocation(line: 138, column: 28, scope: !623)
!633 = !DILocation(line: 138, column: 31, scope: !623)
!634 = !DILocation(line: 139, column: 17, scope: !623)
!635 = !DILocation(line: 139, column: 5, scope: !623)
!636 = !DILocation(line: 143, column: 16, scope: !637)
!637 = distinct !DILexicalBlock(scope: !638, file: !65, line: 143, column: 9)
!638 = distinct !DILexicalBlock(scope: !623, file: !65, line: 141, column: 5)
!639 = !DILocation(line: 143, column: 9, scope: !637)
!640 = !DILocation(line: 143, column: 31, scope: !637)
!641 = !DILocation(line: 143, column: 9, scope: !638)
!642 = !DILocation(line: 144, column: 17, scope: !637)
!643 = !DILocation(line: 144, column: 16, scope: !637)
!644 = !DILocation(line: 144, column: 9, scope: !637)
!645 = !DILocation(line: 145, column: 9, scope: !646)
!646 = distinct !DILexicalBlock(scope: !638, file: !65, line: 145, column: 9)
!647 = !DILocation(line: 145, column: 13, scope: !646)
!648 = !DILocation(line: 145, column: 9, scope: !638)
!649 = !DILocation(line: 146, column: 20, scope: !650)
!650 = distinct !DILexicalBlock(scope: !646, file: !65, line: 146, column: 13)
!651 = !DILocation(line: 146, column: 13, scope: !650)
!652 = !DILocation(line: 146, column: 35, scope: !650)
!653 = !DILocation(line: 146, column: 13, scope: !646)
!654 = !DILocation(line: 147, column: 17, scope: !650)
!655 = !DILocation(line: 147, column: 13, scope: !650)
!656 = !DILocation(line: 146, column: 38, scope: !657)
!657 = !DILexicalBlockFile(scope: !650, file: !65, discriminator: 1)
!658 = !DILocation(line: 148, column: 9, scope: !659)
!659 = distinct !DILexicalBlock(scope: !638, file: !65, line: 148, column: 9)
!660 = !DILocation(line: 148, column: 13, scope: !659)
!661 = !DILocation(line: 148, column: 9, scope: !638)
!662 = !DILocation(line: 149, column: 20, scope: !663)
!663 = distinct !DILexicalBlock(scope: !659, file: !65, line: 149, column: 13)
!664 = !DILocation(line: 149, column: 13, scope: !663)
!665 = !DILocation(line: 149, column: 35, scope: !663)
!666 = !DILocation(line: 149, column: 13, scope: !659)
!667 = !DILocation(line: 150, column: 17, scope: !663)
!668 = !DILocation(line: 150, column: 13, scope: !663)
!669 = !DILocation(line: 149, column: 38, scope: !670)
!670 = !DILexicalBlockFile(scope: !663, file: !65, discriminator: 1)
!671 = !DILocation(line: 165, column: 12, scope: !623)
!672 = !DILocation(line: 165, column: 5, scope: !623)
!673 = !DILocation(line: 166, column: 1, scope: !623)
!674 = distinct !DISubprogram(name: "file_open_dir", scope: !65, file: !65, line: 267, type: !205, isLocal: true, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !289)
!675 = !DILocalVariable(name: "h", arg: 1, scope: !674, file: !65, line: 267, type: !79)
!676 = !DILocation(line: 267, column: 38, scope: !674)
!677 = !DILocalVariable(name: "c", scope: !674, file: !65, line: 270, type: !298)
!678 = !DILocation(line: 270, column: 18, scope: !674)
!679 = !DILocation(line: 270, column: 22, scope: !674)
!680 = !DILocation(line: 270, column: 25, scope: !674)
!681 = !DILocation(line: 272, column: 22, scope: !674)
!682 = !DILocation(line: 272, column: 25, scope: !674)
!683 = !DILocation(line: 272, column: 14, scope: !674)
!684 = !DILocation(line: 272, column: 5, scope: !674)
!685 = !DILocation(line: 272, column: 8, scope: !674)
!686 = !DILocation(line: 272, column: 12, scope: !674)
!687 = !DILocation(line: 273, column: 10, scope: !688)
!688 = distinct !DILexicalBlock(scope: !674, file: !65, line: 273, column: 9)
!689 = !DILocation(line: 273, column: 13, scope: !688)
!690 = !DILocation(line: 273, column: 9, scope: !674)
!691 = !DILocation(line: 274, column: 17, scope: !688)
!692 = !DILocation(line: 274, column: 16, scope: !688)
!693 = !DILocation(line: 274, column: 9, scope: !688)
!694 = !DILocation(line: 276, column: 5, scope: !674)
!695 = !DILocation(line: 280, column: 1, scope: !674)
!696 = distinct !DISubprogram(name: "file_read_dir", scope: !65, file: !65, line: 282, type: !248, isLocal: true, isDefinition: true, scopeLine: 283, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !289)
!697 = !DILocalVariable(name: "h", arg: 1, scope: !696, file: !65, line: 282, type: !79)
!698 = !DILocation(line: 282, column: 38, scope: !696)
!699 = !DILocalVariable(name: "next", arg: 2, scope: !696, file: !65, line: 282, type: !250)
!700 = !DILocation(line: 282, column: 56, scope: !696)
!701 = !DILocalVariable(name: "c", scope: !696, file: !65, line: 285, type: !298)
!702 = !DILocation(line: 285, column: 18, scope: !696)
!703 = !DILocation(line: 285, column: 22, scope: !696)
!704 = !DILocation(line: 285, column: 25, scope: !696)
!705 = !DILocalVariable(name: "dir", scope: !696, file: !65, line: 286, type: !706)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64, align: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !708, line: 22, size: 2240, align: 64, elements: !709)
!708 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!709 = !{!710, !712, !714, !716, !717}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !707, file: !708, line: 28, baseType: !711, size: 64, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !325, line: 128, baseType: !326)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !707, file: !708, line: 29, baseType: !713, size: 64, align: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !325, line: 132, baseType: !110)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !707, file: !708, line: 31, baseType: !715, size: 16, align: 16, offset: 128)
!715 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !707, file: !708, line: 32, baseType: !212, size: 8, align: 8, offset: 144)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !707, file: !708, line: 33, baseType: !718, size: 2048, align: 8, offset: 152)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 2048, align: 8, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 256)
!721 = !DILocation(line: 286, column: 20, scope: !696)
!722 = !DILocalVariable(name: "fullpath", scope: !696, file: !65, line: 287, type: !171)
!723 = !DILocation(line: 287, column: 11, scope: !696)
!724 = !DILocation(line: 289, column: 13, scope: !696)
!725 = !DILocation(line: 289, column: 6, scope: !696)
!726 = !DILocation(line: 289, column: 11, scope: !696)
!727 = !DILocation(line: 290, column: 11, scope: !728)
!728 = distinct !DILexicalBlock(scope: !696, file: !65, line: 290, column: 9)
!729 = !DILocation(line: 290, column: 10, scope: !728)
!730 = !DILocation(line: 290, column: 9, scope: !696)
!731 = !DILocation(line: 291, column: 9, scope: !728)
!732 = !DILocation(line: 292, column: 5, scope: !696)
!733 = distinct !{!733, !732}
!734 = !DILocation(line: 293, column: 10, scope: !735)
!735 = distinct !DILexicalBlock(scope: !696, file: !65, line: 292, column: 8)
!736 = !DILocation(line: 293, column: 14, scope: !735)
!737 = !DILocation(line: 294, column: 23, scope: !735)
!738 = !DILocation(line: 294, column: 26, scope: !735)
!739 = !DILocation(line: 294, column: 15, scope: !735)
!740 = !DILocation(line: 294, column: 13, scope: !735)
!741 = !DILocation(line: 295, column: 14, scope: !742)
!742 = distinct !DILexicalBlock(scope: !735, file: !65, line: 295, column: 13)
!743 = !DILocation(line: 295, column: 13, scope: !735)
!744 = !DILocation(line: 296, column: 22, scope: !745)
!745 = distinct !DILexicalBlock(scope: !742, file: !65, line: 295, column: 19)
!746 = !DILocation(line: 296, column: 13, scope: !745)
!747 = !DILocation(line: 297, column: 21, scope: !745)
!748 = !DILocation(line: 297, column: 20, scope: !745)
!749 = !DILocation(line: 297, column: 13, scope: !745)
!750 = !DILocation(line: 299, column: 5, scope: !735)
!751 = !DILocation(line: 299, column: 22, scope: !752)
!752 = !DILexicalBlockFile(scope: !696, file: !65, discriminator: 1)
!753 = !DILocation(line: 299, column: 27, scope: !752)
!754 = !DILocation(line: 299, column: 15, scope: !752)
!755 = !DILocation(line: 299, column: 40, scope: !752)
!756 = !DILocation(line: 299, column: 51, scope: !757)
!757 = !DILexicalBlockFile(scope: !696, file: !65, discriminator: 2)
!758 = !DILocation(line: 299, column: 56, scope: !757)
!759 = !DILocation(line: 299, column: 44, scope: !757)
!760 = !DILocation(line: 299, column: 43, scope: !757)
!761 = !DILocation(line: 299, column: 40, scope: !757)
!762 = !DILocation(line: 299, column: 5, scope: !763)
!763 = !DILexicalBlockFile(scope: !735, file: !65, discriminator: 3)
!764 = !DILocation(line: 301, column: 41, scope: !696)
!765 = !DILocation(line: 301, column: 44, scope: !696)
!766 = !DILocation(line: 301, column: 54, scope: !696)
!767 = !DILocation(line: 301, column: 59, scope: !696)
!768 = !DILocation(line: 301, column: 16, scope: !696)
!769 = !DILocation(line: 301, column: 14, scope: !696)
!770 = !DILocation(line: 302, column: 9, scope: !771)
!771 = distinct !DILexicalBlock(scope: !696, file: !65, line: 302, column: 9)
!772 = !DILocation(line: 302, column: 9, scope: !696)
!773 = !DILocalVariable(name: "st", scope: !774, file: !65, line: 303, type: !320)
!774 = distinct !DILexicalBlock(scope: !771, file: !65, line: 302, column: 19)
!775 = !DILocation(line: 303, column: 21, scope: !774)
!776 = !DILocation(line: 304, column: 20, scope: !777)
!777 = distinct !DILexicalBlock(scope: !774, file: !65, line: 304, column: 13)
!778 = !DILocation(line: 304, column: 14, scope: !777)
!779 = !DILocation(line: 304, column: 13, scope: !774)
!780 = !DILocation(line: 305, column: 19, scope: !781)
!781 = distinct !DILexicalBlock(scope: !782, file: !65, line: 305, column: 16)
!782 = distinct !DILexicalBlock(scope: !777, file: !65, line: 304, column: 36)
