; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--asfdec_o.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--asfdec_o.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }

!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSampleFormat", file: !867, line: 58, size: 32, align: 32, elements: !868)
!867 = !DIFile(filename: "./libavutil/samplefmt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!868 = !{!869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882}
!869 = !DIEnumerator(name: "AV_SAMPLE_FMT_NONE", value: -1)
!870 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8", value: 0)
!871 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16", value: 1)
!872 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32", value: 2)
!873 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLT", value: 3)
!874 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBL", value: 4)
!875 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8P", value: 5)
!876 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16P", value: 6)
!877 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32P", value: 7)
!878 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLTP", value: 8)
!879 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBLP", value: 9)
!880 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64", value: 10)
!881 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!882 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!883 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !4, line: 3865, size: 32, align: 32, elements: !884)
!884 = !{!885, !886, !887, !888}
!885 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!886 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!887 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!888 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !940, file: !939, line: 139, size: 32, align: 32, elements: !1073)
!939 = !DIFile(filename: "libavformat/asfdec_o.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASFContext", file: !939, line: 94, size: 58880, align: 64, elements: !941)
!941 = !{!942, !944, !945, !946, !950, !951, !954, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !1036, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "data_reached", scope: !940, file: !939, line: 95, baseType: !943, size: 32, align: 32)
!943 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "is_simple_index", scope: !940, file: !939, line: 96, baseType: !943, size: 32, align: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "is_header", scope: !940, file: !939, line: 97, baseType: !943, size: 32, align: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "preroll", scope: !940, file: !939, line: 99, baseType: !947, size: 64, align: 64, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !948, line: 55, baseType: !949)
!948 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!949 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "nb_packets", scope: !940, file: !939, line: 100, baseType: !947, size: 64, align: 64, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "packet_size", scope: !940, file: !939, line: 101, baseType: !952, size: 32, align: 32, offset: 256)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !948, line: 51, baseType: !953)
!953 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "send_time", scope: !940, file: !939, line: 102, baseType: !955, size: 64, align: 64, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !948, line: 40, baseType: !956)
!956 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !940, file: !939, line: 103, baseType: !943, size: 32, align: 32, offset: 384)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "b_flags", scope: !940, file: !939, line: 105, baseType: !952, size: 32, align: 32, offset: 416)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "prop_flags", scope: !940, file: !939, line: 106, baseType: !952, size: 32, align: 32, offset: 448)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !940, file: !939, line: 108, baseType: !947, size: 64, align: 64, offset: 512)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_size", scope: !940, file: !939, line: 109, baseType: !947, size: 64, align: 64, offset: 576)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !940, file: !939, line: 111, baseType: !955, size: 64, align: 64, offset: 640)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "data_offset", scope: !940, file: !939, line: 113, baseType: !955, size: 64, align: 64, offset: 704)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "first_packet_offset", scope: !940, file: !939, line: 114, baseType: !955, size: 64, align: 64, offset: 768)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_offset", scope: !940, file: !939, line: 115, baseType: !955, size: 64, align: 64, offset: 832)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "asf_st", scope: !940, file: !939, line: 118, baseType: !967, size: 8192, align: 64, offset: 896)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 8192, align: 64, elements: !1034)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASFStream", file: !939, line: 86, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASFStream", file: !939, line: 76, size: 1152, align: 64, elements: !971)
!971 = !{!972, !975, !976, !977, !978, !981, !984, !985, !988}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !970, file: !939, line: 77, baseType: !973, size: 8, align: 8)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !948, line: 48, baseType: !974)
!974 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !970, file: !939, line: 78, baseType: !943, size: 32, align: 32, offset: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !970, file: !939, line: 79, baseType: !943, size: 32, align: 32, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "indexed", scope: !970, file: !939, line: 80, baseType: !943, size: 32, align: 32, offset: 96)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !970, file: !939, line: 81, baseType: !979, size: 8, align: 8, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !948, line: 36, baseType: !980)
!980 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pkt_len", scope: !970, file: !939, line: 82, baseType: !982, size: 16, align: 16, offset: 144)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !948, line: 49, baseType: !983)
!983 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_chunk_len", scope: !970, file: !939, line: 83, baseType: !982, size: 16, align: 16, offset: 160)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "lang_idx", scope: !970, file: !939, line: 84, baseType: !986, size: 16, align: 16, offset: 176)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !948, line: 37, baseType: !987)
!987 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "pkt", scope: !970, file: !939, line: 85, baseType: !989, size: 960, align: 64, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASFPacket", file: !939, line: 74, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASFPacket", file: !939, line: 65, size: 960, align: 64, elements: !991)
!991 = !{!992, !1027, !1028, !1029, !1030, !1031, !1032, !1033}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "avpkt", scope: !990, file: !939, line: 66, baseType: !993, size: 704, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !995)
!995 = !{!996, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1023, !1024, !1025, !1026}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !994, file: !4, line: 1451, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !999, line: 94, baseType: !1000)
!999 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !999, line: 81, size: 192, align: 64, elements: !1001)
!1001 = !{!1002, !1006, !1008}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1000, file: !999, line: 82, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !999, line: 73, baseType: !1005)
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !999, line: 73, flags: DIFlagFwdDecl)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1000, file: !999, line: 89, baseType: !1007, size: 64, align: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1000, file: !999, line: 93, baseType: !943, size: 32, align: 32, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !994, file: !4, line: 1461, baseType: !955, size: 64, align: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !994, file: !4, line: 1467, baseType: !955, size: 64, align: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !994, file: !4, line: 1468, baseType: !1007, size: 64, align: 64, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !994, file: !4, line: 1469, baseType: !943, size: 32, align: 32, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !994, file: !4, line: 1470, baseType: !943, size: 32, align: 32, offset: 288)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !994, file: !4, line: 1474, baseType: !943, size: 32, align: 32, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !994, file: !4, line: 1479, baseType: !1016, size: 64, align: 64, offset: 384)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1019)
!1019 = !{!1020, !1021, !1022}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1018, file: !4, line: 1412, baseType: !1007, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1018, file: !4, line: 1413, baseType: !943, size: 32, align: 32, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1018, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !994, file: !4, line: 1480, baseType: !943, size: 32, align: 32, offset: 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !994, file: !4, line: 1486, baseType: !955, size: 64, align: 64, offset: 512)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !994, file: !4, line: 1488, baseType: !955, size: 64, align: 64, offset: 576)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !994, file: !4, line: 1497, baseType: !955, size: 64, align: 64, offset: 640)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !990, file: !939, line: 67, baseType: !955, size: 64, align: 64, offset: 704)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !990, file: !939, line: 68, baseType: !952, size: 32, align: 32, offset: 768)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !990, file: !939, line: 69, baseType: !943, size: 32, align: 32, offset: 800)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !990, file: !939, line: 70, baseType: !943, size: 32, align: 32, offset: 832)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !990, file: !939, line: 71, baseType: !943, size: 32, align: 32, offset: 864)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "size_left", scope: !990, file: !939, line: 72, baseType: !943, size: 32, align: 32, offset: 896)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !990, file: !939, line: 73, baseType: !973, size: 8, align: 8, offset: 928)
!1034 = !{!1035}
!1035 = !DISubrange(count: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "asf_sd", scope: !940, file: !939, line: 119, baseType: !1037, size: 49152, align: 64, offset: 9088)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 49152, align: 64, elements: !1034)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASFStreamData", file: !939, line: 92, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASFStreamData", file: !939, line: 88, size: 384, align: 64, elements: !1040)
!1040 = !{!1041, !1046, !1051}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "langs", scope: !1039, file: !939, line: 89, baseType: !1042, size: 256, align: 8)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1043, size: 256, align: 8, elements: !1044)
!1043 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1044 = !{!1045}
!1045 = !DISubrange(count: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "asf_met", scope: !1039, file: !939, line: 90, baseType: !1047, size: 64, align: 64, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1049, line: 86, baseType: !1050)
!1049 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1050 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1049, line: 86, flags: DIFlagFwdDecl)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio", scope: !1039, file: !939, line: 91, baseType: !1052, size: 64, align: 32, offset: 320)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1053, line: 61, baseType: !1054)
!1053 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1053, line: 58, size: 64, align: 32, elements: !1055)
!1055 = !{!1056, !1057}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1054, file: !1053, line: 59, baseType: !943, size: 32, align: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1054, file: !1053, line: 60, baseType: !943, size: 32, align: 32, offset: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !940, file: !939, line: 120, baseType: !943, size: 32, align: 32, offset: 58240)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !940, file: !939, line: 122, baseType: !943, size: 32, align: 32, offset: 58272)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "sub_header_offset", scope: !940, file: !939, line: 125, baseType: !947, size: 64, align: 64, offset: 58304)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "sub_dts", scope: !940, file: !939, line: 126, baseType: !955, size: 64, align: 64, offset: 58368)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "dts_delta", scope: !940, file: !939, line: 127, baseType: !973, size: 8, align: 8, offset: 58432)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "packet_size_internal", scope: !940, file: !939, line: 128, baseType: !952, size: 32, align: 32, offset: 58464)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "packet_offset", scope: !940, file: !939, line: 129, baseType: !955, size: 64, align: 64, offset: 58496)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "pad_len", scope: !940, file: !939, line: 130, baseType: !952, size: 32, align: 32, offset: 58560)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "rep_data_len", scope: !940, file: !939, line: 131, baseType: !952, size: 32, align: 32, offset: 58592)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "sub_left", scope: !940, file: !939, line: 134, baseType: !947, size: 64, align: 64, offset: 58624)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "nb_sub", scope: !940, file: !939, line: 135, baseType: !953, size: 32, align: 32, offset: 58688)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "mult_sub_len", scope: !940, file: !939, line: 136, baseType: !982, size: 16, align: 16, offset: 58720)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "nb_mult_left", scope: !940, file: !939, line: 137, baseType: !947, size: 64, align: 64, offset: 58752)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "return_subpayload", scope: !940, file: !939, line: 138, baseType: !943, size: 32, align: 32, offset: 58816)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !940, file: !939, line: 144, baseType: !938, size: 32, align: 32, offset: 58848)
!1073 = !{!1074, !1075, !1076, !1077}
!1074 = !DIEnumerator(name: "PARSE_PACKET_HEADER", value: 0)
!1075 = !DIEnumerator(name: "READ_SINGLE", value: 1)
!1076 = !DIEnumerator(name: "READ_MULTI", value: 2)
!1077 = !DIEnumerator(name: "READ_MULTI_SUB", value: 3)
!1078 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVLangCodespace", file: !1079, line: 30, size: 32, align: 32, elements: !1080)
!1079 = !DIFile(filename: "libavformat/avlanguage.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1080 = !{!1081, !1082, !1083}
!1081 = !DIEnumerator(name: "AV_LANG_ISO639_2_BIBL", value: 0)
!1082 = !DIEnumerator(name: "AV_LANG_ISO639_2_TERM", value: 1)
!1083 = !DIEnumerator(name: "AV_LANG_ISO639_1", value: 2)
!1084 = !{!943, !953, !955}
!1085 = !{!1086, !2276, !2300}
!1086 = distinct !DIGlobalVariable(name: "ff_asf_o_demuxer", scope: !0, file: !939, line: 1787, type: !1087, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_asf_o_demuxer)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !1088)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1089)
!1089 = !{!1090, !1093, !1094, !1095, !1096, !1106, !1180, !1181, !1183, !1184, !1185, !1198, !2257, !2258, !2259, !2263, !2267, !2268, !2269, !2273, !2274, !2275}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1088, file: !919, line: 638, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1088, file: !919, line: 645, baseType: !1091, size: 64, align: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1088, file: !919, line: 652, baseType: !943, size: 32, align: 32, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1088, file: !919, line: 659, baseType: !1091, size: 64, align: 64, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1088, file: !919, line: 661, baseType: !1097, size: 64, align: 64, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1099)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1102, line: 44, size: 64, align: 32, elements: !1103)
!1102 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1103 = !{!1104, !1105}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1101, file: !1102, line: 45, baseType: !3, size: 32, align: 32)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1101, file: !1102, line: 46, baseType: !953, size: 32, align: 32, offset: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1088, file: !919, line: 663, baseType: !1107, size: 64, align: 64, offset: 320)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1109)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1111)
!1111 = !{!1112, !1113, !1118, !1139, !1140, !1141, !1142, !1146, !1152, !1154, !1158}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1110, file: !486, line: 72, baseType: !1091, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1110, file: !486, line: 78, baseType: !1114, size: 64, align: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!1091, !1117}
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1110, file: !486, line: 85, baseType: !1119, size: 64, align: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1127, !1135, !1136, !1137, !1138}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1121, file: !464, line: 247, baseType: !1091, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1121, file: !464, line: 253, baseType: !1091, size: 64, align: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1121, file: !464, line: 259, baseType: !943, size: 32, align: 32, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1121, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1121, file: !464, line: 271, baseType: !1128, size: 64, align: 64, offset: 192)
!1128 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1121, file: !464, line: 265, size: 64, align: 64, elements: !1129)
!1129 = !{!1130, !1131, !1133, !1134}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1128, file: !464, line: 266, baseType: !955, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1128, file: !464, line: 267, baseType: !1132, size: 64, align: 64)
!1132 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1128, file: !464, line: 268, baseType: !1091, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1128, file: !464, line: 270, baseType: !1052, size: 64, align: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1121, file: !464, line: 272, baseType: !1132, size: 64, align: 64, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1121, file: !464, line: 273, baseType: !1132, size: 64, align: 64, offset: 320)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1121, file: !464, line: 275, baseType: !943, size: 32, align: 32, offset: 384)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1121, file: !464, line: 300, baseType: !1091, size: 64, align: 64, offset: 448)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1110, file: !486, line: 93, baseType: !943, size: 32, align: 32, offset: 192)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1110, file: !486, line: 99, baseType: !943, size: 32, align: 32, offset: 224)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1110, file: !486, line: 108, baseType: !943, size: 32, align: 32, offset: 256)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1110, file: !486, line: 113, baseType: !1143, size: 64, align: 64, offset: 320)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!1117, !1117, !1117}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1110, file: !486, line: 123, baseType: !1147, size: 64, align: 64, offset: 384)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!1150, !1150}
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1110)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1110, file: !486, line: 130, baseType: !1153, size: 32, align: 32, offset: 448)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1110, file: !486, line: 136, baseType: !1155, size: 64, align: 64, offset: 512)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!1153, !1117}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1110, file: !486, line: 142, baseType: !1159, size: 64, align: 64, offset: 576)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!943, !1162, !1117, !1091, !943}
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1165)
!1165 = !{!1166, !1178, !1179}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1164, file: !464, line: 360, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1171)
!1171 = !{!1172, !1173, !1174, !1175, !1176, !1177}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1170, file: !464, line: 307, baseType: !1091, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1170, file: !464, line: 313, baseType: !1132, size: 64, align: 64, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1170, file: !464, line: 313, baseType: !1132, size: 64, align: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1170, file: !464, line: 318, baseType: !1132, size: 64, align: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1170, file: !464, line: 318, baseType: !1132, size: 64, align: 64, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1170, file: !464, line: 323, baseType: !943, size: 32, align: 32, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1164, file: !464, line: 364, baseType: !943, size: 32, align: 32, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1164, file: !464, line: 368, baseType: !943, size: 32, align: 32, offset: 96)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1088, file: !919, line: 670, baseType: !1091, size: 64, align: 64, offset: 384)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1088, file: !919, line: 679, baseType: !1182, size: 64, align: 64, offset: 448)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1088, file: !919, line: 684, baseType: !943, size: 32, align: 32, offset: 512)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1088, file: !919, line: 689, baseType: !943, size: 32, align: 32, offset: 544)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1088, file: !919, line: 696, baseType: !1186, size: 64, align: 64, offset: 576)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!943, !1189}
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1192)
!1192 = !{!1193, !1194, !1196, !1197}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1191, file: !919, line: 449, baseType: !1091, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1191, file: !919, line: 450, baseType: !1195, size: 64, align: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1191, file: !919, line: 451, baseType: !943, size: 32, align: 32, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1191, file: !919, line: 452, baseType: !1091, size: 64, align: 64, offset: 192)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1088, file: !919, line: 703, baseType: !1199, size: 64, align: 64, offset: 640)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!943, !1202}
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1204)
!1204 = !{!1205, !1206, !1207, !1356, !1357, !1422, !1423, !1424, !2114, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2168, !2169, !2170, !2171, !2172, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2223, !2224, !2227, !2228, !2229, !2230, !2231, !2232, !2234, !2235, !2236, !2237, !2245, !2246, !2250, !2254, !2255, !2256}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1203, file: !919, line: 1342, baseType: !1107, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1203, file: !919, line: 1349, baseType: !1182, size: 64, align: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1203, file: !919, line: 1356, baseType: !1208, size: 64, align: 64, offset: 128)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1210)
!1210 = !{!1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1229, !1230, !1234, !1238, !1243, !1249, !1331, !1337, !1343, !1344, !1345, !1346, !1350}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1209, file: !919, line: 498, baseType: !1091, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1209, file: !919, line: 504, baseType: !1091, size: 64, align: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1209, file: !919, line: 505, baseType: !1091, size: 64, align: 64, offset: 128)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1209, file: !919, line: 506, baseType: !1091, size: 64, align: 64, offset: 192)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1209, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1209, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1209, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1209, file: !919, line: 517, baseType: !943, size: 32, align: 32, offset: 352)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1209, file: !919, line: 523, baseType: !1097, size: 64, align: 64, offset: 384)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1209, file: !919, line: 526, baseType: !1107, size: 64, align: 64, offset: 448)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1209, file: !919, line: 535, baseType: !1208, size: 64, align: 64, offset: 512)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1209, file: !919, line: 539, baseType: !943, size: 32, align: 32, offset: 576)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1209, file: !919, line: 541, baseType: !1199, size: 64, align: 64, offset: 640)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1209, file: !919, line: 549, baseType: !1225, size: 64, align: 64, offset: 704)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!943, !1202, !1228}
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1209, file: !919, line: 550, baseType: !1199, size: 64, align: 64, offset: 768)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1209, file: !919, line: 554, baseType: !1231, size: 64, align: 64, offset: 832)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!943, !1202, !1228, !1228, !943}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1209, file: !919, line: 563, baseType: !1235, size: 64, align: 64, offset: 896)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!943, !3, !943}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1209, file: !919, line: 565, baseType: !1239, size: 64, align: 64, offset: 960)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{null, !1202, !943, !1242, !1242}
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1209, file: !919, line: 570, baseType: !1244, size: 64, align: 64, offset: 1024)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!943, !1202, !943, !1117, !1247}
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1248, line: 216, baseType: !949)
!1248 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1209, file: !919, line: 581, baseType: !1250, size: 64, align: 64, offset: 1088)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!943, !1202, !943, !1253, !953}
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1257)
!1257 = !{!1258, !1262, !1264, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1291, !1293, !1294, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1256, file: !548, line: 282, baseType: !1259, size: 512, align: 64)
!1259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1007, size: 512, align: 64, elements: !1260)
!1260 = !{!1261}
!1261 = !DISubrange(count: 8)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1256, file: !548, line: 299, baseType: !1263, size: 256, align: 32, offset: 512)
!1263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 256, align: 32, elements: !1260)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1256, file: !548, line: 315, baseType: !1265, size: 64, align: 64, offset: 768)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1256, file: !548, line: 326, baseType: !943, size: 32, align: 32, offset: 832)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1256, file: !548, line: 326, baseType: !943, size: 32, align: 32, offset: 864)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1256, file: !548, line: 334, baseType: !943, size: 32, align: 32, offset: 896)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1256, file: !548, line: 341, baseType: !943, size: 32, align: 32, offset: 928)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1256, file: !548, line: 346, baseType: !943, size: 32, align: 32, offset: 960)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1256, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1256, file: !548, line: 356, baseType: !1052, size: 64, align: 32, offset: 1024)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1256, file: !548, line: 361, baseType: !955, size: 64, align: 64, offset: 1088)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1256, file: !548, line: 369, baseType: !955, size: 64, align: 64, offset: 1152)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1256, file: !548, line: 377, baseType: !955, size: 64, align: 64, offset: 1216)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1256, file: !548, line: 382, baseType: !943, size: 32, align: 32, offset: 1280)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1256, file: !548, line: 386, baseType: !943, size: 32, align: 32, offset: 1312)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1256, file: !548, line: 391, baseType: !943, size: 32, align: 32, offset: 1344)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1256, file: !548, line: 396, baseType: !1117, size: 64, align: 64, offset: 1408)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1256, file: !548, line: 403, baseType: !1281, size: 512, align: 64, offset: 1472)
!1281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 512, align: 64, elements: !1260)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1256, file: !548, line: 410, baseType: !943, size: 32, align: 32, offset: 1984)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1256, file: !548, line: 415, baseType: !943, size: 32, align: 32, offset: 2016)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1256, file: !548, line: 420, baseType: !943, size: 32, align: 32, offset: 2048)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1256, file: !548, line: 425, baseType: !943, size: 32, align: 32, offset: 2080)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1256, file: !548, line: 435, baseType: !955, size: 64, align: 64, offset: 2112)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1256, file: !548, line: 440, baseType: !943, size: 32, align: 32, offset: 2176)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1256, file: !548, line: 445, baseType: !947, size: 64, align: 64, offset: 2240)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1256, file: !548, line: 459, baseType: !1290, size: 512, align: 64, offset: 2304)
!1290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !997, size: 512, align: 64, elements: !1260)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1256, file: !548, line: 473, baseType: !1292, size: 64, align: 64, offset: 2816)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1256, file: !548, line: 477, baseType: !943, size: 32, align: 32, offset: 2880)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1256, file: !548, line: 479, baseType: !1295, size: 64, align: 64, offset: 2944)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1298)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1299)
!1299 = !{!1300, !1301, !1302, !1303, !1304}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1298, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1298, file: !548, line: 203, baseType: !1007, size: 64, align: 64, offset: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1298, file: !548, line: 204, baseType: !943, size: 32, align: 32, offset: 128)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1298, file: !548, line: 205, baseType: !1047, size: 64, align: 64, offset: 192)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1298, file: !548, line: 206, baseType: !997, size: 64, align: 64, offset: 256)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1256, file: !548, line: 480, baseType: !943, size: 32, align: 32, offset: 3008)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1256, file: !548, line: 505, baseType: !943, size: 32, align: 32, offset: 3040)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1256, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1256, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1256, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1256, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1256, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1256, file: !548, line: 532, baseType: !955, size: 64, align: 64, offset: 3264)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1256, file: !548, line: 539, baseType: !955, size: 64, align: 64, offset: 3328)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1256, file: !548, line: 547, baseType: !955, size: 64, align: 64, offset: 3392)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1256, file: !548, line: 554, baseType: !1047, size: 64, align: 64, offset: 3456)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1256, file: !548, line: 563, baseType: !943, size: 32, align: 32, offset: 3520)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1256, file: !548, line: 572, baseType: !943, size: 32, align: 32, offset: 3552)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1256, file: !548, line: 581, baseType: !943, size: 32, align: 32, offset: 3584)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1256, file: !548, line: 588, baseType: !1320, size: 64, align: 64, offset: 3648)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1256, file: !548, line: 593, baseType: !943, size: 32, align: 32, offset: 3712)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1256, file: !548, line: 596, baseType: !943, size: 32, align: 32, offset: 3744)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1256, file: !548, line: 599, baseType: !997, size: 64, align: 64, offset: 3776)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1256, file: !548, line: 605, baseType: !997, size: 64, align: 64, offset: 3840)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1256, file: !548, line: 616, baseType: !997, size: 64, align: 64, offset: 3904)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1256, file: !548, line: 626, baseType: !1247, size: 64, align: 64, offset: 3968)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1256, file: !548, line: 627, baseType: !1247, size: 64, align: 64, offset: 4032)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1256, file: !548, line: 628, baseType: !1247, size: 64, align: 64, offset: 4096)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1256, file: !548, line: 629, baseType: !1247, size: 64, align: 64, offset: 4160)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1256, file: !548, line: 645, baseType: !997, size: 64, align: 64, offset: 4224)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1209, file: !919, line: 587, baseType: !1332, size: 64, align: 64, offset: 1152)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!943, !1202, !1335}
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1209, file: !919, line: 592, baseType: !1338, size: 64, align: 64, offset: 1216)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!943, !1202, !1341}
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1209, file: !919, line: 597, baseType: !1338, size: 64, align: 64, offset: 1280)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1209, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1209, file: !919, line: 608, baseType: !1199, size: 64, align: 64, offset: 1408)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1209, file: !919, line: 617, baseType: !1347, size: 64, align: 64, offset: 1472)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{null, !1202}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1209, file: !919, line: 623, baseType: !1351, size: 64, align: 64, offset: 1536)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{!943, !1202, !1354}
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1203, file: !919, line: 1365, baseType: !1117, size: 64, align: 64, offset: 192)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1203, file: !919, line: 1379, baseType: !1358, size: 64, align: 64, offset: 256)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1360)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1361)
!1361 = !{!1362, !1363, !1364, !1365, !1366, !1367, !1368, !1372, !1373, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1389, !1390, !1394, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1412, !1413, !1414, !1415, !1419, !1420, !1421}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1360, file: !650, line: 174, baseType: !1107, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1360, file: !650, line: 226, baseType: !1195, size: 64, align: 64, offset: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1360, file: !650, line: 227, baseType: !943, size: 32, align: 32, offset: 128)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1360, file: !650, line: 228, baseType: !1195, size: 64, align: 64, offset: 192)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1360, file: !650, line: 229, baseType: !1195, size: 64, align: 64, offset: 256)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1360, file: !650, line: 233, baseType: !1117, size: 64, align: 64, offset: 320)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1360, file: !650, line: 235, baseType: !1369, size: 64, align: 64, offset: 384)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DISubroutineType(types: !1371)
!1371 = !{!943, !1117, !1007, !943}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1360, file: !650, line: 236, baseType: !1369, size: 64, align: 64, offset: 448)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1360, file: !650, line: 237, baseType: !1374, size: 64, align: 64, offset: 512)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{!955, !1117, !955, !943}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1360, file: !650, line: 238, baseType: !955, size: 64, align: 64, offset: 576)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1360, file: !650, line: 239, baseType: !943, size: 32, align: 32, offset: 640)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1360, file: !650, line: 240, baseType: !943, size: 32, align: 32, offset: 672)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1360, file: !650, line: 241, baseType: !943, size: 32, align: 32, offset: 704)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1360, file: !650, line: 242, baseType: !949, size: 64, align: 64, offset: 768)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1360, file: !650, line: 243, baseType: !1195, size: 64, align: 64, offset: 832)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1360, file: !650, line: 244, baseType: !1384, size: 64, align: 64, offset: 896)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DISubroutineType(types: !1386)
!1386 = !{!949, !949, !1387, !953}
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1360, file: !650, line: 245, baseType: !943, size: 32, align: 32, offset: 960)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1360, file: !650, line: 249, baseType: !1391, size: 64, align: 64, offset: 1024)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DISubroutineType(types: !1393)
!1393 = !{!943, !1117, !943}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1360, file: !650, line: 255, baseType: !1395, size: 64, align: 64, offset: 1088)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DISubroutineType(types: !1397)
!1397 = !{!955, !1117, !943, !955, !943}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1360, file: !650, line: 260, baseType: !943, size: 32, align: 32, offset: 1152)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1360, file: !650, line: 266, baseType: !955, size: 64, align: 64, offset: 1216)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1360, file: !650, line: 273, baseType: !943, size: 32, align: 32, offset: 1280)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1360, file: !650, line: 279, baseType: !955, size: 64, align: 64, offset: 1344)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1360, file: !650, line: 285, baseType: !943, size: 32, align: 32, offset: 1408)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1360, file: !650, line: 291, baseType: !943, size: 32, align: 32, offset: 1440)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1360, file: !650, line: 298, baseType: !943, size: 32, align: 32, offset: 1472)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1360, file: !650, line: 304, baseType: !943, size: 32, align: 32, offset: 1504)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1360, file: !650, line: 309, baseType: !1091, size: 64, align: 64, offset: 1536)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1360, file: !650, line: 314, baseType: !1091, size: 64, align: 64, offset: 1600)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1360, file: !650, line: 319, baseType: !1409, size: 64, align: 64, offset: 1664)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{!943, !1117, !1007, !943, !649, !955}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1360, file: !650, line: 326, baseType: !943, size: 32, align: 32, offset: 1728)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1360, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1360, file: !650, line: 332, baseType: !955, size: 64, align: 64, offset: 1792)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1360, file: !650, line: 338, baseType: !1416, size: 64, align: 64, offset: 1856)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{!943, !1117}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1360, file: !650, line: 340, baseType: !955, size: 64, align: 64, offset: 1920)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1360, file: !650, line: 346, baseType: !1195, size: 64, align: 64, offset: 1984)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1360, file: !650, line: 351, baseType: !943, size: 32, align: 32, offset: 2048)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1203, file: !919, line: 1386, baseType: !943, size: 32, align: 32, offset: 320)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1203, file: !919, line: 1393, baseType: !953, size: 32, align: 32, offset: 352)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1203, file: !919, line: 1405, baseType: !1425, size: 64, align: 64, offset: 384)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1428)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1429)
!1429 = !{!1430, !1431, !1432, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1900, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !2000, !2006, !2007, !2011, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2043, !2044, !2045, !2046, !2047, !2048}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1428, file: !919, line: 866, baseType: !943, size: 32, align: 32)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1428, file: !919, line: 872, baseType: !943, size: 32, align: 32, offset: 32)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1428, file: !919, line: 878, baseType: !1433, size: 64, align: 64, offset: 64)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1435)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1436)
!1436 = !{!1437, !1438, !1439, !1440, !1575, !1576, !1577, !1578, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1604, !1608, !1609, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1788, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1435, file: !4, line: 1561, baseType: !1107, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1435, file: !4, line: 1562, baseType: !943, size: 32, align: 32, offset: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1435, file: !4, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1435, file: !4, line: 1565, baseType: !1441, size: 64, align: 64, offset: 128)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1443)
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1444)
!1444 = !{!1445, !1446, !1447, !1448, !1449, !1450, !1453, !1456, !1459, !1462, !1465, !1466, !1467, !1475, !1476, !1477, !1479, !1483, !1489, !1494, !1498, !1499, !1540, !1547, !1551, !1552, !1556, !1560, !1564, !1568, !1569, !1570}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1443, file: !4, line: 3475, baseType: !1091, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1443, file: !4, line: 3480, baseType: !1091, size: 64, align: 64, offset: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1443, file: !4, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1443, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1443, file: !4, line: 3487, baseType: !943, size: 32, align: 32, offset: 192)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1443, file: !4, line: 3488, baseType: !1451, size: 64, align: 64, offset: 256)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1443, file: !4, line: 3489, baseType: !1454, size: 64, align: 64, offset: 320)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1443, file: !4, line: 3490, baseType: !1457, size: 64, align: 64, offset: 384)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1443, file: !4, line: 3491, baseType: !1460, size: 64, align: 64, offset: 448)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1443, file: !4, line: 3492, baseType: !1463, size: 64, align: 64, offset: 512)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1443, file: !4, line: 3493, baseType: !973, size: 8, align: 8, offset: 576)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1443, file: !4, line: 3494, baseType: !1107, size: 64, align: 64, offset: 640)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1443, file: !4, line: 3495, baseType: !1468, size: 64, align: 64, offset: 704)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1470)
!1470 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1471)
!1471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1472)
!1472 = !{!1473, !1474}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1471, file: !4, line: 3402, baseType: !943, size: 32, align: 32)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1471, file: !4, line: 3403, baseType: !1091, size: 64, align: 64, offset: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1443, file: !4, line: 3507, baseType: !1091, size: 64, align: 64, offset: 768)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1443, file: !4, line: 3516, baseType: !943, size: 32, align: 32, offset: 832)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1443, file: !4, line: 3517, baseType: !1478, size: 64, align: 64, offset: 896)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1443, file: !4, line: 3527, baseType: !1480, size: 64, align: 64, offset: 960)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DISubroutineType(types: !1482)
!1482 = !{!943, !1433}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1443, file: !4, line: 3535, baseType: !1484, size: 64, align: 64, offset: 1024)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!943, !1433, !1487}
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1434)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1443, file: !4, line: 3541, baseType: !1490, size: 64, align: 64, offset: 1088)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1492)
!1492 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1493)
!1493 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1443, file: !4, line: 3549, baseType: !1495, size: 64, align: 64, offset: 1152)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{null, !1478}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1443, file: !4, line: 3551, baseType: !1480, size: 64, align: 64, offset: 1216)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1443, file: !4, line: 3552, baseType: !1500, size: 64, align: 64, offset: 1280)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{!943, !1433, !1007, !943, !1503}
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1505)
!1505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1506)
!1506 = !{!1507, !1508, !1509, !1510, !1511, !1539}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1505, file: !4, line: 3921, baseType: !982, size: 16, align: 16)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1505, file: !4, line: 3922, baseType: !952, size: 32, align: 32, offset: 32)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1505, file: !4, line: 3923, baseType: !952, size: 32, align: 32, offset: 64)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1505, file: !4, line: 3924, baseType: !953, size: 32, align: 32, offset: 96)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1505, file: !4, line: 3925, baseType: !1512, size: 64, align: 64, offset: 128)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1515)
!1515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1516)
!1516 = !{!1517, !1518, !1519, !1520, !1521, !1522, !1528, !1532, !1534, !1535, !1537, !1538}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1515, file: !4, line: 3886, baseType: !943, size: 32, align: 32)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1515, file: !4, line: 3887, baseType: !943, size: 32, align: 32, offset: 32)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1515, file: !4, line: 3888, baseType: !943, size: 32, align: 32, offset: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1515, file: !4, line: 3889, baseType: !943, size: 32, align: 32, offset: 96)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1515, file: !4, line: 3890, baseType: !943, size: 32, align: 32, offset: 128)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1515, file: !4, line: 3897, baseType: !1523, size: 768, align: 64, offset: 192)
!1523 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1524)
!1524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1525)
!1525 = !{!1526, !1527}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1524, file: !4, line: 3855, baseType: !1259, size: 512, align: 64)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1524, file: !4, line: 3857, baseType: !1263, size: 256, align: 32, offset: 512)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1515, file: !4, line: 3903, baseType: !1529, size: 256, align: 64, offset: 960)
!1529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1007, size: 256, align: 64, elements: !1530)
!1530 = !{!1531}
!1531 = !DISubrange(count: 4)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1515, file: !4, line: 3904, baseType: !1533, size: 128, align: 32, offset: 1216)
!1533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 128, align: 32, elements: !1530)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1515, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1515, file: !4, line: 3908, baseType: !1536, size: 64, align: 64, offset: 1408)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1515, file: !4, line: 3915, baseType: !1536, size: 64, align: 64, offset: 1472)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1515, file: !4, line: 3917, baseType: !943, size: 32, align: 32, offset: 1536)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1505, file: !4, line: 3926, baseType: !955, size: 64, align: 64, offset: 192)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1443, file: !4, line: 3564, baseType: !1541, size: 64, align: 64, offset: 1344)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{!943, !1433, !1228, !1544, !1546}
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1255)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1443, file: !4, line: 3566, baseType: !1548, size: 64, align: 64, offset: 1408)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DISubroutineType(types: !1550)
!1550 = !{!943, !1433, !1117, !1546, !1228}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1443, file: !4, line: 3567, baseType: !1480, size: 64, align: 64, offset: 1472)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1443, file: !4, line: 3576, baseType: !1553, size: 64, align: 64, offset: 1536)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DISubroutineType(types: !1555)
!1555 = !{!943, !1433, !1544}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1443, file: !4, line: 3577, baseType: !1557, size: 64, align: 64, offset: 1600)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{!943, !1433, !1228}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1443, file: !4, line: 3584, baseType: !1561, size: 64, align: 64, offset: 1664)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{!943, !1433, !1254}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1443, file: !4, line: 3589, baseType: !1565, size: 64, align: 64, offset: 1728)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64, align: 64)
!1566 = !DISubroutineType(types: !1567)
!1567 = !{null, !1433}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1443, file: !4, line: 3594, baseType: !943, size: 32, align: 32, offset: 1792)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1443, file: !4, line: 3600, baseType: !1091, size: 64, align: 64, offset: 1856)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1443, file: !4, line: 3609, baseType: !1571, size: 64, align: 64, offset: 1920)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1574)
!1574 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1435, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1435, file: !4, line: 1581, baseType: !953, size: 32, align: 32, offset: 224)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1435, file: !4, line: 1583, baseType: !1117, size: 64, align: 64, offset: 256)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1435, file: !4, line: 1591, baseType: !1579, size: 64, align: 64, offset: 320)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1435, file: !4, line: 1598, baseType: !1117, size: 64, align: 64, offset: 384)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1435, file: !4, line: 1606, baseType: !955, size: 64, align: 64, offset: 448)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1435, file: !4, line: 1614, baseType: !943, size: 32, align: 32, offset: 512)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1435, file: !4, line: 1622, baseType: !943, size: 32, align: 32, offset: 544)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1435, file: !4, line: 1628, baseType: !943, size: 32, align: 32, offset: 576)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1435, file: !4, line: 1636, baseType: !943, size: 32, align: 32, offset: 608)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1435, file: !4, line: 1643, baseType: !943, size: 32, align: 32, offset: 640)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1435, file: !4, line: 1657, baseType: !1007, size: 64, align: 64, offset: 704)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1435, file: !4, line: 1658, baseType: !943, size: 32, align: 32, offset: 768)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1435, file: !4, line: 1679, baseType: !1052, size: 64, align: 32, offset: 800)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1435, file: !4, line: 1688, baseType: !943, size: 32, align: 32, offset: 864)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1435, file: !4, line: 1712, baseType: !943, size: 32, align: 32, offset: 896)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1435, file: !4, line: 1729, baseType: !943, size: 32, align: 32, offset: 928)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1435, file: !4, line: 1729, baseType: !943, size: 32, align: 32, offset: 960)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1435, file: !4, line: 1744, baseType: !943, size: 32, align: 32, offset: 992)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1435, file: !4, line: 1744, baseType: !943, size: 32, align: 32, offset: 1024)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1435, file: !4, line: 1751, baseType: !943, size: 32, align: 32, offset: 1056)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1435, file: !4, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1435, file: !4, line: 1791, baseType: !1600, size: 64, align: 64, offset: 1152)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DISubroutineType(types: !1602)
!1602 = !{null, !1603, !1544, !1546, !943, !943, !943}
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1435, file: !4, line: 1808, baseType: !1605, size: 64, align: 64, offset: 1216)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DISubroutineType(types: !1607)
!1607 = !{!667, !1603, !1454}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1435, file: !4, line: 1816, baseType: !943, size: 32, align: 32, offset: 1280)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1435, file: !4, line: 1825, baseType: !1610, size: 32, align: 32, offset: 1312)
!1610 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1435, file: !4, line: 1830, baseType: !943, size: 32, align: 32, offset: 1344)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1435, file: !4, line: 1838, baseType: !1610, size: 32, align: 32, offset: 1376)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1435, file: !4, line: 1846, baseType: !943, size: 32, align: 32, offset: 1408)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1435, file: !4, line: 1851, baseType: !943, size: 32, align: 32, offset: 1440)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1435, file: !4, line: 1861, baseType: !1610, size: 32, align: 32, offset: 1472)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1435, file: !4, line: 1868, baseType: !1610, size: 32, align: 32, offset: 1504)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1435, file: !4, line: 1875, baseType: !1610, size: 32, align: 32, offset: 1536)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1435, file: !4, line: 1882, baseType: !1610, size: 32, align: 32, offset: 1568)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1435, file: !4, line: 1889, baseType: !1610, size: 32, align: 32, offset: 1600)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1435, file: !4, line: 1896, baseType: !1610, size: 32, align: 32, offset: 1632)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1435, file: !4, line: 1903, baseType: !1610, size: 32, align: 32, offset: 1664)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1435, file: !4, line: 1910, baseType: !943, size: 32, align: 32, offset: 1696)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1435, file: !4, line: 1915, baseType: !943, size: 32, align: 32, offset: 1728)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1435, file: !4, line: 1926, baseType: !1546, size: 64, align: 64, offset: 1792)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1435, file: !4, line: 1935, baseType: !1052, size: 64, align: 32, offset: 1856)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1435, file: !4, line: 1942, baseType: !943, size: 32, align: 32, offset: 1920)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1435, file: !4, line: 1948, baseType: !943, size: 32, align: 32, offset: 1952)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1435, file: !4, line: 1954, baseType: !943, size: 32, align: 32, offset: 1984)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1435, file: !4, line: 1960, baseType: !943, size: 32, align: 32, offset: 2016)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1435, file: !4, line: 1984, baseType: !943, size: 32, align: 32, offset: 2048)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1435, file: !4, line: 1991, baseType: !943, size: 32, align: 32, offset: 2080)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1435, file: !4, line: 1996, baseType: !943, size: 32, align: 32, offset: 2112)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1435, file: !4, line: 2004, baseType: !943, size: 32, align: 32, offset: 2144)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1435, file: !4, line: 2011, baseType: !943, size: 32, align: 32, offset: 2176)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1435, file: !4, line: 2018, baseType: !943, size: 32, align: 32, offset: 2208)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1435, file: !4, line: 2027, baseType: !943, size: 32, align: 32, offset: 2240)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1435, file: !4, line: 2034, baseType: !943, size: 32, align: 32, offset: 2272)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1435, file: !4, line: 2044, baseType: !943, size: 32, align: 32, offset: 2304)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1435, file: !4, line: 2054, baseType: !1640, size: 64, align: 64, offset: 2368)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1435, file: !4, line: 2061, baseType: !1640, size: 64, align: 64, offset: 2432)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1435, file: !4, line: 2066, baseType: !943, size: 32, align: 32, offset: 2496)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1435, file: !4, line: 2070, baseType: !943, size: 32, align: 32, offset: 2528)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1435, file: !4, line: 2078, baseType: !943, size: 32, align: 32, offset: 2560)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1435, file: !4, line: 2085, baseType: !943, size: 32, align: 32, offset: 2592)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1435, file: !4, line: 2092, baseType: !943, size: 32, align: 32, offset: 2624)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1435, file: !4, line: 2099, baseType: !943, size: 32, align: 32, offset: 2656)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1435, file: !4, line: 2106, baseType: !943, size: 32, align: 32, offset: 2688)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1435, file: !4, line: 2113, baseType: !943, size: 32, align: 32, offset: 2720)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1435, file: !4, line: 2120, baseType: !943, size: 32, align: 32, offset: 2752)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1435, file: !4, line: 2125, baseType: !943, size: 32, align: 32, offset: 2784)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1435, file: !4, line: 2133, baseType: !943, size: 32, align: 32, offset: 2816)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1435, file: !4, line: 2140, baseType: !943, size: 32, align: 32, offset: 2848)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1435, file: !4, line: 2145, baseType: !943, size: 32, align: 32, offset: 2880)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1435, file: !4, line: 2153, baseType: !943, size: 32, align: 32, offset: 2912)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1435, file: !4, line: 2158, baseType: !943, size: 32, align: 32, offset: 2944)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1435, file: !4, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1435, file: !4, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1435, file: !4, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1435, file: !4, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1435, file: !4, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1435, file: !4, line: 2203, baseType: !943, size: 32, align: 32, offset: 3136)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1435, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1435, file: !4, line: 2212, baseType: !943, size: 32, align: 32, offset: 3200)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1435, file: !4, line: 2213, baseType: !943, size: 32, align: 32, offset: 3232)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1435, file: !4, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1435, file: !4, line: 2232, baseType: !943, size: 32, align: 32, offset: 3296)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1435, file: !4, line: 2243, baseType: !943, size: 32, align: 32, offset: 3328)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1435, file: !4, line: 2249, baseType: !943, size: 32, align: 32, offset: 3360)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1435, file: !4, line: 2256, baseType: !943, size: 32, align: 32, offset: 3392)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1435, file: !4, line: 2263, baseType: !947, size: 64, align: 64, offset: 3456)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1435, file: !4, line: 2270, baseType: !947, size: 64, align: 64, offset: 3520)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1435, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1435, file: !4, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1435, file: !4, line: 2367, baseType: !1676, size: 64, align: 64, offset: 3648)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DISubroutineType(types: !1678)
!1678 = !{!943, !1603, !1254, !943}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1435, file: !4, line: 2383, baseType: !943, size: 32, align: 32, offset: 3712)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1435, file: !4, line: 2386, baseType: !1610, size: 32, align: 32, offset: 3744)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1435, file: !4, line: 2387, baseType: !1610, size: 32, align: 32, offset: 3776)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1435, file: !4, line: 2394, baseType: !943, size: 32, align: 32, offset: 3808)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1435, file: !4, line: 2401, baseType: !943, size: 32, align: 32, offset: 3840)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1435, file: !4, line: 2408, baseType: !943, size: 32, align: 32, offset: 3872)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1435, file: !4, line: 2415, baseType: !943, size: 32, align: 32, offset: 3904)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1435, file: !4, line: 2422, baseType: !943, size: 32, align: 32, offset: 3936)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1435, file: !4, line: 2423, baseType: !1688, size: 64, align: 64, offset: 3968)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1690)
!1690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1691)
!1691 = !{!1692, !1693, !1694, !1695}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1690, file: !4, line: 827, baseType: !943, size: 32, align: 32)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1690, file: !4, line: 828, baseType: !943, size: 32, align: 32, offset: 32)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1690, file: !4, line: 829, baseType: !943, size: 32, align: 32, offset: 64)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1690, file: !4, line: 830, baseType: !1610, size: 32, align: 32, offset: 96)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1435, file: !4, line: 2430, baseType: !955, size: 64, align: 64, offset: 4032)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1435, file: !4, line: 2437, baseType: !955, size: 64, align: 64, offset: 4096)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1435, file: !4, line: 2444, baseType: !1610, size: 32, align: 32, offset: 4160)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1435, file: !4, line: 2451, baseType: !1610, size: 32, align: 32, offset: 4192)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1435, file: !4, line: 2458, baseType: !943, size: 32, align: 32, offset: 4224)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1435, file: !4, line: 2469, baseType: !943, size: 32, align: 32, offset: 4256)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1435, file: !4, line: 2475, baseType: !943, size: 32, align: 32, offset: 4288)
