; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--dv.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--dv.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProbeData = type { i8*, i8*, i32, i8* }

!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !225, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !225, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dv_pack_type", file: !917, line: 67, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "./libavcodec/dv.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!918 = !{!919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930}
!919 = !DIEnumerator(name: "dv_header525", value: 63)
!920 = !DIEnumerator(name: "dv_header625", value: 191)
!921 = !DIEnumerator(name: "dv_timecode", value: 19)
!922 = !DIEnumerator(name: "dv_audio_source", value: 80)
!923 = !DIEnumerator(name: "dv_audio_control", value: 81)
!924 = !DIEnumerator(name: "dv_audio_recdate", value: 82)
!925 = !DIEnumerator(name: "dv_audio_rectime", value: 83)
!926 = !DIEnumerator(name: "dv_video_source", value: 96)
!927 = !DIEnumerator(name: "dv_video_control", value: 97)
!928 = !DIEnumerator(name: "dv_video_recdate", value: 98)
!929 = !DIEnumerator(name: "dv_video_rectime", value: 99)
!930 = !DIEnumerator(name: "dv_unknown_pack", value: 255)
!931 = !{!932, !933, !934, !935, !938, !945}
!932 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!933 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !936, line: 49, baseType: !937)
!936 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!937 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !941, line: 221, size: 32, align: 8, elements: !942)
!941 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!942 = !{!943}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !940, file: !941, line: 221, baseType: !944, size: 32, align: 32)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !936, line: 51, baseType: !933)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!946 = !{!947, !2159}
!947 = distinct !DIGlobalVariable(name: "ff_dv_demuxer", scope: !0, file: !948, line: 632, type: !949, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_dv_demuxer)
!948 = !DIFile(filename: "libavformat/dv.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !897, line: 777, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !951)
!951 = !{!952, !956, !957, !958, !959, !969, !1010, !1011, !1013, !1014, !1015, !1029, !2140, !2141, !2142, !2146, !2150, !2151, !2152, !2156, !2157, !2158}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !950, file: !897, line: 638, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !950, file: !897, line: 645, baseType: !953, size: 64, align: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !950, file: !897, line: 652, baseType: !932, size: 32, align: 32, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !950, file: !897, line: 659, baseType: !953, size: 64, align: 64, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !950, file: !897, line: 661, baseType: !960, size: 64, align: 64, offset: 256)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !965, line: 44, size: 64, align: 32, elements: !966)
!965 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!966 = !{!967, !968}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !964, file: !965, line: 45, baseType: !224, size: 32, align: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !964, file: !965, line: 46, baseType: !933, size: 32, align: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !950, file: !897, line: 663, baseType: !970, size: 64, align: 64, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !204, line: 143, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !204, line: 67, size: 640, align: 64, elements: !974)
!974 = !{!975, !976, !980, !984, !985, !986, !987, !991, !997, !999, !1003}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !973, file: !204, line: 72, baseType: !953, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !973, file: !204, line: 78, baseType: !977, size: 64, align: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!953, !934}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !973, file: !204, line: 85, baseType: !981, size: 64, align: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !204, line: 85, flags: DIFlagFwdDecl)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !973, file: !204, line: 93, baseType: !932, size: 32, align: 32, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !973, file: !204, line: 99, baseType: !932, size: 32, align: 32, offset: 224)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !973, file: !204, line: 108, baseType: !932, size: 32, align: 32, offset: 256)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !973, file: !204, line: 113, baseType: !988, size: 64, align: 64, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!934, !934, !934}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !973, file: !204, line: 123, baseType: !992, size: 64, align: 64, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!995, !995}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !973, file: !204, line: 130, baseType: !998, size: 32, align: 32, offset: 448)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !204, line: 48, baseType: !203)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !973, file: !204, line: 136, baseType: !1000, size: 64, align: 64, offset: 512)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!998, !934}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !973, file: !204, line: 142, baseType: !1004, size: 64, align: 64, offset: 576)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!932, !1007, !934, !953, !932}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !204, line: 60, flags: DIFlagFwdDecl)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !950, file: !897, line: 670, baseType: !953, size: 64, align: 64, offset: 384)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !950, file: !897, line: 679, baseType: !1012, size: 64, align: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !950, file: !897, line: 684, baseType: !932, size: 32, align: 32, offset: 512)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !950, file: !897, line: 689, baseType: !932, size: 32, align: 32, offset: 544)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !950, file: !897, line: 696, baseType: !1016, size: 64, align: 64, offset: 576)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!932, !1019}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1022)
!1022 = !{!1023, !1024, !1027, !1028}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1021, file: !897, line: 449, baseType: !953, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1021, file: !897, line: 450, baseType: !1025, size: 64, align: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1021, file: !897, line: 451, baseType: !932, size: 32, align: 32, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1021, file: !897, line: 452, baseType: !953, size: 64, align: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !950, file: !897, line: 703, baseType: !1030, size: 64, align: 64, offset: 640)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!932, !1033}
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1035)
!1035 = !{!1036, !1037, !1038, !1238, !1239, !1304, !1305, !1306, !1997, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2051, !2052, !2053, !2054, !2055, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2106, !2107, !2110, !2111, !2112, !2113, !2114, !2115, !2117, !2118, !2119, !2120, !2128, !2129, !2133, !2137, !2138, !2139}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1034, file: !897, line: 1342, baseType: !970, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1034, file: !897, line: 1349, baseType: !1012, size: 64, align: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1034, file: !897, line: 1356, baseType: !1039, size: 64, align: 64, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1041)
!1041 = !{!1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1097, !1098, !1102, !1106, !1111, !1118, !1213, !1219, !1225, !1226, !1227, !1228, !1232}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1040, file: !897, line: 498, baseType: !953, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1040, file: !897, line: 504, baseType: !953, size: 64, align: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1040, file: !897, line: 505, baseType: !953, size: 64, align: 64, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1040, file: !897, line: 506, baseType: !953, size: 64, align: 64, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1040, file: !897, line: 508, baseType: !224, size: 32, align: 32, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1040, file: !897, line: 509, baseType: !224, size: 32, align: 32, offset: 288)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1040, file: !897, line: 510, baseType: !224, size: 32, align: 32, offset: 320)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1040, file: !897, line: 517, baseType: !932, size: 32, align: 32, offset: 352)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1040, file: !897, line: 523, baseType: !960, size: 64, align: 64, offset: 384)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1040, file: !897, line: 526, baseType: !970, size: 64, align: 64, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1040, file: !897, line: 535, baseType: !1039, size: 64, align: 64, offset: 512)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1040, file: !897, line: 539, baseType: !932, size: 32, align: 32, offset: 576)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1040, file: !897, line: 541, baseType: !1030, size: 64, align: 64, offset: 640)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1040, file: !897, line: 549, baseType: !1056, size: 64, align: 64, offset: 704)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!932, !1033, !1059}
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !225, line: 1499, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !225, line: 1445, size: 704, align: 64, elements: !1062)
!1062 = !{!1063, !1077, !1080, !1081, !1082, !1083, !1084, !1085, !1093, !1094, !1095, !1096}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1061, file: !225, line: 1451, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1066, line: 94, baseType: !1067)
!1066 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1066, line: 81, size: 192, align: 64, elements: !1068)
!1068 = !{!1069, !1073, !1076}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1067, file: !1066, line: 82, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1066, line: 73, baseType: !1072)
!1072 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1066, line: 73, flags: DIFlagFwdDecl)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1067, file: !1066, line: 89, baseType: !1074, size: 64, align: 64, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !936, line: 48, baseType: !1026)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1067, file: !1066, line: 93, baseType: !932, size: 32, align: 32, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1061, file: !225, line: 1461, baseType: !1078, size: 64, align: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !936, line: 40, baseType: !1079)
!1079 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1061, file: !225, line: 1467, baseType: !1078, size: 64, align: 64, offset: 128)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1061, file: !225, line: 1468, baseType: !1074, size: 64, align: 64, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1061, file: !225, line: 1469, baseType: !932, size: 32, align: 32, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1061, file: !225, line: 1470, baseType: !932, size: 32, align: 32, offset: 288)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1061, file: !225, line: 1474, baseType: !932, size: 32, align: 32, offset: 320)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1061, file: !225, line: 1479, baseType: !1086, size: 64, align: 64, offset: 384)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !225, line: 1415, baseType: !1088)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !225, line: 1411, size: 128, align: 64, elements: !1089)
!1089 = !{!1090, !1091, !1092}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1088, file: !225, line: 1412, baseType: !1074, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1088, file: !225, line: 1413, baseType: !932, size: 32, align: 32, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1088, file: !225, line: 1414, baseType: !684, size: 32, align: 32, offset: 96)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1061, file: !225, line: 1480, baseType: !932, size: 32, align: 32, offset: 448)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1061, file: !225, line: 1486, baseType: !1078, size: 64, align: 64, offset: 512)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1061, file: !225, line: 1488, baseType: !1078, size: 64, align: 64, offset: 576)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1061, file: !225, line: 1497, baseType: !1078, size: 64, align: 64, offset: 640)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1040, file: !897, line: 550, baseType: !1030, size: 64, align: 64, offset: 768)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1040, file: !897, line: 554, baseType: !1099, size: 64, align: 64, offset: 832)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!932, !1033, !1059, !1059, !932}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1040, file: !897, line: 563, baseType: !1103, size: 64, align: 64, offset: 896)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!932, !224, !932}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1040, file: !897, line: 565, baseType: !1107, size: 64, align: 64, offset: 960)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{null, !1033, !932, !1110, !1110}
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1040, file: !897, line: 570, baseType: !1112, size: 64, align: 64, offset: 1024)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!932, !1033, !932, !934, !1115}
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1116, line: 216, baseType: !1117)
!1116 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1117 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1040, file: !897, line: 581, baseType: !1119, size: 64, align: 64, offset: 1088)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!932, !1033, !932, !1122, !933}
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !726, line: 646, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !726, line: 268, size: 4288, align: 64, elements: !1126)
!1126 = !{!1127, !1131, !1133, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1167, !1169, !1170, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1125, file: !726, line: 282, baseType: !1128, size: 512, align: 64)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1074, size: 512, align: 64, elements: !1129)
!1129 = !{!1130}
!1130 = !DISubrange(count: 8)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1125, file: !726, line: 299, baseType: !1132, size: 256, align: 32, offset: 512)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 256, align: 32, elements: !1129)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1125, file: !726, line: 315, baseType: !1134, size: 64, align: 64, offset: 768)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1125, file: !726, line: 326, baseType: !932, size: 32, align: 32, offset: 832)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1125, file: !726, line: 326, baseType: !932, size: 32, align: 32, offset: 864)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1125, file: !726, line: 334, baseType: !932, size: 32, align: 32, offset: 896)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1125, file: !726, line: 341, baseType: !932, size: 32, align: 32, offset: 928)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1125, file: !726, line: 346, baseType: !932, size: 32, align: 32, offset: 960)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1125, file: !726, line: 351, baseType: !714, size: 32, align: 32, offset: 992)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1125, file: !726, line: 356, baseType: !1142, size: 64, align: 32, offset: 1024)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1143, line: 61, baseType: !1144)
!1143 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1143, line: 58, size: 64, align: 32, elements: !1145)
!1145 = !{!1146, !1147}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1144, file: !1143, line: 59, baseType: !932, size: 32, align: 32)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1144, file: !1143, line: 60, baseType: !932, size: 32, align: 32, offset: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1125, file: !726, line: 361, baseType: !1078, size: 64, align: 64, offset: 1088)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1125, file: !726, line: 369, baseType: !1078, size: 64, align: 64, offset: 1152)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1125, file: !726, line: 377, baseType: !1078, size: 64, align: 64, offset: 1216)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1125, file: !726, line: 382, baseType: !932, size: 32, align: 32, offset: 1280)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1125, file: !726, line: 386, baseType: !932, size: 32, align: 32, offset: 1312)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1125, file: !726, line: 391, baseType: !932, size: 32, align: 32, offset: 1344)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1125, file: !726, line: 396, baseType: !934, size: 64, align: 64, offset: 1408)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1125, file: !726, line: 403, baseType: !1156, size: 512, align: 64, offset: 1472)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1157, size: 512, align: 64, elements: !1129)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !936, line: 55, baseType: !1117)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1125, file: !726, line: 410, baseType: !932, size: 32, align: 32, offset: 1984)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1125, file: !726, line: 415, baseType: !932, size: 32, align: 32, offset: 2016)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1125, file: !726, line: 420, baseType: !932, size: 32, align: 32, offset: 2048)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1125, file: !726, line: 425, baseType: !932, size: 32, align: 32, offset: 2080)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1125, file: !726, line: 435, baseType: !1078, size: 64, align: 64, offset: 2112)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1125, file: !726, line: 440, baseType: !932, size: 32, align: 32, offset: 2176)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1125, file: !726, line: 445, baseType: !1157, size: 64, align: 64, offset: 2240)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1125, file: !726, line: 459, baseType: !1166, size: 512, align: 64, offset: 2304)
!1166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1064, size: 512, align: 64, elements: !1129)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1125, file: !726, line: 473, baseType: !1168, size: 64, align: 64, offset: 2816)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1125, file: !726, line: 477, baseType: !932, size: 32, align: 32, offset: 2880)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1125, file: !726, line: 479, baseType: !1171, size: 64, align: 64, offset: 2944)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !726, line: 207, baseType: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !726, line: 201, size: 320, align: 64, elements: !1175)
!1175 = !{!1176, !1177, !1178, !1179, !1184}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1174, file: !726, line: 202, baseType: !725, size: 32, align: 32)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1174, file: !726, line: 203, baseType: !1074, size: 64, align: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1174, file: !726, line: 204, baseType: !932, size: 32, align: 32, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1174, file: !726, line: 205, baseType: !1180, size: 64, align: 64, offset: 192)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1182, line: 86, baseType: !1183)
!1182 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1183 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1182, line: 86, flags: DIFlagFwdDecl)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1174, file: !726, line: 206, baseType: !1064, size: 64, align: 64, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1125, file: !726, line: 480, baseType: !932, size: 32, align: 32, offset: 3008)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1125, file: !726, line: 505, baseType: !932, size: 32, align: 32, offset: 3040)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1125, file: !726, line: 512, baseType: !749, size: 32, align: 32, offset: 3072)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1125, file: !726, line: 514, baseType: !755, size: 32, align: 32, offset: 3104)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1125, file: !726, line: 516, baseType: !773, size: 32, align: 32, offset: 3136)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1125, file: !726, line: 523, baseType: !797, size: 32, align: 32, offset: 3168)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1125, file: !726, line: 525, baseType: !816, size: 32, align: 32, offset: 3200)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1125, file: !726, line: 532, baseType: !1078, size: 64, align: 64, offset: 3264)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1125, file: !726, line: 539, baseType: !1078, size: 64, align: 64, offset: 3328)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1125, file: !726, line: 547, baseType: !1078, size: 64, align: 64, offset: 3392)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1125, file: !726, line: 554, baseType: !1180, size: 64, align: 64, offset: 3456)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1125, file: !726, line: 563, baseType: !932, size: 32, align: 32, offset: 3520)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1125, file: !726, line: 572, baseType: !932, size: 32, align: 32, offset: 3552)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1125, file: !726, line: 581, baseType: !932, size: 32, align: 32, offset: 3584)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1125, file: !726, line: 588, baseType: !1200, size: 64, align: 64, offset: 3648)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !936, line: 36, baseType: !1202)
!1202 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1125, file: !726, line: 593, baseType: !932, size: 32, align: 32, offset: 3712)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1125, file: !726, line: 596, baseType: !932, size: 32, align: 32, offset: 3744)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1125, file: !726, line: 599, baseType: !1064, size: 64, align: 64, offset: 3776)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1125, file: !726, line: 605, baseType: !1064, size: 64, align: 64, offset: 3840)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1125, file: !726, line: 616, baseType: !1064, size: 64, align: 64, offset: 3904)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1125, file: !726, line: 626, baseType: !1115, size: 64, align: 64, offset: 3968)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1125, file: !726, line: 627, baseType: !1115, size: 64, align: 64, offset: 4032)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1125, file: !726, line: 628, baseType: !1115, size: 64, align: 64, offset: 4096)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1125, file: !726, line: 629, baseType: !1115, size: 64, align: 64, offset: 4160)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1125, file: !726, line: 645, baseType: !1064, size: 64, align: 64, offset: 4224)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1040, file: !897, line: 587, baseType: !1214, size: 64, align: 64, offset: 1152)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!932, !1033, !1217}
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1040, file: !897, line: 592, baseType: !1220, size: 64, align: 64, offset: 1216)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!932, !1033, !1223}
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1040, file: !897, line: 597, baseType: !1220, size: 64, align: 64, offset: 1280)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1040, file: !897, line: 598, baseType: !224, size: 32, align: 32, offset: 1344)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1040, file: !897, line: 608, baseType: !1030, size: 64, align: 64, offset: 1408)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1040, file: !897, line: 617, baseType: !1229, size: 64, align: 64, offset: 1472)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{null, !1033}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1040, file: !897, line: 623, baseType: !1233, size: 64, align: 64, offset: 1536)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!932, !1033, !1236}
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1034, file: !897, line: 1365, baseType: !934, size: 64, align: 64, offset: 192)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1034, file: !897, line: 1379, baseType: !1240, size: 64, align: 64, offset: 256)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !827, line: 352, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !827, line: 161, size: 2112, align: 64, elements: !1243)
!1243 = !{!1244, !1245, !1246, !1247, !1248, !1249, !1250, !1254, !1255, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1271, !1272, !1276, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1294, !1295, !1296, !1297, !1301, !1302, !1303}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1242, file: !827, line: 174, baseType: !970, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1242, file: !827, line: 226, baseType: !1025, size: 64, align: 64, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1242, file: !827, line: 227, baseType: !932, size: 32, align: 32, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1242, file: !827, line: 228, baseType: !1025, size: 64, align: 64, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1242, file: !827, line: 229, baseType: !1025, size: 64, align: 64, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1242, file: !827, line: 233, baseType: !934, size: 64, align: 64, offset: 320)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1242, file: !827, line: 235, baseType: !1251, size: 64, align: 64, offset: 384)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!932, !934, !1074, !932}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1242, file: !827, line: 236, baseType: !1251, size: 64, align: 64, offset: 448)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1242, file: !827, line: 237, baseType: !1256, size: 64, align: 64, offset: 512)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!1078, !934, !1078, !932}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1242, file: !827, line: 238, baseType: !1078, size: 64, align: 64, offset: 576)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1242, file: !827, line: 239, baseType: !932, size: 32, align: 32, offset: 640)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1242, file: !827, line: 240, baseType: !932, size: 32, align: 32, offset: 672)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1242, file: !827, line: 241, baseType: !932, size: 32, align: 32, offset: 704)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1242, file: !827, line: 242, baseType: !1117, size: 64, align: 64, offset: 768)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1242, file: !827, line: 243, baseType: !1025, size: 64, align: 64, offset: 832)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1242, file: !827, line: 244, baseType: !1266, size: 64, align: 64, offset: 896)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!1117, !1117, !1269, !933}
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1075)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1242, file: !827, line: 245, baseType: !932, size: 32, align: 32, offset: 960)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1242, file: !827, line: 249, baseType: !1273, size: 64, align: 64, offset: 1024)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!932, !934, !932}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1242, file: !827, line: 255, baseType: !1277, size: 64, align: 64, offset: 1088)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!1078, !934, !932, !1078, !932}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1242, file: !827, line: 260, baseType: !932, size: 32, align: 32, offset: 1152)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1242, file: !827, line: 266, baseType: !1078, size: 64, align: 64, offset: 1216)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1242, file: !827, line: 273, baseType: !932, size: 32, align: 32, offset: 1280)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1242, file: !827, line: 279, baseType: !1078, size: 64, align: 64, offset: 1344)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1242, file: !827, line: 285, baseType: !932, size: 32, align: 32, offset: 1408)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1242, file: !827, line: 291, baseType: !932, size: 32, align: 32, offset: 1440)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1242, file: !827, line: 298, baseType: !932, size: 32, align: 32, offset: 1472)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1242, file: !827, line: 304, baseType: !932, size: 32, align: 32, offset: 1504)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1242, file: !827, line: 309, baseType: !953, size: 64, align: 64, offset: 1536)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1242, file: !827, line: 314, baseType: !953, size: 64, align: 64, offset: 1600)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1242, file: !827, line: 319, baseType: !1291, size: 64, align: 64, offset: 1664)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!932, !934, !1074, !932, !826, !1078}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1242, file: !827, line: 326, baseType: !932, size: 32, align: 32, offset: 1728)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1242, file: !827, line: 331, baseType: !826, size: 32, align: 32, offset: 1760)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1242, file: !827, line: 332, baseType: !1078, size: 64, align: 64, offset: 1792)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1242, file: !827, line: 338, baseType: !1298, size: 64, align: 64, offset: 1856)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!932, !934}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1242, file: !827, line: 340, baseType: !1078, size: 64, align: 64, offset: 1920)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1242, file: !827, line: 346, baseType: !1025, size: 64, align: 64, offset: 1984)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1242, file: !827, line: 351, baseType: !932, size: 32, align: 32, offset: 2048)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1034, file: !897, line: 1386, baseType: !932, size: 32, align: 32, offset: 320)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1034, file: !897, line: 1393, baseType: !933, size: 32, align: 32, offset: 352)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1034, file: !897, line: 1405, baseType: !1307, size: 64, align: 64, offset: 384)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1311)
!1311 = !{!1312, !1313, !1314, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1782, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1883, !1889, !1890, !1894, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1926, !1927, !1928, !1929, !1930, !1931}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1310, file: !897, line: 866, baseType: !932, size: 32, align: 32)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1310, file: !897, line: 872, baseType: !932, size: 32, align: 32, offset: 32)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1310, file: !897, line: 878, baseType: !1315, size: 64, align: 64, offset: 64)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !225, line: 3360, baseType: !1317)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !225, line: 1556, size: 8448, align: 64, elements: !1318)
!1318 = !{!1319, !1320, !1321, !1322, !1457, !1458, !1459, !1460, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1486, !1490, !1491, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1670, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1317, file: !225, line: 1561, baseType: !970, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1317, file: !225, line: 1562, baseType: !932, size: 32, align: 32, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1317, file: !225, line: 1564, baseType: !835, size: 32, align: 32, offset: 96)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1317, file: !225, line: 1565, baseType: !1323, size: 64, align: 64, offset: 128)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1325)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !225, line: 3468, size: 1984, align: 64, elements: !1326)
!1326 = !{!1327, !1328, !1329, !1330, !1331, !1332, !1335, !1338, !1341, !1344, !1347, !1348, !1349, !1357, !1358, !1359, !1361, !1365, !1371, !1376, !1380, !1381, !1422, !1429, !1433, !1434, !1438, !1442, !1446, !1450, !1451, !1452}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1325, file: !225, line: 3475, baseType: !953, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1325, file: !225, line: 3480, baseType: !953, size: 64, align: 64, offset: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1325, file: !225, line: 3481, baseType: !835, size: 32, align: 32, offset: 128)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1325, file: !225, line: 3482, baseType: !224, size: 32, align: 32, offset: 160)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1325, file: !225, line: 3487, baseType: !932, size: 32, align: 32, offset: 192)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1325, file: !225, line: 3488, baseType: !1333, size: 64, align: 64, offset: 256)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1142)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1325, file: !225, line: 3489, baseType: !1336, size: 64, align: 64, offset: 320)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1325, file: !225, line: 3490, baseType: !1339, size: 64, align: 64, offset: 384)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1325, file: !225, line: 3491, baseType: !1342, size: 64, align: 64, offset: 448)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1325, file: !225, line: 3492, baseType: !1345, size: 64, align: 64, offset: 512)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1157)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1325, file: !225, line: 3493, baseType: !1075, size: 8, align: 8, offset: 576)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1325, file: !225, line: 3494, baseType: !970, size: 64, align: 64, offset: 640)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1325, file: !225, line: 3495, baseType: !1350, size: 64, align: 64, offset: 704)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1352)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !225, line: 3404, baseType: !1353)
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !225, line: 3401, size: 128, align: 64, elements: !1354)
!1354 = !{!1355, !1356}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1353, file: !225, line: 3402, baseType: !932, size: 32, align: 32)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1353, file: !225, line: 3403, baseType: !953, size: 64, align: 64, offset: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1325, file: !225, line: 3507, baseType: !953, size: 64, align: 64, offset: 768)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1325, file: !225, line: 3516, baseType: !932, size: 32, align: 32, offset: 832)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1325, file: !225, line: 3517, baseType: !1360, size: 64, align: 64, offset: 896)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1325, file: !225, line: 3527, baseType: !1362, size: 64, align: 64, offset: 960)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{!932, !1315}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1325, file: !225, line: 3535, baseType: !1366, size: 64, align: 64, offset: 1024)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{!932, !1315, !1369}
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1316)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1325, file: !225, line: 3541, baseType: !1372, size: 64, align: 64, offset: 1088)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1374)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !225, line: 3461, baseType: !1375)
!1375 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !225, line: 3461, flags: DIFlagFwdDecl)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1325, file: !225, line: 3549, baseType: !1377, size: 64, align: 64, offset: 1152)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DISubroutineType(types: !1379)
!1379 = !{null, !1360}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1325, file: !225, line: 3551, baseType: !1362, size: 64, align: 64, offset: 1216)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1325, file: !225, line: 3552, baseType: !1382, size: 64, align: 64, offset: 1280)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DISubroutineType(types: !1384)
!1384 = !{!932, !1315, !1074, !932, !1385}
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1387)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !225, line: 3920, size: 256, align: 64, elements: !1388)
!1388 = !{!1389, !1390, !1391, !1392, !1393, !1421}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1387, file: !225, line: 3921, baseType: !935, size: 16, align: 16)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1387, file: !225, line: 3922, baseType: !944, size: 32, align: 32, offset: 32)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1387, file: !225, line: 3923, baseType: !944, size: 32, align: 32, offset: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1387, file: !225, line: 3924, baseType: !933, size: 32, align: 32, offset: 96)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1387, file: !225, line: 3925, baseType: !1394, size: 64, align: 64, offset: 128)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !225, line: 3918, baseType: !1397)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !225, line: 3885, size: 1600, align: 64, elements: !1398)
!1398 = !{!1399, !1400, !1401, !1402, !1403, !1404, !1410, !1414, !1416, !1417, !1419, !1420}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1397, file: !225, line: 3886, baseType: !932, size: 32, align: 32)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1397, file: !225, line: 3887, baseType: !932, size: 32, align: 32, offset: 32)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1397, file: !225, line: 3888, baseType: !932, size: 32, align: 32, offset: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1397, file: !225, line: 3889, baseType: !932, size: 32, align: 32, offset: 96)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1397, file: !225, line: 3890, baseType: !932, size: 32, align: 32, offset: 128)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1397, file: !225, line: 3897, baseType: !1405, size: 768, align: 64, offset: 192)
!1405 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !225, line: 3858, baseType: !1406)
!1406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !225, line: 3853, size: 768, align: 64, elements: !1407)
!1407 = !{!1408, !1409}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1406, file: !225, line: 3855, baseType: !1128, size: 512, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1406, file: !225, line: 3857, baseType: !1132, size: 256, align: 32, offset: 512)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1397, file: !225, line: 3903, baseType: !1411, size: 256, align: 64, offset: 960)
!1411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1074, size: 256, align: 64, elements: !1412)
!1412 = !{!1413}
!1413 = !DISubrange(count: 4)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1397, file: !225, line: 3904, baseType: !1415, size: 128, align: 32, offset: 1216)
!1415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 128, align: 32, elements: !1412)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1397, file: !225, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1397, file: !225, line: 3908, baseType: !1418, size: 64, align: 64, offset: 1408)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1397, file: !225, line: 3915, baseType: !1418, size: 64, align: 64, offset: 1472)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1397, file: !225, line: 3917, baseType: !932, size: 32, align: 32, offset: 1536)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1387, file: !225, line: 3926, baseType: !1078, size: 64, align: 64, offset: 192)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1325, file: !225, line: 3564, baseType: !1423, size: 64, align: 64, offset: 1344)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{!932, !1315, !1059, !1426, !1428}
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1124)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1325, file: !225, line: 3566, baseType: !1430, size: 64, align: 64, offset: 1408)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DISubroutineType(types: !1432)
!1432 = !{!932, !1315, !934, !1428, !1059}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1325, file: !225, line: 3567, baseType: !1362, size: 64, align: 64, offset: 1472)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1325, file: !225, line: 3576, baseType: !1435, size: 64, align: 64, offset: 1536)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{!932, !1315, !1426}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1325, file: !225, line: 3577, baseType: !1439, size: 64, align: 64, offset: 1600)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1440 = !DISubroutineType(types: !1441)
!1441 = !{!932, !1315, !1059}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1325, file: !225, line: 3584, baseType: !1443, size: 64, align: 64, offset: 1664)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DISubroutineType(types: !1445)
!1445 = !{!932, !1315, !1123}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1325, file: !225, line: 3589, baseType: !1447, size: 64, align: 64, offset: 1728)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DISubroutineType(types: !1449)
!1449 = !{null, !1315}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1325, file: !225, line: 3594, baseType: !932, size: 32, align: 32, offset: 1792)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1325, file: !225, line: 3600, baseType: !953, size: 64, align: 64, offset: 1856)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1325, file: !225, line: 3609, baseType: !1453, size: 64, align: 64, offset: 1920)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1456)
!1456 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !225, line: 3609, flags: DIFlagFwdDecl)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1317, file: !225, line: 1566, baseType: !224, size: 32, align: 32, offset: 192)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1317, file: !225, line: 1581, baseType: !933, size: 32, align: 32, offset: 224)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1317, file: !225, line: 1583, baseType: !934, size: 64, align: 64, offset: 256)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1317, file: !225, line: 1591, baseType: !1461, size: 64, align: 64, offset: 320)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !225, line: 1532, flags: DIFlagFwdDecl)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1317, file: !225, line: 1598, baseType: !934, size: 64, align: 64, offset: 384)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1317, file: !225, line: 1606, baseType: !1078, size: 64, align: 64, offset: 448)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1317, file: !225, line: 1614, baseType: !932, size: 32, align: 32, offset: 512)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1317, file: !225, line: 1622, baseType: !932, size: 32, align: 32, offset: 544)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1317, file: !225, line: 1628, baseType: !932, size: 32, align: 32, offset: 576)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1317, file: !225, line: 1636, baseType: !932, size: 32, align: 32, offset: 608)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1317, file: !225, line: 1643, baseType: !932, size: 32, align: 32, offset: 640)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1317, file: !225, line: 1657, baseType: !1074, size: 64, align: 64, offset: 704)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1317, file: !225, line: 1658, baseType: !932, size: 32, align: 32, offset: 768)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1317, file: !225, line: 1679, baseType: !1142, size: 64, align: 32, offset: 800)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1317, file: !225, line: 1688, baseType: !932, size: 32, align: 32, offset: 864)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1317, file: !225, line: 1712, baseType: !932, size: 32, align: 32, offset: 896)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1317, file: !225, line: 1729, baseType: !932, size: 32, align: 32, offset: 928)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1317, file: !225, line: 1729, baseType: !932, size: 32, align: 32, offset: 960)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1317, file: !225, line: 1744, baseType: !932, size: 32, align: 32, offset: 992)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1317, file: !225, line: 1744, baseType: !932, size: 32, align: 32, offset: 1024)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1317, file: !225, line: 1751, baseType: !932, size: 32, align: 32, offset: 1056)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1317, file: !225, line: 1766, baseType: !3, size: 32, align: 32, offset: 1088)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1317, file: !225, line: 1791, baseType: !1482, size: 64, align: 64, offset: 1152)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DISubroutineType(types: !1484)
!1484 = !{null, !1485, !1426, !1428, !932, !932, !932}
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1317, file: !225, line: 1808, baseType: !1487, size: 64, align: 64, offset: 1216)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DISubroutineType(types: !1489)
!1489 = !{!3, !1485, !1336}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1317, file: !225, line: 1816, baseType: !932, size: 32, align: 32, offset: 1280)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1317, file: !225, line: 1825, baseType: !1492, size: 32, align: 32, offset: 1312)
!1492 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1317, file: !225, line: 1830, baseType: !932, size: 32, align: 32, offset: 1344)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1317, file: !225, line: 1838, baseType: !1492, size: 32, align: 32, offset: 1376)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1317, file: !225, line: 1846, baseType: !932, size: 32, align: 32, offset: 1408)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1317, file: !225, line: 1851, baseType: !932, size: 32, align: 32, offset: 1440)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1317, file: !225, line: 1861, baseType: !1492, size: 32, align: 32, offset: 1472)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1317, file: !225, line: 1868, baseType: !1492, size: 32, align: 32, offset: 1504)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1317, file: !225, line: 1875, baseType: !1492, size: 32, align: 32, offset: 1536)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1317, file: !225, line: 1882, baseType: !1492, size: 32, align: 32, offset: 1568)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1317, file: !225, line: 1889, baseType: !1492, size: 32, align: 32, offset: 1600)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1317, file: !225, line: 1896, baseType: !1492, size: 32, align: 32, offset: 1632)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1317, file: !225, line: 1903, baseType: !1492, size: 32, align: 32, offset: 1664)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1317, file: !225, line: 1910, baseType: !932, size: 32, align: 32, offset: 1696)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1317, file: !225, line: 1915, baseType: !932, size: 32, align: 32, offset: 1728)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1317, file: !225, line: 1926, baseType: !1428, size: 64, align: 64, offset: 1792)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1317, file: !225, line: 1935, baseType: !1142, size: 64, align: 32, offset: 1856)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1317, file: !225, line: 1942, baseType: !932, size: 32, align: 32, offset: 1920)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1317, file: !225, line: 1948, baseType: !932, size: 32, align: 32, offset: 1952)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1317, file: !225, line: 1954, baseType: !932, size: 32, align: 32, offset: 1984)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1317, file: !225, line: 1960, baseType: !932, size: 32, align: 32, offset: 2016)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1317, file: !225, line: 1984, baseType: !932, size: 32, align: 32, offset: 2048)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1317, file: !225, line: 1991, baseType: !932, size: 32, align: 32, offset: 2080)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1317, file: !225, line: 1996, baseType: !932, size: 32, align: 32, offset: 2112)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1317, file: !225, line: 2004, baseType: !932, size: 32, align: 32, offset: 2144)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1317, file: !225, line: 2011, baseType: !932, size: 32, align: 32, offset: 2176)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1317, file: !225, line: 2018, baseType: !932, size: 32, align: 32, offset: 2208)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1317, file: !225, line: 2027, baseType: !932, size: 32, align: 32, offset: 2240)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1317, file: !225, line: 2034, baseType: !932, size: 32, align: 32, offset: 2272)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1317, file: !225, line: 2044, baseType: !932, size: 32, align: 32, offset: 2304)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1317, file: !225, line: 2054, baseType: !1522, size: 64, align: 64, offset: 2368)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1317, file: !225, line: 2061, baseType: !1522, size: 64, align: 64, offset: 2432)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1317, file: !225, line: 2066, baseType: !932, size: 32, align: 32, offset: 2496)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1317, file: !225, line: 2070, baseType: !932, size: 32, align: 32, offset: 2528)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1317, file: !225, line: 2078, baseType: !932, size: 32, align: 32, offset: 2560)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1317, file: !225, line: 2085, baseType: !932, size: 32, align: 32, offset: 2592)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1317, file: !225, line: 2092, baseType: !932, size: 32, align: 32, offset: 2624)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1317, file: !225, line: 2099, baseType: !932, size: 32, align: 32, offset: 2656)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1317, file: !225, line: 2106, baseType: !932, size: 32, align: 32, offset: 2688)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1317, file: !225, line: 2113, baseType: !932, size: 32, align: 32, offset: 2720)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1317, file: !225, line: 2120, baseType: !932, size: 32, align: 32, offset: 2752)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1317, file: !225, line: 2125, baseType: !932, size: 32, align: 32, offset: 2784)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1317, file: !225, line: 2133, baseType: !932, size: 32, align: 32, offset: 2816)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1317, file: !225, line: 2140, baseType: !932, size: 32, align: 32, offset: 2848)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1317, file: !225, line: 2145, baseType: !932, size: 32, align: 32, offset: 2880)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1317, file: !225, line: 2153, baseType: !932, size: 32, align: 32, offset: 2912)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1317, file: !225, line: 2158, baseType: !932, size: 32, align: 32, offset: 2944)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1317, file: !225, line: 2166, baseType: !755, size: 32, align: 32, offset: 2976)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1317, file: !225, line: 2173, baseType: !773, size: 32, align: 32, offset: 3008)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1317, file: !225, line: 2180, baseType: !797, size: 32, align: 32, offset: 3040)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1317, file: !225, line: 2187, baseType: !749, size: 32, align: 32, offset: 3072)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1317, file: !225, line: 2194, baseType: !816, size: 32, align: 32, offset: 3104)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1317, file: !225, line: 2203, baseType: !932, size: 32, align: 32, offset: 3136)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1317, file: !225, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1317, file: !225, line: 2212, baseType: !932, size: 32, align: 32, offset: 3200)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1317, file: !225, line: 2213, baseType: !932, size: 32, align: 32, offset: 3232)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1317, file: !225, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1317, file: !225, line: 2232, baseType: !932, size: 32, align: 32, offset: 3296)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1317, file: !225, line: 2243, baseType: !932, size: 32, align: 32, offset: 3328)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1317, file: !225, line: 2249, baseType: !932, size: 32, align: 32, offset: 3360)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1317, file: !225, line: 2256, baseType: !932, size: 32, align: 32, offset: 3392)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1317, file: !225, line: 2263, baseType: !1157, size: 64, align: 64, offset: 3456)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1317, file: !225, line: 2270, baseType: !1157, size: 64, align: 64, offset: 3520)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1317, file: !225, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1317, file: !225, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1317, file: !225, line: 2367, baseType: !1558, size: 64, align: 64, offset: 3648)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DISubroutineType(types: !1560)
!1560 = !{!932, !1485, !1123, !932}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1317, file: !225, line: 2383, baseType: !932, size: 32, align: 32, offset: 3712)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1317, file: !225, line: 2386, baseType: !1492, size: 32, align: 32, offset: 3744)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1317, file: !225, line: 2387, baseType: !1492, size: 32, align: 32, offset: 3776)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1317, file: !225, line: 2394, baseType: !932, size: 32, align: 32, offset: 3808)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1317, file: !225, line: 2401, baseType: !932, size: 32, align: 32, offset: 3840)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1317, file: !225, line: 2408, baseType: !932, size: 32, align: 32, offset: 3872)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1317, file: !225, line: 2415, baseType: !932, size: 32, align: 32, offset: 3904)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1317, file: !225, line: 2422, baseType: !932, size: 32, align: 32, offset: 3936)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1317, file: !225, line: 2423, baseType: !1570, size: 64, align: 64, offset: 3968)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !225, line: 831, baseType: !1572)
!1572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !225, line: 826, size: 128, align: 32, elements: !1573)
!1573 = !{!1574, !1575, !1576, !1577}
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1572, file: !225, line: 827, baseType: !932, size: 32, align: 32)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1572, file: !225, line: 828, baseType: !932, size: 32, align: 32, offset: 32)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1572, file: !225, line: 829, baseType: !932, size: 32, align: 32, offset: 64)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1572, file: !225, line: 830, baseType: !1492, size: 32, align: 32, offset: 96)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1317, file: !225, line: 2430, baseType: !1078, size: 64, align: 64, offset: 4032)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1317, file: !225, line: 2437, baseType: !1078, size: 64, align: 64, offset: 4096)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1317, file: !225, line: 2444, baseType: !1492, size: 32, align: 32, offset: 4160)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1317, file: !225, line: 2451, baseType: !1492, size: 32, align: 32, offset: 4192)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1317, file: !225, line: 2458, baseType: !932, size: 32, align: 32, offset: 4224)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1317, file: !225, line: 2469, baseType: !932, size: 32, align: 32, offset: 4256)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1317, file: !225, line: 2475, baseType: !932, size: 32, align: 32, offset: 4288)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1317, file: !225, line: 2481, baseType: !932, size: 32, align: 32, offset: 4320)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1317, file: !225, line: 2485, baseType: !932, size: 32, align: 32, offset: 4352)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1317, file: !225, line: 2489, baseType: !932, size: 32, align: 32, offset: 4384)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1317, file: !225, line: 2493, baseType: !932, size: 32, align: 32, offset: 4416)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1317, file: !225, line: 2501, baseType: !932, size: 32, align: 32, offset: 4448)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1317, file: !225, line: 2506, baseType: !932, size: 32, align: 32, offset: 4480)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1317, file: !225, line: 2510, baseType: !932, size: 32, align: 32, offset: 4512)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1317, file: !225, line: 2514, baseType: !1078, size: 64, align: 64, offset: 4544)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1317, file: !225, line: 2528, baseType: !1594, size: 64, align: 64, offset: 4608)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DISubroutineType(types: !1596)
!1596 = !{null, !1485, !934, !932, !932}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1317, file: !225, line: 2534, baseType: !932, size: 32, align: 32, offset: 4672)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1317, file: !225, line: 2545, baseType: !932, size: 32, align: 32, offset: 4704)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1317, file: !225, line: 2547, baseType: !932, size: 32, align: 32, offset: 4736)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1317, file: !225, line: 2549, baseType: !932, size: 32, align: 32, offset: 4768)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1317, file: !225, line: 2551, baseType: !932, size: 32, align: 32, offset: 4800)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1317, file: !225, line: 2553, baseType: !932, size: 32, align: 32, offset: 4832)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1317, file: !225, line: 2555, baseType: !932, size: 32, align: 32, offset: 4864)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1317, file: !225, line: 2557, baseType: !932, size: 32, align: 32, offset: 4896)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1317, file: !225, line: 2559, baseType: !932, size: 32, align: 32, offset: 4928)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1317, file: !225, line: 2563, baseType: !932, size: 32, align: 32, offset: 4960)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1317, file: !225, line: 2571, baseType: !1418, size: 64, align: 64, offset: 4992)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1317, file: !225, line: 2579, baseType: !1418, size: 64, align: 64, offset: 5056)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1317, file: !225, line: 2586, baseType: !932, size: 32, align: 32, offset: 5120)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1317, file: !225, line: 2615, baseType: !932, size: 32, align: 32, offset: 5152)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1317, file: !225, line: 2627, baseType: !932, size: 32, align: 32, offset: 5184)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1317, file: !225, line: 2637, baseType: !932, size: 32, align: 32, offset: 5216)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1317, file: !225, line: 2681, baseType: !932, size: 32, align: 32, offset: 5248)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1317, file: !225, line: 2709, baseType: !1078, size: 64, align: 64, offset: 5312)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1317, file: !225, line: 2716, baseType: !1616, size: 64, align: 64, offset: 5376)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1618)
!1618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !225, line: 3636, size: 896, align: 64, elements: !1619)
!1619 = !{!1620, !1621, !1622, !1623, !1624, !1625, !1626, !1630, !1634, !1635, !1636, !1637, !1643, !1644, !1645, !1646, !1647}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1618, file: !225, line: 3642, baseType: !953, size: 64, align: 64)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1618, file: !225, line: 3649, baseType: !835, size: 32, align: 32, offset: 64)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1618, file: !225, line: 3656, baseType: !224, size: 32, align: 32, offset: 96)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1618, file: !225, line: 3663, baseType: !3, size: 32, align: 32, offset: 128)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1618, file: !225, line: 3669, baseType: !932, size: 32, align: 32, offset: 160)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1618, file: !225, line: 3682, baseType: !1443, size: 64, align: 64, offset: 192)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1618, file: !225, line: 3698, baseType: !1627, size: 64, align: 64, offset: 256)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DISubroutineType(types: !1629)
!1629 = !{!932, !1315, !1269, !944}
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1618, file: !225, line: 3712, baseType: !1631, size: 64, align: 64, offset: 320)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64, align: 64)
!1632 = !DISubroutineType(types: !1633)
!1633 = !{!932, !1315, !932, !1269, !944}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1618, file: !225, line: 3726, baseType: !1627, size: 64, align: 64, offset: 384)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1618, file: !225, line: 3737, baseType: !1362, size: 64, align: 64, offset: 448)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1618, file: !225, line: 3746, baseType: !932, size: 32, align: 32, offset: 512)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1618, file: !225, line: 3757, baseType: !1638, size: 64, align: 64, offset: 576)
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DISubroutineType(types: !1640)
!1640 = !{null, !1641}
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !225, line: 3617, flags: DIFlagFwdDecl)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1618, file: !225, line: 3766, baseType: !1362, size: 64, align: 64, offset: 640)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1618, file: !225, line: 3774, baseType: !1362, size: 64, align: 64, offset: 704)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1618, file: !225, line: 3780, baseType: !932, size: 32, align: 32, offset: 768)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1618, file: !225, line: 3785, baseType: !932, size: 32, align: 32, offset: 800)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1618, file: !225, line: 3795, baseType: !1648, size: 64, align: 64, offset: 832)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{!932, !1315, !1064}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1317, file: !225, line: 2728, baseType: !934, size: 64, align: 64, offset: 5440)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1317, file: !225, line: 2735, baseType: !1156, size: 512, align: 64, offset: 5504)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1317, file: !225, line: 2742, baseType: !932, size: 32, align: 32, offset: 6016)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1317, file: !225, line: 2755, baseType: !932, size: 32, align: 32, offset: 6048)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1317, file: !225, line: 2776, baseType: !932, size: 32, align: 32, offset: 6080)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1317, file: !225, line: 2783, baseType: !932, size: 32, align: 32, offset: 6112)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1317, file: !225, line: 2791, baseType: !932, size: 32, align: 32, offset: 6144)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1317, file: !225, line: 2802, baseType: !1123, size: 64, align: 64, offset: 6208)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1317, file: !225, line: 2811, baseType: !932, size: 32, align: 32, offset: 6272)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1317, file: !225, line: 2821, baseType: !932, size: 32, align: 32, offset: 6304)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1317, file: !225, line: 2830, baseType: !932, size: 32, align: 32, offset: 6336)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1317, file: !225, line: 2840, baseType: !932, size: 32, align: 32, offset: 6368)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1317, file: !225, line: 2851, baseType: !1664, size: 64, align: 64, offset: 6400)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DISubroutineType(types: !1666)
!1666 = !{!932, !1485, !1667, !934, !1428, !932, !932}
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{!932, !1485, !934}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1317, file: !225, line: 2871, baseType: !1671, size: 64, align: 64, offset: 6464)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DISubroutineType(types: !1673)
!1673 = !{!932, !1485, !1674, !934, !1428, !932}
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DISubroutineType(types: !1676)
!1676 = !{!932, !1485, !934, !932, !932}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1317, file: !225, line: 2878, baseType: !932, size: 32, align: 32, offset: 6528)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1317, file: !225, line: 2885, baseType: !932, size: 32, align: 32, offset: 6560)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1317, file: !225, line: 3005, baseType: !932, size: 32, align: 32, offset: 6592)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1317, file: !225, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1317, file: !225, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1317, file: !225, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1317, file: !225, line: 3037, baseType: !1074, size: 64, align: 64, offset: 6720)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1317, file: !225, line: 3038, baseType: !932, size: 32, align: 32, offset: 6784)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1317, file: !225, line: 3050, baseType: !1157, size: 64, align: 64, offset: 6848)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1317, file: !225, line: 3065, baseType: !932, size: 32, align: 32, offset: 6912)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1317, file: !225, line: 3083, baseType: !932, size: 32, align: 32, offset: 6944)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1317, file: !225, line: 3092, baseType: !1142, size: 64, align: 32, offset: 6976)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1317, file: !225, line: 3099, baseType: !3, size: 32, align: 32, offset: 7040)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1317, file: !225, line: 3106, baseType: !1142, size: 64, align: 32, offset: 7072)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1317, file: !225, line: 3113, baseType: !1692, size: 64, align: 64, offset: 7168)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1694)
!1694 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !225, line: 740, baseType: !1695)
!1695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !225, line: 712, size: 384, align: 64, elements: !1696)
!1696 = !{!1697, !1698, !1699, !1700, !1701, !1702, !1705}
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1695, file: !225, line: 713, baseType: !224, size: 32, align: 32)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1695, file: !225, line: 714, baseType: !835, size: 32, align: 32, offset: 32)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1695, file: !225, line: 720, baseType: !953, size: 64, align: 64, offset: 64)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1695, file: !225, line: 724, baseType: !953, size: 64, align: 64, offset: 128)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1695, file: !225, line: 728, baseType: !932, size: 32, align: 32, offset: 192)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1695, file: !225, line: 734, baseType: !1703, size: 64, align: 64, offset: 256)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1695, file: !225, line: 739, baseType: !1706, size: 64, align: 64, offset: 320)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1353)
