; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RTPDynamicProtocolHandler = type { i8*, i32, i32, i32, i32, i32, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*, i8*)*, void (%struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, %struct.PayloadContext*, %struct.AVStream*, %struct.AVPacket*, i32*, i8*, i32, i16, i32)*, i32 (%struct.PayloadContext*)*, %struct.RTPDynamicProtocolHandler* }

!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !474, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RTCPType", file: !917, line: 92, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavformat/rtp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!918 = !{!919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933}
!919 = !DIEnumerator(name: "RTCP_FIR", value: 192)
!920 = !DIEnumerator(name: "RTCP_NACK", value: 193)
!921 = !DIEnumerator(name: "RTCP_SMPTETC", value: 194)
!922 = !DIEnumerator(name: "RTCP_IJ", value: 195)
!923 = !DIEnumerator(name: "RTCP_SR", value: 200)
!924 = !DIEnumerator(name: "RTCP_RR", value: 201)
!925 = !DIEnumerator(name: "RTCP_SDES", value: 202)
!926 = !DIEnumerator(name: "RTCP_BYE", value: 203)
!927 = !DIEnumerator(name: "RTCP_APP", value: 204)
!928 = !DIEnumerator(name: "RTCP_RTPFB", value: 205)
!929 = !DIEnumerator(name: "RTCP_PSFB", value: 206)
!930 = !DIEnumerator(name: "RTCP_XR", value: 207)
!931 = !DIEnumerator(name: "RTCP_AVB", value: 208)
!932 = !DIEnumerator(name: "RTCP_RSI", value: 209)
!933 = !DIEnumerator(name: "RTCP_TOKEN", value: 210)
!934 = !{!935, !938, !939, !941, !942, !943, !944, !950, !957, !958, !959, !955}
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !936, line: 122, baseType: !937)
!936 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!937 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !936, line: 40, baseType: !940)
!940 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!941 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!942 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !936, line: 51, baseType: !942)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !947, line: 221, size: 32, align: 8, elements: !948)
!947 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!948 = !{!949}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !946, file: !947, line: 221, baseType: !943, size: 32, align: 32)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !947, line: 222, size: 16, align: 8, elements: !953)
!953 = !{!954}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !952, file: !947, line: 222, baseType: !955, size: 16, align: 16)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !936, line: 49, baseType: !956)
!956 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !936, line: 55, baseType: !937)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !936, line: 38, baseType: !941)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !947, line: 220, size: 64, align: 8, elements: !962)
!962 = !{!963}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !961, file: !947, line: 220, baseType: !957, size: 64, align: 64)
!964 = !{!965, !2130, !2131, !2132, !2133, !2134, !2135}
!965 = distinct !DIGlobalVariable(name: "rtp_dynamic_protocol_handler_list", scope: !0, file: !966, line: 77, type: !967, isLocal: true, isDefinition: true, variable: [53 x %struct.RTPDynamicProtocolHandler*]* @rtp_dynamic_protocol_handler_list)
!966 = !DIFile(filename: "libavformat/rtpdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 3392, align: 64, elements: !2128)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTPDynamicProtocolHandler", file: !971, line: 33, baseType: !972)
!971 = !DIFile(filename: "libavformat/rtpdec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RTPDynamicProtocolHandler", file: !971, line: 115, size: 640, align: 64, elements: !973)
!973 = !{!974, !978, !979, !980, !981, !982, !983, !2108, !2112, !2116, !2122, !2126}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "enc_name", scope: !972, file: !971, line: 116, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !972, file: !971, line: 117, baseType: !3, size: 32, align: 32, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !972, file: !971, line: 118, baseType: !13, size: 32, align: 32, offset: 96)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "need_parsing", scope: !972, file: !971, line: 119, baseType: !473, size: 32, align: 32, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "static_payload_id", scope: !972, file: !971, line: 120, baseType: !941, size: 32, align: 32, offset: 160)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !972, file: !971, line: 123, baseType: !941, size: 32, align: 32, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !972, file: !971, line: 126, baseType: !984, size: 64, align: 64, offset: 256)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!941, !987, !941, !2105}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !474, line: 1947, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !474, line: 1337, size: 11968, align: 64, elements: !990)
!990 = !{!991, !1032, !1139, !1285, !1286, !1351, !1352, !1353, !1982, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2036, !2037, !2038, !2039, !2040, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2071, !2072, !2075, !2076, !2077, !2078, !2079, !2080, !2082, !2083, !2084, !2085, !2093, !2094, !2098, !2102, !2103, !2104}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !989, file: !474, line: 1342, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !483, line: 143, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !483, line: 67, size: 640, align: 64, elements: !996)
!996 = !{!997, !998, !1002, !1006, !1007, !1008, !1009, !1013, !1019, !1021, !1025}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !995, file: !483, line: 72, baseType: !975, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !995, file: !483, line: 78, baseType: !999, size: 64, align: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!975, !938}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !995, file: !483, line: 85, baseType: !1003, size: 64, align: 64, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !483, line: 85, flags: DIFlagFwdDecl)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !995, file: !483, line: 93, baseType: !941, size: 32, align: 32, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !995, file: !483, line: 99, baseType: !941, size: 32, align: 32, offset: 224)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !995, file: !483, line: 108, baseType: !941, size: 32, align: 32, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !995, file: !483, line: 113, baseType: !1010, size: 64, align: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!938, !938, !938}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !995, file: !483, line: 123, baseType: !1014, size: 64, align: 64, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!1017, !1017}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !995, file: !483, line: 130, baseType: !1020, size: 32, align: 32, offset: 448)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !483, line: 48, baseType: !482)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !995, file: !483, line: 136, baseType: !1022, size: 64, align: 64, offset: 512)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1020, !938}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !995, file: !483, line: 142, baseType: !1026, size: 64, align: 64, offset: 576)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!941, !1029, !938, !975, !941}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !483, line: 60, flags: DIFlagFwdDecl)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !989, file: !474, line: 1349, baseType: !1033, size: 64, align: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !474, line: 633, size: 1344, align: 64, elements: !1035)
!1035 = !{!1036, !1037, !1038, !1039, !1040, !1046, !1047, !1048, !1049, !1050, !1051, !1065, !1070, !1110, !1111, !1115, !1120, !1121, !1122, !1126, !1132, !1138}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1034, file: !474, line: 638, baseType: !975, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1034, file: !474, line: 645, baseType: !975, size: 64, align: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1034, file: !474, line: 652, baseType: !941, size: 32, align: 32, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1034, file: !474, line: 659, baseType: !975, size: 64, align: 64, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1034, file: !474, line: 661, baseType: !1041, size: 64, align: 64, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1045 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !474, line: 443, flags: DIFlagFwdDecl)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1034, file: !474, line: 663, baseType: !992, size: 64, align: 64, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1034, file: !474, line: 670, baseType: !975, size: 64, align: 64, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1034, file: !474, line: 679, baseType: !1033, size: 64, align: 64, offset: 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1034, file: !474, line: 684, baseType: !941, size: 32, align: 32, offset: 512)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1034, file: !474, line: 689, baseType: !941, size: 32, align: 32, offset: 544)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1034, file: !474, line: 696, baseType: !1052, size: 64, align: 64, offset: 576)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!941, !1055}
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !474, line: 453, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !474, line: 448, size: 256, align: 64, elements: !1058)
!1058 = !{!1059, !1060, !1063, !1064}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1057, file: !474, line: 449, baseType: !975, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1057, file: !474, line: 450, baseType: !1061, size: 64, align: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1057, file: !474, line: 451, baseType: !941, size: 32, align: 32, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1057, file: !474, line: 452, baseType: !975, size: 64, align: 64, offset: 192)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1034, file: !474, line: 703, baseType: !1066, size: 64, align: 64, offset: 640)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!941, !1069}
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1034, file: !474, line: 714, baseType: !1071, size: 64, align: 64, offset: 704)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!941, !1069, !1074}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1077)
!1077 = !{!1078, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1106, !1107, !1108, !1109}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1076, file: !14, line: 1451, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1081, line: 94, baseType: !1082)
!1081 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1081, line: 81, size: 192, align: 64, elements: !1083)
!1083 = !{!1084, !1088, !1091}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1082, file: !1081, line: 82, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1081, line: 73, baseType: !1087)
!1087 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1081, line: 73, flags: DIFlagFwdDecl)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1082, file: !1081, line: 89, baseType: !1089, size: 64, align: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !936, line: 48, baseType: !1062)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1082, file: !1081, line: 93, baseType: !941, size: 32, align: 32, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1076, file: !14, line: 1461, baseType: !939, size: 64, align: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1076, file: !14, line: 1467, baseType: !939, size: 64, align: 64, offset: 128)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1076, file: !14, line: 1468, baseType: !1089, size: 64, align: 64, offset: 192)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1076, file: !14, line: 1469, baseType: !941, size: 32, align: 32, offset: 256)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1076, file: !14, line: 1470, baseType: !941, size: 32, align: 32, offset: 288)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1076, file: !14, line: 1474, baseType: !941, size: 32, align: 32, offset: 320)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1076, file: !14, line: 1479, baseType: !1099, size: 64, align: 64, offset: 384)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1102)
!1102 = !{!1103, !1104, !1105}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1101, file: !14, line: 1412, baseType: !1089, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1101, file: !14, line: 1413, baseType: !941, size: 32, align: 32, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1101, file: !14, line: 1414, baseType: !503, size: 32, align: 32, offset: 96)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1076, file: !14, line: 1480, baseType: !941, size: 32, align: 32, offset: 448)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1076, file: !14, line: 1486, baseType: !939, size: 64, align: 64, offset: 512)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1076, file: !14, line: 1488, baseType: !939, size: 64, align: 64, offset: 576)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1076, file: !14, line: 1497, baseType: !939, size: 64, align: 64, offset: 640)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1034, file: !474, line: 720, baseType: !1066, size: 64, align: 64, offset: 768)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1034, file: !474, line: 730, baseType: !1112, size: 64, align: 64, offset: 832)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!941, !1069, !941, !939, !941}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1034, file: !474, line: 737, baseType: !1116, size: 64, align: 64, offset: 896)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!939, !1069, !941, !1119, !939}
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1034, file: !474, line: 744, baseType: !1066, size: 64, align: 64, offset: 960)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1034, file: !474, line: 750, baseType: !1066, size: 64, align: 64, offset: 1024)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1034, file: !474, line: 758, baseType: !1123, size: 64, align: 64, offset: 1088)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!941, !1069, !941, !939, !939, !939, !941}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1034, file: !474, line: 764, baseType: !1127, size: 64, align: 64, offset: 1152)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!941, !1069, !1130}
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !474, line: 328, flags: DIFlagFwdDecl)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1034, file: !474, line: 770, baseType: !1133, size: 64, align: 64, offset: 1216)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!941, !1069, !1136}
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !474, line: 329, flags: DIFlagFwdDecl)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1034, file: !474, line: 776, baseType: !1133, size: 64, align: 64, offset: 1280)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !989, file: !474, line: 1356, baseType: !1140, size: 64, align: 64, offset: 128)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !474, line: 497, size: 1600, align: 64, elements: !1142)
!1142 = !{!1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1162, !1166, !1170, !1176, !1270, !1271, !1272, !1273, !1274, !1275, !1279}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1141, file: !474, line: 498, baseType: !975, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1141, file: !474, line: 504, baseType: !975, size: 64, align: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1141, file: !474, line: 505, baseType: !975, size: 64, align: 64, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1141, file: !474, line: 506, baseType: !975, size: 64, align: 64, offset: 192)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1141, file: !474, line: 508, baseType: !13, size: 32, align: 32, offset: 256)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1141, file: !474, line: 509, baseType: !13, size: 32, align: 32, offset: 288)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1141, file: !474, line: 510, baseType: !13, size: 32, align: 32, offset: 320)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1141, file: !474, line: 517, baseType: !941, size: 32, align: 32, offset: 352)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1141, file: !474, line: 523, baseType: !1041, size: 64, align: 64, offset: 384)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1141, file: !474, line: 526, baseType: !992, size: 64, align: 64, offset: 448)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1141, file: !474, line: 535, baseType: !1140, size: 64, align: 64, offset: 512)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1141, file: !474, line: 539, baseType: !941, size: 32, align: 32, offset: 576)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1141, file: !474, line: 541, baseType: !1066, size: 64, align: 64, offset: 640)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1141, file: !474, line: 549, baseType: !1071, size: 64, align: 64, offset: 704)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1141, file: !474, line: 550, baseType: !1066, size: 64, align: 64, offset: 768)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1141, file: !474, line: 554, baseType: !1159, size: 64, align: 64, offset: 832)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!941, !1069, !1074, !1074, !941}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1141, file: !474, line: 563, baseType: !1163, size: 64, align: 64, offset: 896)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!941, !13, !941}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1141, file: !474, line: 565, baseType: !1167, size: 64, align: 64, offset: 960)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{null, !1069, !941, !1119, !1119}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1141, file: !474, line: 570, baseType: !1171, size: 64, align: 64, offset: 1024)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!941, !1069, !941, !938, !1174}
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1175, line: 216, baseType: !937)
!1175 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1141, file: !474, line: 581, baseType: !1177, size: 64, align: 64, offset: 1088)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!941, !1069, !941, !1180, !942}
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !544, line: 646, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !544, line: 268, size: 4288, align: 64, elements: !1184)
!1184 = !{!1185, !1189, !1191, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1224, !1226, !1227, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1183, file: !544, line: 282, baseType: !1186, size: 512, align: 64)
!1186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1089, size: 512, align: 64, elements: !1187)
!1187 = !{!1188}
!1188 = !DISubrange(count: 8)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1183, file: !544, line: 299, baseType: !1190, size: 256, align: 32, offset: 512)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 256, align: 32, elements: !1187)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1183, file: !544, line: 315, baseType: !1192, size: 64, align: 64, offset: 768)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1183, file: !544, line: 326, baseType: !941, size: 32, align: 32, offset: 832)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1183, file: !544, line: 326, baseType: !941, size: 32, align: 32, offset: 864)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1183, file: !544, line: 334, baseType: !941, size: 32, align: 32, offset: 896)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1183, file: !544, line: 341, baseType: !941, size: 32, align: 32, offset: 928)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1183, file: !544, line: 346, baseType: !941, size: 32, align: 32, offset: 960)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1183, file: !544, line: 351, baseType: !533, size: 32, align: 32, offset: 992)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1183, file: !544, line: 356, baseType: !1200, size: 64, align: 32, offset: 1024)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1201, line: 61, baseType: !1202)
!1201 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1201, line: 58, size: 64, align: 32, elements: !1203)
!1203 = !{!1204, !1205}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1202, file: !1201, line: 59, baseType: !941, size: 32, align: 32)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1202, file: !1201, line: 60, baseType: !941, size: 32, align: 32, offset: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1183, file: !544, line: 361, baseType: !939, size: 64, align: 64, offset: 1088)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1183, file: !544, line: 369, baseType: !939, size: 64, align: 64, offset: 1152)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1183, file: !544, line: 377, baseType: !939, size: 64, align: 64, offset: 1216)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1183, file: !544, line: 382, baseType: !941, size: 32, align: 32, offset: 1280)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1183, file: !544, line: 386, baseType: !941, size: 32, align: 32, offset: 1312)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1183, file: !544, line: 391, baseType: !941, size: 32, align: 32, offset: 1344)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1183, file: !544, line: 396, baseType: !938, size: 64, align: 64, offset: 1408)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1183, file: !544, line: 403, baseType: !1214, size: 512, align: 64, offset: 1472)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 512, align: 64, elements: !1187)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1183, file: !544, line: 410, baseType: !941, size: 32, align: 32, offset: 1984)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1183, file: !544, line: 415, baseType: !941, size: 32, align: 32, offset: 2016)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1183, file: !544, line: 420, baseType: !941, size: 32, align: 32, offset: 2048)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1183, file: !544, line: 425, baseType: !941, size: 32, align: 32, offset: 2080)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1183, file: !544, line: 435, baseType: !939, size: 64, align: 64, offset: 2112)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1183, file: !544, line: 440, baseType: !941, size: 32, align: 32, offset: 2176)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1183, file: !544, line: 445, baseType: !957, size: 64, align: 64, offset: 2240)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1183, file: !544, line: 459, baseType: !1223, size: 512, align: 64, offset: 2304)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1079, size: 512, align: 64, elements: !1187)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1183, file: !544, line: 473, baseType: !1225, size: 64, align: 64, offset: 2816)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1183, file: !544, line: 477, baseType: !941, size: 32, align: 32, offset: 2880)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1183, file: !544, line: 479, baseType: !1228, size: 64, align: 64, offset: 2944)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !544, line: 207, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !544, line: 201, size: 320, align: 64, elements: !1232)
!1232 = !{!1233, !1234, !1235, !1236, !1241}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1231, file: !544, line: 202, baseType: !543, size: 32, align: 32)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1231, file: !544, line: 203, baseType: !1089, size: 64, align: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1231, file: !544, line: 204, baseType: !941, size: 32, align: 32, offset: 128)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1231, file: !544, line: 205, baseType: !1237, size: 64, align: 64, offset: 192)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1239, line: 86, baseType: !1240)
!1239 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1240 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1239, line: 86, flags: DIFlagFwdDecl)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1231, file: !544, line: 206, baseType: !1079, size: 64, align: 64, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1183, file: !544, line: 480, baseType: !941, size: 32, align: 32, offset: 3008)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1183, file: !544, line: 505, baseType: !941, size: 32, align: 32, offset: 3040)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1183, file: !544, line: 512, baseType: !567, size: 32, align: 32, offset: 3072)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1183, file: !544, line: 514, baseType: !574, size: 32, align: 32, offset: 3104)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1183, file: !544, line: 516, baseType: !592, size: 32, align: 32, offset: 3136)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1183, file: !544, line: 523, baseType: !616, size: 32, align: 32, offset: 3168)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1183, file: !544, line: 525, baseType: !635, size: 32, align: 32, offset: 3200)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1183, file: !544, line: 532, baseType: !939, size: 64, align: 64, offset: 3264)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1183, file: !544, line: 539, baseType: !939, size: 64, align: 64, offset: 3328)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1183, file: !544, line: 547, baseType: !939, size: 64, align: 64, offset: 3392)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1183, file: !544, line: 554, baseType: !1237, size: 64, align: 64, offset: 3456)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1183, file: !544, line: 563, baseType: !941, size: 32, align: 32, offset: 3520)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1183, file: !544, line: 572, baseType: !941, size: 32, align: 32, offset: 3552)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1183, file: !544, line: 581, baseType: !941, size: 32, align: 32, offset: 3584)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1183, file: !544, line: 588, baseType: !1257, size: 64, align: 64, offset: 3648)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !936, line: 36, baseType: !1259)
!1259 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1183, file: !544, line: 593, baseType: !941, size: 32, align: 32, offset: 3712)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1183, file: !544, line: 596, baseType: !941, size: 32, align: 32, offset: 3744)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1183, file: !544, line: 599, baseType: !1079, size: 64, align: 64, offset: 3776)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1183, file: !544, line: 605, baseType: !1079, size: 64, align: 64, offset: 3840)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1183, file: !544, line: 616, baseType: !1079, size: 64, align: 64, offset: 3904)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1183, file: !544, line: 626, baseType: !1174, size: 64, align: 64, offset: 3968)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1183, file: !544, line: 627, baseType: !1174, size: 64, align: 64, offset: 4032)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1183, file: !544, line: 628, baseType: !1174, size: 64, align: 64, offset: 4096)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1183, file: !544, line: 629, baseType: !1174, size: 64, align: 64, offset: 4160)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1183, file: !544, line: 645, baseType: !1079, size: 64, align: 64, offset: 4224)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1141, file: !474, line: 587, baseType: !1127, size: 64, align: 64, offset: 1152)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1141, file: !474, line: 592, baseType: !1133, size: 64, align: 64, offset: 1216)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1141, file: !474, line: 597, baseType: !1133, size: 64, align: 64, offset: 1280)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1141, file: !474, line: 598, baseType: !13, size: 32, align: 32, offset: 1344)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1141, file: !474, line: 608, baseType: !1066, size: 64, align: 64, offset: 1408)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1141, file: !474, line: 617, baseType: !1276, size: 64, align: 64, offset: 1472)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{null, !1069}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1141, file: !474, line: 623, baseType: !1280, size: 64, align: 64, offset: 1536)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!941, !1069, !1283}
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1075)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !989, file: !474, line: 1365, baseType: !938, size: 64, align: 64, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !989, file: !474, line: 1379, baseType: !1287, size: 64, align: 64, offset: 256)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !646, line: 352, baseType: !1289)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !646, line: 161, size: 2112, align: 64, elements: !1290)
!1290 = !{!1291, !1292, !1293, !1294, !1295, !1296, !1297, !1301, !1302, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1318, !1319, !1323, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1341, !1342, !1343, !1344, !1348, !1349, !1350}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1289, file: !646, line: 174, baseType: !992, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1289, file: !646, line: 226, baseType: !1061, size: 64, align: 64, offset: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1289, file: !646, line: 227, baseType: !941, size: 32, align: 32, offset: 128)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1289, file: !646, line: 228, baseType: !1061, size: 64, align: 64, offset: 192)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1289, file: !646, line: 229, baseType: !1061, size: 64, align: 64, offset: 256)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1289, file: !646, line: 233, baseType: !938, size: 64, align: 64, offset: 320)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1289, file: !646, line: 235, baseType: !1298, size: 64, align: 64, offset: 384)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!941, !938, !1089, !941}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1289, file: !646, line: 236, baseType: !1298, size: 64, align: 64, offset: 448)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1289, file: !646, line: 237, baseType: !1303, size: 64, align: 64, offset: 512)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{!939, !938, !939, !941}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1289, file: !646, line: 238, baseType: !939, size: 64, align: 64, offset: 576)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1289, file: !646, line: 239, baseType: !941, size: 32, align: 32, offset: 640)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1289, file: !646, line: 240, baseType: !941, size: 32, align: 32, offset: 672)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1289, file: !646, line: 241, baseType: !941, size: 32, align: 32, offset: 704)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1289, file: !646, line: 242, baseType: !937, size: 64, align: 64, offset: 768)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1289, file: !646, line: 243, baseType: !1061, size: 64, align: 64, offset: 832)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1289, file: !646, line: 244, baseType: !1313, size: 64, align: 64, offset: 896)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!937, !937, !1316, !942}
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1090)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1289, file: !646, line: 245, baseType: !941, size: 32, align: 32, offset: 960)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1289, file: !646, line: 249, baseType: !1320, size: 64, align: 64, offset: 1024)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!941, !938, !941}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1289, file: !646, line: 255, baseType: !1324, size: 64, align: 64, offset: 1088)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!939, !938, !941, !939, !941}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1289, file: !646, line: 260, baseType: !941, size: 32, align: 32, offset: 1152)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1289, file: !646, line: 266, baseType: !939, size: 64, align: 64, offset: 1216)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1289, file: !646, line: 273, baseType: !941, size: 32, align: 32, offset: 1280)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1289, file: !646, line: 279, baseType: !939, size: 64, align: 64, offset: 1344)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1289, file: !646, line: 285, baseType: !941, size: 32, align: 32, offset: 1408)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1289, file: !646, line: 291, baseType: !941, size: 32, align: 32, offset: 1440)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1289, file: !646, line: 298, baseType: !941, size: 32, align: 32, offset: 1472)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1289, file: !646, line: 304, baseType: !941, size: 32, align: 32, offset: 1504)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1289, file: !646, line: 309, baseType: !975, size: 64, align: 64, offset: 1536)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1289, file: !646, line: 314, baseType: !975, size: 64, align: 64, offset: 1600)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1289, file: !646, line: 319, baseType: !1338, size: 64, align: 64, offset: 1664)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!941, !938, !1089, !941, !645, !939}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1289, file: !646, line: 326, baseType: !941, size: 32, align: 32, offset: 1728)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1289, file: !646, line: 331, baseType: !645, size: 32, align: 32, offset: 1760)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1289, file: !646, line: 332, baseType: !939, size: 64, align: 64, offset: 1792)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1289, file: !646, line: 338, baseType: !1345, size: 64, align: 64, offset: 1856)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DISubroutineType(types: !1347)
!1347 = !{!941, !938}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1289, file: !646, line: 340, baseType: !939, size: 64, align: 64, offset: 1920)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1289, file: !646, line: 346, baseType: !1061, size: 64, align: 64, offset: 1984)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1289, file: !646, line: 351, baseType: !941, size: 32, align: 32, offset: 2048)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !989, file: !474, line: 1386, baseType: !941, size: 32, align: 32, offset: 320)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !989, file: !474, line: 1393, baseType: !942, size: 32, align: 32, offset: 352)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !989, file: !474, line: 1405, baseType: !1354, size: 64, align: 64, offset: 384)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !474, line: 1223, baseType: !1357)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !474, line: 865, size: 6144, align: 64, elements: !1358)
!1358 = !{!1359, !1360, !1361, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1829, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1930, !1936, !1937, !1941, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1973, !1974, !1975, !1976, !1977, !1978}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1357, file: !474, line: 866, baseType: !941, size: 32, align: 32)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1357, file: !474, line: 872, baseType: !941, size: 32, align: 32, offset: 32)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1357, file: !474, line: 878, baseType: !1362, size: 64, align: 64, offset: 64)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1364)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1365)
!1365 = !{!1366, !1367, !1368, !1369, !1504, !1505, !1506, !1507, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1533, !1537, !1538, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1717, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1364, file: !14, line: 1561, baseType: !992, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1364, file: !14, line: 1562, baseType: !941, size: 32, align: 32, offset: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1364, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1364, file: !14, line: 1565, baseType: !1370, size: 64, align: 64, offset: 128)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1372)
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1373)
!1373 = !{!1374, !1375, !1376, !1377, !1378, !1379, !1382, !1385, !1388, !1391, !1394, !1395, !1396, !1404, !1405, !1406, !1408, !1412, !1418, !1423, !1427, !1428, !1469, !1476, !1480, !1481, !1485, !1489, !1493, !1497, !1498, !1499}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1372, file: !14, line: 3475, baseType: !975, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1372, file: !14, line: 3480, baseType: !975, size: 64, align: 64, offset: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1372, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1372, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1372, file: !14, line: 3487, baseType: !941, size: 32, align: 32, offset: 192)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1372, file: !14, line: 3488, baseType: !1380, size: 64, align: 64, offset: 256)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1200)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1372, file: !14, line: 3489, baseType: !1383, size: 64, align: 64, offset: 320)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1372, file: !14, line: 3490, baseType: !1386, size: 64, align: 64, offset: 384)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1372, file: !14, line: 3491, baseType: !1389, size: 64, align: 64, offset: 448)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !853)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1372, file: !14, line: 3492, baseType: !1392, size: 64, align: 64, offset: 512)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1372, file: !14, line: 3493, baseType: !1090, size: 8, align: 8, offset: 576)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1372, file: !14, line: 3494, baseType: !992, size: 64, align: 64, offset: 640)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1372, file: !14, line: 3495, baseType: !1397, size: 64, align: 64, offset: 704)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1399)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1401)
!1401 = !{!1402, !1403}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1400, file: !14, line: 3402, baseType: !941, size: 32, align: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1400, file: !14, line: 3403, baseType: !975, size: 64, align: 64, offset: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1372, file: !14, line: 3507, baseType: !975, size: 64, align: 64, offset: 768)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1372, file: !14, line: 3516, baseType: !941, size: 32, align: 32, offset: 832)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1372, file: !14, line: 3517, baseType: !1407, size: 64, align: 64, offset: 896)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1372, file: !14, line: 3527, baseType: !1409, size: 64, align: 64, offset: 960)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{!941, !1362}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1372, file: !14, line: 3535, baseType: !1413, size: 64, align: 64, offset: 1024)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DISubroutineType(types: !1415)
!1415 = !{!941, !1362, !1416}
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1363)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1372, file: !14, line: 3541, baseType: !1419, size: 64, align: 64, offset: 1088)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1421)
!1421 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1422)
!1422 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1372, file: !14, line: 3549, baseType: !1424, size: 64, align: 64, offset: 1152)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DISubroutineType(types: !1426)
!1426 = !{null, !1407}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1372, file: !14, line: 3551, baseType: !1409, size: 64, align: 64, offset: 1216)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1372, file: !14, line: 3552, baseType: !1429, size: 64, align: 64, offset: 1280)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{!941, !1362, !1089, !941, !1432}
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1434)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1435)
!1435 = !{!1436, !1437, !1438, !1439, !1440, !1468}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1434, file: !14, line: 3921, baseType: !955, size: 16, align: 16)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1434, file: !14, line: 3922, baseType: !943, size: 32, align: 32, offset: 32)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1434, file: !14, line: 3923, baseType: !943, size: 32, align: 32, offset: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1434, file: !14, line: 3924, baseType: !942, size: 32, align: 32, offset: 96)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1434, file: !14, line: 3925, baseType: !1441, size: 64, align: 64, offset: 128)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1444)
!1444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1445)
!1445 = !{!1446, !1447, !1448, !1449, !1450, !1451, !1457, !1461, !1463, !1464, !1466, !1467}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1444, file: !14, line: 3886, baseType: !941, size: 32, align: 32)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1444, file: !14, line: 3887, baseType: !941, size: 32, align: 32, offset: 32)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1444, file: !14, line: 3888, baseType: !941, size: 32, align: 32, offset: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1444, file: !14, line: 3889, baseType: !941, size: 32, align: 32, offset: 96)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1444, file: !14, line: 3890, baseType: !941, size: 32, align: 32, offset: 128)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1444, file: !14, line: 3897, baseType: !1452, size: 768, align: 64, offset: 192)
!1452 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1453)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1454)
!1454 = !{!1455, !1456}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1453, file: !14, line: 3855, baseType: !1186, size: 512, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1453, file: !14, line: 3857, baseType: !1190, size: 256, align: 32, offset: 512)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1444, file: !14, line: 3903, baseType: !1458, size: 256, align: 64, offset: 960)
!1458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1089, size: 256, align: 64, elements: !1459)
!1459 = !{!1460}
!1460 = !DISubrange(count: 4)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1444, file: !14, line: 3904, baseType: !1462, size: 128, align: 32, offset: 1216)
!1462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 128, align: 32, elements: !1459)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1444, file: !14, line: 3906, baseType: !870, size: 32, align: 32, offset: 1344)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1444, file: !14, line: 3908, baseType: !1465, size: 64, align: 64, offset: 1408)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1444, file: !14, line: 3915, baseType: !1465, size: 64, align: 64, offset: 1472)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1444, file: !14, line: 3917, baseType: !941, size: 32, align: 32, offset: 1536)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1434, file: !14, line: 3926, baseType: !939, size: 64, align: 64, offset: 192)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1372, file: !14, line: 3564, baseType: !1470, size: 64, align: 64, offset: 1344)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{!941, !1362, !1074, !1473, !1475}
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1182)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1372, file: !14, line: 3566, baseType: !1477, size: 64, align: 64, offset: 1408)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{!941, !1362, !938, !1475, !1074}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1372, file: !14, line: 3567, baseType: !1409, size: 64, align: 64, offset: 1472)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1372, file: !14, line: 3576, baseType: !1482, size: 64, align: 64, offset: 1536)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DISubroutineType(types: !1484)
!1484 = !{!941, !1362, !1473}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1372, file: !14, line: 3577, baseType: !1486, size: 64, align: 64, offset: 1600)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DISubroutineType(types: !1488)
!1488 = !{!941, !1362, !1074}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1372, file: !14, line: 3584, baseType: !1490, size: 64, align: 64, offset: 1664)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{!941, !1362, !1181}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1372, file: !14, line: 3589, baseType: !1494, size: 64, align: 64, offset: 1728)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DISubroutineType(types: !1496)
!1496 = !{null, !1362}
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1372, file: !14, line: 3594, baseType: !941, size: 32, align: 32, offset: 1792)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1372, file: !14, line: 3600, baseType: !975, size: 64, align: 64, offset: 1856)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1372, file: !14, line: 3609, baseType: !1500, size: 64, align: 64, offset: 1920)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1503)
!1503 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1364, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1364, file: !14, line: 1581, baseType: !942, size: 32, align: 32, offset: 224)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1364, file: !14, line: 1583, baseType: !938, size: 64, align: 64, offset: 256)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1364, file: !14, line: 1591, baseType: !1508, size: 64, align: 64, offset: 320)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1364, file: !14, line: 1598, baseType: !938, size: 64, align: 64, offset: 384)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1364, file: !14, line: 1606, baseType: !939, size: 64, align: 64, offset: 448)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1364, file: !14, line: 1614, baseType: !941, size: 32, align: 32, offset: 512)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1364, file: !14, line: 1622, baseType: !941, size: 32, align: 32, offset: 544)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1364, file: !14, line: 1628, baseType: !941, size: 32, align: 32, offset: 576)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1364, file: !14, line: 1636, baseType: !941, size: 32, align: 32, offset: 608)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1364, file: !14, line: 1643, baseType: !941, size: 32, align: 32, offset: 640)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1364, file: !14, line: 1657, baseType: !1089, size: 64, align: 64, offset: 704)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1364, file: !14, line: 1658, baseType: !941, size: 32, align: 32, offset: 768)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1364, file: !14, line: 1679, baseType: !1200, size: 64, align: 32, offset: 800)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1364, file: !14, line: 1688, baseType: !941, size: 32, align: 32, offset: 864)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1364, file: !14, line: 1712, baseType: !941, size: 32, align: 32, offset: 896)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1364, file: !14, line: 1729, baseType: !941, size: 32, align: 32, offset: 928)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1364, file: !14, line: 1729, baseType: !941, size: 32, align: 32, offset: 960)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1364, file: !14, line: 1744, baseType: !941, size: 32, align: 32, offset: 992)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1364, file: !14, line: 1744, baseType: !941, size: 32, align: 32, offset: 1024)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1364, file: !14, line: 1751, baseType: !941, size: 32, align: 32, offset: 1056)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1364, file: !14, line: 1766, baseType: !654, size: 32, align: 32, offset: 1088)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1364, file: !14, line: 1791, baseType: !1529, size: 64, align: 64, offset: 1152)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{null, !1532, !1473, !1475, !941, !941, !941}
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1364, file: !14, line: 1808, baseType: !1534, size: 64, align: 64, offset: 1216)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{!654, !1532, !1383}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1364, file: !14, line: 1816, baseType: !941, size: 32, align: 32, offset: 1280)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1364, file: !14, line: 1825, baseType: !1539, size: 32, align: 32, offset: 1312)
!1539 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1364, file: !14, line: 1830, baseType: !941, size: 32, align: 32, offset: 1344)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1364, file: !14, line: 1838, baseType: !1539, size: 32, align: 32, offset: 1376)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1364, file: !14, line: 1846, baseType: !941, size: 32, align: 32, offset: 1408)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1364, file: !14, line: 1851, baseType: !941, size: 32, align: 32, offset: 1440)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1364, file: !14, line: 1861, baseType: !1539, size: 32, align: 32, offset: 1472)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1364, file: !14, line: 1868, baseType: !1539, size: 32, align: 32, offset: 1504)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1364, file: !14, line: 1875, baseType: !1539, size: 32, align: 32, offset: 1536)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1364, file: !14, line: 1882, baseType: !1539, size: 32, align: 32, offset: 1568)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1364, file: !14, line: 1889, baseType: !1539, size: 32, align: 32, offset: 1600)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1364, file: !14, line: 1896, baseType: !1539, size: 32, align: 32, offset: 1632)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1364, file: !14, line: 1903, baseType: !1539, size: 32, align: 32, offset: 1664)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1364, file: !14, line: 1910, baseType: !941, size: 32, align: 32, offset: 1696)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1364, file: !14, line: 1915, baseType: !941, size: 32, align: 32, offset: 1728)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1364, file: !14, line: 1926, baseType: !1475, size: 64, align: 64, offset: 1792)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1364, file: !14, line: 1935, baseType: !1200, size: 64, align: 32, offset: 1856)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1364, file: !14, line: 1942, baseType: !941, size: 32, align: 32, offset: 1920)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1364, file: !14, line: 1948, baseType: !941, size: 32, align: 32, offset: 1952)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1364, file: !14, line: 1954, baseType: !941, size: 32, align: 32, offset: 1984)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1364, file: !14, line: 1960, baseType: !941, size: 32, align: 32, offset: 2016)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1364, file: !14, line: 1984, baseType: !941, size: 32, align: 32, offset: 2048)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1364, file: !14, line: 1991, baseType: !941, size: 32, align: 32, offset: 2080)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1364, file: !14, line: 1996, baseType: !941, size: 32, align: 32, offset: 2112)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1364, file: !14, line: 2004, baseType: !941, size: 32, align: 32, offset: 2144)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1364, file: !14, line: 2011, baseType: !941, size: 32, align: 32, offset: 2176)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1364, file: !14, line: 2018, baseType: !941, size: 32, align: 32, offset: 2208)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1364, file: !14, line: 2027, baseType: !941, size: 32, align: 32, offset: 2240)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1364, file: !14, line: 2034, baseType: !941, size: 32, align: 32, offset: 2272)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1364, file: !14, line: 2044, baseType: !941, size: 32, align: 32, offset: 2304)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1364, file: !14, line: 2054, baseType: !1569, size: 64, align: 64, offset: 2368)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1364, file: !14, line: 2061, baseType: !1569, size: 64, align: 64, offset: 2432)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1364, file: !14, line: 2066, baseType: !941, size: 32, align: 32, offset: 2496)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1364, file: !14, line: 2070, baseType: !941, size: 32, align: 32, offset: 2528)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1364, file: !14, line: 2078, baseType: !941, size: 32, align: 32, offset: 2560)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1364, file: !14, line: 2085, baseType: !941, size: 32, align: 32, offset: 2592)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1364, file: !14, line: 2092, baseType: !941, size: 32, align: 32, offset: 2624)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1364, file: !14, line: 2099, baseType: !941, size: 32, align: 32, offset: 2656)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1364, file: !14, line: 2106, baseType: !941, size: 32, align: 32, offset: 2688)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1364, file: !14, line: 2113, baseType: !941, size: 32, align: 32, offset: 2720)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1364, file: !14, line: 2120, baseType: !941, size: 32, align: 32, offset: 2752)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1364, file: !14, line: 2125, baseType: !941, size: 32, align: 32, offset: 2784)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1364, file: !14, line: 2133, baseType: !941, size: 32, align: 32, offset: 2816)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1364, file: !14, line: 2140, baseType: !941, size: 32, align: 32, offset: 2848)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1364, file: !14, line: 2145, baseType: !941, size: 32, align: 32, offset: 2880)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1364, file: !14, line: 2153, baseType: !941, size: 32, align: 32, offset: 2912)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1364, file: !14, line: 2158, baseType: !941, size: 32, align: 32, offset: 2944)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1364, file: !14, line: 2166, baseType: !574, size: 32, align: 32, offset: 2976)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1364, file: !14, line: 2173, baseType: !592, size: 32, align: 32, offset: 3008)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1364, file: !14, line: 2180, baseType: !616, size: 32, align: 32, offset: 3040)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1364, file: !14, line: 2187, baseType: !567, size: 32, align: 32, offset: 3072)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1364, file: !14, line: 2194, baseType: !635, size: 32, align: 32, offset: 3104)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1364, file: !14, line: 2203, baseType: !941, size: 32, align: 32, offset: 3136)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1364, file: !14, line: 2209, baseType: !876, size: 32, align: 32, offset: 3168)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1364, file: !14, line: 2212, baseType: !941, size: 32, align: 32, offset: 3200)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1364, file: !14, line: 2213, baseType: !941, size: 32, align: 32, offset: 3232)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1364, file: !14, line: 2220, baseType: !853, size: 32, align: 32, offset: 3264)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1364, file: !14, line: 2232, baseType: !941, size: 32, align: 32, offset: 3296)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1364, file: !14, line: 2243, baseType: !941, size: 32, align: 32, offset: 3328)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1364, file: !14, line: 2249, baseType: !941, size: 32, align: 32, offset: 3360)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1364, file: !14, line: 2256, baseType: !941, size: 32, align: 32, offset: 3392)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1364, file: !14, line: 2263, baseType: !957, size: 64, align: 64, offset: 3456)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1364, file: !14, line: 2270, baseType: !957, size: 64, align: 64, offset: 3520)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1364, file: !14, line: 2277, baseType: !884, size: 32, align: 32, offset: 3584)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1364, file: !14, line: 2285, baseType: !853, size: 32, align: 32, offset: 3616)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1364, file: !14, line: 2367, baseType: !1605, size: 64, align: 64, offset: 3648)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DISubroutineType(types: !1607)
!1607 = !{!941, !1532, !1181, !941}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1364, file: !14, line: 2383, baseType: !941, size: 32, align: 32, offset: 3712)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1364, file: !14, line: 2386, baseType: !1539, size: 32, align: 32, offset: 3744)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1364, file: !14, line: 2387, baseType: !1539, size: 32, align: 32, offset: 3776)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1364, file: !14, line: 2394, baseType: !941, size: 32, align: 32, offset: 3808)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1364, file: !14, line: 2401, baseType: !941, size: 32, align: 32, offset: 3840)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1364, file: !14, line: 2408, baseType: !941, size: 32, align: 32, offset: 3872)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1364, file: !14, line: 2415, baseType: !941, size: 32, align: 32, offset: 3904)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1364, file: !14, line: 2422, baseType: !941, size: 32, align: 32, offset: 3936)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1364, file: !14, line: 2423, baseType: !1617, size: 64, align: 64, offset: 3968)
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64, align: 64)
!1618 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1619)
!1619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1620)
!1620 = !{!1621, !1622, !1623, !1624}
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1619, file: !14, line: 827, baseType: !941, size: 32, align: 32)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1619, file: !14, line: 828, baseType: !941, size: 32, align: 32, offset: 32)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1619, file: !14, line: 829, baseType: !941, size: 32, align: 32, offset: 64)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1619, file: !14, line: 830, baseType: !1539, size: 32, align: 32, offset: 96)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1364, file: !14, line: 2430, baseType: !939, size: 64, align: 64, offset: 4032)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1364, file: !14, line: 2437, baseType: !939, size: 64, align: 64, offset: 4096)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1364, file: !14, line: 2444, baseType: !1539, size: 32, align: 32, offset: 4160)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1364, file: !14, line: 2451, baseType: !1539, size: 32, align: 32, offset: 4192)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1364, file: !14, line: 2458, baseType: !941, size: 32, align: 32, offset: 4224)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1364, file: !14, line: 2469, baseType: !941, size: 32, align: 32, offset: 4256)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1364, file: !14, line: 2475, baseType: !941, size: 32, align: 32, offset: 4288)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1364, file: !14, line: 2481, baseType: !941, size: 32, align: 32, offset: 4320)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1364, file: !14, line: 2485, baseType: !941, size: 32, align: 32, offset: 4352)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1364, file: !14, line: 2489, baseType: !941, size: 32, align: 32, offset: 4384)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1364, file: !14, line: 2493, baseType: !941, size: 32, align: 32, offset: 4416)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1364, file: !14, line: 2501, baseType: !941, size: 32, align: 32, offset: 4448)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1364, file: !14, line: 2506, baseType: !941, size: 32, align: 32, offset: 4480)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1364, file: !14, line: 2510, baseType: !941, size: 32, align: 32, offset: 4512)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1364, file: !14, line: 2514, baseType: !939, size: 64, align: 64, offset: 4544)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1364, file: !14, line: 2528, baseType: !1641, size: 64, align: 64, offset: 4608)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{null, !1532, !938, !941, !941}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1364, file: !14, line: 2534, baseType: !941, size: 32, align: 32, offset: 4672)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1364, file: !14, line: 2545, baseType: !941, size: 32, align: 32, offset: 4704)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1364, file: !14, line: 2547, baseType: !941, size: 32, align: 32, offset: 4736)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1364, file: !14, line: 2549, baseType: !941, size: 32, align: 32, offset: 4768)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1364, file: !14, line: 2551, baseType: !941, size: 32, align: 32, offset: 4800)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1364, file: !14, line: 2553, baseType: !941, size: 32, align: 32, offset: 4832)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1364, file: !14, line: 2555, baseType: !941, size: 32, align: 32, offset: 4864)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1364, file: !14, line: 2557, baseType: !941, size: 32, align: 32, offset: 4896)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1364, file: !14, line: 2559, baseType: !941, size: 32, align: 32, offset: 4928)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1364, file: !14, line: 2563, baseType: !941, size: 32, align: 32, offset: 4960)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1364, file: !14, line: 2571, baseType: !1465, size: 64, align: 64, offset: 4992)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1364, file: !14, line: 2579, baseType: !1465, size: 64, align: 64, offset: 5056)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1364, file: !14, line: 2586, baseType: !941, size: 32, align: 32, offset: 5120)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1364, file: !14, line: 2615, baseType: !941, size: 32, align: 32, offset: 5152)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1364, file: !14, line: 2627, baseType: !941, size: 32, align: 32, offset: 5184)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1364, file: !14, line: 2637, baseType: !941, size: 32, align: 32, offset: 5216)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1364, file: !14, line: 2681, baseType: !941, size: 32, align: 32, offset: 5248)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1364, file: !14, line: 2709, baseType: !939, size: 64, align: 64, offset: 5312)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1364, file: !14, line: 2716, baseType: !1663, size: 64, align: 64, offset: 5376)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1665)
!1665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1666)
!1666 = !{!1667, !1668, !1669, !1670, !1671, !1672, !1673, !1677, !1681, !1682, !1683, !1684, !1690, !1691, !1692, !1693, !1694}
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1665, file: !14, line: 3642, baseType: !975, size: 64, align: 64)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1665, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1665, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1665, file: !14, line: 3663, baseType: !654, size: 32, align: 32, offset: 128)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1665, file: !14, line: 3669, baseType: !941, size: 32, align: 32, offset: 160)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1665, file: !14, line: 3682, baseType: !1490, size: 64, align: 64, offset: 192)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1665, file: !14, line: 3698, baseType: !1674, size: 64, align: 64, offset: 256)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DISubroutineType(types: !1676)
!1676 = !{!941, !1362, !1316, !943}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1665, file: !14, line: 3712, baseType: !1678, size: 64, align: 64, offset: 320)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DISubroutineType(types: !1680)
!1680 = !{!941, !1362, !941, !1316, !943}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1665, file: !14, line: 3726, baseType: !1674, size: 64, align: 64, offset: 384)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1665, file: !14, line: 3737, baseType: !1409, size: 64, align: 64, offset: 448)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1665, file: !14, line: 3746, baseType: !941, size: 32, align: 32, offset: 512)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1665, file: !14, line: 3757, baseType: !1685, size: 64, align: 64, offset: 576)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DISubroutineType(types: !1687)
!1687 = !{null, !1688}
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1665, file: !14, line: 3766, baseType: !1409, size: 64, align: 64, offset: 640)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1665, file: !14, line: 3774, baseType: !1409, size: 64, align: 64, offset: 704)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1665, file: !14, line: 3780, baseType: !941, size: 32, align: 32, offset: 768)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1665, file: !14, line: 3785, baseType: !941, size: 32, align: 32, offset: 800)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1665, file: !14, line: 3795, baseType: !1695, size: 64, align: 64, offset: 832)
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64, align: 64)
!1696 = !DISubroutineType(types: !1697)
!1697 = !{!941, !1362, !1079}
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1364, file: !14, line: 2728, baseType: !938, size: 64, align: 64, offset: 5440)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1364, file: !14, line: 2735, baseType: !1214, size: 512, align: 64, offset: 5504)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1364, file: !14, line: 2742, baseType: !941, size: 32, align: 32, offset: 6016)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1364, file: !14, line: 2755, baseType: !941, size: 32, align: 32, offset: 6048)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1364, file: !14, line: 2776, baseType: !941, size: 32, align: 32, offset: 6080)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1364, file: !14, line: 2783, baseType: !941, size: 32, align: 32, offset: 6112)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1364, file: !14, line: 2791, baseType: !941, size: 32, align: 32, offset: 6144)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1364, file: !14, line: 2802, baseType: !1181, size: 64, align: 64, offset: 6208)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1364, file: !14, line: 2811, baseType: !941, size: 32, align: 32, offset: 6272)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1364, file: !14, line: 2821, baseType: !941, size: 32, align: 32, offset: 6304)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1364, file: !14, line: 2830, baseType: !941, size: 32, align: 32, offset: 6336)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1364, file: !14, line: 2840, baseType: !941, size: 32, align: 32, offset: 6368)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1364, file: !14, line: 2851, baseType: !1711, size: 64, align: 64, offset: 6400)
!1711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1712, size: 64, align: 64)
!1712 = !DISubroutineType(types: !1713)
!1713 = !{!941, !1532, !1714, !938, !1475, !941, !941}
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1715, size: 64, align: 64)
!1715 = !DISubroutineType(types: !1716)
!1716 = !{!941, !1532, !938}
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1364, file: !14, line: 2871, baseType: !1718, size: 64, align: 64, offset: 6464)
!1718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1719, size: 64, align: 64)
!1719 = !DISubroutineType(types: !1720)
!1720 = !{!941, !1532, !1721, !938, !1475, !941}
!1721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1722, size: 64, align: 64)
!1722 = !DISubroutineType(types: !1723)
!1723 = !{!941, !1532, !938, !941, !941}
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1364, file: !14, line: 2878, baseType: !941, size: 32, align: 32, offset: 6528)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1364, file: !14, line: 2885, baseType: !941, size: 32, align: 32, offset: 6560)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1364, file: !14, line: 3005, baseType: !941, size: 32, align: 32, offset: 6592)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1364, file: !14, line: 3013, baseType: !896, size: 32, align: 32, offset: 6624)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1364, file: !14, line: 3020, baseType: !896, size: 32, align: 32, offset: 6656)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1364, file: !14, line: 3027, baseType: !896, size: 32, align: 32, offset: 6688)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1364, file: !14, line: 3037, baseType: !1089, size: 64, align: 64, offset: 6720)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1364, file: !14, line: 3038, baseType: !941, size: 32, align: 32, offset: 6784)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1364, file: !14, line: 3050, baseType: !957, size: 64, align: 64, offset: 6848)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1364, file: !14, line: 3065, baseType: !941, size: 32, align: 32, offset: 6912)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1364, file: !14, line: 3083, baseType: !941, size: 32, align: 32, offset: 6944)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1364, file: !14, line: 3092, baseType: !1200, size: 64, align: 32, offset: 6976)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1364, file: !14, line: 3099, baseType: !654, size: 32, align: 32, offset: 7040)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1364, file: !14, line: 3106, baseType: !1200, size: 64, align: 32, offset: 7072)
