; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--serdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--serdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!870 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8", value: 0)
!871 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16", value: 1)
!872 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32", value: 2)
!873 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLT", value: 3)
!874 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBL", value: 4)
!875 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8P", value: 5)
!876 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16P", value: 6)
!877 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32P", value: 7)
!878 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLTP", value: 8)
!879 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBLP", value: 9)
!880 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64", value: 10)
!881 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!882 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!883 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !4, line: 3865, size: 32, align: 32, elements: !884)
!884 = !{!885, !886, !887, !888}
!885 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!886 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!887 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!888 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !{!939, !940}
!939 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!940 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!941 = !{!942, !2190, !2191}
!942 = distinct !DIGlobalVariable(name: "ff_ser_demuxer", scope: !0, file: !943, line: 135, type: !944, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_ser_demuxer)
!943 = !DIFile(filename: "libavformat/serdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !946)
!946 = !{!947, !951, !952, !953, !954, !964, !1047, !1048, !1050, !1051, !1052, !1066, !2171, !2172, !2173, !2177, !2181, !2182, !2183, !2187, !2188, !2189}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !945, file: !919, line: 638, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !945, file: !919, line: 645, baseType: !948, size: 64, align: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !945, file: !919, line: 652, baseType: !939, size: 32, align: 32, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !945, file: !919, line: 659, baseType: !948, size: 64, align: 64, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !945, file: !919, line: 661, baseType: !955, size: 64, align: 64, offset: 256)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !960, line: 44, size: 64, align: 32, elements: !961)
!960 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !959, file: !960, line: 45, baseType: !3, size: 32, align: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !959, file: !960, line: 46, baseType: !940, size: 32, align: 32, offset: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !945, file: !919, line: 663, baseType: !965, size: 64, align: 64, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !969)
!969 = !{!970, !971, !976, !1006, !1007, !1008, !1009, !1013, !1019, !1021, !1025}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !968, file: !486, line: 72, baseType: !948, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !968, file: !486, line: 78, baseType: !972, size: 64, align: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!948, !975}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !968, file: !486, line: 85, baseType: !977, size: 64, align: 64, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !980)
!980 = !{!981, !982, !983, !984, !985, !1002, !1003, !1004, !1005}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !979, file: !464, line: 247, baseType: !948, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !979, file: !464, line: 253, baseType: !948, size: 64, align: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !979, file: !464, line: 259, baseType: !939, size: 32, align: 32, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !979, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !979, file: !464, line: 271, baseType: !986, size: 64, align: 64, offset: 192)
!986 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !979, file: !464, line: 265, size: 64, align: 64, elements: !987)
!987 = !{!988, !992, !994, !995}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !986, file: !464, line: 266, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !990, line: 40, baseType: !991)
!990 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!991 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !986, file: !464, line: 267, baseType: !993, size: 64, align: 64)
!993 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !986, file: !464, line: 268, baseType: !948, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !986, file: !464, line: 270, baseType: !996, size: 64, align: 32)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !997, line: 61, baseType: !998)
!997 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !997, line: 58, size: 64, align: 32, elements: !999)
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !998, file: !997, line: 59, baseType: !939, size: 32, align: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !998, file: !997, line: 60, baseType: !939, size: 32, align: 32, offset: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !979, file: !464, line: 272, baseType: !993, size: 64, align: 64, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !979, file: !464, line: 273, baseType: !993, size: 64, align: 64, offset: 320)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !979, file: !464, line: 275, baseType: !939, size: 32, align: 32, offset: 384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !979, file: !464, line: 300, baseType: !948, size: 64, align: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !968, file: !486, line: 93, baseType: !939, size: 32, align: 32, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !968, file: !486, line: 99, baseType: !939, size: 32, align: 32, offset: 224)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !968, file: !486, line: 108, baseType: !939, size: 32, align: 32, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !968, file: !486, line: 113, baseType: !1010, size: 64, align: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!975, !975, !975}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !968, file: !486, line: 123, baseType: !1014, size: 64, align: 64, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!1017, !1017}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !968, file: !486, line: 130, baseType: !1020, size: 32, align: 32, offset: 448)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !968, file: !486, line: 136, baseType: !1022, size: 64, align: 64, offset: 512)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1020, !975}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !968, file: !486, line: 142, baseType: !1026, size: 64, align: 64, offset: 576)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!939, !1029, !975, !948, !939}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1032)
!1032 = !{!1033, !1045, !1046}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1031, file: !464, line: 360, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1044}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1037, file: !464, line: 307, baseType: !948, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1037, file: !464, line: 313, baseType: !993, size: 64, align: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1037, file: !464, line: 313, baseType: !993, size: 64, align: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1037, file: !464, line: 318, baseType: !993, size: 64, align: 64, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1037, file: !464, line: 318, baseType: !993, size: 64, align: 64, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1037, file: !464, line: 323, baseType: !939, size: 32, align: 32, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1031, file: !464, line: 364, baseType: !939, size: 32, align: 32, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1031, file: !464, line: 368, baseType: !939, size: 32, align: 32, offset: 96)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !945, file: !919, line: 670, baseType: !948, size: 64, align: 64, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !945, file: !919, line: 679, baseType: !1049, size: 64, align: 64, offset: 448)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !945, file: !919, line: 684, baseType: !939, size: 32, align: 32, offset: 512)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !945, file: !919, line: 689, baseType: !939, size: 32, align: 32, offset: 544)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !945, file: !919, line: 696, baseType: !1053, size: 64, align: 64, offset: 576)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!939, !1056}
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1059)
!1059 = !{!1060, !1061, !1064, !1065}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1058, file: !919, line: 449, baseType: !948, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1058, file: !919, line: 450, baseType: !1062, size: 64, align: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1058, file: !919, line: 451, baseType: !939, size: 32, align: 32, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1058, file: !919, line: 452, baseType: !948, size: 64, align: 64, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !945, file: !919, line: 703, baseType: !1067, size: 64, align: 64, offset: 640)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!939, !1070}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1267, !1268, !1333, !1334, !1335, !2028, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2082, !2083, !2084, !2085, !2086, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2137, !2138, !2141, !2142, !2143, !2144, !2145, !2146, !2148, !2149, !2150, !2151, !2159, !2160, !2164, !2168, !2169, !2170}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1071, file: !919, line: 1342, baseType: !965, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1071, file: !919, line: 1349, baseType: !1049, size: 64, align: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1071, file: !919, line: 1356, baseType: !1076, size: 64, align: 64, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1078)
!1078 = !{!1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1132, !1133, !1137, !1141, !1146, !1153, !1242, !1248, !1254, !1255, !1256, !1257, !1261}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1077, file: !919, line: 498, baseType: !948, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1077, file: !919, line: 504, baseType: !948, size: 64, align: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1077, file: !919, line: 505, baseType: !948, size: 64, align: 64, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1077, file: !919, line: 506, baseType: !948, size: 64, align: 64, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1077, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1077, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1077, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1077, file: !919, line: 517, baseType: !939, size: 32, align: 32, offset: 352)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1077, file: !919, line: 523, baseType: !955, size: 64, align: 64, offset: 384)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1077, file: !919, line: 526, baseType: !965, size: 64, align: 64, offset: 448)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1077, file: !919, line: 535, baseType: !1076, size: 64, align: 64, offset: 512)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1077, file: !919, line: 539, baseType: !939, size: 32, align: 32, offset: 576)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1077, file: !919, line: 541, baseType: !1067, size: 64, align: 64, offset: 640)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1077, file: !919, line: 549, baseType: !1093, size: 64, align: 64, offset: 704)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!939, !1070, !1096}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1099)
!1099 = !{!1100, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1128, !1129, !1130, !1131}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1098, file: !4, line: 1451, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1103, line: 94, baseType: !1104)
!1103 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1103, line: 81, size: 192, align: 64, elements: !1105)
!1105 = !{!1106, !1110, !1113}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1104, file: !1103, line: 82, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1103, line: 73, baseType: !1109)
!1109 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1103, line: 73, flags: DIFlagFwdDecl)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1104, file: !1103, line: 89, baseType: !1111, size: 64, align: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !990, line: 48, baseType: !1063)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1104, file: !1103, line: 93, baseType: !939, size: 32, align: 32, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1098, file: !4, line: 1461, baseType: !989, size: 64, align: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1098, file: !4, line: 1467, baseType: !989, size: 64, align: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1098, file: !4, line: 1468, baseType: !1111, size: 64, align: 64, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1098, file: !4, line: 1469, baseType: !939, size: 32, align: 32, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1098, file: !4, line: 1470, baseType: !939, size: 32, align: 32, offset: 288)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1098, file: !4, line: 1474, baseType: !939, size: 32, align: 32, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1098, file: !4, line: 1479, baseType: !1121, size: 64, align: 64, offset: 384)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1124)
!1124 = !{!1125, !1126, !1127}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1123, file: !4, line: 1412, baseType: !1111, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1123, file: !4, line: 1413, baseType: !939, size: 32, align: 32, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1123, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1098, file: !4, line: 1480, baseType: !939, size: 32, align: 32, offset: 448)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1098, file: !4, line: 1486, baseType: !989, size: 64, align: 64, offset: 512)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1098, file: !4, line: 1488, baseType: !989, size: 64, align: 64, offset: 576)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1098, file: !4, line: 1497, baseType: !989, size: 64, align: 64, offset: 640)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1077, file: !919, line: 550, baseType: !1067, size: 64, align: 64, offset: 768)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1077, file: !919, line: 554, baseType: !1134, size: 64, align: 64, offset: 832)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!939, !1070, !1096, !1096, !939}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1077, file: !919, line: 563, baseType: !1138, size: 64, align: 64, offset: 896)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!939, !3, !939}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1077, file: !919, line: 565, baseType: !1142, size: 64, align: 64, offset: 960)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{null, !1070, !939, !1145, !1145}
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1077, file: !919, line: 570, baseType: !1147, size: 64, align: 64, offset: 1024)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!939, !1070, !939, !975, !1150}
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1151, line: 216, baseType: !1152)
!1151 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1152 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1077, file: !919, line: 581, baseType: !1154, size: 64, align: 64, offset: 1088)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!939, !1070, !939, !1157, !940}
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1161)
!1161 = !{!1162, !1166, !1168, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1196, !1198, !1199, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1160, file: !548, line: 282, baseType: !1163, size: 512, align: 64)
!1163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1111, size: 512, align: 64, elements: !1164)
!1164 = !{!1165}
!1165 = !DISubrange(count: 8)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1160, file: !548, line: 299, baseType: !1167, size: 256, align: 32, offset: 512)
!1167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 256, align: 32, elements: !1164)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1160, file: !548, line: 315, baseType: !1169, size: 64, align: 64, offset: 768)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1160, file: !548, line: 326, baseType: !939, size: 32, align: 32, offset: 832)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1160, file: !548, line: 326, baseType: !939, size: 32, align: 32, offset: 864)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1160, file: !548, line: 334, baseType: !939, size: 32, align: 32, offset: 896)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1160, file: !548, line: 341, baseType: !939, size: 32, align: 32, offset: 928)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1160, file: !548, line: 346, baseType: !939, size: 32, align: 32, offset: 960)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1160, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1160, file: !548, line: 356, baseType: !996, size: 64, align: 32, offset: 1024)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1160, file: !548, line: 361, baseType: !989, size: 64, align: 64, offset: 1088)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1160, file: !548, line: 369, baseType: !989, size: 64, align: 64, offset: 1152)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1160, file: !548, line: 377, baseType: !989, size: 64, align: 64, offset: 1216)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1160, file: !548, line: 382, baseType: !939, size: 32, align: 32, offset: 1280)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1160, file: !548, line: 386, baseType: !939, size: 32, align: 32, offset: 1312)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1160, file: !548, line: 391, baseType: !939, size: 32, align: 32, offset: 1344)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1160, file: !548, line: 396, baseType: !975, size: 64, align: 64, offset: 1408)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1160, file: !548, line: 403, baseType: !1185, size: 512, align: 64, offset: 1472)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1186, size: 512, align: 64, elements: !1164)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !990, line: 55, baseType: !1152)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1160, file: !548, line: 410, baseType: !939, size: 32, align: 32, offset: 1984)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1160, file: !548, line: 415, baseType: !939, size: 32, align: 32, offset: 2016)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1160, file: !548, line: 420, baseType: !939, size: 32, align: 32, offset: 2048)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1160, file: !548, line: 425, baseType: !939, size: 32, align: 32, offset: 2080)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1160, file: !548, line: 435, baseType: !989, size: 64, align: 64, offset: 2112)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1160, file: !548, line: 440, baseType: !939, size: 32, align: 32, offset: 2176)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1160, file: !548, line: 445, baseType: !1186, size: 64, align: 64, offset: 2240)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1160, file: !548, line: 459, baseType: !1195, size: 512, align: 64, offset: 2304)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 512, align: 64, elements: !1164)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1160, file: !548, line: 473, baseType: !1197, size: 64, align: 64, offset: 2816)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1160, file: !548, line: 477, baseType: !939, size: 32, align: 32, offset: 2880)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1160, file: !548, line: 479, baseType: !1200, size: 64, align: 64, offset: 2944)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1204)
!1204 = !{!1205, !1206, !1207, !1208, !1213}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1203, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1203, file: !548, line: 203, baseType: !1111, size: 64, align: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1203, file: !548, line: 204, baseType: !939, size: 32, align: 32, offset: 128)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1203, file: !548, line: 205, baseType: !1209, size: 64, align: 64, offset: 192)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1211, line: 86, baseType: !1212)
!1211 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1212 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1211, line: 86, flags: DIFlagFwdDecl)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1203, file: !548, line: 206, baseType: !1101, size: 64, align: 64, offset: 256)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1160, file: !548, line: 480, baseType: !939, size: 32, align: 32, offset: 3008)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1160, file: !548, line: 505, baseType: !939, size: 32, align: 32, offset: 3040)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1160, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1160, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1160, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1160, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1160, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1160, file: !548, line: 532, baseType: !989, size: 64, align: 64, offset: 3264)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1160, file: !548, line: 539, baseType: !989, size: 64, align: 64, offset: 3328)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1160, file: !548, line: 547, baseType: !989, size: 64, align: 64, offset: 3392)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1160, file: !548, line: 554, baseType: !1209, size: 64, align: 64, offset: 3456)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1160, file: !548, line: 563, baseType: !939, size: 32, align: 32, offset: 3520)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1160, file: !548, line: 572, baseType: !939, size: 32, align: 32, offset: 3552)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1160, file: !548, line: 581, baseType: !939, size: 32, align: 32, offset: 3584)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1160, file: !548, line: 588, baseType: !1229, size: 64, align: 64, offset: 3648)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !990, line: 36, baseType: !1231)
!1231 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1160, file: !548, line: 593, baseType: !939, size: 32, align: 32, offset: 3712)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1160, file: !548, line: 596, baseType: !939, size: 32, align: 32, offset: 3744)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1160, file: !548, line: 599, baseType: !1101, size: 64, align: 64, offset: 3776)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1160, file: !548, line: 605, baseType: !1101, size: 64, align: 64, offset: 3840)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1160, file: !548, line: 616, baseType: !1101, size: 64, align: 64, offset: 3904)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1160, file: !548, line: 626, baseType: !1150, size: 64, align: 64, offset: 3968)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1160, file: !548, line: 627, baseType: !1150, size: 64, align: 64, offset: 4032)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1160, file: !548, line: 628, baseType: !1150, size: 64, align: 64, offset: 4096)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1160, file: !548, line: 629, baseType: !1150, size: 64, align: 64, offset: 4160)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1160, file: !548, line: 645, baseType: !1101, size: 64, align: 64, offset: 4224)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1077, file: !919, line: 587, baseType: !1243, size: 64, align: 64, offset: 1152)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!939, !1070, !1246}
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1077, file: !919, line: 592, baseType: !1249, size: 64, align: 64, offset: 1216)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!939, !1070, !1252}
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1077, file: !919, line: 597, baseType: !1249, size: 64, align: 64, offset: 1280)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1077, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1077, file: !919, line: 608, baseType: !1067, size: 64, align: 64, offset: 1408)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1077, file: !919, line: 617, baseType: !1258, size: 64, align: 64, offset: 1472)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{null, !1070}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1077, file: !919, line: 623, baseType: !1262, size: 64, align: 64, offset: 1536)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!939, !1070, !1265}
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1097)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1071, file: !919, line: 1365, baseType: !975, size: 64, align: 64, offset: 192)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1071, file: !919, line: 1379, baseType: !1269, size: 64, align: 64, offset: 256)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1271)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1272)
!1272 = !{!1273, !1274, !1275, !1276, !1277, !1278, !1279, !1283, !1284, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1300, !1301, !1305, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1323, !1324, !1325, !1326, !1330, !1331, !1332}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1271, file: !650, line: 174, baseType: !965, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1271, file: !650, line: 226, baseType: !1062, size: 64, align: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1271, file: !650, line: 227, baseType: !939, size: 32, align: 32, offset: 128)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1271, file: !650, line: 228, baseType: !1062, size: 64, align: 64, offset: 192)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1271, file: !650, line: 229, baseType: !1062, size: 64, align: 64, offset: 256)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1271, file: !650, line: 233, baseType: !975, size: 64, align: 64, offset: 320)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1271, file: !650, line: 235, baseType: !1280, size: 64, align: 64, offset: 384)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!939, !975, !1111, !939}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1271, file: !650, line: 236, baseType: !1280, size: 64, align: 64, offset: 448)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1271, file: !650, line: 237, baseType: !1285, size: 64, align: 64, offset: 512)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!989, !975, !989, !939}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1271, file: !650, line: 238, baseType: !989, size: 64, align: 64, offset: 576)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1271, file: !650, line: 239, baseType: !939, size: 32, align: 32, offset: 640)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1271, file: !650, line: 240, baseType: !939, size: 32, align: 32, offset: 672)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1271, file: !650, line: 241, baseType: !939, size: 32, align: 32, offset: 704)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1271, file: !650, line: 242, baseType: !1152, size: 64, align: 64, offset: 768)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1271, file: !650, line: 243, baseType: !1062, size: 64, align: 64, offset: 832)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1271, file: !650, line: 244, baseType: !1295, size: 64, align: 64, offset: 896)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{!1152, !1152, !1298, !940}
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1112)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1271, file: !650, line: 245, baseType: !939, size: 32, align: 32, offset: 960)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1271, file: !650, line: 249, baseType: !1302, size: 64, align: 64, offset: 1024)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!939, !975, !939}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1271, file: !650, line: 255, baseType: !1306, size: 64, align: 64, offset: 1088)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!989, !975, !939, !989, !939}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1271, file: !650, line: 260, baseType: !939, size: 32, align: 32, offset: 1152)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1271, file: !650, line: 266, baseType: !989, size: 64, align: 64, offset: 1216)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1271, file: !650, line: 273, baseType: !939, size: 32, align: 32, offset: 1280)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1271, file: !650, line: 279, baseType: !989, size: 64, align: 64, offset: 1344)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1271, file: !650, line: 285, baseType: !939, size: 32, align: 32, offset: 1408)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1271, file: !650, line: 291, baseType: !939, size: 32, align: 32, offset: 1440)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1271, file: !650, line: 298, baseType: !939, size: 32, align: 32, offset: 1472)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1271, file: !650, line: 304, baseType: !939, size: 32, align: 32, offset: 1504)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1271, file: !650, line: 309, baseType: !948, size: 64, align: 64, offset: 1536)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1271, file: !650, line: 314, baseType: !948, size: 64, align: 64, offset: 1600)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1271, file: !650, line: 319, baseType: !1320, size: 64, align: 64, offset: 1664)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!939, !975, !1111, !939, !649, !989}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1271, file: !650, line: 326, baseType: !939, size: 32, align: 32, offset: 1728)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1271, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1271, file: !650, line: 332, baseType: !989, size: 64, align: 64, offset: 1792)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1271, file: !650, line: 338, baseType: !1327, size: 64, align: 64, offset: 1856)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!939, !975}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1271, file: !650, line: 340, baseType: !989, size: 64, align: 64, offset: 1920)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1271, file: !650, line: 346, baseType: !1062, size: 64, align: 64, offset: 1984)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1271, file: !650, line: 351, baseType: !939, size: 32, align: 32, offset: 2048)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1071, file: !919, line: 1386, baseType: !939, size: 32, align: 32, offset: 320)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1071, file: !919, line: 1393, baseType: !940, size: 32, align: 32, offset: 352)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1071, file: !919, line: 1405, baseType: !1336, size: 64, align: 64, offset: 384)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1339)
!1339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1340)
!1340 = !{!1341, !1342, !1343, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1814, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1914, !1920, !1921, !1925, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1957, !1958, !1959, !1960, !1961, !1962}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1339, file: !919, line: 866, baseType: !939, size: 32, align: 32)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1339, file: !919, line: 872, baseType: !939, size: 32, align: 32, offset: 32)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1339, file: !919, line: 878, baseType: !1344, size: 64, align: 64, offset: 64)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1346)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1347)
!1347 = !{!1348, !1349, !1350, !1351, !1489, !1490, !1491, !1492, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1518, !1522, !1523, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1702, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1346, file: !4, line: 1561, baseType: !965, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1346, file: !4, line: 1562, baseType: !939, size: 32, align: 32, offset: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1346, file: !4, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1346, file: !4, line: 1565, baseType: !1352, size: 64, align: 64, offset: 128)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1354)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1355)
!1355 = !{!1356, !1357, !1358, !1359, !1360, !1361, !1364, !1367, !1370, !1373, !1376, !1377, !1378, !1386, !1387, !1388, !1390, !1394, !1400, !1405, !1409, !1410, !1454, !1461, !1465, !1466, !1470, !1474, !1478, !1482, !1483, !1484}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1354, file: !4, line: 3475, baseType: !948, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1354, file: !4, line: 3480, baseType: !948, size: 64, align: 64, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1354, file: !4, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1354, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1354, file: !4, line: 3487, baseType: !939, size: 32, align: 32, offset: 192)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1354, file: !4, line: 3488, baseType: !1362, size: 64, align: 64, offset: 256)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1354, file: !4, line: 3489, baseType: !1365, size: 64, align: 64, offset: 320)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1354, file: !4, line: 3490, baseType: !1368, size: 64, align: 64, offset: 384)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1354, file: !4, line: 3491, baseType: !1371, size: 64, align: 64, offset: 448)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1354, file: !4, line: 3492, baseType: !1374, size: 64, align: 64, offset: 512)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1186)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1354, file: !4, line: 3493, baseType: !1112, size: 8, align: 8, offset: 576)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1354, file: !4, line: 3494, baseType: !965, size: 64, align: 64, offset: 640)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1354, file: !4, line: 3495, baseType: !1379, size: 64, align: 64, offset: 704)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1381)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1382)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1383)
!1383 = !{!1384, !1385}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1382, file: !4, line: 3402, baseType: !939, size: 32, align: 32)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1382, file: !4, line: 3403, baseType: !948, size: 64, align: 64, offset: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1354, file: !4, line: 3507, baseType: !948, size: 64, align: 64, offset: 768)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1354, file: !4, line: 3516, baseType: !939, size: 32, align: 32, offset: 832)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1354, file: !4, line: 3517, baseType: !1389, size: 64, align: 64, offset: 896)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1354, file: !4, line: 3527, baseType: !1391, size: 64, align: 64, offset: 960)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DISubroutineType(types: !1393)
!1393 = !{!939, !1344}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1354, file: !4, line: 3535, baseType: !1395, size: 64, align: 64, offset: 1024)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DISubroutineType(types: !1397)
!1397 = !{!939, !1344, !1398}
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1345)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1354, file: !4, line: 3541, baseType: !1401, size: 64, align: 64, offset: 1088)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1403)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1404)
!1404 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1354, file: !4, line: 3549, baseType: !1406, size: 64, align: 64, offset: 1152)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DISubroutineType(types: !1408)
!1408 = !{null, !1389}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1354, file: !4, line: 3551, baseType: !1391, size: 64, align: 64, offset: 1216)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1354, file: !4, line: 3552, baseType: !1411, size: 64, align: 64, offset: 1280)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DISubroutineType(types: !1413)
!1413 = !{!939, !1344, !1111, !939, !1414}
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1416)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1417)
!1417 = !{!1418, !1421, !1423, !1424, !1425, !1453}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1416, file: !4, line: 3921, baseType: !1419, size: 16, align: 16)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !990, line: 49, baseType: !1420)
!1420 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1416, file: !4, line: 3922, baseType: !1422, size: 32, align: 32, offset: 32)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !990, line: 51, baseType: !940)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1416, file: !4, line: 3923, baseType: !1422, size: 32, align: 32, offset: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1416, file: !4, line: 3924, baseType: !940, size: 32, align: 32, offset: 96)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1416, file: !4, line: 3925, baseType: !1426, size: 64, align: 64, offset: 128)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1429)
!1429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1430)
!1430 = !{!1431, !1432, !1433, !1434, !1435, !1436, !1442, !1446, !1448, !1449, !1451, !1452}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1429, file: !4, line: 3886, baseType: !939, size: 32, align: 32)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1429, file: !4, line: 3887, baseType: !939, size: 32, align: 32, offset: 32)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1429, file: !4, line: 3888, baseType: !939, size: 32, align: 32, offset: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1429, file: !4, line: 3889, baseType: !939, size: 32, align: 32, offset: 96)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1429, file: !4, line: 3890, baseType: !939, size: 32, align: 32, offset: 128)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1429, file: !4, line: 3897, baseType: !1437, size: 768, align: 64, offset: 192)
!1437 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1438)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1439)
!1439 = !{!1440, !1441}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1438, file: !4, line: 3855, baseType: !1163, size: 512, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1438, file: !4, line: 3857, baseType: !1167, size: 256, align: 32, offset: 512)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1429, file: !4, line: 3903, baseType: !1443, size: 256, align: 64, offset: 960)
!1443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1111, size: 256, align: 64, elements: !1444)
!1444 = !{!1445}
!1445 = !DISubrange(count: 4)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1429, file: !4, line: 3904, baseType: !1447, size: 128, align: 32, offset: 1216)
!1447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 128, align: 32, elements: !1444)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1429, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1429, file: !4, line: 3908, baseType: !1450, size: 64, align: 64, offset: 1408)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1429, file: !4, line: 3915, baseType: !1450, size: 64, align: 64, offset: 1472)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1429, file: !4, line: 3917, baseType: !939, size: 32, align: 32, offset: 1536)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1416, file: !4, line: 3926, baseType: !989, size: 64, align: 64, offset: 192)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1354, file: !4, line: 3564, baseType: !1455, size: 64, align: 64, offset: 1344)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{!939, !1344, !1096, !1458, !1460}
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1159)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1354, file: !4, line: 3566, baseType: !1462, size: 64, align: 64, offset: 1408)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{!939, !1344, !975, !1460, !1096}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1354, file: !4, line: 3567, baseType: !1391, size: 64, align: 64, offset: 1472)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1354, file: !4, line: 3576, baseType: !1467, size: 64, align: 64, offset: 1536)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DISubroutineType(types: !1469)
!1469 = !{!939, !1344, !1458}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1354, file: !4, line: 3577, baseType: !1471, size: 64, align: 64, offset: 1600)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{!939, !1344, !1096}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1354, file: !4, line: 3584, baseType: !1475, size: 64, align: 64, offset: 1664)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!939, !1344, !1158}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1354, file: !4, line: 3589, baseType: !1479, size: 64, align: 64, offset: 1728)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{null, !1344}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1354, file: !4, line: 3594, baseType: !939, size: 32, align: 32, offset: 1792)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1354, file: !4, line: 3600, baseType: !948, size: 64, align: 64, offset: 1856)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1354, file: !4, line: 3609, baseType: !1485, size: 64, align: 64, offset: 1920)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1488)
!1488 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1346, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1346, file: !4, line: 1581, baseType: !940, size: 32, align: 32, offset: 224)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1346, file: !4, line: 1583, baseType: !975, size: 64, align: 64, offset: 256)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1346, file: !4, line: 1591, baseType: !1493, size: 64, align: 64, offset: 320)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1346, file: !4, line: 1598, baseType: !975, size: 64, align: 64, offset: 384)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1346, file: !4, line: 1606, baseType: !989, size: 64, align: 64, offset: 448)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1346, file: !4, line: 1614, baseType: !939, size: 32, align: 32, offset: 512)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1346, file: !4, line: 1622, baseType: !939, size: 32, align: 32, offset: 544)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1346, file: !4, line: 1628, baseType: !939, size: 32, align: 32, offset: 576)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1346, file: !4, line: 1636, baseType: !939, size: 32, align: 32, offset: 608)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1346, file: !4, line: 1643, baseType: !939, size: 32, align: 32, offset: 640)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1346, file: !4, line: 1657, baseType: !1111, size: 64, align: 64, offset: 704)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1346, file: !4, line: 1658, baseType: !939, size: 32, align: 32, offset: 768)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1346, file: !4, line: 1679, baseType: !996, size: 64, align: 32, offset: 800)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1346, file: !4, line: 1688, baseType: !939, size: 32, align: 32, offset: 864)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1346, file: !4, line: 1712, baseType: !939, size: 32, align: 32, offset: 896)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1346, file: !4, line: 1729, baseType: !939, size: 32, align: 32, offset: 928)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1346, file: !4, line: 1729, baseType: !939, size: 32, align: 32, offset: 960)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1346, file: !4, line: 1744, baseType: !939, size: 32, align: 32, offset: 992)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1346, file: !4, line: 1744, baseType: !939, size: 32, align: 32, offset: 1024)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1346, file: !4, line: 1751, baseType: !939, size: 32, align: 32, offset: 1056)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1346, file: !4, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1346, file: !4, line: 1791, baseType: !1514, size: 64, align: 64, offset: 1152)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{null, !1517, !1458, !1460, !939, !939, !939}
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1346, file: !4, line: 1808, baseType: !1519, size: 64, align: 64, offset: 1216)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DISubroutineType(types: !1521)
!1521 = !{!667, !1517, !1365}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1346, file: !4, line: 1816, baseType: !939, size: 32, align: 32, offset: 1280)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1346, file: !4, line: 1825, baseType: !1524, size: 32, align: 32, offset: 1312)
!1524 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1346, file: !4, line: 1830, baseType: !939, size: 32, align: 32, offset: 1344)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1346, file: !4, line: 1838, baseType: !1524, size: 32, align: 32, offset: 1376)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1346, file: !4, line: 1846, baseType: !939, size: 32, align: 32, offset: 1408)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1346, file: !4, line: 1851, baseType: !939, size: 32, align: 32, offset: 1440)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1346, file: !4, line: 1861, baseType: !1524, size: 32, align: 32, offset: 1472)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1346, file: !4, line: 1868, baseType: !1524, size: 32, align: 32, offset: 1504)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1346, file: !4, line: 1875, baseType: !1524, size: 32, align: 32, offset: 1536)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1346, file: !4, line: 1882, baseType: !1524, size: 32, align: 32, offset: 1568)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1346, file: !4, line: 1889, baseType: !1524, size: 32, align: 32, offset: 1600)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1346, file: !4, line: 1896, baseType: !1524, size: 32, align: 32, offset: 1632)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1346, file: !4, line: 1903, baseType: !1524, size: 32, align: 32, offset: 1664)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1346, file: !4, line: 1910, baseType: !939, size: 32, align: 32, offset: 1696)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1346, file: !4, line: 1915, baseType: !939, size: 32, align: 32, offset: 1728)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1346, file: !4, line: 1926, baseType: !1460, size: 64, align: 64, offset: 1792)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1346, file: !4, line: 1935, baseType: !996, size: 64, align: 32, offset: 1856)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1346, file: !4, line: 1942, baseType: !939, size: 32, align: 32, offset: 1920)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1346, file: !4, line: 1948, baseType: !939, size: 32, align: 32, offset: 1952)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1346, file: !4, line: 1954, baseType: !939, size: 32, align: 32, offset: 1984)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1346, file: !4, line: 1960, baseType: !939, size: 32, align: 32, offset: 2016)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1346, file: !4, line: 1984, baseType: !939, size: 32, align: 32, offset: 2048)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1346, file: !4, line: 1991, baseType: !939, size: 32, align: 32, offset: 2080)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1346, file: !4, line: 1996, baseType: !939, size: 32, align: 32, offset: 2112)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1346, file: !4, line: 2004, baseType: !939, size: 32, align: 32, offset: 2144)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1346, file: !4, line: 2011, baseType: !939, size: 32, align: 32, offset: 2176)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1346, file: !4, line: 2018, baseType: !939, size: 32, align: 32, offset: 2208)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1346, file: !4, line: 2027, baseType: !939, size: 32, align: 32, offset: 2240)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1346, file: !4, line: 2034, baseType: !939, size: 32, align: 32, offset: 2272)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1346, file: !4, line: 2044, baseType: !939, size: 32, align: 32, offset: 2304)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1346, file: !4, line: 2054, baseType: !1554, size: 64, align: 64, offset: 2368)
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1346, file: !4, line: 2061, baseType: !1554, size: 64, align: 64, offset: 2432)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1346, file: !4, line: 2066, baseType: !939, size: 32, align: 32, offset: 2496)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1346, file: !4, line: 2070, baseType: !939, size: 32, align: 32, offset: 2528)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1346, file: !4, line: 2078, baseType: !939, size: 32, align: 32, offset: 2560)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1346, file: !4, line: 2085, baseType: !939, size: 32, align: 32, offset: 2592)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1346, file: !4, line: 2092, baseType: !939, size: 32, align: 32, offset: 2624)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1346, file: !4, line: 2099, baseType: !939, size: 32, align: 32, offset: 2656)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1346, file: !4, line: 2106, baseType: !939, size: 32, align: 32, offset: 2688)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1346, file: !4, line: 2113, baseType: !939, size: 32, align: 32, offset: 2720)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1346, file: !4, line: 2120, baseType: !939, size: 32, align: 32, offset: 2752)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1346, file: !4, line: 2125, baseType: !939, size: 32, align: 32, offset: 2784)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1346, file: !4, line: 2133, baseType: !939, size: 32, align: 32, offset: 2816)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1346, file: !4, line: 2140, baseType: !939, size: 32, align: 32, offset: 2848)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1346, file: !4, line: 2145, baseType: !939, size: 32, align: 32, offset: 2880)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1346, file: !4, line: 2153, baseType: !939, size: 32, align: 32, offset: 2912)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1346, file: !4, line: 2158, baseType: !939, size: 32, align: 32, offset: 2944)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1346, file: !4, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1346, file: !4, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1346, file: !4, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1346, file: !4, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1346, file: !4, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1346, file: !4, line: 2203, baseType: !939, size: 32, align: 32, offset: 3136)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1346, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1346, file: !4, line: 2212, baseType: !939, size: 32, align: 32, offset: 3200)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1346, file: !4, line: 2213, baseType: !939, size: 32, align: 32, offset: 3232)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1346, file: !4, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1346, file: !4, line: 2232, baseType: !939, size: 32, align: 32, offset: 3296)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1346, file: !4, line: 2243, baseType: !939, size: 32, align: 32, offset: 3328)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1346, file: !4, line: 2249, baseType: !939, size: 32, align: 32, offset: 3360)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1346, file: !4, line: 2256, baseType: !939, size: 32, align: 32, offset: 3392)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1346, file: !4, line: 2263, baseType: !1186, size: 64, align: 64, offset: 3456)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1346, file: !4, line: 2270, baseType: !1186, size: 64, align: 64, offset: 3520)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1346, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1346, file: !4, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1346, file: !4, line: 2367, baseType: !1590, size: 64, align: 64, offset: 3648)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DISubroutineType(types: !1592)
!1592 = !{!939, !1517, !1158, !939}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1346, file: !4, line: 2383, baseType: !939, size: 32, align: 32, offset: 3712)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1346, file: !4, line: 2386, baseType: !1524, size: 32, align: 32, offset: 3744)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1346, file: !4, line: 2387, baseType: !1524, size: 32, align: 32, offset: 3776)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1346, file: !4, line: 2394, baseType: !939, size: 32, align: 32, offset: 3808)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1346, file: !4, line: 2401, baseType: !939, size: 32, align: 32, offset: 3840)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1346, file: !4, line: 2408, baseType: !939, size: 32, align: 32, offset: 3872)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1346, file: !4, line: 2415, baseType: !939, size: 32, align: 32, offset: 3904)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1346, file: !4, line: 2422, baseType: !939, size: 32, align: 32, offset: 3936)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1346, file: !4, line: 2423, baseType: !1602, size: 64, align: 64, offset: 3968)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1604)
!1604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1605)
!1605 = !{!1606, !1607, !1608, !1609}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1604, file: !4, line: 827, baseType: !939, size: 32, align: 32)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1604, file: !4, line: 828, baseType: !939, size: 32, align: 32, offset: 32)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1604, file: !4, line: 829, baseType: !939, size: 32, align: 32, offset: 64)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1604, file: !4, line: 830, baseType: !1524, size: 32, align: 32, offset: 96)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1346, file: !4, line: 2430, baseType: !989, size: 64, align: 64, offset: 4032)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1346, file: !4, line: 2437, baseType: !989, size: 64, align: 64, offset: 4096)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1346, file: !4, line: 2444, baseType: !1524, size: 32, align: 32, offset: 4160)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1346, file: !4, line: 2451, baseType: !1524, size: 32, align: 32, offset: 4192)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1346, file: !4, line: 2458, baseType: !939, size: 32, align: 32, offset: 4224)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1346, file: !4, line: 2469, baseType: !939, size: 32, align: 32, offset: 4256)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1346, file: !4, line: 2475, baseType: !939, size: 32, align: 32, offset: 4288)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1346, file: !4, line: 2481, baseType: !939, size: 32, align: 32, offset: 4320)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1346, file: !4, line: 2485, baseType: !939, size: 32, align: 32, offset: 4352)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1346, file: !4, line: 2489, baseType: !939, size: 32, align: 32, offset: 4384)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1346, file: !4, line: 2493, baseType: !939, size: 32, align: 32, offset: 4416)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1346, file: !4, line: 2501, baseType: !939, size: 32, align: 32, offset: 4448)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1346, file: !4, line: 2506, baseType: !939, size: 32, align: 32, offset: 4480)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1346, file: !4, line: 2510, baseType: !939, size: 32, align: 32, offset: 4512)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1346, file: !4, line: 2514, baseType: !989, size: 64, align: 64, offset: 4544)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1346, file: !4, line: 2528, baseType: !1626, size: 64, align: 64, offset: 4608)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{null, !1517, !975, !939, !939}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1346, file: !4, line: 2534, baseType: !939, size: 32, align: 32, offset: 4672)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1346, file: !4, line: 2545, baseType: !939, size: 32, align: 32, offset: 4704)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1346, file: !4, line: 2547, baseType: !939, size: 32, align: 32, offset: 4736)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1346, file: !4, line: 2549, baseType: !939, size: 32, align: 32, offset: 4768)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1346, file: !4, line: 2551, baseType: !939, size: 32, align: 32, offset: 4800)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1346, file: !4, line: 2553, baseType: !939, size: 32, align: 32, offset: 4832)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1346, file: !4, line: 2555, baseType: !939, size: 32, align: 32, offset: 4864)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1346, file: !4, line: 2557, baseType: !939, size: 32, align: 32, offset: 4896)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1346, file: !4, line: 2559, baseType: !939, size: 32, align: 32, offset: 4928)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1346, file: !4, line: 2563, baseType: !939, size: 32, align: 32, offset: 4960)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1346, file: !4, line: 2571, baseType: !1450, size: 64, align: 64, offset: 4992)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1346, file: !4, line: 2579, baseType: !1450, size: 64, align: 64, offset: 5056)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1346, file: !4, line: 2586, baseType: !939, size: 32, align: 32, offset: 5120)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1346, file: !4, line: 2615, baseType: !939, size: 32, align: 32, offset: 5152)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1346, file: !4, line: 2627, baseType: !939, size: 32, align: 32, offset: 5184)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1346, file: !4, line: 2637, baseType: !939, size: 32, align: 32, offset: 5216)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1346, file: !4, line: 2681, baseType: !939, size: 32, align: 32, offset: 5248)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1346, file: !4, line: 2709, baseType: !989, size: 64, align: 64, offset: 5312)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1346, file: !4, line: 2716, baseType: !1648, size: 64, align: 64, offset: 5376)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1650)
!1650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1651)
!1651 = !{!1652, !1653, !1654, !1655, !1656, !1657, !1658, !1662, !1666, !1667, !1668, !1669, !1675, !1676, !1677, !1678, !1679}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1650, file: !4, line: 3642, baseType: !948, size: 64, align: 64)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1650, file: !4, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1650, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1650, file: !4, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1650, file: !4, line: 3669, baseType: !939, size: 32, align: 32, offset: 160)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1650, file: !4, line: 3682, baseType: !1475, size: 64, align: 64, offset: 192)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1650, file: !4, line: 3698, baseType: !1659, size: 64, align: 64, offset: 256)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DISubroutineType(types: !1661)
!1661 = !{!939, !1344, !1298, !1422}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1650, file: !4, line: 3712, baseType: !1663, size: 64, align: 64, offset: 320)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{!939, !1344, !939, !1298, !1422}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1650, file: !4, line: 3726, baseType: !1659, size: 64, align: 64, offset: 384)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1650, file: !4, line: 3737, baseType: !1391, size: 64, align: 64, offset: 448)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1650, file: !4, line: 3746, baseType: !939, size: 32, align: 32, offset: 512)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1650, file: !4, line: 3757, baseType: !1670, size: 64, align: 64, offset: 576)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{null, !1673}
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1650, file: !4, line: 3766, baseType: !1391, size: 64, align: 64, offset: 640)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1650, file: !4, line: 3774, baseType: !1391, size: 64, align: 64, offset: 704)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1650, file: !4, line: 3780, baseType: !939, size: 32, align: 32, offset: 768)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1650, file: !4, line: 3785, baseType: !939, size: 32, align: 32, offset: 800)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1650, file: !4, line: 3795, baseType: !1680, size: 64, align: 64, offset: 832)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!939, !1344, !1101}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1346, file: !4, line: 2728, baseType: !975, size: 64, align: 64, offset: 5440)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1346, file: !4, line: 2735, baseType: !1185, size: 512, align: 64, offset: 5504)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1346, file: !4, line: 2742, baseType: !939, size: 32, align: 32, offset: 6016)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1346, file: !4, line: 2755, baseType: !939, size: 32, align: 32, offset: 6048)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1346, file: !4, line: 2776, baseType: !939, size: 32, align: 32, offset: 6080)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1346, file: !4, line: 2783, baseType: !939, size: 32, align: 32, offset: 6112)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1346, file: !4, line: 2791, baseType: !939, size: 32, align: 32, offset: 6144)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1346, file: !4, line: 2802, baseType: !1158, size: 64, align: 64, offset: 6208)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1346, file: !4, line: 2811, baseType: !939, size: 32, align: 32, offset: 6272)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1346, file: !4, line: 2821, baseType: !939, size: 32, align: 32, offset: 6304)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1346, file: !4, line: 2830, baseType: !939, size: 32, align: 32, offset: 6336)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1346, file: !4, line: 2840, baseType: !939, size: 32, align: 32, offset: 6368)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1346, file: !4, line: 2851, baseType: !1696, size: 64, align: 64, offset: 6400)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!939, !1517, !1699, !975, !1460, !939, !939}
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{!939, !1517, !975}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1346, file: !4, line: 2871, baseType: !1703, size: 64, align: 64, offset: 6464)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DISubroutineType(types: !1705)
!1705 = !{!939, !1517, !1706, !975, !1460, !939}
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DISubroutineType(types: !1708)
!1708 = !{!939, !1517, !975, !939, !939}
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1346, file: !4, line: 2878, baseType: !939, size: 32, align: 32, offset: 6528)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1346, file: !4, line: 2885, baseType: !939, size: 32, align: 32, offset: 6560)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1346, file: !4, line: 3005, baseType: !939, size: 32, align: 32, offset: 6592)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1346, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1346, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
