; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpdec_hevc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpdec_hevc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RTPDynamicProtocolHandler = type { i8*, i32, i32, i32, i32, i32, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*, i8*)*, void (%struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, %struct.PayloadContext*, %struct.AVStream*, %struct.AVPacket*, i32*, i8*, i32, i16, i32)*, i32 (%struct.PayloadContext*)*, %struct.RTPDynamicProtocolHandler* }

!853 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSampleFormat", file: !854, line: 58, size: 32, align: 32, elements: !855)
!854 = !DIFile(filename: "./libavutil/samplefmt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!855 = !{!856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869}
!856 = !DIEnumerator(name: "AV_SAMPLE_FMT_NONE", value: -1)
!857 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8", value: 0)
!858 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16", value: 1)
!859 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32", value: 2)
!860 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLT", value: 3)
!861 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBL", value: 4)
!862 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8P", value: 5)
!863 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16P", value: 6)
!864 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32P", value: 7)
!865 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLTP", value: 8)
!866 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBLP", value: 9)
!867 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64", value: 10)
!868 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!869 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !871)
!871 = !{!872, !873, !874, !875}
!872 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!873 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!874 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!875 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!876 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !877)
!877 = !{!878, !879, !880, !881, !882, !883}
!878 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!879 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!880 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!881 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!882 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!883 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892, !893, !894, !895}
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!894 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!895 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !897)
!897 = !{!898, !899, !900, !901, !902, !903, !904}
!898 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!899 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!900 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!901 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!902 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!903 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!904 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !14, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !474, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !918, !919}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!918 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!919 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!920 = !{!921, !2102}
!921 = distinct !DIGlobalVariable(name: "ff_hevc_dynamic_handler", scope: !0, file: !922, line: 350, type: !923, isLocal: false, isDefinition: true, variable: %struct.RTPDynamicProtocolHandler* @ff_hevc_dynamic_handler)
!922 = !DIFile(filename: "libavformat/rtpdec_hevc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTPDynamicProtocolHandler", file: !925, line: 33, baseType: !926)
!925 = !DIFile(filename: "libavformat/rtpdec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RTPDynamicProtocolHandler", file: !925, line: 115, size: 640, align: 64, elements: !927)
!927 = !{!928, !932, !933, !934, !935, !936, !937, !2082, !2086, !2090, !2096, !2100}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "enc_name", scope: !926, file: !925, line: 116, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !926, file: !925, line: 117, baseType: !3, size: 32, align: 32, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !926, file: !925, line: 118, baseType: !13, size: 32, align: 32, offset: 96)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "need_parsing", scope: !926, file: !925, line: 119, baseType: !473, size: 32, align: 32, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "static_payload_id", scope: !926, file: !925, line: 120, baseType: !918, size: 32, align: 32, offset: 160)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !926, file: !925, line: 123, baseType: !918, size: 32, align: 32, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !926, file: !925, line: 126, baseType: !938, size: 64, align: 64, offset: 256)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!918, !941, !918, !2068}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !474, line: 1947, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !474, line: 1337, size: 11968, align: 64, elements: !944)
!944 = !{!945, !986, !1097, !1245, !1246, !1311, !1312, !1313, !1945, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1999, !2000, !2001, !2002, !2003, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2034, !2035, !2038, !2039, !2040, !2041, !2042, !2043, !2045, !2046, !2047, !2048, !2056, !2057, !2061, !2065, !2066, !2067}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !943, file: !474, line: 1342, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !483, line: 143, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !483, line: 67, size: 640, align: 64, elements: !950)
!950 = !{!951, !952, !956, !960, !961, !962, !963, !967, !973, !975, !979}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !949, file: !483, line: 72, baseType: !929, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !949, file: !483, line: 78, baseType: !953, size: 64, align: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!929, !917}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !949, file: !483, line: 85, baseType: !957, size: 64, align: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !483, line: 85, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !949, file: !483, line: 93, baseType: !918, size: 32, align: 32, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !949, file: !483, line: 99, baseType: !918, size: 32, align: 32, offset: 224)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !949, file: !483, line: 108, baseType: !918, size: 32, align: 32, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !949, file: !483, line: 113, baseType: !964, size: 64, align: 64, offset: 320)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!917, !917, !917}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !949, file: !483, line: 123, baseType: !968, size: 64, align: 64, offset: 384)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!971, !971}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !949, file: !483, line: 130, baseType: !974, size: 32, align: 32, offset: 448)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !483, line: 48, baseType: !482)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !949, file: !483, line: 136, baseType: !976, size: 64, align: 64, offset: 512)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!974, !917}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !949, file: !483, line: 142, baseType: !980, size: 64, align: 64, offset: 576)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!918, !983, !917, !929, !918}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !483, line: 60, flags: DIFlagFwdDecl)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !943, file: !474, line: 1349, baseType: !987, size: 64, align: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !474, line: 633, size: 1344, align: 64, elements: !989)
!989 = !{!990, !991, !992, !993, !994, !1000, !1001, !1002, !1003, !1004, !1005, !1019, !1024, !1068, !1069, !1073, !1078, !1079, !1080, !1084, !1090, !1096}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !988, file: !474, line: 638, baseType: !929, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !988, file: !474, line: 645, baseType: !929, size: 64, align: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !988, file: !474, line: 652, baseType: !918, size: 32, align: 32, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !988, file: !474, line: 659, baseType: !929, size: 64, align: 64, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !988, file: !474, line: 661, baseType: !995, size: 64, align: 64, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!999 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !474, line: 443, flags: DIFlagFwdDecl)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !988, file: !474, line: 663, baseType: !946, size: 64, align: 64, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !988, file: !474, line: 670, baseType: !929, size: 64, align: 64, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !988, file: !474, line: 679, baseType: !987, size: 64, align: 64, offset: 448)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !988, file: !474, line: 684, baseType: !918, size: 32, align: 32, offset: 512)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !988, file: !474, line: 689, baseType: !918, size: 32, align: 32, offset: 544)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !988, file: !474, line: 696, baseType: !1006, size: 64, align: 64, offset: 576)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!918, !1009}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !474, line: 453, baseType: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !474, line: 448, size: 256, align: 64, elements: !1012)
!1012 = !{!1013, !1014, !1017, !1018}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1011, file: !474, line: 449, baseType: !929, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1011, file: !474, line: 450, baseType: !1015, size: 64, align: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1011, file: !474, line: 451, baseType: !918, size: 32, align: 32, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1011, file: !474, line: 452, baseType: !929, size: 64, align: 64, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !988, file: !474, line: 703, baseType: !1020, size: 64, align: 64, offset: 640)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!918, !1023}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !988, file: !474, line: 714, baseType: !1025, size: 64, align: 64, offset: 704)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!918, !1023, !1028}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1031)
!1031 = !{!1032, !1047, !1051, !1052, !1053, !1054, !1055, !1056, !1064, !1065, !1066, !1067}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1030, file: !14, line: 1451, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1035, line: 94, baseType: !1036)
!1035 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1035, line: 81, size: 192, align: 64, elements: !1037)
!1037 = !{!1038, !1042, !1046}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1036, file: !1035, line: 82, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1035, line: 73, baseType: !1041)
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1035, line: 73, flags: DIFlagFwdDecl)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1036, file: !1035, line: 89, baseType: !1043, size: 64, align: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1045, line: 48, baseType: !1016)
!1045 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1036, file: !1035, line: 93, baseType: !918, size: 32, align: 32, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1030, file: !14, line: 1461, baseType: !1048, size: 64, align: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1049, line: 197, baseType: !1050)
!1049 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1050 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1030, file: !14, line: 1467, baseType: !1048, size: 64, align: 64, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1030, file: !14, line: 1468, baseType: !1043, size: 64, align: 64, offset: 192)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1030, file: !14, line: 1469, baseType: !918, size: 32, align: 32, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1030, file: !14, line: 1470, baseType: !918, size: 32, align: 32, offset: 288)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1030, file: !14, line: 1474, baseType: !918, size: 32, align: 32, offset: 320)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1030, file: !14, line: 1479, baseType: !1057, size: 64, align: 64, offset: 384)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1060)
!1060 = !{!1061, !1062, !1063}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1059, file: !14, line: 1412, baseType: !1043, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1059, file: !14, line: 1413, baseType: !918, size: 32, align: 32, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1059, file: !14, line: 1414, baseType: !503, size: 32, align: 32, offset: 96)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1030, file: !14, line: 1480, baseType: !918, size: 32, align: 32, offset: 448)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1030, file: !14, line: 1486, baseType: !1048, size: 64, align: 64, offset: 512)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1030, file: !14, line: 1488, baseType: !1048, size: 64, align: 64, offset: 576)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1030, file: !14, line: 1497, baseType: !1048, size: 64, align: 64, offset: 640)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !988, file: !474, line: 720, baseType: !1020, size: 64, align: 64, offset: 768)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !988, file: !474, line: 730, baseType: !1070, size: 64, align: 64, offset: 832)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!918, !1023, !918, !1048, !918}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !988, file: !474, line: 737, baseType: !1074, size: 64, align: 64, offset: 896)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!1048, !1023, !918, !1077, !1048}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !988, file: !474, line: 744, baseType: !1020, size: 64, align: 64, offset: 960)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !988, file: !474, line: 750, baseType: !1020, size: 64, align: 64, offset: 1024)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !988, file: !474, line: 758, baseType: !1081, size: 64, align: 64, offset: 1088)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!918, !1023, !918, !1048, !1048, !1048, !918}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !988, file: !474, line: 764, baseType: !1085, size: 64, align: 64, offset: 1152)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!918, !1023, !1088}
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !474, line: 328, flags: DIFlagFwdDecl)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !988, file: !474, line: 770, baseType: !1091, size: 64, align: 64, offset: 1216)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!918, !1023, !1094}
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !474, line: 329, flags: DIFlagFwdDecl)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !988, file: !474, line: 776, baseType: !1091, size: 64, align: 64, offset: 1280)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !943, file: !474, line: 1356, baseType: !1098, size: 64, align: 64, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !474, line: 497, size: 1600, align: 64, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1120, !1124, !1128, !1135, !1230, !1231, !1232, !1233, !1234, !1235, !1239}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1099, file: !474, line: 498, baseType: !929, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1099, file: !474, line: 504, baseType: !929, size: 64, align: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1099, file: !474, line: 505, baseType: !929, size: 64, align: 64, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1099, file: !474, line: 506, baseType: !929, size: 64, align: 64, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1099, file: !474, line: 508, baseType: !13, size: 32, align: 32, offset: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1099, file: !474, line: 509, baseType: !13, size: 32, align: 32, offset: 288)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1099, file: !474, line: 510, baseType: !13, size: 32, align: 32, offset: 320)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1099, file: !474, line: 517, baseType: !918, size: 32, align: 32, offset: 352)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1099, file: !474, line: 523, baseType: !995, size: 64, align: 64, offset: 384)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1099, file: !474, line: 526, baseType: !946, size: 64, align: 64, offset: 448)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1099, file: !474, line: 535, baseType: !1098, size: 64, align: 64, offset: 512)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1099, file: !474, line: 539, baseType: !918, size: 32, align: 32, offset: 576)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1099, file: !474, line: 541, baseType: !1020, size: 64, align: 64, offset: 640)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1099, file: !474, line: 549, baseType: !1025, size: 64, align: 64, offset: 704)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1099, file: !474, line: 550, baseType: !1020, size: 64, align: 64, offset: 768)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1099, file: !474, line: 554, baseType: !1117, size: 64, align: 64, offset: 832)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!918, !1023, !1028, !1028, !918}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1099, file: !474, line: 563, baseType: !1121, size: 64, align: 64, offset: 896)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!918, !13, !918}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1099, file: !474, line: 565, baseType: !1125, size: 64, align: 64, offset: 960)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{null, !1023, !918, !1077, !1077}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1099, file: !474, line: 570, baseType: !1129, size: 64, align: 64, offset: 1024)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!918, !1023, !918, !917, !1132}
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1133, line: 216, baseType: !1134)
!1133 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1134 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1099, file: !474, line: 581, baseType: !1136, size: 64, align: 64, offset: 1088)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!918, !1023, !918, !1139, !919}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !544, line: 646, baseType: !1142)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !544, line: 268, size: 4288, align: 64, elements: !1143)
!1143 = !{!1144, !1148, !1150, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1184, !1186, !1187, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1142, file: !544, line: 282, baseType: !1145, size: 512, align: 64)
!1145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1043, size: 512, align: 64, elements: !1146)
!1146 = !{!1147}
!1147 = !DISubrange(count: 8)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1142, file: !544, line: 299, baseType: !1149, size: 256, align: 32, offset: 512)
!1149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 256, align: 32, elements: !1146)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1142, file: !544, line: 315, baseType: !1151, size: 64, align: 64, offset: 768)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1142, file: !544, line: 326, baseType: !918, size: 32, align: 32, offset: 832)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1142, file: !544, line: 326, baseType: !918, size: 32, align: 32, offset: 864)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1142, file: !544, line: 334, baseType: !918, size: 32, align: 32, offset: 896)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1142, file: !544, line: 341, baseType: !918, size: 32, align: 32, offset: 928)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1142, file: !544, line: 346, baseType: !918, size: 32, align: 32, offset: 960)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1142, file: !544, line: 351, baseType: !533, size: 32, align: 32, offset: 992)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1142, file: !544, line: 356, baseType: !1159, size: 64, align: 32, offset: 1024)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1160, line: 61, baseType: !1161)
!1160 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1160, line: 58, size: 64, align: 32, elements: !1162)
!1162 = !{!1163, !1164}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1161, file: !1160, line: 59, baseType: !918, size: 32, align: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1161, file: !1160, line: 60, baseType: !918, size: 32, align: 32, offset: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1142, file: !544, line: 361, baseType: !1048, size: 64, align: 64, offset: 1088)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1142, file: !544, line: 369, baseType: !1048, size: 64, align: 64, offset: 1152)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1142, file: !544, line: 377, baseType: !1048, size: 64, align: 64, offset: 1216)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1142, file: !544, line: 382, baseType: !918, size: 32, align: 32, offset: 1280)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1142, file: !544, line: 386, baseType: !918, size: 32, align: 32, offset: 1312)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1142, file: !544, line: 391, baseType: !918, size: 32, align: 32, offset: 1344)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1142, file: !544, line: 396, baseType: !917, size: 64, align: 64, offset: 1408)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1142, file: !544, line: 403, baseType: !1173, size: 512, align: 64, offset: 1472)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1174, size: 512, align: 64, elements: !1146)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1045, line: 55, baseType: !1134)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1142, file: !544, line: 410, baseType: !918, size: 32, align: 32, offset: 1984)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1142, file: !544, line: 415, baseType: !918, size: 32, align: 32, offset: 2016)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1142, file: !544, line: 420, baseType: !918, size: 32, align: 32, offset: 2048)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1142, file: !544, line: 425, baseType: !918, size: 32, align: 32, offset: 2080)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1142, file: !544, line: 435, baseType: !1048, size: 64, align: 64, offset: 2112)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1142, file: !544, line: 440, baseType: !918, size: 32, align: 32, offset: 2176)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1142, file: !544, line: 445, baseType: !1174, size: 64, align: 64, offset: 2240)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1142, file: !544, line: 459, baseType: !1183, size: 512, align: 64, offset: 2304)
!1183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 512, align: 64, elements: !1146)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1142, file: !544, line: 473, baseType: !1185, size: 64, align: 64, offset: 2816)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1142, file: !544, line: 477, baseType: !918, size: 32, align: 32, offset: 2880)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1142, file: !544, line: 479, baseType: !1188, size: 64, align: 64, offset: 2944)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !544, line: 207, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !544, line: 201, size: 320, align: 64, elements: !1192)
!1192 = !{!1193, !1194, !1195, !1196, !1201}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1191, file: !544, line: 202, baseType: !543, size: 32, align: 32)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1191, file: !544, line: 203, baseType: !1043, size: 64, align: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1191, file: !544, line: 204, baseType: !918, size: 32, align: 32, offset: 128)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1191, file: !544, line: 205, baseType: !1197, size: 64, align: 64, offset: 192)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1199, line: 86, baseType: !1200)
!1199 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1200 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1199, line: 86, flags: DIFlagFwdDecl)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1191, file: !544, line: 206, baseType: !1033, size: 64, align: 64, offset: 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1142, file: !544, line: 480, baseType: !918, size: 32, align: 32, offset: 3008)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1142, file: !544, line: 505, baseType: !918, size: 32, align: 32, offset: 3040)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1142, file: !544, line: 512, baseType: !567, size: 32, align: 32, offset: 3072)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1142, file: !544, line: 514, baseType: !574, size: 32, align: 32, offset: 3104)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1142, file: !544, line: 516, baseType: !592, size: 32, align: 32, offset: 3136)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1142, file: !544, line: 523, baseType: !616, size: 32, align: 32, offset: 3168)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1142, file: !544, line: 525, baseType: !635, size: 32, align: 32, offset: 3200)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1142, file: !544, line: 532, baseType: !1048, size: 64, align: 64, offset: 3264)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1142, file: !544, line: 539, baseType: !1048, size: 64, align: 64, offset: 3328)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1142, file: !544, line: 547, baseType: !1048, size: 64, align: 64, offset: 3392)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1142, file: !544, line: 554, baseType: !1197, size: 64, align: 64, offset: 3456)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1142, file: !544, line: 563, baseType: !918, size: 32, align: 32, offset: 3520)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1142, file: !544, line: 572, baseType: !918, size: 32, align: 32, offset: 3552)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1142, file: !544, line: 581, baseType: !918, size: 32, align: 32, offset: 3584)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1142, file: !544, line: 588, baseType: !1217, size: 64, align: 64, offset: 3648)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1049, line: 194, baseType: !1219)
!1219 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1142, file: !544, line: 593, baseType: !918, size: 32, align: 32, offset: 3712)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1142, file: !544, line: 596, baseType: !918, size: 32, align: 32, offset: 3744)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1142, file: !544, line: 599, baseType: !1033, size: 64, align: 64, offset: 3776)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1142, file: !544, line: 605, baseType: !1033, size: 64, align: 64, offset: 3840)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1142, file: !544, line: 616, baseType: !1033, size: 64, align: 64, offset: 3904)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1142, file: !544, line: 626, baseType: !1132, size: 64, align: 64, offset: 3968)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1142, file: !544, line: 627, baseType: !1132, size: 64, align: 64, offset: 4032)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1142, file: !544, line: 628, baseType: !1132, size: 64, align: 64, offset: 4096)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1142, file: !544, line: 629, baseType: !1132, size: 64, align: 64, offset: 4160)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1142, file: !544, line: 645, baseType: !1033, size: 64, align: 64, offset: 4224)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1099, file: !474, line: 587, baseType: !1085, size: 64, align: 64, offset: 1152)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1099, file: !474, line: 592, baseType: !1091, size: 64, align: 64, offset: 1216)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1099, file: !474, line: 597, baseType: !1091, size: 64, align: 64, offset: 1280)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1099, file: !474, line: 598, baseType: !13, size: 32, align: 32, offset: 1344)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1099, file: !474, line: 608, baseType: !1020, size: 64, align: 64, offset: 1408)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1099, file: !474, line: 617, baseType: !1236, size: 64, align: 64, offset: 1472)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{null, !1023}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1099, file: !474, line: 623, baseType: !1240, size: 64, align: 64, offset: 1536)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!918, !1023, !1243}
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !943, file: !474, line: 1365, baseType: !917, size: 64, align: 64, offset: 192)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !943, file: !474, line: 1379, baseType: !1247, size: 64, align: 64, offset: 256)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !646, line: 352, baseType: !1249)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !646, line: 161, size: 2112, align: 64, elements: !1250)
!1250 = !{!1251, !1252, !1253, !1254, !1255, !1256, !1257, !1261, !1262, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1278, !1279, !1283, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1301, !1302, !1303, !1304, !1308, !1309, !1310}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1249, file: !646, line: 174, baseType: !946, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1249, file: !646, line: 226, baseType: !1015, size: 64, align: 64, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1249, file: !646, line: 227, baseType: !918, size: 32, align: 32, offset: 128)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1249, file: !646, line: 228, baseType: !1015, size: 64, align: 64, offset: 192)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1249, file: !646, line: 229, baseType: !1015, size: 64, align: 64, offset: 256)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1249, file: !646, line: 233, baseType: !917, size: 64, align: 64, offset: 320)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1249, file: !646, line: 235, baseType: !1258, size: 64, align: 64, offset: 384)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!918, !917, !1043, !918}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1249, file: !646, line: 236, baseType: !1258, size: 64, align: 64, offset: 448)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1249, file: !646, line: 237, baseType: !1263, size: 64, align: 64, offset: 512)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!1048, !917, !1048, !918}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1249, file: !646, line: 238, baseType: !1048, size: 64, align: 64, offset: 576)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1249, file: !646, line: 239, baseType: !918, size: 32, align: 32, offset: 640)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1249, file: !646, line: 240, baseType: !918, size: 32, align: 32, offset: 672)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1249, file: !646, line: 241, baseType: !918, size: 32, align: 32, offset: 704)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1249, file: !646, line: 242, baseType: !1134, size: 64, align: 64, offset: 768)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1249, file: !646, line: 243, baseType: !1015, size: 64, align: 64, offset: 832)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1249, file: !646, line: 244, baseType: !1273, size: 64, align: 64, offset: 896)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!1134, !1134, !1276, !919}
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1044)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1249, file: !646, line: 245, baseType: !918, size: 32, align: 32, offset: 960)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1249, file: !646, line: 249, baseType: !1280, size: 64, align: 64, offset: 1024)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!918, !917, !918}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1249, file: !646, line: 255, baseType: !1284, size: 64, align: 64, offset: 1088)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!1048, !917, !918, !1048, !918}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1249, file: !646, line: 260, baseType: !918, size: 32, align: 32, offset: 1152)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1249, file: !646, line: 266, baseType: !1048, size: 64, align: 64, offset: 1216)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1249, file: !646, line: 273, baseType: !918, size: 32, align: 32, offset: 1280)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1249, file: !646, line: 279, baseType: !1048, size: 64, align: 64, offset: 1344)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1249, file: !646, line: 285, baseType: !918, size: 32, align: 32, offset: 1408)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1249, file: !646, line: 291, baseType: !918, size: 32, align: 32, offset: 1440)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1249, file: !646, line: 298, baseType: !918, size: 32, align: 32, offset: 1472)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1249, file: !646, line: 304, baseType: !918, size: 32, align: 32, offset: 1504)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1249, file: !646, line: 309, baseType: !929, size: 64, align: 64, offset: 1536)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1249, file: !646, line: 314, baseType: !929, size: 64, align: 64, offset: 1600)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1249, file: !646, line: 319, baseType: !1298, size: 64, align: 64, offset: 1664)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!918, !917, !1043, !918, !645, !1048}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1249, file: !646, line: 326, baseType: !918, size: 32, align: 32, offset: 1728)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1249, file: !646, line: 331, baseType: !645, size: 32, align: 32, offset: 1760)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1249, file: !646, line: 332, baseType: !1048, size: 64, align: 64, offset: 1792)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1249, file: !646, line: 338, baseType: !1305, size: 64, align: 64, offset: 1856)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DISubroutineType(types: !1307)
!1307 = !{!918, !917}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1249, file: !646, line: 340, baseType: !1048, size: 64, align: 64, offset: 1920)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1249, file: !646, line: 346, baseType: !1015, size: 64, align: 64, offset: 1984)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1249, file: !646, line: 351, baseType: !918, size: 32, align: 32, offset: 2048)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !943, file: !474, line: 1386, baseType: !918, size: 32, align: 32, offset: 320)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !943, file: !474, line: 1393, baseType: !919, size: 32, align: 32, offset: 352)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !943, file: !474, line: 1405, baseType: !1314, size: 64, align: 64, offset: 384)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !474, line: 1223, baseType: !1317)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !474, line: 865, size: 6144, align: 64, elements: !1318)
!1318 = !{!1319, !1320, !1321, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1792, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1893, !1899, !1900, !1904, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1936, !1937, !1938, !1939, !1940, !1941}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1317, file: !474, line: 866, baseType: !918, size: 32, align: 32)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1317, file: !474, line: 872, baseType: !918, size: 32, align: 32, offset: 32)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1317, file: !474, line: 878, baseType: !1322, size: 64, align: 64, offset: 64)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1324)
!1324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1325)
!1325 = !{!1326, !1327, !1328, !1329, !1467, !1468, !1469, !1470, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1496, !1500, !1501, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1680, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1324, file: !14, line: 1561, baseType: !946, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1324, file: !14, line: 1562, baseType: !918, size: 32, align: 32, offset: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1324, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1324, file: !14, line: 1565, baseType: !1330, size: 64, align: 64, offset: 128)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1332)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1333)
!1333 = !{!1334, !1335, !1336, !1337, !1338, !1339, !1342, !1345, !1348, !1351, !1354, !1355, !1356, !1364, !1365, !1366, !1368, !1372, !1378, !1383, !1387, !1388, !1432, !1439, !1443, !1444, !1448, !1452, !1456, !1460, !1461, !1462}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1332, file: !14, line: 3475, baseType: !929, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1332, file: !14, line: 3480, baseType: !929, size: 64, align: 64, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1332, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1332, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1332, file: !14, line: 3487, baseType: !918, size: 32, align: 32, offset: 192)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1332, file: !14, line: 3488, baseType: !1340, size: 64, align: 64, offset: 256)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1159)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1332, file: !14, line: 3489, baseType: !1343, size: 64, align: 64, offset: 320)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1332, file: !14, line: 3490, baseType: !1346, size: 64, align: 64, offset: 384)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1332, file: !14, line: 3491, baseType: !1349, size: 64, align: 64, offset: 448)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !853)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1332, file: !14, line: 3492, baseType: !1352, size: 64, align: 64, offset: 512)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1174)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1332, file: !14, line: 3493, baseType: !1044, size: 8, align: 8, offset: 576)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1332, file: !14, line: 3494, baseType: !946, size: 64, align: 64, offset: 640)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1332, file: !14, line: 3495, baseType: !1357, size: 64, align: 64, offset: 704)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1359)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1360)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1361)
!1361 = !{!1362, !1363}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1360, file: !14, line: 3402, baseType: !918, size: 32, align: 32)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1360, file: !14, line: 3403, baseType: !929, size: 64, align: 64, offset: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1332, file: !14, line: 3507, baseType: !929, size: 64, align: 64, offset: 768)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1332, file: !14, line: 3516, baseType: !918, size: 32, align: 32, offset: 832)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1332, file: !14, line: 3517, baseType: !1367, size: 64, align: 64, offset: 896)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1332, file: !14, line: 3527, baseType: !1369, size: 64, align: 64, offset: 960)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DISubroutineType(types: !1371)
!1371 = !{!918, !1322}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1332, file: !14, line: 3535, baseType: !1373, size: 64, align: 64, offset: 1024)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DISubroutineType(types: !1375)
!1375 = !{!918, !1322, !1376}
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1323)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1332, file: !14, line: 3541, baseType: !1379, size: 64, align: 64, offset: 1088)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1381)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1382)
!1382 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1332, file: !14, line: 3549, baseType: !1384, size: 64, align: 64, offset: 1152)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DISubroutineType(types: !1386)
!1386 = !{null, !1367}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1332, file: !14, line: 3551, baseType: !1369, size: 64, align: 64, offset: 1216)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1332, file: !14, line: 3552, baseType: !1389, size: 64, align: 64, offset: 1280)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DISubroutineType(types: !1391)
!1391 = !{!918, !1322, !1043, !918, !1392}
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1394)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1395)
!1395 = !{!1396, !1399, !1401, !1402, !1403, !1431}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1394, file: !14, line: 3921, baseType: !1397, size: 16, align: 16)
!1397 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1045, line: 49, baseType: !1398)
!1398 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1394, file: !14, line: 3922, baseType: !1400, size: 32, align: 32, offset: 32)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1045, line: 51, baseType: !919)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1394, file: !14, line: 3923, baseType: !1400, size: 32, align: 32, offset: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1394, file: !14, line: 3924, baseType: !919, size: 32, align: 32, offset: 96)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1394, file: !14, line: 3925, baseType: !1404, size: 64, align: 64, offset: 128)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1407)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1408)
!1408 = !{!1409, !1410, !1411, !1412, !1413, !1414, !1420, !1424, !1426, !1427, !1429, !1430}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1407, file: !14, line: 3886, baseType: !918, size: 32, align: 32)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1407, file: !14, line: 3887, baseType: !918, size: 32, align: 32, offset: 32)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1407, file: !14, line: 3888, baseType: !918, size: 32, align: 32, offset: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1407, file: !14, line: 3889, baseType: !918, size: 32, align: 32, offset: 96)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1407, file: !14, line: 3890, baseType: !918, size: 32, align: 32, offset: 128)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1407, file: !14, line: 3897, baseType: !1415, size: 768, align: 64, offset: 192)
!1415 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1416)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1417)
!1417 = !{!1418, !1419}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1416, file: !14, line: 3855, baseType: !1145, size: 512, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1416, file: !14, line: 3857, baseType: !1149, size: 256, align: 32, offset: 512)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1407, file: !14, line: 3903, baseType: !1421, size: 256, align: 64, offset: 960)
!1421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1043, size: 256, align: 64, elements: !1422)
!1422 = !{!1423}
!1423 = !DISubrange(count: 4)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1407, file: !14, line: 3904, baseType: !1425, size: 128, align: 32, offset: 1216)
!1425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 128, align: 32, elements: !1422)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1407, file: !14, line: 3906, baseType: !870, size: 32, align: 32, offset: 1344)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1407, file: !14, line: 3908, baseType: !1428, size: 64, align: 64, offset: 1408)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1407, file: !14, line: 3915, baseType: !1428, size: 64, align: 64, offset: 1472)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1407, file: !14, line: 3917, baseType: !918, size: 32, align: 32, offset: 1536)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1394, file: !14, line: 3926, baseType: !1048, size: 64, align: 64, offset: 192)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1332, file: !14, line: 3564, baseType: !1433, size: 64, align: 64, offset: 1344)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DISubroutineType(types: !1435)
!1435 = !{!918, !1322, !1028, !1436, !1438}
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1141)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1332, file: !14, line: 3566, baseType: !1440, size: 64, align: 64, offset: 1408)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{!918, !1322, !917, !1438, !1028}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1332, file: !14, line: 3567, baseType: !1369, size: 64, align: 64, offset: 1472)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1332, file: !14, line: 3576, baseType: !1445, size: 64, align: 64, offset: 1536)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DISubroutineType(types: !1447)
!1447 = !{!918, !1322, !1436}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1332, file: !14, line: 3577, baseType: !1449, size: 64, align: 64, offset: 1600)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DISubroutineType(types: !1451)
!1451 = !{!918, !1322, !1028}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1332, file: !14, line: 3584, baseType: !1453, size: 64, align: 64, offset: 1664)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{!918, !1322, !1140}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1332, file: !14, line: 3589, baseType: !1457, size: 64, align: 64, offset: 1728)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{null, !1322}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1332, file: !14, line: 3594, baseType: !918, size: 32, align: 32, offset: 1792)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1332, file: !14, line: 3600, baseType: !929, size: 64, align: 64, offset: 1856)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1332, file: !14, line: 3609, baseType: !1463, size: 64, align: 64, offset: 1920)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1466)
!1466 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1324, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1324, file: !14, line: 1581, baseType: !919, size: 32, align: 32, offset: 224)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1324, file: !14, line: 1583, baseType: !917, size: 64, align: 64, offset: 256)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1324, file: !14, line: 1591, baseType: !1471, size: 64, align: 64, offset: 320)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1324, file: !14, line: 1598, baseType: !917, size: 64, align: 64, offset: 384)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1324, file: !14, line: 1606, baseType: !1048, size: 64, align: 64, offset: 448)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1324, file: !14, line: 1614, baseType: !918, size: 32, align: 32, offset: 512)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1324, file: !14, line: 1622, baseType: !918, size: 32, align: 32, offset: 544)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1324, file: !14, line: 1628, baseType: !918, size: 32, align: 32, offset: 576)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1324, file: !14, line: 1636, baseType: !918, size: 32, align: 32, offset: 608)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1324, file: !14, line: 1643, baseType: !918, size: 32, align: 32, offset: 640)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1324, file: !14, line: 1657, baseType: !1043, size: 64, align: 64, offset: 704)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1324, file: !14, line: 1658, baseType: !918, size: 32, align: 32, offset: 768)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1324, file: !14, line: 1679, baseType: !1159, size: 64, align: 32, offset: 800)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1324, file: !14, line: 1688, baseType: !918, size: 32, align: 32, offset: 864)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1324, file: !14, line: 1712, baseType: !918, size: 32, align: 32, offset: 896)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1324, file: !14, line: 1729, baseType: !918, size: 32, align: 32, offset: 928)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1324, file: !14, line: 1729, baseType: !918, size: 32, align: 32, offset: 960)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1324, file: !14, line: 1744, baseType: !918, size: 32, align: 32, offset: 992)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1324, file: !14, line: 1744, baseType: !918, size: 32, align: 32, offset: 1024)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1324, file: !14, line: 1751, baseType: !918, size: 32, align: 32, offset: 1056)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1324, file: !14, line: 1766, baseType: !654, size: 32, align: 32, offset: 1088)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1324, file: !14, line: 1791, baseType: !1492, size: 64, align: 64, offset: 1152)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{null, !1495, !1436, !1438, !918, !918, !918}
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1324, file: !14, line: 1808, baseType: !1497, size: 64, align: 64, offset: 1216)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!654, !1495, !1343}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1324, file: !14, line: 1816, baseType: !918, size: 32, align: 32, offset: 1280)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1324, file: !14, line: 1825, baseType: !1502, size: 32, align: 32, offset: 1312)
!1502 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1324, file: !14, line: 1830, baseType: !918, size: 32, align: 32, offset: 1344)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1324, file: !14, line: 1838, baseType: !1502, size: 32, align: 32, offset: 1376)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1324, file: !14, line: 1846, baseType: !918, size: 32, align: 32, offset: 1408)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1324, file: !14, line: 1851, baseType: !918, size: 32, align: 32, offset: 1440)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1324, file: !14, line: 1861, baseType: !1502, size: 32, align: 32, offset: 1472)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1324, file: !14, line: 1868, baseType: !1502, size: 32, align: 32, offset: 1504)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1324, file: !14, line: 1875, baseType: !1502, size: 32, align: 32, offset: 1536)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1324, file: !14, line: 1882, baseType: !1502, size: 32, align: 32, offset: 1568)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1324, file: !14, line: 1889, baseType: !1502, size: 32, align: 32, offset: 1600)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1324, file: !14, line: 1896, baseType: !1502, size: 32, align: 32, offset: 1632)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1324, file: !14, line: 1903, baseType: !1502, size: 32, align: 32, offset: 1664)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1324, file: !14, line: 1910, baseType: !918, size: 32, align: 32, offset: 1696)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1324, file: !14, line: 1915, baseType: !918, size: 32, align: 32, offset: 1728)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1324, file: !14, line: 1926, baseType: !1438, size: 64, align: 64, offset: 1792)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1324, file: !14, line: 1935, baseType: !1159, size: 64, align: 32, offset: 1856)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1324, file: !14, line: 1942, baseType: !918, size: 32, align: 32, offset: 1920)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1324, file: !14, line: 1948, baseType: !918, size: 32, align: 32, offset: 1952)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1324, file: !14, line: 1954, baseType: !918, size: 32, align: 32, offset: 1984)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1324, file: !14, line: 1960, baseType: !918, size: 32, align: 32, offset: 2016)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1324, file: !14, line: 1984, baseType: !918, size: 32, align: 32, offset: 2048)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1324, file: !14, line: 1991, baseType: !918, size: 32, align: 32, offset: 2080)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1324, file: !14, line: 1996, baseType: !918, size: 32, align: 32, offset: 2112)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1324, file: !14, line: 2004, baseType: !918, size: 32, align: 32, offset: 2144)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1324, file: !14, line: 2011, baseType: !918, size: 32, align: 32, offset: 2176)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1324, file: !14, line: 2018, baseType: !918, size: 32, align: 32, offset: 2208)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1324, file: !14, line: 2027, baseType: !918, size: 32, align: 32, offset: 2240)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1324, file: !14, line: 2034, baseType: !918, size: 32, align: 32, offset: 2272)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1324, file: !14, line: 2044, baseType: !918, size: 32, align: 32, offset: 2304)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1324, file: !14, line: 2054, baseType: !1532, size: 64, align: 64, offset: 2368)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1324, file: !14, line: 2061, baseType: !1532, size: 64, align: 64, offset: 2432)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1324, file: !14, line: 2066, baseType: !918, size: 32, align: 32, offset: 2496)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1324, file: !14, line: 2070, baseType: !918, size: 32, align: 32, offset: 2528)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1324, file: !14, line: 2078, baseType: !918, size: 32, align: 32, offset: 2560)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1324, file: !14, line: 2085, baseType: !918, size: 32, align: 32, offset: 2592)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1324, file: !14, line: 2092, baseType: !918, size: 32, align: 32, offset: 2624)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1324, file: !14, line: 2099, baseType: !918, size: 32, align: 32, offset: 2656)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1324, file: !14, line: 2106, baseType: !918, size: 32, align: 32, offset: 2688)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1324, file: !14, line: 2113, baseType: !918, size: 32, align: 32, offset: 2720)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1324, file: !14, line: 2120, baseType: !918, size: 32, align: 32, offset: 2752)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1324, file: !14, line: 2125, baseType: !918, size: 32, align: 32, offset: 2784)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1324, file: !14, line: 2133, baseType: !918, size: 32, align: 32, offset: 2816)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1324, file: !14, line: 2140, baseType: !918, size: 32, align: 32, offset: 2848)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1324, file: !14, line: 2145, baseType: !918, size: 32, align: 32, offset: 2880)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1324, file: !14, line: 2153, baseType: !918, size: 32, align: 32, offset: 2912)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1324, file: !14, line: 2158, baseType: !918, size: 32, align: 32, offset: 2944)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1324, file: !14, line: 2166, baseType: !574, size: 32, align: 32, offset: 2976)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1324, file: !14, line: 2173, baseType: !592, size: 32, align: 32, offset: 3008)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1324, file: !14, line: 2180, baseType: !616, size: 32, align: 32, offset: 3040)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1324, file: !14, line: 2187, baseType: !567, size: 32, align: 32, offset: 3072)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1324, file: !14, line: 2194, baseType: !635, size: 32, align: 32, offset: 3104)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1324, file: !14, line: 2203, baseType: !918, size: 32, align: 32, offset: 3136)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1324, file: !14, line: 2209, baseType: !876, size: 32, align: 32, offset: 3168)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1324, file: !14, line: 2212, baseType: !918, size: 32, align: 32, offset: 3200)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1324, file: !14, line: 2213, baseType: !918, size: 32, align: 32, offset: 3232)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1324, file: !14, line: 2220, baseType: !853, size: 32, align: 32, offset: 3264)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1324, file: !14, line: 2232, baseType: !918, size: 32, align: 32, offset: 3296)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1324, file: !14, line: 2243, baseType: !918, size: 32, align: 32, offset: 3328)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1324, file: !14, line: 2249, baseType: !918, size: 32, align: 32, offset: 3360)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1324, file: !14, line: 2256, baseType: !918, size: 32, align: 32, offset: 3392)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1324, file: !14, line: 2263, baseType: !1174, size: 64, align: 64, offset: 3456)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1324, file: !14, line: 2270, baseType: !1174, size: 64, align: 64, offset: 3520)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1324, file: !14, line: 2277, baseType: !884, size: 32, align: 32, offset: 3584)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1324, file: !14, line: 2285, baseType: !853, size: 32, align: 32, offset: 3616)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1324, file: !14, line: 2367, baseType: !1568, size: 64, align: 64, offset: 3648)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DISubroutineType(types: !1570)
!1570 = !{!918, !1495, !1140, !918}
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1324, file: !14, line: 2383, baseType: !918, size: 32, align: 32, offset: 3712)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1324, file: !14, line: 2386, baseType: !1502, size: 32, align: 32, offset: 3744)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1324, file: !14, line: 2387, baseType: !1502, size: 32, align: 32, offset: 3776)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1324, file: !14, line: 2394, baseType: !918, size: 32, align: 32, offset: 3808)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1324, file: !14, line: 2401, baseType: !918, size: 32, align: 32, offset: 3840)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1324, file: !14, line: 2408, baseType: !918, size: 32, align: 32, offset: 3872)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1324, file: !14, line: 2415, baseType: !918, size: 32, align: 32, offset: 3904)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1324, file: !14, line: 2422, baseType: !918, size: 32, align: 32, offset: 3936)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1324, file: !14, line: 2423, baseType: !1580, size: 64, align: 64, offset: 3968)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1582)
!1582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1583)
!1583 = !{!1584, !1585, !1586, !1587}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1582, file: !14, line: 827, baseType: !918, size: 32, align: 32)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1582, file: !14, line: 828, baseType: !918, size: 32, align: 32, offset: 32)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1582, file: !14, line: 829, baseType: !918, size: 32, align: 32, offset: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1582, file: !14, line: 830, baseType: !1502, size: 32, align: 32, offset: 96)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1324, file: !14, line: 2430, baseType: !1048, size: 64, align: 64, offset: 4032)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1324, file: !14, line: 2437, baseType: !1048, size: 64, align: 64, offset: 4096)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1324, file: !14, line: 2444, baseType: !1502, size: 32, align: 32, offset: 4160)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1324, file: !14, line: 2451, baseType: !1502, size: 32, align: 32, offset: 4192)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1324, file: !14, line: 2458, baseType: !918, size: 32, align: 32, offset: 4224)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1324, file: !14, line: 2469, baseType: !918, size: 32, align: 32, offset: 4256)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1324, file: !14, line: 2475, baseType: !918, size: 32, align: 32, offset: 4288)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1324, file: !14, line: 2481, baseType: !918, size: 32, align: 32, offset: 4320)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1324, file: !14, line: 2485, baseType: !918, size: 32, align: 32, offset: 4352)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1324, file: !14, line: 2489, baseType: !918, size: 32, align: 32, offset: 4384)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1324, file: !14, line: 2493, baseType: !918, size: 32, align: 32, offset: 4416)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1324, file: !14, line: 2501, baseType: !918, size: 32, align: 32, offset: 4448)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1324, file: !14, line: 2506, baseType: !918, size: 32, align: 32, offset: 4480)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1324, file: !14, line: 2510, baseType: !918, size: 32, align: 32, offset: 4512)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1324, file: !14, line: 2514, baseType: !1048, size: 64, align: 64, offset: 4544)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1324, file: !14, line: 2528, baseType: !1604, size: 64, align: 64, offset: 4608)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DISubroutineType(types: !1606)
!1606 = !{null, !1495, !917, !918, !918}
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1324, file: !14, line: 2534, baseType: !918, size: 32, align: 32, offset: 4672)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1324, file: !14, line: 2545, baseType: !918, size: 32, align: 32, offset: 4704)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1324, file: !14, line: 2547, baseType: !918, size: 32, align: 32, offset: 4736)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1324, file: !14, line: 2549, baseType: !918, size: 32, align: 32, offset: 4768)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1324, file: !14, line: 2551, baseType: !918, size: 32, align: 32, offset: 4800)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1324, file: !14, line: 2553, baseType: !918, size: 32, align: 32, offset: 4832)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1324, file: !14, line: 2555, baseType: !918, size: 32, align: 32, offset: 4864)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1324, file: !14, line: 2557, baseType: !918, size: 32, align: 32, offset: 4896)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1324, file: !14, line: 2559, baseType: !918, size: 32, align: 32, offset: 4928)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1324, file: !14, line: 2563, baseType: !918, size: 32, align: 32, offset: 4960)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1324, file: !14, line: 2571, baseType: !1428, size: 64, align: 64, offset: 4992)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1324, file: !14, line: 2579, baseType: !1428, size: 64, align: 64, offset: 5056)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1324, file: !14, line: 2586, baseType: !918, size: 32, align: 32, offset: 5120)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1324, file: !14, line: 2615, baseType: !918, size: 32, align: 32, offset: 5152)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1324, file: !14, line: 2627, baseType: !918, size: 32, align: 32, offset: 5184)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1324, file: !14, line: 2637, baseType: !918, size: 32, align: 32, offset: 5216)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1324, file: !14, line: 2681, baseType: !918, size: 32, align: 32, offset: 5248)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1324, file: !14, line: 2709, baseType: !1048, size: 64, align: 64, offset: 5312)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1324, file: !14, line: 2716, baseType: !1626, size: 64, align: 64, offset: 5376)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1628)
!1628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1629)
!1629 = !{!1630, !1631, !1632, !1633, !1634, !1635, !1636, !1640, !1644, !1645, !1646, !1647, !1653, !1654, !1655, !1656, !1657}
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1628, file: !14, line: 3642, baseType: !929, size: 64, align: 64)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1628, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1628, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1628, file: !14, line: 3663, baseType: !654, size: 32, align: 32, offset: 128)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1628, file: !14, line: 3669, baseType: !918, size: 32, align: 32, offset: 160)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1628, file: !14, line: 3682, baseType: !1453, size: 64, align: 64, offset: 192)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1628, file: !14, line: 3698, baseType: !1637, size: 64, align: 64, offset: 256)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DISubroutineType(types: !1639)
!1639 = !{!918, !1322, !1276, !1400}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1628, file: !14, line: 3712, baseType: !1641, size: 64, align: 64, offset: 320)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{!918, !1322, !918, !1276, !1400}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1628, file: !14, line: 3726, baseType: !1637, size: 64, align: 64, offset: 384)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1628, file: !14, line: 3737, baseType: !1369, size: 64, align: 64, offset: 448)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1628, file: !14, line: 3746, baseType: !918, size: 32, align: 32, offset: 512)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1628, file: !14, line: 3757, baseType: !1648, size: 64, align: 64, offset: 576)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{null, !1651}
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1628, file: !14, line: 3766, baseType: !1369, size: 64, align: 64, offset: 640)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1628, file: !14, line: 3774, baseType: !1369, size: 64, align: 64, offset: 704)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1628, file: !14, line: 3780, baseType: !918, size: 32, align: 32, offset: 768)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1628, file: !14, line: 3785, baseType: !918, size: 32, align: 32, offset: 800)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1628, file: !14, line: 3795, baseType: !1658, size: 64, align: 64, offset: 832)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{!918, !1322, !1033}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1324, file: !14, line: 2728, baseType: !917, size: 64, align: 64, offset: 5440)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1324, file: !14, line: 2735, baseType: !1173, size: 512, align: 64, offset: 5504)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1324, file: !14, line: 2742, baseType: !918, size: 32, align: 32, offset: 6016)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1324, file: !14, line: 2755, baseType: !918, size: 32, align: 32, offset: 6048)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1324, file: !14, line: 2776, baseType: !918, size: 32, align: 32, offset: 6080)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1324, file: !14, line: 2783, baseType: !918, size: 32, align: 32, offset: 6112)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1324, file: !14, line: 2791, baseType: !918, size: 32, align: 32, offset: 6144)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1324, file: !14, line: 2802, baseType: !1140, size: 64, align: 64, offset: 6208)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1324, file: !14, line: 2811, baseType: !918, size: 32, align: 32, offset: 6272)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1324, file: !14, line: 2821, baseType: !918, size: 32, align: 32, offset: 6304)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1324, file: !14, line: 2830, baseType: !918, size: 32, align: 32, offset: 6336)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1324, file: !14, line: 2840, baseType: !918, size: 32, align: 32, offset: 6368)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1324, file: !14, line: 2851, baseType: !1674, size: 64, align: 64, offset: 6400)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DISubroutineType(types: !1676)
!1676 = !{!918, !1495, !1677, !917, !1438, !918, !918}
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DISubroutineType(types: !1679)
!1679 = !{!918, !1495, !917}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1324, file: !14, line: 2871, baseType: !1681, size: 64, align: 64, offset: 6464)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{!918, !1495, !1684, !917, !1438, !918}
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{!918, !1495, !917, !918, !918}
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1324, file: !14, line: 2878, baseType: !918, size: 32, align: 32, offset: 6528)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1324, file: !14, line: 2885, baseType: !918, size: 32, align: 32, offset: 6560)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1324, file: !14, line: 3005, baseType: !918, size: 32, align: 32, offset: 6592)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1324, file: !14, line: 3013, baseType: !896, size: 32, align: 32, offset: 6624)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1324, file: !14, line: 3020, baseType: !896, size: 32, align: 32, offset: 6656)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1324, file: !14, line: 3027, baseType: !896, size: 32, align: 32, offset: 6688)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1324, file: !14, line: 3037, baseType: !1043, size: 64, align: 64, offset: 6720)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1324, file: !14, line: 3038, baseType: !918, size: 32, align: 32, offset: 6784)
