; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--webm_chunk.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--webm_chunk.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!868 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!869 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!870 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!871 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!872 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!873 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!874 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!875 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!876 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!877 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!878 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!879 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !556, line: 538, size: 32, align: 32, elements: !880)
!880 = !{!881, !882, !883, !884, !885, !886, !887, !888}
!881 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!882 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!883 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!884 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!885 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!886 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!887 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!888 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !{!939, !940, !941}
!939 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!940 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !946)
!946 = !{!947, !951, !956, !986, !987, !988, !989, !993, !999, !1001, !1005}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !945, file: !486, line: 72, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !945, file: !486, line: 78, baseType: !952, size: 64, align: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!948, !955}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !945, file: !486, line: 85, baseType: !957, size: 64, align: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !960)
!960 = !{!961, !962, !963, !964, !965, !982, !983, !984, !985}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !959, file: !464, line: 247, baseType: !948, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !959, file: !464, line: 253, baseType: !948, size: 64, align: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !959, file: !464, line: 259, baseType: !939, size: 32, align: 32, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !959, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !959, file: !464, line: 271, baseType: !966, size: 64, align: 64, offset: 192)
!966 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !959, file: !464, line: 265, size: 64, align: 64, elements: !967)
!967 = !{!968, !972, !974, !975}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !966, file: !464, line: 266, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !970, line: 40, baseType: !971)
!970 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!971 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !966, file: !464, line: 267, baseType: !973, size: 64, align: 64)
!973 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !966, file: !464, line: 268, baseType: !948, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !966, file: !464, line: 270, baseType: !976, size: 64, align: 32)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !977, line: 61, baseType: !978)
!977 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !977, line: 58, size: 64, align: 32, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !978, file: !977, line: 59, baseType: !939, size: 32, align: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !978, file: !977, line: 60, baseType: !939, size: 32, align: 32, offset: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !959, file: !464, line: 272, baseType: !973, size: 64, align: 64, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !959, file: !464, line: 273, baseType: !973, size: 64, align: 64, offset: 320)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !959, file: !464, line: 275, baseType: !939, size: 32, align: 32, offset: 384)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !959, file: !464, line: 300, baseType: !948, size: 64, align: 64, offset: 448)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !945, file: !486, line: 93, baseType: !939, size: 32, align: 32, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !945, file: !486, line: 99, baseType: !939, size: 32, align: 32, offset: 224)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !945, file: !486, line: 108, baseType: !939, size: 32, align: 32, offset: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !945, file: !486, line: 113, baseType: !990, size: 64, align: 64, offset: 320)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!955, !955, !955}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !945, file: !486, line: 123, baseType: !994, size: 64, align: 64, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!997, !997}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !945, file: !486, line: 130, baseType: !1000, size: 32, align: 32, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !945, file: !486, line: 136, baseType: !1002, size: 64, align: 64, offset: 512)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!1000, !955}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !945, file: !486, line: 142, baseType: !1006, size: 64, align: 64, offset: 576)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!939, !1009, !955, !948, !939}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1012)
!1012 = !{!1013, !1025, !1026}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1011, file: !464, line: 360, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1023, !1024}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1017, file: !464, line: 307, baseType: !948, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1017, file: !464, line: 313, baseType: !973, size: 64, align: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1017, file: !464, line: 313, baseType: !973, size: 64, align: 64, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1017, file: !464, line: 318, baseType: !973, size: 64, align: 64, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1017, file: !464, line: 318, baseType: !973, size: 64, align: 64, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1017, file: !464, line: 323, baseType: !939, size: 32, align: 32, offset: 320)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1011, file: !464, line: 364, baseType: !939, size: 32, align: 32, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1011, file: !464, line: 368, baseType: !939, size: 32, align: 32, offset: 96)
!1027 = !{!1028, !2191, !2192}
!1028 = distinct !DIGlobalVariable(name: "ff_webm_chunk_muxer", scope: !0, file: !1029, line: 273, type: !1030, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_webm_chunk_muxer)
!1029 = !DIFile(filename: "libavformat/webm_chunk.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1051, !1052, !1054, !1055, !2156, !2157, !2158, !2162, !2166, !2170, !2171, !2176, !2177, !2178, !2179, !2180, !2181, !2185}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1031, file: !919, line: 498, baseType: !948, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1031, file: !919, line: 504, baseType: !948, size: 64, align: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1031, file: !919, line: 505, baseType: !948, size: 64, align: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1031, file: !919, line: 506, baseType: !948, size: 64, align: 64, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1031, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1031, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1031, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1031, file: !919, line: 517, baseType: !939, size: 32, align: 32, offset: 352)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1031, file: !919, line: 523, baseType: !1042, size: 64, align: 64, offset: 384)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1044)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1047, line: 44, size: 64, align: 32, elements: !1048)
!1047 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1048 = !{!1049, !1050}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1046, file: !1047, line: 45, baseType: !3, size: 32, align: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1046, file: !1047, line: 46, baseType: !940, size: 32, align: 32, offset: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1031, file: !919, line: 526, baseType: !942, size: 64, align: 64, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1031, file: !919, line: 535, baseType: !1053, size: 64, align: 64, offset: 512)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1031, file: !919, line: 539, baseType: !939, size: 32, align: 32, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1031, file: !919, line: 541, baseType: !1056, size: 64, align: 64, offset: 640)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!939, !1059}
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1061)
!1061 = !{!1062, !1063, !1161, !1162, !1163, !1229, !1230, !1231, !2010, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2064, !2065, !2066, !2067, !2068, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2119, !2120, !2123, !2124, !2125, !2126, !2127, !2128, !2133, !2134, !2135, !2136, !2144, !2145, !2149, !2153, !2154, !2155}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1060, file: !919, line: 1342, baseType: !942, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1060, file: !919, line: 1349, baseType: !1064, size: 64, align: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1091, !1092, !1132, !1133, !1137, !1142, !1143, !1144, !1148, !1154, !1160}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1065, file: !919, line: 638, baseType: !948, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1065, file: !919, line: 645, baseType: !948, size: 64, align: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1065, file: !919, line: 652, baseType: !939, size: 32, align: 32, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1065, file: !919, line: 659, baseType: !948, size: 64, align: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1065, file: !919, line: 661, baseType: !1042, size: 64, align: 64, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1065, file: !919, line: 663, baseType: !942, size: 64, align: 64, offset: 320)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1065, file: !919, line: 670, baseType: !948, size: 64, align: 64, offset: 384)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1065, file: !919, line: 679, baseType: !1064, size: 64, align: 64, offset: 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1065, file: !919, line: 684, baseType: !939, size: 32, align: 32, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1065, file: !919, line: 689, baseType: !939, size: 32, align: 32, offset: 544)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1065, file: !919, line: 696, baseType: !1078, size: 64, align: 64, offset: 576)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!939, !1081}
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1084)
!1084 = !{!1085, !1086, !1089, !1090}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1083, file: !919, line: 449, baseType: !948, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1083, file: !919, line: 450, baseType: !1087, size: 64, align: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1083, file: !919, line: 451, baseType: !939, size: 32, align: 32, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1083, file: !919, line: 452, baseType: !948, size: 64, align: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1065, file: !919, line: 703, baseType: !1056, size: 64, align: 64, offset: 640)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1065, file: !919, line: 714, baseType: !1093, size: 64, align: 64, offset: 704)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!939, !1059, !1096}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1099)
!1099 = !{!1100, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1128, !1129, !1130, !1131}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1098, file: !4, line: 1451, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1103, line: 94, baseType: !1104)
!1103 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1103, line: 81, size: 192, align: 64, elements: !1105)
!1105 = !{!1106, !1110, !1113}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1104, file: !1103, line: 82, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1103, line: 73, baseType: !1109)
!1109 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1103, line: 73, flags: DIFlagFwdDecl)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1104, file: !1103, line: 89, baseType: !1111, size: 64, align: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !970, line: 48, baseType: !1088)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1104, file: !1103, line: 93, baseType: !939, size: 32, align: 32, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1098, file: !4, line: 1461, baseType: !969, size: 64, align: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1098, file: !4, line: 1467, baseType: !969, size: 64, align: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1098, file: !4, line: 1468, baseType: !1111, size: 64, align: 64, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1098, file: !4, line: 1469, baseType: !939, size: 32, align: 32, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1098, file: !4, line: 1470, baseType: !939, size: 32, align: 32, offset: 288)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1098, file: !4, line: 1474, baseType: !939, size: 32, align: 32, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1098, file: !4, line: 1479, baseType: !1121, size: 64, align: 64, offset: 384)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1124)
!1124 = !{!1125, !1126, !1127}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1123, file: !4, line: 1412, baseType: !1111, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1123, file: !4, line: 1413, baseType: !939, size: 32, align: 32, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1123, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1098, file: !4, line: 1480, baseType: !939, size: 32, align: 32, offset: 448)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1098, file: !4, line: 1486, baseType: !969, size: 64, align: 64, offset: 512)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1098, file: !4, line: 1488, baseType: !969, size: 64, align: 64, offset: 576)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1098, file: !4, line: 1497, baseType: !969, size: 64, align: 64, offset: 640)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1065, file: !919, line: 720, baseType: !1056, size: 64, align: 64, offset: 768)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1065, file: !919, line: 730, baseType: !1134, size: 64, align: 64, offset: 832)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!939, !1059, !939, !969, !939}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1065, file: !919, line: 737, baseType: !1138, size: 64, align: 64, offset: 896)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!969, !1059, !939, !1141, !969}
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1065, file: !919, line: 744, baseType: !1056, size: 64, align: 64, offset: 960)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1065, file: !919, line: 750, baseType: !1056, size: 64, align: 64, offset: 1024)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1065, file: !919, line: 758, baseType: !1145, size: 64, align: 64, offset: 1088)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!939, !1059, !939, !969, !969, !969, !939}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1065, file: !919, line: 764, baseType: !1149, size: 64, align: 64, offset: 1152)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!939, !1059, !1152}
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1065, file: !919, line: 770, baseType: !1155, size: 64, align: 64, offset: 1216)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!939, !1059, !1158}
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1065, file: !919, line: 776, baseType: !1155, size: 64, align: 64, offset: 1280)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1060, file: !919, line: 1356, baseType: !1053, size: 64, align: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1060, file: !919, line: 1365, baseType: !955, size: 64, align: 64, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1060, file: !919, line: 1379, baseType: !1164, size: 64, align: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1167)
!1167 = !{!1168, !1169, !1170, !1171, !1172, !1173, !1174, !1178, !1179, !1183, !1184, !1185, !1186, !1187, !1189, !1190, !1196, !1197, !1201, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1219, !1220, !1221, !1222, !1226, !1227, !1228}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1166, file: !537, line: 174, baseType: !942, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1166, file: !537, line: 226, baseType: !1087, size: 64, align: 64, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1166, file: !537, line: 227, baseType: !939, size: 32, align: 32, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1166, file: !537, line: 228, baseType: !1087, size: 64, align: 64, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1166, file: !537, line: 229, baseType: !1087, size: 64, align: 64, offset: 256)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1166, file: !537, line: 233, baseType: !955, size: 64, align: 64, offset: 320)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1166, file: !537, line: 235, baseType: !1175, size: 64, align: 64, offset: 384)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!939, !955, !1111, !939}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1166, file: !537, line: 236, baseType: !1175, size: 64, align: 64, offset: 448)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1166, file: !537, line: 237, baseType: !1180, size: 64, align: 64, offset: 512)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!969, !955, !969, !939}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1166, file: !537, line: 238, baseType: !969, size: 64, align: 64, offset: 576)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1166, file: !537, line: 239, baseType: !939, size: 32, align: 32, offset: 640)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1166, file: !537, line: 240, baseType: !939, size: 32, align: 32, offset: 672)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1166, file: !537, line: 241, baseType: !939, size: 32, align: 32, offset: 704)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1166, file: !537, line: 242, baseType: !1188, size: 64, align: 64, offset: 768)
!1188 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1166, file: !537, line: 243, baseType: !1087, size: 64, align: 64, offset: 832)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1166, file: !537, line: 244, baseType: !1191, size: 64, align: 64, offset: 896)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!1188, !1188, !1194, !940}
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1112)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1166, file: !537, line: 245, baseType: !939, size: 32, align: 32, offset: 960)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1166, file: !537, line: 249, baseType: !1198, size: 64, align: 64, offset: 1024)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!939, !955, !939}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1166, file: !537, line: 255, baseType: !1202, size: 64, align: 64, offset: 1088)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!969, !955, !939, !969, !939}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1166, file: !537, line: 260, baseType: !939, size: 32, align: 32, offset: 1152)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1166, file: !537, line: 266, baseType: !969, size: 64, align: 64, offset: 1216)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1166, file: !537, line: 273, baseType: !939, size: 32, align: 32, offset: 1280)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1166, file: !537, line: 279, baseType: !969, size: 64, align: 64, offset: 1344)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1166, file: !537, line: 285, baseType: !939, size: 32, align: 32, offset: 1408)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1166, file: !537, line: 291, baseType: !939, size: 32, align: 32, offset: 1440)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1166, file: !537, line: 298, baseType: !939, size: 32, align: 32, offset: 1472)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1166, file: !537, line: 304, baseType: !939, size: 32, align: 32, offset: 1504)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1166, file: !537, line: 309, baseType: !948, size: 64, align: 64, offset: 1536)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1166, file: !537, line: 314, baseType: !948, size: 64, align: 64, offset: 1600)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1166, file: !537, line: 319, baseType: !1216, size: 64, align: 64, offset: 1664)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!939, !955, !1111, !939, !536, !969}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1166, file: !537, line: 326, baseType: !939, size: 32, align: 32, offset: 1728)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1166, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1166, file: !537, line: 332, baseType: !969, size: 64, align: 64, offset: 1792)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1166, file: !537, line: 338, baseType: !1223, size: 64, align: 64, offset: 1856)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!939, !955}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1166, file: !537, line: 340, baseType: !969, size: 64, align: 64, offset: 1920)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1166, file: !537, line: 346, baseType: !1087, size: 64, align: 64, offset: 1984)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1166, file: !537, line: 351, baseType: !939, size: 32, align: 32, offset: 2048)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1060, file: !919, line: 1386, baseType: !939, size: 32, align: 32, offset: 320)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1060, file: !919, line: 1393, baseType: !940, size: 32, align: 32, offset: 352)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1060, file: !919, line: 1405, baseType: !1232, size: 64, align: 64, offset: 384)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1236)
!1236 = !{!1237, !1238, !1239, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1796, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1896, !1902, !1903, !1907, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1939, !1940, !1941, !1942, !1943, !1944}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1235, file: !919, line: 866, baseType: !939, size: 32, align: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1235, file: !919, line: 872, baseType: !939, size: 32, align: 32, offset: 32)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1235, file: !919, line: 878, baseType: !1240, size: 64, align: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1243)
!1243 = !{!1244, !1245, !1246, !1247, !1471, !1472, !1473, !1474, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1500, !1504, !1505, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1684, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1242, file: !4, line: 1561, baseType: !942, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1242, file: !4, line: 1562, baseType: !939, size: 32, align: 32, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1242, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1242, file: !4, line: 1565, baseType: !1248, size: 64, align: 64, offset: 128)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1250)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1251)
!1251 = !{!1252, !1253, !1254, !1255, !1256, !1257, !1260, !1263, !1266, !1269, !1273, !1274, !1275, !1283, !1284, !1285, !1287, !1291, !1297, !1302, !1306, !1307, !1355, !1442, !1446, !1447, !1451, !1455, !1460, !1464, !1465, !1466}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1250, file: !4, line: 3475, baseType: !948, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1250, file: !4, line: 3480, baseType: !948, size: 64, align: 64, offset: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1250, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1250, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1250, file: !4, line: 3487, baseType: !939, size: 32, align: 32, offset: 192)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1250, file: !4, line: 3488, baseType: !1258, size: 64, align: 64, offset: 256)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1250, file: !4, line: 3489, baseType: !1261, size: 64, align: 64, offset: 320)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1250, file: !4, line: 3490, baseType: !1264, size: 64, align: 64, offset: 384)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1250, file: !4, line: 3491, baseType: !1267, size: 64, align: 64, offset: 448)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1250, file: !4, line: 3492, baseType: !1270, size: 64, align: 64, offset: 512)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1272)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !970, line: 55, baseType: !1188)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1250, file: !4, line: 3493, baseType: !1112, size: 8, align: 8, offset: 576)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1250, file: !4, line: 3494, baseType: !942, size: 64, align: 64, offset: 640)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1250, file: !4, line: 3495, baseType: !1276, size: 64, align: 64, offset: 704)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1278)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1279)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1280)
!1280 = !{!1281, !1282}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1279, file: !4, line: 3402, baseType: !939, size: 32, align: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1279, file: !4, line: 3403, baseType: !948, size: 64, align: 64, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1250, file: !4, line: 3507, baseType: !948, size: 64, align: 64, offset: 768)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1250, file: !4, line: 3516, baseType: !939, size: 32, align: 32, offset: 832)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1250, file: !4, line: 3517, baseType: !1286, size: 64, align: 64, offset: 896)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1250, file: !4, line: 3527, baseType: !1288, size: 64, align: 64, offset: 960)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!939, !1240}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1250, file: !4, line: 3535, baseType: !1292, size: 64, align: 64, offset: 1024)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{!939, !1240, !1295}
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1241)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1250, file: !4, line: 3541, baseType: !1298, size: 64, align: 64, offset: 1088)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1300)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1301)
!1301 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1250, file: !4, line: 3549, baseType: !1303, size: 64, align: 64, offset: 1152)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{null, !1286}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1250, file: !4, line: 3551, baseType: !1288, size: 64, align: 64, offset: 1216)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1250, file: !4, line: 3552, baseType: !1308, size: 64, align: 64, offset: 1280)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!939, !1240, !1111, !939, !1311}
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1313)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1314)
!1314 = !{!1315, !1318, !1320, !1321, !1322, !1354}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1313, file: !4, line: 3921, baseType: !1316, size: 16, align: 16)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !970, line: 49, baseType: !1317)
!1317 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1313, file: !4, line: 3922, baseType: !1319, size: 32, align: 32, offset: 32)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !970, line: 51, baseType: !940)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1313, file: !4, line: 3923, baseType: !1319, size: 32, align: 32, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1313, file: !4, line: 3924, baseType: !940, size: 32, align: 32, offset: 96)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1313, file: !4, line: 3925, baseType: !1323, size: 64, align: 64, offset: 128)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1326)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1327)
!1327 = !{!1328, !1329, !1330, !1331, !1332, !1333, !1343, !1347, !1349, !1350, !1352, !1353}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1326, file: !4, line: 3886, baseType: !939, size: 32, align: 32)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1326, file: !4, line: 3887, baseType: !939, size: 32, align: 32, offset: 32)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1326, file: !4, line: 3888, baseType: !939, size: 32, align: 32, offset: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1326, file: !4, line: 3889, baseType: !939, size: 32, align: 32, offset: 96)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1326, file: !4, line: 3890, baseType: !939, size: 32, align: 32, offset: 128)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1326, file: !4, line: 3897, baseType: !1334, size: 768, align: 64, offset: 192)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1335)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1336)
!1336 = !{!1337, !1341}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1335, file: !4, line: 3855, baseType: !1338, size: 512, align: 64)
!1338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1111, size: 512, align: 64, elements: !1339)
!1339 = !{!1340}
!1340 = !DISubrange(count: 8)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1335, file: !4, line: 3857, baseType: !1342, size: 256, align: 32, offset: 512)
!1342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 256, align: 32, elements: !1339)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1326, file: !4, line: 3903, baseType: !1344, size: 256, align: 64, offset: 960)
!1344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1111, size: 256, align: 64, elements: !1345)
!1345 = !{!1346}
!1346 = !DISubrange(count: 4)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1326, file: !4, line: 3904, baseType: !1348, size: 128, align: 32, offset: 1216)
!1348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 128, align: 32, elements: !1345)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1326, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1326, file: !4, line: 3908, baseType: !1351, size: 64, align: 64, offset: 1408)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1326, file: !4, line: 3915, baseType: !1351, size: 64, align: 64, offset: 1472)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1326, file: !4, line: 3917, baseType: !939, size: 32, align: 32, offset: 1536)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1313, file: !4, line: 3926, baseType: !969, size: 64, align: 64, offset: 192)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1250, file: !4, line: 3564, baseType: !1356, size: 64, align: 64, offset: 1344)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!939, !1240, !1096, !1359, !1441}
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1361)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1363)
!1363 = !{!1364, !1365, !1366, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1393, !1395, !1396, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1429, !1430, !1431, !1432, !1433, !1434, !1437, !1438, !1439, !1440}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1362, file: !789, line: 282, baseType: !1338, size: 512, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1362, file: !789, line: 299, baseType: !1342, size: 256, align: 32, offset: 512)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1362, file: !789, line: 315, baseType: !1367, size: 64, align: 64, offset: 768)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1362, file: !789, line: 326, baseType: !939, size: 32, align: 32, offset: 832)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1362, file: !789, line: 326, baseType: !939, size: 32, align: 32, offset: 864)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1362, file: !789, line: 334, baseType: !939, size: 32, align: 32, offset: 896)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1362, file: !789, line: 341, baseType: !939, size: 32, align: 32, offset: 928)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1362, file: !789, line: 346, baseType: !939, size: 32, align: 32, offset: 960)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1362, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1362, file: !789, line: 356, baseType: !976, size: 64, align: 32, offset: 1024)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1362, file: !789, line: 361, baseType: !969, size: 64, align: 64, offset: 1088)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1362, file: !789, line: 369, baseType: !969, size: 64, align: 64, offset: 1152)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1362, file: !789, line: 377, baseType: !969, size: 64, align: 64, offset: 1216)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1362, file: !789, line: 382, baseType: !939, size: 32, align: 32, offset: 1280)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1362, file: !789, line: 386, baseType: !939, size: 32, align: 32, offset: 1312)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1362, file: !789, line: 391, baseType: !939, size: 32, align: 32, offset: 1344)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1362, file: !789, line: 396, baseType: !955, size: 64, align: 64, offset: 1408)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1362, file: !789, line: 403, baseType: !1383, size: 512, align: 64, offset: 1472)
!1383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1272, size: 512, align: 64, elements: !1339)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1362, file: !789, line: 410, baseType: !939, size: 32, align: 32, offset: 1984)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1362, file: !789, line: 415, baseType: !939, size: 32, align: 32, offset: 2016)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1362, file: !789, line: 420, baseType: !939, size: 32, align: 32, offset: 2048)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1362, file: !789, line: 425, baseType: !939, size: 32, align: 32, offset: 2080)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1362, file: !789, line: 435, baseType: !969, size: 64, align: 64, offset: 2112)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1362, file: !789, line: 440, baseType: !939, size: 32, align: 32, offset: 2176)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1362, file: !789, line: 445, baseType: !1272, size: 64, align: 64, offset: 2240)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1362, file: !789, line: 459, baseType: !1392, size: 512, align: 64, offset: 2304)
!1392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 512, align: 64, elements: !1339)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1362, file: !789, line: 473, baseType: !1394, size: 64, align: 64, offset: 2816)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1362, file: !789, line: 477, baseType: !939, size: 32, align: 32, offset: 2880)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1362, file: !789, line: 479, baseType: !1397, size: 64, align: 64, offset: 2944)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1401)
!1401 = !{!1402, !1403, !1404, !1405, !1410}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1400, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1400, file: !789, line: 203, baseType: !1111, size: 64, align: 64, offset: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1400, file: !789, line: 204, baseType: !939, size: 32, align: 32, offset: 128)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1400, file: !789, line: 205, baseType: !1406, size: 64, align: 64, offset: 192)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1408, line: 86, baseType: !1409)
!1408 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1409 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1408, line: 86, flags: DIFlagFwdDecl)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1400, file: !789, line: 206, baseType: !1101, size: 64, align: 64, offset: 256)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1362, file: !789, line: 480, baseType: !939, size: 32, align: 32, offset: 3008)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1362, file: !789, line: 505, baseType: !939, size: 32, align: 32, offset: 3040)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1362, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1362, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1362, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1362, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1362, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1362, file: !789, line: 532, baseType: !969, size: 64, align: 64, offset: 3264)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1362, file: !789, line: 539, baseType: !969, size: 64, align: 64, offset: 3328)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1362, file: !789, line: 547, baseType: !969, size: 64, align: 64, offset: 3392)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1362, file: !789, line: 554, baseType: !1406, size: 64, align: 64, offset: 3456)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1362, file: !789, line: 563, baseType: !939, size: 32, align: 32, offset: 3520)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1362, file: !789, line: 572, baseType: !939, size: 32, align: 32, offset: 3552)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1362, file: !789, line: 581, baseType: !939, size: 32, align: 32, offset: 3584)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1362, file: !789, line: 588, baseType: !1426, size: 64, align: 64, offset: 3648)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !970, line: 36, baseType: !1428)
!1428 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1362, file: !789, line: 593, baseType: !939, size: 32, align: 32, offset: 3712)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1362, file: !789, line: 596, baseType: !939, size: 32, align: 32, offset: 3744)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1362, file: !789, line: 599, baseType: !1101, size: 64, align: 64, offset: 3776)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1362, file: !789, line: 605, baseType: !1101, size: 64, align: 64, offset: 3840)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1362, file: !789, line: 616, baseType: !1101, size: 64, align: 64, offset: 3904)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1362, file: !789, line: 626, baseType: !1435, size: 64, align: 64, offset: 3968)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1436, line: 216, baseType: !1188)
!1436 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1362, file: !789, line: 627, baseType: !1435, size: 64, align: 64, offset: 4032)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1362, file: !789, line: 628, baseType: !1435, size: 64, align: 64, offset: 4096)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1362, file: !789, line: 629, baseType: !1435, size: 64, align: 64, offset: 4160)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1362, file: !789, line: 645, baseType: !1101, size: 64, align: 64, offset: 4224)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1250, file: !4, line: 3566, baseType: !1443, size: 64, align: 64, offset: 1408)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DISubroutineType(types: !1445)
!1445 = !{!939, !1240, !955, !1441, !1096}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1250, file: !4, line: 3567, baseType: !1288, size: 64, align: 64, offset: 1472)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1250, file: !4, line: 3576, baseType: !1448, size: 64, align: 64, offset: 1536)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!939, !1240, !1359}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1250, file: !4, line: 3577, baseType: !1452, size: 64, align: 64, offset: 1600)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{!939, !1240, !1096}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1250, file: !4, line: 3584, baseType: !1456, size: 64, align: 64, offset: 1664)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DISubroutineType(types: !1458)
!1458 = !{!939, !1240, !1459}
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1250, file: !4, line: 3589, baseType: !1461, size: 64, align: 64, offset: 1728)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{null, !1240}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1250, file: !4, line: 3594, baseType: !939, size: 32, align: 32, offset: 1792)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1250, file: !4, line: 3600, baseType: !948, size: 64, align: 64, offset: 1856)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1250, file: !4, line: 3609, baseType: !1467, size: 64, align: 64, offset: 1920)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1470)
!1470 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1242, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1242, file: !4, line: 1581, baseType: !940, size: 32, align: 32, offset: 224)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1242, file: !4, line: 1583, baseType: !955, size: 64, align: 64, offset: 256)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1242, file: !4, line: 1591, baseType: !1475, size: 64, align: 64, offset: 320)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1242, file: !4, line: 1598, baseType: !955, size: 64, align: 64, offset: 384)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1242, file: !4, line: 1606, baseType: !969, size: 64, align: 64, offset: 448)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1242, file: !4, line: 1614, baseType: !939, size: 32, align: 32, offset: 512)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1242, file: !4, line: 1622, baseType: !939, size: 32, align: 32, offset: 544)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1242, file: !4, line: 1628, baseType: !939, size: 32, align: 32, offset: 576)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1242, file: !4, line: 1636, baseType: !939, size: 32, align: 32, offset: 608)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1242, file: !4, line: 1643, baseType: !939, size: 32, align: 32, offset: 640)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1242, file: !4, line: 1657, baseType: !1111, size: 64, align: 64, offset: 704)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1242, file: !4, line: 1658, baseType: !939, size: 32, align: 32, offset: 768)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1242, file: !4, line: 1679, baseType: !976, size: 64, align: 32, offset: 800)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1242, file: !4, line: 1688, baseType: !939, size: 32, align: 32, offset: 864)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1242, file: !4, line: 1712, baseType: !939, size: 32, align: 32, offset: 896)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1242, file: !4, line: 1729, baseType: !939, size: 32, align: 32, offset: 928)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1242, file: !4, line: 1729, baseType: !939, size: 32, align: 32, offset: 960)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1242, file: !4, line: 1744, baseType: !939, size: 32, align: 32, offset: 992)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1242, file: !4, line: 1744, baseType: !939, size: 32, align: 32, offset: 1024)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1242, file: !4, line: 1751, baseType: !939, size: 32, align: 32, offset: 1056)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1242, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1242, file: !4, line: 1791, baseType: !1496, size: 64, align: 64, offset: 1152)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{null, !1499, !1359, !1441, !939, !939, !939}
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1242, file: !4, line: 1808, baseType: !1501, size: 64, align: 64, offset: 1216)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{!555, !1499, !1261}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1242, file: !4, line: 1816, baseType: !939, size: 32, align: 32, offset: 1280)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1242, file: !4, line: 1825, baseType: !1506, size: 32, align: 32, offset: 1312)
!1506 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1242, file: !4, line: 1830, baseType: !939, size: 32, align: 32, offset: 1344)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1242, file: !4, line: 1838, baseType: !1506, size: 32, align: 32, offset: 1376)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1242, file: !4, line: 1846, baseType: !939, size: 32, align: 32, offset: 1408)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1242, file: !4, line: 1851, baseType: !939, size: 32, align: 32, offset: 1440)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1242, file: !4, line: 1861, baseType: !1506, size: 32, align: 32, offset: 1472)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1242, file: !4, line: 1868, baseType: !1506, size: 32, align: 32, offset: 1504)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1242, file: !4, line: 1875, baseType: !1506, size: 32, align: 32, offset: 1536)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1242, file: !4, line: 1882, baseType: !1506, size: 32, align: 32, offset: 1568)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1242, file: !4, line: 1889, baseType: !1506, size: 32, align: 32, offset: 1600)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1242, file: !4, line: 1896, baseType: !1506, size: 32, align: 32, offset: 1632)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1242, file: !4, line: 1903, baseType: !1506, size: 32, align: 32, offset: 1664)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1242, file: !4, line: 1910, baseType: !939, size: 32, align: 32, offset: 1696)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1242, file: !4, line: 1915, baseType: !939, size: 32, align: 32, offset: 1728)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1242, file: !4, line: 1926, baseType: !1441, size: 64, align: 64, offset: 1792)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1242, file: !4, line: 1935, baseType: !976, size: 64, align: 32, offset: 1856)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1242, file: !4, line: 1942, baseType: !939, size: 32, align: 32, offset: 1920)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1242, file: !4, line: 1948, baseType: !939, size: 32, align: 32, offset: 1952)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1242, file: !4, line: 1954, baseType: !939, size: 32, align: 32, offset: 1984)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1242, file: !4, line: 1960, baseType: !939, size: 32, align: 32, offset: 2016)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1242, file: !4, line: 1984, baseType: !939, size: 32, align: 32, offset: 2048)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1242, file: !4, line: 1991, baseType: !939, size: 32, align: 32, offset: 2080)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1242, file: !4, line: 1996, baseType: !939, size: 32, align: 32, offset: 2112)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1242, file: !4, line: 2004, baseType: !939, size: 32, align: 32, offset: 2144)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1242, file: !4, line: 2011, baseType: !939, size: 32, align: 32, offset: 2176)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1242, file: !4, line: 2018, baseType: !939, size: 32, align: 32, offset: 2208)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1242, file: !4, line: 2027, baseType: !939, size: 32, align: 32, offset: 2240)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1242, file: !4, line: 2034, baseType: !939, size: 32, align: 32, offset: 2272)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1242, file: !4, line: 2044, baseType: !939, size: 32, align: 32, offset: 2304)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1242, file: !4, line: 2054, baseType: !1536, size: 64, align: 64, offset: 2368)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1242, file: !4, line: 2061, baseType: !1536, size: 64, align: 64, offset: 2432)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1242, file: !4, line: 2066, baseType: !939, size: 32, align: 32, offset: 2496)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1242, file: !4, line: 2070, baseType: !939, size: 32, align: 32, offset: 2528)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1242, file: !4, line: 2078, baseType: !939, size: 32, align: 32, offset: 2560)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1242, file: !4, line: 2085, baseType: !939, size: 32, align: 32, offset: 2592)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1242, file: !4, line: 2092, baseType: !939, size: 32, align: 32, offset: 2624)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1242, file: !4, line: 2099, baseType: !939, size: 32, align: 32, offset: 2656)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1242, file: !4, line: 2106, baseType: !939, size: 32, align: 32, offset: 2688)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1242, file: !4, line: 2113, baseType: !939, size: 32, align: 32, offset: 2720)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1242, file: !4, line: 2120, baseType: !939, size: 32, align: 32, offset: 2752)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1242, file: !4, line: 2125, baseType: !939, size: 32, align: 32, offset: 2784)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1242, file: !4, line: 2133, baseType: !939, size: 32, align: 32, offset: 2816)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1242, file: !4, line: 2140, baseType: !939, size: 32, align: 32, offset: 2848)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1242, file: !4, line: 2145, baseType: !939, size: 32, align: 32, offset: 2880)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1242, file: !4, line: 2153, baseType: !939, size: 32, align: 32, offset: 2912)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1242, file: !4, line: 2158, baseType: !939, size: 32, align: 32, offset: 2944)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1242, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1242, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1242, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1242, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1242, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1242, file: !4, line: 2203, baseType: !939, size: 32, align: 32, offset: 3136)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1242, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1242, file: !4, line: 2212, baseType: !939, size: 32, align: 32, offset: 3200)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1242, file: !4, line: 2213, baseType: !939, size: 32, align: 32, offset: 3232)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1242, file: !4, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1242, file: !4, line: 2232, baseType: !939, size: 32, align: 32, offset: 3296)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1242, file: !4, line: 2243, baseType: !939, size: 32, align: 32, offset: 3328)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1242, file: !4, line: 2249, baseType: !939, size: 32, align: 32, offset: 3360)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1242, file: !4, line: 2256, baseType: !939, size: 32, align: 32, offset: 3392)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1242, file: !4, line: 2263, baseType: !1272, size: 64, align: 64, offset: 3456)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1242, file: !4, line: 2270, baseType: !1272, size: 64, align: 64, offset: 3520)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1242, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1242, file: !4, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1242, file: !4, line: 2367, baseType: !1572, size: 64, align: 64, offset: 3648)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DISubroutineType(types: !1574)
!1574 = !{!939, !1499, !1459, !939}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1242, file: !4, line: 2383, baseType: !939, size: 32, align: 32, offset: 3712)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1242, file: !4, line: 2386, baseType: !1506, size: 32, align: 32, offset: 3744)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1242, file: !4, line: 2387, baseType: !1506, size: 32, align: 32, offset: 3776)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1242, file: !4, line: 2394, baseType: !939, size: 32, align: 32, offset: 3808)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1242, file: !4, line: 2401, baseType: !939, size: 32, align: 32, offset: 3840)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1242, file: !4, line: 2408, baseType: !939, size: 32, align: 32, offset: 3872)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1242, file: !4, line: 2415, baseType: !939, size: 32, align: 32, offset: 3904)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1242, file: !4, line: 2422, baseType: !939, size: 32, align: 32, offset: 3936)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1242, file: !4, line: 2423, baseType: !1584, size: 64, align: 64, offset: 3968)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1586)
!1586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1587)
!1587 = !{!1588, !1589, !1590, !1591}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1586, file: !4, line: 827, baseType: !939, size: 32, align: 32)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1586, file: !4, line: 828, baseType: !939, size: 32, align: 32, offset: 32)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1586, file: !4, line: 829, baseType: !939, size: 32, align: 32, offset: 64)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1586, file: !4, line: 830, baseType: !1506, size: 32, align: 32, offset: 96)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1242, file: !4, line: 2430, baseType: !969, size: 64, align: 64, offset: 4032)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1242, file: !4, line: 2437, baseType: !969, size: 64, align: 64, offset: 4096)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1242, file: !4, line: 2444, baseType: !1506, size: 32, align: 32, offset: 4160)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1242, file: !4, line: 2451, baseType: !1506, size: 32, align: 32, offset: 4192)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1242, file: !4, line: 2458, baseType: !939, size: 32, align: 32, offset: 4224)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1242, file: !4, line: 2469, baseType: !939, size: 32, align: 32, offset: 4256)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1242, file: !4, line: 2475, baseType: !939, size: 32, align: 32, offset: 4288)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1242, file: !4, line: 2481, baseType: !939, size: 32, align: 32, offset: 4320)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1242, file: !4, line: 2485, baseType: !939, size: 32, align: 32, offset: 4352)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1242, file: !4, line: 2489, baseType: !939, size: 32, align: 32, offset: 4384)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1242, file: !4, line: 2493, baseType: !939, size: 32, align: 32, offset: 4416)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1242, file: !4, line: 2501, baseType: !939, size: 32, align: 32, offset: 4448)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1242, file: !4, line: 2506, baseType: !939, size: 32, align: 32, offset: 4480)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1242, file: !4, line: 2510, baseType: !939, size: 32, align: 32, offset: 4512)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1242, file: !4, line: 2514, baseType: !969, size: 64, align: 64, offset: 4544)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1242, file: !4, line: 2528, baseType: !1608, size: 64, align: 64, offset: 4608)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DISubroutineType(types: !1610)
!1610 = !{null, !1499, !955, !939, !939}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1242, file: !4, line: 2534, baseType: !939, size: 32, align: 32, offset: 4672)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1242, file: !4, line: 2545, baseType: !939, size: 32, align: 32, offset: 4704)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1242, file: !4, line: 2547, baseType: !939, size: 32, align: 32, offset: 4736)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1242, file: !4, line: 2549, baseType: !939, size: 32, align: 32, offset: 4768)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1242, file: !4, line: 2551, baseType: !939, size: 32, align: 32, offset: 4800)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1242, file: !4, line: 2553, baseType: !939, size: 32, align: 32, offset: 4832)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1242, file: !4, line: 2555, baseType: !939, size: 32, align: 32, offset: 4864)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1242, file: !4, line: 2557, baseType: !939, size: 32, align: 32, offset: 4896)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1242, file: !4, line: 2559, baseType: !939, size: 32, align: 32, offset: 4928)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1242, file: !4, line: 2563, baseType: !939, size: 32, align: 32, offset: 4960)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1242, file: !4, line: 2571, baseType: !1351, size: 64, align: 64, offset: 4992)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1242, file: !4, line: 2579, baseType: !1351, size: 64, align: 64, offset: 5056)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1242, file: !4, line: 2586, baseType: !939, size: 32, align: 32, offset: 5120)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1242, file: !4, line: 2615, baseType: !939, size: 32, align: 32, offset: 5152)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1242, file: !4, line: 2627, baseType: !939, size: 32, align: 32, offset: 5184)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1242, file: !4, line: 2637, baseType: !939, size: 32, align: 32, offset: 5216)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1242, file: !4, line: 2681, baseType: !939, size: 32, align: 32, offset: 5248)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1242, file: !4, line: 2709, baseType: !969, size: 64, align: 64, offset: 5312)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1242, file: !4, line: 2716, baseType: !1630, size: 64, align: 64, offset: 5376)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1632)
!1632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1633)
!1633 = !{!1634, !1635, !1636, !1637, !1638, !1639, !1640, !1644, !1648, !1649, !1650, !1651, !1657, !1658, !1659, !1660, !1661}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1632, file: !4, line: 3642, baseType: !948, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1632, file: !4, line: 3649, baseType: !545, size: 32, align: 32, offset: 64)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1632, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1632, file: !4, line: 3663, baseType: !555, size: 32, align: 32, offset: 128)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1632, file: !4, line: 3669, baseType: !939, size: 32, align: 32, offset: 160)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1632, file: !4, line: 3682, baseType: !1456, size: 64, align: 64, offset: 192)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1632, file: !4, line: 3698, baseType: !1641, size: 64, align: 64, offset: 256)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{!939, !1240, !1194, !1319}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1632, file: !4, line: 3712, baseType: !1645, size: 64, align: 64, offset: 320)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{!939, !1240, !939, !1194, !1319}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1632, file: !4, line: 3726, baseType: !1641, size: 64, align: 64, offset: 384)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1632, file: !4, line: 3737, baseType: !1288, size: 64, align: 64, offset: 448)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1632, file: !4, line: 3746, baseType: !939, size: 32, align: 32, offset: 512)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1632, file: !4, line: 3757, baseType: !1652, size: 64, align: 64, offset: 576)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{null, !1655}
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1632, file: !4, line: 3766, baseType: !1288, size: 64, align: 64, offset: 640)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1632, file: !4, line: 3774, baseType: !1288, size: 64, align: 64, offset: 704)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1632, file: !4, line: 3780, baseType: !939, size: 32, align: 32, offset: 768)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1632, file: !4, line: 3785, baseType: !939, size: 32, align: 32, offset: 800)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1632, file: !4, line: 3795, baseType: !1662, size: 64, align: 64, offset: 832)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DISubroutineType(types: !1664)
!1664 = !{!939, !1240, !1101}
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1242, file: !4, line: 2728, baseType: !955, size: 64, align: 64, offset: 5440)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1242, file: !4, line: 2735, baseType: !1383, size: 512, align: 64, offset: 5504)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1242, file: !4, line: 2742, baseType: !939, size: 32, align: 32, offset: 6016)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1242, file: !4, line: 2755, baseType: !939, size: 32, align: 32, offset: 6048)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1242, file: !4, line: 2776, baseType: !939, size: 32, align: 32, offset: 6080)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1242, file: !4, line: 2783, baseType: !939, size: 32, align: 32, offset: 6112)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1242, file: !4, line: 2791, baseType: !939, size: 32, align: 32, offset: 6144)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1242, file: !4, line: 2802, baseType: !1459, size: 64, align: 64, offset: 6208)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1242, file: !4, line: 2811, baseType: !939, size: 32, align: 32, offset: 6272)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1242, file: !4, line: 2821, baseType: !939, size: 32, align: 32, offset: 6304)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1242, file: !4, line: 2830, baseType: !939, size: 32, align: 32, offset: 6336)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1242, file: !4, line: 2840, baseType: !939, size: 32, align: 32, offset: 6368)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1242, file: !4, line: 2851, baseType: !1678, size: 64, align: 64, offset: 6400)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DISubroutineType(types: !1680)
!1680 = !{!939, !1499, !1681, !955, !1441, !939, !939}
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{!939, !1499, !955}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1242, file: !4, line: 2871, baseType: !1685, size: 64, align: 64, offset: 6464)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DISubroutineType(types: !1687)
!1687 = !{!939, !1499, !1688, !955, !1441, !939}
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!939, !1499, !955, !939, !939}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1242, file: !4, line: 2878, baseType: !939, size: 32, align: 32, offset: 6528)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1242, file: !4, line: 2885, baseType: !939, size: 32, align: 32, offset: 6560)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1242, file: !4, line: 3005, baseType: !939, size: 32, align: 32, offset: 6592)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1242, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1242, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1242, file: !4, line: 3027, baseType: !909, size: 32, align: 32, offset: 6688)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1242, file: !4, line: 3037, baseType: !1111, size: 64, align: 64, offset: 6720)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1242, file: !4, line: 3038, baseType: !939, size: 32, align: 32, offset: 6784)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1242, file: !4, line: 3050, baseType: !1272, size: 64, align: 64, offset: 6848)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1242, file: !4, line: 3065, baseType: !939, size: 32, align: 32, offset: 6912)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1242, file: !4, line: 3083, baseType: !939, size: 32, align: 32, offset: 6944)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1242, file: !4, line: 3092, baseType: !976, size: 64, align: 32, offset: 6976)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1242, file: !4, line: 3099, baseType: !555, size: 32, align: 32, offset: 7040)
