; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--id3v2enc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--id3v2enc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CodecMime = type { [32 x i8], i32 }
%struct.AVMetadataConv = type { i8*, i8* }
%struct.AVRational = type { i32, i32 }
%struct.ID3v2EncContext = type { i32, i64, i32 }
%struct.AVIOContext = type { %struct.AVClass*, i8*, i32, i8*, i8*, i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i64, i32, i32, i32, i64, i8*, i64 (i64, i8*, i32)*, i32, i32 (i8*, i32)*, i64 (i8*, i32, i64, i32)*, i32, i64, i32, i64, i32, i32, i32, i32, i8*, i8*, i32 (i8*, i8*, i32, i32, i64)*, i32, i32, i64, i32 (i8*)*, i64, i8*, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !34, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ID3v2Encoding", file: !917, line: 44, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavformat/id3v2.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!918 = !{!919, !920, !921, !922}
!919 = !DIEnumerator(name: "ID3v2_ENCODING_ISO8859", value: 0)
!920 = !DIEnumerator(name: "ID3v2_ENCODING_UTF16BOM", value: 1)
!921 = !DIEnumerator(name: "ID3v2_ENCODING_UTF16BE", value: 2)
!922 = !DIEnumerator(name: "ID3v2_ENCODING_UTF8", value: 3)
!923 = !{!924, !925}
!924 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !928, line: 221, size: 32, align: 8, elements: !929)
!928 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!929 = !{!930}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !927, file: !928, line: 221, baseType: !931, size: 32, align: 32)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !932, line: 51, baseType: !924)
!932 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!933 = !{!934}
!934 = distinct !DIGlobalVariable(name: "time_base", scope: !935, file: !936, line: 260, type: !1346, isLocal: true, isDefinition: true, variable: %struct.AVRational* @write_chapter.time_base)
!935 = distinct !DISubprogram(name: "write_chapter", scope: !936, file: !936, line: 258, type: !937, isLocal: true, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2161)
!936 = !DIFile(filename: "libavformat/id3v2enc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!937 = !DISubroutineType(types: !938)
!938 = !{!939, !940, !2154, !939, !939}
!939 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !943)
!943 = !{!944, !989, !1102, !1250, !1251, !1316, !1317, !1318, !2011, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2065, !2066, !2067, !2068, !2069, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2120, !2121, !2124, !2125, !2126, !2127, !2128, !2129, !2131, !2132, !2133, !2134, !2142, !2143, !2147, !2151, !2152, !2153}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !942, file: !897, line: 1342, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !949)
!949 = !{!950, !954, !959, !963, !964, !965, !966, !970, !976, !978, !982}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !948, file: !4, line: 72, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !948, file: !4, line: 78, baseType: !955, size: 64, align: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!951, !958}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !948, file: !4, line: 85, baseType: !960, size: 64, align: 64, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !948, file: !4, line: 93, baseType: !939, size: 32, align: 32, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !948, file: !4, line: 99, baseType: !939, size: 32, align: 32, offset: 224)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !948, file: !4, line: 108, baseType: !939, size: 32, align: 32, offset: 256)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !948, file: !4, line: 113, baseType: !967, size: 64, align: 64, offset: 320)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!958, !958, !958}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !948, file: !4, line: 123, baseType: !971, size: 64, align: 64, offset: 384)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!974, !974}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !948, file: !4, line: 130, baseType: !977, size: 32, align: 32, offset: 448)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !948, file: !4, line: 136, baseType: !979, size: 64, align: 64, offset: 512)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!977, !958}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !948, file: !4, line: 142, baseType: !983, size: 64, align: 64, offset: 576)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!939, !986, !958, !951, !939}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !942, file: !897, line: 1349, baseType: !990, size: 64, align: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !992)
!992 = !{!993, !994, !995, !996, !997, !1007, !1008, !1009, !1010, !1011, !1012, !1026, !1031, !1073, !1074, !1078, !1083, !1084, !1085, !1089, !1095, !1101}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !991, file: !897, line: 638, baseType: !951, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !991, file: !897, line: 645, baseType: !951, size: 64, align: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !991, file: !897, line: 652, baseType: !939, size: 32, align: 32, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !991, file: !897, line: 659, baseType: !951, size: 64, align: 64, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !991, file: !897, line: 661, baseType: !998, size: 64, align: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1003, line: 44, size: 64, align: 32, elements: !1004)
!1003 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1004 = !{!1005, !1006}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1002, file: !1003, line: 45, baseType: !33, size: 32, align: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1002, file: !1003, line: 46, baseType: !924, size: 32, align: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !991, file: !897, line: 663, baseType: !945, size: 64, align: 64, offset: 320)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !991, file: !897, line: 670, baseType: !951, size: 64, align: 64, offset: 384)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !991, file: !897, line: 679, baseType: !990, size: 64, align: 64, offset: 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !991, file: !897, line: 684, baseType: !939, size: 32, align: 32, offset: 512)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !991, file: !897, line: 689, baseType: !939, size: 32, align: 32, offset: 544)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !991, file: !897, line: 696, baseType: !1013, size: 64, align: 64, offset: 576)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!939, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1019)
!1019 = !{!1020, !1021, !1024, !1025}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1018, file: !897, line: 449, baseType: !951, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1018, file: !897, line: 450, baseType: !1022, size: 64, align: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1018, file: !897, line: 451, baseType: !939, size: 32, align: 32, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1018, file: !897, line: 452, baseType: !951, size: 64, align: 64, offset: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !991, file: !897, line: 703, baseType: !1027, size: 64, align: 64, offset: 640)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!939, !1030}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !991, file: !897, line: 714, baseType: !1032, size: 64, align: 64, offset: 704)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!939, !1030, !1035}
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !34, line: 1499, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !34, line: 1445, size: 704, align: 64, elements: !1038)
!1038 = !{!1039, !1053, !1056, !1057, !1058, !1059, !1060, !1061, !1069, !1070, !1071, !1072}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1037, file: !34, line: 1451, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1042, line: 94, baseType: !1043)
!1042 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1042, line: 81, size: 192, align: 64, elements: !1044)
!1044 = !{!1045, !1049, !1052}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1043, file: !1042, line: 82, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1042, line: 73, baseType: !1048)
!1048 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1042, line: 73, flags: DIFlagFwdDecl)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1043, file: !1042, line: 89, baseType: !1050, size: 64, align: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !932, line: 48, baseType: !1023)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1043, file: !1042, line: 93, baseType: !939, size: 32, align: 32, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1037, file: !34, line: 1461, baseType: !1054, size: 64, align: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !932, line: 40, baseType: !1055)
!1055 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1037, file: !34, line: 1467, baseType: !1054, size: 64, align: 64, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1037, file: !34, line: 1468, baseType: !1050, size: 64, align: 64, offset: 192)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1037, file: !34, line: 1469, baseType: !939, size: 32, align: 32, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1037, file: !34, line: 1470, baseType: !939, size: 32, align: 32, offset: 288)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1037, file: !34, line: 1474, baseType: !939, size: 32, align: 32, offset: 320)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1037, file: !34, line: 1479, baseType: !1062, size: 64, align: 64, offset: 384)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !34, line: 1415, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !34, line: 1411, size: 128, align: 64, elements: !1065)
!1065 = !{!1066, !1067, !1068}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1064, file: !34, line: 1412, baseType: !1050, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1064, file: !34, line: 1413, baseType: !939, size: 32, align: 32, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1064, file: !34, line: 1414, baseType: !493, size: 32, align: 32, offset: 96)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1037, file: !34, line: 1480, baseType: !939, size: 32, align: 32, offset: 448)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1037, file: !34, line: 1486, baseType: !1054, size: 64, align: 64, offset: 512)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1037, file: !34, line: 1488, baseType: !1054, size: 64, align: 64, offset: 576)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1037, file: !34, line: 1497, baseType: !1054, size: 64, align: 64, offset: 640)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !991, file: !897, line: 720, baseType: !1027, size: 64, align: 64, offset: 768)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !991, file: !897, line: 730, baseType: !1075, size: 64, align: 64, offset: 832)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!939, !1030, !939, !1054, !939}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !991, file: !897, line: 737, baseType: !1079, size: 64, align: 64, offset: 896)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!1054, !1030, !939, !1082, !1054}
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !991, file: !897, line: 744, baseType: !1027, size: 64, align: 64, offset: 960)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !991, file: !897, line: 750, baseType: !1027, size: 64, align: 64, offset: 1024)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !991, file: !897, line: 758, baseType: !1086, size: 64, align: 64, offset: 1088)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!939, !1030, !939, !1054, !1054, !1054, !939}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !991, file: !897, line: 764, baseType: !1090, size: 64, align: 64, offset: 1152)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!939, !1030, !1093}
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !991, file: !897, line: 770, baseType: !1096, size: 64, align: 64, offset: 1216)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!939, !1030, !1099}
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !991, file: !897, line: 776, baseType: !1096, size: 64, align: 64, offset: 1280)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !942, file: !897, line: 1356, baseType: !1103, size: 64, align: 64, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1105)
!1105 = !{!1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1125, !1129, !1133, !1140, !1235, !1236, !1237, !1238, !1239, !1240, !1244}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1104, file: !897, line: 498, baseType: !951, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1104, file: !897, line: 504, baseType: !951, size: 64, align: 64, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1104, file: !897, line: 505, baseType: !951, size: 64, align: 64, offset: 128)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1104, file: !897, line: 506, baseType: !951, size: 64, align: 64, offset: 192)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1104, file: !897, line: 508, baseType: !33, size: 32, align: 32, offset: 256)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1104, file: !897, line: 509, baseType: !33, size: 32, align: 32, offset: 288)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1104, file: !897, line: 510, baseType: !33, size: 32, align: 32, offset: 320)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1104, file: !897, line: 517, baseType: !939, size: 32, align: 32, offset: 352)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1104, file: !897, line: 523, baseType: !998, size: 64, align: 64, offset: 384)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1104, file: !897, line: 526, baseType: !945, size: 64, align: 64, offset: 448)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1104, file: !897, line: 535, baseType: !1103, size: 64, align: 64, offset: 512)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1104, file: !897, line: 539, baseType: !939, size: 32, align: 32, offset: 576)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1104, file: !897, line: 541, baseType: !1027, size: 64, align: 64, offset: 640)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1104, file: !897, line: 549, baseType: !1032, size: 64, align: 64, offset: 704)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1104, file: !897, line: 550, baseType: !1027, size: 64, align: 64, offset: 768)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1104, file: !897, line: 554, baseType: !1122, size: 64, align: 64, offset: 832)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!939, !1030, !1035, !1035, !939}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1104, file: !897, line: 563, baseType: !1126, size: 64, align: 64, offset: 896)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!939, !33, !939}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1104, file: !897, line: 565, baseType: !1130, size: 64, align: 64, offset: 960)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{null, !1030, !939, !1082, !1082}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1104, file: !897, line: 570, baseType: !1134, size: 64, align: 64, offset: 1024)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!939, !1030, !939, !958, !1137}
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1138, line: 216, baseType: !1139)
!1138 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1139 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1104, file: !897, line: 581, baseType: !1141, size: 64, align: 64, offset: 1088)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!939, !1030, !939, !1144, !924}
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !535, line: 646, baseType: !1147)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !535, line: 268, size: 4288, align: 64, elements: !1148)
!1148 = !{!1149, !1153, !1155, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1189, !1191, !1192, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1147, file: !535, line: 282, baseType: !1150, size: 512, align: 64)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1050, size: 512, align: 64, elements: !1151)
!1151 = !{!1152}
!1152 = !DISubrange(count: 8)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1147, file: !535, line: 299, baseType: !1154, size: 256, align: 32, offset: 512)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 256, align: 32, elements: !1151)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1147, file: !535, line: 315, baseType: !1156, size: 64, align: 64, offset: 768)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1147, file: !535, line: 326, baseType: !939, size: 32, align: 32, offset: 832)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1147, file: !535, line: 326, baseType: !939, size: 32, align: 32, offset: 864)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1147, file: !535, line: 334, baseType: !939, size: 32, align: 32, offset: 896)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1147, file: !535, line: 341, baseType: !939, size: 32, align: 32, offset: 928)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1147, file: !535, line: 346, baseType: !939, size: 32, align: 32, offset: 960)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1147, file: !535, line: 351, baseType: !523, size: 32, align: 32, offset: 992)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1147, file: !535, line: 356, baseType: !1164, size: 64, align: 32, offset: 1024)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1165, line: 61, baseType: !1166)
!1165 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1165, line: 58, size: 64, align: 32, elements: !1167)
!1167 = !{!1168, !1169}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1166, file: !1165, line: 59, baseType: !939, size: 32, align: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1166, file: !1165, line: 60, baseType: !939, size: 32, align: 32, offset: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1147, file: !535, line: 361, baseType: !1054, size: 64, align: 64, offset: 1088)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1147, file: !535, line: 369, baseType: !1054, size: 64, align: 64, offset: 1152)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1147, file: !535, line: 377, baseType: !1054, size: 64, align: 64, offset: 1216)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1147, file: !535, line: 382, baseType: !939, size: 32, align: 32, offset: 1280)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1147, file: !535, line: 386, baseType: !939, size: 32, align: 32, offset: 1312)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1147, file: !535, line: 391, baseType: !939, size: 32, align: 32, offset: 1344)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1147, file: !535, line: 396, baseType: !958, size: 64, align: 64, offset: 1408)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1147, file: !535, line: 403, baseType: !1178, size: 512, align: 64, offset: 1472)
!1178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1179, size: 512, align: 64, elements: !1151)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !932, line: 55, baseType: !1139)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1147, file: !535, line: 410, baseType: !939, size: 32, align: 32, offset: 1984)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1147, file: !535, line: 415, baseType: !939, size: 32, align: 32, offset: 2016)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1147, file: !535, line: 420, baseType: !939, size: 32, align: 32, offset: 2048)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1147, file: !535, line: 425, baseType: !939, size: 32, align: 32, offset: 2080)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1147, file: !535, line: 435, baseType: !1054, size: 64, align: 64, offset: 2112)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1147, file: !535, line: 440, baseType: !939, size: 32, align: 32, offset: 2176)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1147, file: !535, line: 445, baseType: !1179, size: 64, align: 64, offset: 2240)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1147, file: !535, line: 459, baseType: !1188, size: 512, align: 64, offset: 2304)
!1188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 512, align: 64, elements: !1151)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1147, file: !535, line: 473, baseType: !1190, size: 64, align: 64, offset: 2816)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1147, file: !535, line: 477, baseType: !939, size: 32, align: 32, offset: 2880)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1147, file: !535, line: 479, baseType: !1193, size: 64, align: 64, offset: 2944)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !535, line: 207, baseType: !1196)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !535, line: 201, size: 320, align: 64, elements: !1197)
!1197 = !{!1198, !1199, !1200, !1201, !1206}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1196, file: !535, line: 202, baseType: !534, size: 32, align: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1196, file: !535, line: 203, baseType: !1050, size: 64, align: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1196, file: !535, line: 204, baseType: !939, size: 32, align: 32, offset: 128)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1196, file: !535, line: 205, baseType: !1202, size: 64, align: 64, offset: 192)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1204, line: 86, baseType: !1205)
!1204 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1205 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1204, line: 86, flags: DIFlagFwdDecl)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1196, file: !535, line: 206, baseType: !1040, size: 64, align: 64, offset: 256)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1147, file: !535, line: 480, baseType: !939, size: 32, align: 32, offset: 3008)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1147, file: !535, line: 505, baseType: !939, size: 32, align: 32, offset: 3040)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1147, file: !535, line: 512, baseType: !558, size: 32, align: 32, offset: 3072)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1147, file: !535, line: 514, baseType: !565, size: 32, align: 32, offset: 3104)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1147, file: !535, line: 516, baseType: !583, size: 32, align: 32, offset: 3136)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1147, file: !535, line: 523, baseType: !607, size: 32, align: 32, offset: 3168)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1147, file: !535, line: 525, baseType: !626, size: 32, align: 32, offset: 3200)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1147, file: !535, line: 532, baseType: !1054, size: 64, align: 64, offset: 3264)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1147, file: !535, line: 539, baseType: !1054, size: 64, align: 64, offset: 3328)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1147, file: !535, line: 547, baseType: !1054, size: 64, align: 64, offset: 3392)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1147, file: !535, line: 554, baseType: !1202, size: 64, align: 64, offset: 3456)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1147, file: !535, line: 563, baseType: !939, size: 32, align: 32, offset: 3520)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1147, file: !535, line: 572, baseType: !939, size: 32, align: 32, offset: 3552)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1147, file: !535, line: 581, baseType: !939, size: 32, align: 32, offset: 3584)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1147, file: !535, line: 588, baseType: !1222, size: 64, align: 64, offset: 3648)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !932, line: 36, baseType: !1224)
!1224 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1147, file: !535, line: 593, baseType: !939, size: 32, align: 32, offset: 3712)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1147, file: !535, line: 596, baseType: !939, size: 32, align: 32, offset: 3744)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1147, file: !535, line: 599, baseType: !1040, size: 64, align: 64, offset: 3776)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1147, file: !535, line: 605, baseType: !1040, size: 64, align: 64, offset: 3840)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1147, file: !535, line: 616, baseType: !1040, size: 64, align: 64, offset: 3904)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1147, file: !535, line: 626, baseType: !1137, size: 64, align: 64, offset: 3968)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1147, file: !535, line: 627, baseType: !1137, size: 64, align: 64, offset: 4032)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1147, file: !535, line: 628, baseType: !1137, size: 64, align: 64, offset: 4096)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1147, file: !535, line: 629, baseType: !1137, size: 64, align: 64, offset: 4160)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1147, file: !535, line: 645, baseType: !1040, size: 64, align: 64, offset: 4224)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1104, file: !897, line: 587, baseType: !1090, size: 64, align: 64, offset: 1152)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1104, file: !897, line: 592, baseType: !1096, size: 64, align: 64, offset: 1216)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1104, file: !897, line: 597, baseType: !1096, size: 64, align: 64, offset: 1280)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1104, file: !897, line: 598, baseType: !33, size: 32, align: 32, offset: 1344)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1104, file: !897, line: 608, baseType: !1027, size: 64, align: 64, offset: 1408)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1104, file: !897, line: 617, baseType: !1241, size: 64, align: 64, offset: 1472)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{null, !1030}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1104, file: !897, line: 623, baseType: !1245, size: 64, align: 64, offset: 1536)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!939, !1030, !1248}
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !942, file: !897, line: 1365, baseType: !958, size: 64, align: 64, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !942, file: !897, line: 1379, baseType: !1252, size: 64, align: 64, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !25, line: 352, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !25, line: 161, size: 2112, align: 64, elements: !1255)
!1255 = !{!1256, !1257, !1258, !1259, !1260, !1261, !1262, !1266, !1267, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1283, !1284, !1288, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1306, !1307, !1308, !1309, !1313, !1314, !1315}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1254, file: !25, line: 174, baseType: !945, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1254, file: !25, line: 226, baseType: !1022, size: 64, align: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1254, file: !25, line: 227, baseType: !939, size: 32, align: 32, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1254, file: !25, line: 228, baseType: !1022, size: 64, align: 64, offset: 192)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1254, file: !25, line: 229, baseType: !1022, size: 64, align: 64, offset: 256)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1254, file: !25, line: 233, baseType: !958, size: 64, align: 64, offset: 320)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1254, file: !25, line: 235, baseType: !1263, size: 64, align: 64, offset: 384)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!939, !958, !1050, !939}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1254, file: !25, line: 236, baseType: !1263, size: 64, align: 64, offset: 448)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1254, file: !25, line: 237, baseType: !1268, size: 64, align: 64, offset: 512)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!1054, !958, !1054, !939}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1254, file: !25, line: 238, baseType: !1054, size: 64, align: 64, offset: 576)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1254, file: !25, line: 239, baseType: !939, size: 32, align: 32, offset: 640)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1254, file: !25, line: 240, baseType: !939, size: 32, align: 32, offset: 672)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1254, file: !25, line: 241, baseType: !939, size: 32, align: 32, offset: 704)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1254, file: !25, line: 242, baseType: !1139, size: 64, align: 64, offset: 768)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1254, file: !25, line: 243, baseType: !1022, size: 64, align: 64, offset: 832)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1254, file: !25, line: 244, baseType: !1278, size: 64, align: 64, offset: 896)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!1139, !1139, !1281, !924}
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1254, file: !25, line: 245, baseType: !939, size: 32, align: 32, offset: 960)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1254, file: !25, line: 249, baseType: !1285, size: 64, align: 64, offset: 1024)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!939, !958, !939}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1254, file: !25, line: 255, baseType: !1289, size: 64, align: 64, offset: 1088)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!1054, !958, !939, !1054, !939}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1254, file: !25, line: 260, baseType: !939, size: 32, align: 32, offset: 1152)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1254, file: !25, line: 266, baseType: !1054, size: 64, align: 64, offset: 1216)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1254, file: !25, line: 273, baseType: !939, size: 32, align: 32, offset: 1280)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1254, file: !25, line: 279, baseType: !1054, size: 64, align: 64, offset: 1344)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1254, file: !25, line: 285, baseType: !939, size: 32, align: 32, offset: 1408)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1254, file: !25, line: 291, baseType: !939, size: 32, align: 32, offset: 1440)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1254, file: !25, line: 298, baseType: !939, size: 32, align: 32, offset: 1472)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1254, file: !25, line: 304, baseType: !939, size: 32, align: 32, offset: 1504)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1254, file: !25, line: 309, baseType: !951, size: 64, align: 64, offset: 1536)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1254, file: !25, line: 314, baseType: !951, size: 64, align: 64, offset: 1600)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1254, file: !25, line: 319, baseType: !1303, size: 64, align: 64, offset: 1664)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{!939, !958, !1050, !939, !24, !1054}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1254, file: !25, line: 326, baseType: !939, size: 32, align: 32, offset: 1728)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1254, file: !25, line: 331, baseType: !24, size: 32, align: 32, offset: 1760)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1254, file: !25, line: 332, baseType: !1054, size: 64, align: 64, offset: 1792)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1254, file: !25, line: 338, baseType: !1310, size: 64, align: 64, offset: 1856)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DISubroutineType(types: !1312)
!1312 = !{!939, !958}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1254, file: !25, line: 340, baseType: !1054, size: 64, align: 64, offset: 1920)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1254, file: !25, line: 346, baseType: !1022, size: 64, align: 64, offset: 1984)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1254, file: !25, line: 351, baseType: !939, size: 32, align: 32, offset: 2048)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !942, file: !897, line: 1386, baseType: !939, size: 32, align: 32, offset: 320)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !942, file: !897, line: 1393, baseType: !924, size: 32, align: 32, offset: 352)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !942, file: !897, line: 1405, baseType: !1319, size: 64, align: 64, offset: 384)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1323)
!1323 = !{!1324, !1325, !1326, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1796, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1897, !1903, !1904, !1908, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1940, !1941, !1942, !1943, !1944, !1945}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1322, file: !897, line: 866, baseType: !939, size: 32, align: 32)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1322, file: !897, line: 872, baseType: !939, size: 32, align: 32, offset: 32)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1322, file: !897, line: 878, baseType: !1327, size: 64, align: 64, offset: 64)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !34, line: 3360, baseType: !1329)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !34, line: 1556, size: 8448, align: 64, elements: !1330)
!1330 = !{!1331, !1332, !1333, !1334, !1471, !1472, !1473, !1474, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1500, !1504, !1505, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1684, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1329, file: !34, line: 1561, baseType: !945, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1329, file: !34, line: 1562, baseType: !939, size: 32, align: 32, offset: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1329, file: !34, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1329, file: !34, line: 1565, baseType: !1335, size: 64, align: 64, offset: 128)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1337)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !34, line: 3468, size: 1984, align: 64, elements: !1338)
!1338 = !{!1339, !1340, !1341, !1342, !1343, !1344, !1347, !1350, !1353, !1356, !1359, !1360, !1361, !1369, !1370, !1371, !1373, !1377, !1383, !1388, !1392, !1393, !1436, !1443, !1447, !1448, !1452, !1456, !1460, !1464, !1465, !1466}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1337, file: !34, line: 3475, baseType: !951, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1337, file: !34, line: 3480, baseType: !951, size: 64, align: 64, offset: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1337, file: !34, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1337, file: !34, line: 3482, baseType: !33, size: 32, align: 32, offset: 160)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1337, file: !34, line: 3487, baseType: !939, size: 32, align: 32, offset: 192)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1337, file: !34, line: 3488, baseType: !1345, size: 64, align: 64, offset: 256)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1164)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1337, file: !34, line: 3489, baseType: !1348, size: 64, align: 64, offset: 320)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1337, file: !34, line: 3490, baseType: !1351, size: 64, align: 64, offset: 384)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1337, file: !34, line: 3491, baseType: !1354, size: 64, align: 64, offset: 448)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1337, file: !34, line: 3492, baseType: !1357, size: 64, align: 64, offset: 512)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1179)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1337, file: !34, line: 3493, baseType: !1051, size: 8, align: 8, offset: 576)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1337, file: !34, line: 3494, baseType: !945, size: 64, align: 64, offset: 640)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1337, file: !34, line: 3495, baseType: !1362, size: 64, align: 64, offset: 704)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1364)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !34, line: 3404, baseType: !1365)
!1365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !34, line: 3401, size: 128, align: 64, elements: !1366)
!1366 = !{!1367, !1368}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1365, file: !34, line: 3402, baseType: !939, size: 32, align: 32)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1365, file: !34, line: 3403, baseType: !951, size: 64, align: 64, offset: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1337, file: !34, line: 3507, baseType: !951, size: 64, align: 64, offset: 768)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1337, file: !34, line: 3516, baseType: !939, size: 32, align: 32, offset: 832)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1337, file: !34, line: 3517, baseType: !1372, size: 64, align: 64, offset: 896)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1337, file: !34, line: 3527, baseType: !1374, size: 64, align: 64, offset: 960)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{!939, !1327}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1337, file: !34, line: 3535, baseType: !1378, size: 64, align: 64, offset: 1024)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DISubroutineType(types: !1380)
!1380 = !{!939, !1327, !1381}
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1328)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1337, file: !34, line: 3541, baseType: !1384, size: 64, align: 64, offset: 1088)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1386)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !34, line: 3461, baseType: !1387)
!1387 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !34, line: 3461, flags: DIFlagFwdDecl)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1337, file: !34, line: 3549, baseType: !1389, size: 64, align: 64, offset: 1152)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DISubroutineType(types: !1391)
!1391 = !{null, !1372}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1337, file: !34, line: 3551, baseType: !1374, size: 64, align: 64, offset: 1216)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1337, file: !34, line: 3552, baseType: !1394, size: 64, align: 64, offset: 1280)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{!939, !1327, !1050, !939, !1397}
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !34, line: 3920, size: 256, align: 64, elements: !1400)
!1400 = !{!1401, !1404, !1405, !1406, !1407, !1435}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1399, file: !34, line: 3921, baseType: !1402, size: 16, align: 16)
!1402 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !932, line: 49, baseType: !1403)
!1403 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1399, file: !34, line: 3922, baseType: !931, size: 32, align: 32, offset: 32)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1399, file: !34, line: 3923, baseType: !931, size: 32, align: 32, offset: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1399, file: !34, line: 3924, baseType: !924, size: 32, align: 32, offset: 96)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1399, file: !34, line: 3925, baseType: !1408, size: 64, align: 64, offset: 128)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !34, line: 3918, baseType: !1411)
!1411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !34, line: 3885, size: 1600, align: 64, elements: !1412)
!1412 = !{!1413, !1414, !1415, !1416, !1417, !1418, !1424, !1428, !1430, !1431, !1433, !1434}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1411, file: !34, line: 3886, baseType: !939, size: 32, align: 32)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1411, file: !34, line: 3887, baseType: !939, size: 32, align: 32, offset: 32)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1411, file: !34, line: 3888, baseType: !939, size: 32, align: 32, offset: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1411, file: !34, line: 3889, baseType: !939, size: 32, align: 32, offset: 96)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1411, file: !34, line: 3890, baseType: !939, size: 32, align: 32, offset: 128)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1411, file: !34, line: 3897, baseType: !1419, size: 768, align: 64, offset: 192)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !34, line: 3858, baseType: !1420)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !34, line: 3853, size: 768, align: 64, elements: !1421)
!1421 = !{!1422, !1423}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1420, file: !34, line: 3855, baseType: !1150, size: 512, align: 64)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1420, file: !34, line: 3857, baseType: !1154, size: 256, align: 32, offset: 512)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1411, file: !34, line: 3903, baseType: !1425, size: 256, align: 64, offset: 960)
!1425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1050, size: 256, align: 64, elements: !1426)
!1426 = !{!1427}
!1427 = !DISubrange(count: 4)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1411, file: !34, line: 3904, baseType: !1429, size: 128, align: 32, offset: 1216)
!1429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 128, align: 32, elements: !1426)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1411, file: !34, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1411, file: !34, line: 3908, baseType: !1432, size: 64, align: 64, offset: 1408)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1411, file: !34, line: 3915, baseType: !1432, size: 64, align: 64, offset: 1472)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1411, file: !34, line: 3917, baseType: !939, size: 32, align: 32, offset: 1536)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1399, file: !34, line: 3926, baseType: !1054, size: 64, align: 64, offset: 192)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1337, file: !34, line: 3564, baseType: !1437, size: 64, align: 64, offset: 1344)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DISubroutineType(types: !1439)
!1439 = !{!939, !1327, !1035, !1440, !1442}
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1146)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1337, file: !34, line: 3566, baseType: !1444, size: 64, align: 64, offset: 1408)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DISubroutineType(types: !1446)
!1446 = !{!939, !1327, !958, !1442, !1035}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1337, file: !34, line: 3567, baseType: !1374, size: 64, align: 64, offset: 1472)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1337, file: !34, line: 3576, baseType: !1449, size: 64, align: 64, offset: 1536)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DISubroutineType(types: !1451)
!1451 = !{!939, !1327, !1440}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1337, file: !34, line: 3577, baseType: !1453, size: 64, align: 64, offset: 1600)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{!939, !1327, !1035}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1337, file: !34, line: 3584, baseType: !1457, size: 64, align: 64, offset: 1664)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!939, !1327, !1145}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1337, file: !34, line: 3589, baseType: !1461, size: 64, align: 64, offset: 1728)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{null, !1327}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1337, file: !34, line: 3594, baseType: !939, size: 32, align: 32, offset: 1792)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1337, file: !34, line: 3600, baseType: !951, size: 64, align: 64, offset: 1856)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1337, file: !34, line: 3609, baseType: !1467, size: 64, align: 64, offset: 1920)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1470)
!1470 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !34, line: 3609, flags: DIFlagFwdDecl)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1329, file: !34, line: 1566, baseType: !33, size: 32, align: 32, offset: 192)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1329, file: !34, line: 1581, baseType: !924, size: 32, align: 32, offset: 224)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1329, file: !34, line: 1583, baseType: !958, size: 64, align: 64, offset: 256)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1329, file: !34, line: 1591, baseType: !1475, size: 64, align: 64, offset: 320)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !34, line: 1532, flags: DIFlagFwdDecl)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1329, file: !34, line: 1598, baseType: !958, size: 64, align: 64, offset: 384)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1329, file: !34, line: 1606, baseType: !1054, size: 64, align: 64, offset: 448)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1329, file: !34, line: 1614, baseType: !939, size: 32, align: 32, offset: 512)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1329, file: !34, line: 1622, baseType: !939, size: 32, align: 32, offset: 544)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1329, file: !34, line: 1628, baseType: !939, size: 32, align: 32, offset: 576)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1329, file: !34, line: 1636, baseType: !939, size: 32, align: 32, offset: 608)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1329, file: !34, line: 1643, baseType: !939, size: 32, align: 32, offset: 640)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1329, file: !34, line: 1657, baseType: !1050, size: 64, align: 64, offset: 704)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1329, file: !34, line: 1658, baseType: !939, size: 32, align: 32, offset: 768)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1329, file: !34, line: 1679, baseType: !1164, size: 64, align: 32, offset: 800)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1329, file: !34, line: 1688, baseType: !939, size: 32, align: 32, offset: 864)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1329, file: !34, line: 1712, baseType: !939, size: 32, align: 32, offset: 896)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1329, file: !34, line: 1729, baseType: !939, size: 32, align: 32, offset: 928)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1329, file: !34, line: 1729, baseType: !939, size: 32, align: 32, offset: 960)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1329, file: !34, line: 1744, baseType: !939, size: 32, align: 32, offset: 992)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1329, file: !34, line: 1744, baseType: !939, size: 32, align: 32, offset: 1024)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1329, file: !34, line: 1751, baseType: !939, size: 32, align: 32, offset: 1056)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1329, file: !34, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1329, file: !34, line: 1791, baseType: !1496, size: 64, align: 64, offset: 1152)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{null, !1499, !1440, !1442, !939, !939, !939}
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1329, file: !34, line: 1808, baseType: !1501, size: 64, align: 64, offset: 1216)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{!645, !1499, !1348}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1329, file: !34, line: 1816, baseType: !939, size: 32, align: 32, offset: 1280)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1329, file: !34, line: 1825, baseType: !1506, size: 32, align: 32, offset: 1312)
!1506 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1329, file: !34, line: 1830, baseType: !939, size: 32, align: 32, offset: 1344)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1329, file: !34, line: 1838, baseType: !1506, size: 32, align: 32, offset: 1376)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1329, file: !34, line: 1846, baseType: !939, size: 32, align: 32, offset: 1408)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1329, file: !34, line: 1851, baseType: !939, size: 32, align: 32, offset: 1440)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1329, file: !34, line: 1861, baseType: !1506, size: 32, align: 32, offset: 1472)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1329, file: !34, line: 1868, baseType: !1506, size: 32, align: 32, offset: 1504)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1329, file: !34, line: 1875, baseType: !1506, size: 32, align: 32, offset: 1536)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1329, file: !34, line: 1882, baseType: !1506, size: 32, align: 32, offset: 1568)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1329, file: !34, line: 1889, baseType: !1506, size: 32, align: 32, offset: 1600)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1329, file: !34, line: 1896, baseType: !1506, size: 32, align: 32, offset: 1632)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1329, file: !34, line: 1903, baseType: !1506, size: 32, align: 32, offset: 1664)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1329, file: !34, line: 1910, baseType: !939, size: 32, align: 32, offset: 1696)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1329, file: !34, line: 1915, baseType: !939, size: 32, align: 32, offset: 1728)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1329, file: !34, line: 1926, baseType: !1442, size: 64, align: 64, offset: 1792)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1329, file: !34, line: 1935, baseType: !1164, size: 64, align: 32, offset: 1856)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1329, file: !34, line: 1942, baseType: !939, size: 32, align: 32, offset: 1920)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1329, file: !34, line: 1948, baseType: !939, size: 32, align: 32, offset: 1952)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1329, file: !34, line: 1954, baseType: !939, size: 32, align: 32, offset: 1984)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1329, file: !34, line: 1960, baseType: !939, size: 32, align: 32, offset: 2016)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1329, file: !34, line: 1984, baseType: !939, size: 32, align: 32, offset: 2048)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1329, file: !34, line: 1991, baseType: !939, size: 32, align: 32, offset: 2080)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1329, file: !34, line: 1996, baseType: !939, size: 32, align: 32, offset: 2112)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1329, file: !34, line: 2004, baseType: !939, size: 32, align: 32, offset: 2144)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1329, file: !34, line: 2011, baseType: !939, size: 32, align: 32, offset: 2176)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1329, file: !34, line: 2018, baseType: !939, size: 32, align: 32, offset: 2208)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1329, file: !34, line: 2027, baseType: !939, size: 32, align: 32, offset: 2240)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1329, file: !34, line: 2034, baseType: !939, size: 32, align: 32, offset: 2272)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1329, file: !34, line: 2044, baseType: !939, size: 32, align: 32, offset: 2304)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1329, file: !34, line: 2054, baseType: !1536, size: 64, align: 64, offset: 2368)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1329, file: !34, line: 2061, baseType: !1536, size: 64, align: 64, offset: 2432)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1329, file: !34, line: 2066, baseType: !939, size: 32, align: 32, offset: 2496)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1329, file: !34, line: 2070, baseType: !939, size: 32, align: 32, offset: 2528)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1329, file: !34, line: 2078, baseType: !939, size: 32, align: 32, offset: 2560)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1329, file: !34, line: 2085, baseType: !939, size: 32, align: 32, offset: 2592)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1329, file: !34, line: 2092, baseType: !939, size: 32, align: 32, offset: 2624)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1329, file: !34, line: 2099, baseType: !939, size: 32, align: 32, offset: 2656)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1329, file: !34, line: 2106, baseType: !939, size: 32, align: 32, offset: 2688)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1329, file: !34, line: 2113, baseType: !939, size: 32, align: 32, offset: 2720)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1329, file: !34, line: 2120, baseType: !939, size: 32, align: 32, offset: 2752)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1329, file: !34, line: 2125, baseType: !939, size: 32, align: 32, offset: 2784)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1329, file: !34, line: 2133, baseType: !939, size: 32, align: 32, offset: 2816)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1329, file: !34, line: 2140, baseType: !939, size: 32, align: 32, offset: 2848)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1329, file: !34, line: 2145, baseType: !939, size: 32, align: 32, offset: 2880)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1329, file: !34, line: 2153, baseType: !939, size: 32, align: 32, offset: 2912)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1329, file: !34, line: 2158, baseType: !939, size: 32, align: 32, offset: 2944)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1329, file: !34, line: 2166, baseType: !565, size: 32, align: 32, offset: 2976)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1329, file: !34, line: 2173, baseType: !583, size: 32, align: 32, offset: 3008)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1329, file: !34, line: 2180, baseType: !607, size: 32, align: 32, offset: 3040)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1329, file: !34, line: 2187, baseType: !558, size: 32, align: 32, offset: 3072)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1329, file: !34, line: 2194, baseType: !626, size: 32, align: 32, offset: 3104)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1329, file: !34, line: 2203, baseType: !939, size: 32, align: 32, offset: 3136)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1329, file: !34, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1329, file: !34, line: 2212, baseType: !939, size: 32, align: 32, offset: 3200)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1329, file: !34, line: 2213, baseType: !939, size: 32, align: 32, offset: 3232)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1329, file: !34, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1329, file: !34, line: 2232, baseType: !939, size: 32, align: 32, offset: 3296)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1329, file: !34, line: 2243, baseType: !939, size: 32, align: 32, offset: 3328)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1329, file: !34, line: 2249, baseType: !939, size: 32, align: 32, offset: 3360)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1329, file: !34, line: 2256, baseType: !939, size: 32, align: 32, offset: 3392)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1329, file: !34, line: 2263, baseType: !1179, size: 64, align: 64, offset: 3456)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1329, file: !34, line: 2270, baseType: !1179, size: 64, align: 64, offset: 3520)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1329, file: !34, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1329, file: !34, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1329, file: !34, line: 2367, baseType: !1572, size: 64, align: 64, offset: 3648)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DISubroutineType(types: !1574)
!1574 = !{!939, !1499, !1145, !939}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1329, file: !34, line: 2383, baseType: !939, size: 32, align: 32, offset: 3712)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1329, file: !34, line: 2386, baseType: !1506, size: 32, align: 32, offset: 3744)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1329, file: !34, line: 2387, baseType: !1506, size: 32, align: 32, offset: 3776)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1329, file: !34, line: 2394, baseType: !939, size: 32, align: 32, offset: 3808)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1329, file: !34, line: 2401, baseType: !939, size: 32, align: 32, offset: 3840)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1329, file: !34, line: 2408, baseType: !939, size: 32, align: 32, offset: 3872)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1329, file: !34, line: 2415, baseType: !939, size: 32, align: 32, offset: 3904)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1329, file: !34, line: 2422, baseType: !939, size: 32, align: 32, offset: 3936)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1329, file: !34, line: 2423, baseType: !1584, size: 64, align: 64, offset: 3968)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !34, line: 831, baseType: !1586)
!1586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !34, line: 826, size: 128, align: 32, elements: !1587)
!1587 = !{!1588, !1589, !1590, !1591}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1586, file: !34, line: 827, baseType: !939, size: 32, align: 32)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1586, file: !34, line: 828, baseType: !939, size: 32, align: 32, offset: 32)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1586, file: !34, line: 829, baseType: !939, size: 32, align: 32, offset: 64)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1586, file: !34, line: 830, baseType: !1506, size: 32, align: 32, offset: 96)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1329, file: !34, line: 2430, baseType: !1054, size: 64, align: 64, offset: 4032)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1329, file: !34, line: 2437, baseType: !1054, size: 64, align: 64, offset: 4096)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1329, file: !34, line: 2444, baseType: !1506, size: 32, align: 32, offset: 4160)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1329, file: !34, line: 2451, baseType: !1506, size: 32, align: 32, offset: 4192)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1329, file: !34, line: 2458, baseType: !939, size: 32, align: 32, offset: 4224)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1329, file: !34, line: 2469, baseType: !939, size: 32, align: 32, offset: 4256)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1329, file: !34, line: 2475, baseType: !939, size: 32, align: 32, offset: 4288)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1329, file: !34, line: 2481, baseType: !939, size: 32, align: 32, offset: 4320)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1329, file: !34, line: 2485, baseType: !939, size: 32, align: 32, offset: 4352)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1329, file: !34, line: 2489, baseType: !939, size: 32, align: 32, offset: 4384)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1329, file: !34, line: 2493, baseType: !939, size: 32, align: 32, offset: 4416)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1329, file: !34, line: 2501, baseType: !939, size: 32, align: 32, offset: 4448)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1329, file: !34, line: 2506, baseType: !939, size: 32, align: 32, offset: 4480)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1329, file: !34, line: 2510, baseType: !939, size: 32, align: 32, offset: 4512)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1329, file: !34, line: 2514, baseType: !1054, size: 64, align: 64, offset: 4544)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1329, file: !34, line: 2528, baseType: !1608, size: 64, align: 64, offset: 4608)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DISubroutineType(types: !1610)
!1610 = !{null, !1499, !958, !939, !939}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1329, file: !34, line: 2534, baseType: !939, size: 32, align: 32, offset: 4672)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1329, file: !34, line: 2545, baseType: !939, size: 32, align: 32, offset: 4704)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1329, file: !34, line: 2547, baseType: !939, size: 32, align: 32, offset: 4736)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1329, file: !34, line: 2549, baseType: !939, size: 32, align: 32, offset: 4768)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1329, file: !34, line: 2551, baseType: !939, size: 32, align: 32, offset: 4800)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1329, file: !34, line: 2553, baseType: !939, size: 32, align: 32, offset: 4832)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1329, file: !34, line: 2555, baseType: !939, size: 32, align: 32, offset: 4864)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1329, file: !34, line: 2557, baseType: !939, size: 32, align: 32, offset: 4896)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1329, file: !34, line: 2559, baseType: !939, size: 32, align: 32, offset: 4928)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1329, file: !34, line: 2563, baseType: !939, size: 32, align: 32, offset: 4960)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1329, file: !34, line: 2571, baseType: !1432, size: 64, align: 64, offset: 4992)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1329, file: !34, line: 2579, baseType: !1432, size: 64, align: 64, offset: 5056)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1329, file: !34, line: 2586, baseType: !939, size: 32, align: 32, offset: 5120)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1329, file: !34, line: 2615, baseType: !939, size: 32, align: 32, offset: 5152)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1329, file: !34, line: 2627, baseType: !939, size: 32, align: 32, offset: 5184)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1329, file: !34, line: 2637, baseType: !939, size: 32, align: 32, offset: 5216)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1329, file: !34, line: 2681, baseType: !939, size: 32, align: 32, offset: 5248)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1329, file: !34, line: 2709, baseType: !1054, size: 64, align: 64, offset: 5312)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1329, file: !34, line: 2716, baseType: !1630, size: 64, align: 64, offset: 5376)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1632)
!1632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !34, line: 3636, size: 896, align: 64, elements: !1633)
!1633 = !{!1634, !1635, !1636, !1637, !1638, !1639, !1640, !1644, !1648, !1649, !1650, !1651, !1657, !1658, !1659, !1660, !1661}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1632, file: !34, line: 3642, baseType: !951, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1632, file: !34, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1632, file: !34, line: 3656, baseType: !33, size: 32, align: 32, offset: 96)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1632, file: !34, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1632, file: !34, line: 3669, baseType: !939, size: 32, align: 32, offset: 160)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1632, file: !34, line: 3682, baseType: !1457, size: 64, align: 64, offset: 192)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1632, file: !34, line: 3698, baseType: !1641, size: 64, align: 64, offset: 256)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{!939, !1327, !1281, !931}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1632, file: !34, line: 3712, baseType: !1645, size: 64, align: 64, offset: 320)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{!939, !1327, !939, !1281, !931}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1632, file: !34, line: 3726, baseType: !1641, size: 64, align: 64, offset: 384)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1632, file: !34, line: 3737, baseType: !1374, size: 64, align: 64, offset: 448)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1632, file: !34, line: 3746, baseType: !939, size: 32, align: 32, offset: 512)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1632, file: !34, line: 3757, baseType: !1652, size: 64, align: 64, offset: 576)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{null, !1655}
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !34, line: 3617, flags: DIFlagFwdDecl)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1632, file: !34, line: 3766, baseType: !1374, size: 64, align: 64, offset: 640)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1632, file: !34, line: 3774, baseType: !1374, size: 64, align: 64, offset: 704)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1632, file: !34, line: 3780, baseType: !939, size: 32, align: 32, offset: 768)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1632, file: !34, line: 3785, baseType: !939, size: 32, align: 32, offset: 800)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1632, file: !34, line: 3795, baseType: !1662, size: 64, align: 64, offset: 832)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DISubroutineType(types: !1664)
!1664 = !{!939, !1327, !1040}
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1329, file: !34, line: 2728, baseType: !958, size: 64, align: 64, offset: 5440)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1329, file: !34, line: 2735, baseType: !1178, size: 512, align: 64, offset: 5504)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1329, file: !34, line: 2742, baseType: !939, size: 32, align: 32, offset: 6016)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1329, file: !34, line: 2755, baseType: !939, size: 32, align: 32, offset: 6048)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1329, file: !34, line: 2776, baseType: !939, size: 32, align: 32, offset: 6080)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1329, file: !34, line: 2783, baseType: !939, size: 32, align: 32, offset: 6112)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1329, file: !34, line: 2791, baseType: !939, size: 32, align: 32, offset: 6144)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1329, file: !34, line: 2802, baseType: !1145, size: 64, align: 64, offset: 6208)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1329, file: !34, line: 2811, baseType: !939, size: 32, align: 32, offset: 6272)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1329, file: !34, line: 2821, baseType: !939, size: 32, align: 32, offset: 6304)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1329, file: !34, line: 2830, baseType: !939, size: 32, align: 32, offset: 6336)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1329, file: !34, line: 2840, baseType: !939, size: 32, align: 32, offset: 6368)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1329, file: !34, line: 2851, baseType: !1678, size: 64, align: 64, offset: 6400)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DISubroutineType(types: !1680)
!1680 = !{!939, !1499, !1681, !958, !1442, !939, !939}
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{!939, !1499, !958}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1329, file: !34, line: 2871, baseType: !1685, size: 64, align: 64, offset: 6464)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DISubroutineType(types: !1687)
!1687 = !{!939, !1499, !1688, !958, !1442, !939}
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!939, !1499, !958, !939, !939}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1329, file: !34, line: 2878, baseType: !939, size: 32, align: 32, offset: 6528)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1329, file: !34, line: 2885, baseType: !939, size: 32, align: 32, offset: 6560)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1329, file: !34, line: 3005, baseType: !939, size: 32, align: 32, offset: 6592)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1329, file: !34, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1329, file: !34, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1329, file: !34, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1329, file: !34, line: 3037, baseType: !1050, size: 64, align: 64, offset: 6720)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1329, file: !34, line: 3038, baseType: !939, size: 32, align: 32, offset: 6784)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1329, file: !34, line: 3050, baseType: !1179, size: 64, align: 64, offset: 6848)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1329, file: !34, line: 3065, baseType: !939, size: 32, align: 32, offset: 6912)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1329, file: !34, line: 3083, baseType: !939, size: 32, align: 32, offset: 6944)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1329, file: !34, line: 3092, baseType: !1164, size: 64, align: 32, offset: 6976)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1329, file: !34, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1329, file: !34, line: 3106, baseType: !1164, size: 64, align: 32, offset: 7072)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1329, file: !34, line: 3113, baseType: !1706, size: 64, align: 64, offset: 7168)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1708)
!1708 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !34, line: 740, baseType: !1709)
!1709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !34, line: 712, size: 384, align: 64, elements: !1710)
!1710 = !{!1711, !1712, !1713, !1714, !1715, !1716, !1719}
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1709, file: !34, line: 713, baseType: !33, size: 32, align: 32)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1709, file: !34, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1709, file: !34, line: 720, baseType: !951, size: 64, align: 64, offset: 64)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1709, file: !34, line: 724, baseType: !951, size: 64, align: 64, offset: 128)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1709, file: !34, line: 728, baseType: !939, size: 32, align: 32, offset: 192)
