; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--wtvenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--wtvenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecTag = type { i32, i32 }
%struct.AVOutputFormat = type { i8*, i8*, i8*, i8*, i32, i32, i32, i32, %struct.AVCodecTag**, %struct.AVClass*, %struct.AVOutputFormat*, i32, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*, %struct.AVPacket*, i32)*, i32 (i32, i32)*, void (%struct.AVFormatContext*, i32, i64*, i64*)*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i32 (%struct.AVFormatContext*, i32, %struct.AVFrame**, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32, i32 (%struct.AVFormatContext*)*, void (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)* }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque

!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "WtvFileIndex", file: !917, line: 57, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavformat/wtvenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!918 = !{!919, !920, !921, !922, !923, !924, !925, !926, !927}
!919 = !DIEnumerator(name: "WTV_TIMELINE_TABLE_0_HEADER_EVENTS", value: 0)
!920 = !DIEnumerator(name: "WTV_TIMELINE_TABLE_0_ENTRIES_EVENTS", value: 1)
!921 = !DIEnumerator(name: "WTV_TIMELINE", value: 2)
!922 = !DIEnumerator(name: "WTV_TABLE_0_HEADER_LEGACY_ATTRIB", value: 3)
!923 = !DIEnumerator(name: "WTV_TABLE_0_ENTRIES_LEGACY_ATTRIB", value: 4)
!924 = !DIEnumerator(name: "WTV_TABLE_0_REDIRECTOR_LEGACY_ATTRIB", value: 5)
!925 = !DIEnumerator(name: "WTV_TABLE_0_HEADER_TIME", value: 6)
!926 = !DIEnumerator(name: "WTV_TABLE_0_ENTRIES_TIME", value: 7)
!927 = !DIEnumerator(name: "WTV_FILES", value: 8)
!928 = !{!929, !930, !931, !934}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!930 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !932, line: 40, baseType: !933)
!932 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!933 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!934 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!935 = !{!936, !2148, !2155, !2168, !2172, !2176, !2180, !2184}
!936 = distinct !DIGlobalVariable(name: "ff_wtv_muxer", scope: !0, file: !917, line: 834, type: !937, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_wtv_muxer)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !897, line: 624, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !939)
!939 = !{!940, !944, !945, !946, !947, !948, !949, !950, !951, !962, !1003, !1005, !1006, !2113, !2114, !2115, !2119, !2123, !2127, !2128, !2133, !2134, !2135, !2136, !2137, !2138, !2142}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !938, file: !897, line: 498, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !938, file: !897, line: 504, baseType: !941, size: 64, align: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !938, file: !897, line: 505, baseType: !941, size: 64, align: 64, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !938, file: !897, line: 506, baseType: !941, size: 64, align: 64, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !938, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !938, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !938, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !938, file: !897, line: 517, baseType: !934, size: 32, align: 32, offset: 352)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !938, file: !897, line: 523, baseType: !952, size: 64, align: 64, offset: 384)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !957, line: 44, size: 64, align: 32, elements: !958)
!957 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !956, file: !957, line: 45, baseType: !3, size: 32, align: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !956, file: !957, line: 46, baseType: !961, size: 32, align: 32, offset: 32)
!961 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !938, file: !897, line: 526, baseType: !963, size: 64, align: 64, offset: 448)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !967)
!967 = !{!968, !969, !973, !977, !978, !979, !980, !984, !990, !992, !996}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !966, file: !464, line: 72, baseType: !941, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !966, file: !464, line: 78, baseType: !970, size: 64, align: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!941, !929}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !966, file: !464, line: 85, baseType: !974, size: 64, align: 64, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !966, file: !464, line: 93, baseType: !934, size: 32, align: 32, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !966, file: !464, line: 99, baseType: !934, size: 32, align: 32, offset: 224)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !966, file: !464, line: 108, baseType: !934, size: 32, align: 32, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !966, file: !464, line: 113, baseType: !981, size: 64, align: 64, offset: 320)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!929, !929, !929}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !966, file: !464, line: 123, baseType: !985, size: 64, align: 64, offset: 384)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!988, !988}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !966, file: !464, line: 130, baseType: !991, size: 32, align: 32, offset: 448)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !966, file: !464, line: 136, baseType: !993, size: 64, align: 64, offset: 512)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!991, !929}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !966, file: !464, line: 142, baseType: !997, size: 64, align: 64, offset: 576)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!934, !1000, !929, !941, !934}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !938, file: !897, line: 535, baseType: !1004, size: 64, align: 64, offset: 512)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !938, file: !897, line: 539, baseType: !934, size: 32, align: 32, offset: 576)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !938, file: !897, line: 541, baseType: !1007, size: 64, align: 64, offset: 640)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!934, !1010}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1012)
!1012 = !{!1013, !1014, !1112, !1113, !1114, !1180, !1181, !1182, !1967, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2021, !2022, !2023, !2024, !2025, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2076, !2077, !2080, !2081, !2082, !2083, !2084, !2085, !2090, !2091, !2092, !2093, !2101, !2102, !2106, !2110, !2111, !2112}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1011, file: !897, line: 1342, baseType: !963, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1011, file: !897, line: 1349, baseType: !1015, size: 64, align: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1042, !1043, !1083, !1084, !1088, !1093, !1094, !1095, !1099, !1105, !1111}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1016, file: !897, line: 638, baseType: !941, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1016, file: !897, line: 645, baseType: !941, size: 64, align: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1016, file: !897, line: 652, baseType: !934, size: 32, align: 32, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1016, file: !897, line: 659, baseType: !941, size: 64, align: 64, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1016, file: !897, line: 661, baseType: !952, size: 64, align: 64, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1016, file: !897, line: 663, baseType: !963, size: 64, align: 64, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1016, file: !897, line: 670, baseType: !941, size: 64, align: 64, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1016, file: !897, line: 679, baseType: !1015, size: 64, align: 64, offset: 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1016, file: !897, line: 684, baseType: !934, size: 32, align: 32, offset: 512)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1016, file: !897, line: 689, baseType: !934, size: 32, align: 32, offset: 544)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1016, file: !897, line: 696, baseType: !1029, size: 64, align: 64, offset: 576)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!934, !1032}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1035)
!1035 = !{!1036, !1037, !1040, !1041}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1034, file: !897, line: 449, baseType: !941, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1034, file: !897, line: 450, baseType: !1038, size: 64, align: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1034, file: !897, line: 451, baseType: !934, size: 32, align: 32, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1034, file: !897, line: 452, baseType: !941, size: 64, align: 64, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1016, file: !897, line: 703, baseType: !1007, size: 64, align: 64, offset: 640)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1016, file: !897, line: 714, baseType: !1044, size: 64, align: 64, offset: 704)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!934, !1010, !1047}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1050)
!1050 = !{!1051, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1079, !1080, !1081, !1082}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1049, file: !4, line: 1451, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1054, line: 94, baseType: !1055)
!1054 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1054, line: 81, size: 192, align: 64, elements: !1056)
!1056 = !{!1057, !1061, !1064}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1055, file: !1054, line: 82, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1054, line: 73, baseType: !1060)
!1060 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1054, line: 73, flags: DIFlagFwdDecl)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1055, file: !1054, line: 89, baseType: !1062, size: 64, align: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !932, line: 48, baseType: !1039)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1055, file: !1054, line: 93, baseType: !934, size: 32, align: 32, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1049, file: !4, line: 1461, baseType: !931, size: 64, align: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1049, file: !4, line: 1467, baseType: !931, size: 64, align: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1049, file: !4, line: 1468, baseType: !1062, size: 64, align: 64, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1049, file: !4, line: 1469, baseType: !934, size: 32, align: 32, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1049, file: !4, line: 1470, baseType: !934, size: 32, align: 32, offset: 288)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1049, file: !4, line: 1474, baseType: !934, size: 32, align: 32, offset: 320)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1049, file: !4, line: 1479, baseType: !1072, size: 64, align: 64, offset: 384)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1075)
!1075 = !{!1076, !1077, !1078}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1074, file: !4, line: 1412, baseType: !1062, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1074, file: !4, line: 1413, baseType: !934, size: 32, align: 32, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1074, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1049, file: !4, line: 1480, baseType: !934, size: 32, align: 32, offset: 448)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1049, file: !4, line: 1486, baseType: !931, size: 64, align: 64, offset: 512)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1049, file: !4, line: 1488, baseType: !931, size: 64, align: 64, offset: 576)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1049, file: !4, line: 1497, baseType: !931, size: 64, align: 64, offset: 640)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1016, file: !897, line: 720, baseType: !1007, size: 64, align: 64, offset: 768)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1016, file: !897, line: 730, baseType: !1085, size: 64, align: 64, offset: 832)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!934, !1010, !934, !931, !934}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1016, file: !897, line: 737, baseType: !1089, size: 64, align: 64, offset: 896)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!931, !1010, !934, !1092, !931}
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1016, file: !897, line: 744, baseType: !1007, size: 64, align: 64, offset: 960)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1016, file: !897, line: 750, baseType: !1007, size: 64, align: 64, offset: 1024)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1016, file: !897, line: 758, baseType: !1096, size: 64, align: 64, offset: 1088)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!934, !1010, !934, !931, !931, !931, !934}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1016, file: !897, line: 764, baseType: !1100, size: 64, align: 64, offset: 1152)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!934, !1010, !1103}
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1016, file: !897, line: 770, baseType: !1106, size: 64, align: 64, offset: 1216)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!934, !1010, !1109}
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1016, file: !897, line: 776, baseType: !1106, size: 64, align: 64, offset: 1280)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1011, file: !897, line: 1356, baseType: !1004, size: 64, align: 64, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1011, file: !897, line: 1365, baseType: !929, size: 64, align: 64, offset: 192)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1011, file: !897, line: 1379, baseType: !1115, size: 64, align: 64, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !515, line: 352, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !515, line: 161, size: 2112, align: 64, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1122, !1123, !1124, !1125, !1129, !1130, !1134, !1135, !1136, !1137, !1138, !1140, !1141, !1147, !1148, !1152, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1170, !1171, !1172, !1173, !1177, !1178, !1179}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1117, file: !515, line: 174, baseType: !963, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1117, file: !515, line: 226, baseType: !1038, size: 64, align: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1117, file: !515, line: 227, baseType: !934, size: 32, align: 32, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1117, file: !515, line: 228, baseType: !1038, size: 64, align: 64, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1117, file: !515, line: 229, baseType: !1038, size: 64, align: 64, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1117, file: !515, line: 233, baseType: !929, size: 64, align: 64, offset: 320)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1117, file: !515, line: 235, baseType: !1126, size: 64, align: 64, offset: 384)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!934, !929, !1062, !934}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1117, file: !515, line: 236, baseType: !1126, size: 64, align: 64, offset: 448)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1117, file: !515, line: 237, baseType: !1131, size: 64, align: 64, offset: 512)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!931, !929, !931, !934}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1117, file: !515, line: 238, baseType: !931, size: 64, align: 64, offset: 576)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1117, file: !515, line: 239, baseType: !934, size: 32, align: 32, offset: 640)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1117, file: !515, line: 240, baseType: !934, size: 32, align: 32, offset: 672)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1117, file: !515, line: 241, baseType: !934, size: 32, align: 32, offset: 704)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1117, file: !515, line: 242, baseType: !1139, size: 64, align: 64, offset: 768)
!1139 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1117, file: !515, line: 243, baseType: !1038, size: 64, align: 64, offset: 832)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1117, file: !515, line: 244, baseType: !1142, size: 64, align: 64, offset: 896)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!1139, !1139, !1145, !961}
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1063)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1117, file: !515, line: 245, baseType: !934, size: 32, align: 32, offset: 960)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1117, file: !515, line: 249, baseType: !1149, size: 64, align: 64, offset: 1024)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!934, !929, !934}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1117, file: !515, line: 255, baseType: !1153, size: 64, align: 64, offset: 1088)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!931, !929, !934, !931, !934}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1117, file: !515, line: 260, baseType: !934, size: 32, align: 32, offset: 1152)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1117, file: !515, line: 266, baseType: !931, size: 64, align: 64, offset: 1216)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1117, file: !515, line: 273, baseType: !934, size: 32, align: 32, offset: 1280)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1117, file: !515, line: 279, baseType: !931, size: 64, align: 64, offset: 1344)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1117, file: !515, line: 285, baseType: !934, size: 32, align: 32, offset: 1408)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1117, file: !515, line: 291, baseType: !934, size: 32, align: 32, offset: 1440)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1117, file: !515, line: 298, baseType: !934, size: 32, align: 32, offset: 1472)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1117, file: !515, line: 304, baseType: !934, size: 32, align: 32, offset: 1504)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1117, file: !515, line: 309, baseType: !941, size: 64, align: 64, offset: 1536)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1117, file: !515, line: 314, baseType: !941, size: 64, align: 64, offset: 1600)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1117, file: !515, line: 319, baseType: !1167, size: 64, align: 64, offset: 1664)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!934, !929, !1062, !934, !514, !931}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1117, file: !515, line: 326, baseType: !934, size: 32, align: 32, offset: 1728)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1117, file: !515, line: 331, baseType: !514, size: 32, align: 32, offset: 1760)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1117, file: !515, line: 332, baseType: !931, size: 64, align: 64, offset: 1792)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1117, file: !515, line: 338, baseType: !1174, size: 64, align: 64, offset: 1856)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!934, !929}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1117, file: !515, line: 340, baseType: !931, size: 64, align: 64, offset: 1920)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1117, file: !515, line: 346, baseType: !1038, size: 64, align: 64, offset: 1984)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1117, file: !515, line: 351, baseType: !934, size: 32, align: 32, offset: 2048)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1011, file: !897, line: 1386, baseType: !934, size: 32, align: 32, offset: 320)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1011, file: !897, line: 1393, baseType: !961, size: 32, align: 32, offset: 352)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1011, file: !897, line: 1405, baseType: !1183, size: 64, align: 64, offset: 384)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1187)
!1187 = !{!1188, !1189, !1190, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1753, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1853, !1859, !1860, !1864, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1896, !1897, !1898, !1899, !1900, !1901}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1186, file: !897, line: 866, baseType: !934, size: 32, align: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1186, file: !897, line: 872, baseType: !934, size: 32, align: 32, offset: 32)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1186, file: !897, line: 878, baseType: !1191, size: 64, align: 64, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1194)
!1194 = !{!1195, !1196, !1197, !1198, !1428, !1429, !1430, !1431, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1457, !1461, !1462, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1641, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1193, file: !4, line: 1561, baseType: !963, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1193, file: !4, line: 1562, baseType: !934, size: 32, align: 32, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1193, file: !4, line: 1564, baseType: !523, size: 32, align: 32, offset: 96)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1193, file: !4, line: 1565, baseType: !1199, size: 64, align: 64, offset: 128)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1202)
!1202 = !{!1203, !1204, !1205, !1206, !1207, !1208, !1217, !1220, !1223, !1226, !1230, !1231, !1232, !1240, !1241, !1242, !1244, !1248, !1254, !1259, !1263, !1264, !1312, !1399, !1403, !1404, !1408, !1412, !1417, !1421, !1422, !1423}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1201, file: !4, line: 3475, baseType: !941, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1201, file: !4, line: 3480, baseType: !941, size: 64, align: 64, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1201, file: !4, line: 3481, baseType: !523, size: 32, align: 32, offset: 128)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1201, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1201, file: !4, line: 3487, baseType: !934, size: 32, align: 32, offset: 192)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1201, file: !4, line: 3488, baseType: !1209, size: 64, align: 64, offset: 256)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1211)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1212, line: 61, baseType: !1213)
!1212 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1212, line: 58, size: 64, align: 32, elements: !1214)
!1214 = !{!1215, !1216}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1213, file: !1212, line: 59, baseType: !934, size: 32, align: 32)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1213, file: !1212, line: 60, baseType: !934, size: 32, align: 32, offset: 32)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1201, file: !4, line: 3489, baseType: !1218, size: 64, align: 64, offset: 320)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1201, file: !4, line: 3490, baseType: !1221, size: 64, align: 64, offset: 384)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1201, file: !4, line: 3491, baseType: !1224, size: 64, align: 64, offset: 448)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1201, file: !4, line: 3492, baseType: !1227, size: 64, align: 64, offset: 512)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1229)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !932, line: 55, baseType: !1139)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1201, file: !4, line: 3493, baseType: !1063, size: 8, align: 8, offset: 576)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1201, file: !4, line: 3494, baseType: !963, size: 64, align: 64, offset: 640)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1201, file: !4, line: 3495, baseType: !1233, size: 64, align: 64, offset: 704)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1235)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1236)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1237)
!1237 = !{!1238, !1239}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1236, file: !4, line: 3402, baseType: !934, size: 32, align: 32)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1236, file: !4, line: 3403, baseType: !941, size: 64, align: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1201, file: !4, line: 3507, baseType: !941, size: 64, align: 64, offset: 768)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1201, file: !4, line: 3516, baseType: !934, size: 32, align: 32, offset: 832)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1201, file: !4, line: 3517, baseType: !1243, size: 64, align: 64, offset: 896)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1201, file: !4, line: 3527, baseType: !1245, size: 64, align: 64, offset: 960)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!934, !1191}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1201, file: !4, line: 3535, baseType: !1249, size: 64, align: 64, offset: 1024)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!934, !1191, !1252}
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1192)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1201, file: !4, line: 3541, baseType: !1255, size: 64, align: 64, offset: 1088)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1257)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1258)
!1258 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1201, file: !4, line: 3549, baseType: !1260, size: 64, align: 64, offset: 1152)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{null, !1243}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1201, file: !4, line: 3551, baseType: !1245, size: 64, align: 64, offset: 1216)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1201, file: !4, line: 3552, baseType: !1265, size: 64, align: 64, offset: 1280)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!934, !1191, !1062, !934, !1268}
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1271)
!1271 = !{!1272, !1275, !1277, !1278, !1279, !1311}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1270, file: !4, line: 3921, baseType: !1273, size: 16, align: 16)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !932, line: 49, baseType: !1274)
!1274 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1270, file: !4, line: 3922, baseType: !1276, size: 32, align: 32, offset: 32)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !932, line: 51, baseType: !961)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1270, file: !4, line: 3923, baseType: !1276, size: 32, align: 32, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1270, file: !4, line: 3924, baseType: !961, size: 32, align: 32, offset: 96)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1270, file: !4, line: 3925, baseType: !1280, size: 64, align: 64, offset: 128)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1283)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1284)
!1284 = !{!1285, !1286, !1287, !1288, !1289, !1290, !1300, !1304, !1306, !1307, !1309, !1310}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1283, file: !4, line: 3886, baseType: !934, size: 32, align: 32)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1283, file: !4, line: 3887, baseType: !934, size: 32, align: 32, offset: 32)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1283, file: !4, line: 3888, baseType: !934, size: 32, align: 32, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1283, file: !4, line: 3889, baseType: !934, size: 32, align: 32, offset: 96)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1283, file: !4, line: 3890, baseType: !934, size: 32, align: 32, offset: 128)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1283, file: !4, line: 3897, baseType: !1291, size: 768, align: 64, offset: 192)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1293)
!1293 = !{!1294, !1298}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1292, file: !4, line: 3855, baseType: !1295, size: 512, align: 64)
!1295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 512, align: 64, elements: !1296)
!1296 = !{!1297}
!1297 = !DISubrange(count: 8)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1292, file: !4, line: 3857, baseType: !1299, size: 256, align: 32, offset: 512)
!1299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 256, align: 32, elements: !1296)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1283, file: !4, line: 3903, baseType: !1301, size: 256, align: 64, offset: 960)
!1301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 256, align: 64, elements: !1302)
!1302 = !{!1303}
!1303 = !DISubrange(count: 4)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1283, file: !4, line: 3904, baseType: !1305, size: 128, align: 32, offset: 1216)
!1305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 128, align: 32, elements: !1302)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1283, file: !4, line: 3906, baseType: !750, size: 32, align: 32, offset: 1344)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1283, file: !4, line: 3908, baseType: !1308, size: 64, align: 64, offset: 1408)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1283, file: !4, line: 3915, baseType: !1308, size: 64, align: 64, offset: 1472)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1283, file: !4, line: 3917, baseType: !934, size: 32, align: 32, offset: 1536)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1270, file: !4, line: 3926, baseType: !931, size: 64, align: 64, offset: 192)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1201, file: !4, line: 3564, baseType: !1313, size: 64, align: 64, offset: 1344)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!934, !1191, !1047, !1316, !1398}
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1318)
!1318 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !767, line: 646, baseType: !1319)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !767, line: 268, size: 4288, align: 64, elements: !1320)
!1320 = !{!1321, !1322, !1323, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1350, !1352, !1353, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1386, !1387, !1388, !1389, !1390, !1391, !1394, !1395, !1396, !1397}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1319, file: !767, line: 282, baseType: !1295, size: 512, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1319, file: !767, line: 299, baseType: !1299, size: 256, align: 32, offset: 512)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1319, file: !767, line: 315, baseType: !1324, size: 64, align: 64, offset: 768)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1319, file: !767, line: 326, baseType: !934, size: 32, align: 32, offset: 832)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1319, file: !767, line: 326, baseType: !934, size: 32, align: 32, offset: 864)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1319, file: !767, line: 334, baseType: !934, size: 32, align: 32, offset: 896)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1319, file: !767, line: 341, baseType: !934, size: 32, align: 32, offset: 928)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1319, file: !767, line: 346, baseType: !934, size: 32, align: 32, offset: 960)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1319, file: !767, line: 351, baseType: !756, size: 32, align: 32, offset: 992)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1319, file: !767, line: 356, baseType: !1211, size: 64, align: 32, offset: 1024)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1319, file: !767, line: 361, baseType: !931, size: 64, align: 64, offset: 1088)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1319, file: !767, line: 369, baseType: !931, size: 64, align: 64, offset: 1152)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1319, file: !767, line: 377, baseType: !931, size: 64, align: 64, offset: 1216)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1319, file: !767, line: 382, baseType: !934, size: 32, align: 32, offset: 1280)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1319, file: !767, line: 386, baseType: !934, size: 32, align: 32, offset: 1312)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1319, file: !767, line: 391, baseType: !934, size: 32, align: 32, offset: 1344)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1319, file: !767, line: 396, baseType: !929, size: 64, align: 64, offset: 1408)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1319, file: !767, line: 403, baseType: !1340, size: 512, align: 64, offset: 1472)
!1340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1229, size: 512, align: 64, elements: !1296)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1319, file: !767, line: 410, baseType: !934, size: 32, align: 32, offset: 1984)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1319, file: !767, line: 415, baseType: !934, size: 32, align: 32, offset: 2016)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1319, file: !767, line: 420, baseType: !934, size: 32, align: 32, offset: 2048)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1319, file: !767, line: 425, baseType: !934, size: 32, align: 32, offset: 2080)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1319, file: !767, line: 435, baseType: !931, size: 64, align: 64, offset: 2112)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1319, file: !767, line: 440, baseType: !934, size: 32, align: 32, offset: 2176)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1319, file: !767, line: 445, baseType: !1229, size: 64, align: 64, offset: 2240)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1319, file: !767, line: 459, baseType: !1349, size: 512, align: 64, offset: 2304)
!1349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 512, align: 64, elements: !1296)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1319, file: !767, line: 473, baseType: !1351, size: 64, align: 64, offset: 2816)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1319, file: !767, line: 477, baseType: !934, size: 32, align: 32, offset: 2880)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1319, file: !767, line: 479, baseType: !1354, size: 64, align: 64, offset: 2944)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !767, line: 207, baseType: !1357)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !767, line: 201, size: 320, align: 64, elements: !1358)
!1358 = !{!1359, !1360, !1361, !1362, !1367}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1357, file: !767, line: 202, baseType: !766, size: 32, align: 32)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1357, file: !767, line: 203, baseType: !1062, size: 64, align: 64, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1357, file: !767, line: 204, baseType: !934, size: 32, align: 32, offset: 128)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1357, file: !767, line: 205, baseType: !1363, size: 64, align: 64, offset: 192)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1365, line: 86, baseType: !1366)
!1365 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1366 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1365, line: 86, flags: DIFlagFwdDecl)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1357, file: !767, line: 206, baseType: !1052, size: 64, align: 64, offset: 256)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1319, file: !767, line: 480, baseType: !934, size: 32, align: 32, offset: 3008)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1319, file: !767, line: 505, baseType: !934, size: 32, align: 32, offset: 3040)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1319, file: !767, line: 512, baseType: !790, size: 32, align: 32, offset: 3072)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1319, file: !767, line: 514, baseType: !796, size: 32, align: 32, offset: 3104)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1319, file: !767, line: 516, baseType: !814, size: 32, align: 32, offset: 3136)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1319, file: !767, line: 523, baseType: !838, size: 32, align: 32, offset: 3168)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1319, file: !767, line: 525, baseType: !857, size: 32, align: 32, offset: 3200)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1319, file: !767, line: 532, baseType: !931, size: 64, align: 64, offset: 3264)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1319, file: !767, line: 539, baseType: !931, size: 64, align: 64, offset: 3328)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1319, file: !767, line: 547, baseType: !931, size: 64, align: 64, offset: 3392)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1319, file: !767, line: 554, baseType: !1363, size: 64, align: 64, offset: 3456)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1319, file: !767, line: 563, baseType: !934, size: 32, align: 32, offset: 3520)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1319, file: !767, line: 572, baseType: !934, size: 32, align: 32, offset: 3552)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1319, file: !767, line: 581, baseType: !934, size: 32, align: 32, offset: 3584)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1319, file: !767, line: 588, baseType: !1383, size: 64, align: 64, offset: 3648)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !932, line: 36, baseType: !1385)
!1385 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1319, file: !767, line: 593, baseType: !934, size: 32, align: 32, offset: 3712)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1319, file: !767, line: 596, baseType: !934, size: 32, align: 32, offset: 3744)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1319, file: !767, line: 599, baseType: !1052, size: 64, align: 64, offset: 3776)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1319, file: !767, line: 605, baseType: !1052, size: 64, align: 64, offset: 3840)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1319, file: !767, line: 616, baseType: !1052, size: 64, align: 64, offset: 3904)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1319, file: !767, line: 626, baseType: !1392, size: 64, align: 64, offset: 3968)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1393, line: 216, baseType: !1139)
!1393 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1319, file: !767, line: 627, baseType: !1392, size: 64, align: 64, offset: 4032)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1319, file: !767, line: 628, baseType: !1392, size: 64, align: 64, offset: 4096)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1319, file: !767, line: 629, baseType: !1392, size: 64, align: 64, offset: 4160)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1319, file: !767, line: 645, baseType: !1052, size: 64, align: 64, offset: 4224)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1201, file: !4, line: 3566, baseType: !1400, size: 64, align: 64, offset: 1408)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DISubroutineType(types: !1402)
!1402 = !{!934, !1191, !929, !1398, !1047}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1201, file: !4, line: 3567, baseType: !1245, size: 64, align: 64, offset: 1472)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1201, file: !4, line: 3576, baseType: !1405, size: 64, align: 64, offset: 1536)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{!934, !1191, !1316}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1201, file: !4, line: 3577, baseType: !1409, size: 64, align: 64, offset: 1600)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{!934, !1191, !1047}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1201, file: !4, line: 3584, baseType: !1413, size: 64, align: 64, offset: 1664)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DISubroutineType(types: !1415)
!1415 = !{!934, !1191, !1416}
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1201, file: !4, line: 3589, baseType: !1418, size: 64, align: 64, offset: 1728)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{null, !1191}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1201, file: !4, line: 3594, baseType: !934, size: 32, align: 32, offset: 1792)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1201, file: !4, line: 3600, baseType: !941, size: 64, align: 64, offset: 1856)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1201, file: !4, line: 3609, baseType: !1424, size: 64, align: 64, offset: 1920)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1427)
!1427 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1193, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1193, file: !4, line: 1581, baseType: !961, size: 32, align: 32, offset: 224)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1193, file: !4, line: 1583, baseType: !929, size: 64, align: 64, offset: 256)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1193, file: !4, line: 1591, baseType: !1432, size: 64, align: 64, offset: 320)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1193, file: !4, line: 1598, baseType: !929, size: 64, align: 64, offset: 384)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1193, file: !4, line: 1606, baseType: !931, size: 64, align: 64, offset: 448)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1193, file: !4, line: 1614, baseType: !934, size: 32, align: 32, offset: 512)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1193, file: !4, line: 1622, baseType: !934, size: 32, align: 32, offset: 544)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1193, file: !4, line: 1628, baseType: !934, size: 32, align: 32, offset: 576)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1193, file: !4, line: 1636, baseType: !934, size: 32, align: 32, offset: 608)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1193, file: !4, line: 1643, baseType: !934, size: 32, align: 32, offset: 640)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1193, file: !4, line: 1657, baseType: !1062, size: 64, align: 64, offset: 704)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1193, file: !4, line: 1658, baseType: !934, size: 32, align: 32, offset: 768)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1193, file: !4, line: 1679, baseType: !1211, size: 64, align: 32, offset: 800)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1193, file: !4, line: 1688, baseType: !934, size: 32, align: 32, offset: 864)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1193, file: !4, line: 1712, baseType: !934, size: 32, align: 32, offset: 896)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1193, file: !4, line: 1729, baseType: !934, size: 32, align: 32, offset: 928)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1193, file: !4, line: 1729, baseType: !934, size: 32, align: 32, offset: 960)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1193, file: !4, line: 1744, baseType: !934, size: 32, align: 32, offset: 992)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1193, file: !4, line: 1744, baseType: !934, size: 32, align: 32, offset: 1024)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1193, file: !4, line: 1751, baseType: !934, size: 32, align: 32, offset: 1056)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1193, file: !4, line: 1766, baseType: !533, size: 32, align: 32, offset: 1088)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1193, file: !4, line: 1791, baseType: !1453, size: 64, align: 64, offset: 1152)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{null, !1456, !1316, !1398, !934, !934, !934}
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1193, file: !4, line: 1808, baseType: !1458, size: 64, align: 64, offset: 1216)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{!533, !1456, !1218}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1193, file: !4, line: 1816, baseType: !934, size: 32, align: 32, offset: 1280)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1193, file: !4, line: 1825, baseType: !1463, size: 32, align: 32, offset: 1312)
!1463 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1193, file: !4, line: 1830, baseType: !934, size: 32, align: 32, offset: 1344)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1193, file: !4, line: 1838, baseType: !1463, size: 32, align: 32, offset: 1376)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1193, file: !4, line: 1846, baseType: !934, size: 32, align: 32, offset: 1408)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1193, file: !4, line: 1851, baseType: !934, size: 32, align: 32, offset: 1440)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1193, file: !4, line: 1861, baseType: !1463, size: 32, align: 32, offset: 1472)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1193, file: !4, line: 1868, baseType: !1463, size: 32, align: 32, offset: 1504)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1193, file: !4, line: 1875, baseType: !1463, size: 32, align: 32, offset: 1536)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1193, file: !4, line: 1882, baseType: !1463, size: 32, align: 32, offset: 1568)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1193, file: !4, line: 1889, baseType: !1463, size: 32, align: 32, offset: 1600)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1193, file: !4, line: 1896, baseType: !1463, size: 32, align: 32, offset: 1632)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1193, file: !4, line: 1903, baseType: !1463, size: 32, align: 32, offset: 1664)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1193, file: !4, line: 1910, baseType: !934, size: 32, align: 32, offset: 1696)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1193, file: !4, line: 1915, baseType: !934, size: 32, align: 32, offset: 1728)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1193, file: !4, line: 1926, baseType: !1398, size: 64, align: 64, offset: 1792)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1193, file: !4, line: 1935, baseType: !1211, size: 64, align: 32, offset: 1856)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1193, file: !4, line: 1942, baseType: !934, size: 32, align: 32, offset: 1920)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1193, file: !4, line: 1948, baseType: !934, size: 32, align: 32, offset: 1952)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1193, file: !4, line: 1954, baseType: !934, size: 32, align: 32, offset: 1984)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1193, file: !4, line: 1960, baseType: !934, size: 32, align: 32, offset: 2016)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1193, file: !4, line: 1984, baseType: !934, size: 32, align: 32, offset: 2048)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1193, file: !4, line: 1991, baseType: !934, size: 32, align: 32, offset: 2080)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1193, file: !4, line: 1996, baseType: !934, size: 32, align: 32, offset: 2112)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1193, file: !4, line: 2004, baseType: !934, size: 32, align: 32, offset: 2144)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1193, file: !4, line: 2011, baseType: !934, size: 32, align: 32, offset: 2176)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1193, file: !4, line: 2018, baseType: !934, size: 32, align: 32, offset: 2208)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1193, file: !4, line: 2027, baseType: !934, size: 32, align: 32, offset: 2240)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1193, file: !4, line: 2034, baseType: !934, size: 32, align: 32, offset: 2272)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1193, file: !4, line: 2044, baseType: !934, size: 32, align: 32, offset: 2304)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1193, file: !4, line: 2054, baseType: !1493, size: 64, align: 64, offset: 2368)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1193, file: !4, line: 2061, baseType: !1493, size: 64, align: 64, offset: 2432)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1193, file: !4, line: 2066, baseType: !934, size: 32, align: 32, offset: 2496)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1193, file: !4, line: 2070, baseType: !934, size: 32, align: 32, offset: 2528)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1193, file: !4, line: 2078, baseType: !934, size: 32, align: 32, offset: 2560)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1193, file: !4, line: 2085, baseType: !934, size: 32, align: 32, offset: 2592)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1193, file: !4, line: 2092, baseType: !934, size: 32, align: 32, offset: 2624)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1193, file: !4, line: 2099, baseType: !934, size: 32, align: 32, offset: 2656)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1193, file: !4, line: 2106, baseType: !934, size: 32, align: 32, offset: 2688)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1193, file: !4, line: 2113, baseType: !934, size: 32, align: 32, offset: 2720)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1193, file: !4, line: 2120, baseType: !934, size: 32, align: 32, offset: 2752)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1193, file: !4, line: 2125, baseType: !934, size: 32, align: 32, offset: 2784)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1193, file: !4, line: 2133, baseType: !934, size: 32, align: 32, offset: 2816)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1193, file: !4, line: 2140, baseType: !934, size: 32, align: 32, offset: 2848)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1193, file: !4, line: 2145, baseType: !934, size: 32, align: 32, offset: 2880)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1193, file: !4, line: 2153, baseType: !934, size: 32, align: 32, offset: 2912)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1193, file: !4, line: 2158, baseType: !934, size: 32, align: 32, offset: 2944)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1193, file: !4, line: 2166, baseType: !796, size: 32, align: 32, offset: 2976)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1193, file: !4, line: 2173, baseType: !814, size: 32, align: 32, offset: 3008)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1193, file: !4, line: 2180, baseType: !838, size: 32, align: 32, offset: 3040)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1193, file: !4, line: 2187, baseType: !790, size: 32, align: 32, offset: 3072)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1193, file: !4, line: 2194, baseType: !857, size: 32, align: 32, offset: 3104)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1193, file: !4, line: 2203, baseType: !934, size: 32, align: 32, offset: 3136)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1193, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1193, file: !4, line: 2212, baseType: !934, size: 32, align: 32, offset: 3200)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1193, file: !4, line: 2213, baseType: !934, size: 32, align: 32, offset: 3232)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1193, file: !4, line: 2220, baseType: !733, size: 32, align: 32, offset: 3264)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1193, file: !4, line: 2232, baseType: !934, size: 32, align: 32, offset: 3296)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1193, file: !4, line: 2243, baseType: !934, size: 32, align: 32, offset: 3328)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1193, file: !4, line: 2249, baseType: !934, size: 32, align: 32, offset: 3360)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1193, file: !4, line: 2256, baseType: !934, size: 32, align: 32, offset: 3392)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1193, file: !4, line: 2263, baseType: !1229, size: 64, align: 64, offset: 3456)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1193, file: !4, line: 2270, baseType: !1229, size: 64, align: 64, offset: 3520)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1193, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1193, file: !4, line: 2285, baseType: !733, size: 32, align: 32, offset: 3616)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1193, file: !4, line: 2367, baseType: !1529, size: 64, align: 64, offset: 3648)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!934, !1456, !1416, !934}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1193, file: !4, line: 2383, baseType: !934, size: 32, align: 32, offset: 3712)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1193, file: !4, line: 2386, baseType: !1463, size: 32, align: 32, offset: 3744)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1193, file: !4, line: 2387, baseType: !1463, size: 32, align: 32, offset: 3776)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1193, file: !4, line: 2394, baseType: !934, size: 32, align: 32, offset: 3808)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1193, file: !4, line: 2401, baseType: !934, size: 32, align: 32, offset: 3840)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1193, file: !4, line: 2408, baseType: !934, size: 32, align: 32, offset: 3872)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1193, file: !4, line: 2415, baseType: !934, size: 32, align: 32, offset: 3904)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1193, file: !4, line: 2422, baseType: !934, size: 32, align: 32, offset: 3936)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1193, file: !4, line: 2423, baseType: !1541, size: 64, align: 64, offset: 3968)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1543)
!1543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1544)
!1544 = !{!1545, !1546, !1547, !1548}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1543, file: !4, line: 827, baseType: !934, size: 32, align: 32)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1543, file: !4, line: 828, baseType: !934, size: 32, align: 32, offset: 32)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1543, file: !4, line: 829, baseType: !934, size: 32, align: 32, offset: 64)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1543, file: !4, line: 830, baseType: !1463, size: 32, align: 32, offset: 96)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1193, file: !4, line: 2430, baseType: !931, size: 64, align: 64, offset: 4032)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1193, file: !4, line: 2437, baseType: !931, size: 64, align: 64, offset: 4096)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1193, file: !4, line: 2444, baseType: !1463, size: 32, align: 32, offset: 4160)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1193, file: !4, line: 2451, baseType: !1463, size: 32, align: 32, offset: 4192)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1193, file: !4, line: 2458, baseType: !934, size: 32, align: 32, offset: 4224)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1193, file: !4, line: 2469, baseType: !934, size: 32, align: 32, offset: 4256)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1193, file: !4, line: 2475, baseType: !934, size: 32, align: 32, offset: 4288)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1193, file: !4, line: 2481, baseType: !934, size: 32, align: 32, offset: 4320)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1193, file: !4, line: 2485, baseType: !934, size: 32, align: 32, offset: 4352)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1193, file: !4, line: 2489, baseType: !934, size: 32, align: 32, offset: 4384)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1193, file: !4, line: 2493, baseType: !934, size: 32, align: 32, offset: 4416)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1193, file: !4, line: 2501, baseType: !934, size: 32, align: 32, offset: 4448)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1193, file: !4, line: 2506, baseType: !934, size: 32, align: 32, offset: 4480)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1193, file: !4, line: 2510, baseType: !934, size: 32, align: 32, offset: 4512)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1193, file: !4, line: 2514, baseType: !931, size: 64, align: 64, offset: 4544)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1193, file: !4, line: 2528, baseType: !1565, size: 64, align: 64, offset: 4608)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64, align: 64)
!1566 = !DISubroutineType(types: !1567)
!1567 = !{null, !1456, !929, !934, !934}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1193, file: !4, line: 2534, baseType: !934, size: 32, align: 32, offset: 4672)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1193, file: !4, line: 2545, baseType: !934, size: 32, align: 32, offset: 4704)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1193, file: !4, line: 2547, baseType: !934, size: 32, align: 32, offset: 4736)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1193, file: !4, line: 2549, baseType: !934, size: 32, align: 32, offset: 4768)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1193, file: !4, line: 2551, baseType: !934, size: 32, align: 32, offset: 4800)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1193, file: !4, line: 2553, baseType: !934, size: 32, align: 32, offset: 4832)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1193, file: !4, line: 2555, baseType: !934, size: 32, align: 32, offset: 4864)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1193, file: !4, line: 2557, baseType: !934, size: 32, align: 32, offset: 4896)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1193, file: !4, line: 2559, baseType: !934, size: 32, align: 32, offset: 4928)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1193, file: !4, line: 2563, baseType: !934, size: 32, align: 32, offset: 4960)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1193, file: !4, line: 2571, baseType: !1308, size: 64, align: 64, offset: 4992)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1193, file: !4, line: 2579, baseType: !1308, size: 64, align: 64, offset: 5056)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1193, file: !4, line: 2586, baseType: !934, size: 32, align: 32, offset: 5120)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1193, file: !4, line: 2615, baseType: !934, size: 32, align: 32, offset: 5152)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1193, file: !4, line: 2627, baseType: !934, size: 32, align: 32, offset: 5184)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1193, file: !4, line: 2637, baseType: !934, size: 32, align: 32, offset: 5216)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1193, file: !4, line: 2681, baseType: !934, size: 32, align: 32, offset: 5248)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1193, file: !4, line: 2709, baseType: !931, size: 64, align: 64, offset: 5312)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1193, file: !4, line: 2716, baseType: !1587, size: 64, align: 64, offset: 5376)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64, align: 64)
!1588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1589)
!1589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1590)
!1590 = !{!1591, !1592, !1593, !1594, !1595, !1596, !1597, !1601, !1605, !1606, !1607, !1608, !1614, !1615, !1616, !1617, !1618}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1589, file: !4, line: 3642, baseType: !941, size: 64, align: 64)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1589, file: !4, line: 3649, baseType: !523, size: 32, align: 32, offset: 64)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1589, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1589, file: !4, line: 3663, baseType: !533, size: 32, align: 32, offset: 128)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1589, file: !4, line: 3669, baseType: !934, size: 32, align: 32, offset: 160)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1589, file: !4, line: 3682, baseType: !1413, size: 64, align: 64, offset: 192)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1589, file: !4, line: 3698, baseType: !1598, size: 64, align: 64, offset: 256)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DISubroutineType(types: !1600)
!1600 = !{!934, !1191, !1145, !1276}
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1589, file: !4, line: 3712, baseType: !1602, size: 64, align: 64, offset: 320)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DISubroutineType(types: !1604)
!1604 = !{!934, !1191, !934, !1145, !1276}
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1589, file: !4, line: 3726, baseType: !1598, size: 64, align: 64, offset: 384)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1589, file: !4, line: 3737, baseType: !1245, size: 64, align: 64, offset: 448)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1589, file: !4, line: 3746, baseType: !934, size: 32, align: 32, offset: 512)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1589, file: !4, line: 3757, baseType: !1609, size: 64, align: 64, offset: 576)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DISubroutineType(types: !1611)
!1611 = !{null, !1612}
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1589, file: !4, line: 3766, baseType: !1245, size: 64, align: 64, offset: 640)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1589, file: !4, line: 3774, baseType: !1245, size: 64, align: 64, offset: 704)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1589, file: !4, line: 3780, baseType: !934, size: 32, align: 32, offset: 768)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1589, file: !4, line: 3785, baseType: !934, size: 32, align: 32, offset: 800)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1589, file: !4, line: 3795, baseType: !1619, size: 64, align: 64, offset: 832)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DISubroutineType(types: !1621)
!1621 = !{!934, !1191, !1052}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1193, file: !4, line: 2728, baseType: !929, size: 64, align: 64, offset: 5440)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1193, file: !4, line: 2735, baseType: !1340, size: 512, align: 64, offset: 5504)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1193, file: !4, line: 2742, baseType: !934, size: 32, align: 32, offset: 6016)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1193, file: !4, line: 2755, baseType: !934, size: 32, align: 32, offset: 6048)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1193, file: !4, line: 2776, baseType: !934, size: 32, align: 32, offset: 6080)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1193, file: !4, line: 2783, baseType: !934, size: 32, align: 32, offset: 6112)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1193, file: !4, line: 2791, baseType: !934, size: 32, align: 32, offset: 6144)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1193, file: !4, line: 2802, baseType: !1416, size: 64, align: 64, offset: 6208)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1193, file: !4, line: 2811, baseType: !934, size: 32, align: 32, offset: 6272)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1193, file: !4, line: 2821, baseType: !934, size: 32, align: 32, offset: 6304)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1193, file: !4, line: 2830, baseType: !934, size: 32, align: 32, offset: 6336)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1193, file: !4, line: 2840, baseType: !934, size: 32, align: 32, offset: 6368)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1193, file: !4, line: 2851, baseType: !1635, size: 64, align: 64, offset: 6400)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{!934, !1456, !1638, !929, !1398, !934, !934}
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DISubroutineType(types: !1640)
!1640 = !{!934, !1456, !929}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1193, file: !4, line: 2871, baseType: !1642, size: 64, align: 64, offset: 6464)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{!934, !1456, !1645, !929, !1398, !934}
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{!934, !1456, !929, !934, !934}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1193, file: !4, line: 2878, baseType: !934, size: 32, align: 32, offset: 6528)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1193, file: !4, line: 2885, baseType: !934, size: 32, align: 32, offset: 6560)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1193, file: !4, line: 3005, baseType: !934, size: 32, align: 32, offset: 6592)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1193, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1193, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1193, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1193, file: !4, line: 3037, baseType: !1062, size: 64, align: 64, offset: 6720)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1193, file: !4, line: 3038, baseType: !934, size: 32, align: 32, offset: 6784)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1193, file: !4, line: 3050, baseType: !1229, size: 64, align: 64, offset: 6848)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1193, file: !4, line: 3065, baseType: !934, size: 32, align: 32, offset: 6912)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1193, file: !4, line: 3083, baseType: !934, size: 32, align: 32, offset: 6944)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1193, file: !4, line: 3092, baseType: !1211, size: 64, align: 32, offset: 6976)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1193, file: !4, line: 3099, baseType: !533, size: 32, align: 32, offset: 7040)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1193, file: !4, line: 3106, baseType: !1211, size: 64, align: 32, offset: 7072)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1193, file: !4, line: 3113, baseType: !1663, size: 64, align: 64, offset: 7168)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1665)
!1665 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1666)
!1666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1667)
!1667 = !{!1668, !1669, !1670, !1671, !1672, !1673, !1676}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1666, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1666, file: !4, line: 714, baseType: !523, size: 32, align: 32, offset: 32)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1666, file: !4, line: 720, baseType: !941, size: 64, align: 64, offset: 64)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1666, file: !4, line: 724, baseType: !941, size: 64, align: 64, offset: 128)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1666, file: !4, line: 728, baseType: !934, size: 32, align: 32, offset: 192)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1666, file: !4, line: 734, baseType: !1674, size: 64, align: 64, offset: 256)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1666, file: !4, line: 739, baseType: !1677, size: 64, align: 64, offset: 320)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1236)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1193, file: !4, line: 3129, baseType: !931, size: 64, align: 64, offset: 7232)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1193, file: !4, line: 3130, baseType: !931, size: 64, align: 64, offset: 7296)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1193, file: !4, line: 3131, baseType: !931, size: 64, align: 64, offset: 7360)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1193, file: !4, line: 3132, baseType: !931, size: 64, align: 64, offset: 7424)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1193, file: !4, line: 3139, baseType: !1308, size: 64, align: 64, offset: 7488)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1193, file: !4, line: 3147, baseType: !934, size: 32, align: 32, offset: 7552)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1193, file: !4, line: 3165, baseType: !934, size: 32, align: 32, offset: 7584)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1193, file: !4, line: 3172, baseType: !934, size: 32, align: 32, offset: 7616)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1193, file: !4, line: 3180, baseType: !934, size: 32, align: 32, offset: 7648)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1193, file: !4, line: 3191, baseType: !1493, size: 64, align: 64, offset: 7680)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1193, file: !4, line: 3199, baseType: !1062, size: 64, align: 64, offset: 7744)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1193, file: !4, line: 3207, baseType: !1308, size: 64, align: 64, offset: 7808)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1193, file: !4, line: 3214, baseType: !961, size: 32, align: 32, offset: 7872)
