; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--hcom.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--hcom.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProbeData = type { i8*, i8*, i32, i8* }

!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !918, !919, !927}
!917 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!918 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !921, line: 222, size: 16, align: 8, elements: !922)
!921 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!922 = !{!923}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !920, file: !921, line: 222, baseType: !924, size: 16, align: 16)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !925, line: 49, baseType: !926)
!925 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!926 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!928 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !921, line: 221, size: 32, align: 8, elements: !929)
!929 = !{!930}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !928, file: !921, line: 221, baseType: !931, size: 32, align: 32)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !925, line: 51, baseType: !918)
!932 = !{!933}
!933 = distinct !DIGlobalVariable(name: "ff_hcom_demuxer", scope: !0, file: !934, line: 85, type: !935, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_hcom_demuxer)
!934 = !DIFile(filename: "libavformat/hcom.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !897, line: 777, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !937)
!937 = !{!938, !942, !943, !944, !945, !955, !997, !998, !1000, !1001, !1002, !1016, !2186, !2187, !2188, !2192, !2196, !2197, !2198, !2202, !2203, !2204}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !936, file: !897, line: 638, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !936, file: !897, line: 645, baseType: !939, size: 64, align: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !936, file: !897, line: 652, baseType: !917, size: 32, align: 32, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !936, file: !897, line: 659, baseType: !939, size: 64, align: 64, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !936, file: !897, line: 661, baseType: !946, size: 64, align: 64, offset: 256)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !951, line: 44, size: 64, align: 32, elements: !952)
!951 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !950, file: !951, line: 45, baseType: !3, size: 32, align: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !950, file: !951, line: 46, baseType: !918, size: 32, align: 32, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !936, file: !897, line: 663, baseType: !956, size: 64, align: 64, offset: 320)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !960)
!960 = !{!961, !962, !967, !971, !972, !973, !974, !978, !984, !986, !990}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !959, file: !464, line: 72, baseType: !939, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !959, file: !464, line: 78, baseType: !963, size: 64, align: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!939, !966}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !959, file: !464, line: 85, baseType: !968, size: 64, align: 64, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !959, file: !464, line: 93, baseType: !917, size: 32, align: 32, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !959, file: !464, line: 99, baseType: !917, size: 32, align: 32, offset: 224)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !959, file: !464, line: 108, baseType: !917, size: 32, align: 32, offset: 256)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !959, file: !464, line: 113, baseType: !975, size: 64, align: 64, offset: 320)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!966, !966, !966}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !959, file: !464, line: 123, baseType: !979, size: 64, align: 64, offset: 384)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!982, !982}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !959, file: !464, line: 130, baseType: !985, size: 32, align: 32, offset: 448)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !959, file: !464, line: 136, baseType: !987, size: 64, align: 64, offset: 512)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!985, !966}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !959, file: !464, line: 142, baseType: !991, size: 64, align: 64, offset: 576)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!917, !994, !966, !939, !917}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !936, file: !897, line: 670, baseType: !939, size: 64, align: 64, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !936, file: !897, line: 679, baseType: !999, size: 64, align: 64, offset: 448)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !936, file: !897, line: 684, baseType: !917, size: 32, align: 32, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !936, file: !897, line: 689, baseType: !917, size: 32, align: 32, offset: 544)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !936, file: !897, line: 696, baseType: !1003, size: 64, align: 64, offset: 576)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!917, !1006}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1009)
!1009 = !{!1010, !1011, !1014, !1015}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1008, file: !897, line: 449, baseType: !939, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1008, file: !897, line: 450, baseType: !1012, size: 64, align: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1008, file: !897, line: 451, baseType: !917, size: 32, align: 32, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1008, file: !897, line: 452, baseType: !939, size: 64, align: 64, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !936, file: !897, line: 703, baseType: !1017, size: 64, align: 64, offset: 640)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!917, !1020}
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1225, !1226, !1291, !1292, !1293, !2043, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2097, !2098, !2099, !2100, !2101, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2152, !2153, !2156, !2157, !2158, !2159, !2160, !2161, !2163, !2164, !2165, !2166, !2174, !2175, !2179, !2183, !2184, !2185}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1021, file: !897, line: 1342, baseType: !956, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1021, file: !897, line: 1349, baseType: !999, size: 64, align: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1021, file: !897, line: 1356, baseType: !1026, size: 64, align: 64, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1028)
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1084, !1085, !1089, !1093, !1098, !1105, !1200, !1206, !1212, !1213, !1214, !1215, !1219}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1027, file: !897, line: 498, baseType: !939, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1027, file: !897, line: 504, baseType: !939, size: 64, align: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1027, file: !897, line: 505, baseType: !939, size: 64, align: 64, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1027, file: !897, line: 506, baseType: !939, size: 64, align: 64, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1027, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1027, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1027, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1027, file: !897, line: 517, baseType: !917, size: 32, align: 32, offset: 352)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1027, file: !897, line: 523, baseType: !946, size: 64, align: 64, offset: 384)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1027, file: !897, line: 526, baseType: !956, size: 64, align: 64, offset: 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1027, file: !897, line: 535, baseType: !1026, size: 64, align: 64, offset: 512)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1027, file: !897, line: 539, baseType: !917, size: 32, align: 32, offset: 576)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1027, file: !897, line: 541, baseType: !1017, size: 64, align: 64, offset: 640)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1027, file: !897, line: 549, baseType: !1043, size: 64, align: 64, offset: 704)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!917, !1020, !1046}
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1049)
!1049 = !{!1050, !1064, !1067, !1068, !1069, !1070, !1071, !1072, !1080, !1081, !1082, !1083}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1048, file: !4, line: 1451, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1053, line: 94, baseType: !1054)
!1053 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1053, line: 81, size: 192, align: 64, elements: !1055)
!1055 = !{!1056, !1060, !1063}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1054, file: !1053, line: 82, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1053, line: 73, baseType: !1059)
!1059 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1053, line: 73, flags: DIFlagFwdDecl)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1054, file: !1053, line: 89, baseType: !1061, size: 64, align: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !925, line: 48, baseType: !1013)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1054, file: !1053, line: 93, baseType: !917, size: 32, align: 32, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1048, file: !4, line: 1461, baseType: !1065, size: 64, align: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !925, line: 40, baseType: !1066)
!1066 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1048, file: !4, line: 1467, baseType: !1065, size: 64, align: 64, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1048, file: !4, line: 1468, baseType: !1061, size: 64, align: 64, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1048, file: !4, line: 1469, baseType: !917, size: 32, align: 32, offset: 256)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1048, file: !4, line: 1470, baseType: !917, size: 32, align: 32, offset: 288)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1048, file: !4, line: 1474, baseType: !917, size: 32, align: 32, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1048, file: !4, line: 1479, baseType: !1073, size: 64, align: 64, offset: 384)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1076)
!1076 = !{!1077, !1078, !1079}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1075, file: !4, line: 1412, baseType: !1061, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1075, file: !4, line: 1413, baseType: !917, size: 32, align: 32, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1075, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1048, file: !4, line: 1480, baseType: !917, size: 32, align: 32, offset: 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1048, file: !4, line: 1486, baseType: !1065, size: 64, align: 64, offset: 512)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1048, file: !4, line: 1488, baseType: !1065, size: 64, align: 64, offset: 576)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1048, file: !4, line: 1497, baseType: !1065, size: 64, align: 64, offset: 640)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1027, file: !897, line: 550, baseType: !1017, size: 64, align: 64, offset: 768)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1027, file: !897, line: 554, baseType: !1086, size: 64, align: 64, offset: 832)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!917, !1020, !1046, !1046, !917}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1027, file: !897, line: 563, baseType: !1090, size: 64, align: 64, offset: 896)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!917, !3, !917}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1027, file: !897, line: 565, baseType: !1094, size: 64, align: 64, offset: 960)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{null, !1020, !917, !1097, !1097}
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1027, file: !897, line: 570, baseType: !1099, size: 64, align: 64, offset: 1024)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!917, !1020, !917, !966, !1102}
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1103, line: 216, baseType: !1104)
!1103 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1104 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1027, file: !897, line: 581, baseType: !1106, size: 64, align: 64, offset: 1088)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!917, !1020, !917, !1109, !918}
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1113)
!1113 = !{!1114, !1118, !1120, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1154, !1156, !1157, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1112, file: !526, line: 282, baseType: !1115, size: 512, align: 64)
!1115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1061, size: 512, align: 64, elements: !1116)
!1116 = !{!1117}
!1117 = !DISubrange(count: 8)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1112, file: !526, line: 299, baseType: !1119, size: 256, align: 32, offset: 512)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 32, elements: !1116)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1112, file: !526, line: 315, baseType: !1121, size: 64, align: 64, offset: 768)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1112, file: !526, line: 326, baseType: !917, size: 32, align: 32, offset: 832)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1112, file: !526, line: 326, baseType: !917, size: 32, align: 32, offset: 864)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1112, file: !526, line: 334, baseType: !917, size: 32, align: 32, offset: 896)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1112, file: !526, line: 341, baseType: !917, size: 32, align: 32, offset: 928)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1112, file: !526, line: 346, baseType: !917, size: 32, align: 32, offset: 960)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1112, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1112, file: !526, line: 356, baseType: !1129, size: 64, align: 32, offset: 1024)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1130, line: 61, baseType: !1131)
!1130 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1130, line: 58, size: 64, align: 32, elements: !1132)
!1132 = !{!1133, !1134}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1131, file: !1130, line: 59, baseType: !917, size: 32, align: 32)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1131, file: !1130, line: 60, baseType: !917, size: 32, align: 32, offset: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1112, file: !526, line: 361, baseType: !1065, size: 64, align: 64, offset: 1088)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1112, file: !526, line: 369, baseType: !1065, size: 64, align: 64, offset: 1152)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1112, file: !526, line: 377, baseType: !1065, size: 64, align: 64, offset: 1216)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1112, file: !526, line: 382, baseType: !917, size: 32, align: 32, offset: 1280)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1112, file: !526, line: 386, baseType: !917, size: 32, align: 32, offset: 1312)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1112, file: !526, line: 391, baseType: !917, size: 32, align: 32, offset: 1344)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1112, file: !526, line: 396, baseType: !966, size: 64, align: 64, offset: 1408)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1112, file: !526, line: 403, baseType: !1143, size: 512, align: 64, offset: 1472)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1144, size: 512, align: 64, elements: !1116)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !925, line: 55, baseType: !1104)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1112, file: !526, line: 410, baseType: !917, size: 32, align: 32, offset: 1984)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1112, file: !526, line: 415, baseType: !917, size: 32, align: 32, offset: 2016)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1112, file: !526, line: 420, baseType: !917, size: 32, align: 32, offset: 2048)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1112, file: !526, line: 425, baseType: !917, size: 32, align: 32, offset: 2080)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1112, file: !526, line: 435, baseType: !1065, size: 64, align: 64, offset: 2112)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1112, file: !526, line: 440, baseType: !917, size: 32, align: 32, offset: 2176)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1112, file: !526, line: 445, baseType: !1144, size: 64, align: 64, offset: 2240)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1112, file: !526, line: 459, baseType: !1153, size: 512, align: 64, offset: 2304)
!1153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1051, size: 512, align: 64, elements: !1116)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1112, file: !526, line: 473, baseType: !1155, size: 64, align: 64, offset: 2816)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1112, file: !526, line: 477, baseType: !917, size: 32, align: 32, offset: 2880)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1112, file: !526, line: 479, baseType: !1158, size: 64, align: 64, offset: 2944)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1162)
!1162 = !{!1163, !1164, !1165, !1166, !1171}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1161, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1161, file: !526, line: 203, baseType: !1061, size: 64, align: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1161, file: !526, line: 204, baseType: !917, size: 32, align: 32, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1161, file: !526, line: 205, baseType: !1167, size: 64, align: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1169, line: 86, baseType: !1170)
!1169 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1170 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1169, line: 86, flags: DIFlagFwdDecl)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1161, file: !526, line: 206, baseType: !1051, size: 64, align: 64, offset: 256)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1112, file: !526, line: 480, baseType: !917, size: 32, align: 32, offset: 3008)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1112, file: !526, line: 505, baseType: !917, size: 32, align: 32, offset: 3040)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1112, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1112, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1112, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1112, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1112, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1112, file: !526, line: 532, baseType: !1065, size: 64, align: 64, offset: 3264)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1112, file: !526, line: 539, baseType: !1065, size: 64, align: 64, offset: 3328)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1112, file: !526, line: 547, baseType: !1065, size: 64, align: 64, offset: 3392)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1112, file: !526, line: 554, baseType: !1167, size: 64, align: 64, offset: 3456)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1112, file: !526, line: 563, baseType: !917, size: 32, align: 32, offset: 3520)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1112, file: !526, line: 572, baseType: !917, size: 32, align: 32, offset: 3552)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1112, file: !526, line: 581, baseType: !917, size: 32, align: 32, offset: 3584)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1112, file: !526, line: 588, baseType: !1187, size: 64, align: 64, offset: 3648)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !925, line: 36, baseType: !1189)
!1189 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1112, file: !526, line: 593, baseType: !917, size: 32, align: 32, offset: 3712)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1112, file: !526, line: 596, baseType: !917, size: 32, align: 32, offset: 3744)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1112, file: !526, line: 599, baseType: !1051, size: 64, align: 64, offset: 3776)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1112, file: !526, line: 605, baseType: !1051, size: 64, align: 64, offset: 3840)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1112, file: !526, line: 616, baseType: !1051, size: 64, align: 64, offset: 3904)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1112, file: !526, line: 626, baseType: !1102, size: 64, align: 64, offset: 3968)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1112, file: !526, line: 627, baseType: !1102, size: 64, align: 64, offset: 4032)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1112, file: !526, line: 628, baseType: !1102, size: 64, align: 64, offset: 4096)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1112, file: !526, line: 629, baseType: !1102, size: 64, align: 64, offset: 4160)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1112, file: !526, line: 645, baseType: !1051, size: 64, align: 64, offset: 4224)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1027, file: !897, line: 587, baseType: !1201, size: 64, align: 64, offset: 1152)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!917, !1020, !1204}
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1027, file: !897, line: 592, baseType: !1207, size: 64, align: 64, offset: 1216)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!917, !1020, !1210}
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1027, file: !897, line: 597, baseType: !1207, size: 64, align: 64, offset: 1280)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1027, file: !897, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1027, file: !897, line: 608, baseType: !1017, size: 64, align: 64, offset: 1408)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1027, file: !897, line: 617, baseType: !1216, size: 64, align: 64, offset: 1472)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{null, !1020}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1027, file: !897, line: 623, baseType: !1220, size: 64, align: 64, offset: 1536)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!917, !1020, !1223}
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1047)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1021, file: !897, line: 1365, baseType: !966, size: 64, align: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1021, file: !897, line: 1379, baseType: !1227, size: 64, align: 64, offset: 256)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1229)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1230)
!1230 = !{!1231, !1232, !1233, !1234, !1235, !1236, !1237, !1241, !1242, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1258, !1259, !1263, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1281, !1282, !1283, !1284, !1288, !1289, !1290}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1229, file: !628, line: 174, baseType: !956, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1229, file: !628, line: 226, baseType: !1012, size: 64, align: 64, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1229, file: !628, line: 227, baseType: !917, size: 32, align: 32, offset: 128)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1229, file: !628, line: 228, baseType: !1012, size: 64, align: 64, offset: 192)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1229, file: !628, line: 229, baseType: !1012, size: 64, align: 64, offset: 256)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1229, file: !628, line: 233, baseType: !966, size: 64, align: 64, offset: 320)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1229, file: !628, line: 235, baseType: !1238, size: 64, align: 64, offset: 384)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!917, !966, !1061, !917}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1229, file: !628, line: 236, baseType: !1238, size: 64, align: 64, offset: 448)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1229, file: !628, line: 237, baseType: !1243, size: 64, align: 64, offset: 512)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!1065, !966, !1065, !917}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1229, file: !628, line: 238, baseType: !1065, size: 64, align: 64, offset: 576)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1229, file: !628, line: 239, baseType: !917, size: 32, align: 32, offset: 640)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1229, file: !628, line: 240, baseType: !917, size: 32, align: 32, offset: 672)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1229, file: !628, line: 241, baseType: !917, size: 32, align: 32, offset: 704)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1229, file: !628, line: 242, baseType: !1104, size: 64, align: 64, offset: 768)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1229, file: !628, line: 243, baseType: !1012, size: 64, align: 64, offset: 832)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1229, file: !628, line: 244, baseType: !1253, size: 64, align: 64, offset: 896)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!1104, !1104, !1256, !918}
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1062)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1229, file: !628, line: 245, baseType: !917, size: 32, align: 32, offset: 960)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1229, file: !628, line: 249, baseType: !1260, size: 64, align: 64, offset: 1024)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!917, !966, !917}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1229, file: !628, line: 255, baseType: !1264, size: 64, align: 64, offset: 1088)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!1065, !966, !917, !1065, !917}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1229, file: !628, line: 260, baseType: !917, size: 32, align: 32, offset: 1152)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1229, file: !628, line: 266, baseType: !1065, size: 64, align: 64, offset: 1216)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1229, file: !628, line: 273, baseType: !917, size: 32, align: 32, offset: 1280)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1229, file: !628, line: 279, baseType: !1065, size: 64, align: 64, offset: 1344)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1229, file: !628, line: 285, baseType: !917, size: 32, align: 32, offset: 1408)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1229, file: !628, line: 291, baseType: !917, size: 32, align: 32, offset: 1440)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1229, file: !628, line: 298, baseType: !917, size: 32, align: 32, offset: 1472)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1229, file: !628, line: 304, baseType: !917, size: 32, align: 32, offset: 1504)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1229, file: !628, line: 309, baseType: !939, size: 64, align: 64, offset: 1536)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1229, file: !628, line: 314, baseType: !939, size: 64, align: 64, offset: 1600)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1229, file: !628, line: 319, baseType: !1278, size: 64, align: 64, offset: 1664)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!917, !966, !1061, !917, !627, !1065}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1229, file: !628, line: 326, baseType: !917, size: 32, align: 32, offset: 1728)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1229, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1229, file: !628, line: 332, baseType: !1065, size: 64, align: 64, offset: 1792)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1229, file: !628, line: 338, baseType: !1285, size: 64, align: 64, offset: 1856)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!917, !966}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1229, file: !628, line: 340, baseType: !1065, size: 64, align: 64, offset: 1920)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1229, file: !628, line: 346, baseType: !1012, size: 64, align: 64, offset: 1984)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1229, file: !628, line: 351, baseType: !917, size: 32, align: 32, offset: 2048)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1021, file: !897, line: 1386, baseType: !917, size: 32, align: 32, offset: 320)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1021, file: !897, line: 1393, baseType: !918, size: 32, align: 32, offset: 352)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1021, file: !897, line: 1405, baseType: !1294, size: 64, align: 64, offset: 384)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1297)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1298)
!1298 = !{!1299, !1300, !1301, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1968, !1974, !1975, !1979, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2011, !2012, !2013, !2014, !2015, !2016}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1297, file: !897, line: 866, baseType: !917, size: 32, align: 32)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1297, file: !897, line: 872, baseType: !917, size: 32, align: 32, offset: 32)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1297, file: !897, line: 878, baseType: !1302, size: 64, align: 64, offset: 64)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1305)
!1305 = !{!1306, !1307, !1308, !1309, !1448, !1449, !1450, !1451, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1604, !1608, !1609, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1788, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1304, file: !4, line: 1561, baseType: !956, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1304, file: !4, line: 1562, baseType: !917, size: 32, align: 32, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1304, file: !4, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1304, file: !4, line: 1565, baseType: !1310, size: 64, align: 64, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1312)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1313)
!1313 = !{!1314, !1315, !1316, !1317, !1318, !1319, !1322, !1325, !1328, !1331, !1334, !1335, !1336, !1344, !1345, !1346, !1348, !1352, !1358, !1367, !1371, !1372, !1413, !1420, !1424, !1425, !1429, !1433, !1437, !1441, !1442, !1443}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1312, file: !4, line: 3475, baseType: !939, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1312, file: !4, line: 3480, baseType: !939, size: 64, align: 64, offset: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1312, file: !4, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1312, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1312, file: !4, line: 3487, baseType: !917, size: 32, align: 32, offset: 192)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1312, file: !4, line: 3488, baseType: !1320, size: 64, align: 64, offset: 256)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1129)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1312, file: !4, line: 3489, baseType: !1323, size: 64, align: 64, offset: 320)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1312, file: !4, line: 3490, baseType: !1326, size: 64, align: 64, offset: 384)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1312, file: !4, line: 3491, baseType: !1329, size: 64, align: 64, offset: 448)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1312, file: !4, line: 3492, baseType: !1332, size: 64, align: 64, offset: 512)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1144)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1312, file: !4, line: 3493, baseType: !1062, size: 8, align: 8, offset: 576)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1312, file: !4, line: 3494, baseType: !956, size: 64, align: 64, offset: 640)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1312, file: !4, line: 3495, baseType: !1337, size: 64, align: 64, offset: 704)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1339)
!1339 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1340)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1341)
!1341 = !{!1342, !1343}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1340, file: !4, line: 3402, baseType: !917, size: 32, align: 32)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1340, file: !4, line: 3403, baseType: !939, size: 64, align: 64, offset: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1312, file: !4, line: 3507, baseType: !939, size: 64, align: 64, offset: 768)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1312, file: !4, line: 3516, baseType: !917, size: 32, align: 32, offset: 832)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1312, file: !4, line: 3517, baseType: !1347, size: 64, align: 64, offset: 896)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1312, file: !4, line: 3527, baseType: !1349, size: 64, align: 64, offset: 960)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!917, !1302}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1312, file: !4, line: 3535, baseType: !1353, size: 64, align: 64, offset: 1024)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DISubroutineType(types: !1355)
!1355 = !{!917, !1302, !1356}
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1303)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1312, file: !4, line: 3541, baseType: !1359, size: 64, align: 64, offset: 1088)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1361)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1363, line: 223, size: 128, align: 64, elements: !1364)
!1363 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1364 = !{!1365, !1366}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1362, file: !1363, line: 224, baseType: !1256, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1362, file: !1363, line: 225, baseType: !1256, size: 64, align: 64, offset: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1312, file: !4, line: 3549, baseType: !1368, size: 64, align: 64, offset: 1152)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DISubroutineType(types: !1370)
!1370 = !{null, !1347}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1312, file: !4, line: 3551, baseType: !1349, size: 64, align: 64, offset: 1216)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1312, file: !4, line: 3552, baseType: !1373, size: 64, align: 64, offset: 1280)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DISubroutineType(types: !1375)
!1375 = !{!917, !1302, !1061, !917, !1376}
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1378)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1379)
!1379 = !{!1380, !1381, !1382, !1383, !1384, !1412}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1378, file: !4, line: 3921, baseType: !924, size: 16, align: 16)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1378, file: !4, line: 3922, baseType: !931, size: 32, align: 32, offset: 32)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1378, file: !4, line: 3923, baseType: !931, size: 32, align: 32, offset: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1378, file: !4, line: 3924, baseType: !918, size: 32, align: 32, offset: 96)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1378, file: !4, line: 3925, baseType: !1385, size: 64, align: 64, offset: 128)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1388)
!1388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1389)
!1389 = !{!1390, !1391, !1392, !1393, !1394, !1395, !1401, !1405, !1407, !1408, !1410, !1411}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1388, file: !4, line: 3886, baseType: !917, size: 32, align: 32)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1388, file: !4, line: 3887, baseType: !917, size: 32, align: 32, offset: 32)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1388, file: !4, line: 3888, baseType: !917, size: 32, align: 32, offset: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1388, file: !4, line: 3889, baseType: !917, size: 32, align: 32, offset: 96)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1388, file: !4, line: 3890, baseType: !917, size: 32, align: 32, offset: 128)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1388, file: !4, line: 3897, baseType: !1396, size: 768, align: 64, offset: 192)
!1396 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1397)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1398)
!1398 = !{!1399, !1400}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1397, file: !4, line: 3855, baseType: !1115, size: 512, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1397, file: !4, line: 3857, baseType: !1119, size: 256, align: 32, offset: 512)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1388, file: !4, line: 3903, baseType: !1402, size: 256, align: 64, offset: 960)
!1402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1061, size: 256, align: 64, elements: !1403)
!1403 = !{!1404}
!1404 = !DISubrange(count: 4)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1388, file: !4, line: 3904, baseType: !1406, size: 128, align: 32, offset: 1216)
!1406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 128, align: 32, elements: !1403)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1388, file: !4, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1388, file: !4, line: 3908, baseType: !1409, size: 64, align: 64, offset: 1408)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1388, file: !4, line: 3915, baseType: !1409, size: 64, align: 64, offset: 1472)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1388, file: !4, line: 3917, baseType: !917, size: 32, align: 32, offset: 1536)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1378, file: !4, line: 3926, baseType: !1065, size: 64, align: 64, offset: 192)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1312, file: !4, line: 3564, baseType: !1414, size: 64, align: 64, offset: 1344)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{!917, !1302, !1046, !1417, !1419}
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1111)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1312, file: !4, line: 3566, baseType: !1421, size: 64, align: 64, offset: 1408)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{!917, !1302, !966, !1419, !1046}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1312, file: !4, line: 3567, baseType: !1349, size: 64, align: 64, offset: 1472)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1312, file: !4, line: 3576, baseType: !1426, size: 64, align: 64, offset: 1536)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DISubroutineType(types: !1428)
!1428 = !{!917, !1302, !1417}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1312, file: !4, line: 3577, baseType: !1430, size: 64, align: 64, offset: 1600)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DISubroutineType(types: !1432)
!1432 = !{!917, !1302, !1046}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1312, file: !4, line: 3584, baseType: !1434, size: 64, align: 64, offset: 1664)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DISubroutineType(types: !1436)
!1436 = !{!917, !1302, !1110}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1312, file: !4, line: 3589, baseType: !1438, size: 64, align: 64, offset: 1728)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DISubroutineType(types: !1440)
!1440 = !{null, !1302}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1312, file: !4, line: 3594, baseType: !917, size: 32, align: 32, offset: 1792)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1312, file: !4, line: 3600, baseType: !939, size: 64, align: 64, offset: 1856)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1312, file: !4, line: 3609, baseType: !1444, size: 64, align: 64, offset: 1920)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1447)
!1447 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1304, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1304, file: !4, line: 1581, baseType: !918, size: 32, align: 32, offset: 224)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1304, file: !4, line: 1583, baseType: !966, size: 64, align: 64, offset: 256)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1304, file: !4, line: 1591, baseType: !1452, size: 64, align: 64, offset: 320)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1363, line: 129, size: 1664, align: 64, elements: !1454)
!1454 = !{!1455, !1456, !1457, !1458, !1459, !1477, !1478, !1484, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1453, file: !1363, line: 136, baseType: !917, size: 32, align: 32)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1453, file: !1363, line: 151, baseType: !917, size: 32, align: 32, offset: 32)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1453, file: !1363, line: 157, baseType: !917, size: 32, align: 32, offset: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1453, file: !1363, line: 159, baseType: !1110, size: 64, align: 64, offset: 128)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1453, file: !1363, line: 161, baseType: !1460, size: 64, align: 64, offset: 192)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1363, line: 117, baseType: !1462)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1363, line: 100, size: 832, align: 64, elements: !1463)
!1463 = !{!1464, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1462, file: !1363, line: 105, baseType: !1465, size: 256, align: 64)
!1465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1466, size: 256, align: 64, elements: !1403)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1053, line: 238, baseType: !1468)
!1468 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1053, line: 238, flags: DIFlagFwdDecl)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1462, file: !1363, line: 110, baseType: !917, size: 32, align: 32, offset: 256)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1462, file: !1363, line: 111, baseType: !917, size: 32, align: 32, offset: 288)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1462, file: !1363, line: 111, baseType: !917, size: 32, align: 32, offset: 320)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1462, file: !1363, line: 112, baseType: !1119, size: 256, align: 32, offset: 352)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1462, file: !1363, line: 113, baseType: !1406, size: 128, align: 32, offset: 608)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1462, file: !1363, line: 114, baseType: !917, size: 32, align: 32, offset: 736)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1462, file: !1363, line: 115, baseType: !917, size: 32, align: 32, offset: 768)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1462, file: !1363, line: 116, baseType: !917, size: 32, align: 32, offset: 800)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1453, file: !1363, line: 163, baseType: !966, size: 64, align: 64, offset: 256)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1453, file: !1363, line: 165, baseType: !1479, size: 128, align: 64, offset: 320)
!1479 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1363, line: 122, baseType: !1480)
!1480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1363, line: 119, size: 128, align: 64, elements: !1481)
!1481 = !{!1482, !1483}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1480, file: !1363, line: 120, baseType: !1046, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1480, file: !1363, line: 121, baseType: !1110, size: 64, align: 64, offset: 64)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1453, file: !1363, line: 166, baseType: !1485, size: 128, align: 64, offset: 448)
!1485 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1363, line: 127, baseType: !1486)
!1486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1363, line: 124, size: 128, align: 64, elements: !1487)
!1487 = !{!1488, !1561}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1486, file: !1363, line: 125, baseType: !1489, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1492)
!1492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1493)
!1493 = !{!1494, !1495, !1519, !1523, !1524, !1558, !1559, !1560}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1492, file: !4, line: 5751, baseType: !956, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1492, file: !4, line: 5756, baseType: !1496, size: 64, align: 64, offset: 64)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1498)
!1498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1499)
!1499 = !{!1500, !1501, !1504, !1505, !1506, !1510, !1514, !1518}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1498, file: !4, line: 5797, baseType: !939, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1498, file: !4, line: 5804, baseType: !1502, size: 64, align: 64, offset: 64)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1498, file: !4, line: 5815, baseType: !956, size: 64, align: 64, offset: 128)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1498, file: !4, line: 5825, baseType: !917, size: 32, align: 32, offset: 192)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1498, file: !4, line: 5826, baseType: !1507, size: 64, align: 64, offset: 256)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{!917, !1490}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1498, file: !4, line: 5827, baseType: !1511, size: 64, align: 64, offset: 320)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{!917, !1490, !1046}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1498, file: !4, line: 5828, baseType: !1515, size: 64, align: 64, offset: 384)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DISubroutineType(types: !1517)
!1517 = !{null, !1490}
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1498, file: !4, line: 5829, baseType: !1515, size: 64, align: 64, offset: 448)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1492, file: !4, line: 5762, baseType: !1520, size: 64, align: 64, offset: 128)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1522)
!1522 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1492, file: !4, line: 5768, baseType: !966, size: 64, align: 64, offset: 192)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1492, file: !4, line: 5775, baseType: !1525, size: 64, align: 64, offset: 256)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1527)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1528)
!1528 = !{!1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1527, file: !4, line: 3940, baseType: !636, size: 32, align: 32)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1527, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1527, file: !4, line: 3948, baseType: !931, size: 32, align: 32, offset: 64)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1527, file: !4, line: 3958, baseType: !1061, size: 64, align: 64, offset: 128)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1527, file: !4, line: 3962, baseType: !917, size: 32, align: 32, offset: 192)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1527, file: !4, line: 3968, baseType: !917, size: 32, align: 32, offset: 224)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1527, file: !4, line: 3973, baseType: !1065, size: 64, align: 64, offset: 256)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1527, file: !4, line: 3986, baseType: !917, size: 32, align: 32, offset: 320)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1527, file: !4, line: 3999, baseType: !917, size: 32, align: 32, offset: 352)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1527, file: !4, line: 4004, baseType: !917, size: 32, align: 32, offset: 384)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1527, file: !4, line: 4005, baseType: !917, size: 32, align: 32, offset: 416)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1527, file: !4, line: 4010, baseType: !917, size: 32, align: 32, offset: 448)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1527, file: !4, line: 4011, baseType: !917, size: 32, align: 32, offset: 480)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1527, file: !4, line: 4020, baseType: !1129, size: 64, align: 32, offset: 512)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1527, file: !4, line: 4025, baseType: !867, size: 32, align: 32, offset: 576)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1527, file: !4, line: 4030, baseType: !549, size: 32, align: 32, offset: 608)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1527, file: !4, line: 4031, baseType: !556, size: 32, align: 32, offset: 640)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1527, file: !4, line: 4032, baseType: !574, size: 32, align: 32, offset: 672)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1527, file: !4, line: 4033, baseType: !598, size: 32, align: 32, offset: 704)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1527, file: !4, line: 4034, baseType: !617, size: 32, align: 32, offset: 736)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1527, file: !4, line: 4039, baseType: !917, size: 32, align: 32, offset: 768)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1527, file: !4, line: 4046, baseType: !1144, size: 64, align: 64, offset: 832)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1527, file: !4, line: 4050, baseType: !917, size: 32, align: 32, offset: 896)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1527, file: !4, line: 4054, baseType: !917, size: 32, align: 32, offset: 928)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1527, file: !4, line: 4061, baseType: !917, size: 32, align: 32, offset: 960)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1527, file: !4, line: 4065, baseType: !917, size: 32, align: 32, offset: 992)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1527, file: !4, line: 4073, baseType: !917, size: 32, align: 32, offset: 1024)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1527, file: !4, line: 4080, baseType: !917, size: 32, align: 32, offset: 1056)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1527, file: !4, line: 4084, baseType: !917, size: 32, align: 32, offset: 1088)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1492, file: !4, line: 5781, baseType: !1525, size: 64, align: 64, offset: 320)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1492, file: !4, line: 5787, baseType: !1129, size: 64, align: 32, offset: 384)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1492, file: !4, line: 5793, baseType: !1129, size: 64, align: 32, offset: 448)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1486, file: !1363, line: 126, baseType: !917, size: 32, align: 32, offset: 64)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1453, file: !1363, line: 172, baseType: !1046, size: 64, align: 64, offset: 576)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1453, file: !1363, line: 177, baseType: !1061, size: 64, align: 64, offset: 640)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1453, file: !1363, line: 178, baseType: !918, size: 32, align: 32, offset: 704)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1453, file: !1363, line: 180, baseType: !966, size: 64, align: 64, offset: 768)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1453, file: !1363, line: 185, baseType: !917, size: 32, align: 32, offset: 832)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1453, file: !1363, line: 190, baseType: !966, size: 64, align: 64, offset: 896)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1453, file: !1363, line: 195, baseType: !917, size: 32, align: 32, offset: 960)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1453, file: !1363, line: 200, baseType: !1046, size: 64, align: 64, offset: 1024)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1453, file: !1363, line: 201, baseType: !917, size: 32, align: 32, offset: 1088)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1453, file: !1363, line: 202, baseType: !1110, size: 64, align: 64, offset: 1152)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1453, file: !1363, line: 203, baseType: !917, size: 32, align: 32, offset: 1216)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1453, file: !1363, line: 205, baseType: !917, size: 32, align: 32, offset: 1248)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1453, file: !1363, line: 206, baseType: !917, size: 32, align: 32, offset: 1280)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1453, file: !1363, line: 209, baseType: !1102, size: 64, align: 64, offset: 1344)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1453, file: !1363, line: 212, baseType: !1102, size: 64, align: 64, offset: 1408)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1453, file: !1363, line: 213, baseType: !1110, size: 64, align: 64, offset: 1472)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1453, file: !1363, line: 215, baseType: !917, size: 32, align: 32, offset: 1536)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1453, file: !1363, line: 217, baseType: !917, size: 32, align: 32, offset: 1568)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1453, file: !1363, line: 220, baseType: !917, size: 32, align: 32, offset: 1600)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1304, file: !4, line: 1598, baseType: !966, size: 64, align: 64, offset: 384)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1304, file: !4, line: 1606, baseType: !1065, size: 64, align: 64, offset: 448)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1304, file: !4, line: 1614, baseType: !917, size: 32, align: 32, offset: 512)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1304, file: !4, line: 1622, baseType: !917, size: 32, align: 32, offset: 544)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1304, file: !4, line: 1628, baseType: !917, size: 32, align: 32, offset: 576)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1304, file: !4, line: 1636, baseType: !917, size: 32, align: 32, offset: 608)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1304, file: !4, line: 1643, baseType: !917, size: 32, align: 32, offset: 640)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1304, file: !4, line: 1657, baseType: !1061, size: 64, align: 64, offset: 704)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1304, file: !4, line: 1658, baseType: !917, size: 32, align: 32, offset: 768)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1304, file: !4, line: 1679, baseType: !1129, size: 64, align: 32, offset: 800)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1304, file: !4, line: 1688, baseType: !917, size: 32, align: 32, offset: 864)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1304, file: !4, line: 1712, baseType: !917, size: 32, align: 32, offset: 896)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1304, file: !4, line: 1729, baseType: !917, size: 32, align: 32, offset: 928)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1304, file: !4, line: 1729, baseType: !917, size: 32, align: 32, offset: 960)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1304, file: !4, line: 1744, baseType: !917, size: 32, align: 32, offset: 992)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1304, file: !4, line: 1744, baseType: !917, size: 32, align: 32, offset: 1024)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1304, file: !4, line: 1751, baseType: !917, size: 32, align: 32, offset: 1056)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1304, file: !4, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1304, file: !4, line: 1791, baseType: !1600, size: 64, align: 64, offset: 1152)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DISubroutineType(types: !1602)
!1602 = !{null, !1603, !1417, !1419, !917, !917, !917}
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1304, file: !4, line: 1808, baseType: !1605, size: 64, align: 64, offset: 1216)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DISubroutineType(types: !1607)
!1607 = !{!645, !1603, !1323}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1304, file: !4, line: 1816, baseType: !917, size: 32, align: 32, offset: 1280)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1304, file: !4, line: 1825, baseType: !1610, size: 32, align: 32, offset: 1312)
!1610 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1304, file: !4, line: 1830, baseType: !917, size: 32, align: 32, offset: 1344)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1304, file: !4, line: 1838, baseType: !1610, size: 32, align: 32, offset: 1376)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1304, file: !4, line: 1846, baseType: !917, size: 32, align: 32, offset: 1408)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1304, file: !4, line: 1851, baseType: !917, size: 32, align: 32, offset: 1440)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1304, file: !4, line: 1861, baseType: !1610, size: 32, align: 32, offset: 1472)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1304, file: !4, line: 1868, baseType: !1610, size: 32, align: 32, offset: 1504)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1304, file: !4, line: 1875, baseType: !1610, size: 32, align: 32, offset: 1536)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1304, file: !4, line: 1882, baseType: !1610, size: 32, align: 32, offset: 1568)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1304, file: !4, line: 1889, baseType: !1610, size: 32, align: 32, offset: 1600)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1304, file: !4, line: 1896, baseType: !1610, size: 32, align: 32, offset: 1632)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1304, file: !4, line: 1903, baseType: !1610, size: 32, align: 32, offset: 1664)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1304, file: !4, line: 1910, baseType: !917, size: 32, align: 32, offset: 1696)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1304, file: !4, line: 1915, baseType: !917, size: 32, align: 32, offset: 1728)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1304, file: !4, line: 1926, baseType: !1419, size: 64, align: 64, offset: 1792)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1304, file: !4, line: 1935, baseType: !1129, size: 64, align: 32, offset: 1856)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1304, file: !4, line: 1942, baseType: !917, size: 32, align: 32, offset: 1920)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1304, file: !4, line: 1948, baseType: !917, size: 32, align: 32, offset: 1952)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1304, file: !4, line: 1954, baseType: !917, size: 32, align: 32, offset: 1984)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1304, file: !4, line: 1960, baseType: !917, size: 32, align: 32, offset: 2016)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1304, file: !4, line: 1984, baseType: !917, size: 32, align: 32, offset: 2048)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1304, file: !4, line: 1991, baseType: !917, size: 32, align: 32, offset: 2080)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1304, file: !4, line: 1996, baseType: !917, size: 32, align: 32, offset: 2112)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1304, file: !4, line: 2004, baseType: !917, size: 32, align: 32, offset: 2144)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1304, file: !4, line: 2011, baseType: !917, size: 32, align: 32, offset: 2176)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1304, file: !4, line: 2018, baseType: !917, size: 32, align: 32, offset: 2208)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1304, file: !4, line: 2027, baseType: !917, size: 32, align: 32, offset: 2240)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1304, file: !4, line: 2034, baseType: !917, size: 32, align: 32, offset: 2272)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1304, file: !4, line: 2044, baseType: !917, size: 32, align: 32, offset: 2304)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1304, file: !4, line: 2054, baseType: !1640, size: 64, align: 64, offset: 2368)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1304, file: !4, line: 2061, baseType: !1640, size: 64, align: 64, offset: 2432)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1304, file: !4, line: 2066, baseType: !917, size: 32, align: 32, offset: 2496)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1304, file: !4, line: 2070, baseType: !917, size: 32, align: 32, offset: 2528)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1304, file: !4, line: 2078, baseType: !917, size: 32, align: 32, offset: 2560)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1304, file: !4, line: 2085, baseType: !917, size: 32, align: 32, offset: 2592)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1304, file: !4, line: 2092, baseType: !917, size: 32, align: 32, offset: 2624)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1304, file: !4, line: 2099, baseType: !917, size: 32, align: 32, offset: 2656)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1304, file: !4, line: 2106, baseType: !917, size: 32, align: 32, offset: 2688)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1304, file: !4, line: 2113, baseType: !917, size: 32, align: 32, offset: 2720)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1304, file: !4, line: 2120, baseType: !917, size: 32, align: 32, offset: 2752)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1304, file: !4, line: 2125, baseType: !917, size: 32, align: 32, offset: 2784)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1304, file: !4, line: 2133, baseType: !917, size: 32, align: 32, offset: 2816)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1304, file: !4, line: 2140, baseType: !917, size: 32, align: 32, offset: 2848)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1304, file: !4, line: 2145, baseType: !917, size: 32, align: 32, offset: 2880)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1304, file: !4, line: 2153, baseType: !917, size: 32, align: 32, offset: 2912)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1304, file: !4, line: 2158, baseType: !917, size: 32, align: 32, offset: 2944)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1304, file: !4, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1304, file: !4, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1304, file: !4, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1304, file: !4, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1304, file: !4, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1304, file: !4, line: 2203, baseType: !917, size: 32, align: 32, offset: 3136)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1304, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1304, file: !4, line: 2212, baseType: !917, size: 32, align: 32, offset: 3200)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1304, file: !4, line: 2213, baseType: !917, size: 32, align: 32, offset: 3232)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1304, file: !4, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1304, file: !4, line: 2232, baseType: !917, size: 32, align: 32, offset: 3296)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1304, file: !4, line: 2243, baseType: !917, size: 32, align: 32, offset: 3328)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1304, file: !4, line: 2249, baseType: !917, size: 32, align: 32, offset: 3360)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1304, file: !4, line: 2256, baseType: !917, size: 32, align: 32, offset: 3392)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1304, file: !4, line: 2263, baseType: !1144, size: 64, align: 64, offset: 3456)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1304, file: !4, line: 2270, baseType: !1144, size: 64, align: 64, offset: 3520)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1304, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1304, file: !4, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1304, file: !4, line: 2367, baseType: !1676, size: 64, align: 64, offset: 3648)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DISubroutineType(types: !1678)
!1678 = !{!917, !1603, !1110, !917}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1304, file: !4, line: 2383, baseType: !917, size: 32, align: 32, offset: 3712)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1304, file: !4, line: 2386, baseType: !1610, size: 32, align: 32, offset: 3744)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1304, file: !4, line: 2387, baseType: !1610, size: 32, align: 32, offset: 3776)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1304, file: !4, line: 2394, baseType: !917, size: 32, align: 32, offset: 3808)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1304, file: !4, line: 2401, baseType: !917, size: 32, align: 32, offset: 3840)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1304, file: !4, line: 2408, baseType: !917, size: 32, align: 32, offset: 3872)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1304, file: !4, line: 2415, baseType: !917, size: 32, align: 32, offset: 3904)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1304, file: !4, line: 2422, baseType: !917, size: 32, align: 32, offset: 3936)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1304, file: !4, line: 2423, baseType: !1688, size: 64, align: 64, offset: 3968)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1690)
!1690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1691)
!1691 = !{!1692, !1693, !1694, !1695}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1690, file: !4, line: 827, baseType: !917, size: 32, align: 32)
