; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--replaygain.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--replaygain.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVStream = type { i32, i32, %struct.AVCodecContext*, i8*, %struct.AVRational, i64, i64, i64, i32, i32, %struct.AVRational, %struct.AVDictionary*, %struct.AVRational, %struct.AVPacket, %struct.AVPacketSideData*, i32, i32, %struct.AVRational, i8*, %struct.AVCodecParameters*, %struct.anon*, i32, i64, i64, i64, i32, i32, i32, i32, %struct.AVCodecParserContext*, %struct.AVPacketList*, %struct.AVProbeData, [17 x i64], %struct.AVIndexEntry*, i32, i32, i32, i32, i32, i32, i64, i64, i32, i32, i32, i64, i64, i64, i32, i64, i64, i32, i32, [17 x i64], [17 x i8], i64, i8, i8, i32, %struct.AVRational, %struct.AVStreamInternal* }

!829 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !495, line: 493, size: 32, align: 32, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847}
!831 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!832 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!833 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!834 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!835 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!836 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!837 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!838 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!839 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!840 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!841 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!842 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!843 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!844 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!845 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!846 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!847 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !495, line: 538, size: 32, align: 32, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857}
!850 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!851 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!852 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!853 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!854 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!855 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!856 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!857 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !35, line: 1534, size: 32, align: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!861 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!862 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!863 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !888, line: 782, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!889 = !{!890, !891, !892, !893, !894, !895}
!890 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!891 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!892 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!893 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!894 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!895 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !35, line: 5085, size: 32, align: 32, elements: !897)
!897 = !{!898, !899, !900, !901}
!898 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!899 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!900 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!901 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!902 = !{!903}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVReplayGain", file: !905, line: 48, baseType: !906)
!905 = !DIFile(filename: "./libavutil/replaygain.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVReplayGain", file: !905, line: 29, size: 128, align: 32, elements: !907)
!907 = !{!908, !912, !915, !916}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "track_gain", scope: !906, file: !905, line: 34, baseType: !909, size: 32, align: 32)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !910, line: 38, baseType: !911)
!910 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!911 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "track_peak", scope: !906, file: !905, line: 39, baseType: !913, size: 32, align: 32, offset: 32)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !910, line: 51, baseType: !914)
!914 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "album_gain", scope: !906, file: !905, line: 43, baseType: !909, size: 32, align: 32, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "album_peak", scope: !906, file: !905, line: 47, baseType: !913, size: 32, align: 32, offset: 96)
!917 = !{i32 2, !"Dwarf Version", i32 4}
!918 = !{i32 2, !"Debug Info Version", i32 3}
!919 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!920 = distinct !DISubprogram(name: "ff_replaygain_export_raw", scope: !921, file: !921, line: 70, type: !922, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1802)
!921 = !DIFile(filename: "libavformat/replaygain.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!922 = !DISubroutineType(types: !923)
!923 = !{!911, !924, !909, !913, !909, !913}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !888, line: 1223, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !888, line: 865, size: 6144, align: 64, elements: !927)
!927 = !{!928, !929, !930, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1578, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1679, !1685, !1694, !1698, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1730, !1731, !1732, !1733, !1734, !1735}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !926, file: !888, line: 866, baseType: !911, size: 32, align: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !926, file: !888, line: 872, baseType: !911, size: 32, align: 32, offset: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !926, file: !888, line: 878, baseType: !931, size: 64, align: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !934)
!934 = !{!935, !980, !981, !982, !1251, !1252, !1253, !1254, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1280, !1284, !1285, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1466, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !933, file: !35, line: 1561, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !940)
!940 = !{!941, !945, !950, !954, !955, !956, !957, !961, !967, !969, !973}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !939, file: !4, line: 72, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !939, file: !4, line: 78, baseType: !946, size: 64, align: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!942, !949}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !939, file: !4, line: 85, baseType: !951, size: 64, align: 64, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !939, file: !4, line: 93, baseType: !911, size: 32, align: 32, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !939, file: !4, line: 99, baseType: !911, size: 32, align: 32, offset: 224)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !939, file: !4, line: 108, baseType: !911, size: 32, align: 32, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !939, file: !4, line: 113, baseType: !958, size: 64, align: 64, offset: 320)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!949, !949, !949}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !939, file: !4, line: 123, baseType: !962, size: 64, align: 64, offset: 384)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!965, !965}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !939, file: !4, line: 130, baseType: !968, size: 32, align: 32, offset: 448)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !939, file: !4, line: 136, baseType: !970, size: 64, align: 64, offset: 512)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!968, !949}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !939, file: !4, line: 142, baseType: !974, size: 64, align: 64, offset: 576)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!911, !977, !949, !942, !911}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !933, file: !35, line: 1562, baseType: !911, size: 32, align: 32, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !933, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !933, file: !35, line: 1565, baseType: !983, size: 64, align: 64, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !986)
!986 = !{!987, !988, !989, !990, !991, !992, !1001, !1004, !1007, !1010, !1015, !1018, !1019, !1027, !1028, !1029, !1031, !1035, !1041, !1046, !1050, !1051, !1101, !1222, !1226, !1227, !1231, !1235, !1240, !1244, !1245, !1246}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !985, file: !35, line: 3475, baseType: !942, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !985, file: !35, line: 3480, baseType: !942, size: 64, align: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !985, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !985, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !985, file: !35, line: 3487, baseType: !911, size: 32, align: 32, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !985, file: !35, line: 3488, baseType: !993, size: 64, align: 64, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !996, line: 61, baseType: !997)
!996 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !996, line: 58, size: 64, align: 32, elements: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !997, file: !996, line: 59, baseType: !911, size: 32, align: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !997, file: !996, line: 60, baseType: !911, size: 32, align: 32, offset: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !985, file: !35, line: 3489, baseType: !1002, size: 64, align: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !985, file: !35, line: 3490, baseType: !1005, size: 64, align: 64, offset: 384)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !911)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !985, file: !35, line: 3491, baseType: !1008, size: 64, align: 64, offset: 448)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !985, file: !35, line: 3492, baseType: !1011, size: 64, align: 64, offset: 512)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !910, line: 55, baseType: !1014)
!1014 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !985, file: !35, line: 3493, baseType: !1016, size: 8, align: 8, offset: 576)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !910, line: 48, baseType: !1017)
!1017 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !985, file: !35, line: 3494, baseType: !936, size: 64, align: 64, offset: 640)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !985, file: !35, line: 3495, baseType: !1020, size: 64, align: 64, offset: 704)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1023, file: !35, line: 3402, baseType: !911, size: 32, align: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1023, file: !35, line: 3403, baseType: !942, size: 64, align: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !985, file: !35, line: 3507, baseType: !942, size: 64, align: 64, offset: 768)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !985, file: !35, line: 3516, baseType: !911, size: 32, align: 32, offset: 832)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !985, file: !35, line: 3517, baseType: !1030, size: 64, align: 64, offset: 896)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !985, file: !35, line: 3527, baseType: !1032, size: 64, align: 64, offset: 960)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!911, !931}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !985, file: !35, line: 3535, baseType: !1036, size: 64, align: 64, offset: 1024)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!911, !931, !1039}
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !985, file: !35, line: 3541, baseType: !1042, size: 64, align: 64, offset: 1088)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1044)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1045)
!1045 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !985, file: !35, line: 3549, baseType: !1047, size: 64, align: 64, offset: 1152)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{null, !1030}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !985, file: !35, line: 3551, baseType: !1032, size: 64, align: 64, offset: 1216)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !985, file: !35, line: 3552, baseType: !1052, size: 64, align: 64, offset: 1280)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!911, !931, !1055, !911, !1056}
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1059)
!1059 = !{!1060, !1063, !1064, !1065, !1066, !1098}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1058, file: !35, line: 3921, baseType: !1061, size: 16, align: 16)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !910, line: 49, baseType: !1062)
!1062 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1058, file: !35, line: 3922, baseType: !913, size: 32, align: 32, offset: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1058, file: !35, line: 3923, baseType: !913, size: 32, align: 32, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1058, file: !35, line: 3924, baseType: !914, size: 32, align: 32, offset: 96)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1058, file: !35, line: 3925, baseType: !1067, size: 64, align: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1070)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075, !1076, !1077, !1087, !1091, !1093, !1094, !1096, !1097}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1070, file: !35, line: 3886, baseType: !911, size: 32, align: 32)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1070, file: !35, line: 3887, baseType: !911, size: 32, align: 32, offset: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1070, file: !35, line: 3888, baseType: !911, size: 32, align: 32, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1070, file: !35, line: 3889, baseType: !911, size: 32, align: 32, offset: 96)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1070, file: !35, line: 3890, baseType: !911, size: 32, align: 32, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1070, file: !35, line: 3897, baseType: !1078, size: 768, align: 64, offset: 192)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1080)
!1080 = !{!1081, !1085}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1079, file: !35, line: 3855, baseType: !1082, size: 512, align: 64)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 512, align: 64, elements: !1083)
!1083 = !{!1084}
!1084 = !DISubrange(count: 8)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1079, file: !35, line: 3857, baseType: !1086, size: 256, align: 32, offset: 512)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !911, size: 256, align: 32, elements: !1083)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1070, file: !35, line: 3903, baseType: !1088, size: 256, align: 64, offset: 960)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 256, align: 64, elements: !1089)
!1089 = !{!1090}
!1090 = !DISubrange(count: 4)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1070, file: !35, line: 3904, baseType: !1092, size: 128, align: 32, offset: 1216)
!1092 = !DICompositeType(tag: DW_TAG_array_type, baseType: !911, size: 128, align: 32, elements: !1089)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1070, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1070, file: !35, line: 3908, baseType: !1095, size: 64, align: 64, offset: 1408)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1070, file: !35, line: 3915, baseType: !1095, size: 64, align: 64, offset: 1472)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1070, file: !35, line: 3917, baseType: !911, size: 32, align: 32, offset: 1536)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1058, file: !35, line: 3926, baseType: !1099, size: 64, align: 64, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !910, line: 40, baseType: !1100)
!1100 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !985, file: !35, line: 3564, baseType: !1102, size: 64, align: 64, offset: 1344)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!911, !931, !1105, !1139, !1221}
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1108)
!1108 = !{!1109, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1135, !1136, !1137, !1138}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1107, file: !35, line: 1451, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1112, line: 94, baseType: !1113)
!1112 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1112, line: 81, size: 192, align: 64, elements: !1114)
!1114 = !{!1115, !1119, !1120}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1113, file: !1112, line: 82, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1112, line: 73, baseType: !1118)
!1118 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1112, line: 73, flags: DIFlagFwdDecl)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1113, file: !1112, line: 89, baseType: !1055, size: 64, align: 64, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1113, file: !1112, line: 93, baseType: !911, size: 32, align: 32, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1107, file: !35, line: 1461, baseType: !1099, size: 64, align: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1107, file: !35, line: 1467, baseType: !1099, size: 64, align: 64, offset: 128)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1107, file: !35, line: 1468, baseType: !1055, size: 64, align: 64, offset: 192)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1107, file: !35, line: 1469, baseType: !911, size: 32, align: 32, offset: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1107, file: !35, line: 1470, baseType: !911, size: 32, align: 32, offset: 288)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1107, file: !35, line: 1474, baseType: !911, size: 32, align: 32, offset: 320)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1107, file: !35, line: 1479, baseType: !1128, size: 64, align: 64, offset: 384)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1130)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1131)
!1131 = !{!1132, !1133, !1134}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1130, file: !35, line: 1412, baseType: !1055, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1130, file: !35, line: 1413, baseType: !911, size: 32, align: 32, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1130, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1107, file: !35, line: 1480, baseType: !911, size: 32, align: 32, offset: 448)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1107, file: !35, line: 1486, baseType: !1099, size: 64, align: 64, offset: 512)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1107, file: !35, line: 1488, baseType: !1099, size: 64, align: 64, offset: 576)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1107, file: !35, line: 1497, baseType: !1099, size: 64, align: 64, offset: 640)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1141)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1142)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1143)
!1143 = !{!1144, !1145, !1146, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1173, !1175, !1176, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1209, !1210, !1211, !1212, !1213, !1214, !1217, !1218, !1219, !1220}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1142, file: !758, line: 282, baseType: !1082, size: 512, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1142, file: !758, line: 299, baseType: !1086, size: 256, align: 32, offset: 512)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1142, file: !758, line: 315, baseType: !1147, size: 64, align: 64, offset: 768)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1142, file: !758, line: 326, baseType: !911, size: 32, align: 32, offset: 832)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1142, file: !758, line: 326, baseType: !911, size: 32, align: 32, offset: 864)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1142, file: !758, line: 334, baseType: !911, size: 32, align: 32, offset: 896)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1142, file: !758, line: 341, baseType: !911, size: 32, align: 32, offset: 928)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1142, file: !758, line: 346, baseType: !911, size: 32, align: 32, offset: 960)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1142, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1142, file: !758, line: 356, baseType: !995, size: 64, align: 32, offset: 1024)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1142, file: !758, line: 361, baseType: !1099, size: 64, align: 64, offset: 1088)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1142, file: !758, line: 369, baseType: !1099, size: 64, align: 64, offset: 1152)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1142, file: !758, line: 377, baseType: !1099, size: 64, align: 64, offset: 1216)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1142, file: !758, line: 382, baseType: !911, size: 32, align: 32, offset: 1280)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1142, file: !758, line: 386, baseType: !911, size: 32, align: 32, offset: 1312)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1142, file: !758, line: 391, baseType: !911, size: 32, align: 32, offset: 1344)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1142, file: !758, line: 396, baseType: !949, size: 64, align: 64, offset: 1408)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1142, file: !758, line: 403, baseType: !1163, size: 512, align: 64, offset: 1472)
!1163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1013, size: 512, align: 64, elements: !1083)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1142, file: !758, line: 410, baseType: !911, size: 32, align: 32, offset: 1984)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1142, file: !758, line: 415, baseType: !911, size: 32, align: 32, offset: 2016)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1142, file: !758, line: 420, baseType: !911, size: 32, align: 32, offset: 2048)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1142, file: !758, line: 425, baseType: !911, size: 32, align: 32, offset: 2080)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1142, file: !758, line: 435, baseType: !1099, size: 64, align: 64, offset: 2112)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1142, file: !758, line: 440, baseType: !911, size: 32, align: 32, offset: 2176)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1142, file: !758, line: 445, baseType: !1013, size: 64, align: 64, offset: 2240)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1142, file: !758, line: 459, baseType: !1172, size: 512, align: 64, offset: 2304)
!1172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1110, size: 512, align: 64, elements: !1083)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1142, file: !758, line: 473, baseType: !1174, size: 64, align: 64, offset: 2816)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1142, file: !758, line: 477, baseType: !911, size: 32, align: 32, offset: 2880)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1142, file: !758, line: 479, baseType: !1177, size: 64, align: 64, offset: 2944)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1180)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1181)
!1181 = !{!1182, !1183, !1184, !1185, !1190}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1180, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1180, file: !758, line: 203, baseType: !1055, size: 64, align: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1180, file: !758, line: 204, baseType: !911, size: 32, align: 32, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1180, file: !758, line: 205, baseType: !1186, size: 64, align: 64, offset: 192)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1188, line: 86, baseType: !1189)
!1188 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1188, line: 86, flags: DIFlagFwdDecl)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1180, file: !758, line: 206, baseType: !1110, size: 64, align: 64, offset: 256)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1142, file: !758, line: 480, baseType: !911, size: 32, align: 32, offset: 3008)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1142, file: !758, line: 505, baseType: !911, size: 32, align: 32, offset: 3040)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1142, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1142, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1142, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1142, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1142, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1142, file: !758, line: 532, baseType: !1099, size: 64, align: 64, offset: 3264)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1142, file: !758, line: 539, baseType: !1099, size: 64, align: 64, offset: 3328)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1142, file: !758, line: 547, baseType: !1099, size: 64, align: 64, offset: 3392)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1142, file: !758, line: 554, baseType: !1186, size: 64, align: 64, offset: 3456)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1142, file: !758, line: 563, baseType: !911, size: 32, align: 32, offset: 3520)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1142, file: !758, line: 572, baseType: !911, size: 32, align: 32, offset: 3552)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1142, file: !758, line: 581, baseType: !911, size: 32, align: 32, offset: 3584)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1142, file: !758, line: 588, baseType: !1206, size: 64, align: 64, offset: 3648)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !910, line: 36, baseType: !1208)
!1208 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1142, file: !758, line: 593, baseType: !911, size: 32, align: 32, offset: 3712)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1142, file: !758, line: 596, baseType: !911, size: 32, align: 32, offset: 3744)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1142, file: !758, line: 599, baseType: !1110, size: 64, align: 64, offset: 3776)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1142, file: !758, line: 605, baseType: !1110, size: 64, align: 64, offset: 3840)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1142, file: !758, line: 616, baseType: !1110, size: 64, align: 64, offset: 3904)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1142, file: !758, line: 626, baseType: !1215, size: 64, align: 64, offset: 3968)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1216, line: 216, baseType: !1014)
!1216 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1142, file: !758, line: 627, baseType: !1215, size: 64, align: 64, offset: 4032)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1142, file: !758, line: 628, baseType: !1215, size: 64, align: 64, offset: 4096)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1142, file: !758, line: 629, baseType: !1215, size: 64, align: 64, offset: 4160)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1142, file: !758, line: 645, baseType: !1110, size: 64, align: 64, offset: 4224)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !985, file: !35, line: 3566, baseType: !1223, size: 64, align: 64, offset: 1408)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!911, !931, !949, !1221, !1105}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !985, file: !35, line: 3567, baseType: !1032, size: 64, align: 64, offset: 1472)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !985, file: !35, line: 3576, baseType: !1228, size: 64, align: 64, offset: 1536)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!911, !931, !1139}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !985, file: !35, line: 3577, baseType: !1232, size: 64, align: 64, offset: 1600)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!911, !931, !1105}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !985, file: !35, line: 3584, baseType: !1236, size: 64, align: 64, offset: 1664)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!911, !931, !1239}
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !985, file: !35, line: 3589, baseType: !1241, size: 64, align: 64, offset: 1728)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{null, !931}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !985, file: !35, line: 3594, baseType: !911, size: 32, align: 32, offset: 1792)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !985, file: !35, line: 3600, baseType: !942, size: 64, align: 64, offset: 1856)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !985, file: !35, line: 3609, baseType: !1247, size: 64, align: 64, offset: 1920)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1250)
!1250 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !933, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !933, file: !35, line: 1581, baseType: !914, size: 32, align: 32, offset: 224)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !933, file: !35, line: 1583, baseType: !949, size: 64, align: 64, offset: 256)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !933, file: !35, line: 1591, baseType: !1255, size: 64, align: 64, offset: 320)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !933, file: !35, line: 1598, baseType: !949, size: 64, align: 64, offset: 384)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !933, file: !35, line: 1606, baseType: !1099, size: 64, align: 64, offset: 448)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !933, file: !35, line: 1614, baseType: !911, size: 32, align: 32, offset: 512)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !933, file: !35, line: 1622, baseType: !911, size: 32, align: 32, offset: 544)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !933, file: !35, line: 1628, baseType: !911, size: 32, align: 32, offset: 576)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !933, file: !35, line: 1636, baseType: !911, size: 32, align: 32, offset: 608)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !933, file: !35, line: 1643, baseType: !911, size: 32, align: 32, offset: 640)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !933, file: !35, line: 1657, baseType: !1055, size: 64, align: 64, offset: 704)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !933, file: !35, line: 1658, baseType: !911, size: 32, align: 32, offset: 768)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !933, file: !35, line: 1679, baseType: !995, size: 64, align: 32, offset: 800)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !933, file: !35, line: 1688, baseType: !911, size: 32, align: 32, offset: 864)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !933, file: !35, line: 1712, baseType: !911, size: 32, align: 32, offset: 896)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !933, file: !35, line: 1729, baseType: !911, size: 32, align: 32, offset: 928)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !933, file: !35, line: 1729, baseType: !911, size: 32, align: 32, offset: 960)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !933, file: !35, line: 1744, baseType: !911, size: 32, align: 32, offset: 992)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !933, file: !35, line: 1744, baseType: !911, size: 32, align: 32, offset: 1024)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !933, file: !35, line: 1751, baseType: !911, size: 32, align: 32, offset: 1056)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !933, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !933, file: !35, line: 1791, baseType: !1276, size: 64, align: 64, offset: 1152)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{null, !1279, !1139, !1221, !911, !911, !911}
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !933, file: !35, line: 1808, baseType: !1281, size: 64, align: 64, offset: 1216)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{!494, !1279, !1002}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !933, file: !35, line: 1816, baseType: !911, size: 32, align: 32, offset: 1280)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !933, file: !35, line: 1825, baseType: !1286, size: 32, align: 32, offset: 1312)
!1286 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !933, file: !35, line: 1830, baseType: !911, size: 32, align: 32, offset: 1344)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !933, file: !35, line: 1838, baseType: !1286, size: 32, align: 32, offset: 1376)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !933, file: !35, line: 1846, baseType: !911, size: 32, align: 32, offset: 1408)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !933, file: !35, line: 1851, baseType: !911, size: 32, align: 32, offset: 1440)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !933, file: !35, line: 1861, baseType: !1286, size: 32, align: 32, offset: 1472)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !933, file: !35, line: 1868, baseType: !1286, size: 32, align: 32, offset: 1504)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !933, file: !35, line: 1875, baseType: !1286, size: 32, align: 32, offset: 1536)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !933, file: !35, line: 1882, baseType: !1286, size: 32, align: 32, offset: 1568)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !933, file: !35, line: 1889, baseType: !1286, size: 32, align: 32, offset: 1600)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !933, file: !35, line: 1896, baseType: !1286, size: 32, align: 32, offset: 1632)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !933, file: !35, line: 1903, baseType: !1286, size: 32, align: 32, offset: 1664)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !933, file: !35, line: 1910, baseType: !911, size: 32, align: 32, offset: 1696)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !933, file: !35, line: 1915, baseType: !911, size: 32, align: 32, offset: 1728)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !933, file: !35, line: 1926, baseType: !1221, size: 64, align: 64, offset: 1792)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !933, file: !35, line: 1935, baseType: !995, size: 64, align: 32, offset: 1856)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !933, file: !35, line: 1942, baseType: !911, size: 32, align: 32, offset: 1920)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !933, file: !35, line: 1948, baseType: !911, size: 32, align: 32, offset: 1952)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !933, file: !35, line: 1954, baseType: !911, size: 32, align: 32, offset: 1984)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !933, file: !35, line: 1960, baseType: !911, size: 32, align: 32, offset: 2016)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !933, file: !35, line: 1984, baseType: !911, size: 32, align: 32, offset: 2048)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !933, file: !35, line: 1991, baseType: !911, size: 32, align: 32, offset: 2080)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !933, file: !35, line: 1996, baseType: !911, size: 32, align: 32, offset: 2112)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !933, file: !35, line: 2004, baseType: !911, size: 32, align: 32, offset: 2144)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !933, file: !35, line: 2011, baseType: !911, size: 32, align: 32, offset: 2176)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !933, file: !35, line: 2018, baseType: !911, size: 32, align: 32, offset: 2208)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !933, file: !35, line: 2027, baseType: !911, size: 32, align: 32, offset: 2240)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !933, file: !35, line: 2034, baseType: !911, size: 32, align: 32, offset: 2272)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !933, file: !35, line: 2044, baseType: !911, size: 32, align: 32, offset: 2304)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !933, file: !35, line: 2054, baseType: !1316, size: 64, align: 64, offset: 2368)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !933, file: !35, line: 2061, baseType: !1316, size: 64, align: 64, offset: 2432)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !933, file: !35, line: 2066, baseType: !911, size: 32, align: 32, offset: 2496)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !933, file: !35, line: 2070, baseType: !911, size: 32, align: 32, offset: 2528)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !933, file: !35, line: 2078, baseType: !911, size: 32, align: 32, offset: 2560)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !933, file: !35, line: 2085, baseType: !911, size: 32, align: 32, offset: 2592)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !933, file: !35, line: 2092, baseType: !911, size: 32, align: 32, offset: 2624)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !933, file: !35, line: 2099, baseType: !911, size: 32, align: 32, offset: 2656)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !933, file: !35, line: 2106, baseType: !911, size: 32, align: 32, offset: 2688)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !933, file: !35, line: 2113, baseType: !911, size: 32, align: 32, offset: 2720)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !933, file: !35, line: 2120, baseType: !911, size: 32, align: 32, offset: 2752)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !933, file: !35, line: 2125, baseType: !911, size: 32, align: 32, offset: 2784)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !933, file: !35, line: 2133, baseType: !911, size: 32, align: 32, offset: 2816)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !933, file: !35, line: 2140, baseType: !911, size: 32, align: 32, offset: 2848)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !933, file: !35, line: 2145, baseType: !911, size: 32, align: 32, offset: 2880)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !933, file: !35, line: 2153, baseType: !911, size: 32, align: 32, offset: 2912)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !933, file: !35, line: 2158, baseType: !911, size: 32, align: 32, offset: 2944)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !933, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !933, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !933, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !933, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !933, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !933, file: !35, line: 2203, baseType: !911, size: 32, align: 32, offset: 3136)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !933, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !933, file: !35, line: 2212, baseType: !911, size: 32, align: 32, offset: 3200)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !933, file: !35, line: 2213, baseType: !911, size: 32, align: 32, offset: 3232)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !933, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !933, file: !35, line: 2232, baseType: !911, size: 32, align: 32, offset: 3296)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !933, file: !35, line: 2243, baseType: !911, size: 32, align: 32, offset: 3328)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !933, file: !35, line: 2249, baseType: !911, size: 32, align: 32, offset: 3360)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !933, file: !35, line: 2256, baseType: !911, size: 32, align: 32, offset: 3392)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !933, file: !35, line: 2263, baseType: !1013, size: 64, align: 64, offset: 3456)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !933, file: !35, line: 2270, baseType: !1013, size: 64, align: 64, offset: 3520)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !933, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !933, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !933, file: !35, line: 2367, baseType: !1352, size: 64, align: 64, offset: 3648)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DISubroutineType(types: !1354)
!1354 = !{!911, !1279, !1239, !911}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !933, file: !35, line: 2383, baseType: !911, size: 32, align: 32, offset: 3712)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !933, file: !35, line: 2386, baseType: !1286, size: 32, align: 32, offset: 3744)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !933, file: !35, line: 2387, baseType: !1286, size: 32, align: 32, offset: 3776)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !933, file: !35, line: 2394, baseType: !911, size: 32, align: 32, offset: 3808)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !933, file: !35, line: 2401, baseType: !911, size: 32, align: 32, offset: 3840)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !933, file: !35, line: 2408, baseType: !911, size: 32, align: 32, offset: 3872)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !933, file: !35, line: 2415, baseType: !911, size: 32, align: 32, offset: 3904)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !933, file: !35, line: 2422, baseType: !911, size: 32, align: 32, offset: 3936)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !933, file: !35, line: 2423, baseType: !1364, size: 64, align: 64, offset: 3968)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1366)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1367)
!1367 = !{!1368, !1369, !1370, !1371}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1366, file: !35, line: 827, baseType: !911, size: 32, align: 32)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1366, file: !35, line: 828, baseType: !911, size: 32, align: 32, offset: 32)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1366, file: !35, line: 829, baseType: !911, size: 32, align: 32, offset: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1366, file: !35, line: 830, baseType: !1286, size: 32, align: 32, offset: 96)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !933, file: !35, line: 2430, baseType: !1099, size: 64, align: 64, offset: 4032)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !933, file: !35, line: 2437, baseType: !1099, size: 64, align: 64, offset: 4096)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !933, file: !35, line: 2444, baseType: !1286, size: 32, align: 32, offset: 4160)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !933, file: !35, line: 2451, baseType: !1286, size: 32, align: 32, offset: 4192)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !933, file: !35, line: 2458, baseType: !911, size: 32, align: 32, offset: 4224)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !933, file: !35, line: 2469, baseType: !911, size: 32, align: 32, offset: 4256)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !933, file: !35, line: 2475, baseType: !911, size: 32, align: 32, offset: 4288)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !933, file: !35, line: 2481, baseType: !911, size: 32, align: 32, offset: 4320)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !933, file: !35, line: 2485, baseType: !911, size: 32, align: 32, offset: 4352)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !933, file: !35, line: 2489, baseType: !911, size: 32, align: 32, offset: 4384)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !933, file: !35, line: 2493, baseType: !911, size: 32, align: 32, offset: 4416)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !933, file: !35, line: 2501, baseType: !911, size: 32, align: 32, offset: 4448)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !933, file: !35, line: 2506, baseType: !911, size: 32, align: 32, offset: 4480)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !933, file: !35, line: 2510, baseType: !911, size: 32, align: 32, offset: 4512)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !933, file: !35, line: 2514, baseType: !1099, size: 64, align: 64, offset: 4544)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !933, file: !35, line: 2528, baseType: !1388, size: 64, align: 64, offset: 4608)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DISubroutineType(types: !1390)
!1390 = !{null, !1279, !949, !911, !911}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !933, file: !35, line: 2534, baseType: !911, size: 32, align: 32, offset: 4672)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !933, file: !35, line: 2545, baseType: !911, size: 32, align: 32, offset: 4704)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !933, file: !35, line: 2547, baseType: !911, size: 32, align: 32, offset: 4736)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !933, file: !35, line: 2549, baseType: !911, size: 32, align: 32, offset: 4768)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !933, file: !35, line: 2551, baseType: !911, size: 32, align: 32, offset: 4800)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !933, file: !35, line: 2553, baseType: !911, size: 32, align: 32, offset: 4832)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !933, file: !35, line: 2555, baseType: !911, size: 32, align: 32, offset: 4864)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !933, file: !35, line: 2557, baseType: !911, size: 32, align: 32, offset: 4896)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !933, file: !35, line: 2559, baseType: !911, size: 32, align: 32, offset: 4928)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !933, file: !35, line: 2563, baseType: !911, size: 32, align: 32, offset: 4960)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !933, file: !35, line: 2571, baseType: !1095, size: 64, align: 64, offset: 4992)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !933, file: !35, line: 2579, baseType: !1095, size: 64, align: 64, offset: 5056)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !933, file: !35, line: 2586, baseType: !911, size: 32, align: 32, offset: 5120)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !933, file: !35, line: 2615, baseType: !911, size: 32, align: 32, offset: 5152)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !933, file: !35, line: 2627, baseType: !911, size: 32, align: 32, offset: 5184)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !933, file: !35, line: 2637, baseType: !911, size: 32, align: 32, offset: 5216)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !933, file: !35, line: 2681, baseType: !911, size: 32, align: 32, offset: 5248)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !933, file: !35, line: 2709, baseType: !1099, size: 64, align: 64, offset: 5312)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !933, file: !35, line: 2716, baseType: !1410, size: 64, align: 64, offset: 5376)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1412)
!1412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1413)
!1413 = !{!1414, !1415, !1416, !1417, !1418, !1419, !1420, !1426, !1430, !1431, !1432, !1433, !1439, !1440, !1441, !1442, !1443}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1412, file: !35, line: 3642, baseType: !942, size: 64, align: 64)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1412, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1412, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1412, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1412, file: !35, line: 3669, baseType: !911, size: 32, align: 32, offset: 160)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1412, file: !35, line: 3682, baseType: !1236, size: 64, align: 64, offset: 192)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1412, file: !35, line: 3698, baseType: !1421, size: 64, align: 64, offset: 256)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{!911, !931, !1424, !913}
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1412, file: !35, line: 3712, baseType: !1427, size: 64, align: 64, offset: 320)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!911, !931, !911, !1424, !913}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1412, file: !35, line: 3726, baseType: !1421, size: 64, align: 64, offset: 384)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1412, file: !35, line: 3737, baseType: !1032, size: 64, align: 64, offset: 448)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1412, file: !35, line: 3746, baseType: !911, size: 32, align: 32, offset: 512)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1412, file: !35, line: 3757, baseType: !1434, size: 64, align: 64, offset: 576)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DISubroutineType(types: !1436)
!1436 = !{null, !1437}
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1412, file: !35, line: 3766, baseType: !1032, size: 64, align: 64, offset: 640)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1412, file: !35, line: 3774, baseType: !1032, size: 64, align: 64, offset: 704)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1412, file: !35, line: 3780, baseType: !911, size: 32, align: 32, offset: 768)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1412, file: !35, line: 3785, baseType: !911, size: 32, align: 32, offset: 800)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1412, file: !35, line: 3795, baseType: !1444, size: 64, align: 64, offset: 832)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DISubroutineType(types: !1446)
!1446 = !{!911, !931, !1110}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !933, file: !35, line: 2728, baseType: !949, size: 64, align: 64, offset: 5440)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !933, file: !35, line: 2735, baseType: !1163, size: 512, align: 64, offset: 5504)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !933, file: !35, line: 2742, baseType: !911, size: 32, align: 32, offset: 6016)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !933, file: !35, line: 2755, baseType: !911, size: 32, align: 32, offset: 6048)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !933, file: !35, line: 2776, baseType: !911, size: 32, align: 32, offset: 6080)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !933, file: !35, line: 2783, baseType: !911, size: 32, align: 32, offset: 6112)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !933, file: !35, line: 2791, baseType: !911, size: 32, align: 32, offset: 6144)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !933, file: !35, line: 2802, baseType: !1239, size: 64, align: 64, offset: 6208)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !933, file: !35, line: 2811, baseType: !911, size: 32, align: 32, offset: 6272)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !933, file: !35, line: 2821, baseType: !911, size: 32, align: 32, offset: 6304)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !933, file: !35, line: 2830, baseType: !911, size: 32, align: 32, offset: 6336)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !933, file: !35, line: 2840, baseType: !911, size: 32, align: 32, offset: 6368)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !933, file: !35, line: 2851, baseType: !1460, size: 64, align: 64, offset: 6400)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DISubroutineType(types: !1462)
!1462 = !{!911, !1279, !1463, !949, !1221, !911, !911}
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DISubroutineType(types: !1465)
!1465 = !{!911, !1279, !949}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !933, file: !35, line: 2871, baseType: !1467, size: 64, align: 64, offset: 6464)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DISubroutineType(types: !1469)
!1469 = !{!911, !1279, !1470, !949, !1221, !911}
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{!911, !1279, !949, !911, !911}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !933, file: !35, line: 2878, baseType: !911, size: 32, align: 32, offset: 6528)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !933, file: !35, line: 2885, baseType: !911, size: 32, align: 32, offset: 6560)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !933, file: !35, line: 3005, baseType: !911, size: 32, align: 32, offset: 6592)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !933, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !933, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !933, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !933, file: !35, line: 3037, baseType: !1055, size: 64, align: 64, offset: 6720)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !933, file: !35, line: 3038, baseType: !911, size: 32, align: 32, offset: 6784)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !933, file: !35, line: 3050, baseType: !1013, size: 64, align: 64, offset: 6848)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !933, file: !35, line: 3065, baseType: !911, size: 32, align: 32, offset: 6912)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !933, file: !35, line: 3083, baseType: !911, size: 32, align: 32, offset: 6944)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !933, file: !35, line: 3092, baseType: !995, size: 64, align: 32, offset: 6976)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !933, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !933, file: !35, line: 3106, baseType: !995, size: 64, align: 32, offset: 7072)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !933, file: !35, line: 3113, baseType: !1488, size: 64, align: 64, offset: 7168)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1490)
!1490 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1491)
!1491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1492)
!1492 = !{!1493, !1494, !1495, !1496, !1497, !1498, !1501}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1491, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1491, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1491, file: !35, line: 720, baseType: !942, size: 64, align: 64, offset: 64)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1491, file: !35, line: 724, baseType: !942, size: 64, align: 64, offset: 128)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1491, file: !35, line: 728, baseType: !911, size: 32, align: 32, offset: 192)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1491, file: !35, line: 734, baseType: !1499, size: 64, align: 64, offset: 256)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1491, file: !35, line: 739, baseType: !1502, size: 64, align: 64, offset: 320)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !933, file: !35, line: 3129, baseType: !1099, size: 64, align: 64, offset: 7232)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !933, file: !35, line: 3130, baseType: !1099, size: 64, align: 64, offset: 7296)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !933, file: !35, line: 3131, baseType: !1099, size: 64, align: 64, offset: 7360)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !933, file: !35, line: 3132, baseType: !1099, size: 64, align: 64, offset: 7424)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !933, file: !35, line: 3139, baseType: !1095, size: 64, align: 64, offset: 7488)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !933, file: !35, line: 3147, baseType: !911, size: 32, align: 32, offset: 7552)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !933, file: !35, line: 3165, baseType: !911, size: 32, align: 32, offset: 7584)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !933, file: !35, line: 3172, baseType: !911, size: 32, align: 32, offset: 7616)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !933, file: !35, line: 3180, baseType: !911, size: 32, align: 32, offset: 7648)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !933, file: !35, line: 3191, baseType: !1316, size: 64, align: 64, offset: 7680)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !933, file: !35, line: 3199, baseType: !1055, size: 64, align: 64, offset: 7744)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !933, file: !35, line: 3207, baseType: !1095, size: 64, align: 64, offset: 7808)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !933, file: !35, line: 3214, baseType: !914, size: 32, align: 32, offset: 7872)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !933, file: !35, line: 3224, baseType: !1128, size: 64, align: 64, offset: 7936)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !933, file: !35, line: 3225, baseType: !911, size: 32, align: 32, offset: 8000)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !933, file: !35, line: 3249, baseType: !1110, size: 64, align: 64, offset: 8064)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !933, file: !35, line: 3256, baseType: !911, size: 32, align: 32, offset: 8128)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !933, file: !35, line: 3271, baseType: !911, size: 32, align: 32, offset: 8160)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !933, file: !35, line: 3279, baseType: !1099, size: 64, align: 64, offset: 8192)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !933, file: !35, line: 3301, baseType: !1110, size: 64, align: 64, offset: 8256)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !933, file: !35, line: 3310, baseType: !911, size: 32, align: 32, offset: 8320)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !933, file: !35, line: 3337, baseType: !911, size: 32, align: 32, offset: 8352)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !933, file: !35, line: 3351, baseType: !911, size: 32, align: 32, offset: 8384)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !933, file: !35, line: 3359, baseType: !911, size: 32, align: 32, offset: 8416)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !926, file: !888, line: 880, baseType: !949, size: 64, align: 64, offset: 128)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !926, file: !888, line: 894, baseType: !995, size: 64, align: 32, offset: 192)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !926, file: !888, line: 904, baseType: !1099, size: 64, align: 64, offset: 256)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !926, file: !888, line: 914, baseType: !1099, size: 64, align: 64, offset: 320)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "nb_frames", scope: !926, file: !888, line: 916, baseType: !1099, size: 64, align: 64, offset: 384)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "disposition", scope: !926, file: !888, line: 918, baseType: !911, size: 32, align: 32, offset: 448)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "discard", scope: !926, file: !888, line: 920, baseType: !878, size: 32, align: 32, offset: 480)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !926, file: !888, line: 927, baseType: !995, size: 64, align: 32, offset: 512)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !926, file: !888, line: 929, baseType: !1186, size: 64, align: 64, offset: 576)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "avg_frame_rate", scope: !926, file: !888, line: 938, baseType: !995, size: 64, align: 32, offset: 640)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "attached_pic", scope: !926, file: !888, line: 947, baseType: !1106, size: 704, align: 64, offset: 704)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !926, file: !888, line: 967, baseType: !1128, size: 64, align: 64, offset: 1408)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !926, file: !888, line: 971, baseType: !911, size: 32, align: 32, offset: 1472)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "event_flags", scope: !926, file: !888, line: 978, baseType: !911, size: 32, align: 32, offset: 1504)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "r_frame_rate", scope: !926, file: !888, line: 989, baseType: !995, size: 64, align: 32, offset: 1536)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "recommended_encoder_configuration", scope: !926, file: !888, line: 1000, baseType: !1095, size: 64, align: 64, offset: 1600)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "codecpar", scope: !926, file: !888, line: 1012, baseType: !1545, size: 64, align: 64, offset: 1664)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1547)
!1547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1548)
!1548 = !{!1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1547, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1547, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1547, file: !35, line: 3948, baseType: !913, size: 32, align: 32, offset: 64)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1547, file: !35, line: 3958, baseType: !1055, size: 64, align: 64, offset: 128)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1547, file: !35, line: 3962, baseType: !911, size: 32, align: 32, offset: 192)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1547, file: !35, line: 3968, baseType: !911, size: 32, align: 32, offset: 224)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1547, file: !35, line: 3973, baseType: !1099, size: 64, align: 64, offset: 256)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1547, file: !35, line: 3986, baseType: !911, size: 32, align: 32, offset: 320)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1547, file: !35, line: 3999, baseType: !911, size: 32, align: 32, offset: 352)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1547, file: !35, line: 4004, baseType: !911, size: 32, align: 32, offset: 384)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1547, file: !35, line: 4005, baseType: !911, size: 32, align: 32, offset: 416)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1547, file: !35, line: 4010, baseType: !911, size: 32, align: 32, offset: 448)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1547, file: !35, line: 4011, baseType: !911, size: 32, align: 32, offset: 480)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1547, file: !35, line: 4020, baseType: !995, size: 64, align: 32, offset: 512)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1547, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1547, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1547, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1547, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1547, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1547, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1547, file: !35, line: 4039, baseType: !911, size: 32, align: 32, offset: 768)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1547, file: !35, line: 4046, baseType: !1013, size: 64, align: 64, offset: 832)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1547, file: !35, line: 4050, baseType: !911, size: 32, align: 32, offset: 896)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1547, file: !35, line: 4054, baseType: !911, size: 32, align: 32, offset: 928)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1547, file: !35, line: 4061, baseType: !911, size: 32, align: 32, offset: 960)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1547, file: !35, line: 4065, baseType: !911, size: 32, align: 32, offset: 992)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1547, file: !35, line: 4073, baseType: !911, size: 32, align: 32, offset: 1024)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1547, file: !35, line: 4080, baseType: !911, size: 32, align: 32, offset: 1056)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1547, file: !35, line: 4084, baseType: !911, size: 32, align: 32, offset: 1088)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !926, file: !888, line: 1055, baseType: !1579, size: 64, align: 64, offset: 1728)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !926, file: !888, line: 1028, size: 832, align: 64, elements: !1581)
!1581 = !{!1582, !1583, !1584, !1585, !1586, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !1580, file: !888, line: 1029, baseType: !1099, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "duration_gcd", scope: !1580, file: !888, line: 1030, baseType: !1099, size: 64, align: 64, offset: 64)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "duration_count", scope: !1580, file: !888, line: 1031, baseType: !911, size: 32, align: 32, offset: 128)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "rfps_duration_sum", scope: !1580, file: !888, line: 1032, baseType: !1099, size: 64, align: 64, offset: 192)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "duration_error", scope: !1580, file: !888, line: 1033, baseType: !1587, size: 64, align: 64, offset: 256)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64, align: 64)
!1588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1589, size: 51072, align: 64, elements: !1590)
!1589 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1590 = !{!1591, !1592}
!1591 = !DISubrange(count: 2)
!1592 = !DISubrange(count: 399)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "codec_info_duration", scope: !1580, file: !888, line: 1034, baseType: !1099, size: 64, align: 64, offset: 320)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "codec_info_duration_fields", scope: !1580, file: !888, line: 1035, baseType: !1099, size: 64, align: 64, offset: 384)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "frame_delay_evidence", scope: !1580, file: !888, line: 1036, baseType: !911, size: 32, align: 32, offset: 448)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "found_decoder", scope: !1580, file: !888, line: 1043, baseType: !911, size: 32, align: 32, offset: 480)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "last_duration", scope: !1580, file: !888, line: 1045, baseType: !1099, size: 64, align: 64, offset: 512)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "fps_first_dts", scope: !1580, file: !888, line: 1050, baseType: !1099, size: 64, align: 64, offset: 576)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "fps_first_dts_idx", scope: !1580, file: !888, line: 1051, baseType: !911, size: 32, align: 32, offset: 640)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "fps_last_dts", scope: !1580, file: !888, line: 1052, baseType: !1099, size: 64, align: 64, offset: 704)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "fps_last_dts_idx", scope: !1580, file: !888, line: 1053, baseType: !911, size: 32, align: 32, offset: 768)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "pts_wrap_bits", scope: !926, file: !888, line: 1057, baseType: !911, size: 32, align: 32, offset: 1792)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "first_dts", scope: !926, file: !888, line: 1067, baseType: !1099, size: 64, align: 64, offset: 1856)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "cur_dts", scope: !926, file: !888, line: 1068, baseType: !1099, size: 64, align: 64, offset: 1920)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "last_IP_pts", scope: !926, file: !888, line: 1069, baseType: !1099, size: 64, align: 64, offset: 1984)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "last_IP_duration", scope: !926, file: !888, line: 1070, baseType: !911, size: 32, align: 32, offset: 2048)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "probe_packets", scope: !926, file: !888, line: 1075, baseType: !911, size: 32, align: 32, offset: 2080)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "codec_info_nb_frames", scope: !926, file: !888, line: 1080, baseType: !911, size: 32, align: 32, offset: 2112)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "need_parsing", scope: !926, file: !888, line: 1083, baseType: !887, size: 32, align: 32, offset: 2144)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !926, file: !888, line: 1084, baseType: !1611, size: 64, align: 64, offset: 2176)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !35, line: 5092, size: 2816, align: 64, elements: !1613)
!1613 = !{!1614, !1615, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1612, file: !35, line: 5093, baseType: !949, size: 64, align: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !1612, file: !35, line: 5094, baseType: !1616, size: 64, align: 64, offset: 64)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !35, line: 5259, size: 512, align: 64, elements: !1618)
!1618 = !{!1619, !1623, !1624, !1630, !1635, !1639, !1643}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1617, file: !35, line: 5260, baseType: !1620, size: 160, align: 32)
!1620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !911, size: 160, align: 32, elements: !1621)
!1621 = !{!1622}
!1622 = !DISubrange(count: 5)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1617, file: !35, line: 5261, baseType: !911, size: 32, align: 32, offset: 160)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !1617, file: !35, line: 5262, baseType: !1625, size: 64, align: 64, offset: 192)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DISubroutineType(types: !1627)
!1627 = !{!911, !1628}
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !35, line: 5257, baseType: !1612)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !1617, file: !35, line: 5265, baseType: !1631, size: 64, align: 64, offset: 256)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64, align: 64)
!1632 = !DISubroutineType(types: !1633)
!1633 = !{!911, !1628, !931, !1634, !1221, !1424, !911}
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "parser_close", scope: !1617, file: !35, line: 5269, baseType: !1636, size: 64, align: 64, offset: 320)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DISubroutineType(types: !1638)
!1638 = !{null, !1628}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !1617, file: !35, line: 5270, baseType: !1640, size: 64, align: 64, offset: 384)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DISubroutineType(types: !1642)
!1642 = !{!911, !931, !1424, !911}
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1617, file: !35, line: 5271, baseType: !1616, size: 64, align: 64, offset: 448)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !1612, file: !35, line: 5095, baseType: !1099, size: 64, align: 64, offset: 128)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "cur_offset", scope: !1612, file: !35, line: 5096, baseType: !1099, size: 64, align: 64, offset: 192)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !1612, file: !35, line: 5098, baseType: !1099, size: 64, align: 64, offset: 256)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1612, file: !35, line: 5100, baseType: !911, size: 32, align: 32, offset: 320)
