; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--avio.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--avio.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, {}*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !46, globals: !261)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--avio.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!2 = !{!3, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !4, line: 221, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!6 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!7 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!8 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!9 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!10 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!11 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!12 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!13 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!14 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!15 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!16 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!17 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!18 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!19 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!20 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!21 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!22 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!23 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!24 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 29, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!28 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!29 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!30 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!31 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!32 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!33 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!34 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!35 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!36 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!37 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!38 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!39 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!40 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!41 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!42 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!43 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!44 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!45 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!46 = !{!47, !48, !49, !50, !52, !154, !222, !260}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!48 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!49 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!48, !55, !258, !48}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !57, line: 38, size: 768, align: 64, elements: !58)
!57 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!58 = !{!59, !144, !239, !240, !241, !242, !243, !244, !245, !254, !255, !256, !257}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !56, file: !57, line: 39, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !64)
!64 = !{!65, !69, !73, !103, !104, !105, !106, !110, !116, !118, !122}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !63, file: !26, line: 72, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !63, file: !26, line: 78, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!66, !47}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !63, file: !26, line: 85, baseType: !74, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !77)
!77 = !{!78, !79, !80, !81, !82, !99, !100, !101, !102}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !76, file: !4, line: 247, baseType: !66, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !76, file: !4, line: 253, baseType: !66, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !76, file: !4, line: 259, baseType: !48, size: 32, align: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !76, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !76, file: !4, line: 271, baseType: !83, size: 64, align: 64, offset: 192)
!83 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !76, file: !4, line: 265, size: 64, align: 64, elements: !84)
!84 = !{!85, !89, !91, !92}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !83, file: !4, line: 266, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !87, line: 40, baseType: !88)
!87 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!88 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !83, file: !4, line: 267, baseType: !90, size: 64, align: 64)
!90 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !83, file: !4, line: 268, baseType: !66, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !83, file: !4, line: 270, baseType: !93, size: 64, align: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !94, line: 61, baseType: !95)
!94 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !94, line: 58, size: 64, align: 32, elements: !96)
!96 = !{!97, !98}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !95, file: !94, line: 59, baseType: !48, size: 32, align: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !95, file: !94, line: 60, baseType: !48, size: 32, align: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !76, file: !4, line: 272, baseType: !90, size: 64, align: 64, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !76, file: !4, line: 273, baseType: !90, size: 64, align: 64, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !76, file: !4, line: 275, baseType: !48, size: 32, align: 32, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !76, file: !4, line: 300, baseType: !66, size: 64, align: 64, offset: 448)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !63, file: !26, line: 93, baseType: !48, size: 32, align: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !63, file: !26, line: 99, baseType: !48, size: 32, align: 32, offset: 224)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !63, file: !26, line: 108, baseType: !48, size: 32, align: 32, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !63, file: !26, line: 113, baseType: !107, size: 64, align: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!47, !47, !47}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !63, file: !26, line: 123, baseType: !111, size: 64, align: 64, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!114, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !63, file: !26, line: 130, baseType: !117, size: 32, align: 32, offset: 448)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !63, file: !26, line: 136, baseType: !119, size: 64, align: 64, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!117, !47}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !63, file: !26, line: 142, baseType: !123, size: 64, align: 64, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!48, !126, !47, !66, !48}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !129)
!129 = !{!130, !142, !143}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !128, file: !4, line: 360, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !135)
!135 = !{!136, !137, !138, !139, !140, !141}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !134, file: !4, line: 307, baseType: !66, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !134, file: !4, line: 313, baseType: !90, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !134, file: !4, line: 313, baseType: !90, size: 64, align: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !134, file: !4, line: 318, baseType: !90, size: 64, align: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !134, file: !4, line: 318, baseType: !90, size: 64, align: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !134, file: !4, line: 323, baseType: !48, size: 32, align: 32, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !128, file: !4, line: 364, baseType: !48, size: 32, align: 32, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !128, file: !4, line: 368, baseType: !48, size: 32, align: 32, offset: 96)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !56, file: !57, line: 40, baseType: !145, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !57, line: 54, size: 1600, align: 64, elements: !148)
!148 = !{!149, !150, !156, !165, !170, !174, !178, !184, !188, !189, !193, !197, !198, !204, !205, !206, !207, !208, !209, !210, !211, !232, !233, !234, !238}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !57, line: 55, baseType: !66, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !147, file: !57, line: 56, baseType: !151, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!48, !154, !66, !48}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !57, line: 52, baseType: !56)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !147, file: !57, line: 62, baseType: !157, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!48, !154, !66, !48, !160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !163, line: 86, baseType: !164)
!163 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !163, line: 86, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !147, file: !57, line: 63, baseType: !166, size: 64, align: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!48, !154, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !147, file: !57, line: 64, baseType: !171, size: 64, align: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!48, !154}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !147, file: !57, line: 78, baseType: !175, size: 64, align: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!48, !154, !50, !48}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !147, file: !57, line: 79, baseType: !179, size: 64, align: 64, offset: 384)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!48, !154, !182, !48}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !147, file: !57, line: 80, baseType: !185, size: 64, align: 64, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!86, !154, !86, !48}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !147, file: !57, line: 81, baseType: !171, size: 64, align: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !147, file: !57, line: 82, baseType: !190, size: 64, align: 64, offset: 576)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!48, !154, !48}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !147, file: !57, line: 83, baseType: !194, size: 64, align: 64, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!86, !154, !48, !86, !48}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !147, file: !57, line: 85, baseType: !171, size: 64, align: 64, offset: 704)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !147, file: !57, line: 86, baseType: !199, size: 64, align: 64, offset: 768)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!48, !154, !202, !203}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !147, file: !57, line: 88, baseType: !171, size: 64, align: 64, offset: 832)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !147, file: !57, line: 89, baseType: !190, size: 64, align: 64, offset: 896)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !147, file: !57, line: 90, baseType: !48, size: 32, align: 32, offset: 960)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !147, file: !57, line: 91, baseType: !60, size: 64, align: 64, offset: 1024)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !147, file: !57, line: 92, baseType: !48, size: 32, align: 32, offset: 1088)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !147, file: !57, line: 93, baseType: !190, size: 64, align: 64, offset: 1152)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !147, file: !57, line: 94, baseType: !171, size: 64, align: 64, offset: 1216)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !147, file: !57, line: 95, baseType: !212, size: 64, align: 64, offset: 1280)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!48, !154, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !218, line: 101, baseType: !219)
!218 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !218, line: 86, size: 576, align: 64, elements: !220)
!220 = !{!221, !223, !224, !225, !226, !227, !228, !229, !230, !231}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !219, file: !218, line: 87, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !219, file: !218, line: 88, baseType: !48, size: 32, align: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !219, file: !218, line: 89, baseType: !48, size: 32, align: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !219, file: !218, line: 91, baseType: !86, size: 64, align: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !219, file: !218, line: 92, baseType: !86, size: 64, align: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !219, file: !218, line: 94, baseType: !86, size: 64, align: 64, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !219, file: !218, line: 96, baseType: !86, size: 64, align: 64, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !219, file: !218, line: 98, baseType: !86, size: 64, align: 64, offset: 384)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !219, file: !218, line: 99, baseType: !86, size: 64, align: 64, offset: 448)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !219, file: !218, line: 100, baseType: !86, size: 64, align: 64, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !147, file: !57, line: 96, baseType: !171, size: 64, align: 64, offset: 1344)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !147, file: !57, line: 97, baseType: !171, size: 64, align: 64, offset: 1408)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !147, file: !57, line: 98, baseType: !235, size: 64, align: 64, offset: 1472)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!48, !154, !154}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !147, file: !57, line: 99, baseType: !66, size: 64, align: 64, offset: 1536)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !56, file: !57, line: 41, baseType: !47, size: 64, align: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !56, file: !57, line: 42, baseType: !222, size: 64, align: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !56, file: !57, line: 43, baseType: !48, size: 32, align: 32, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !56, file: !57, line: 44, baseType: !48, size: 32, align: 32, offset: 288)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !56, file: !57, line: 45, baseType: !48, size: 32, align: 32, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !56, file: !57, line: 46, baseType: !48, size: 32, align: 32, offset: 352)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !56, file: !57, line: 47, baseType: !246, size: 128, align: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !218, line: 61, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !218, line: 58, size: 128, align: 64, elements: !248)
!248 = !{!249, !253}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !247, file: !218, line: 59, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!48, !47}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !247, file: !218, line: 60, baseType: !47, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !56, file: !57, line: 48, baseType: !86, size: 64, align: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !56, file: !57, line: 49, baseType: !66, size: 64, align: 64, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !56, file: !57, line: 50, baseType: !66, size: 64, align: 64, offset: 640)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !56, file: !57, line: 51, baseType: !48, size: 32, align: 32, offset: 704)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !87, line: 48, baseType: !51)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!261 = !{!262, !264}
!262 = distinct !DIGlobalVariable(name: "ffurl_context_class", scope: !0, file: !263, line: 63, type: !61, isLocal: false, isDefinition: true, variable: { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }* @ffurl_context_class)
!263 = !DIFile(filename: "libavformat/avio.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!264 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !263, line: 56, type: !265, isLocal: true, isDefinition: true, variable: <{ { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption }>* @options)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 2048, align: 64, elements: !268)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !76)
!268 = !{!269}
!269 = !DISubrange(count: 4)
!270 = !{i32 2, !"Dwarf Version", i32 4}
!271 = !{i32 2, !"Debug Info Version", i32 3}
!272 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!273 = distinct !DISubprogram(name: "urlcontext_to_name", scope: !263, file: !263, line: 36, type: !71, isLocal: true, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !274)
!274 = !{}
!275 = !DILocalVariable(name: "ptr", arg: 1, scope: !273, file: !263, line: 36, type: !47)
!276 = !DIExpression()
!277 = !DILocation(line: 36, column: 45, scope: !273)
!278 = !DILocalVariable(name: "h", scope: !273, file: !263, line: 38, type: !154)
!279 = !DILocation(line: 38, column: 17, scope: !273)
!280 = !DILocation(line: 38, column: 35, scope: !273)
!281 = !DILocation(line: 38, column: 21, scope: !273)
!282 = !DILocation(line: 39, column: 9, scope: !283)
!283 = distinct !DILexicalBlock(scope: !273, file: !263, line: 39, column: 9)
!284 = !DILocation(line: 39, column: 12, scope: !283)
!285 = !DILocation(line: 39, column: 9, scope: !273)
!286 = !DILocation(line: 40, column: 16, scope: !283)
!287 = !DILocation(line: 40, column: 19, scope: !283)
!288 = !DILocation(line: 40, column: 25, scope: !283)
!289 = !DILocation(line: 40, column: 9, scope: !283)
!290 = !DILocation(line: 42, column: 9, scope: !283)
!291 = !DILocation(line: 43, column: 1, scope: !273)
!292 = distinct !DISubprogram(name: "urlcontext_child_next", scope: !263, file: !263, line: 45, type: !108, isLocal: true, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !274)
!293 = !DILocalVariable(name: "obj", arg: 1, scope: !292, file: !263, line: 45, type: !47)
!294 = !DILocation(line: 45, column: 42, scope: !292)
!295 = !DILocalVariable(name: "prev", arg: 2, scope: !292, file: !263, line: 45, type: !47)
!296 = !DILocation(line: 45, column: 53, scope: !292)
!297 = !DILocalVariable(name: "h", scope: !292, file: !263, line: 47, type: !154)
!298 = !DILocation(line: 47, column: 17, scope: !292)
!299 = !DILocation(line: 47, column: 21, scope: !292)
!300 = !DILocation(line: 48, column: 10, scope: !301)
!301 = distinct !DILexicalBlock(scope: !292, file: !263, line: 48, column: 9)
!302 = !DILocation(line: 48, column: 15, scope: !301)
!303 = !DILocation(line: 48, column: 18, scope: !304)
!304 = !DILexicalBlockFile(scope: !301, file: !263, discriminator: 1)
!305 = !DILocation(line: 48, column: 21, scope: !304)
!306 = !DILocation(line: 48, column: 31, scope: !304)
!307 = !DILocation(line: 48, column: 34, scope: !308)
!308 = !DILexicalBlockFile(scope: !301, file: !263, discriminator: 2)
!309 = !DILocation(line: 48, column: 37, scope: !308)
!310 = !DILocation(line: 48, column: 43, scope: !308)
!311 = !DILocation(line: 48, column: 9, scope: !308)
!312 = !DILocation(line: 49, column: 16, scope: !301)
!313 = !DILocation(line: 49, column: 19, scope: !301)
!314 = !DILocation(line: 49, column: 9, scope: !301)
!315 = !DILocation(line: 50, column: 5, scope: !292)
!316 = !DILocation(line: 51, column: 1, scope: !292)
!317 = distinct !DISubprogram(name: "ffurl_connect", scope: !263, file: !263, line: 166, type: !318, isLocal: false, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !274)
!318 = !DISubroutineType(types: !319)
!319 = !{!48, !154, !160}
!320 = !DILocalVariable(name: "uc", arg: 1, scope: !317, file: !263, line: 166, type: !154)
!321 = !DILocation(line: 166, column: 31, scope: !317)
!322 = !DILocalVariable(name: "options", arg: 2, scope: !317, file: !263, line: 166, type: !160)
!323 = !DILocation(line: 166, column: 50, scope: !317)
!324 = !DILocalVariable(name: "err", scope: !317, file: !263, line: 168, type: !48)
!325 = !DILocation(line: 168, column: 9, scope: !317)
!326 = !DILocalVariable(name: "tmp_opts", scope: !317, file: !263, line: 169, type: !161)
!327 = !DILocation(line: 169, column: 19, scope: !317)
!328 = !DILocalVariable(name: "e", scope: !317, file: !263, line: 170, type: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionaryEntry", file: !163, line: 84, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionaryEntry", file: !163, line: 81, size: 128, align: 64, elements: !332)
!332 = !{!333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !331, file: !163, line: 82, baseType: !222, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !331, file: !163, line: 83, baseType: !222, size: 64, align: 64, offset: 64)
!335 = !DILocation(line: 170, column: 24, scope: !317)
!336 = !DILocation(line: 172, column: 10, scope: !337)
!337 = distinct !DILexicalBlock(scope: !317, file: !263, line: 172, column: 9)
!338 = !DILocation(line: 172, column: 9, scope: !317)
!339 = !DILocation(line: 173, column: 17, scope: !337)
!340 = !DILocation(line: 173, column: 9, scope: !337)
!341 = !DILocation(line: 176, column: 5, scope: !317)
!342 = distinct !{!342, !341}
!343 = !DILocation(line: 176, column: 33, scope: !344)
!344 = !DILexicalBlockFile(scope: !345, file: !263, discriminator: 1)
!345 = distinct !DILexicalBlock(scope: !346, file: !263, line: 176, column: 14)
!346 = distinct !DILexicalBlock(scope: !317, file: !263, line: 176, column: 8)
!347 = !DILocation(line: 176, column: 32, scope: !344)
!348 = !DILocation(line: 176, column: 20, scope: !344)
!349 = !DILocation(line: 176, column: 19, scope: !344)
!350 = !DILocation(line: 176, column: 10, scope: !344)
!351 = !DILocation(line: 176, column: 14, scope: !352)
!352 = !DILexicalBlockFile(scope: !345, file: !263, discriminator: 2)
!353 = !DILocation(line: 176, column: 18, scope: !352)
!354 = !DILocation(line: 176, column: 37, scope: !352)
!355 = !DILocation(line: 176, column: 48, scope: !356)
!356 = !DILexicalBlockFile(scope: !345, file: !263, discriminator: 3)
!357 = !DILocation(line: 176, column: 52, scope: !356)
!358 = !DILocation(line: 176, column: 72, scope: !356)
!359 = !DILocation(line: 176, column: 75, scope: !356)
!360 = !DILocation(line: 176, column: 41, scope: !356)
!361 = !DILocation(line: 176, column: 14, scope: !356)
!362 = !DILocation(line: 176, column: 87, scope: !363)
!363 = !DILexicalBlockFile(scope: !364, file: !263, discriminator: 4)
!364 = distinct !DILexicalBlock(scope: !345, file: !263, line: 176, column: 85)
!365 = !DILocation(line: 176, column: 8, scope: !366)
!366 = !DILexicalBlockFile(scope: !363, file: !263, discriminator: 6)
!367 = !DILocation(line: 176, column: 8, scope: !363)
!368 = !DILocation(line: 176, column: 19, scope: !369)
!369 = !DILexicalBlockFile(scope: !346, file: !263, discriminator: 5)
!370 = !DILocation(line: 178, column: 5, scope: !317)
!371 = distinct !{!371, !370}
!372 = !DILocation(line: 178, column: 33, scope: !373)
!373 = !DILexicalBlockFile(scope: !374, file: !263, discriminator: 1)
!374 = distinct !DILexicalBlock(scope: !375, file: !263, line: 178, column: 14)
!375 = distinct !DILexicalBlock(scope: !317, file: !263, line: 178, column: 8)
!376 = !DILocation(line: 178, column: 32, scope: !373)
!377 = !DILocation(line: 178, column: 20, scope: !373)
!378 = !DILocation(line: 178, column: 19, scope: !373)
!379 = !DILocation(line: 178, column: 10, scope: !373)
!380 = !DILocation(line: 178, column: 14, scope: !381)
!381 = !DILexicalBlockFile(scope: !374, file: !263, discriminator: 2)
!382 = !DILocation(line: 178, column: 18, scope: !381)
!383 = !DILocation(line: 178, column: 37, scope: !381)
!384 = !DILocation(line: 178, column: 48, scope: !385)
!385 = !DILexicalBlockFile(scope: !374, file: !263, discriminator: 3)
!386 = !DILocation(line: 178, column: 52, scope: !385)
!387 = !DILocation(line: 178, column: 72, scope: !385)
!388 = !DILocation(line: 178, column: 75, scope: !385)
!389 = !DILocation(line: 178, column: 41, scope: !385)
!390 = !DILocation(line: 178, column: 14, scope: !385)
!391 = !DILocation(line: 178, column: 87, scope: !392)
!392 = !DILexicalBlockFile(scope: !393, file: !263, discriminator: 4)
!393 = distinct !DILexicalBlock(scope: !374, file: !263, line: 178, column: 85)
!394 = !DILocation(line: 178, column: 8, scope: !395)
!395 = !DILexicalBlockFile(scope: !392, file: !263, discriminator: 6)
!396 = !DILocation(line: 178, column: 8, scope: !392)
!397 = !DILocation(line: 178, column: 19, scope: !398)
!398 = !DILexicalBlockFile(scope: !375, file: !263, discriminator: 5)
!399 = !DILocation(line: 181, column: 9, scope: !400)
