; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--hevc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--hevc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVIOContext = type { %struct.AVClass*, i8*, i32, i8*, i8*, i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i64, i32, i32, i32, i64, i8*, i64 (i64, i8*, i32)*, i32, i32 (i8*, i32)*, i64 (i8*, i32, i64, i32)*, i32, i64, i32, i64, i32, i32, i32, i32, i8*, i8*, i32 (i8*, i8*, i32, i32, i64)*, i32, i32, i64, i32 (i8*)*, i64, i8*, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%union.unaligned_32 = type { i32 }
%struct.HEVCDecoderConfigurationRecord = type { i8, i8, i8, i8, i32, i64, i8, i16, i8, i8, i8, i8, i16, i8, i8, i8, i8, i8, %struct.HVCCNALUnitArray* }
%struct.HVCCNALUnitArray = type { i8, i8, i16, i16*, i8** }
%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }
%struct.HVCCProfileTierLevel = type { i8, i8, i8, i32, i64, i8 }

@.str = private unnamed_addr constant [41 x i8] c"configurationVersion:                %u\0A\00", align 1

!87 = !DIEnumerator(name: "HEVC_NAL_UNSPEC51", value: 51)
!88 = !DIEnumerator(name: "HEVC_NAL_UNSPEC52", value: 52)
!89 = !DIEnumerator(name: "HEVC_NAL_UNSPEC53", value: 53)
!90 = !DIEnumerator(name: "HEVC_NAL_UNSPEC54", value: 54)
!91 = !DIEnumerator(name: "HEVC_NAL_UNSPEC55", value: 55)
!92 = !DIEnumerator(name: "HEVC_NAL_UNSPEC56", value: 56)
!93 = !DIEnumerator(name: "HEVC_NAL_UNSPEC57", value: 57)
!94 = !DIEnumerator(name: "HEVC_NAL_UNSPEC58", value: 58)
!95 = !DIEnumerator(name: "HEVC_NAL_UNSPEC59", value: 59)
!96 = !DIEnumerator(name: "HEVC_NAL_UNSPEC60", value: 60)
!97 = !DIEnumerator(name: "HEVC_NAL_UNSPEC61", value: 61)
!98 = !DIEnumerator(name: "HEVC_NAL_UNSPEC62", value: 62)
!99 = !DIEnumerator(name: "HEVC_NAL_UNSPEC63", value: 63)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 101, size: 32, align: 32, elements: !101)
!101 = !{!102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121}
!102 = !DIEnumerator(name: "HEVC_MAX_LAYERS", value: 63)
!103 = !DIEnumerator(name: "HEVC_MAX_SUB_LAYERS", value: 7)
!104 = !DIEnumerator(name: "HEVC_MAX_LAYER_SETS", value: 1024)
!105 = !DIEnumerator(name: "HEVC_MAX_VPS_COUNT", value: 16)
!106 = !DIEnumerator(name: "HEVC_MAX_SPS_COUNT", value: 16)
!107 = !DIEnumerator(name: "HEVC_MAX_PPS_COUNT", value: 64)
!108 = !DIEnumerator(name: "HEVC_MAX_DPB_SIZE", value: 16)
!109 = !DIEnumerator(name: "HEVC_MAX_REFS", value: 16)
!110 = !DIEnumerator(name: "HEVC_MAX_SHORT_TERM_REF_PIC_SETS", value: 64)
!111 = !DIEnumerator(name: "HEVC_MAX_LONG_TERM_REF_PICS", value: 32)
!112 = !DIEnumerator(name: "HEVC_MIN_LOG2_CTB_SIZE", value: 4)
!113 = !DIEnumerator(name: "HEVC_MAX_LOG2_CTB_SIZE", value: 6)
!114 = !DIEnumerator(name: "HEVC_MAX_CPB_CNT", value: 32)
!115 = !DIEnumerator(name: "HEVC_MAX_LUMA_PS", value: 35651584)
!116 = !DIEnumerator(name: "HEVC_MAX_WIDTH", value: 16888)
!117 = !DIEnumerator(name: "HEVC_MAX_HEIGHT", value: 16888)
!118 = !DIEnumerator(name: "HEVC_MAX_TILE_ROWS", value: 22)
!119 = !DIEnumerator(name: "HEVC_MAX_TILE_COLUMNS", value: 20)
!120 = !DIEnumerator(name: "HEVC_MAX_SLICE_SEGMENTS", value: 600)
!121 = !DIEnumerator(name: "HEVC_MAX_ENTRY_POINT_OFFSETS", value: 2700)
!122 = !{!123, !132, !131, !133, !135, !137, !139}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !126, line: 221, size: 32, align: 8, elements: !127)
!126 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!127 = !{!128}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !125, file: !126, line: 221, baseType: !129, size: 32, align: 32)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !130, line: 51, baseType: !131)
!130 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!131 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!132 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !130, line: 48, baseType: !136)
!136 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !130, line: 55, baseType: !138)
!138 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!140 = !{i32 2, !"Dwarf Version", i32 4}
!141 = !{i32 2, !"Debug Info Version", i32 3}
!142 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!143 = distinct !DISubprogram(name: "ff_hevc_annexb2mp4", scope: !144, file: !144, line: 1032, type: !145, isLocal: false, isDefinition: true, scopeLine: 1034, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !257)
!144 = !DIFile(filename: "libavformat/hevc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!145 = !DISubroutineType(types: !146)
!146 = !{!132, !147, !133, !132, !132, !256}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !25, line: 352, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !25, line: 161, size: 2112, align: 64, elements: !150)
!150 = !{!151, !195, !197, !198, !199, !200, !201, !206, !207, !213, !214, !215, !216, !217, !218, !219, !223, !224, !228, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !246, !247, !248, !249, !253, !254, !255}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !149, file: !25, line: 174, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !156)
!156 = !{!157, !161, !165, !169, !170, !171, !172, !176, !182, !184, !188}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !155, file: !4, line: 72, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !155, file: !4, line: 78, baseType: !162, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!158, !139}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !155, file: !4, line: 85, baseType: !166, size: 64, align: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !155, file: !4, line: 93, baseType: !132, size: 32, align: 32, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !155, file: !4, line: 99, baseType: !132, size: 32, align: 32, offset: 224)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !155, file: !4, line: 108, baseType: !132, size: 32, align: 32, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !155, file: !4, line: 113, baseType: !173, size: 64, align: 64, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!139, !139, !139}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !155, file: !4, line: 123, baseType: !177, size: 64, align: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!180, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !155, file: !4, line: 130, baseType: !183, size: 32, align: 32, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !155, file: !4, line: 136, baseType: !185, size: 64, align: 64, offset: 512)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!183, !139}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !155, file: !4, line: 142, baseType: !189, size: 64, align: 64, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!132, !192, !139, !158, !132}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !149, file: !25, line: 226, baseType: !196, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !149, file: !25, line: 227, baseType: !132, size: 32, align: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !149, file: !25, line: 228, baseType: !196, size: 64, align: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !149, file: !25, line: 229, baseType: !196, size: 64, align: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !149, file: !25, line: 233, baseType: !139, size: 64, align: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !149, file: !25, line: 235, baseType: !202, size: 64, align: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!132, !139, !205, !132}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !149, file: !25, line: 236, baseType: !202, size: 64, align: 64, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !149, file: !25, line: 237, baseType: !208, size: 64, align: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!211, !139, !211, !132}
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !130, line: 40, baseType: !212)
!212 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !149, file: !25, line: 238, baseType: !211, size: 64, align: 64, offset: 576)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !149, file: !25, line: 239, baseType: !132, size: 32, align: 32, offset: 640)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !149, file: !25, line: 240, baseType: !132, size: 32, align: 32, offset: 672)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !149, file: !25, line: 241, baseType: !132, size: 32, align: 32, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !149, file: !25, line: 242, baseType: !138, size: 64, align: 64, offset: 768)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !149, file: !25, line: 243, baseType: !196, size: 64, align: 64, offset: 832)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !149, file: !25, line: 244, baseType: !220, size: 64, align: 64, offset: 896)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!138, !138, !133, !131}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !149, file: !25, line: 245, baseType: !132, size: 32, align: 32, offset: 960)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !149, file: !25, line: 249, baseType: !225, size: 64, align: 64, offset: 1024)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!132, !139, !132}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !149, file: !25, line: 255, baseType: !229, size: 64, align: 64, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!211, !139, !132, !211, !132}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !149, file: !25, line: 260, baseType: !132, size: 32, align: 32, offset: 1152)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !149, file: !25, line: 266, baseType: !211, size: 64, align: 64, offset: 1216)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !149, file: !25, line: 273, baseType: !132, size: 32, align: 32, offset: 1280)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !149, file: !25, line: 279, baseType: !211, size: 64, align: 64, offset: 1344)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !149, file: !25, line: 285, baseType: !132, size: 32, align: 32, offset: 1408)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !149, file: !25, line: 291, baseType: !132, size: 32, align: 32, offset: 1440)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !149, file: !25, line: 298, baseType: !132, size: 32, align: 32, offset: 1472)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !149, file: !25, line: 304, baseType: !132, size: 32, align: 32, offset: 1504)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !149, file: !25, line: 309, baseType: !158, size: 64, align: 64, offset: 1536)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !149, file: !25, line: 314, baseType: !158, size: 64, align: 64, offset: 1600)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !149, file: !25, line: 319, baseType: !243, size: 64, align: 64, offset: 1664)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!132, !139, !205, !132, !24, !211}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !149, file: !25, line: 326, baseType: !132, size: 32, align: 32, offset: 1728)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !149, file: !25, line: 331, baseType: !24, size: 32, align: 32, offset: 1760)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !149, file: !25, line: 332, baseType: !211, size: 64, align: 64, offset: 1792)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !149, file: !25, line: 338, baseType: !250, size: 64, align: 64, offset: 1856)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!132, !139}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !149, file: !25, line: 340, baseType: !211, size: 64, align: 64, offset: 1920)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !149, file: !25, line: 346, baseType: !196, size: 64, align: 64, offset: 1984)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !149, file: !25, line: 351, baseType: !132, size: 32, align: 32, offset: 2048)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!257 = !{}
!258 = !DILocalVariable(name: "x", arg: 1, scope: !259, file: !260, line: 66, type: !129)
!259 = distinct !DISubprogram(name: "av_bswap32", scope: !260, file: !260, line: 66, type: !261, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !257)
!260 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!261 = !DISubroutineType(types: !262)
!262 = !{!129, !129}
!263 = !DIExpression()
!264 = !DILocation(line: 66, column: 98, scope: !259, inlinedAt: !265)
!265 = distinct !DILocation(line: 1052, column: 120, scope: !266)
!266 = !DILexicalBlockFile(scope: !267, file: !144, discriminator: 2)
!267 = distinct !DILexicalBlock(scope: !143, file: !144, line: 1051, column: 27)
!268 = !DILocation(line: 66, column: 98, scope: !259, inlinedAt: !269)
!269 = distinct !DILocation(line: 1052, column: 26, scope: !267)
!270 = !DILocalVariable(name: "pb", arg: 1, scope: !143, file: !144, line: 1032, type: !147)
!271 = !DILocation(line: 1032, column: 37, scope: !143)
!272 = !DILocalVariable(name: "buf_in", arg: 2, scope: !143, file: !144, line: 1032, type: !133)
!273 = !DILocation(line: 1032, column: 56, scope: !143)
!274 = !DILocalVariable(name: "size", arg: 3, scope: !143, file: !144, line: 1033, type: !132)
!275 = !DILocation(line: 1033, column: 28, scope: !143)
!276 = !DILocalVariable(name: "filter_ps", arg: 4, scope: !143, file: !144, line: 1033, type: !132)
!277 = !DILocation(line: 1033, column: 38, scope: !143)
!278 = !DILocalVariable(name: "ps_count", arg: 5, scope: !143, file: !144, line: 1033, type: !256)
!279 = !DILocation(line: 1033, column: 54, scope: !143)
!280 = !DILocalVariable(name: "num_ps", scope: !143, file: !144, line: 1035, type: !132)
!281 = !DILocation(line: 1035, column: 9, scope: !143)
!282 = !DILocalVariable(name: "ret", scope: !143, file: !144, line: 1035, type: !132)
!283 = !DILocation(line: 1035, column: 21, scope: !143)
!284 = !DILocalVariable(name: "buf", scope: !143, file: !144, line: 1036, type: !205)
!285 = !DILocation(line: 1036, column: 14, scope: !143)
!286 = !DILocalVariable(name: "end", scope: !143, file: !144, line: 1036, type: !205)
!287 = !DILocation(line: 1036, column: 20, scope: !143)
!288 = !DILocalVariable(name: "start", scope: !143, file: !144, line: 1036, type: !205)
!289 = !DILocation(line: 1036, column: 26, scope: !143)
!290 = !DILocation(line: 1038, column: 10, scope: !291)
!291 = distinct !DILexicalBlock(scope: !143, file: !144, line: 1038, column: 9)
!292 = !DILocation(line: 1038, column: 9, scope: !143)
!293 = !DILocation(line: 1039, column: 38, scope: !294)
!294 = distinct !DILexicalBlock(scope: !291, file: !144, line: 1038, column: 21)
!295 = !DILocation(line: 1039, column: 42, scope: !294)
!296 = !DILocation(line: 1039, column: 50, scope: !294)
!297 = !DILocation(line: 1039, column: 15, scope: !294)
!298 = !DILocation(line: 1039, column: 13, scope: !294)
!299 = !DILocation(line: 1040, column: 9, scope: !294)
!300 = !DILocation(line: 1043, column: 38, scope: !143)
!301 = !DILocation(line: 1043, column: 11, scope: !143)
!302 = !DILocation(line: 1043, column: 9, scope: !143)
!303 = !DILocation(line: 1044, column: 9, scope: !304)
!304 = distinct !DILexicalBlock(scope: !143, file: !144, line: 1044, column: 9)
!305 = !DILocation(line: 1044, column: 13, scope: !304)
!306 = !DILocation(line: 1044, column: 9, scope: !143)
!307 = !DILocation(line: 1045, column: 9, scope: !304)
!308 = !DILocation(line: 1047, column: 9, scope: !143)
!309 = !DILocation(line: 1048, column: 11, scope: !143)
!310 = !DILocation(line: 1048, column: 9, scope: !143)
!311 = !DILocation(line: 1049, column: 11, scope: !143)
!312 = !DILocation(line: 1049, column: 19, scope: !143)
!313 = !DILocation(line: 1049, column: 17, scope: !143)
!314 = !DILocation(line: 1049, column: 9, scope: !143)
!315 = !DILocation(line: 1051, column: 5, scope: !143)
!316 = !DILocation(line: 1051, column: 12, scope: !317)
!317 = !DILexicalBlockFile(scope: !143, file: !144, discriminator: 1)
!318 = !DILocation(line: 1051, column: 18, scope: !317)
!319 = !DILocation(line: 1051, column: 16, scope: !317)
!320 = !DILocation(line: 1051, column: 22, scope: !317)
!321 = !DILocation(line: 1051, column: 5, scope: !317)
!322 = !DILocalVariable(name: "len", scope: !267, file: !144, line: 1052, type: !129)
!323 = !DILocation(line: 1052, column: 18, scope: !267)
!324 = !DILocation(line: 1052, column: 69, scope: !267)
!325 = !DILocation(line: 1052, column: 76, scope: !267)
!326 = !DILocation(line: 1052, column: 26, scope: !267)
!327 = !DILocation(line: 68, column: 16, scope: !259, inlinedAt: !269)
!328 = !DILocation(line: 68, column: 19, scope: !259, inlinedAt: !269)
!329 = !DILocation(line: 68, column: 24, scope: !259, inlinedAt: !269)
!330 = !DILocation(line: 68, column: 38, scope: !259, inlinedAt: !269)
!331 = !DILocation(line: 68, column: 41, scope: !259, inlinedAt: !269)
!332 = !DILocation(line: 68, column: 46, scope: !259, inlinedAt: !269)
!333 = !DILocation(line: 68, column: 34, scope: !259, inlinedAt: !269)
!334 = !DILocation(line: 68, column: 57, scope: !259, inlinedAt: !269)
!335 = !DILocation(line: 68, column: 69, scope: !259, inlinedAt: !269)
!336 = !DILocation(line: 68, column: 72, scope: !259, inlinedAt: !269)
!337 = !DILocation(line: 68, column: 79, scope: !259, inlinedAt: !269)
!338 = !DILocation(line: 68, column: 84, scope: !259, inlinedAt: !269)
!339 = !DILocation(line: 68, column: 99, scope: !259, inlinedAt: !269)
!340 = !DILocation(line: 68, column: 102, scope: !259, inlinedAt: !269)
!341 = !DILocation(line: 68, column: 109, scope: !259, inlinedAt: !269)
!342 = !DILocation(line: 68, column: 114, scope: !259, inlinedAt: !269)
!343 = !DILocation(line: 68, column: 94, scope: !259, inlinedAt: !269)
!344 = !DILocation(line: 68, column: 63, scope: !259, inlinedAt: !269)
!345 = !DILocation(line: 1052, column: 25, scope: !267)
!346 = !DILocation(line: 1052, column: 84, scope: !267)
!347 = !DILocation(line: 1052, column: 90, scope: !267)
!348 = !DILocation(line: 1052, column: 88, scope: !267)
!349 = !DILocation(line: 1052, column: 94, scope: !267)
!350 = !DILocation(line: 1052, column: 81, scope: !267)
!351 = !DILocation(line: 1052, column: 102, scope: !352)
!352 = !DILexicalBlockFile(scope: !267, file: !144, discriminator: 1)
!353 = !DILocation(line: 1052, column: 108, scope: !352)
!354 = !DILocation(line: 1052, column: 106, scope: !352)
!355 = !DILocation(line: 1052, column: 112, scope: !352)
!356 = !DILocation(line: 1052, column: 25, scope: !352)
!357 = !DILocation(line: 1052, column: 163, scope: !266)
!358 = !DILocation(line: 1052, column: 170, scope: !266)
!359 = !DILocation(line: 1052, column: 120, scope: !266)
!360 = !DILocation(line: 68, column: 16, scope: !259, inlinedAt: !265)
!361 = !DILocation(line: 68, column: 19, scope: !259, inlinedAt: !265)
!362 = !DILocation(line: 68, column: 24, scope: !259, inlinedAt: !265)
!363 = !DILocation(line: 68, column: 38, scope: !259, inlinedAt: !265)
!364 = !DILocation(line: 68, column: 41, scope: !259, inlinedAt: !265)
!365 = !DILocation(line: 68, column: 46, scope: !259, inlinedAt: !265)
!366 = !DILocation(line: 68, column: 34, scope: !259, inlinedAt: !265)
!367 = !DILocation(line: 68, column: 57, scope: !259, inlinedAt: !265)
!368 = !DILocation(line: 68, column: 69, scope: !259, inlinedAt: !265)
!369 = !DILocation(line: 68, column: 72, scope: !259, inlinedAt: !265)
!370 = !DILocation(line: 68, column: 79, scope: !259, inlinedAt: !265)
!371 = !DILocation(line: 68, column: 84, scope: !259, inlinedAt: !265)
!372 = !DILocation(line: 68, column: 99, scope: !259, inlinedAt: !265)
!373 = !DILocation(line: 68, column: 102, scope: !259, inlinedAt: !265)
!374 = !DILocation(line: 68, column: 109, scope: !259, inlinedAt: !265)
!375 = !DILocation(line: 68, column: 114, scope: !259, inlinedAt: !265)
!376 = !DILocation(line: 68, column: 94, scope: !259, inlinedAt: !265)
!377 = !DILocation(line: 68, column: 63, scope: !259, inlinedAt: !265)
!378 = !DILocation(line: 1052, column: 119, scope: !266)
!379 = !DILocation(line: 1052, column: 25, scope: !266)
!380 = !DILocation(line: 1052, column: 25, scope: !381)
!381 = !DILexicalBlockFile(scope: !267, file: !144, discriminator: 3)
!382 = !DILocation(line: 1052, column: 24, scope: !381)
!383 = !DILocation(line: 1052, column: 18, scope: !381)
!384 = !DILocalVariable(name: "type", scope: !267, file: !144, line: 1053, type: !135)
!385 = !DILocation(line: 1053, column: 17, scope: !267)
!386 = !DILocation(line: 1053, column: 25, scope: !267)
!387 = !DILocation(line: 1053, column: 32, scope: !267)
!388 = !DILocation(line: 1053, column: 38, scope: !267)
!389 = !DILocation(line: 1053, column: 24, scope: !267)
!390 = !DILocation(line: 1055, column: 13, scope: !267)
!391 = !DILocation(line: 1057, column: 17, scope: !267)
!392 = !DILocation(line: 1057, column: 9, scope: !267)
!393 = !DILocation(line: 1061, column: 19, scope: !394)
!394 = distinct !DILexicalBlock(scope: !267, file: !144, line: 1057, column: 23)
!395 = !DILocation(line: 1062, column: 13, scope: !394)
!396 = !DILocation(line: 1064, column: 24, scope: !394)
!397 = !DILocation(line: 1064, column: 22, scope: !394)
!398 = !DILocation(line: 1064, column: 17, scope: !394)
!399 = !DILocation(line: 1065, column: 23, scope: !394)
!400 = !DILocation(line: 1065, column: 27, scope: !394)
!401 = !DILocation(line: 1065, column: 13, scope: !394)
!402 = !DILocation(line: 1066, column: 24, scope: !394)
!403 = !DILocation(line: 1066, column: 28, scope: !394)
!404 = !DILocation(line: 1066, column: 33, scope: !394)
!405 = !DILocation(line: 1066, column: 13, scope: !394)
!406 = !DILocation(line: 1067, column: 13, scope: !394)
!407 = !DILocation(line: 1070, column: 16, scope: !267)
!408 = !DILocation(line: 1070, column: 13, scope: !267)
!409 = !DILocation(line: 1051, column: 5, scope: !410)
!410 = !DILexicalBlockFile(scope: !143, file: !144, discriminator: 2)
!411 = distinct !{!411, !315}
!412 = !DILocation(line: 1051, column: 5, scope: !413)
!413 = !DILexicalBlockFile(scope: !143, file: !144, discriminator: 3)
!414 = !DILocation(line: 1074, column: 13, scope: !143)
!415 = !DILocation(line: 1074, column: 5, scope: !143)
!416 = !DILocation(line: 1075, column: 9, scope: !417)
!417 = distinct !DILexicalBlock(scope: !143, file: !144, line: 1075, column: 9)
!418 = !DILocation(line: 1075, column: 9, scope: !143)
!419 = !DILocation(line: 1076, column: 21, scope: !417)
!420 = !DILocation(line: 1076, column: 10, scope: !417)
!421 = !DILocation(line: 1076, column: 19, scope: !417)
!422 = !DILocation(line: 1076, column: 9, scope: !417)
!423 = !DILocation(line: 1077, column: 12, scope: !143)
!424 = !DILocation(line: 1077, column: 5, scope: !143)
!425 = distinct !DISubprogram(name: "ff_hevc_annexb2mp4_buf", scope: !144, file: !144, line: 1080, type: !426, isLocal: false, isDefinition: true, scopeLine: 1082, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !257)
!426 = !DISubroutineType(types: !427)
!427 = !{!132, !133, !428, !256, !132, !256}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!429 = !DILocalVariable(name: "buf_in", arg: 1, scope: !425, file: !144, line: 1080, type: !133)
!430 = !DILocation(line: 1080, column: 43, scope: !425)
!431 = !DILocalVariable(name: "buf_out", arg: 2, scope: !425, file: !144, line: 1080, type: !428)
!432 = !DILocation(line: 1080, column: 61, scope: !425)
!433 = !DILocalVariable(name: "size", arg: 3, scope: !425, file: !144, line: 1081, type: !256)
!434 = !DILocation(line: 1081, column: 33, scope: !425)
!435 = !DILocalVariable(name: "filter_ps", arg: 4, scope: !425, file: !144, line: 1081, type: !132)
!436 = !DILocation(line: 1081, column: 43, scope: !425)
!437 = !DILocalVariable(name: "ps_count", arg: 5, scope: !425, file: !144, line: 1081, type: !256)
!438 = !DILocation(line: 1081, column: 59, scope: !425)
!439 = !DILocalVariable(name: "pb", scope: !425, file: !144, line: 1083, type: !147)
!440 = !DILocation(line: 1083, column: 18, scope: !425)
!441 = !DILocalVariable(name: "ret", scope: !425, file: !144, line: 1084, type: !132)
!442 = !DILocation(line: 1084, column: 9, scope: !425)
!443 = !DILocation(line: 1086, column: 11, scope: !425)
!444 = !DILocation(line: 1086, column: 9, scope: !425)
!445 = !DILocation(line: 1087, column: 9, scope: !446)
!446 = distinct !DILexicalBlock(scope: !425, file: !144, line: 1087, column: 9)
!447 = !DILocation(line: 1087, column: 13, scope: !446)
!448 = !DILocation(line: 1087, column: 9, scope: !425)
!449 = !DILocation(line: 1088, column: 16, scope: !446)
!450 = !DILocation(line: 1088, column: 9, scope: !446)
!451 = !DILocation(line: 1090, column: 30, scope: !425)
!452 = !DILocation(line: 1090, column: 34, scope: !425)
!453 = !DILocation(line: 1090, column: 43, scope: !425)
!454 = !DILocation(line: 1090, column: 42, scope: !425)
!455 = !DILocation(line: 1090, column: 49, scope: !425)
!456 = !DILocation(line: 1090, column: 60, scope: !425)
!457 = !DILocation(line: 1090, column: 11, scope: !425)
!458 = !DILocation(line: 1090, column: 9, scope: !425)
!459 = !DILocation(line: 1091, column: 32, scope: !425)
!460 = !DILocation(line: 1091, column: 36, scope: !425)
!461 = !DILocation(line: 1091, column: 13, scope: !425)
!462 = !DILocation(line: 1091, column: 6, scope: !425)
!463 = !DILocation(line: 1091, column: 11, scope: !425)
!464 = !DILocation(line: 1093, column: 12, scope: !425)
!465 = !DILocation(line: 1093, column: 5, scope: !425)
!466 = !DILocation(line: 1094, column: 1, scope: !425)
!467 = distinct !DISubprogram(name: "ff_isom_write_hvcc", scope: !144, file: !144, line: 1096, type: !468, isLocal: false, isDefinition: true, scopeLine: 1098, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !257)
!468 = !DISubroutineType(types: !469)
!469 = !{!132, !147, !133, !132, !132}
!470 = !DILocation(line: 66, column: 98, scope: !259, inlinedAt: !471)
!471 = distinct !DILocation(line: 1127, column: 120, scope: !472)
!472 = !DILexicalBlockFile(scope: !473, file: !144, discriminator: 2)
!473 = distinct !DILexicalBlock(scope: !467, file: !144, line: 1126, column: 27)
!474 = !DILocation(line: 66, column: 98, scope: !259, inlinedAt: !475)
!475 = distinct !DILocation(line: 1127, column: 26, scope: !473)
!476 = !DILocation(line: 66, column: 98, scope: !259, inlinedAt: !477)
!477 = distinct !DILocation(line: 1113, column: 131, scope: !478)
!478 = !DILexicalBlockFile(scope: !479, file: !144, discriminator: 1)
!479 = distinct !DILexicalBlock(scope: !480, file: !144, line: 1113, column: 16)
!480 = distinct !DILexicalBlock(scope: !481, file: !144, line: 1109, column: 16)
!481 = distinct !DILexicalBlock(scope: !467, file: !144, line: 1105, column: 9)
!482 = !DILocalVariable(name: "pb", arg: 1, scope: !467, file: !144, line: 1096, type: !147)
!483 = !DILocation(line: 1096, column: 37, scope: !467)
!484 = !DILocalVariable(name: "data", arg: 2, scope: !467, file: !144, line: 1096, type: !133)
!485 = !DILocation(line: 1096, column: 56, scope: !467)
!486 = !DILocalVariable(name: "size", arg: 3, scope: !467, file: !144, line: 1097, type: !132)
!487 = !DILocation(line: 1097, column: 28, scope: !467)
!488 = !DILocalVariable(name: "ps_array_completeness", arg: 4, scope: !467, file: !144, line: 1097, type: !132)
!489 = !DILocation(line: 1097, column: 38, scope: !467)
!490 = !DILocalVariable(name: "ret", scope: !467, file: !144, line: 1099, type: !132)
!491 = !DILocation(line: 1099, column: 9, scope: !467)
!492 = !DILocalVariable(name: "buf", scope: !467, file: !144, line: 1100, type: !205)
!493 = !DILocation(line: 1100, column: 14, scope: !467)
!494 = !DILocalVariable(name: "end", scope: !467, file: !144, line: 1100, type: !205)
!495 = !DILocation(line: 1100, column: 20, scope: !467)
!496 = !DILocalVariable(name: "start", scope: !467, file: !144, line: 1100, type: !205)
!497 = !DILocation(line: 1100, column: 26, scope: !467)
!498 = !DILocalVariable(name: "hvcc", scope: !467, file: !144, line: 1101, type: !499)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCDecoderConfigurationRecord", file: !144, line: 60, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCDecoderConfigurationRecord", file: !144, line: 40, size: 320, align: 64, elements: !501)
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "configurationVersion", scope: !500, file: !144, line: 41, baseType: !135, size: 8, align: 8)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "general_profile_space", scope: !500, file: !144, line: 42, baseType: !135, size: 8, align: 8, offset: 8)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "general_tier_flag", scope: !500, file: !144, line: 43, baseType: !135, size: 8, align: 8, offset: 16)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "general_profile_idc", scope: !500, file: !144, line: 44, baseType: !135, size: 8, align: 8, offset: 24)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "general_profile_compatibility_flags", scope: !500, file: !144, line: 45, baseType: !129, size: 32, align: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "general_constraint_indicator_flags", scope: !500, file: !144, line: 46, baseType: !137, size: 64, align: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "general_level_idc", scope: !500, file: !144, line: 47, baseType: !135, size: 8, align: 8, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "min_spatial_segmentation_idc", scope: !500, file: !144, line: 48, baseType: !510, size: 16, align: 16, offset: 144)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !130, line: 49, baseType: !511)
!511 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "parallelismType", scope: !500, file: !144, line: 49, baseType: !135, size: 8, align: 8, offset: 160)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "chromaFormat", scope: !500, file: !144, line: 50, baseType: !135, size: 8, align: 8, offset: 168)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "bitDepthLumaMinus8", scope: !500, file: !144, line: 51, baseType: !135, size: 8, align: 8, offset: 176)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "bitDepthChromaMinus8", scope: !500, file: !144, line: 52, baseType: !135, size: 8, align: 8, offset: 184)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "avgFrameRate", scope: !500, file: !144, line: 53, baseType: !510, size: 16, align: 16, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "constantFrameRate", scope: !500, file: !144, line: 54, baseType: !135, size: 8, align: 8, offset: 208)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "numTemporalLayers", scope: !500, file: !144, line: 55, baseType: !135, size: 8, align: 8, offset: 216)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "temporalIdNested", scope: !500, file: !144, line: 56, baseType: !135, size: 8, align: 8, offset: 224)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lengthSizeMinusOne", scope: !500, file: !144, line: 57, baseType: !135, size: 8, align: 8, offset: 232)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "numOfArrays", scope: !500, file: !144, line: 58, baseType: !135, size: 8, align: 8, offset: 240)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !500, file: !144, line: 59, baseType: !523, size: 64, align: 64, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "HVCCNALUnitArray", file: !144, line: 38, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HVCCNALUnitArray", file: !144, line: 32, size: 192, align: 64, elements: !526)
!526 = !{!527, !528, !529, !530, !532}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "array_completeness", scope: !525, file: !144, line: 33, baseType: !135, size: 8, align: 8)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "NAL_unit_type", scope: !525, file: !144, line: 34, baseType: !135, size: 8, align: 8, offset: 8)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "numNalus", scope: !525, file: !144, line: 35, baseType: !510, size: 16, align: 16, offset: 16)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "nalUnitLength", scope: !525, file: !144, line: 36, baseType: !531, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "nalUnit", scope: !525, file: !144, line: 37, baseType: !428, size: 64, align: 64, offset: 128)
!533 = !DILocation(line: 1101, column: 36, scope: !467)
!534 = !DILocation(line: 1103, column: 5, scope: !467)
!535 = !DILocation(line: 1105, column: 9, scope: !481)
!536 = !DILocation(line: 1105, column: 14, scope: !481)
!537 = !DILocation(line: 1105, column: 9, scope: !467)
!538 = !DILocation(line: 1107, column: 13, scope: !539)
!539 = distinct !DILexicalBlock(scope: !481, file: !144, line: 1105, column: 19)
!540 = !DILocation(line: 1108, column: 9, scope: !539)
!541 = !DILocation(line: 1109, column: 17, scope: !480)
!542 = !DILocation(line: 1109, column: 16, scope: !480)
!543 = !DILocation(line: 1109, column: 22, scope: !480)
!544 = !DILocation(line: 1109, column: 16, scope: !481)
!545 = !DILocation(line: 1111, column: 20, scope: !546)
!546 = distinct !DILexicalBlock(scope: !480, file: !144, line: 1109, column: 28)
!547 = !DILocation(line: 1111, column: 24, scope: !546)
!548 = !DILocation(line: 1111, column: 30, scope: !546)
!549 = !DILocation(line: 1111, column: 9, scope: !546)
!550 = !DILocation(line: 1112, column: 9, scope: !546)
!551 = !DILocation(line: 1113, column: 38, scope: !479)
!552 = !DILocation(line: 1113, column: 20, scope: !479)
!553 = !DILocation(line: 1113, column: 48, scope: !479)
!554 = !DILocation(line: 1113, column: 76, scope: !479)
!555 = !DILocation(line: 1113, column: 58, scope: !479)
!556 = !DILocation(line: 1113, column: 86, scope: !479)
!557 = !DILocation(line: 1113, column: 55, scope: !479)
!558 = !DILocation(line: 1113, column: 112, scope: !479)
!559 = !DILocation(line: 1113, column: 94, scope: !479)
!560 = !DILocation(line: 1113, column: 92, scope: !479)
!561 = !DILocation(line: 1113, column: 123, scope: !479)
!562 = !DILocation(line: 1113, column: 128, scope: !479)
!563 = !DILocation(line: 1113, column: 174, scope: !478)
!564 = !DILocation(line: 1113, column: 182, scope: !478)
!565 = !DILocation(line: 1113, column: 131, scope: !478)
!566 = !DILocation(line: 68, column: 16, scope: !259, inlinedAt: !477)
!567 = !DILocation(line: 68, column: 19, scope: !259, inlinedAt: !477)
!568 = !DILocation(line: 68, column: 24, scope: !259, inlinedAt: !477)
!569 = !DILocation(line: 68, column: 38, scope: !259, inlinedAt: !477)
!570 = !DILocation(line: 68, column: 41, scope: !259, inlinedAt: !477)
!571 = !DILocation(line: 68, column: 46, scope: !259, inlinedAt: !477)
!572 = !DILocation(line: 68, column: 34, scope: !259, inlinedAt: !477)
!573 = !DILocation(line: 68, column: 57, scope: !259, inlinedAt: !477)
!574 = !DILocation(line: 68, column: 69, scope: !259, inlinedAt: !477)
!575 = !DILocation(line: 68, column: 72, scope: !259, inlinedAt: !477)
!576 = !DILocation(line: 68, column: 79, scope: !259, inlinedAt: !477)
!577 = !DILocation(line: 68, column: 84, scope: !259, inlinedAt: !477)
!578 = !DILocation(line: 68, column: 99, scope: !259, inlinedAt: !477)
!579 = !DILocation(line: 68, column: 102, scope: !259, inlinedAt: !477)
!580 = !DILocation(line: 68, column: 109, scope: !259, inlinedAt: !477)
!581 = !DILocation(line: 68, column: 114, scope: !259, inlinedAt: !477)
!582 = !DILocation(line: 68, column: 94, scope: !259, inlinedAt: !477)
!583 = !DILocation(line: 68, column: 63, scope: !259, inlinedAt: !477)
!584 = !DILocation(line: 1113, column: 186, scope: !478)
!585 = !DILocation(line: 1113, column: 16, scope: !478)
!586 = !DILocation(line: 1115, column: 13, scope: !587)
!587 = distinct !DILexicalBlock(scope: !479, file: !144, line: 1113, column: 193)
!588 = !DILocation(line: 1116, column: 9, scope: !587)
!589 = !DILocation(line: 1119, column: 38, scope: !467)
!590 = !DILocation(line: 1119, column: 11, scope: !467)
!591 = !DILocation(line: 1119, column: 9, scope: !467)
!592 = !DILocation(line: 1120, column: 9, scope: !593)
!593 = distinct !DILexicalBlock(scope: !467, file: !144, line: 1120, column: 9)
!594 = !DILocation(line: 1120, column: 13, scope: !593)
!595 = !DILocation(line: 1120, column: 9, scope: !467)
!596 = !DILocation(line: 1121, column: 9, scope: !593)
!597 = !DILocation(line: 1123, column: 11, scope: !467)
!598 = !DILocation(line: 1123, column: 9, scope: !467)
!599 = !DILocation(line: 1124, column: 11, scope: !467)
!600 = !DILocation(line: 1124, column: 19, scope: !467)
!601 = !DILocation(line: 1124, column: 17, scope: !467)
!602 = !DILocation(line: 1124, column: 9, scope: !467)
!603 = !DILocation(line: 1126, column: 5, scope: !467)
!604 = !DILocation(line: 1126, column: 12, scope: !605)
!605 = !DILexicalBlockFile(scope: !467, file: !144, discriminator: 1)
!606 = !DILocation(line: 1126, column: 18, scope: !605)
!607 = !DILocation(line: 1126, column: 16, scope: !605)
!608 = !DILocation(line: 1126, column: 22, scope: !605)
!609 = !DILocation(line: 1126, column: 5, scope: !605)
!610 = !DILocalVariable(name: "len", scope: !473, file: !144, line: 1127, type: !129)
!611 = !DILocation(line: 1127, column: 18, scope: !473)
!612 = !DILocation(line: 1127, column: 69, scope: !473)
!613 = !DILocation(line: 1127, column: 76, scope: !473)
!614 = !DILocation(line: 1127, column: 26, scope: !473)
!615 = !DILocation(line: 68, column: 16, scope: !259, inlinedAt: !475)
!616 = !DILocation(line: 68, column: 19, scope: !259, inlinedAt: !475)
!617 = !DILocation(line: 68, column: 24, scope: !259, inlinedAt: !475)
!618 = !DILocation(line: 68, column: 38, scope: !259, inlinedAt: !475)
!619 = !DILocation(line: 68, column: 41, scope: !259, inlinedAt: !475)
!620 = !DILocation(line: 68, column: 46, scope: !259, inlinedAt: !475)
!621 = !DILocation(line: 68, column: 34, scope: !259, inlinedAt: !475)
!622 = !DILocation(line: 68, column: 57, scope: !259, inlinedAt: !475)
!623 = !DILocation(line: 68, column: 69, scope: !259, inlinedAt: !475)
!624 = !DILocation(line: 68, column: 72, scope: !259, inlinedAt: !475)
!625 = !DILocation(line: 68, column: 79, scope: !259, inlinedAt: !475)
!626 = !DILocation(line: 68, column: 84, scope: !259, inlinedAt: !475)
!627 = !DILocation(line: 68, column: 99, scope: !259, inlinedAt: !475)
!628 = !DILocation(line: 68, column: 102, scope: !259, inlinedAt: !475)
!629 = !DILocation(line: 68, column: 109, scope: !259, inlinedAt: !475)
!630 = !DILocation(line: 68, column: 114, scope: !259, inlinedAt: !475)
!631 = !DILocation(line: 68, column: 94, scope: !259, inlinedAt: !475)
!632 = !DILocation(line: 68, column: 63, scope: !259, inlinedAt: !475)
!633 = !DILocation(line: 1127, column: 25, scope: !473)
!634 = !DILocation(line: 1127, column: 84, scope: !473)
!635 = !DILocation(line: 1127, column: 90, scope: !473)
!636 = !DILocation(line: 1127, column: 88, scope: !473)
!637 = !DILocation(line: 1127, column: 94, scope: !473)
!638 = !DILocation(line: 1127, column: 81, scope: !473)
!639 = !DILocation(line: 1127, column: 102, scope: !640)
!640 = !DILexicalBlockFile(scope: !473, file: !144, discriminator: 1)
!641 = !DILocation(line: 1127, column: 108, scope: !640)
!642 = !DILocation(line: 1127, column: 106, scope: !640)
!643 = !DILocation(line: 1127, column: 112, scope: !640)
!644 = !DILocation(line: 1127, column: 25, scope: !640)
!645 = !DILocation(line: 1127, column: 163, scope: !472)
!646 = !DILocation(line: 1127, column: 170, scope: !472)
!647 = !DILocation(line: 1127, column: 120, scope: !472)
!648 = !DILocation(line: 68, column: 16, scope: !259, inlinedAt: !471)
!649 = !DILocation(line: 68, column: 19, scope: !259, inlinedAt: !471)
!650 = !DILocation(line: 68, column: 24, scope: !259, inlinedAt: !471)
!651 = !DILocation(line: 68, column: 38, scope: !259, inlinedAt: !471)
!652 = !DILocation(line: 68, column: 41, scope: !259, inlinedAt: !471)
!653 = !DILocation(line: 68, column: 46, scope: !259, inlinedAt: !471)
!654 = !DILocation(line: 68, column: 34, scope: !259, inlinedAt: !471)
!655 = !DILocation(line: 68, column: 57, scope: !259, inlinedAt: !471)
!656 = !DILocation(line: 68, column: 69, scope: !259, inlinedAt: !471)
!657 = !DILocation(line: 68, column: 72, scope: !259, inlinedAt: !471)
!658 = !DILocation(line: 68, column: 79, scope: !259, inlinedAt: !471)
!659 = !DILocation(line: 68, column: 84, scope: !259, inlinedAt: !471)
!660 = !DILocation(line: 68, column: 99, scope: !259, inlinedAt: !471)
!661 = !DILocation(line: 68, column: 102, scope: !259, inlinedAt: !471)
!662 = !DILocation(line: 68, column: 109, scope: !259, inlinedAt: !471)
!663 = !DILocation(line: 68, column: 114, scope: !259, inlinedAt: !471)
!664 = !DILocation(line: 68, column: 94, scope: !259, inlinedAt: !471)
!665 = !DILocation(line: 68, column: 63, scope: !259, inlinedAt: !471)
!666 = !DILocation(line: 1127, column: 119, scope: !472)
!667 = !DILocation(line: 1127, column: 25, scope: !472)
!668 = !DILocation(line: 1127, column: 25, scope: !669)
!669 = !DILexicalBlockFile(scope: !473, file: !144, discriminator: 3)
!670 = !DILocation(line: 1127, column: 24, scope: !669)
!671 = !DILocation(line: 1127, column: 18, scope: !669)
!672 = !DILocalVariable(name: "type", scope: !473, file: !144, line: 1128, type: !135)
!673 = !DILocation(line: 1128, column: 17, scope: !473)
!674 = !DILocation(line: 1128, column: 25, scope: !473)
!675 = !DILocation(line: 1128, column: 32, scope: !473)
!676 = !DILocation(line: 1128, column: 38, scope: !473)
!677 = !DILocation(line: 1128, column: 24, scope: !473)
!678 = !DILocation(line: 1130, column: 13, scope: !473)
!679 = !DILocation(line: 1132, column: 17, scope: !473)
!680 = !DILocation(line: 1132, column: 9, scope: !473)
!681 = !DILocation(line: 1138, column: 37, scope: !682)
!682 = distinct !DILexicalBlock(scope: !473, file: !144, line: 1132, column: 23)
!683 = !DILocation(line: 1138, column: 42, scope: !682)
!684 = !DILocation(line: 1138, column: 47, scope: !682)
!685 = !DILocation(line: 1138, column: 19, scope: !682)
!686 = !DILocation(line: 1138, column: 17, scope: !682)
!687 = !DILocation(line: 1139, column: 17, scope: !688)
!688 = distinct !DILexicalBlock(scope: !682, file: !144, line: 1139, column: 17)
!689 = !DILocation(line: 1139, column: 21, scope: !688)
!690 = !DILocation(line: 1139, column: 17, scope: !682)
!691 = !DILocation(line: 1140, column: 17, scope: !688)
!692 = !DILocation(line: 1141, column: 13, scope: !682)
!693 = !DILocation(line: 1143, column: 13, scope: !682)
!694 = !DILocation(line: 1146, column: 16, scope: !473)
!695 = !DILocation(line: 1146, column: 13, scope: !473)
!696 = !DILocation(line: 1126, column: 5, scope: !697)
!697 = !DILexicalBlockFile(scope: !467, file: !144, discriminator: 2)
!698 = distinct !{!698, !603}
!699 = !DILocation(line: 1149, column: 22, scope: !467)
!700 = !DILocation(line: 1149, column: 11, scope: !467)
!701 = !DILocation(line: 1149, column: 9, scope: !467)
!702 = !DILocation(line: 1149, column: 5, scope: !467)
!703 = !DILocation(line: 1152, column: 5, scope: !467)
!704 = !DILocation(line: 1153, column: 13, scope: !467)
!705 = !DILocation(line: 1153, column: 5, scope: !467)
!706 = !DILocation(line: 1154, column: 12, scope: !467)
!707 = !DILocation(line: 1154, column: 5, scope: !467)
!708 = distinct !DISubprogram(name: "hvcc_init", scope: !144, file: !144, line: 802, type: !709, isLocal: true, isDefinition: true, scopeLine: 803, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !257)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !711}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!712 = !DILocalVariable(name: "hvcc", arg: 1, scope: !708, file: !144, line: 802, type: !711)
!713 = !DILocation(line: 802, column: 55, scope: !708)
!714 = !DILocation(line: 804, column: 12, scope: !708)
!715 = !DILocation(line: 804, column: 5, scope: !708)
!716 = !DILocation(line: 805, column: 5, scope: !708)
!717 = !DILocation(line: 805, column: 11, scope: !708)
!718 = !DILocation(line: 805, column: 32, scope: !708)
!719 = !DILocation(line: 806, column: 5, scope: !708)
!720 = !DILocation(line: 806, column: 11, scope: !708)
!721 = !DILocation(line: 806, column: 30, scope: !708)
!722 = !DILocation(line: 812, column: 5, scope: !708)
!723 = !DILocation(line: 812, column: 11, scope: !708)
!724 = !DILocation(line: 812, column: 47, scope: !708)
!725 = !DILocation(line: 813, column: 5, scope: !708)
!726 = !DILocation(line: 813, column: 11, scope: !708)
!727 = !DILocation(line: 813, column: 46, scope: !708)
!728 = !DILocation(line: 819, column: 5, scope: !708)
!729 = !DILocation(line: 819, column: 11, scope: !708)
!730 = !DILocation(line: 819, column: 40, scope: !708)
!731 = !DILocation(line: 820, column: 1, scope: !708)
!732 = distinct !DISubprogram(name: "hvcc_add_nal_unit", scope: !144, file: !144, line: 746, type: !733, isLocal: true, isDefinition: true, scopeLine: 749, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !257)
!733 = !DISubroutineType(types: !734)
!734 = !{!132, !205, !129, !132, !711}
!735 = !DILocalVariable(name: "nal_buf", arg: 1, scope: !732, file: !144, line: 746, type: !205)
!736 = !DILocation(line: 746, column: 39, scope: !732)
!737 = !DILocalVariable(name: "nal_size", arg: 2, scope: !732, file: !144, line: 746, type: !129)
!738 = !DILocation(line: 746, column: 57, scope: !732)
!739 = !DILocalVariable(name: "ps_array_completeness", arg: 3, scope: !732, file: !144, line: 747, type: !132)
!740 = !DILocation(line: 747, column: 34, scope: !732)
!741 = !DILocalVariable(name: "hvcc", arg: 4, scope: !732, file: !144, line: 748, type: !711)
!742 = !DILocation(line: 748, column: 62, scope: !732)
!743 = !DILocalVariable(name: "ret", scope: !732, file: !144, line: 750, type: !132)
!744 = !DILocation(line: 750, column: 9, scope: !732)
!745 = !DILocalVariable(name: "gbc", scope: !732, file: !144, line: 751, type: !746)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !747, line: 70, baseType: !748)
!747 = !DIFile(filename: "./libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !747, line: 61, size: 256, align: 64, elements: !749)
!749 = !{!750, !751, !752, !753, !754}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !748, file: !747, line: 62, baseType: !133, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !748, file: !747, line: 62, baseType: !133, size: 64, align: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !748, file: !747, line: 67, baseType: !132, size: 32, align: 32, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !748, file: !747, line: 68, baseType: !132, size: 32, align: 32, offset: 160)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !748, file: !747, line: 69, baseType: !132, size: 32, align: 32, offset: 192)
!755 = !DILocation(line: 751, column: 19, scope: !732)
!756 = !DILocalVariable(name: "nal_type", scope: !732, file: !144, line: 752, type: !135)
!757 = !DILocation(line: 752, column: 13, scope: !732)
!758 = !DILocalVariable(name: "rbsp_buf", scope: !732, file: !144, line: 753, type: !205)
!759 = !DILocation(line: 753, column: 14, scope: !732)
!760 = !DILocalVariable(name: "rbsp_size", scope: !732, file: !144, line: 754, type: !129)
!761 = !DILocation(line: 754, column: 14, scope: !732)
!762 = !DILocation(line: 756, column: 38, scope: !732)
!763 = !DILocation(line: 756, column: 47, scope: !732)
!764 = !DILocation(line: 756, column: 16, scope: !732)
!765 = !DILocation(line: 756, column: 14, scope: !732)
!766 = !DILocation(line: 757, column: 10, scope: !767)
!767 = distinct !DILexicalBlock(scope: !732, file: !144, line: 757, column: 9)
!768 = !DILocation(line: 757, column: 9, scope: !732)
!769 = !DILocation(line: 758, column: 13, scope: !770)
!770 = distinct !DILexicalBlock(scope: !767, file: !144, line: 757, column: 20)
!771 = !DILocation(line: 759, column: 9, scope: !770)
!772 = !DILocation(line: 762, column: 32, scope: !732)
!773 = !DILocation(line: 762, column: 42, scope: !732)
!774 = !DILocation(line: 762, column: 11, scope: !732)
!775 = !DILocation(line: 762, column: 9, scope: !732)
!776 = !DILocation(line: 763, column: 9, scope: !777)
!777 = distinct !DILexicalBlock(scope: !732, file: !144, line: 763, column: 9)
!778 = !DILocation(line: 763, column: 13, scope: !777)
!779 = !DILocation(line: 763, column: 9, scope: !732)
!780 = !DILocation(line: 764, column: 9, scope: !777)
!781 = !DILocation(line: 766, column: 5, scope: !732)
!782 = !DILocation(line: 773, column: 13, scope: !732)
!783 = !DILocation(line: 773, column: 5, scope: !732)
!784 = !DILocation(line: 779, column: 39, scope: !785)
!785 = distinct !DILexicalBlock(scope: !732, file: !144, line: 773, column: 23)
!786 = !DILocation(line: 779, column: 48, scope: !785)
!787 = !DILocation(line: 779, column: 58, scope: !785)
!788 = !DILocation(line: 780, column: 39, scope: !785)
!789 = !DILocation(line: 780, column: 62, scope: !785)
!790 = !DILocation(line: 779, column: 15, scope: !785)
!791 = !DILocation(line: 779, column: 13, scope: !785)
!792 = !DILocation(line: 781, column: 13, scope: !793)
!793 = distinct !DILexicalBlock(scope: !785, file: !144, line: 781, column: 13)
!794 = !DILocation(line: 781, column: 17, scope: !793)
!795 = !DILocation(line: 781, column: 13, scope: !785)
!796 = !DILocation(line: 782, column: 13, scope: !793)
!797 = !DILocation(line: 783, column: 18, scope: !798)
!798 = distinct !DILexicalBlock(scope: !793, file: !144, line: 783, column: 18)
!799 = !DILocation(line: 783, column: 27, scope: !798)
!800 = !DILocation(line: 783, column: 18, scope: !793)
!801 = !DILocation(line: 784, column: 40, scope: !798)
!802 = !DILocation(line: 784, column: 19, scope: !798)
!803 = !DILocation(line: 784, column: 17, scope: !798)
!804 = !DILocation(line: 784, column: 13, scope: !798)
!805 = !DILocation(line: 785, column: 18, scope: !806)
!806 = distinct !DILexicalBlock(scope: !798, file: !144, line: 785, column: 18)
!807 = !DILocation(line: 785, column: 27, scope: !806)
!808 = !DILocation(line: 785, column: 18, scope: !798)
!809 = !DILocation(line: 786, column: 40, scope: !806)
!810 = !DILocation(line: 786, column: 19, scope: !806)
!811 = !DILocation(line: 786, column: 17, scope: !806)
!812 = !DILocation(line: 786, column: 13, scope: !806)
!813 = !DILocation(line: 787, column: 18, scope: !814)
!814 = distinct !DILexicalBlock(scope: !806, file: !144, line: 787, column: 18)
!815 = !DILocation(line: 787, column: 27, scope: !814)
!816 = !DILocation(line: 787, column: 18, scope: !806)
!817 = !DILocation(line: 788, column: 40, scope: !814)
!818 = !DILocation(line: 788, column: 19, scope: !814)
!819 = !DILocation(line: 788, column: 17, scope: !814)
!820 = !DILocation(line: 788, column: 13, scope: !814)
!821 = !DILocation(line: 789, column: 13, scope: !822)
!822 = distinct !DILexicalBlock(scope: !785, file: !144, line: 789, column: 13)
!823 = !DILocation(line: 789, column: 17, scope: !822)
!824 = !DILocation(line: 789, column: 13, scope: !785)
!825 = !DILocation(line: 790, column: 13, scope: !822)
!826 = !DILocation(line: 791, column: 9, scope: !785)
!827 = !DILocation(line: 793, column: 13, scope: !785)
!828 = !DILocation(line: 794, column: 9, scope: !785)
!829 = !DILocation(line: 795, column: 5, scope: !785)
!830 = !DILocation(line: 798, column: 13, scope: !732)
!831 = !DILocation(line: 798, column: 5, scope: !732)
!832 = !DILocation(line: 799, column: 12, scope: !732)
!833 = !DILocation(line: 799, column: 5, scope: !732)
!834 = distinct !DISubprogram(name: "hvcc_write", scope: !144, file: !144, line: 836, type: !835, isLocal: true, isDefinition: true, scopeLine: 837, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !257)
!835 = !DISubroutineType(types: !836)
!836 = !{!132, !147, !711}
!837 = !DILocalVariable(name: "pb", arg: 1, scope: !834, file: !144, line: 836, type: !147)
!838 = !DILocation(line: 836, column: 36, scope: !834)
!839 = !DILocalVariable(name: "hvcc", arg: 2, scope: !834, file: !144, line: 836, type: !711)
!840 = !DILocation(line: 836, column: 72, scope: !834)
!841 = !DILocalVariable(name: "i", scope: !834, file: !144, line: 838, type: !135)
!842 = !DILocation(line: 838, column: 13, scope: !834)
!843 = !DILocalVariable(name: "j", scope: !834, file: !144, line: 839, type: !510)
!844 = !DILocation(line: 839, column: 14, scope: !834)
!845 = !DILocalVariable(name: "vps_count", scope: !834, file: !144, line: 839, type: !510)
!846 = !DILocation(line: 839, column: 17, scope: !834)
!847 = !DILocalVariable(name: "sps_count", scope: !834, file: !144, line: 839, type: !510)
!848 = !DILocation(line: 839, column: 32, scope: !834)
!849 = !DILocalVariable(name: "pps_count", scope: !834, file: !144, line: 839, type: !510)
!850 = !DILocation(line: 839, column: 47, scope: !834)
!851 = !DILocation(line: 844, column: 5, scope: !834)
!852 = !DILocation(line: 844, column: 11, scope: !834)
!853 = !DILocation(line: 844, column: 32, scope: !834)
!854 = !DILocation(line: 849, column: 9, scope: !855)
!855 = distinct !DILexicalBlock(scope: !834, file: !144, line: 849, column: 9)
!856 = !DILocation(line: 849, column: 15, scope: !855)
!857 = !DILocation(line: 849, column: 44, scope: !855)
!858 = !DILocation(line: 849, column: 9, scope: !834)
!859 = !DILocation(line: 850, column: 9, scope: !855)
!860 = !DILocation(line: 850, column: 15, scope: !855)
!861 = !DILocation(line: 850, column: 44, scope: !855)
!862 = !DILocation(line: 857, column: 10, scope: !863)
!863 = distinct !DILexicalBlock(scope: !834, file: !144, line: 857, column: 9)
!864 = !DILocation(line: 857, column: 16, scope: !863)
!865 = !DILocation(line: 857, column: 9, scope: !834)
!866 = !DILocation(line: 858, column: 9, scope: !863)
!867 = !DILocation(line: 858, column: 15, scope: !863)
!868 = !DILocation(line: 858, column: 31, scope: !863)
!869 = !DILocation(line: 864, column: 5, scope: !834)
!870 = !DILocation(line: 864, column: 11, scope: !834)
!871 = !DILocation(line: 864, column: 24, scope: !834)
!872 = !DILocation(line: 865, column: 5, scope: !834)
!873 = !DILocation(line: 865, column: 11, scope: !834)
!874 = !DILocation(line: 865, column: 29, scope: !834)
!875 = !DILocation(line: 868, column: 13, scope: !834)
!876 = !DILocation(line: 868, column: 19, scope: !834)
!877 = !DILocation(line: 867, column: 5, scope: !834)
!878 = !DILocation(line: 870, column: 13, scope: !834)
!879 = !DILocation(line: 870, column: 19, scope: !834)
!880 = !DILocation(line: 869, column: 5, scope: !834)
!881 = !DILocation(line: 872, column: 13, scope: !834)
!882 = !DILocation(line: 872, column: 19, scope: !834)
!883 = !DILocation(line: 871, column: 5, scope: !834)
!884 = !DILocation(line: 874, column: 13, scope: !834)
!885 = !DILocation(line: 874, column: 19, scope: !834)
!886 = !DILocation(line: 873, column: 5, scope: !834)
!887 = !DILocation(line: 876, column: 13, scope: !834)
!888 = !DILocation(line: 876, column: 19, scope: !834)
!889 = !DILocation(line: 875, column: 5, scope: !834)
!890 = !DILocation(line: 878, column: 13, scope: !834)
!891 = !DILocation(line: 878, column: 19, scope: !834)
!892 = !DILocation(line: 877, column: 5, scope: !834)
!893 = !DILocation(line: 880, column: 13, scope: !834)
!894 = !DILocation(line: 880, column: 19, scope: !834)
!895 = !DILocation(line: 879, column: 5, scope: !834)
!896 = !DILocation(line: 882, column: 13, scope: !834)
!897 = !DILocation(line: 882, column: 19, scope: !834)
!898 = !DILocation(line: 881, column: 5, scope: !834)
!899 = !DILocation(line: 884, column: 13, scope: !834)
!900 = !DILocation(line: 884, column: 19, scope: !834)
!901 = !DILocation(line: 883, column: 5, scope: !834)
!902 = !DILocation(line: 886, column: 13, scope: !834)
!903 = !DILocation(line: 886, column: 19, scope: !834)
!904 = !DILocation(line: 885, column: 5, scope: !834)
!905 = !DILocation(line: 888, column: 13, scope: !834)
!906 = !DILocation(line: 888, column: 19, scope: !834)
!907 = !DILocation(line: 887, column: 5, scope: !834)
!908 = !DILocation(line: 890, column: 13, scope: !834)
!909 = !DILocation(line: 890, column: 19, scope: !834)
!910 = !DILocation(line: 889, column: 5, scope: !834)
!911 = !DILocation(line: 892, column: 13, scope: !834)
!912 = !DILocation(line: 892, column: 19, scope: !834)
!913 = !DILocation(line: 891, column: 5, scope: !834)
!914 = !DILocation(line: 894, column: 13, scope: !834)
!915 = !DILocation(line: 894, column: 19, scope: !834)
!916 = !DILocation(line: 893, column: 5, scope: !834)
!917 = !DILocation(line: 896, column: 13, scope: !834)
!918 = !DILocation(line: 896, column: 19, scope: !834)
!919 = !DILocation(line: 895, column: 5, scope: !834)
!920 = !DILocation(line: 898, column: 13, scope: !834)
!921 = !DILocation(line: 898, column: 19, scope: !834)
!922 = !DILocation(line: 897, column: 5, scope: !834)
!923 = !DILocation(line: 900, column: 13, scope: !834)
!924 = !DILocation(line: 900, column: 19, scope: !834)
!925 = !DILocation(line: 899, column: 5, scope: !834)
!926 = !DILocation(line: 902, column: 13, scope: !834)
!927 = !DILocation(line: 902, column: 19, scope: !834)
!928 = !DILocation(line: 901, column: 5, scope: !834)
!929 = !DILocation(line: 903, column: 12, scope: !930)
!930 = distinct !DILexicalBlock(scope: !834, file: !144, line: 903, column: 5)
!931 = !DILocation(line: 903, column: 10, scope: !930)
!932 = !DILocation(line: 903, column: 17, scope: !933)
!933 = !DILexicalBlockFile(scope: !934, file: !144, discriminator: 1)
!934 = distinct !DILexicalBlock(scope: !930, file: !144, line: 903, column: 5)
!935 = !DILocation(line: 903, column: 21, scope: !933)
!936 = !DILocation(line: 903, column: 27, scope: !933)
!937 = !DILocation(line: 903, column: 19, scope: !933)
!938 = !DILocation(line: 903, column: 5, scope: !933)
!939 = !DILocation(line: 905, column: 17, scope: !940)
!940 = distinct !DILexicalBlock(scope: !934, file: !144, line: 903, column: 45)
!941 = !DILocation(line: 905, column: 32, scope: !940)
!942 = !DILocation(line: 905, column: 20, scope: !940)
!943 = !DILocation(line: 905, column: 26, scope: !940)
!944 = !DILocation(line: 905, column: 35, scope: !940)
!945 = !DILocation(line: 904, column: 9, scope: !940)
!946 = !DILocation(line: 907, column: 17, scope: !940)
!947 = !DILocation(line: 907, column: 32, scope: !940)
!948 = !DILocation(line: 907, column: 20, scope: !940)
!949 = !DILocation(line: 907, column: 26, scope: !940)
!950 = !DILocation(line: 907, column: 35, scope: !940)
!951 = !DILocation(line: 906, column: 9, scope: !940)
!952 = !DILocation(line: 909, column: 17, scope: !940)
!953 = !DILocation(line: 909, column: 32, scope: !940)
!954 = !DILocation(line: 909, column: 20, scope: !940)
!955 = !DILocation(line: 909, column: 26, scope: !940)
!956 = !DILocation(line: 909, column: 35, scope: !940)
!957 = !DILocation(line: 908, column: 9, scope: !940)
!958 = !DILocation(line: 910, column: 16, scope: !959)
!959 = distinct !DILexicalBlock(scope: !940, file: !144, line: 910, column: 9)
!960 = !DILocation(line: 910, column: 14, scope: !959)
!961 = !DILocation(line: 910, column: 21, scope: !962)
!962 = !DILexicalBlockFile(scope: !963, file: !144, discriminator: 1)
!963 = distinct !DILexicalBlock(scope: !959, file: !144, line: 910, column: 9)
!964 = !DILocation(line: 910, column: 37, scope: !962)
!965 = !DILocation(line: 910, column: 25, scope: !962)
!966 = !DILocation(line: 910, column: 31, scope: !962)
!967 = !DILocation(line: 910, column: 40, scope: !962)
!968 = !DILocation(line: 910, column: 23, scope: !962)
!969 = !DILocation(line: 910, column: 9, scope: !962)
!970 = !DILocation(line: 913, column: 21, scope: !963)
!971 = !DILocation(line: 913, column: 24, scope: !963)
!972 = !DILocation(line: 913, column: 56, scope: !963)
!973 = !DILocation(line: 913, column: 27, scope: !963)
!974 = !DILocation(line: 913, column: 39, scope: !963)
!975 = !DILocation(line: 913, column: 33, scope: !963)
!976 = !DILocation(line: 913, column: 42, scope: !963)
!977 = !DILocation(line: 911, column: 13, scope: !963)
!978 = !DILocation(line: 910, column: 51, scope: !979)
!979 = !DILexicalBlockFile(scope: !963, file: !144, discriminator: 2)
!980 = !DILocation(line: 910, column: 9, scope: !979)
!981 = distinct !{!981, !982}
!982 = !DILocation(line: 910, column: 9, scope: !940)
!983 = !DILocation(line: 914, column: 5, scope: !940)
!984 = !DILocation(line: 903, column: 41, scope: !985)
!985 = !DILexicalBlockFile(scope: !934, file: !144, discriminator: 2)
!986 = !DILocation(line: 903, column: 5, scope: !985)
!987 = distinct !{!987, !988}
!988 = !DILocation(line: 903, column: 5, scope: !834)
!989 = !DILocation(line: 919, column: 12, scope: !990)
!990 = distinct !DILexicalBlock(scope: !834, file: !144, line: 919, column: 5)
!991 = !DILocation(line: 919, column: 10, scope: !990)
!992 = !DILocation(line: 919, column: 17, scope: !993)
!993 = !DILexicalBlockFile(scope: !994, file: !144, discriminator: 1)
!994 = distinct !DILexicalBlock(scope: !990, file: !144, line: 919, column: 5)
!995 = !DILocation(line: 919, column: 21, scope: !993)
!996 = !DILocation(line: 919, column: 27, scope: !993)
!997 = !DILocation(line: 919, column: 19, scope: !993)
!998 = !DILocation(line: 919, column: 5, scope: !993)
!999 = !DILocation(line: 920, column: 29, scope: !994)
!1000 = !DILocation(line: 920, column: 17, scope: !994)
!1001 = !DILocation(line: 920, column: 23, scope: !994)
!1002 = !DILocation(line: 920, column: 32, scope: !994)
!1003 = !DILocation(line: 920, column: 9, scope: !994)
!1004 = !DILocation(line: 922, column: 38, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !994, file: !144, line: 920, column: 47)
!1006 = !DILocation(line: 922, column: 26, scope: !1005)
!1007 = !DILocation(line: 922, column: 32, scope: !1005)
!1008 = !DILocation(line: 922, column: 41, scope: !1005)
!1009 = !DILocation(line: 922, column: 23, scope: !1005)
!1010 = !DILocation(line: 923, column: 13, scope: !1005)
!1011 = !DILocation(line: 925, column: 38, scope: !1005)
!1012 = !DILocation(line: 925, column: 26, scope: !1005)
!1013 = !DILocation(line: 925, column: 32, scope: !1005)
!1014 = !DILocation(line: 925, column: 41, scope: !1005)
!1015 = !DILocation(line: 925, column: 23, scope: !1005)
!1016 = !DILocation(line: 926, column: 13, scope: !1005)
!1017 = !DILocation(line: 928, column: 38, scope: !1005)
!1018 = !DILocation(line: 928, column: 26, scope: !1005)
!1019 = !DILocation(line: 928, column: 32, scope: !1005)
!1020 = !DILocation(line: 928, column: 41, scope: !1005)
!1021 = !DILocation(line: 928, column: 23, scope: !1005)
!1022 = !DILocation(line: 929, column: 13, scope: !1005)
!1023 = !DILocation(line: 931, column: 13, scope: !1005)
!1024 = !DILocation(line: 932, column: 9, scope: !1005)
!1025 = !DILocation(line: 919, column: 41, scope: !1026)
!1026 = !DILexicalBlockFile(scope: !994, file: !144, discriminator: 2)
!1027 = !DILocation(line: 919, column: 5, scope: !1026)
!1028 = distinct !{!1028, !1029}
!1029 = !DILocation(line: 919, column: 5, scope: !834)
!1030 = !DILocation(line: 933, column: 10, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !834, file: !144, line: 933, column: 9)
!1032 = !DILocation(line: 933, column: 20, scope: !1031)
!1033 = !DILocation(line: 933, column: 23, scope: !1034)
!1034 = !DILexicalBlockFile(scope: !1031, file: !144, discriminator: 1)
!1035 = !DILocation(line: 933, column: 33, scope: !1034)
!1036 = !DILocation(line: 933, column: 54, scope: !1034)
!1037 = !DILocation(line: 934, column: 10, scope: !1031)
!1038 = !DILocation(line: 934, column: 20, scope: !1031)
!1039 = !DILocation(line: 934, column: 23, scope: !1034)
!1040 = !DILocation(line: 934, column: 33, scope: !1034)
!1041 = !DILocation(line: 934, column: 54, scope: !1034)
!1042 = !DILocation(line: 935, column: 10, scope: !1031)
!1043 = !DILocation(line: 935, column: 20, scope: !1031)
!1044 = !DILocation(line: 935, column: 23, scope: !1034)
!1045 = !DILocation(line: 935, column: 33, scope: !1034)
!1046 = !DILocation(line: 933, column: 9, scope: !1047)
!1047 = !DILexicalBlockFile(scope: !834, file: !144, discriminator: 2)
!1048 = !DILocation(line: 936, column: 9, scope: !1031)
!1049 = !DILocation(line: 939, column: 13, scope: !834)
!1050 = !DILocation(line: 939, column: 17, scope: !834)
!1051 = !DILocation(line: 939, column: 23, scope: !834)
!1052 = !DILocation(line: 939, column: 5, scope: !834)
!1053 = !DILocation(line: 946, column: 13, scope: !834)
!1054 = !DILocation(line: 946, column: 17, scope: !834)
!1055 = !DILocation(line: 946, column: 23, scope: !834)
!1056 = !DILocation(line: 946, column: 45, scope: !834)
!1057 = !DILocation(line: 947, column: 17, scope: !834)
!1058 = !DILocation(line: 947, column: 23, scope: !834)
!1059 = !DILocation(line: 947, column: 41, scope: !834)
!1060 = !DILocation(line: 946, column: 50, scope: !834)
!1061 = !DILocation(line: 948, column: 17, scope: !834)
!1062 = !DILocation(line: 948, column: 23, scope: !834)
!1063 = !DILocation(line: 947, column: 46, scope: !834)
!1064 = !DILocation(line: 946, column: 5, scope: !834)
!1065 = !DILocation(line: 951, column: 15, scope: !834)
!1066 = !DILocation(line: 951, column: 19, scope: !834)
!1067 = !DILocation(line: 951, column: 25, scope: !834)
!1068 = !DILocation(line: 951, column: 5, scope: !834)
!1069 = !DILocation(line: 954, column: 15, scope: !834)
!1070 = !DILocation(line: 954, column: 19, scope: !834)
!1071 = !DILocation(line: 954, column: 25, scope: !834)
!1072 = !DILocation(line: 954, column: 60, scope: !834)
!1073 = !DILocation(line: 954, column: 5, scope: !834)
!1074 = !DILocation(line: 955, column: 15, scope: !834)
!1075 = !DILocation(line: 955, column: 19, scope: !834)
!1076 = !DILocation(line: 955, column: 25, scope: !834)
!1077 = !DILocation(line: 955, column: 5, scope: !834)
!1078 = !DILocation(line: 958, column: 13, scope: !834)
!1079 = !DILocation(line: 958, column: 17, scope: !834)
!1080 = !DILocation(line: 958, column: 23, scope: !834)
!1081 = !DILocation(line: 958, column: 5, scope: !834)
!1082 = !DILocation(line: 964, column: 15, scope: !834)
!1083 = !DILocation(line: 964, column: 19, scope: !834)
!1084 = !DILocation(line: 964, column: 25, scope: !834)
!1085 = !DILocation(line: 964, column: 54, scope: !834)
!1086 = !DILocation(line: 964, column: 5, scope: !834)
!1087 = !DILocation(line: 970, column: 13, scope: !834)
!1088 = !DILocation(line: 970, column: 17, scope: !834)
!1089 = !DILocation(line: 970, column: 23, scope: !834)
!1090 = !DILocation(line: 970, column: 39, scope: !834)
!1091 = !DILocation(line: 970, column: 5, scope: !834)
!1092 = !DILocation(line: 976, column: 13, scope: !834)
!1093 = !DILocation(line: 976, column: 17, scope: !834)
!1094 = !DILocation(line: 976, column: 23, scope: !834)
!1095 = !DILocation(line: 976, column: 36, scope: !834)
!1096 = !DILocation(line: 976, column: 5, scope: !834)
!1097 = !DILocation(line: 982, column: 13, scope: !834)
!1098 = !DILocation(line: 982, column: 17, scope: !834)
!1099 = !DILocation(line: 982, column: 23, scope: !834)
!1100 = !DILocation(line: 982, column: 42, scope: !834)
!1101 = !DILocation(line: 982, column: 5, scope: !834)
!1102 = !DILocation(line: 988, column: 13, scope: !834)
!1103 = !DILocation(line: 988, column: 17, scope: !834)
!1104 = !DILocation(line: 988, column: 23, scope: !834)
!1105 = !DILocation(line: 988, column: 44, scope: !834)
!1106 = !DILocation(line: 988, column: 5, scope: !834)
!1107 = !DILocation(line: 991, column: 15, scope: !834)
!1108 = !DILocation(line: 991, column: 19, scope: !834)
!1109 = !DILocation(line: 991, column: 25, scope: !834)
!1110 = !DILocation(line: 991, column: 5, scope: !834)
!1111 = !DILocation(line: 999, column: 13, scope: !834)
!1112 = !DILocation(line: 999, column: 17, scope: !834)
!1113 = !DILocation(line: 999, column: 23, scope: !834)
!1114 = !DILocation(line: 999, column: 41, scope: !834)
!1115 = !DILocation(line: 1000, column: 17, scope: !834)
!1116 = !DILocation(line: 1000, column: 23, scope: !834)
!1117 = !DILocation(line: 1000, column: 41, scope: !834)
!1118 = !DILocation(line: 999, column: 46, scope: !834)
!1119 = !DILocation(line: 1001, column: 17, scope: !834)
!1120 = !DILocation(line: 1001, column: 23, scope: !834)
!1121 = !DILocation(line: 1001, column: 40, scope: !834)
!1122 = !DILocation(line: 1000, column: 46, scope: !834)
!1123 = !DILocation(line: 1002, column: 17, scope: !834)
!1124 = !DILocation(line: 1002, column: 23, scope: !834)
!1125 = !DILocation(line: 1001, column: 45, scope: !834)
!1126 = !DILocation(line: 999, column: 5, scope: !834)
!1127 = !DILocation(line: 1005, column: 13, scope: !834)
!1128 = !DILocation(line: 1005, column: 17, scope: !834)
!1129 = !DILocation(line: 1005, column: 23, scope: !834)
!1130 = !DILocation(line: 1005, column: 5, scope: !834)
!1131 = !DILocation(line: 1007, column: 12, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !834, file: !144, line: 1007, column: 5)
!1133 = !DILocation(line: 1007, column: 10, scope: !1132)
!1134 = !DILocation(line: 1007, column: 17, scope: !1135)
!1135 = !DILexicalBlockFile(scope: !1136, file: !144, discriminator: 1)
!1136 = distinct !DILexicalBlock(scope: !1132, file: !144, line: 1007, column: 5)
!1137 = !DILocation(line: 1007, column: 21, scope: !1135)
!1138 = !DILocation(line: 1007, column: 27, scope: !1135)
!1139 = !DILocation(line: 1007, column: 19, scope: !1135)
!1140 = !DILocation(line: 1007, column: 5, scope: !1135)
!1141 = !DILocation(line: 1013, column: 17, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1136, file: !144, line: 1007, column: 45)
!1143 = !DILocation(line: 1013, column: 33, scope: !1142)
!1144 = !DILocation(line: 1013, column: 21, scope: !1142)
!1145 = !DILocation(line: 1013, column: 27, scope: !1142)
!1146 = !DILocation(line: 1013, column: 36, scope: !1142)
!1147 = !DILocation(line: 1013, column: 55, scope: !1142)
!1148 = !DILocation(line: 1014, column: 33, scope: !1142)
!1149 = !DILocation(line: 1014, column: 21, scope: !1142)
!1150 = !DILocation(line: 1014, column: 27, scope: !1142)
!1151 = !DILocation(line: 1014, column: 36, scope: !1142)
!1152 = !DILocation(line: 1014, column: 50, scope: !1142)
!1153 = !DILocation(line: 1013, column: 60, scope: !1142)
!1154 = !DILocation(line: 1013, column: 9, scope: !1142)
!1155 = !DILocation(line: 1017, column: 19, scope: !1142)
!1156 = !DILocation(line: 1017, column: 35, scope: !1142)
!1157 = !DILocation(line: 1017, column: 23, scope: !1142)
!1158 = !DILocation(line: 1017, column: 29, scope: !1142)
!1159 = !DILocation(line: 1017, column: 38, scope: !1142)
!1160 = !DILocation(line: 1017, column: 9, scope: !1142)
!1161 = !DILocation(line: 1019, column: 16, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1142, file: !144, line: 1019, column: 9)
!1163 = !DILocation(line: 1019, column: 14, scope: !1162)
!1164 = !DILocation(line: 1019, column: 21, scope: !1165)
!1165 = !DILexicalBlockFile(scope: !1166, file: !144, discriminator: 1)
!1166 = distinct !DILexicalBlock(scope: !1162, file: !144, line: 1019, column: 9)
!1167 = !DILocation(line: 1019, column: 37, scope: !1165)
!1168 = !DILocation(line: 1019, column: 25, scope: !1165)
!1169 = !DILocation(line: 1019, column: 31, scope: !1165)
!1170 = !DILocation(line: 1019, column: 40, scope: !1165)
!1171 = !DILocation(line: 1019, column: 23, scope: !1165)
!1172 = !DILocation(line: 1019, column: 9, scope: !1165)
!1173 = !DILocation(line: 1021, column: 23, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1166, file: !144, line: 1019, column: 55)
!1175 = !DILocation(line: 1021, column: 56, scope: !1174)
!1176 = !DILocation(line: 1021, column: 27, scope: !1174)
!1177 = !DILocation(line: 1021, column: 39, scope: !1174)
!1178 = !DILocation(line: 1021, column: 33, scope: !1174)
!1179 = !DILocation(line: 1021, column: 42, scope: !1174)
!1180 = !DILocation(line: 1021, column: 13, scope: !1174)
!1181 = !DILocation(line: 1024, column: 24, scope: !1174)
!1182 = !DILocation(line: 1024, column: 51, scope: !1174)
!1183 = !DILocation(line: 1024, column: 28, scope: !1174)
!1184 = !DILocation(line: 1024, column: 40, scope: !1174)
!1185 = !DILocation(line: 1024, column: 34, scope: !1174)
!1186 = !DILocation(line: 1024, column: 43, scope: !1174)
!1187 = !DILocation(line: 1025, column: 53, scope: !1174)
!1188 = !DILocation(line: 1025, column: 24, scope: !1174)
!1189 = !DILocation(line: 1025, column: 36, scope: !1174)
!1190 = !DILocation(line: 1025, column: 30, scope: !1174)
!1191 = !DILocation(line: 1025, column: 39, scope: !1174)
!1192 = !DILocation(line: 1024, column: 13, scope: !1174)
!1193 = !DILocation(line: 1026, column: 9, scope: !1174)
!1194 = !DILocation(line: 1019, column: 51, scope: !1195)
!1195 = !DILexicalBlockFile(scope: !1166, file: !144, discriminator: 2)
!1196 = !DILocation(line: 1019, column: 9, scope: !1195)
!1197 = distinct !{!1197, !1198}
!1198 = !DILocation(line: 1019, column: 9, scope: !1142)
!1199 = !DILocation(line: 1027, column: 5, scope: !1142)
!1200 = !DILocation(line: 1007, column: 41, scope: !1201)
!1201 = !DILexicalBlockFile(scope: !1136, file: !144, discriminator: 2)
!1202 = !DILocation(line: 1007, column: 5, scope: !1201)
!1203 = distinct !{!1203, !1204}
!1204 = !DILocation(line: 1007, column: 5, scope: !834)
!1205 = !DILocation(line: 1029, column: 5, scope: !834)
!1206 = !DILocation(line: 1030, column: 1, scope: !834)
!1207 = distinct !DISubprogram(name: "hvcc_close", scope: !144, file: !144, line: 822, type: !709, isLocal: true, isDefinition: true, scopeLine: 823, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !257)
!1208 = !DILocalVariable(name: "hvcc", arg: 1, scope: !1207, file: !144, line: 822, type: !711)
!1209 = !DILocation(line: 822, column: 56, scope: !1207)
!1210 = !DILocalVariable(name: "i", scope: !1207, file: !144, line: 824, type: !135)
!1211 = !DILocation(line: 824, column: 13, scope: !1207)
!1212 = !DILocation(line: 826, column: 12, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1207, file: !144, line: 826, column: 5)
!1214 = !DILocation(line: 826, column: 10, scope: !1213)
!1215 = !DILocation(line: 826, column: 17, scope: !1216)
!1216 = !DILexicalBlockFile(scope: !1217, file: !144, discriminator: 1)
!1217 = distinct !DILexicalBlock(scope: !1213, file: !144, line: 826, column: 5)
!1218 = !DILocation(line: 826, column: 21, scope: !1216)
!1219 = !DILocation(line: 826, column: 27, scope: !1216)
!1220 = !DILocation(line: 826, column: 19, scope: !1216)
!1221 = !DILocation(line: 826, column: 5, scope: !1216)
!1222 = !DILocation(line: 827, column: 21, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1217, file: !144, line: 826, column: 45)
!1224 = !DILocation(line: 827, column: 9, scope: !1223)
!1225 = !DILocation(line: 827, column: 15, scope: !1223)
!1226 = !DILocation(line: 827, column: 24, scope: !1223)
!1227 = !DILocation(line: 827, column: 33, scope: !1223)
!1228 = !DILocation(line: 828, column: 31, scope: !1223)
!1229 = !DILocation(line: 828, column: 19, scope: !1223)
!1230 = !DILocation(line: 828, column: 25, scope: !1223)
!1231 = !DILocation(line: 828, column: 34, scope: !1223)
!1232 = !DILocation(line: 828, column: 18, scope: !1223)
!1233 = !DILocation(line: 828, column: 9, scope: !1223)
!1234 = !DILocation(line: 829, column: 31, scope: !1223)
!1235 = !DILocation(line: 829, column: 19, scope: !1223)
!1236 = !DILocation(line: 829, column: 25, scope: !1223)
!1237 = !DILocation(line: 829, column: 34, scope: !1223)
!1238 = !DILocation(line: 829, column: 18, scope: !1223)
!1239 = !DILocation(line: 829, column: 9, scope: !1223)
!1240 = !DILocation(line: 830, column: 5, scope: !1223)
!1241 = !DILocation(line: 826, column: 41, scope: !1242)
!1242 = !DILexicalBlockFile(scope: !1217, file: !144, discriminator: 2)
!1243 = !DILocation(line: 826, column: 5, scope: !1242)
!1244 = distinct !{!1244, !1245}
!1245 = !DILocation(line: 826, column: 5, scope: !1207)
!1246 = !DILocation(line: 832, column: 5, scope: !1207)
!1247 = !DILocation(line: 832, column: 11, scope: !1207)
!1248 = !DILocation(line: 832, column: 23, scope: !1207)
!1249 = !DILocation(line: 833, column: 15, scope: !1207)
!1250 = !DILocation(line: 833, column: 21, scope: !1207)
!1251 = !DILocation(line: 833, column: 14, scope: !1207)
!1252 = !DILocation(line: 833, column: 5, scope: !1207)
!1253 = !DILocation(line: 834, column: 1, scope: !1207)
!1254 = distinct !DISubprogram(name: "nal_unit_extract_rbsp", scope: !144, file: !144, line: 646, type: !1255, isLocal: true, isDefinition: true, scopeLine: 648, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !257)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!205, !133, !129, !1257}
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!1258 = !DILocalVariable(name: "src", arg: 1, scope: !1254, file: !144, line: 646, type: !133)
!1259 = !DILocation(line: 646, column: 54, scope: !1254)
!1260 = !DILocalVariable(name: "src_len", arg: 2, scope: !1254, file: !144, line: 646, type: !129)
!1261 = !DILocation(line: 646, column: 68, scope: !1254)
!1262 = !DILocalVariable(name: "dst_len", arg: 3, scope: !1254, file: !144, line: 647, type: !1257)
!1263 = !DILocation(line: 647, column: 49, scope: !1254)
!1264 = !DILocalVariable(name: "dst", scope: !1254, file: !144, line: 649, type: !205)
!1265 = !DILocation(line: 649, column: 14, scope: !1254)
!1266 = !DILocalVariable(name: "i", scope: !1254, file: !144, line: 650, type: !129)
!1267 = !DILocation(line: 650, column: 14, scope: !1254)
!1268 = !DILocalVariable(name: "len", scope: !1254, file: !144, line: 650, type: !129)
!1269 = !DILocation(line: 650, column: 17, scope: !1254)
!1270 = !DILocation(line: 652, column: 21, scope: !1254)
!1271 = !DILocation(line: 652, column: 29, scope: !1254)
!1272 = !DILocation(line: 652, column: 11, scope: !1254)
!1273 = !DILocation(line: 652, column: 9, scope: !1254)
!1274 = !DILocation(line: 653, column: 10, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1254, file: !144, line: 653, column: 9)
!1276 = !DILocation(line: 653, column: 9, scope: !1254)
!1277 = !DILocation(line: 654, column: 9, scope: !1275)
!1278 = !DILocation(line: 657, column: 13, scope: !1254)
!1279 = !DILocation(line: 657, column: 7, scope: !1254)
!1280 = !DILocation(line: 658, column: 5, scope: !1254)
!1281 = !DILocation(line: 658, column: 12, scope: !1282)
!1282 = !DILexicalBlockFile(scope: !1254, file: !144, discriminator: 1)
!1283 = !DILocation(line: 658, column: 14, scope: !1282)
!1284 = !DILocation(line: 658, column: 18, scope: !1282)
!1285 = !DILocation(line: 658, column: 21, scope: !1286)
!1286 = !DILexicalBlockFile(scope: !1254, file: !144, discriminator: 2)
!1287 = !DILocation(line: 658, column: 25, scope: !1286)
!1288 = !DILocation(line: 658, column: 23, scope: !1286)
!1289 = !DILocation(line: 658, column: 5, scope: !1290)
!1290 = !DILexicalBlockFile(scope: !1254, file: !144, discriminator: 3)
!1291 = !DILocation(line: 659, column: 27, scope: !1254)
!1292 = !DILocation(line: 659, column: 22, scope: !1254)
!1293 = !DILocation(line: 659, column: 16, scope: !1254)
!1294 = !DILocation(line: 659, column: 9, scope: !1254)
!1295 = !DILocation(line: 659, column: 20, scope: !1254)
!1296 = !DILocation(line: 658, column: 5, scope: !1297)
!1297 = !DILexicalBlockFile(scope: !1254, file: !144, discriminator: 4)
!1298 = distinct !{!1298, !1280}
!1299 = !DILocation(line: 661, column: 5, scope: !1254)
!1300 = !DILocation(line: 661, column: 12, scope: !1282)
!1301 = !DILocation(line: 661, column: 14, scope: !1282)
!1302 = !DILocation(line: 661, column: 20, scope: !1282)
!1303 = !DILocation(line: 661, column: 18, scope: !1282)
!1304 = !DILocation(line: 661, column: 5, scope: !1282)
!1305 = !DILocation(line: 662, column: 18, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1254, file: !144, line: 662, column: 13)
!1307 = !DILocation(line: 662, column: 14, scope: !1306)
!1308 = !DILocation(line: 662, column: 21, scope: !1306)
!1309 = !DILocation(line: 662, column: 29, scope: !1310)
!1310 = !DILexicalBlockFile(scope: !1306, file: !144, discriminator: 1)
!1311 = !DILocation(line: 662, column: 31, scope: !1310)
!1312 = !DILocation(line: 662, column: 25, scope: !1310)
!1313 = !DILocation(line: 662, column: 36, scope: !1310)
!1314 = !DILocation(line: 662, column: 43, scope: !1315)
!1315 = !DILexicalBlockFile(scope: !1306, file: !144, discriminator: 2)
!1316 = !DILocation(line: 662, column: 45, scope: !1315)
!1317 = !DILocation(line: 662, column: 39, scope: !1315)
!1318 = !DILocation(line: 662, column: 50, scope: !1315)
!1319 = !DILocation(line: 662, column: 13, scope: !1315)
!1320 = !DILocation(line: 663, column: 31, scope: !1321)
!1321 = distinct !DILexicalBlock(scope: !1306, file: !144, line: 662, column: 56)
!1322 = !DILocation(line: 663, column: 26, scope: !1321)
!1323 = !DILocation(line: 663, column: 20, scope: !1321)
!1324 = !DILocation(line: 663, column: 13, scope: !1321)
!1325 = !DILocation(line: 663, column: 24, scope: !1321)
!1326 = !DILocation(line: 664, column: 31, scope: !1321)
!1327 = !DILocation(line: 664, column: 26, scope: !1321)
!1328 = !DILocation(line: 664, column: 20, scope: !1321)
!1329 = !DILocation(line: 664, column: 13, scope: !1321)
!1330 = !DILocation(line: 664, column: 24, scope: !1321)
!1331 = !DILocation(line: 665, column: 14, scope: !1321)
!1332 = !DILocation(line: 666, column: 9, scope: !1321)
!1333 = !DILocation(line: 667, column: 31, scope: !1306)
!1334 = !DILocation(line: 667, column: 26, scope: !1306)
!1335 = !DILocation(line: 667, column: 20, scope: !1306)
!1336 = !DILocation(line: 667, column: 13, scope: !1306)
!1337 = !DILocation(line: 667, column: 24, scope: !1306)
!1338 = !DILocation(line: 661, column: 5, scope: !1286)
!1339 = distinct !{!1339, !1299}
!1340 = !DILocation(line: 669, column: 5, scope: !1254)
!1341 = !DILocation(line: 669, column: 12, scope: !1282)
!1342 = !DILocation(line: 669, column: 16, scope: !1282)
!1343 = !DILocation(line: 669, column: 14, scope: !1282)
!1344 = !DILocation(line: 669, column: 5, scope: !1282)
!1345 = !DILocation(line: 670, column: 27, scope: !1254)
!1346 = !DILocation(line: 670, column: 22, scope: !1254)
!1347 = !DILocation(line: 670, column: 16, scope: !1254)
!1348 = !DILocation(line: 670, column: 9, scope: !1254)
!1349 = !DILocation(line: 670, column: 20, scope: !1254)
!1350 = !DILocation(line: 669, column: 5, scope: !1286)
!1351 = distinct !{!1351, !1340}
!1352 = !DILocation(line: 672, column: 12, scope: !1254)
!1353 = !DILocation(line: 672, column: 18, scope: !1254)
!1354 = !DILocation(line: 672, column: 16, scope: !1254)
!1355 = !DILocation(line: 672, column: 5, scope: !1254)
!1356 = !DILocation(line: 674, column: 16, scope: !1254)
!1357 = !DILocation(line: 674, column: 6, scope: !1254)
!1358 = !DILocation(line: 674, column: 14, scope: !1254)
!1359 = !DILocation(line: 675, column: 12, scope: !1254)
!1360 = !DILocation(line: 675, column: 5, scope: !1254)
!1361 = !DILocation(line: 676, column: 1, scope: !1254)
!1362 = distinct !DISubprogram(name: "init_get_bits8", scope: !747, file: !747, line: 650, type: !1363, isLocal: true, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !257)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{!132, !1365, !133, !132}
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64, align: 64)
!1366 = !DILocalVariable(name: "s", arg: 1, scope: !1362, file: !747, line: 650, type: !1365)
!1367 = !DILocation(line: 650, column: 49, scope: !1362)
!1368 = !DILocalVariable(name: "buffer", arg: 2, scope: !1362, file: !747, line: 650, type: !133)
!1369 = !DILocation(line: 650, column: 67, scope: !1362)
!1370 = !DILocalVariable(name: "byte_size", arg: 3, scope: !1362, file: !747, line: 651, type: !132)
!1371 = !DILocation(line: 651, column: 38, scope: !1362)
!1372 = !DILocation(line: 653, column: 9, scope: !1373)
!1373 = distinct !DILexicalBlock(scope: !1362, file: !747, line: 653, column: 9)
!1374 = !DILocation(line: 653, column: 19, scope: !1373)
!1375 = !DILocation(line: 653, column: 36, scope: !1373)
!1376 = !DILocation(line: 653, column: 39, scope: !1377)
!1377 = !DILexicalBlockFile(scope: !1373, file: !747, discriminator: 1)
!1378 = !DILocation(line: 653, column: 49, scope: !1377)
!1379 = !DILocation(line: 653, column: 9, scope: !1377)
!1380 = !DILocation(line: 654, column: 19, scope: !1373)
!1381 = !DILocation(line: 654, column: 9, scope: !1373)
!1382 = !DILocation(line: 655, column: 26, scope: !1362)
!1383 = !DILocation(line: 655, column: 29, scope: !1362)
!1384 = !DILocation(line: 655, column: 37, scope: !1362)
!1385 = !DILocation(line: 655, column: 47, scope: !1362)
!1386 = !DILocation(line: 655, column: 12, scope: !1362)
!1387 = !DILocation(line: 655, column: 5, scope: !1362)
!1388 = distinct !DISubprogram(name: "nal_unit_parse_header", scope: !144, file: !144, line: 680, type: !1389, isLocal: true, isDefinition: true, scopeLine: 681, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !257)
!1389 = !DISubroutineType(types: !1390)
!1390 = !{null, !1365, !205}
!1391 = !DILocalVariable(name: "gb", arg: 1, scope: !1388, file: !144, line: 680, type: !1365)
!1392 = !DILocation(line: 680, column: 50, scope: !1388)
!1393 = !DILocalVariable(name: "nal_type", arg: 2, scope: !1388, file: !144, line: 680, type: !205)
!1394 = !DILocation(line: 680, column: 63, scope: !1388)
!1395 = !DILocation(line: 682, column: 16, scope: !1388)
!1396 = !DILocation(line: 682, column: 5, scope: !1388)
!1397 = !DILocation(line: 684, column: 26, scope: !1388)
!1398 = !DILocation(line: 684, column: 17, scope: !1388)
!1399 = !DILocation(line: 684, column: 6, scope: !1388)
!1400 = !DILocation(line: 684, column: 15, scope: !1388)
!1401 = !DILocation(line: 690, column: 15, scope: !1388)
!1402 = !DILocation(line: 690, column: 5, scope: !1388)
!1403 = !DILocation(line: 691, column: 1, scope: !1388)
!1404 = distinct !DISubprogram(name: "hvcc_array_add_nal_unit", scope: !144, file: !144, line: 693, type: !1405, isLocal: true, isDefinition: true, scopeLine: 696, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !257)
!1405 = !DISubroutineType(types: !1406)
!1406 = !{!132, !205, !129, !135, !132, !711}
!1407 = !DILocalVariable(name: "nal_buf", arg: 1, scope: !1404, file: !144, line: 693, type: !205)
!1408 = !DILocation(line: 693, column: 45, scope: !1404)
!1409 = !DILocalVariable(name: "nal_size", arg: 2, scope: !1404, file: !144, line: 693, type: !129)
!1410 = !DILocation(line: 693, column: 63, scope: !1404)
!1411 = !DILocalVariable(name: "nal_type", arg: 3, scope: !1404, file: !144, line: 694, type: !135)
!1412 = !DILocation(line: 694, column: 44, scope: !1404)
!1413 = !DILocalVariable(name: "ps_array_completeness", arg: 4, scope: !1404, file: !144, line: 694, type: !132)
!1414 = !DILocation(line: 694, column: 58, scope: !1404)
!1415 = !DILocalVariable(name: "hvcc", arg: 5, scope: !1404, file: !144, line: 695, type: !711)
!1416 = !DILocation(line: 695, column: 68, scope: !1404)
!1417 = !DILocalVariable(name: "ret", scope: !1404, file: !144, line: 697, type: !132)
!1418 = !DILocation(line: 697, column: 9, scope: !1404)
!1419 = !DILocalVariable(name: "index", scope: !1404, file: !144, line: 698, type: !135)
!1420 = !DILocation(line: 698, column: 13, scope: !1404)
!1421 = !DILocalVariable(name: "numNalus", scope: !1404, file: !144, line: 699, type: !510)
!1422 = !DILocation(line: 699, column: 14, scope: !1404)
!1423 = !DILocalVariable(name: "array", scope: !1404, file: !144, line: 700, type: !523)
!1424 = !DILocation(line: 700, column: 23, scope: !1404)
!1425 = !DILocation(line: 702, column: 16, scope: !1426)
!1426 = distinct !DILexicalBlock(scope: !1404, file: !144, line: 702, column: 5)
!1427 = !DILocation(line: 702, column: 10, scope: !1426)
!1428 = !DILocation(line: 702, column: 21, scope: !1429)
!1429 = !DILexicalBlockFile(scope: !1430, file: !144, discriminator: 1)
!1430 = distinct !DILexicalBlock(scope: !1426, file: !144, line: 702, column: 5)
!1431 = !DILocation(line: 702, column: 29, scope: !1429)
!1432 = !DILocation(line: 702, column: 35, scope: !1429)
!1433 = !DILocation(line: 702, column: 27, scope: !1429)
!1434 = !DILocation(line: 702, column: 5, scope: !1429)
!1435 = !DILocation(line: 703, column: 25, scope: !1436)
!1436 = distinct !DILexicalBlock(scope: !1430, file: !144, line: 703, column: 13)
!1437 = !DILocation(line: 703, column: 13, scope: !1436)
!1438 = !DILocation(line: 703, column: 19, scope: !1436)
!1439 = !DILocation(line: 703, column: 32, scope: !1436)
!1440 = !DILocation(line: 703, column: 49, scope: !1436)
!1441 = !DILocation(line: 703, column: 46, scope: !1436)
!1442 = !DILocation(line: 703, column: 13, scope: !1430)
!1443 = !DILocation(line: 704, column: 13, scope: !1436)
!1444 = !DILocation(line: 703, column: 49, scope: !1445)
!1445 = !DILexicalBlockFile(scope: !1436, file: !144, discriminator: 1)
!1446 = !DILocation(line: 702, column: 53, scope: !1447)
!1447 = !DILexicalBlockFile(scope: !1430, file: !144, discriminator: 2)
!1448 = !DILocation(line: 702, column: 5, scope: !1447)
!1449 = distinct !{!1449, !1450}
!1450 = !DILocation(line: 702, column: 5, scope: !1404)
!1451 = !DILocation(line: 706, column: 9, scope: !1452)
!1452 = distinct !DILexicalBlock(scope: !1404, file: !144, line: 706, column: 9)
!1453 = !DILocation(line: 706, column: 18, scope: !1452)
!1454 = !DILocation(line: 706, column: 24, scope: !1452)
!1455 = !DILocation(line: 706, column: 15, scope: !1452)
!1456 = !DILocation(line: 706, column: 9, scope: !1404)
!1457 = !DILocalVariable(name: "i", scope: !1458, file: !144, line: 707, type: !135)
!1458 = distinct !DILexicalBlock(scope: !1452, file: !144, line: 706, column: 37)
!1459 = !DILocation(line: 707, column: 17, scope: !1458)
!1460 = !DILocation(line: 709, column: 34, scope: !1458)
!1461 = !DILocation(line: 709, column: 40, scope: !1458)
!1462 = !DILocation(line: 709, column: 33, scope: !1458)
!1463 = !DILocation(line: 709, column: 47, scope: !1458)
!1464 = !DILocation(line: 709, column: 53, scope: !1458)
!1465 = !DILocation(line: 709, column: 15, scope: !1458)
!1466 = !DILocation(line: 709, column: 13, scope: !1458)
!1467 = !DILocation(line: 710, column: 13, scope: !1468)
!1468 = distinct !DILexicalBlock(scope: !1458, file: !144, line: 710, column: 13)
!1469 = !DILocation(line: 710, column: 17, scope: !1468)
!1470 = !DILocation(line: 710, column: 13, scope: !1458)
!1471 = !DILocation(line: 711, column: 20, scope: !1468)
!1472 = !DILocation(line: 711, column: 13, scope: !1468)
!1473 = !DILocation(line: 713, column: 18, scope: !1474)
!1474 = distinct !DILexicalBlock(scope: !1458, file: !144, line: 713, column: 9)
!1475 = !DILocation(line: 713, column: 24, scope: !1474)
!1476 = !DILocation(line: 713, column: 16, scope: !1474)
!1477 = !DILocation(line: 713, column: 14, scope: !1474)
!1478 = !DILocation(line: 713, column: 37, scope: !1479)
!1479 = !DILexicalBlockFile(scope: !1480, file: !144, discriminator: 1)
!1480 = distinct !DILexicalBlock(scope: !1474, file: !144, line: 713, column: 9)
!1481 = !DILocation(line: 713, column: 42, scope: !1479)
!1482 = !DILocation(line: 713, column: 39, scope: !1479)
!1483 = !DILocation(line: 713, column: 9, scope: !1479)
!1484 = !DILocation(line: 714, column: 33, scope: !1480)
!1485 = !DILocation(line: 714, column: 21, scope: !1480)
!1486 = !DILocation(line: 714, column: 27, scope: !1480)
!1487 = !DILocation(line: 714, column: 13, scope: !1480)
!1488 = !DILocation(line: 713, column: 50, scope: !1489)
!1489 = !DILexicalBlockFile(scope: !1480, file: !144, discriminator: 2)
!1490 = !DILocation(line: 713, column: 9, scope: !1489)
!1491 = distinct !{!1491, !1492}
!1492 = !DILocation(line: 713, column: 9, scope: !1458)
!1493 = !DILocation(line: 715, column: 29, scope: !1458)
!1494 = !DILocation(line: 715, column: 35, scope: !1458)
!1495 = !DILocation(line: 715, column: 9, scope: !1458)
!1496 = !DILocation(line: 715, column: 15, scope: !1458)
!1497 = !DILocation(line: 715, column: 27, scope: !1458)
!1498 = !DILocation(line: 716, column: 5, scope: !1458)
!1499 = !DILocation(line: 718, column: 26, scope: !1404)
!1500 = !DILocation(line: 718, column: 14, scope: !1404)
!1501 = !DILocation(line: 718, column: 20, scope: !1404)
!1502 = !DILocation(line: 718, column: 11, scope: !1404)
!1503 = !DILocation(line: 719, column: 16, scope: !1404)
!1504 = !DILocation(line: 719, column: 23, scope: !1404)
!1505 = !DILocation(line: 719, column: 14, scope: !1404)
!1506 = !DILocation(line: 721, column: 30, scope: !1404)
!1507 = !DILocation(line: 721, column: 37, scope: !1404)
!1508 = !DILocation(line: 721, column: 29, scope: !1404)
!1509 = !DILocation(line: 721, column: 46, scope: !1404)
!1510 = !DILocation(line: 721, column: 55, scope: !1404)
!1511 = !DILocation(line: 721, column: 11, scope: !1404)
!1512 = !DILocation(line: 721, column: 9, scope: !1404)
!1513 = !DILocation(line: 722, column: 9, scope: !1514)
!1514 = distinct !DILexicalBlock(scope: !1404, file: !144, line: 722, column: 9)
!1515 = !DILocation(line: 722, column: 13, scope: !1514)
!1516 = !DILocation(line: 722, column: 9, scope: !1404)
!1517 = !DILocation(line: 723, column: 16, scope: !1514)
!1518 = !DILocation(line: 723, column: 9, scope: !1514)
!1519 = !DILocation(line: 725, column: 30, scope: !1404)
!1520 = !DILocation(line: 725, column: 37, scope: !1404)
!1521 = !DILocation(line: 725, column: 29, scope: !1404)
!1522 = !DILocation(line: 725, column: 52, scope: !1404)
!1523 = !DILocation(line: 725, column: 61, scope: !1404)
!1524 = !DILocation(line: 725, column: 11, scope: !1404)
!1525 = !DILocation(line: 725, column: 9, scope: !1404)
!1526 = !DILocation(line: 726, column: 9, scope: !1527)
!1527 = distinct !DILexicalBlock(scope: !1404, file: !144, line: 726, column: 9)
!1528 = !DILocation(line: 726, column: 13, scope: !1527)
!1529 = !DILocation(line: 726, column: 9, scope: !1404)
!1530 = !DILocation(line: 727, column: 16, scope: !1527)
!1531 = !DILocation(line: 727, column: 9, scope: !1527)
!1532 = !DILocation(line: 729, column: 33, scope: !1404)
!1533 = !DILocation(line: 729, column: 21, scope: !1404)
!1534 = !DILocation(line: 729, column: 5, scope: !1404)
!1535 = !DILocation(line: 729, column: 12, scope: !1404)
!1536 = !DILocation(line: 729, column: 31, scope: !1404)
