; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--av1.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--av1.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVIOContext = type { %struct.AVClass*, i8*, i32, i8*, i8*, i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i64, i32, i32, i32, i64, i8*, i64 (i64, i8*, i32)*, i32, i32 (i8*, i32)*, i64 (i8*, i32, i64, i32)*, i32, i64, i32, i64, i32, i32, i32, i32, i8*, i8*, i32 (i8*, i8*, i32, i32, i64)*, i32, i32, i64, i32 (i8*)*, i64, i8*, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }
%struct.AV1SequenceParameters = type { i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.PutBitContext = type { i32, i32, i8*, i8*, i8*, i32 }
%union.unaligned_32 = type { i32 }

@.str = private unnamed_addr constant [43 x i8] c"Internal error, put_bits buffer too small\0A\00", align 1
@.str.1 = private unnamed_addr constant [30 x i8] c"Assertion %s failed at %s:%d\0A\00", align 1

!70 = !DIEnumerator(name: "AVCOL_TRC_GAMMA22", value: 4)
!71 = !DIEnumerator(name: "AVCOL_TRC_GAMMA28", value: 5)
!72 = !DIEnumerator(name: "AVCOL_TRC_SMPTE170M", value: 6)
!73 = !DIEnumerator(name: "AVCOL_TRC_SMPTE240M", value: 7)
!74 = !DIEnumerator(name: "AVCOL_TRC_LINEAR", value: 8)
!75 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!76 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!77 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!78 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!79 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!80 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!81 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!82 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!83 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!84 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!85 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!86 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!87 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !46, line: 493, size: 32, align: 32, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!90 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!91 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!92 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!93 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!94 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!95 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!96 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!97 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!98 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!99 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!100 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!101 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!102 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!103 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!104 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!105 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!106 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!107 = !{!108, !109, !110, !118, !120, !122, !123}
!108 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!109 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !113, line: 221, size: 32, align: 8, elements: !114)
!113 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !112, file: !113, line: 221, baseType: !116, size: 32, align: 32)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !117, line: 51, baseType: !109)
!117 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !117, line: 48, baseType: !119)
!119 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !117, line: 40, baseType: !121)
!121 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!124 = !{i32 2, !"Dwarf Version", i32 4}
!125 = !{i32 2, !"Debug Info Version", i32 3}
!126 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!127 = distinct !DISubprogram(name: "ff_av1_filter_obus", scope: !128, file: !128, line: 30, type: !129, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !241)
!128 = !DIFile(filename: "libavformat/av1.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!129 = !DISubroutineType(types: !130)
!130 = !{!108, !131, !206, !108}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !25, line: 352, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !25, line: 161, size: 2112, align: 64, elements: !134)
!134 = !{!135, !179, !181, !182, !183, !184, !185, !190, !191, !195, !196, !197, !198, !199, !201, !202, !208, !209, !213, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !231, !232, !233, !234, !238, !239, !240}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !133, file: !25, line: 174, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !140)
!140 = !{!141, !145, !149, !153, !154, !155, !156, !160, !166, !168, !172}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !139, file: !4, line: 72, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !139, file: !4, line: 78, baseType: !146, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!142, !123}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !139, file: !4, line: 85, baseType: !150, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !139, file: !4, line: 93, baseType: !108, size: 32, align: 32, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !139, file: !4, line: 99, baseType: !108, size: 32, align: 32, offset: 224)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !139, file: !4, line: 108, baseType: !108, size: 32, align: 32, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !139, file: !4, line: 113, baseType: !157, size: 64, align: 64, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!123, !123, !123}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !139, file: !4, line: 123, baseType: !161, size: 64, align: 64, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!164, !164}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !139, file: !4, line: 130, baseType: !167, size: 32, align: 32, offset: 448)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !139, file: !4, line: 136, baseType: !169, size: 64, align: 64, offset: 512)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!167, !123}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !139, file: !4, line: 142, baseType: !173, size: 64, align: 64, offset: 576)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!108, !176, !123, !142, !108}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !133, file: !25, line: 226, baseType: !180, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !133, file: !25, line: 227, baseType: !108, size: 32, align: 32, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !133, file: !25, line: 228, baseType: !180, size: 64, align: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !133, file: !25, line: 229, baseType: !180, size: 64, align: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !133, file: !25, line: 233, baseType: !123, size: 64, align: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !133, file: !25, line: 235, baseType: !186, size: 64, align: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!108, !123, !189, !108}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !133, file: !25, line: 236, baseType: !186, size: 64, align: 64, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !133, file: !25, line: 237, baseType: !192, size: 64, align: 64, offset: 512)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!120, !123, !120, !108}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !133, file: !25, line: 238, baseType: !120, size: 64, align: 64, offset: 576)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !133, file: !25, line: 239, baseType: !108, size: 32, align: 32, offset: 640)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !133, file: !25, line: 240, baseType: !108, size: 32, align: 32, offset: 672)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !133, file: !25, line: 241, baseType: !108, size: 32, align: 32, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !133, file: !25, line: 242, baseType: !200, size: 64, align: 64, offset: 768)
!200 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !133, file: !25, line: 243, baseType: !180, size: 64, align: 64, offset: 832)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !133, file: !25, line: 244, baseType: !203, size: 64, align: 64, offset: 896)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!200, !200, !206, !109}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !133, file: !25, line: 245, baseType: !108, size: 32, align: 32, offset: 960)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !133, file: !25, line: 249, baseType: !210, size: 64, align: 64, offset: 1024)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!108, !123, !108}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !133, file: !25, line: 255, baseType: !214, size: 64, align: 64, offset: 1088)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!120, !123, !108, !120, !108}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !133, file: !25, line: 260, baseType: !108, size: 32, align: 32, offset: 1152)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !133, file: !25, line: 266, baseType: !120, size: 64, align: 64, offset: 1216)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !133, file: !25, line: 273, baseType: !108, size: 32, align: 32, offset: 1280)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !133, file: !25, line: 279, baseType: !120, size: 64, align: 64, offset: 1344)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !133, file: !25, line: 285, baseType: !108, size: 32, align: 32, offset: 1408)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !133, file: !25, line: 291, baseType: !108, size: 32, align: 32, offset: 1440)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !133, file: !25, line: 298, baseType: !108, size: 32, align: 32, offset: 1472)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !133, file: !25, line: 304, baseType: !108, size: 32, align: 32, offset: 1504)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !133, file: !25, line: 309, baseType: !142, size: 64, align: 64, offset: 1536)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !133, file: !25, line: 314, baseType: !142, size: 64, align: 64, offset: 1600)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !133, file: !25, line: 319, baseType: !228, size: 64, align: 64, offset: 1664)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!108, !123, !189, !108, !24, !120}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !133, file: !25, line: 326, baseType: !108, size: 32, align: 32, offset: 1728)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !133, file: !25, line: 331, baseType: !24, size: 32, align: 32, offset: 1760)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !133, file: !25, line: 332, baseType: !120, size: 64, align: 64, offset: 1792)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !133, file: !25, line: 338, baseType: !235, size: 64, align: 64, offset: 1856)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!108, !123}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !133, file: !25, line: 340, baseType: !120, size: 64, align: 64, offset: 1920)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !133, file: !25, line: 346, baseType: !180, size: 64, align: 64, offset: 1984)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !133, file: !25, line: 351, baseType: !108, size: 32, align: 32, offset: 2048)
!241 = !{}
!242 = !DILocalVariable(name: "pb", arg: 1, scope: !127, file: !128, line: 30, type: !131)
!243 = !DIExpression()
!244 = !DILocation(line: 30, column: 37, scope: !127)
!245 = !DILocalVariable(name: "buf", arg: 2, scope: !127, file: !128, line: 30, type: !206)
!246 = !DILocation(line: 30, column: 56, scope: !127)
!247 = !DILocalVariable(name: "size", arg: 3, scope: !127, file: !128, line: 30, type: !108)
!248 = !DILocation(line: 30, column: 65, scope: !127)
!249 = !DILocalVariable(name: "end", scope: !127, file: !128, line: 32, type: !206)
!250 = !DILocation(line: 32, column: 20, scope: !127)
!251 = !DILocation(line: 32, column: 26, scope: !127)
!252 = !DILocation(line: 32, column: 32, scope: !127)
!253 = !DILocation(line: 32, column: 30, scope: !127)
!254 = !DILocalVariable(name: "obu_size", scope: !127, file: !128, line: 33, type: !120)
!255 = !DILocation(line: 33, column: 13, scope: !127)
!256 = !DILocalVariable(name: "start_pos", scope: !127, file: !128, line: 34, type: !108)
!257 = !DILocation(line: 34, column: 9, scope: !127)
!258 = !DILocalVariable(name: "type", scope: !127, file: !128, line: 34, type: !108)
!259 = !DILocation(line: 34, column: 20, scope: !127)
!260 = !DILocalVariable(name: "temporal_id", scope: !127, file: !128, line: 34, type: !108)
!261 = !DILocation(line: 34, column: 26, scope: !127)
!262 = !DILocalVariable(name: "spatial_id", scope: !127, file: !128, line: 34, type: !108)
!263 = !DILocation(line: 34, column: 39, scope: !127)
!264 = !DILocation(line: 36, column: 10, scope: !127)
!265 = !DILocation(line: 37, column: 5, scope: !127)
!266 = !DILocation(line: 37, column: 12, scope: !267)
!267 = !DILexicalBlockFile(scope: !127, file: !128, discriminator: 1)
!268 = !DILocation(line: 37, column: 18, scope: !267)
!269 = !DILocation(line: 37, column: 16, scope: !267)
!270 = !DILocation(line: 37, column: 5, scope: !267)
!271 = !DILocalVariable(name: "len", scope: !272, file: !128, line: 38, type: !108)
!272 = distinct !DILexicalBlock(scope: !127, file: !128, line: 37, column: 23)
!273 = !DILocation(line: 38, column: 13, scope: !272)
!274 = !DILocation(line: 38, column: 36, scope: !272)
!275 = !DILocation(line: 38, column: 41, scope: !272)
!276 = !DILocation(line: 38, column: 47, scope: !272)
!277 = !DILocation(line: 38, column: 45, scope: !272)
!278 = !DILocation(line: 38, column: 19, scope: !272)
!279 = !DILocation(line: 40, column: 13, scope: !280)
!280 = distinct !DILexicalBlock(scope: !272, file: !128, line: 40, column: 13)
!281 = !DILocation(line: 40, column: 17, scope: !280)
!282 = !DILocation(line: 40, column: 13, scope: !272)
!283 = !DILocation(line: 41, column: 20, scope: !280)
!284 = !DILocation(line: 41, column: 13, scope: !280)
!285 = !DILocation(line: 43, column: 17, scope: !272)
!286 = !DILocation(line: 43, column: 9, scope: !272)
!287 = !DILocation(line: 48, column: 13, scope: !288)
!288 = distinct !DILexicalBlock(scope: !272, file: !128, line: 43, column: 23)
!289 = !DILocation(line: 50, column: 24, scope: !288)
!290 = !DILocation(line: 50, column: 28, scope: !288)
!291 = !DILocation(line: 50, column: 33, scope: !288)
!292 = !DILocation(line: 50, column: 13, scope: !288)
!293 = !DILocation(line: 51, column: 21, scope: !288)
!294 = !DILocation(line: 51, column: 18, scope: !288)
!295 = !DILocation(line: 52, column: 13, scope: !288)
!296 = !DILocation(line: 54, column: 16, scope: !272)
!297 = !DILocation(line: 54, column: 13, scope: !272)
!298 = !DILocation(line: 37, column: 5, scope: !299)
!299 = !DILexicalBlockFile(scope: !127, file: !128, discriminator: 2)
!300 = distinct !{!300, !265}
!301 = !DILocation(line: 57, column: 12, scope: !127)
!302 = !DILocation(line: 57, column: 5, scope: !127)
!303 = !DILocation(line: 58, column: 1, scope: !127)
!304 = distinct !DISubprogram(name: "parse_obu_header", scope: !305, file: !305, line: 99, type: !306, isLocal: true, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !241)
!305 = !DIFile(filename: "./libavcodec/av1_parse.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!306 = !DISubroutineType(types: !307)
!307 = !{!108, !206, !108, !308, !309, !309, !309, !309}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!310 = !DILocalVariable(name: "buf", arg: 1, scope: !304, file: !305, line: 99, type: !206)
!311 = !DILocation(line: 99, column: 51, scope: !304)
!312 = !DILocalVariable(name: "buf_size", arg: 2, scope: !304, file: !305, line: 99, type: !108)
!313 = !DILocation(line: 99, column: 60, scope: !304)
!314 = !DILocalVariable(name: "obu_size", arg: 3, scope: !304, file: !305, line: 100, type: !308)
!315 = !DILocation(line: 100, column: 45, scope: !304)
!316 = !DILocalVariable(name: "start_pos", arg: 4, scope: !304, file: !305, line: 100, type: !309)
!317 = !DILocation(line: 100, column: 60, scope: !304)
!318 = !DILocalVariable(name: "type", arg: 5, scope: !304, file: !305, line: 100, type: !309)
!319 = !DILocation(line: 100, column: 76, scope: !304)
!320 = !DILocalVariable(name: "temporal_id", arg: 6, scope: !304, file: !305, line: 101, type: !309)
!321 = !DILocation(line: 101, column: 41, scope: !304)
!322 = !DILocalVariable(name: "spatial_id", arg: 7, scope: !304, file: !305, line: 101, type: !309)
!323 = !DILocation(line: 101, column: 59, scope: !304)
!324 = !DILocalVariable(name: "gb", scope: !304, file: !305, line: 103, type: !325)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !326, line: 70, baseType: !327)
!326 = !DIFile(filename: "./libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !326, line: 61, size: 256, align: 64, elements: !328)
!328 = !{!329, !330, !331, !332, !333}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !327, file: !326, line: 62, baseType: !206, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !327, file: !326, line: 62, baseType: !206, size: 64, align: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !327, file: !326, line: 67, baseType: !108, size: 32, align: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !327, file: !326, line: 68, baseType: !108, size: 32, align: 32, offset: 160)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !327, file: !326, line: 69, baseType: !108, size: 32, align: 32, offset: 192)
!334 = !DILocation(line: 103, column: 19, scope: !304)
!335 = !DILocalVariable(name: "ret", scope: !304, file: !305, line: 104, type: !108)
!336 = !DILocation(line: 104, column: 9, scope: !304)
!337 = !DILocalVariable(name: "extension_flag", scope: !304, file: !305, line: 104, type: !108)
!338 = !DILocation(line: 104, column: 14, scope: !304)
!339 = !DILocalVariable(name: "has_size_flag", scope: !304, file: !305, line: 104, type: !108)
!340 = !DILocation(line: 104, column: 30, scope: !304)
!341 = !DILocalVariable(name: "size", scope: !304, file: !305, line: 105, type: !120)
!342 = !DILocation(line: 105, column: 13, scope: !304)
!343 = !DILocation(line: 107, column: 31, scope: !304)
!344 = !DILocation(line: 107, column: 38, scope: !304)
!345 = !DILocation(line: 107, column: 48, scope: !304)
!346 = !DILocation(line: 107, column: 37, scope: !304)
!347 = !DILocation(line: 107, column: 37, scope: !348)
!348 = !DILexicalBlockFile(scope: !304, file: !305, discriminator: 1)
!349 = !DILocation(line: 107, column: 71, scope: !350)
!350 = !DILexicalBlockFile(scope: !304, file: !305, discriminator: 2)
!351 = !DILocation(line: 107, column: 37, scope: !350)
!352 = !DILocation(line: 107, column: 37, scope: !353)
!353 = !DILexicalBlockFile(scope: !304, file: !305, discriminator: 3)
!354 = !DILocation(line: 107, column: 11, scope: !353)
!355 = !DILocation(line: 107, column: 9, scope: !353)
!356 = !DILocation(line: 108, column: 9, scope: !357)
!357 = distinct !DILexicalBlock(scope: !304, file: !305, line: 108, column: 9)
!358 = !DILocation(line: 108, column: 13, scope: !357)
!359 = !DILocation(line: 108, column: 9, scope: !304)
!360 = !DILocation(line: 109, column: 16, scope: !357)
!361 = !DILocation(line: 109, column: 9, scope: !357)
!362 = !DILocation(line: 111, column: 9, scope: !363)
!363 = distinct !DILexicalBlock(scope: !304, file: !305, line: 111, column: 9)
!364 = !DILocation(line: 111, column: 24, scope: !363)
!365 = !DILocation(line: 111, column: 9, scope: !304)
!366 = !DILocation(line: 112, column: 9, scope: !363)
!367 = !DILocation(line: 114, column: 13, scope: !304)
!368 = !DILocation(line: 114, column: 6, scope: !304)
!369 = !DILocation(line: 114, column: 11, scope: !304)
!370 = !DILocation(line: 115, column: 22, scope: !304)
!371 = !DILocation(line: 115, column: 20, scope: !304)
!372 = !DILocation(line: 116, column: 21, scope: !304)
!373 = !DILocation(line: 116, column: 19, scope: !304)
!374 = !DILocation(line: 117, column: 5, scope: !304)
!375 = !DILocation(line: 119, column: 9, scope: !376)
!376 = distinct !DILexicalBlock(scope: !304, file: !305, line: 119, column: 9)
!377 = !DILocation(line: 119, column: 9, scope: !304)
!378 = !DILocation(line: 120, column: 24, scope: !379)
!379 = distinct !DILexicalBlock(scope: !376, file: !305, line: 119, column: 25)
!380 = !DILocation(line: 120, column: 10, scope: !379)
!381 = !DILocation(line: 120, column: 22, scope: !379)
!382 = !DILocation(line: 121, column: 23, scope: !379)
!383 = !DILocation(line: 121, column: 10, scope: !379)
!384 = !DILocation(line: 121, column: 21, scope: !379)
!385 = !DILocation(line: 122, column: 9, scope: !379)
!386 = !DILocation(line: 123, column: 5, scope: !379)
!387 = !DILocation(line: 124, column: 25, scope: !388)
!388 = distinct !DILexicalBlock(scope: !376, file: !305, line: 123, column: 12)
!389 = !DILocation(line: 124, column: 36, scope: !388)
!390 = !DILocation(line: 124, column: 10, scope: !388)
!391 = !DILocation(line: 124, column: 22, scope: !388)
!392 = !DILocation(line: 127, column: 17, scope: !304)
!393 = !DILocation(line: 127, column: 33, scope: !348)
!394 = !DILocation(line: 127, column: 17, scope: !348)
!395 = !DILocation(line: 128, column: 34, scope: !304)
!396 = !DILocation(line: 128, column: 43, scope: !304)
!397 = !DILocation(line: 128, column: 49, scope: !304)
!398 = !DILocation(line: 128, column: 47, scope: !304)
!399 = !DILocation(line: 127, column: 17, scope: !350)
!400 = !DILocation(line: 127, column: 17, scope: !353)
!401 = !DILocation(line: 127, column: 6, scope: !353)
!402 = !DILocation(line: 127, column: 15, scope: !353)
!403 = !DILocation(line: 130, column: 9, scope: !404)
!404 = distinct !DILexicalBlock(scope: !304, file: !305, line: 130, column: 9)
!405 = !DILocation(line: 130, column: 28, scope: !404)
!406 = !DILocation(line: 130, column: 9, scope: !304)
!407 = !DILocation(line: 131, column: 9, scope: !404)
!408 = !DILocation(line: 133, column: 18, scope: !304)
!409 = !DILocation(line: 133, column: 38, scope: !304)
!410 = !DILocation(line: 133, column: 6, scope: !304)
!411 = !DILocation(line: 133, column: 16, scope: !304)
!412 = !DILocation(line: 135, column: 13, scope: !304)
!413 = !DILocation(line: 135, column: 12, scope: !304)
!414 = !DILocation(line: 135, column: 25, scope: !304)
!415 = !DILocation(line: 135, column: 24, scope: !304)
!416 = !DILocation(line: 135, column: 22, scope: !304)
!417 = !DILocation(line: 135, column: 10, scope: !304)
!418 = !DILocation(line: 137, column: 9, scope: !419)
!419 = distinct !DILexicalBlock(scope: !304, file: !305, line: 137, column: 9)
!420 = !DILocation(line: 137, column: 16, scope: !419)
!421 = !DILocation(line: 137, column: 14, scope: !419)
!422 = !DILocation(line: 137, column: 9, scope: !304)
!423 = !DILocation(line: 138, column: 9, scope: !419)
!424 = !DILocation(line: 140, column: 12, scope: !304)
!425 = !DILocation(line: 140, column: 5, scope: !304)
!426 = !DILocation(line: 141, column: 1, scope: !304)
!427 = distinct !DISubprogram(name: "ff_av1_filter_obus_buf", scope: !128, file: !128, line: 60, type: !428, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !241)
!428 = !DISubroutineType(types: !429)
!429 = !{!108, !206, !430, !309}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!431 = !DILocalVariable(name: "buf", arg: 1, scope: !427, file: !128, line: 60, type: !206)
!432 = !DILocation(line: 60, column: 43, scope: !427)
!433 = !DILocalVariable(name: "out", arg: 2, scope: !427, file: !128, line: 60, type: !430)
!434 = !DILocation(line: 60, column: 58, scope: !427)
!435 = !DILocalVariable(name: "size", arg: 3, scope: !427, file: !128, line: 60, type: !309)
!436 = !DILocation(line: 60, column: 68, scope: !427)
!437 = !DILocalVariable(name: "pb", scope: !427, file: !128, line: 62, type: !131)
!438 = !DILocation(line: 62, column: 18, scope: !427)
!439 = !DILocalVariable(name: "ret", scope: !427, file: !128, line: 63, type: !108)
!440 = !DILocation(line: 63, column: 9, scope: !427)
!441 = !DILocation(line: 65, column: 11, scope: !427)
!442 = !DILocation(line: 65, column: 9, scope: !427)
!443 = !DILocation(line: 66, column: 9, scope: !444)
!444 = distinct !DILexicalBlock(scope: !427, file: !128, line: 66, column: 9)
!445 = !DILocation(line: 66, column: 13, scope: !444)
!446 = !DILocation(line: 66, column: 9, scope: !427)
!447 = !DILocation(line: 67, column: 16, scope: !444)
!448 = !DILocation(line: 67, column: 9, scope: !444)
!449 = !DILocation(line: 69, column: 30, scope: !427)
!450 = !DILocation(line: 69, column: 34, scope: !427)
!451 = !DILocation(line: 69, column: 40, scope: !427)
!452 = !DILocation(line: 69, column: 39, scope: !427)
!453 = !DILocation(line: 69, column: 11, scope: !427)
!454 = !DILocation(line: 69, column: 9, scope: !427)
!455 = !DILocation(line: 70, column: 9, scope: !456)
!456 = distinct !DILexicalBlock(scope: !427, file: !128, line: 70, column: 9)
!457 = !DILocation(line: 70, column: 13, scope: !456)
!458 = !DILocation(line: 70, column: 9, scope: !427)
!459 = !DILocation(line: 71, column: 16, scope: !456)
!460 = !DILocation(line: 71, column: 9, scope: !456)
!461 = !DILocation(line: 73, column: 14, scope: !427)
!462 = !DILocation(line: 73, column: 5, scope: !427)
!463 = !DILocation(line: 74, column: 32, scope: !427)
!464 = !DILocation(line: 74, column: 36, scope: !427)
!465 = !DILocation(line: 74, column: 13, scope: !427)
!466 = !DILocation(line: 74, column: 6, scope: !427)
!467 = !DILocation(line: 74, column: 11, scope: !427)
!468 = !DILocation(line: 76, column: 12, scope: !427)
!469 = !DILocation(line: 76, column: 5, scope: !427)
!470 = !DILocation(line: 77, column: 1, scope: !427)
!471 = distinct !DISubprogram(name: "ff_isom_write_av1c", scope: !128, file: !128, line: 300, type: !129, isLocal: false, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !241)
!472 = !DILocalVariable(name: "pb", arg: 1, scope: !471, file: !128, line: 300, type: !131)
!473 = !DILocation(line: 300, column: 37, scope: !471)
!474 = !DILocalVariable(name: "buf", arg: 2, scope: !471, file: !128, line: 300, type: !206)
!475 = !DILocation(line: 300, column: 56, scope: !471)
!476 = !DILocalVariable(name: "size", arg: 3, scope: !471, file: !128, line: 300, type: !108)
!477 = !DILocation(line: 300, column: 65, scope: !471)
!478 = !DILocalVariable(name: "seq_pb", scope: !471, file: !128, line: 302, type: !131)
!479 = !DILocation(line: 302, column: 18, scope: !471)
!480 = !DILocalVariable(name: "meta_pb", scope: !471, file: !128, line: 302, type: !131)
!481 = !DILocation(line: 302, column: 33, scope: !471)
!482 = !DILocalVariable(name: "seq_params", scope: !471, file: !128, line: 303, type: !483)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1SequenceParameters", file: !128, line: 89, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1SequenceParameters", file: !128, line: 79, size: 72, align: 8, elements: !485)
!485 = !{!486, !487, !488, !489, !490, !491, !492, !493, !494}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "seq_profile", scope: !484, file: !128, line: 80, baseType: !118, size: 8, align: 8)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "seq_level_idx_0", scope: !484, file: !128, line: 81, baseType: !118, size: 8, align: 8, offset: 8)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "seq_tier_0", scope: !484, file: !128, line: 82, baseType: !118, size: 8, align: 8, offset: 16)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "high_bitdepth", scope: !484, file: !128, line: 83, baseType: !118, size: 8, align: 8, offset: 24)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "twelve_bit", scope: !484, file: !128, line: 84, baseType: !118, size: 8, align: 8, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !484, file: !128, line: 85, baseType: !118, size: 8, align: 8, offset: 40)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_subsampling_x", scope: !484, file: !128, line: 86, baseType: !118, size: 8, align: 8, offset: 48)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_subsampling_y", scope: !484, file: !128, line: 87, baseType: !118, size: 8, align: 8, offset: 56)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_position", scope: !484, file: !128, line: 88, baseType: !118, size: 8, align: 8, offset: 64)
!495 = !DILocation(line: 303, column: 27, scope: !471)
!496 = !DILocalVariable(name: "pbc", scope: !471, file: !128, line: 304, type: !497)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "PutBitContext", file: !498, line: 40, baseType: !499)
!498 = !DIFile(filename: "./libavcodec/put_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PutBitContext", file: !498, line: 35, size: 320, align: 64, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bit_buf", scope: !499, file: !498, line: 36, baseType: !116, size: 32, align: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "bit_left", scope: !499, file: !498, line: 37, baseType: !108, size: 32, align: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !499, file: !498, line: 38, baseType: !189, size: 64, align: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !499, file: !498, line: 38, baseType: !189, size: 64, align: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !499, file: !498, line: 38, baseType: !189, size: 64, align: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !499, file: !498, line: 39, baseType: !108, size: 32, align: 32, offset: 256)
!507 = !DILocation(line: 304, column: 19, scope: !471)
!508 = !DILocalVariable(name: "header", scope: !471, file: !128, line: 305, type: !509)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 32, align: 8, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 4)
!512 = !DILocation(line: 305, column: 13, scope: !471)
!513 = !DILocalVariable(name: "seq", scope: !471, file: !128, line: 306, type: !189)
!514 = !DILocation(line: 306, column: 14, scope: !471)
!515 = !DILocalVariable(name: "meta", scope: !471, file: !128, line: 306, type: !189)
!516 = !DILocation(line: 306, column: 26, scope: !471)
!517 = !DILocalVariable(name: "obu_size", scope: !471, file: !128, line: 307, type: !120)
!518 = !DILocation(line: 307, column: 13, scope: !471)
!519 = !DILocalVariable(name: "start_pos", scope: !471, file: !128, line: 308, type: !108)
!520 = !DILocation(line: 308, column: 9, scope: !471)
!521 = !DILocalVariable(name: "type", scope: !471, file: !128, line: 308, type: !108)
!522 = !DILocation(line: 308, column: 20, scope: !471)
!523 = !DILocalVariable(name: "temporal_id", scope: !471, file: !128, line: 308, type: !108)
!524 = !DILocation(line: 308, column: 26, scope: !471)
!525 = !DILocalVariable(name: "spatial_id", scope: !471, file: !128, line: 308, type: !108)
!526 = !DILocation(line: 308, column: 39, scope: !471)
!527 = !DILocalVariable(name: "ret", scope: !471, file: !128, line: 309, type: !108)
!528 = !DILocation(line: 309, column: 9, scope: !471)
!529 = !DILocalVariable(name: "nb_seq", scope: !471, file: !128, line: 309, type: !108)
!530 = !DILocation(line: 309, column: 14, scope: !471)
!531 = !DILocalVariable(name: "seq_size", scope: !471, file: !128, line: 309, type: !108)
!532 = !DILocation(line: 309, column: 26, scope: !471)
!533 = !DILocalVariable(name: "meta_size", scope: !471, file: !128, line: 309, type: !108)
!534 = !DILocation(line: 309, column: 36, scope: !471)
!535 = !DILocation(line: 311, column: 9, scope: !536)
!536 = distinct !DILexicalBlock(scope: !471, file: !128, line: 311, column: 9)
!537 = !DILocation(line: 311, column: 14, scope: !536)
!538 = !DILocation(line: 311, column: 9, scope: !471)
!539 = !DILocation(line: 312, column: 9, scope: !536)
!540 = !DILocation(line: 314, column: 11, scope: !471)
!541 = !DILocation(line: 314, column: 9, scope: !471)
!542 = !DILocation(line: 315, column: 9, scope: !543)
!543 = distinct !DILexicalBlock(scope: !471, file: !128, line: 315, column: 9)
!544 = !DILocation(line: 315, column: 13, scope: !543)
!545 = !DILocation(line: 315, column: 9, scope: !471)
!546 = !DILocation(line: 316, column: 16, scope: !543)
!547 = !DILocation(line: 316, column: 9, scope: !543)
!548 = !DILocation(line: 317, column: 11, scope: !471)
!549 = !DILocation(line: 317, column: 9, scope: !471)
!550 = !DILocation(line: 318, column: 9, scope: !551)
!551 = distinct !DILexicalBlock(scope: !471, file: !128, line: 318, column: 9)
!552 = !DILocation(line: 318, column: 13, scope: !551)
!553 = !DILocation(line: 318, column: 9, scope: !471)
!554 = !DILocation(line: 319, column: 9, scope: !551)
!555 = !DILocation(line: 321, column: 5, scope: !471)
!556 = !DILocation(line: 321, column: 12, scope: !557)
!557 = !DILexicalBlockFile(scope: !471, file: !128, discriminator: 1)
!558 = !DILocation(line: 321, column: 17, scope: !557)
!559 = !DILocation(line: 321, column: 5, scope: !557)
!560 = !DILocalVariable(name: "len", scope: !561, file: !128, line: 322, type: !108)
!561 = distinct !DILexicalBlock(scope: !471, file: !128, line: 321, column: 22)
!562 = !DILocation(line: 322, column: 13, scope: !561)
!563 = !DILocation(line: 322, column: 36, scope: !561)
!564 = !DILocation(line: 322, column: 41, scope: !561)
!565 = !DILocation(line: 322, column: 19, scope: !561)
!566 = !DILocation(line: 324, column: 13, scope: !567)
