; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--aviobuf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--aviobuf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, {}*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVIOContext = type { %struct.AVClass*, i8*, i32, i8*, i8*, i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i64, i32, i32, i32, i64, i8*, i64 (i64, i8*, i32)*, i32, i32 (i8*, i32)*, i64 (i8*, i32, i64, i32)*, i32, i64, i32, i64, i32, i32, i32, i32, i8*, i8*, i32 (i8*, i8*, i32, i32, i64)*, i32, i32, i64, i32 (i8*)*, i64, i8*, i32 }
%struct.AVIOInternal = type { %struct.URLContext* }
%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }

!911 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!912 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!913 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!914 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!915 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!916 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!917 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!918 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!919 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!920 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!921 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !68, line: 798, size: 32, align: 32, elements: !922)
!922 = !{!923, !924, !925, !926, !927, !928, !929}
!923 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!924 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!925 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!926 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!927 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!928 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!929 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!930 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !931, line: 782, size: 32, align: 32, elements: !932)
!931 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!932 = !{!933, !934, !935, !936, !937, !938}
!933 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!934 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!935 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!936 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!937 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!938 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!939 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !68, line: 5085, size: 32, align: 32, elements: !940)
!940 = !{!941, !942, !943, !944}
!941 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!942 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!943 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!944 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!945 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !931, line: 1315, size: 32, align: 32, elements: !946)
!946 = !{!947, !948, !949}
!947 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!948 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!949 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!950 = !{!951, !954, !955, !956, !958, !960, !961, !963, !964, !965}
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !952, line: 40, baseType: !953)
!952 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!953 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!954 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!955 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !952, line: 48, baseType: !957)
!957 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !952, line: 51, baseType: !955)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !952, line: 55, baseType: !962)
!962 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !967, line: 221, size: 32, align: 8, elements: !968)
!967 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!968 = !{!969}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !966, file: !967, line: 221, baseType: !960, size: 32, align: 32)
!970 = !{!971, !1053, !1128}
!971 = distinct !DIGlobalVariable(name: "ff_avio_class", scope: !0, file: !972, line: 69, type: !973, isLocal: false, isDefinition: true, variable: { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }* @ff_avio_class)
!972 = !DIFile(filename: "libavformat/aviobuf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !976)
!976 = !{!977, !981, !985, !1012, !1013, !1014, !1015, !1019, !1025, !1027, !1031}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !975, file: !26, line: 72, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !975, file: !26, line: 78, baseType: !982, size: 64, align: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!978, !963}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !975, file: !26, line: 85, baseType: !986, size: 64, align: 64, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !989)
!989 = !{!990, !991, !992, !993, !994, !1008, !1009, !1010, !1011}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !988, file: !4, line: 247, baseType: !978, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !988, file: !4, line: 253, baseType: !978, size: 64, align: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !988, file: !4, line: 259, baseType: !954, size: 32, align: 32, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !988, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !988, file: !4, line: 271, baseType: !995, size: 64, align: 64, offset: 192)
!995 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !988, file: !4, line: 265, size: 64, align: 64, elements: !996)
!996 = !{!997, !998, !1000, !1001}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !995, file: !4, line: 266, baseType: !951, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !995, file: !4, line: 267, baseType: !999, size: 64, align: 64)
!999 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !995, file: !4, line: 268, baseType: !978, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !995, file: !4, line: 270, baseType: !1002, size: 64, align: 32)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1003, line: 61, baseType: !1004)
!1003 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1003, line: 58, size: 64, align: 32, elements: !1005)
!1005 = !{!1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1004, file: !1003, line: 59, baseType: !954, size: 32, align: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1004, file: !1003, line: 60, baseType: !954, size: 32, align: 32, offset: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !988, file: !4, line: 272, baseType: !999, size: 64, align: 64, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !988, file: !4, line: 273, baseType: !999, size: 64, align: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !988, file: !4, line: 275, baseType: !954, size: 32, align: 32, offset: 384)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !988, file: !4, line: 300, baseType: !978, size: 64, align: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !975, file: !26, line: 93, baseType: !954, size: 32, align: 32, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !975, file: !26, line: 99, baseType: !954, size: 32, align: 32, offset: 224)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !975, file: !26, line: 108, baseType: !954, size: 32, align: 32, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !975, file: !26, line: 113, baseType: !1016, size: 64, align: 64, offset: 320)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!963, !963, !963}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !975, file: !26, line: 123, baseType: !1020, size: 64, align: 64, offset: 384)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!1023, !1023}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !975, file: !26, line: 130, baseType: !1026, size: 32, align: 32, offset: 448)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !975, file: !26, line: 136, baseType: !1028, size: 64, align: 64, offset: 512)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!1026, !963}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !975, file: !26, line: 142, baseType: !1032, size: 64, align: 64, offset: 576)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!954, !1035, !963, !978, !954}
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1038)
!1038 = !{!1039, !1051, !1052}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1037, file: !4, line: 360, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1048, !1049, !1050}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1043, file: !4, line: 307, baseType: !978, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1043, file: !4, line: 313, baseType: !999, size: 64, align: 64, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1043, file: !4, line: 313, baseType: !999, size: 64, align: 64, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1043, file: !4, line: 318, baseType: !999, size: 64, align: 64, offset: 192)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1043, file: !4, line: 318, baseType: !999, size: 64, align: 64, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1043, file: !4, line: 323, baseType: !954, size: 32, align: 32, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1037, file: !4, line: 364, baseType: !954, size: 32, align: 32, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1037, file: !4, line: 368, baseType: !954, size: 32, align: 32, offset: 96)
!1053 = distinct !DIGlobalVariable(name: "padbuf", scope: !1054, file: !972, line: 1424, type: !1125, isLocal: true, isDefinition: true, variable: [64 x i8]* @avio_close_dyn_buf.padbuf)
!1054 = distinct !DISubprogram(name: "avio_close_dyn_buf", scope: !972, file: !972, line: 1420, type: !1055, isLocal: false, isDefinition: true, scopeLine: 1421, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1124)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!954, !1057, !1123}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !47, line: 352, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !47, line: 161, size: 2112, align: 64, elements: !1060)
!1060 = !{!1061, !1063, !1065, !1066, !1067, !1068, !1069, !1073, !1074, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1090, !1091, !1095, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1113, !1114, !1115, !1116, !1120, !1121, !1122}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1059, file: !47, line: 174, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1059, file: !47, line: 226, baseType: !1064, size: 64, align: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1059, file: !47, line: 227, baseType: !954, size: 32, align: 32, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1059, file: !47, line: 228, baseType: !1064, size: 64, align: 64, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1059, file: !47, line: 229, baseType: !1064, size: 64, align: 64, offset: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1059, file: !47, line: 233, baseType: !963, size: 64, align: 64, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1059, file: !47, line: 235, baseType: !1070, size: 64, align: 64, offset: 384)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!954, !963, !964, !954}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1059, file: !47, line: 236, baseType: !1070, size: 64, align: 64, offset: 448)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1059, file: !47, line: 237, baseType: !1075, size: 64, align: 64, offset: 512)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!951, !963, !951, !954}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1059, file: !47, line: 238, baseType: !951, size: 64, align: 64, offset: 576)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1059, file: !47, line: 239, baseType: !954, size: 32, align: 32, offset: 640)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1059, file: !47, line: 240, baseType: !954, size: 32, align: 32, offset: 672)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1059, file: !47, line: 241, baseType: !954, size: 32, align: 32, offset: 704)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1059, file: !47, line: 242, baseType: !962, size: 64, align: 64, offset: 768)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1059, file: !47, line: 243, baseType: !1064, size: 64, align: 64, offset: 832)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1059, file: !47, line: 244, baseType: !1085, size: 64, align: 64, offset: 896)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!962, !962, !1088, !955}
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1059, file: !47, line: 245, baseType: !954, size: 32, align: 32, offset: 960)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1059, file: !47, line: 249, baseType: !1092, size: 64, align: 64, offset: 1024)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!954, !963, !954}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1059, file: !47, line: 255, baseType: !1096, size: 64, align: 64, offset: 1088)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!951, !963, !954, !951, !954}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1059, file: !47, line: 260, baseType: !954, size: 32, align: 32, offset: 1152)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1059, file: !47, line: 266, baseType: !951, size: 64, align: 64, offset: 1216)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1059, file: !47, line: 273, baseType: !954, size: 32, align: 32, offset: 1280)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1059, file: !47, line: 279, baseType: !951, size: 64, align: 64, offset: 1344)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1059, file: !47, line: 285, baseType: !954, size: 32, align: 32, offset: 1408)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1059, file: !47, line: 291, baseType: !954, size: 32, align: 32, offset: 1440)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1059, file: !47, line: 298, baseType: !954, size: 32, align: 32, offset: 1472)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1059, file: !47, line: 304, baseType: !954, size: 32, align: 32, offset: 1504)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1059, file: !47, line: 309, baseType: !978, size: 64, align: 64, offset: 1536)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1059, file: !47, line: 314, baseType: !978, size: 64, align: 64, offset: 1600)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1059, file: !47, line: 319, baseType: !1110, size: 64, align: 64, offset: 1664)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!954, !963, !964, !954, !46, !951}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1059, file: !47, line: 326, baseType: !954, size: 32, align: 32, offset: 1728)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1059, file: !47, line: 331, baseType: !46, size: 32, align: 32, offset: 1760)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1059, file: !47, line: 332, baseType: !951, size: 64, align: 64, offset: 1792)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1059, file: !47, line: 338, baseType: !1117, size: 64, align: 64, offset: 1856)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!954, !963}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1059, file: !47, line: 340, baseType: !951, size: 64, align: 64, offset: 1920)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1059, file: !47, line: 346, baseType: !1064, size: 64, align: 64, offset: 1984)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1059, file: !47, line: 351, baseType: !954, size: 32, align: 32, offset: 2048)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!1124 = !{}
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 512, align: 8, elements: !1126)
!1126 = !{!1127}
!1127 = !DISubrange(count: 64)
!1128 = distinct !DIGlobalVariable(name: "ff_avio_options", scope: !0, file: !972, line: 64, type: !1129, isLocal: true, isDefinition: true, variable: <{ { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption }>* @ff_avio_options)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1130, size: 1024, align: 64, elements: !1132)
!1130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !988)
!1132 = !{!1133}
!1133 = !DISubrange(count: 2)
!1134 = !{i32 2, !"Dwarf Version", i32 4}
!1135 = !{i32 2, !"Debug Info Version", i32 3}
!1136 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1137 = distinct !DISubprogram(name: "ff_avio_child_next", scope: !972, file: !972, line: 49, type: !1017, isLocal: true, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1124)
!1138 = !DILocalVariable(name: "obj", arg: 1, scope: !1137, file: !972, line: 49, type: !963)
!1139 = !DIExpression()
!1140 = !DILocation(line: 49, column: 39, scope: !1137)
!1141 = !DILocalVariable(name: "prev", arg: 2, scope: !1137, file: !972, line: 49, type: !963)
!1142 = !DILocation(line: 49, column: 50, scope: !1137)
!1143 = !DILocalVariable(name: "s", scope: !1137, file: !972, line: 51, type: !1057)
!1144 = !DILocation(line: 51, column: 18, scope: !1137)
!1145 = !DILocation(line: 51, column: 22, scope: !1137)
!1146 = !DILocalVariable(name: "internal", scope: !1137, file: !972, line: 52, type: !1147)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInternal", file: !972, line: 47, baseType: !1149)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInternal", file: !972, line: 45, size: 64, align: 64, elements: !1150)
!1150 = !{!1151}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1149, file: !972, line: 46, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !1154, line: 52, baseType: !1155)
!1154 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !1154, line: 38, size: 768, align: 64, elements: !1156)
!1156 = !{!1157, !1158, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1260, !1261, !1262, !1263}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1155, file: !1154, line: 39, baseType: !1062, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !1155, file: !1154, line: 40, baseType: !1159, size: 64, align: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !1154, line: 54, size: 1600, align: 64, elements: !1162)
!1162 = !{!1163, !1164, !1168, !1177, !1182, !1186, !1190, !1194, !1198, !1199, !1203, !1207, !1208, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1241, !1242, !1243, !1247}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1161, file: !1154, line: 55, baseType: !978, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !1161, file: !1154, line: 56, baseType: !1165, size: 64, align: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!954, !1152, !978, !954}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !1161, file: !1154, line: 62, baseType: !1169, size: 64, align: 64, offset: 128)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!954, !1152, !978, !954, !1172}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1175, line: 86, baseType: !1176)
!1175 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1176 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1175, line: 86, flags: DIFlagFwdDecl)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !1161, file: !1154, line: 63, baseType: !1178, size: 64, align: 64, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!954, !1152, !1181}
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !1161, file: !1154, line: 64, baseType: !1183, size: 64, align: 64, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!954, !1152}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !1161, file: !1154, line: 78, baseType: !1187, size: 64, align: 64, offset: 320)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!954, !1152, !1064, !954}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !1161, file: !1154, line: 79, baseType: !1191, size: 64, align: 64, offset: 384)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!954, !1152, !958, !954}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !1161, file: !1154, line: 80, baseType: !1195, size: 64, align: 64, offset: 448)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!951, !1152, !951, !954}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !1161, file: !1154, line: 81, baseType: !1183, size: 64, align: 64, offset: 512)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !1161, file: !1154, line: 82, baseType: !1200, size: 64, align: 64, offset: 576)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!954, !1152, !954}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !1161, file: !1154, line: 83, baseType: !1204, size: 64, align: 64, offset: 640)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!951, !1152, !954, !951, !954}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !1161, file: !1154, line: 85, baseType: !1183, size: 64, align: 64, offset: 704)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !1161, file: !1154, line: 86, baseType: !1209, size: 64, align: 64, offset: 768)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!954, !1152, !1212, !1213}
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !1161, file: !1154, line: 88, baseType: !1183, size: 64, align: 64, offset: 832)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !1161, file: !1154, line: 89, baseType: !1200, size: 64, align: 64, offset: 896)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1161, file: !1154, line: 90, baseType: !954, size: 32, align: 32, offset: 960)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !1161, file: !1154, line: 91, baseType: !1062, size: 64, align: 64, offset: 1024)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1161, file: !1154, line: 92, baseType: !954, size: 32, align: 32, offset: 1088)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !1161, file: !1154, line: 93, baseType: !1200, size: 64, align: 64, offset: 1152)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !1161, file: !1154, line: 94, baseType: !1183, size: 64, align: 64, offset: 1216)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !1161, file: !1154, line: 95, baseType: !1222, size: 64, align: 64, offset: 1280)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!954, !1152, !1225}
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !47, line: 101, baseType: !1228)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !47, line: 86, size: 576, align: 64, elements: !1229)
!1229 = !{!1230, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1228, file: !47, line: 87, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1228, file: !47, line: 88, baseType: !954, size: 32, align: 32, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !1228, file: !47, line: 89, baseType: !954, size: 32, align: 32, offset: 96)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1228, file: !47, line: 91, baseType: !951, size: 64, align: 64, offset: 128)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !1228, file: !47, line: 92, baseType: !951, size: 64, align: 64, offset: 192)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !1228, file: !47, line: 94, baseType: !951, size: 64, align: 64, offset: 256)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !1228, file: !47, line: 96, baseType: !951, size: 64, align: 64, offset: 320)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !1228, file: !47, line: 98, baseType: !951, size: 64, align: 64, offset: 384)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !1228, file: !47, line: 99, baseType: !951, size: 64, align: 64, offset: 448)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !1228, file: !47, line: 100, baseType: !951, size: 64, align: 64, offset: 512)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !1161, file: !1154, line: 96, baseType: !1183, size: 64, align: 64, offset: 1344)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !1161, file: !1154, line: 97, baseType: !1183, size: 64, align: 64, offset: 1408)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !1161, file: !1154, line: 98, baseType: !1244, size: 64, align: 64, offset: 1472)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!954, !1152, !1152}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !1161, file: !1154, line: 99, baseType: !978, size: 64, align: 64, offset: 1536)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1155, file: !1154, line: 41, baseType: !963, size: 64, align: 64, offset: 128)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1155, file: !1154, line: 42, baseType: !1231, size: 64, align: 64, offset: 192)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1155, file: !1154, line: 43, baseType: !954, size: 32, align: 32, offset: 256)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1155, file: !1154, line: 44, baseType: !954, size: 32, align: 32, offset: 288)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !1155, file: !1154, line: 45, baseType: !954, size: 32, align: 32, offset: 320)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !1155, file: !1154, line: 46, baseType: !954, size: 32, align: 32, offset: 352)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !1155, file: !1154, line: 47, baseType: !1255, size: 128, align: 64, offset: 384)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !47, line: 61, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !47, line: 58, size: 128, align: 64, elements: !1257)
!1257 = !{!1258, !1259}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1256, file: !47, line: 59, baseType: !1117, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1256, file: !47, line: 60, baseType: !963, size: 64, align: 64, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !1155, file: !1154, line: 48, baseType: !951, size: 64, align: 64, offset: 512)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1155, file: !1154, line: 49, baseType: !978, size: 64, align: 64, offset: 576)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1155, file: !1154, line: 50, baseType: !978, size: 64, align: 64, offset: 640)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1155, file: !1154, line: 51, baseType: !954, size: 32, align: 32, offset: 704)
!1264 = !DILocation(line: 52, column: 19, scope: !1137)
!1265 = !DILocation(line: 52, column: 30, scope: !1137)
!1266 = !DILocation(line: 52, column: 33, scope: !1137)
!1267 = !DILocation(line: 53, column: 12, scope: !1137)
!1268 = !DILocation(line: 53, column: 12, scope: !1269)
!1269 = !DILexicalBlockFile(scope: !1137, file: !972, discriminator: 1)
!1270 = !DILocation(line: 53, column: 25, scope: !1271)
!1271 = !DILexicalBlockFile(scope: !1137, file: !972, discriminator: 2)
!1272 = !DILocation(line: 53, column: 35, scope: !1271)
!1273 = !DILocation(line: 53, column: 12, scope: !1271)
!1274 = !DILocation(line: 53, column: 12, scope: !1275)
!1275 = !DILexicalBlockFile(scope: !1137, file: !972, discriminator: 3)
!1276 = !DILocation(line: 53, column: 5, scope: !1275)
!1277 = distinct !DISubprogram(name: "ff_avio_child_class_next", scope: !972, file: !972, line: 56, type: !1278, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1124)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!1062, !1062}
!1280 = !DILocalVariable(name: "prev", arg: 1, scope: !1277, file: !972, line: 56, type: !1062)
!1281 = !DILocation(line: 56, column: 63, scope: !1277)
!1282 = !DILocation(line: 58, column: 12, scope: !1277)
!1283 = !DILocation(line: 58, column: 5, scope: !1277)
!1284 = distinct !DISubprogram(name: "ffio_init_context", scope: !972, file: !972, line: 81, type: !1285, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1124)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!954, !1057, !1064, !954, !954, !963, !1070, !1070, !1075}
!1287 = !DILocalVariable(name: "s", arg: 1, scope: !1284, file: !972, line: 81, type: !1057)
!1288 = !DILocation(line: 81, column: 36, scope: !1284)
!1289 = !DILocalVariable(name: "buffer", arg: 2, scope: !1284, file: !972, line: 82, type: !1064)
!1290 = !DILocation(line: 82, column: 34, scope: !1284)
!1291 = !DILocalVariable(name: "buffer_size", arg: 3, scope: !1284, file: !972, line: 83, type: !954)
!1292 = !DILocation(line: 83, column: 23, scope: !1284)
!1293 = !DILocalVariable(name: "write_flag", arg: 4, scope: !1284, file: !972, line: 84, type: !954)
!1294 = !DILocation(line: 84, column: 23, scope: !1284)
!1295 = !DILocalVariable(name: "opaque", arg: 5, scope: !1284, file: !972, line: 85, type: !963)
!1296 = !DILocation(line: 85, column: 25, scope: !1284)
!1297 = !DILocalVariable(name: "read_packet", arg: 6, scope: !1284, file: !972, line: 86, type: !1070)
!1298 = !DILocation(line: 86, column: 25, scope: !1284)
!1299 = !DILocalVariable(name: "write_packet", arg: 7, scope: !1284, file: !972, line: 87, type: !1070)
!1300 = !DILocation(line: 87, column: 25, scope: !1284)
!1301 = !DILocalVariable(name: "seek", arg: 8, scope: !1284, file: !972, line: 88, type: !1075)
!1302 = !DILocation(line: 88, column: 29, scope: !1284)
!1303 = !DILocation(line: 90, column: 12, scope: !1284)
!1304 = !DILocation(line: 90, column: 5, scope: !1284)
!1305 = !DILocation(line: 92, column: 17, scope: !1284)
!1306 = !DILocation(line: 92, column: 5, scope: !1284)
!1307 = !DILocation(line: 92, column: 8, scope: !1284)
!1308 = !DILocation(line: 92, column: 15, scope: !1284)
!1309 = !DILocation(line: 94, column: 22, scope: !1284)
!1310 = !DILocation(line: 94, column: 5, scope: !1284)
!1311 = !DILocation(line: 94, column: 8, scope: !1284)
!1312 = !DILocation(line: 94, column: 20, scope: !1284)
!1313 = !DILocation(line: 93, column: 5, scope: !1284)
!1314 = !DILocation(line: 93, column: 8, scope: !1284)
!1315 = !DILocation(line: 93, column: 25, scope: !1284)
!1316 = !DILocation(line: 95, column: 18, scope: !1284)
!1317 = !DILocation(line: 95, column: 5, scope: !1284)
!1318 = !DILocation(line: 95, column: 8, scope: !1284)
!1319 = !DILocation(line: 95, column: 16, scope: !1284)
!1320 = !DILocation(line: 96, column: 22, scope: !1284)
!1321 = !DILocation(line: 96, column: 5, scope: !1284)
!1322 = !DILocation(line: 96, column: 8, scope: !1284)
!1323 = !DILocation(line: 96, column: 20, scope: !1284)
!1324 = !DILocation(line: 97, column: 17, scope: !1284)
!1325 = !DILocation(line: 97, column: 5, scope: !1284)
!1326 = !DILocation(line: 97, column: 8, scope: !1284)
!1327 = !DILocation(line: 97, column: 15, scope: !1284)
!1328 = !DILocation(line: 98, column: 5, scope: !1284)
!1329 = !DILocation(line: 98, column: 8, scope: !1284)
!1330 = !DILocation(line: 98, column: 15, scope: !1284)
!1331 = !DILocation(line: 100, column: 18, scope: !1284)
!1332 = !DILocation(line: 100, column: 21, scope: !1284)
!1333 = !DILocation(line: 100, column: 5, scope: !1284)
!1334 = !DILocation(line: 102, column: 23, scope: !1284)
!1335 = !DILocation(line: 102, column: 5, scope: !1284)
!1336 = !DILocation(line: 102, column: 8, scope: !1284)
!1337 = !DILocation(line: 102, column: 21, scope: !1284)
!1338 = !DILocation(line: 103, column: 22, scope: !1284)
!1339 = !DILocation(line: 103, column: 5, scope: !1284)
!1340 = !DILocation(line: 103, column: 8, scope: !1284)
!1341 = !DILocation(line: 103, column: 20, scope: !1284)
!1342 = !DILocation(line: 104, column: 15, scope: !1284)
!1343 = !DILocation(line: 104, column: 5, scope: !1284)
!1344 = !DILocation(line: 104, column: 8, scope: !1284)
!1345 = !DILocation(line: 104, column: 13, scope: !1284)
!1346 = !DILocation(line: 105, column: 5, scope: !1284)
!1347 = !DILocation(line: 105, column: 8, scope: !1284)
!1348 = !DILocation(line: 105, column: 12, scope: !1284)
!1349 = !DILocation(line: 106, column: 5, scope: !1284)
!1350 = !DILocation(line: 106, column: 8, scope: !1284)
!1351 = !DILocation(line: 106, column: 20, scope: !1284)
!1352 = !DILocation(line: 107, column: 5, scope: !1284)
!1353 = !DILocation(line: 107, column: 8, scope: !1284)
!1354 = !DILocation(line: 107, column: 14, scope: !1284)
!1355 = !DILocation(line: 108, column: 19, scope: !1284)
!1356 = !DILocation(line: 108, column: 5, scope: !1284)
!1357 = !DILocation(line: 108, column: 8, scope: !1284)
!1358 = !DILocation(line: 108, column: 17, scope: !1284)
!1359 = !DILocation(line: 109, column: 5, scope: !1284)
!1360 = !DILocation(line: 109, column: 8, scope: !1284)
!1361 = !DILocation(line: 109, column: 24, scope: !1284)
!1362 = !DILocation(line: 110, column: 5, scope: !1284)
!1363 = !DILocation(line: 110, column: 8, scope: !1284)
!1364 = !DILocation(line: 110, column: 24, scope: !1284)
!1365 = !DILocation(line: 111, column: 5, scope: !1284)
!1366 = !DILocation(line: 111, column: 8, scope: !1284)
!1367 = !DILocation(line: 111, column: 24, scope: !1284)
!1368 = !DILocation(line: 112, column: 5, scope: !1284)
!1369 = !DILocation(line: 112, column: 8, scope: !1284)
!1370 = !DILocation(line: 112, column: 29, scope: !1284)
!1371 = !DILocation(line: 114, column: 10, scope: !1372)
!1372 = distinct !DILexicalBlock(scope: !1284, file: !972, line: 114, column: 9)
!1373 = !DILocation(line: 114, column: 22, scope: !1372)
!1374 = !DILocation(line: 114, column: 26, scope: !1375)
!1375 = !DILexicalBlockFile(scope: !1372, file: !972, discriminator: 1)
!1376 = !DILocation(line: 114, column: 9, scope: !1375)
!1377 = !DILocation(line: 115, column: 18, scope: !1378)
!1378 = distinct !DILexicalBlock(scope: !1372, file: !972, line: 114, column: 38)
!1379 = !DILocation(line: 115, column: 9, scope: !1378)
!1380 = !DILocation(line: 115, column: 12, scope: !1378)
!1381 = !DILocation(line: 115, column: 16, scope: !1378)
!1382 = !DILocation(line: 116, column: 22, scope: !1378)
!1383 = !DILocation(line: 116, column: 25, scope: !1378)
!1384 = !DILocation(line: 116, column: 34, scope: !1378)
!1385 = !DILocation(line: 116, column: 32, scope: !1378)
!1386 = !DILocation(line: 116, column: 9, scope: !1378)
!1387 = !DILocation(line: 116, column: 12, scope: !1378)
!1388 = !DILocation(line: 116, column: 20, scope: !1378)
!1389 = !DILocation(line: 117, column: 5, scope: !1378)
!1390 = !DILocation(line: 118, column: 5, scope: !1284)
!1391 = !DILocation(line: 118, column: 8, scope: !1284)
!1392 = !DILocation(line: 118, column: 19, scope: !1284)
!1393 = !DILocation(line: 119, column: 5, scope: !1284)
!1394 = !DILocation(line: 119, column: 8, scope: !1284)
!1395 = !DILocation(line: 119, column: 18, scope: !1284)
!1396 = !DILocation(line: 121, column: 5, scope: !1284)
!1397 = !DILocation(line: 121, column: 8, scope: !1284)
!1398 = !DILocation(line: 121, column: 24, scope: !1284)
!1399 = !DILocation(line: 122, column: 5, scope: !1284)
!1400 = !DILocation(line: 122, column: 8, scope: !1284)
!1401 = !DILocation(line: 122, column: 30, scope: !1284)
!1402 = !DILocation(line: 123, column: 5, scope: !1284)
!1403 = !DILocation(line: 123, column: 8, scope: !1284)
!1404 = !DILocation(line: 123, column: 21, scope: !1284)
!1405 = !DILocation(line: 124, column: 5, scope: !1284)
!1406 = !DILocation(line: 124, column: 8, scope: !1284)
!1407 = !DILocation(line: 124, column: 18, scope: !1284)
!1408 = !DILocation(line: 125, column: 5, scope: !1284)
!1409 = !DILocation(line: 125, column: 8, scope: !1284)
!1410 = !DILocation(line: 125, column: 23, scope: !1284)
!1411 = !DILocation(line: 126, column: 5, scope: !1284)
!1412 = !DILocation(line: 126, column: 8, scope: !1284)
!1413 = !DILocation(line: 126, column: 16, scope: !1284)
!1414 = !DILocation(line: 128, column: 5, scope: !1284)
!1415 = distinct !DISubprogram(name: "url_resetbuf", scope: !972, file: !972, line: 1097, type: !1416, isLocal: true, isDefinition: true, scopeLine: 1098, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1124)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{!954, !1057, !954}
!1418 = !DILocalVariable(name: "s", arg: 1, scope: !1415, file: !972, line: 1097, type: !1057)
!1419 = !DILocation(line: 1097, column: 38, scope: !1415)
!1420 = !DILocalVariable(name: "flags", arg: 2, scope: !1415, file: !972, line: 1097, type: !954)
!1421 = !DILocation(line: 1097, column: 45, scope: !1415)
!1422 = !DILocation(line: 1101, column: 9, scope: !1423)
!1423 = distinct !DILexicalBlock(scope: !1415, file: !972, line: 1101, column: 9)
!1424 = !DILocation(line: 1101, column: 15, scope: !1423)
!1425 = !DILocation(line: 1101, column: 9, scope: !1415)
!1426 = !DILocation(line: 1102, column: 22, scope: !1427)
!1427 = distinct !DILexicalBlock(scope: !1423, file: !972, line: 1101, column: 20)
!1428 = !DILocation(line: 1102, column: 25, scope: !1427)
!1429 = !DILocation(line: 1102, column: 34, scope: !1427)
!1430 = !DILocation(line: 1102, column: 37, scope: !1427)
!1431 = !DILocation(line: 1102, column: 32, scope: !1427)
!1432 = !DILocation(line: 1102, column: 9, scope: !1427)
!1433 = !DILocation(line: 1102, column: 12, scope: !1427)
!1434 = !DILocation(line: 1102, column: 20, scope: !1427)
!1435 = !DILocation(line: 1103, column: 9, scope: !1427)
!1436 = !DILocation(line: 1103, column: 12, scope: !1427)
!1437 = !DILocation(line: 1103, column: 23, scope: !1427)
!1438 = !DILocation(line: 1104, column: 5, scope: !1427)
!1439 = !DILocation(line: 1105, column: 22, scope: !1440)
!1440 = distinct !DILexicalBlock(scope: !1423, file: !972, line: 1104, column: 12)
!1441 = !DILocation(line: 1105, column: 25, scope: !1440)
!1442 = !DILocation(line: 1105, column: 9, scope: !1440)
!1443 = !DILocation(line: 1105, column: 12, scope: !1440)
!1444 = !DILocation(line: 1105, column: 20, scope: !1440)
!1445 = !DILocation(line: 1106, column: 9, scope: !1440)
!1446 = !DILocation(line: 1106, column: 12, scope: !1440)
!1447 = !DILocation(line: 1106, column: 23, scope: !1440)
!1448 = !DILocation(line: 1108, column: 5, scope: !1415)
!1449 = distinct !DISubprogram(name: "avio_alloc_context", scope: !972, file: !972, line: 131, type: !1450, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1124)
!1450 = !DISubroutineType(types: !1451)
!1451 = !{!1057, !1064, !954, !954, !963, !1070, !1070, !1075}
!1452 = !DILocalVariable(name: "buffer", arg: 1, scope: !1449, file: !972, line: 132, type: !1064)
!1453 = !DILocation(line: 132, column: 34, scope: !1449)
!1454 = !DILocalVariable(name: "buffer_size", arg: 2, scope: !1449, file: !972, line: 133, type: !954)
!1455 = !DILocation(line: 133, column: 23, scope: !1449)
!1456 = !DILocalVariable(name: "write_flag", arg: 3, scope: !1449, file: !972, line: 134, type: !954)
!1457 = !DILocation(line: 134, column: 23, scope: !1449)
!1458 = !DILocalVariable(name: "opaque", arg: 4, scope: !1449, file: !972, line: 135, type: !963)
!1459 = !DILocation(line: 135, column: 25, scope: !1449)
!1460 = !DILocalVariable(name: "read_packet", arg: 5, scope: !1449, file: !972, line: 136, type: !1070)
!1461 = !DILocation(line: 136, column: 25, scope: !1449)
!1462 = !DILocalVariable(name: "write_packet", arg: 6, scope: !1449, file: !972, line: 137, type: !1070)
!1463 = !DILocation(line: 137, column: 25, scope: !1449)
!1464 = !DILocalVariable(name: "seek", arg: 7, scope: !1449, file: !972, line: 138, type: !1075)
!1465 = !DILocation(line: 138, column: 29, scope: !1449)
!1466 = !DILocalVariable(name: "s", scope: !1449, file: !972, line: 140, type: !1057)
!1467 = !DILocation(line: 140, column: 18, scope: !1449)
!1468 = !DILocation(line: 140, column: 22, scope: !1449)
!1469 = !DILocation(line: 141, column: 10, scope: !1470)
!1470 = distinct !DILexicalBlock(scope: !1449, file: !972, line: 141, column: 9)
!1471 = !DILocation(line: 141, column: 9, scope: !1449)
!1472 = !DILocation(line: 142, column: 9, scope: !1470)
!1473 = !DILocation(line: 143, column: 23, scope: !1449)
!1474 = !DILocation(line: 143, column: 26, scope: !1449)
!1475 = !DILocation(line: 143, column: 34, scope: !1449)
!1476 = !DILocation(line: 143, column: 47, scope: !1449)
!1477 = !DILocation(line: 143, column: 59, scope: !1449)
!1478 = !DILocation(line: 144, column: 19, scope: !1449)
!1479 = !DILocation(line: 144, column: 32, scope: !1449)
!1480 = !DILocation(line: 144, column: 46, scope: !1449)
!1481 = !DILocation(line: 143, column: 5, scope: !1449)
!1482 = !DILocation(line: 145, column: 12, scope: !1449)
!1483 = !DILocation(line: 145, column: 5, scope: !1449)
!1484 = !DILocation(line: 146, column: 1, scope: !1449)
!1485 = distinct !DISubprogram(name: "avio_context_free", scope: !972, file: !972, line: 148, type: !1486, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1124)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{null, !1488}
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1489 = !DILocalVariable(name: "ps", arg: 1, scope: !1485, file: !972, line: 148, type: !1488)
!1490 = !DILocation(line: 148, column: 38, scope: !1485)
!1491 = !DILocation(line: 150, column: 14, scope: !1485)
!1492 = !DILocation(line: 150, column: 5, scope: !1485)
!1493 = !DILocation(line: 151, column: 1, scope: !1485)
!1494 = distinct !DISubprogram(name: "avio_w8", scope: !972, file: !972, line: 196, type: !1495, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1124)
!1495 = !DISubroutineType(types: !1496)
!1496 = !{null, !1057, !954}
!1497 = !DILocalVariable(name: "s", arg: 1, scope: !1494, file: !972, line: 196, type: !1057)
!1498 = !DILocation(line: 196, column: 27, scope: !1494)
!1499 = !DILocalVariable(name: "b", arg: 2, scope: !1494, file: !972, line: 196, type: !954)
!1500 = !DILocation(line: 196, column: 34, scope: !1494)
!1501 = !DILocation(line: 199, column: 21, scope: !1494)
!1502 = !DILocation(line: 199, column: 6, scope: !1494)
!1503 = !DILocation(line: 199, column: 9, scope: !1494)
!1504 = !DILocation(line: 199, column: 16, scope: !1494)
!1505 = !DILocation(line: 199, column: 19, scope: !1494)
!1506 = !DILocation(line: 200, column: 9, scope: !1507)
!1507 = distinct !DILexicalBlock(scope: !1494, file: !972, line: 200, column: 9)
!1508 = !DILocation(line: 200, column: 12, scope: !1507)
!1509 = !DILocation(line: 200, column: 23, scope: !1507)
!1510 = !DILocation(line: 200, column: 26, scope: !1507)
!1511 = !DILocation(line: 200, column: 20, scope: !1507)
!1512 = !DILocation(line: 200, column: 9, scope: !1494)
!1513 = !DILocation(line: 201, column: 22, scope: !1507)
!1514 = !DILocation(line: 201, column: 9, scope: !1507)
!1515 = !DILocation(line: 202, column: 1, scope: !1494)
!1516 = distinct !DISubprogram(name: "flush_buffer", scope: !972, file: !972, line: 180, type: !1517, isLocal: true, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1124)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{null, !1057}
!1519 = !DILocalVariable(name: "s", arg: 1, scope: !1516, file: !972, line: 180, type: !1057)
!1520 = !DILocation(line: 180, column: 39, scope: !1516)
!1521 = !DILocation(line: 182, column: 24, scope: !1516)
!1522 = !DILocation(line: 182, column: 27, scope: !1516)
!1523 = !DILocation(line: 182, column: 39, scope: !1516)
!1524 = !DILocation(line: 182, column: 42, scope: !1516)
!1525 = !DILocation(line: 182, column: 36, scope: !1516)
!1526 = !DILocation(line: 182, column: 23, scope: !1516)
!1527 = !DILocation(line: 182, column: 58, scope: !1528)
!1528 = !DILexicalBlockFile(scope: !1516, file: !972, discriminator: 1)
!1529 = !DILocation(line: 182, column: 61, scope: !1528)
!1530 = !DILocation(line: 182, column: 23, scope: !1528)
!1531 = !DILocation(line: 182, column: 73, scope: !1532)
!1532 = !DILexicalBlockFile(scope: !1516, file: !972, discriminator: 2)
!1533 = !DILocation(line: 182, column: 76, scope: !1532)
!1534 = !DILocation(line: 182, column: 23, scope: !1532)
!1535 = !DILocation(line: 182, column: 23, scope: !1536)
!1536 = !DILexicalBlockFile(scope: !1516, file: !972, discriminator: 3)
!1537 = !DILocation(line: 182, column: 5, scope: !1536)
!1538 = !DILocation(line: 182, column: 8, scope: !1536)
!1539 = !DILocation(line: 182, column: 20, scope: !1536)
!1540 = !DILocation(line: 183, column: 9, scope: !1541)
!1541 = distinct !DILexicalBlock(scope: !1516, file: !972, line: 183, column: 9)
!1542 = !DILocation(line: 183, column: 12, scope: !1541)
!1543 = !DILocation(line: 183, column: 23, scope: !1541)
!1544 = !DILocation(line: 183, column: 26, scope: !1545)
!1545 = !DILexicalBlockFile(scope: !1541, file: !972, discriminator: 1)
!1546 = !DILocation(line: 183, column: 29, scope: !1545)
!1547 = !DILocation(line: 183, column: 43, scope: !1545)
!1548 = !DILocation(line: 183, column: 46, scope: !1545)
!1549 = !DILocation(line: 183, column: 41, scope: !1545)
!1550 = !DILocation(line: 183, column: 9, scope: !1545)
!1551 = !DILocation(line: 184, column: 18, scope: !1552)
!1552 = distinct !DILexicalBlock(scope: !1541, file: !972, line: 183, column: 54)
!1553 = !DILocation(line: 184, column: 21, scope: !1552)
!1554 = !DILocation(line: 184, column: 24, scope: !1552)
!1555 = !DILocation(line: 184, column: 32, scope: !1552)
!1556 = !DILocation(line: 184, column: 35, scope: !1552)
!1557 = !DILocation(line: 184, column: 49, scope: !1552)
!1558 = !DILocation(line: 184, column: 52, scope: !1552)
!1559 = !DILocation(line: 184, column: 47, scope: !1552)
!1560 = !DILocation(line: 184, column: 9, scope: !1552)
!1561 = !DILocation(line: 185, column: 13, scope: !1562)
!1562 = distinct !DILexicalBlock(scope: !1552, file: !972, line: 185, column: 13)
!1563 = !DILocation(line: 185, column: 16, scope: !1562)
!1564 = !DILocation(line: 185, column: 13, scope: !1552)
!1565 = !DILocation(line: 186, column: 27, scope: !1566)
!1566 = distinct !DILexicalBlock(scope: !1562, file: !972, line: 185, column: 33)
!1567 = !DILocation(line: 186, column: 30, scope: !1566)
!1568 = !DILocation(line: 186, column: 46, scope: !1566)
!1569 = !DILocation(line: 186, column: 49, scope: !1566)
!1570 = !DILocation(line: 186, column: 59, scope: !1566)
!1571 = !DILocation(line: 186, column: 62, scope: !1566)
!1572 = !DILocation(line: 187, column: 50, scope: !1566)
!1573 = !DILocation(line: 187, column: 53, scope: !1566)
!1574 = !DILocation(line: 187, column: 67, scope: !1566)
!1575 = !DILocation(line: 187, column: 70, scope: !1566)
!1576 = !DILocation(line: 187, column: 65, scope: !1566)
!1577 = !DILocation(line: 186, column: 13, scope: !1566)
!1578 = !DILocation(line: 186, column: 16, scope: !1566)
!1579 = !DILocation(line: 186, column: 25, scope: !1566)
!1580 = !DILocation(line: 188, column: 31, scope: !1566)
!1581 = !DILocation(line: 188, column: 34, scope: !1566)
!1582 = !DILocation(line: 188, column: 13, scope: !1566)
!1583 = !DILocation(line: 188, column: 16, scope: !1566)
!1584 = !DILocation(line: 188, column: 29, scope: !1566)
!1585 = !DILocation(line: 189, column: 9, scope: !1566)
!1586 = !DILocation(line: 190, column: 5, scope: !1552)
!1587 = !DILocation(line: 191, column: 35, scope: !1516)
!1588 = !DILocation(line: 191, column: 38, scope: !1516)
!1589 = !DILocation(line: 191, column: 18, scope: !1516)
!1590 = !DILocation(line: 191, column: 21, scope: !1516)
!1591 = !DILocation(line: 191, column: 33, scope: !1516)
!1592 = !DILocation(line: 191, column: 5, scope: !1516)
!1593 = !DILocation(line: 191, column: 8, scope: !1516)
!1594 = !DILocation(line: 191, column: 16, scope: !1516)
!1595 = !DILocation(line: 192, column: 10, scope: !1596)
!1596 = distinct !DILexicalBlock(scope: !1516, file: !972, line: 192, column: 9)
!1597 = !DILocation(line: 192, column: 13, scope: !1596)
!1598 = !DILocation(line: 192, column: 9, scope: !1516)
!1599 = !DILocation(line: 193, column: 22, scope: !1596)
!1600 = !DILocation(line: 193, column: 25, scope: !1596)
!1601 = !DILocation(line: 193, column: 9, scope: !1596)
!1602 = !DILocation(line: 193, column: 12, scope: !1596)
!1603 = !DILocation(line: 193, column: 20, scope: !1596)
!1604 = !DILocation(line: 194, column: 1, scope: !1516)
!1605 = distinct !DISubprogram(name: "ffio_fill", scope: !972, file: !972, line: 204, type: !1606, isLocal: false, isDefinition: true, scopeLine: 205, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1124)
!1606 = !DISubroutineType(types: !1607)
!1607 = !{null, !1057, !954, !954}
!1608 = !DILocalVariable(name: "s", arg: 1, scope: !1605, file: !972, line: 204, type: !1057)
!1609 = !DILocation(line: 204, column: 29, scope: !1605)
!1610 = !DILocalVariable(name: "b", arg: 2, scope: !1605, file: !972, line: 204, type: !954)
!1611 = !DILocation(line: 204, column: 36, scope: !1605)
!1612 = !DILocalVariable(name: "count", arg: 3, scope: !1605, file: !972, line: 204, type: !954)
!1613 = !DILocation(line: 204, column: 43, scope: !1605)
!1614 = !DILocation(line: 206, column: 5, scope: !1605)
!1615 = !DILocation(line: 206, column: 12, scope: !1616)
!1616 = !DILexicalBlockFile(scope: !1605, file: !972, discriminator: 1)
!1617 = !DILocation(line: 206, column: 18, scope: !1616)
!1618 = !DILocation(line: 206, column: 5, scope: !1616)
!1619 = !DILocalVariable(name: "len", scope: !1620, file: !972, line: 207, type: !954)
!1620 = distinct !DILexicalBlock(scope: !1605, file: !972, line: 206, column: 23)
!1621 = !DILocation(line: 207, column: 13, scope: !1620)
!1622 = !DILocation(line: 207, column: 21, scope: !1620)
!1623 = !DILocation(line: 207, column: 24, scope: !1620)
!1624 = !DILocation(line: 207, column: 34, scope: !1620)
!1625 = !DILocation(line: 207, column: 37, scope: !1620)
!1626 = !DILocation(line: 207, column: 32, scope: !1620)
!1627 = !DILocation(line: 207, column: 49, scope: !1620)
!1628 = !DILocation(line: 207, column: 48, scope: !1620)
!1629 = !DILocation(line: 207, column: 46, scope: !1620)
!1630 = !DILocation(line: 207, column: 20, scope: !1620)
!1631 = !DILocation(line: 207, column: 59, scope: !1632)
!1632 = !DILexicalBlockFile(scope: !1620, file: !972, discriminator: 1)
!1633 = !DILocation(line: 207, column: 58, scope: !1632)
!1634 = !DILocation(line: 207, column: 20, scope: !1632)
!1635 = !DILocation(line: 207, column: 69, scope: !1636)
!1636 = !DILexicalBlockFile(scope: !1620, file: !972, discriminator: 2)
!1637 = !DILocation(line: 207, column: 72, scope: !1636)
!1638 = !DILocation(line: 207, column: 82, scope: !1636)
!1639 = !DILocation(line: 207, column: 85, scope: !1636)
!1640 = !DILocation(line: 207, column: 80, scope: !1636)
!1641 = !DILocation(line: 207, column: 20, scope: !1636)
!1642 = !DILocation(line: 207, column: 20, scope: !1643)
!1643 = !DILexicalBlockFile(scope: !1620, file: !972, discriminator: 3)
!1644 = !DILocation(line: 207, column: 19, scope: !1643)
!1645 = !DILocation(line: 207, column: 13, scope: !1643)
!1646 = !DILocation(line: 208, column: 16, scope: !1620)
!1647 = !DILocation(line: 208, column: 19, scope: !1620)
!1648 = !DILocation(line: 208, column: 28, scope: !1620)
!1649 = !DILocation(line: 208, column: 9, scope: !1620)
!1650 = !DILocation(line: 208, column: 31, scope: !1620)
!1651 = !DILocation(line: 209, column: 23, scope: !1620)
!1652 = !DILocation(line: 209, column: 9, scope: !1620)
!1653 = !DILocation(line: 209, column: 12, scope: !1620)
!1654 = !DILocation(line: 209, column: 20, scope: !1620)
!1655 = !DILocation(line: 211, column: 13, scope: !1656)
!1656 = distinct !DILexicalBlock(scope: !1620, file: !972, line: 211, column: 13)
!1657 = !DILocation(line: 211, column: 16, scope: !1656)
!1658 = !DILocation(line: 211, column: 27, scope: !1656)
!1659 = !DILocation(line: 211, column: 30, scope: !1656)
!1660 = !DILocation(line: 211, column: 24, scope: !1656)
!1661 = !DILocation(line: 211, column: 13, scope: !1620)
!1662 = !DILocation(line: 212, column: 26, scope: !1656)
!1663 = !DILocation(line: 212, column: 13, scope: !1656)
!1664 = !DILocation(line: 214, column: 18, scope: !1620)
!1665 = !DILocation(line: 214, column: 15, scope: !1620)
!1666 = !DILocation(line: 206, column: 5, scope: !1667)
!1667 = !DILexicalBlockFile(scope: !1605, file: !972, discriminator: 2)
!1668 = distinct !{!1668, !1614}
!1669 = !DILocation(line: 216, column: 1, scope: !1605)
!1670 = distinct !DISubprogram(name: "avio_write", scope: !972, file: !972, line: 218, type: !1671, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1124)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{null, !1057, !958, !954}
!1673 = !DILocalVariable(name: "s", arg: 1, scope: !1670, file: !972, line: 218, type: !1057)
!1674 = !DILocation(line: 218, column: 30, scope: !1670)
!1675 = !DILocalVariable(name: "buf", arg: 2, scope: !1670, file: !972, line: 218, type: !958)
!1676 = !DILocation(line: 218, column: 54, scope: !1670)
!1677 = !DILocalVariable(name: "size", arg: 3, scope: !1670, file: !972, line: 218, type: !954)
!1678 = !DILocation(line: 218, column: 63, scope: !1670)
!1679 = !DILocation(line: 220, column: 9, scope: !1680)
!1680 = distinct !DILexicalBlock(scope: !1670, file: !972, line: 220, column: 9)
!1681 = !DILocation(line: 220, column: 12, scope: !1680)
!1682 = !DILocation(line: 220, column: 19, scope: !1680)
!1683 = !DILocation(line: 220, column: 23, scope: !1684)
!1684 = !DILexicalBlockFile(scope: !1680, file: !972, discriminator: 1)
!1685 = !DILocation(line: 220, column: 26, scope: !1684)
!1686 = !DILocation(line: 220, column: 9, scope: !1684)
!1687 = !DILocation(line: 221, column: 20, scope: !1688)
!1688 = distinct !DILexicalBlock(scope: !1680, file: !972, line: 220, column: 43)
!1689 = !DILocation(line: 221, column: 9, scope: !1688)
!1690 = !DILocation(line: 222, column: 18, scope: !1688)
!1691 = !DILocation(line: 222, column: 21, scope: !1688)
!1692 = !DILocation(line: 222, column: 26, scope: !1688)
!1693 = !DILocation(line: 222, column: 9, scope: !1688)
!1694 = !DILocation(line: 223, column: 9, scope: !1688)
!1695 = !DILocation(line: 225, column: 5, scope: !1670)
!1696 = !DILocation(line: 225, column: 12, scope: !1697)
!1697 = !DILexicalBlockFile(scope: !1670, file: !972, discriminator: 1)
!1698 = !DILocation(line: 225, column: 17, scope: !1697)
!1699 = !DILocation(line: 225, column: 5, scope: !1697)
!1700 = !DILocalVariable(name: "len", scope: !1701, file: !972, line: 226, type: !954)
!1701 = distinct !DILexicalBlock(scope: !1670, file: !972, line: 225, column: 22)
!1702 = !DILocation(line: 226, column: 13, scope: !1701)
!1703 = !DILocation(line: 226, column: 21, scope: !1701)
!1704 = !DILocation(line: 226, column: 24, scope: !1701)
!1705 = !DILocation(line: 226, column: 34, scope: !1701)
!1706 = !DILocation(line: 226, column: 37, scope: !1701)
!1707 = !DILocation(line: 226, column: 32, scope: !1701)
!1708 = !DILocation(line: 226, column: 49, scope: !1701)
!1709 = !DILocation(line: 226, column: 48, scope: !1701)
!1710 = !DILocation(line: 226, column: 46, scope: !1701)
!1711 = !DILocation(line: 226, column: 20, scope: !1701)
!1712 = !DILocation(line: 226, column: 58, scope: !1713)
!1713 = !DILexicalBlockFile(scope: !1701, file: !972, discriminator: 1)
!1714 = !DILocation(line: 226, column: 57, scope: !1713)
!1715 = !DILocation(line: 226, column: 20, scope: !1713)
!1716 = !DILocation(line: 226, column: 67, scope: !1717)
!1717 = !DILexicalBlockFile(scope: !1701, file: !972, discriminator: 2)
!1718 = !DILocation(line: 226, column: 70, scope: !1717)
!1719 = !DILocation(line: 226, column: 80, scope: !1717)
!1720 = !DILocation(line: 226, column: 83, scope: !1717)
!1721 = !DILocation(line: 226, column: 78, scope: !1717)
!1722 = !DILocation(line: 226, column: 20, scope: !1717)
!1723 = !DILocation(line: 226, column: 20, scope: !1724)
!1724 = !DILexicalBlockFile(scope: !1701, file: !972, discriminator: 3)
!1725 = !DILocation(line: 226, column: 19, scope: !1724)
!1726 = !DILocation(line: 226, column: 13, scope: !1724)
!1727 = !DILocation(line: 227, column: 16, scope: !1701)
!1728 = !DILocation(line: 227, column: 19, scope: !1701)
!1729 = !DILocation(line: 227, column: 28, scope: !1701)
!1730 = !DILocation(line: 227, column: 33, scope: !1701)
!1731 = !DILocation(line: 227, column: 9, scope: !1701)
!1732 = !DILocation(line: 228, column: 23, scope: !1701)
!1733 = !DILocation(line: 228, column: 9, scope: !1701)
!1734 = !DILocation(line: 228, column: 12, scope: !1701)
!1735 = !DILocation(line: 228, column: 20, scope: !1701)
!1736 = !DILocation(line: 230, column: 13, scope: !1737)
!1737 = distinct !DILexicalBlock(scope: !1701, file: !972, line: 230, column: 13)
!1738 = !DILocation(line: 230, column: 16, scope: !1737)
!1739 = !DILocation(line: 230, column: 27, scope: !1737)
!1740 = !DILocation(line: 230, column: 30, scope: !1737)
!1741 = !DILocation(line: 230, column: 24, scope: !1737)
!1742 = !DILocation(line: 230, column: 13, scope: !1701)
!1743 = !DILocation(line: 231, column: 26, scope: !1737)
!1744 = !DILocation(line: 231, column: 13, scope: !1737)
!1745 = !DILocation(line: 233, column: 16, scope: !1701)
!1746 = !DILocation(line: 233, column: 13, scope: !1701)
!1747 = !DILocation(line: 234, column: 17, scope: !1701)
!1748 = !DILocation(line: 234, column: 14, scope: !1701)
!1749 = !DILocation(line: 225, column: 5, scope: !1750)
!1750 = !DILexicalBlockFile(scope: !1670, file: !972, discriminator: 2)
!1751 = distinct !{!1751, !1695}
!1752 = !DILocation(line: 236, column: 1, scope: !1670)
!1753 = distinct !DISubprogram(name: "avio_flush", scope: !972, file: !972, line: 238, type: !1517, isLocal: false, isDefinition: true, scopeLine: 239, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1124)
!1754 = !DILocalVariable(name: "s", arg: 1, scope: !1753, file: !972, line: 238, type: !1057)
!1755 = !DILocation(line: 238, column: 30, scope: !1753)
!1756 = !DILocalVariable(name: "seekback", scope: !1753, file: !972, line: 240, type: !954)
!1757 = !DILocation(line: 240, column: 9, scope: !1753)
!1758 = !DILocation(line: 240, column: 20, scope: !1753)
!1759 = !DILocation(line: 240, column: 23, scope: !1753)
!1760 = !DILocation(line: 240, column: 44, scope: !1761)
!1761 = !DILexicalBlockFile(scope: !1753, file: !972, discriminator: 1)
!1762 = !DILocation(line: 240, column: 47, scope: !1761)
!1763 = !DILocation(line: 240, column: 57, scope: !1761)
!1764 = !DILocation(line: 240, column: 60, scope: !1761)
!1765 = !DILocation(line: 240, column: 55, scope: !1761)
!1766 = !DILocation(line: 240, column: 41, scope: !1761)
!1767 = !DILocation(line: 240, column: 37, scope: !1761)
!1768 = !DILocation(line: 240, column: 76, scope: !1769)
!1769 = !DILexicalBlockFile(scope: !1753, file: !972, discriminator: 2)
!1770 = !DILocation(line: 240, column: 79, scope: !1769)
!1771 = !DILocation(line: 240, column: 89, scope: !1769)
!1772 = !DILocation(line: 240, column: 92, scope: !1769)
!1773 = !DILocation(line: 240, column: 87, scope: !1769)
!1774 = !DILocation(line: 240, column: 37, scope: !1769)
!1775 = !DILocation(line: 240, column: 37, scope: !1776)
!1776 = !DILexicalBlockFile(scope: !1753, file: !972, discriminator: 3)
!1777 = !DILocation(line: 240, column: 37, scope: !1778)
!1778 = !DILexicalBlockFile(scope: !1753, file: !972, discriminator: 4)
!1779 = !DILocation(line: 240, column: 20, scope: !1778)
!1780 = !DILocation(line: 240, column: 20, scope: !1781)
!1781 = !DILexicalBlockFile(scope: !1753, file: !972, discriminator: 5)
!1782 = !DILocation(line: 240, column: 20, scope: !1783)
!1783 = !DILexicalBlockFile(scope: !1753, file: !972, discriminator: 6)
!1784 = !DILocation(line: 240, column: 9, scope: !1783)
!1785 = !DILocation(line: 241, column: 18, scope: !1753)
!1786 = !DILocation(line: 241, column: 5, scope: !1753)
!1787 = !DILocation(line: 242, column: 9, scope: !1788)
!1788 = distinct !DILexicalBlock(scope: !1753, file: !972, line: 242, column: 9)
!1789 = !DILocation(line: 242, column: 9, scope: !1753)
!1790 = !DILocation(line: 243, column: 19, scope: !1788)
!1791 = !DILocation(line: 243, column: 22, scope: !1788)
!1792 = !DILocation(line: 243, column: 9, scope: !1788)
!1793 = !DILocation(line: 244, column: 1, scope: !1753)
!1794 = distinct !DISubprogram(name: "writeout", scope: !972, file: !972, line: 153, type: !1795, isLocal: true, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1124)
!1795 = !DISubroutineType(types: !1796)
!1796 = !{null, !1057, !1088, !954}
!1797 = !DILocalVariable(name: "s", arg: 1, scope: !1794, file: !972, line: 153, type: !1057)
!1798 = !DILocation(line: 153, column: 35, scope: !1794)
!1799 = !DILocalVariable(name: "data", arg: 2, scope: !1794, file: !972, line: 153, type: !1088)
!1800 = !DILocation(line: 153, column: 53, scope: !1794)
!1801 = !DILocalVariable(name: "len", arg: 3, scope: !1794, file: !972, line: 153, type: !954)
!1802 = !DILocation(line: 153, column: 63, scope: !1794)
!1803 = !DILocation(line: 155, column: 10, scope: !1804)
!1804 = distinct !DILexicalBlock(scope: !1794, file: !972, line: 155, column: 9)
!1805 = !DILocation(line: 155, column: 13, scope: !1804)
!1806 = !DILocation(line: 155, column: 9, scope: !1794)
!1807 = !DILocalVariable(name: "ret", scope: !1808, file: !972, line: 156, type: !954)
!1808 = distinct !DILexicalBlock(scope: !1804, file: !972, line: 155, column: 20)
!1809 = !DILocation(line: 156, column: 13, scope: !1808)
!1810 = !DILocation(line: 157, column: 13, scope: !1811)
!1811 = distinct !DILexicalBlock(scope: !1808, file: !972, line: 157, column: 13)
!1812 = !DILocation(line: 157, column: 16, scope: !1811)
!1813 = !DILocation(line: 157, column: 13, scope: !1808)
!1814 = !DILocation(line: 158, column: 19, scope: !1811)
!1815 = !DILocation(line: 158, column: 22, scope: !1811)
!1816 = !DILocation(line: 158, column: 38, scope: !1811)
!1817 = !DILocation(line: 158, column: 41, scope: !1811)
!1818 = !DILocation(line: 158, column: 60, scope: !1811)
!1819 = !DILocation(line: 159, column: 38, scope: !1811)
!1820 = !DILocation(line: 160, column: 38, scope: !1811)
!1821 = !DILocation(line: 160, column: 41, scope: !1811)
!1822 = !DILocation(line: 161, column: 38, scope: !1811)
!1823 = !DILocation(line: 161, column: 41, scope: !1811)
!1824 = !DILocation(line: 158, column: 17, scope: !1811)
!1825 = !DILocation(line: 158, column: 13, scope: !1811)
!1826 = !DILocation(line: 162, column: 18, scope: !1827)
!1827 = distinct !DILexicalBlock(scope: !1811, file: !972, line: 162, column: 18)
!1828 = !DILocation(line: 162, column: 21, scope: !1827)
!1829 = !DILocation(line: 162, column: 18, scope: !1811)
!1830 = !DILocation(line: 163, column: 19, scope: !1827)
!1831 = !DILocation(line: 163, column: 22, scope: !1827)
!1832 = !DILocation(line: 163, column: 35, scope: !1827)
!1833 = !DILocation(line: 163, column: 38, scope: !1827)
!1834 = !DILocation(line: 163, column: 57, scope: !1827)
!1835 = !DILocation(line: 163, column: 63, scope: !1827)
!1836 = !DILocation(line: 163, column: 17, scope: !1827)
!1837 = !DILocation(line: 163, column: 13, scope: !1827)
!1838 = !DILocation(line: 164, column: 13, scope: !1839)
!1839 = distinct !DILexicalBlock(scope: !1808, file: !972, line: 164, column: 13)
!1840 = !DILocation(line: 164, column: 17, scope: !1839)
!1841 = !DILocation(line: 164, column: 13, scope: !1808)
!1842 = !DILocation(line: 165, column: 24, scope: !1843)
!1843 = distinct !DILexicalBlock(scope: !1839, file: !972, line: 164, column: 22)
!1844 = !DILocation(line: 165, column: 13, scope: !1843)
!1845 = !DILocation(line: 165, column: 16, scope: !1843)
!1846 = !DILocation(line: 165, column: 22, scope: !1843)
!1847 = !DILocation(line: 166, column: 9, scope: !1843)
!1848 = !DILocation(line: 167, column: 17, scope: !1849)
!1849 = distinct !DILexicalBlock(scope: !1850, file: !972, line: 167, column: 17)
!1850 = distinct !DILexicalBlock(scope: !1839, file: !972, line: 166, column: 16)
!1851 = !DILocation(line: 167, column: 20, scope: !1849)
!1852 = !DILocation(line: 167, column: 26, scope: !1849)
!1853 = !DILocation(line: 167, column: 24, scope: !1849)
!1854 = !DILocation(line: 167, column: 32, scope: !1849)
!1855 = !DILocation(line: 167, column: 35, scope: !1849)
!1856 = !DILocation(line: 167, column: 30, scope: !1849)
!1857 = !DILocation(line: 167, column: 17, scope: !1850)
!1858 = !DILocation(line: 168, column: 30, scope: !1849)
!1859 = !DILocation(line: 168, column: 33, scope: !1849)
!1860 = !DILocation(line: 168, column: 39, scope: !1849)
!1861 = !DILocation(line: 168, column: 37, scope: !1849)
!1862 = !DILocation(line: 168, column: 17, scope: !1849)
!1863 = !DILocation(line: 168, column: 20, scope: !1849)
!1864 = !DILocation(line: 168, column: 28, scope: !1849)
!1865 = !DILocation(line: 170, column: 5, scope: !1808)
!1866 = !DILocation(line: 171, column: 9, scope: !1867)
!1867 = distinct !DILexicalBlock(scope: !1794, file: !972, line: 171, column: 9)
!1868 = !DILocation(line: 171, column: 12, scope: !1867)
!1869 = !DILocation(line: 171, column: 25, scope: !1867)
!1870 = !DILocation(line: 171, column: 56, scope: !1867)
!1871 = !DILocation(line: 172, column: 9, scope: !1867)
!1872 = !DILocation(line: 172, column: 12, scope: !1867)
!1873 = !DILocation(line: 172, column: 25, scope: !1867)
!1874 = !DILocation(line: 171, column: 9, scope: !1875)
!1875 = !DILexicalBlockFile(scope: !1794, file: !972, discriminator: 1)
!1876 = !DILocation(line: 173, column: 9, scope: !1877)
!1877 = distinct !DILexicalBlock(scope: !1867, file: !972, line: 172, column: 61)
!1878 = !DILocation(line: 173, column: 12, scope: !1877)
!1879 = !DILocation(line: 173, column: 25, scope: !1877)
!1880 = !DILocation(line: 174, column: 5, scope: !1877)
!1881 = !DILocation(line: 175, column: 5, scope: !1794)
!1882 = !DILocation(line: 175, column: 8, scope: !1794)
!1883 = !DILocation(line: 175, column: 18, scope: !1794)
!1884 = !DILocation(line: 176, column: 5, scope: !1794)
!1885 = !DILocation(line: 176, column: 8, scope: !1794)
!1886 = !DILocation(line: 176, column: 23, scope: !1794)
!1887 = !DILocation(line: 177, column: 15, scope: !1794)
!1888 = !DILocation(line: 177, column: 5, scope: !1794)
!1889 = !DILocation(line: 177, column: 8, scope: !1794)
!1890 = !DILocation(line: 177, column: 12, scope: !1794)
!1891 = !DILocation(line: 178, column: 1, scope: !1794)
!1892 = distinct !DISubprogram(name: "avio_seek", scope: !972, file: !972, line: 246, type: !1893, isLocal: false, isDefinition: true, scopeLine: 247, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1124)
!1893 = !DISubroutineType(types: !1894)
!1894 = !{!951, !1057, !951, !954}
!1895 = !DILocalVariable(name: "s", arg: 1, scope: !1892, file: !972, line: 246, type: !1057)
!1896 = !DILocation(line: 246, column: 32, scope: !1892)
!1897 = !DILocalVariable(name: "offset", arg: 2, scope: !1892, file: !972, line: 246, type: !951)
!1898 = !DILocation(line: 246, column: 43, scope: !1892)
!1899 = !DILocalVariable(name: "whence", arg: 3, scope: !1892, file: !972, line: 246, type: !954)
!1900 = !DILocation(line: 246, column: 55, scope: !1892)
!1901 = !DILocalVariable(name: "offset1", scope: !1892, file: !972, line: 248, type: !951)
!1902 = !DILocation(line: 248, column: 13, scope: !1892)
!1903 = !DILocalVariable(name: "pos", scope: !1892, file: !972, line: 249, type: !951)
!1904 = !DILocation(line: 249, column: 13, scope: !1892)
!1905 = !DILocalVariable(name: "force", scope: !1892, file: !972, line: 250, type: !954)
!1906 = !DILocation(line: 250, column: 9, scope: !1892)
!1907 = !DILocation(line: 250, column: 17, scope: !1892)
!1908 = !DILocation(line: 250, column: 24, scope: !1892)
!1909 = !DILocalVariable(name: "buffer_size", scope: !1892, file: !972, line: 251, type: !954)
!1910 = !DILocation(line: 251, column: 9, scope: !1892)
!1911 = !DILocalVariable(name: "short_seek", scope: !1892, file: !972, line: 252, type: !954)
!1912 = !DILocation(line: 252, column: 9, scope: !1892)
!1913 = !DILocation(line: 253, column: 12, scope: !1892)
!1914 = !DILocation(line: 255, column: 9, scope: !1915)
!1915 = distinct !DILexicalBlock(scope: !1892, file: !972, line: 255, column: 8)
!1916 = !DILocation(line: 255, column: 8, scope: !1892)
!1917 = !DILocation(line: 256, column: 9, scope: !1915)
!1918 = !DILocation(line: 258, column: 19, scope: !1892)
!1919 = !DILocation(line: 258, column: 22, scope: !1892)
!1920 = !DILocation(line: 258, column: 32, scope: !1892)
!1921 = !DILocation(line: 258, column: 35, scope: !1892)
!1922 = !DILocation(line: 258, column: 30, scope: !1892)
!1923 = !DILocation(line: 258, column: 17, scope: !1892)
!1924 = !DILocation(line: 260, column: 11, scope: !1892)
!1925 = !DILocation(line: 260, column: 14, scope: !1892)
!1926 = !DILocation(line: 260, column: 21, scope: !1892)
!1927 = !DILocation(line: 260, column: 24, scope: !1892)
!1928 = !DILocation(line: 260, column: 21, scope: !1929)
!1929 = !DILexicalBlockFile(scope: !1892, file: !972, discriminator: 1)
!1930 = !DILocation(line: 260, column: 41, scope: !1931)
!1931 = !DILexicalBlockFile(scope: !1892, file: !972, discriminator: 2)
!1932 = !DILocation(line: 260, column: 21, scope: !1931)
!1933 = !DILocation(line: 260, column: 21, scope: !1934)
!1934 = !DILexicalBlockFile(scope: !1892, file: !972, discriminator: 3)
!1935 = !DILocation(line: 260, column: 20, scope: !1934)
!1936 = !DILocation(line: 260, column: 18, scope: !1934)
!1937 = !DILocation(line: 260, column: 9, scope: !1934)
!1938 = !DILocation(line: 262, column: 9, scope: !1939)
!1939 = distinct !DILexicalBlock(scope: !1892, file: !972, line: 262, column: 9)
!1940 = !DILocation(line: 262, column: 16, scope: !1939)
!1941 = !DILocation(line: 262, column: 27, scope: !1939)
!1942 = !DILocation(line: 262, column: 30, scope: !1943)
!1943 = !DILexicalBlockFile(scope: !1939, file: !972, discriminator: 1)
!1944 = !DILocation(line: 262, column: 37, scope: !1943)
!1945 = !DILocation(line: 262, column: 9, scope: !1943)
!1946 = !DILocation(line: 263, column: 9, scope: !1939)
!1947 = !DILocation(line: 265, column: 9, scope: !1948)
!1948 = distinct !DILexicalBlock(scope: !1892, file: !972, line: 265, column: 9)
!1949 = !DILocation(line: 265, column: 16, scope: !1948)
!1950 = !DILocation(line: 265, column: 9, scope: !1892)
!1951 = !DILocation(line: 266, column: 19, scope: !1952)
!1952 = distinct !DILexicalBlock(scope: !1948, file: !972, line: 265, column: 28)
!1953 = !DILocation(line: 266, column: 26, scope: !1952)
!1954 = !DILocation(line: 266, column: 29, scope: !1952)
!1955 = !DILocation(line: 266, column: 39, scope: !1952)
!1956 = !DILocation(line: 266, column: 42, scope: !1952)
!1957 = !DILocation(line: 266, column: 37, scope: !1952)
!1958 = !DILocation(line: 266, column: 23, scope: !1952)
!1959 = !DILocation(line: 266, column: 17, scope: !1952)
!1960 = !DILocation(line: 267, column: 13, scope: !1961)
!1961 = distinct !DILexicalBlock(scope: !1952, file: !972, line: 267, column: 13)
!1962 = !DILocation(line: 267, column: 20, scope: !1961)
!1963 = !DILocation(line: 267, column: 13, scope: !1952)
!1964 = !DILocation(line: 268, column: 20, scope: !1961)
!1965 = !DILocation(line: 268, column: 13, scope: !1961)
!1966 = !DILocation(line: 269, column: 13, scope: !1967)
!1967 = distinct !DILexicalBlock(scope: !1952, file: !972, line: 269, column: 13)
!1968 = !DILocation(line: 269, column: 33, scope: !1967)
!1969 = !DILocation(line: 269, column: 31, scope: !1967)
!1970 = !DILocation(line: 269, column: 20, scope: !1967)
!1971 = !DILocation(line: 269, column: 13, scope: !1952)
!1972 = !DILocation(line: 270, column: 13, scope: !1967)
!1973 = !DILocation(line: 271, column: 19, scope: !1952)
!1974 = !DILocation(line: 271, column: 16, scope: !1952)
!1975 = !DILocation(line: 272, column: 5, scope: !1952)
!1976 = !DILocation(line: 273, column: 9, scope: !1977)
!1977 = distinct !DILexicalBlock(scope: !1892, file: !972, line: 273, column: 9)
!1978 = !DILocation(line: 273, column: 16, scope: !1977)
!1979 = !DILocation(line: 273, column: 9, scope: !1892)
!1980 = !DILocation(line: 274, column: 9, scope: !1977)
!1981 = !DILocation(line: 276, column: 9, scope: !1982)
!1982 = distinct !DILexicalBlock(scope: !1892, file: !972, line: 276, column: 9)
!1983 = !DILocation(line: 276, column: 12, scope: !1982)
!1984 = !DILocation(line: 276, column: 9, scope: !1892)
!1985 = !DILocation(line: 277, column: 22, scope: !1986)
!1986 = distinct !DILexicalBlock(scope: !1982, file: !972, line: 276, column: 28)
!1987 = !DILocation(line: 277, column: 25, scope: !1986)
!1988 = !DILocation(line: 277, column: 40, scope: !1986)
!1989 = !DILocation(line: 277, column: 43, scope: !1986)
!1990 = !DILocation(line: 277, column: 20, scope: !1986)
!1991 = !DILocation(line: 279, column: 13, scope: !1992)
!1992 = distinct !DILexicalBlock(scope: !1986, file: !972, line: 279, column: 13)
!1993 = !DILocation(line: 279, column: 24, scope: !1992)
!1994 = !DILocation(line: 279, column: 13, scope: !1986)
!1995 = !DILocation(line: 280, column: 26, scope: !1992)
!1996 = !DILocation(line: 280, column: 29, scope: !1992)
!1997 = !DILocation(line: 280, column: 24, scope: !1992)
!1998 = !DILocation(line: 280, column: 13, scope: !1992)
!1999 = !DILocation(line: 281, column: 5, scope: !1986)
!2000 = !DILocation(line: 282, column: 22, scope: !1982)
!2001 = !DILocation(line: 282, column: 25, scope: !1982)
!2002 = !DILocation(line: 282, column: 20, scope: !1982)
!2003 = !DILocation(line: 284, column: 15, scope: !1892)
!2004 = !DILocation(line: 284, column: 24, scope: !1892)
!2005 = !DILocation(line: 284, column: 22, scope: !1892)
!2006 = !DILocation(line: 284, column: 13, scope: !1892)
!2007 = !DILocation(line: 285, column: 24, scope: !1892)
!2008 = !DILocation(line: 285, column: 27, scope: !1892)
!2009 = !DILocation(line: 285, column: 43, scope: !1892)
!2010 = !DILocation(line: 285, column: 46, scope: !1892)
!2011 = !DILocation(line: 285, column: 40, scope: !1892)
!2012 = !DILocation(line: 285, column: 23, scope: !1892)
!2013 = !DILocation(line: 285, column: 58, scope: !1929)
!2014 = !DILocation(line: 285, column: 61, scope: !1929)
!2015 = !DILocation(line: 285, column: 23, scope: !1929)
!2016 = !DILocation(line: 285, column: 77, scope: !1931)
!2017 = !DILocation(line: 285, column: 80, scope: !1931)
!2018 = !DILocation(line: 285, column: 23, scope: !1931)
!2019 = !DILocation(line: 285, column: 23, scope: !1934)
!2020 = !DILocation(line: 285, column: 5, scope: !1934)
!2021 = !DILocation(line: 285, column: 8, scope: !1934)
!2022 = !DILocation(line: 285, column: 20, scope: !1934)
!2023 = !DILocation(line: 286, column: 11, scope: !2024)
!2024 = distinct !DILexicalBlock(scope: !1892, file: !972, line: 286, column: 9)
!2025 = !DILocation(line: 286, column: 14, scope: !2024)
!2026 = !DILocation(line: 286, column: 21, scope: !2024)
!2027 = !DILocation(line: 286, column: 25, scope: !2028)
!2028 = !DILexicalBlockFile(scope: !2024, file: !972, discriminator: 1)
!2029 = !DILocation(line: 286, column: 28, scope: !2028)
!2030 = !DILocation(line: 286, column: 34, scope: !2028)
!2031 = !DILocation(line: 287, column: 9, scope: !2024)
!2032 = !DILocation(line: 287, column: 17, scope: !2024)
!2033 = !DILocation(line: 287, column: 22, scope: !2024)
!2034 = !DILocation(line: 287, column: 25, scope: !2028)
!2035 = !DILocation(line: 287, column: 37, scope: !2028)
!2036 = !DILocation(line: 287, column: 40, scope: !2028)
!2037 = !DILocation(line: 287, column: 53, scope: !2038)
!2038 = !DILexicalBlockFile(scope: !2024, file: !972, discriminator: 2)
!2039 = !DILocation(line: 287, column: 56, scope: !2038)
!2040 = !DILocation(line: 287, column: 70, scope: !2038)
!2041 = !DILocation(line: 287, column: 73, scope: !2038)
!2042 = !DILocation(line: 287, column: 68, scope: !2038)
!2043 = !DILocation(line: 287, column: 37, scope: !2038)
!2044 = !DILocation(line: 287, column: 82, scope: !2045)
!2045 = !DILexicalBlockFile(scope: !2024, file: !972, discriminator: 3)
!2046 = !DILocation(line: 287, column: 37, scope: !2045)
!2047 = !DILocation(line: 287, column: 37, scope: !2048)
!2048 = !DILexicalBlockFile(scope: !2024, file: !972, discriminator: 4)
!2049 = !DILocation(line: 287, column: 33, scope: !2048)
!2050 = !DILocation(line: 286, column: 9, scope: !1931)
!2051 = !DILocation(line: 289, column: 22, scope: !2052)
!2052 = distinct !DILexicalBlock(scope: !2024, file: !972, line: 287, column: 96)
!2053 = !DILocation(line: 289, column: 25, scope: !2052)
!2054 = !DILocation(line: 289, column: 34, scope: !2052)
!2055 = !DILocation(line: 289, column: 32, scope: !2052)
!2056 = !DILocation(line: 289, column: 9, scope: !2052)
!2057 = !DILocation(line: 289, column: 12, scope: !2052)
!2058 = !DILocation(line: 289, column: 20, scope: !2052)
!2059 = !DILocation(line: 290, column: 5, scope: !2052)
!2060 = !DILocation(line: 290, column: 19, scope: !2061)
!2061 = !DILexicalBlockFile(scope: !2062, file: !972, discriminator: 1)
!2062 = distinct !DILexicalBlock(scope: !2024, file: !972, line: 290, column: 16)
!2063 = !DILocation(line: 290, column: 22, scope: !2061)
!2064 = !DILocation(line: 290, column: 31, scope: !2061)
!2065 = !DILocation(line: 290, column: 43, scope: !2061)
!2066 = !DILocation(line: 291, column: 16, scope: !2062)
!2067 = !DILocation(line: 291, column: 27, scope: !2062)
!2068 = !DILocation(line: 291, column: 41, scope: !2062)
!2069 = !DILocation(line: 291, column: 39, scope: !2062)
!2070 = !DILocation(line: 291, column: 24, scope: !2062)
!2071 = !DILocation(line: 291, column: 53, scope: !2062)
!2072 = !DILocation(line: 292, column: 17, scope: !2062)
!2073 = !DILocation(line: 292, column: 20, scope: !2062)
!2074 = !DILocation(line: 292, column: 31, scope: !2062)
!2075 = !DILocation(line: 292, column: 34, scope: !2061)
!2076 = !DILocation(line: 292, column: 42, scope: !2061)
!2077 = !DILocation(line: 292, column: 47, scope: !2061)
!2078 = !DILocation(line: 293, column: 18, scope: !2062)
!2079 = !DILocation(line: 293, column: 21, scope: !2062)
!2080 = !DILocation(line: 293, column: 28, scope: !2062)
!2081 = !DILocation(line: 293, column: 32, scope: !2061)
!2082 = !DILocation(line: 293, column: 35, scope: !2061)
!2083 = !DILocation(line: 293, column: 41, scope: !2061)
!2084 = !DILocation(line: 294, column: 16, scope: !2062)
!2085 = !DILocation(line: 294, column: 23, scope: !2062)
!2086 = !DILocation(line: 294, column: 34, scope: !2062)
!2087 = !DILocation(line: 294, column: 37, scope: !2061)
!2088 = !DILocation(line: 290, column: 16, scope: !2038)
!2089 = !DILocation(line: 295, column: 9, scope: !2090)
!2090 = distinct !DILexicalBlock(scope: !2062, file: !972, line: 294, column: 45)
!2091 = !DILocation(line: 295, column: 15, scope: !2092)
!2092 = !DILexicalBlockFile(scope: !2090, file: !972, discriminator: 1)
!2093 = !DILocation(line: 295, column: 18, scope: !2092)
!2094 = !DILocation(line: 295, column: 24, scope: !2092)
!2095 = !DILocation(line: 295, column: 22, scope: !2092)
!2096 = !DILocation(line: 295, column: 31, scope: !2092)
!2097 = !DILocation(line: 295, column: 35, scope: !2098)
!2098 = !DILexicalBlockFile(scope: !2090, file: !972, discriminator: 2)
!2099 = !DILocation(line: 295, column: 38, scope: !2098)
!2100 = !DILocation(line: 295, column: 34, scope: !2098)
!2101 = !DILocation(line: 295, column: 9, scope: !2102)
!2102 = !DILexicalBlockFile(scope: !2090, file: !972, discriminator: 3)
!2103 = !DILocation(line: 296, column: 25, scope: !2090)
!2104 = !DILocation(line: 296, column: 13, scope: !2090)
!2105 = !DILocation(line: 295, column: 9, scope: !2106)
!2106 = !DILexicalBlockFile(scope: !2090, file: !972, discriminator: 4)
!2107 = distinct !{!2107, !2089}
!2108 = !DILocation(line: 297, column: 13, scope: !2109)
!2109 = distinct !DILexicalBlock(scope: !2090, file: !972, line: 297, column: 13)
!2110 = !DILocation(line: 297, column: 16, scope: !2109)
!2111 = !DILocation(line: 297, column: 13, scope: !2090)
!2112 = !DILocation(line: 298, column: 13, scope: !2109)
!2113 = !DILocation(line: 299, column: 22, scope: !2090)
!2114 = !DILocation(line: 299, column: 25, scope: !2090)
!2115 = !DILocation(line: 299, column: 36, scope: !2090)
!2116 = !DILocation(line: 299, column: 39, scope: !2090)
!2117 = !DILocation(line: 299, column: 45, scope: !2090)
!2118 = !DILocation(line: 299, column: 43, scope: !2090)
!2119 = !DILocation(line: 299, column: 33, scope: !2090)
!2120 = !DILocation(line: 299, column: 9, scope: !2090)
!2121 = !DILocation(line: 299, column: 12, scope: !2090)
!2122 = !DILocation(line: 299, column: 20, scope: !2090)
!2123 = !DILocation(line: 300, column: 5, scope: !2090)
!2124 = !DILocation(line: 300, column: 16, scope: !2125)
!2125 = !DILexicalBlockFile(scope: !2126, file: !972, discriminator: 1)
!2126 = distinct !DILexicalBlock(scope: !2062, file: !972, line: 300, column: 15)
!2127 = !DILocation(line: 300, column: 19, scope: !2125)
!2128 = !DILocation(line: 300, column: 30, scope: !2125)
!2129 = !DILocation(line: 300, column: 33, scope: !2130)
!2130 = !DILexicalBlockFile(scope: !2126, file: !972, discriminator: 2)
!2131 = !DILocation(line: 300, column: 41, scope: !2130)
!2132 = !DILocation(line: 300, column: 45, scope: !2130)
!2133 = !DILocation(line: 300, column: 49, scope: !2134)
!2134 = !DILexicalBlockFile(scope: !2126, file: !972, discriminator: 3)
!2135 = !DILocation(line: 300, column: 48, scope: !2134)
!2136 = !DILocation(line: 300, column: 59, scope: !2134)
!2137 = !DILocation(line: 300, column: 70, scope: !2134)
!2138 = !DILocation(line: 300, column: 57, scope: !2134)
!2139 = !DILocation(line: 300, column: 74, scope: !2134)
!2140 = !DILocation(line: 300, column: 77, scope: !2141)
!2141 = !DILexicalBlockFile(scope: !2126, file: !972, discriminator: 4)
!2142 = !DILocation(line: 300, column: 80, scope: !2141)
!2143 = !DILocation(line: 300, column: 85, scope: !2141)
!2144 = !DILocation(line: 300, column: 88, scope: !2145)
!2145 = !DILexicalBlockFile(scope: !2126, file: !972, discriminator: 5)
!2146 = !DILocation(line: 300, column: 95, scope: !2145)
!2147 = !DILocation(line: 300, column: 15, scope: !2145)
!2148 = !DILocalVariable(name: "res", scope: !2149, file: !972, line: 301, type: !951)
!2149 = distinct !DILexicalBlock(scope: !2126, file: !972, line: 300, column: 100)
!2150 = !DILocation(line: 301, column: 17, scope: !2149)
!2151 = !DILocation(line: 303, column: 18, scope: !2149)
!2152 = !DILocation(line: 303, column: 29, scope: !2149)
!2153 = !DILocation(line: 303, column: 17, scope: !2149)
!2154 = !DILocation(line: 303, column: 37, scope: !2149)
!2155 = !DILocation(line: 303, column: 34, scope: !2149)
!2156 = !DILocation(line: 303, column: 45, scope: !2157)
!2157 = !DILexicalBlockFile(scope: !2149, file: !972, discriminator: 1)
!2158 = !DILocation(line: 303, column: 17, scope: !2157)
!2159 = !DILocation(line: 303, column: 53, scope: !2160)
!2160 = !DILexicalBlockFile(scope: !2149, file: !972, discriminator: 2)
!2161 = !DILocation(line: 303, column: 64, scope: !2160)
!2162 = !DILocation(line: 303, column: 52, scope: !2160)
!2163 = !DILocation(line: 303, column: 17, scope: !2160)
!2164 = !DILocation(line: 303, column: 17, scope: !2165)
!2165 = !DILexicalBlockFile(scope: !2149, file: !972, discriminator: 3)
!2166 = !DILocation(line: 303, column: 13, scope: !2165)
!2167 = !DILocation(line: 304, column: 20, scope: !2168)
!2168 = distinct !DILexicalBlock(scope: !2149, file: !972, line: 304, column: 13)
!2169 = !DILocation(line: 304, column: 23, scope: !2168)
!2170 = !DILocation(line: 304, column: 28, scope: !2168)
!2171 = !DILocation(line: 304, column: 31, scope: !2168)
!2172 = !DILocation(line: 304, column: 39, scope: !2168)
!2173 = !DILocation(line: 304, column: 18, scope: !2168)
!2174 = !DILocation(line: 304, column: 54, scope: !2168)
!2175 = !DILocation(line: 304, column: 13, scope: !2149)
!2176 = !DILocation(line: 305, column: 20, scope: !2168)
!2177 = !DILocation(line: 305, column: 13, scope: !2168)
!2178 = !DILocation(line: 307, column: 22, scope: !2149)
!2179 = !DILocation(line: 307, column: 25, scope: !2149)
!2180 = !DILocation(line: 307, column: 9, scope: !2149)
!2181 = !DILocation(line: 307, column: 12, scope: !2149)
!2182 = !DILocation(line: 307, column: 20, scope: !2149)
!2183 = !DILocation(line: 306, column: 9, scope: !2149)
!2184 = !DILocation(line: 306, column: 12, scope: !2149)
!2185 = !DILocation(line: 306, column: 20, scope: !2149)
!2186 = !DILocation(line: 308, column: 18, scope: !2149)
!2187 = !DILocation(line: 308, column: 9, scope: !2149)
!2188 = !DILocation(line: 308, column: 12, scope: !2149)
!2189 = !DILocation(line: 308, column: 16, scope: !2149)
!2190 = !DILocation(line: 309, column: 9, scope: !2149)
!2191 = !DILocation(line: 309, column: 12, scope: !2149)
!2192 = !DILocation(line: 309, column: 24, scope: !2149)
!2193 = !DILocation(line: 310, column: 21, scope: !2149)
!2194 = !DILocation(line: 310, column: 9, scope: !2149)
!2195 = !DILocation(line: 311, column: 26, scope: !2149)
!2196 = !DILocation(line: 311, column: 29, scope: !2149)
!2197 = !DILocation(line: 311, column: 47, scope: !2149)
!2198 = !DILocation(line: 311, column: 45, scope: !2149)
!2199 = !DILocation(line: 311, column: 16, scope: !2149)
!2200 = !DILocation(line: 311, column: 9, scope: !2149)
!2201 = !DILocalVariable(name: "res", scope: !2202, file: !972, line: 313, type: !951)
!2202 = distinct !DILexicalBlock(scope: !2126, file: !972, line: 312, column: 12)
!2203 = !DILocation(line: 313, column: 17, scope: !2202)
!2204 = !DILocation(line: 314, column: 13, scope: !2205)
!2205 = distinct !DILexicalBlock(scope: !2202, file: !972, line: 314, column: 13)
!2206 = !DILocation(line: 314, column: 16, scope: !2205)
!2207 = !DILocation(line: 314, column: 13, scope: !2202)
!2208 = !DILocation(line: 315, column: 26, scope: !2209)
!2209 = distinct !DILexicalBlock(scope: !2205, file: !972, line: 314, column: 28)
!2210 = !DILocation(line: 315, column: 13, scope: !2209)
!2211 = !DILocation(line: 316, column: 9, scope: !2209)
!2212 = !DILocation(line: 317, column: 14, scope: !2213)
!2213 = distinct !DILexicalBlock(scope: !2202, file: !972, line: 317, column: 13)
!2214 = !DILocation(line: 317, column: 17, scope: !2213)
!2215 = !DILocation(line: 317, column: 13, scope: !2202)
!2216 = !DILocation(line: 318, column: 13, scope: !2213)
!2217 = !DILocation(line: 319, column: 20, scope: !2218)
!2218 = distinct !DILexicalBlock(scope: !2202, file: !972, line: 319, column: 13)
!2219 = !DILocation(line: 319, column: 23, scope: !2218)
!2220 = !DILocation(line: 319, column: 28, scope: !2218)
!2221 = !DILocation(line: 319, column: 31, scope: !2218)
!2222 = !DILocation(line: 319, column: 39, scope: !2218)
!2223 = !DILocation(line: 319, column: 18, scope: !2218)
!2224 = !DILocation(line: 319, column: 57, scope: !2218)
!2225 = !DILocation(line: 319, column: 13, scope: !2202)
!2226 = !DILocation(line: 320, column: 20, scope: !2218)
!2227 = !DILocation(line: 320, column: 13, scope: !2218)
!2228 = !DILocation(line: 321, column: 9, scope: !2202)
!2229 = !DILocation(line: 321, column: 12, scope: !2202)
!2230 = !DILocation(line: 321, column: 23, scope: !2202)
!2231 = !DILocation(line: 322, column: 14, scope: !2232)
!2232 = distinct !DILexicalBlock(scope: !2202, file: !972, line: 322, column: 13)
!2233 = !DILocation(line: 322, column: 17, scope: !2232)
!2234 = !DILocation(line: 322, column: 13, scope: !2202)
!2235 = !DILocation(line: 323, column: 26, scope: !2232)
!2236 = !DILocation(line: 323, column: 29, scope: !2232)
!2237 = !DILocation(line: 323, column: 13, scope: !2232)
!2238 = !DILocation(line: 323, column: 16, scope: !2232)
!2239 = !DILocation(line: 323, column: 24, scope: !2232)
!2240 = !DILocation(line: 324, column: 39, scope: !2202)
!2241 = !DILocation(line: 324, column: 42, scope: !2202)
!2242 = !DILocation(line: 324, column: 22, scope: !2202)
!2243 = !DILocation(line: 324, column: 25, scope: !2202)
!2244 = !DILocation(line: 324, column: 37, scope: !2202)
!2245 = !DILocation(line: 324, column: 9, scope: !2202)
!2246 = !DILocation(line: 324, column: 12, scope: !2202)
!2247 = !DILocation(line: 324, column: 20, scope: !2202)
!2248 = !DILocation(line: 325, column: 18, scope: !2202)
!2249 = !DILocation(line: 325, column: 9, scope: !2202)
!2250 = !DILocation(line: 325, column: 12, scope: !2202)
!2251 = !DILocation(line: 325, column: 16, scope: !2202)
!2252 = !DILocation(line: 327, column: 5, scope: !1892)
!2253 = !DILocation(line: 327, column: 8, scope: !1892)
!2254 = !DILocation(line: 327, column: 20, scope: !1892)
!2255 = !DILocation(line: 328, column: 12, scope: !1892)
!2256 = !DILocation(line: 328, column: 5, scope: !1892)
!2257 = !DILocation(line: 329, column: 1, scope: !1892)
!2258 = distinct !DISubprogram(name: "fill_buffer", scope: !972, file: !972, line: 549, type: !1517, isLocal: true, isDefinition: true, scopeLine: 550, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1124)
!2259 = !DILocalVariable(name: "s", arg: 1, scope: !2258, file: !972, line: 549, type: !1057)
!2260 = !DILocation(line: 549, column: 38, scope: !2258)
!2261 = !DILocalVariable(name: "max_buffer_size", scope: !2258, file: !972, line: 551, type: !954)
!2262 = !DILocation(line: 551, column: 9, scope: !2258)
