; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpdec_g726.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpdec_g726.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RTPDynamicProtocolHandler = type { i8*, i32, i32, i32, i32, i32, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, i32, %struct.PayloadContext*, i8*)*, void (%struct.PayloadContext*)*, i32 (%struct.AVFormatContext*, %struct.PayloadContext*, %struct.AVStream*, %struct.AVPacket*, i32*, i8*, i32, i16, i32)*, i32 (%struct.PayloadContext*)*, %struct.RTPDynamicProtocolHandler* }

!850 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12BE", value: 189)
!851 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12LE", value: 190)
!852 = !DIEnumerator(name: "AV_PIX_FMT_NB", value: 191)
!853 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSampleFormat", file: !854, line: 58, size: 32, align: 32, elements: !855)
!854 = !DIFile(filename: "./libavutil/samplefmt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!855 = !{!856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869}
!856 = !DIEnumerator(name: "AV_SAMPLE_FMT_NONE", value: -1)
!857 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8", value: 0)
!858 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16", value: 1)
!859 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32", value: 2)
!860 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLT", value: 3)
!861 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBL", value: 4)
!862 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8P", value: 5)
!863 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16P", value: 6)
!864 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32P", value: 7)
!865 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLTP", value: 8)
!866 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBLP", value: 9)
!867 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64", value: 10)
!868 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!869 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !871)
!871 = !{!872, !873, !874, !875}
!872 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!873 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!874 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!875 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!876 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !877)
!877 = !{!878, !879, !880, !881, !882, !883}
!878 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!879 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!880 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!881 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!882 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!883 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892, !893, !894, !895}
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!894 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!895 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !897)
!897 = !{!898, !899, !900, !901, !902, !903, !904}
!898 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!899 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!900 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!901 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!902 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!903 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!904 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !14, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !474, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !2089, !2090, !2091, !2092, !2093, !2094, !2095}
!917 = distinct !DIGlobalVariable(name: "ff_g726_16_dynamic_handler", scope: !0, file: !918, line: 51, type: !919, isLocal: false, isDefinition: true, variable: %struct.RTPDynamicProtocolHandler* @ff_g726_16_dynamic_handler)
!918 = !DIFile(filename: "libavformat/rtpdec_g726.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTPDynamicProtocolHandler", file: !921, line: 33, baseType: !922)
!921 = !DIFile(filename: "libavformat/rtpdec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RTPDynamicProtocolHandler", file: !921, line: 115, size: 640, align: 64, elements: !923)
!923 = !{!924, !928, !929, !930, !931, !933, !934, !2069, !2073, !2077, !2083, !2087}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "enc_name", scope: !922, file: !921, line: 116, baseType: !925, size: 64, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !922, file: !921, line: 117, baseType: !3, size: 32, align: 32, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !922, file: !921, line: 118, baseType: !13, size: 32, align: 32, offset: 96)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "need_parsing", scope: !922, file: !921, line: 119, baseType: !473, size: 32, align: 32, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "static_payload_id", scope: !922, file: !921, line: 120, baseType: !932, size: 32, align: 32, offset: 160)
!932 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !922, file: !921, line: 123, baseType: !932, size: 32, align: 32, offset: 192)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !922, file: !921, line: 126, baseType: !935, size: 64, align: 64, offset: 256)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!932, !938, !932, !2066}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !474, line: 1947, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !474, line: 1337, size: 11968, align: 64, elements: !941)
!941 = !{!942, !984, !1094, !1243, !1244, !1309, !1310, !1311, !1943, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1997, !1998, !1999, !2000, !2001, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2032, !2033, !2036, !2037, !2038, !2039, !2040, !2041, !2043, !2044, !2045, !2046, !2054, !2055, !2059, !2063, !2064, !2065}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !940, file: !474, line: 1342, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !483, line: 143, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !483, line: 67, size: 640, align: 64, elements: !947)
!947 = !{!948, !949, !954, !958, !959, !960, !961, !965, !971, !973, !977}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !946, file: !483, line: 72, baseType: !925, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !946, file: !483, line: 78, baseType: !950, size: 64, align: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!925, !953}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !946, file: !483, line: 85, baseType: !955, size: 64, align: 64, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !483, line: 85, flags: DIFlagFwdDecl)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !946, file: !483, line: 93, baseType: !932, size: 32, align: 32, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !946, file: !483, line: 99, baseType: !932, size: 32, align: 32, offset: 224)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !946, file: !483, line: 108, baseType: !932, size: 32, align: 32, offset: 256)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !946, file: !483, line: 113, baseType: !962, size: 64, align: 64, offset: 320)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!953, !953, !953}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !946, file: !483, line: 123, baseType: !966, size: 64, align: 64, offset: 384)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!969, !969}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !946, file: !483, line: 130, baseType: !972, size: 32, align: 32, offset: 448)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !483, line: 48, baseType: !482)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !946, file: !483, line: 136, baseType: !974, size: 64, align: 64, offset: 512)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!972, !953}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !946, file: !483, line: 142, baseType: !978, size: 64, align: 64, offset: 576)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!932, !981, !953, !925, !932}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !483, line: 60, flags: DIFlagFwdDecl)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !940, file: !474, line: 1349, baseType: !985, size: 64, align: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !474, line: 633, size: 1344, align: 64, elements: !987)
!987 = !{!988, !989, !990, !991, !992, !998, !999, !1000, !1001, !1002, !1003, !1017, !1022, !1065, !1066, !1070, !1075, !1076, !1077, !1081, !1087, !1093}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !986, file: !474, line: 638, baseType: !925, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !986, file: !474, line: 645, baseType: !925, size: 64, align: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !986, file: !474, line: 652, baseType: !932, size: 32, align: 32, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !986, file: !474, line: 659, baseType: !925, size: 64, align: 64, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !986, file: !474, line: 661, baseType: !993, size: 64, align: 64, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !474, line: 443, flags: DIFlagFwdDecl)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !986, file: !474, line: 663, baseType: !943, size: 64, align: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !986, file: !474, line: 670, baseType: !925, size: 64, align: 64, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !986, file: !474, line: 679, baseType: !985, size: 64, align: 64, offset: 448)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !986, file: !474, line: 684, baseType: !932, size: 32, align: 32, offset: 512)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !986, file: !474, line: 689, baseType: !932, size: 32, align: 32, offset: 544)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !986, file: !474, line: 696, baseType: !1004, size: 64, align: 64, offset: 576)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!932, !1007}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !474, line: 453, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !474, line: 448, size: 256, align: 64, elements: !1010)
!1010 = !{!1011, !1012, !1015, !1016}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1009, file: !474, line: 449, baseType: !925, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1009, file: !474, line: 450, baseType: !1013, size: 64, align: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1009, file: !474, line: 451, baseType: !932, size: 32, align: 32, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1009, file: !474, line: 452, baseType: !925, size: 64, align: 64, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !986, file: !474, line: 703, baseType: !1018, size: 64, align: 64, offset: 640)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!932, !1021}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !986, file: !474, line: 714, baseType: !1023, size: 64, align: 64, offset: 704)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!932, !1021, !1026}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1029)
!1029 = !{!1030, !1045, !1048, !1049, !1050, !1051, !1052, !1053, !1061, !1062, !1063, !1064}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1028, file: !14, line: 1451, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1033, line: 94, baseType: !1034)
!1033 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1033, line: 81, size: 192, align: 64, elements: !1035)
!1035 = !{!1036, !1040, !1044}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1034, file: !1033, line: 82, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1033, line: 73, baseType: !1039)
!1039 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1033, line: 73, flags: DIFlagFwdDecl)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1034, file: !1033, line: 89, baseType: !1041, size: 64, align: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1043, line: 48, baseType: !1014)
!1043 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1034, file: !1033, line: 93, baseType: !932, size: 32, align: 32, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1028, file: !14, line: 1461, baseType: !1046, size: 64, align: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1043, line: 40, baseType: !1047)
!1047 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1028, file: !14, line: 1467, baseType: !1046, size: 64, align: 64, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1028, file: !14, line: 1468, baseType: !1041, size: 64, align: 64, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1028, file: !14, line: 1469, baseType: !932, size: 32, align: 32, offset: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1028, file: !14, line: 1470, baseType: !932, size: 32, align: 32, offset: 288)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1028, file: !14, line: 1474, baseType: !932, size: 32, align: 32, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1028, file: !14, line: 1479, baseType: !1054, size: 64, align: 64, offset: 384)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1057)
!1057 = !{!1058, !1059, !1060}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1056, file: !14, line: 1412, baseType: !1041, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1056, file: !14, line: 1413, baseType: !932, size: 32, align: 32, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1056, file: !14, line: 1414, baseType: !503, size: 32, align: 32, offset: 96)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1028, file: !14, line: 1480, baseType: !932, size: 32, align: 32, offset: 448)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1028, file: !14, line: 1486, baseType: !1046, size: 64, align: 64, offset: 512)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1028, file: !14, line: 1488, baseType: !1046, size: 64, align: 64, offset: 576)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1028, file: !14, line: 1497, baseType: !1046, size: 64, align: 64, offset: 640)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !986, file: !474, line: 720, baseType: !1018, size: 64, align: 64, offset: 768)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !986, file: !474, line: 730, baseType: !1067, size: 64, align: 64, offset: 832)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!932, !1021, !932, !1046, !932}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !986, file: !474, line: 737, baseType: !1071, size: 64, align: 64, offset: 896)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!1046, !1021, !932, !1074, !1046}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !986, file: !474, line: 744, baseType: !1018, size: 64, align: 64, offset: 960)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !986, file: !474, line: 750, baseType: !1018, size: 64, align: 64, offset: 1024)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !986, file: !474, line: 758, baseType: !1078, size: 64, align: 64, offset: 1088)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!932, !1021, !932, !1046, !1046, !1046, !932}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !986, file: !474, line: 764, baseType: !1082, size: 64, align: 64, offset: 1152)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!932, !1021, !1085}
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !474, line: 328, flags: DIFlagFwdDecl)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !986, file: !474, line: 770, baseType: !1088, size: 64, align: 64, offset: 1216)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!932, !1021, !1091}
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !474, line: 329, flags: DIFlagFwdDecl)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !986, file: !474, line: 776, baseType: !1088, size: 64, align: 64, offset: 1280)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !940, file: !474, line: 1356, baseType: !1095, size: 64, align: 64, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !474, line: 497, size: 1600, align: 64, elements: !1097)
!1097 = !{!1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1117, !1121, !1125, !1132, !1228, !1229, !1230, !1231, !1232, !1233, !1237}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1096, file: !474, line: 498, baseType: !925, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1096, file: !474, line: 504, baseType: !925, size: 64, align: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1096, file: !474, line: 505, baseType: !925, size: 64, align: 64, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1096, file: !474, line: 506, baseType: !925, size: 64, align: 64, offset: 192)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1096, file: !474, line: 508, baseType: !13, size: 32, align: 32, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1096, file: !474, line: 509, baseType: !13, size: 32, align: 32, offset: 288)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1096, file: !474, line: 510, baseType: !13, size: 32, align: 32, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1096, file: !474, line: 517, baseType: !932, size: 32, align: 32, offset: 352)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1096, file: !474, line: 523, baseType: !993, size: 64, align: 64, offset: 384)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1096, file: !474, line: 526, baseType: !943, size: 64, align: 64, offset: 448)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1096, file: !474, line: 535, baseType: !1095, size: 64, align: 64, offset: 512)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1096, file: !474, line: 539, baseType: !932, size: 32, align: 32, offset: 576)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1096, file: !474, line: 541, baseType: !1018, size: 64, align: 64, offset: 640)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1096, file: !474, line: 549, baseType: !1023, size: 64, align: 64, offset: 704)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1096, file: !474, line: 550, baseType: !1018, size: 64, align: 64, offset: 768)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1096, file: !474, line: 554, baseType: !1114, size: 64, align: 64, offset: 832)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!932, !1021, !1026, !1026, !932}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1096, file: !474, line: 563, baseType: !1118, size: 64, align: 64, offset: 896)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!932, !13, !932}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1096, file: !474, line: 565, baseType: !1122, size: 64, align: 64, offset: 960)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{null, !1021, !932, !1074, !1074}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1096, file: !474, line: 570, baseType: !1126, size: 64, align: 64, offset: 1024)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!932, !1021, !932, !953, !1129}
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1130, line: 216, baseType: !1131)
!1130 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1131 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1096, file: !474, line: 581, baseType: !1133, size: 64, align: 64, offset: 1088)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!932, !1021, !932, !1136, !1227}
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !544, line: 646, baseType: !1139)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !544, line: 268, size: 4288, align: 64, elements: !1140)
!1140 = !{!1141, !1145, !1147, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1181, !1183, !1184, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1139, file: !544, line: 282, baseType: !1142, size: 512, align: 64)
!1142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1041, size: 512, align: 64, elements: !1143)
!1143 = !{!1144}
!1144 = !DISubrange(count: 8)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1139, file: !544, line: 299, baseType: !1146, size: 256, align: 32, offset: 512)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 256, align: 32, elements: !1143)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1139, file: !544, line: 315, baseType: !1148, size: 64, align: 64, offset: 768)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1139, file: !544, line: 326, baseType: !932, size: 32, align: 32, offset: 832)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1139, file: !544, line: 326, baseType: !932, size: 32, align: 32, offset: 864)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1139, file: !544, line: 334, baseType: !932, size: 32, align: 32, offset: 896)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1139, file: !544, line: 341, baseType: !932, size: 32, align: 32, offset: 928)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1139, file: !544, line: 346, baseType: !932, size: 32, align: 32, offset: 960)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1139, file: !544, line: 351, baseType: !533, size: 32, align: 32, offset: 992)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1139, file: !544, line: 356, baseType: !1156, size: 64, align: 32, offset: 1024)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1157, line: 61, baseType: !1158)
!1157 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1157, line: 58, size: 64, align: 32, elements: !1159)
!1159 = !{!1160, !1161}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1158, file: !1157, line: 59, baseType: !932, size: 32, align: 32)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1158, file: !1157, line: 60, baseType: !932, size: 32, align: 32, offset: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1139, file: !544, line: 361, baseType: !1046, size: 64, align: 64, offset: 1088)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1139, file: !544, line: 369, baseType: !1046, size: 64, align: 64, offset: 1152)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1139, file: !544, line: 377, baseType: !1046, size: 64, align: 64, offset: 1216)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1139, file: !544, line: 382, baseType: !932, size: 32, align: 32, offset: 1280)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1139, file: !544, line: 386, baseType: !932, size: 32, align: 32, offset: 1312)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1139, file: !544, line: 391, baseType: !932, size: 32, align: 32, offset: 1344)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1139, file: !544, line: 396, baseType: !953, size: 64, align: 64, offset: 1408)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1139, file: !544, line: 403, baseType: !1170, size: 512, align: 64, offset: 1472)
!1170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1171, size: 512, align: 64, elements: !1143)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1043, line: 55, baseType: !1131)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1139, file: !544, line: 410, baseType: !932, size: 32, align: 32, offset: 1984)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1139, file: !544, line: 415, baseType: !932, size: 32, align: 32, offset: 2016)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1139, file: !544, line: 420, baseType: !932, size: 32, align: 32, offset: 2048)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1139, file: !544, line: 425, baseType: !932, size: 32, align: 32, offset: 2080)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1139, file: !544, line: 435, baseType: !1046, size: 64, align: 64, offset: 2112)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1139, file: !544, line: 440, baseType: !932, size: 32, align: 32, offset: 2176)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1139, file: !544, line: 445, baseType: !1171, size: 64, align: 64, offset: 2240)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1139, file: !544, line: 459, baseType: !1180, size: 512, align: 64, offset: 2304)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1031, size: 512, align: 64, elements: !1143)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1139, file: !544, line: 473, baseType: !1182, size: 64, align: 64, offset: 2816)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1139, file: !544, line: 477, baseType: !932, size: 32, align: 32, offset: 2880)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1139, file: !544, line: 479, baseType: !1185, size: 64, align: 64, offset: 2944)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !544, line: 207, baseType: !1188)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !544, line: 201, size: 320, align: 64, elements: !1189)
!1189 = !{!1190, !1191, !1192, !1193, !1198}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1188, file: !544, line: 202, baseType: !543, size: 32, align: 32)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1188, file: !544, line: 203, baseType: !1041, size: 64, align: 64, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1188, file: !544, line: 204, baseType: !932, size: 32, align: 32, offset: 128)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1188, file: !544, line: 205, baseType: !1194, size: 64, align: 64, offset: 192)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1196, line: 86, baseType: !1197)
!1196 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1197 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1196, line: 86, flags: DIFlagFwdDecl)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1188, file: !544, line: 206, baseType: !1031, size: 64, align: 64, offset: 256)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1139, file: !544, line: 480, baseType: !932, size: 32, align: 32, offset: 3008)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1139, file: !544, line: 505, baseType: !932, size: 32, align: 32, offset: 3040)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1139, file: !544, line: 512, baseType: !567, size: 32, align: 32, offset: 3072)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1139, file: !544, line: 514, baseType: !574, size: 32, align: 32, offset: 3104)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1139, file: !544, line: 516, baseType: !592, size: 32, align: 32, offset: 3136)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1139, file: !544, line: 523, baseType: !616, size: 32, align: 32, offset: 3168)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1139, file: !544, line: 525, baseType: !635, size: 32, align: 32, offset: 3200)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1139, file: !544, line: 532, baseType: !1046, size: 64, align: 64, offset: 3264)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1139, file: !544, line: 539, baseType: !1046, size: 64, align: 64, offset: 3328)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1139, file: !544, line: 547, baseType: !1046, size: 64, align: 64, offset: 3392)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1139, file: !544, line: 554, baseType: !1194, size: 64, align: 64, offset: 3456)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1139, file: !544, line: 563, baseType: !932, size: 32, align: 32, offset: 3520)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1139, file: !544, line: 572, baseType: !932, size: 32, align: 32, offset: 3552)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1139, file: !544, line: 581, baseType: !932, size: 32, align: 32, offset: 3584)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1139, file: !544, line: 588, baseType: !1214, size: 64, align: 64, offset: 3648)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1043, line: 36, baseType: !1216)
!1216 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1139, file: !544, line: 593, baseType: !932, size: 32, align: 32, offset: 3712)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1139, file: !544, line: 596, baseType: !932, size: 32, align: 32, offset: 3744)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1139, file: !544, line: 599, baseType: !1031, size: 64, align: 64, offset: 3776)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1139, file: !544, line: 605, baseType: !1031, size: 64, align: 64, offset: 3840)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1139, file: !544, line: 616, baseType: !1031, size: 64, align: 64, offset: 3904)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1139, file: !544, line: 626, baseType: !1129, size: 64, align: 64, offset: 3968)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1139, file: !544, line: 627, baseType: !1129, size: 64, align: 64, offset: 4032)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1139, file: !544, line: 628, baseType: !1129, size: 64, align: 64, offset: 4096)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1139, file: !544, line: 629, baseType: !1129, size: 64, align: 64, offset: 4160)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1139, file: !544, line: 645, baseType: !1031, size: 64, align: 64, offset: 4224)
!1227 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1096, file: !474, line: 587, baseType: !1082, size: 64, align: 64, offset: 1152)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1096, file: !474, line: 592, baseType: !1088, size: 64, align: 64, offset: 1216)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1096, file: !474, line: 597, baseType: !1088, size: 64, align: 64, offset: 1280)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1096, file: !474, line: 598, baseType: !13, size: 32, align: 32, offset: 1344)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1096, file: !474, line: 608, baseType: !1018, size: 64, align: 64, offset: 1408)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1096, file: !474, line: 617, baseType: !1234, size: 64, align: 64, offset: 1472)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{null, !1021}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1096, file: !474, line: 623, baseType: !1238, size: 64, align: 64, offset: 1536)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!932, !1021, !1241}
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1027)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !940, file: !474, line: 1365, baseType: !953, size: 64, align: 64, offset: 192)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !940, file: !474, line: 1379, baseType: !1245, size: 64, align: 64, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !646, line: 352, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !646, line: 161, size: 2112, align: 64, elements: !1248)
!1248 = !{!1249, !1250, !1251, !1252, !1253, !1254, !1255, !1259, !1260, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1276, !1277, !1281, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1299, !1300, !1301, !1302, !1306, !1307, !1308}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1247, file: !646, line: 174, baseType: !943, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1247, file: !646, line: 226, baseType: !1013, size: 64, align: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1247, file: !646, line: 227, baseType: !932, size: 32, align: 32, offset: 128)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1247, file: !646, line: 228, baseType: !1013, size: 64, align: 64, offset: 192)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1247, file: !646, line: 229, baseType: !1013, size: 64, align: 64, offset: 256)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1247, file: !646, line: 233, baseType: !953, size: 64, align: 64, offset: 320)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1247, file: !646, line: 235, baseType: !1256, size: 64, align: 64, offset: 384)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!932, !953, !1041, !932}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1247, file: !646, line: 236, baseType: !1256, size: 64, align: 64, offset: 448)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1247, file: !646, line: 237, baseType: !1261, size: 64, align: 64, offset: 512)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DISubroutineType(types: !1263)
!1263 = !{!1046, !953, !1046, !932}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1247, file: !646, line: 238, baseType: !1046, size: 64, align: 64, offset: 576)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1247, file: !646, line: 239, baseType: !932, size: 32, align: 32, offset: 640)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1247, file: !646, line: 240, baseType: !932, size: 32, align: 32, offset: 672)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1247, file: !646, line: 241, baseType: !932, size: 32, align: 32, offset: 704)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1247, file: !646, line: 242, baseType: !1131, size: 64, align: 64, offset: 768)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1247, file: !646, line: 243, baseType: !1013, size: 64, align: 64, offset: 832)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1247, file: !646, line: 244, baseType: !1271, size: 64, align: 64, offset: 896)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!1131, !1131, !1274, !1227}
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1042)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1247, file: !646, line: 245, baseType: !932, size: 32, align: 32, offset: 960)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1247, file: !646, line: 249, baseType: !1278, size: 64, align: 64, offset: 1024)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!932, !953, !932}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1247, file: !646, line: 255, baseType: !1282, size: 64, align: 64, offset: 1088)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!1046, !953, !932, !1046, !932}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1247, file: !646, line: 260, baseType: !932, size: 32, align: 32, offset: 1152)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1247, file: !646, line: 266, baseType: !1046, size: 64, align: 64, offset: 1216)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1247, file: !646, line: 273, baseType: !932, size: 32, align: 32, offset: 1280)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1247, file: !646, line: 279, baseType: !1046, size: 64, align: 64, offset: 1344)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1247, file: !646, line: 285, baseType: !932, size: 32, align: 32, offset: 1408)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1247, file: !646, line: 291, baseType: !932, size: 32, align: 32, offset: 1440)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1247, file: !646, line: 298, baseType: !932, size: 32, align: 32, offset: 1472)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1247, file: !646, line: 304, baseType: !932, size: 32, align: 32, offset: 1504)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1247, file: !646, line: 309, baseType: !925, size: 64, align: 64, offset: 1536)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1247, file: !646, line: 314, baseType: !925, size: 64, align: 64, offset: 1600)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1247, file: !646, line: 319, baseType: !1296, size: 64, align: 64, offset: 1664)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!932, !953, !1041, !932, !645, !1046}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1247, file: !646, line: 326, baseType: !932, size: 32, align: 32, offset: 1728)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1247, file: !646, line: 331, baseType: !645, size: 32, align: 32, offset: 1760)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1247, file: !646, line: 332, baseType: !1046, size: 64, align: 64, offset: 1792)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1247, file: !646, line: 338, baseType: !1303, size: 64, align: 64, offset: 1856)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{!932, !953}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1247, file: !646, line: 340, baseType: !1046, size: 64, align: 64, offset: 1920)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1247, file: !646, line: 346, baseType: !1013, size: 64, align: 64, offset: 1984)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1247, file: !646, line: 351, baseType: !932, size: 32, align: 32, offset: 2048)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !940, file: !474, line: 1386, baseType: !932, size: 32, align: 32, offset: 320)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !940, file: !474, line: 1393, baseType: !1227, size: 32, align: 32, offset: 352)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !940, file: !474, line: 1405, baseType: !1312, size: 64, align: 64, offset: 384)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !474, line: 1223, baseType: !1315)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !474, line: 865, size: 6144, align: 64, elements: !1316)
!1316 = !{!1317, !1318, !1319, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1790, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1891, !1897, !1898, !1902, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1934, !1935, !1936, !1937, !1938, !1939}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1315, file: !474, line: 866, baseType: !932, size: 32, align: 32)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1315, file: !474, line: 872, baseType: !932, size: 32, align: 32, offset: 32)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1315, file: !474, line: 878, baseType: !1320, size: 64, align: 64, offset: 64)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1323)
!1323 = !{!1324, !1325, !1326, !1327, !1465, !1466, !1467, !1468, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1494, !1498, !1499, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1678, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1322, file: !14, line: 1561, baseType: !943, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1322, file: !14, line: 1562, baseType: !932, size: 32, align: 32, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1322, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1322, file: !14, line: 1565, baseType: !1328, size: 64, align: 64, offset: 128)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1330)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1331)
!1331 = !{!1332, !1333, !1334, !1335, !1336, !1337, !1340, !1343, !1346, !1349, !1352, !1353, !1354, !1362, !1363, !1364, !1366, !1370, !1376, !1381, !1385, !1386, !1430, !1437, !1441, !1442, !1446, !1450, !1454, !1458, !1459, !1460}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1330, file: !14, line: 3475, baseType: !925, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1330, file: !14, line: 3480, baseType: !925, size: 64, align: 64, offset: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1330, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1330, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1330, file: !14, line: 3487, baseType: !932, size: 32, align: 32, offset: 192)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1330, file: !14, line: 3488, baseType: !1338, size: 64, align: 64, offset: 256)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1156)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1330, file: !14, line: 3489, baseType: !1341, size: 64, align: 64, offset: 320)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1330, file: !14, line: 3490, baseType: !1344, size: 64, align: 64, offset: 384)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1330, file: !14, line: 3491, baseType: !1347, size: 64, align: 64, offset: 448)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !853)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1330, file: !14, line: 3492, baseType: !1350, size: 64, align: 64, offset: 512)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1171)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1330, file: !14, line: 3493, baseType: !1042, size: 8, align: 8, offset: 576)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1330, file: !14, line: 3494, baseType: !943, size: 64, align: 64, offset: 640)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1330, file: !14, line: 3495, baseType: !1355, size: 64, align: 64, offset: 704)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1357)
!1357 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1358)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1359)
!1359 = !{!1360, !1361}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1358, file: !14, line: 3402, baseType: !932, size: 32, align: 32)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1358, file: !14, line: 3403, baseType: !925, size: 64, align: 64, offset: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1330, file: !14, line: 3507, baseType: !925, size: 64, align: 64, offset: 768)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1330, file: !14, line: 3516, baseType: !932, size: 32, align: 32, offset: 832)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1330, file: !14, line: 3517, baseType: !1365, size: 64, align: 64, offset: 896)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1330, file: !14, line: 3527, baseType: !1367, size: 64, align: 64, offset: 960)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DISubroutineType(types: !1369)
!1369 = !{!932, !1320}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1330, file: !14, line: 3535, baseType: !1371, size: 64, align: 64, offset: 1024)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{!932, !1320, !1374}
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1321)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1330, file: !14, line: 3541, baseType: !1377, size: 64, align: 64, offset: 1088)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1379)
!1379 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1380)
!1380 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1330, file: !14, line: 3549, baseType: !1382, size: 64, align: 64, offset: 1152)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DISubroutineType(types: !1384)
!1384 = !{null, !1365}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1330, file: !14, line: 3551, baseType: !1367, size: 64, align: 64, offset: 1216)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1330, file: !14, line: 3552, baseType: !1387, size: 64, align: 64, offset: 1280)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DISubroutineType(types: !1389)
!1389 = !{!932, !1320, !1041, !932, !1390}
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1393)
!1393 = !{!1394, !1397, !1399, !1400, !1401, !1429}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1392, file: !14, line: 3921, baseType: !1395, size: 16, align: 16)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1043, line: 49, baseType: !1396)
!1396 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1392, file: !14, line: 3922, baseType: !1398, size: 32, align: 32, offset: 32)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1043, line: 51, baseType: !1227)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1392, file: !14, line: 3923, baseType: !1398, size: 32, align: 32, offset: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1392, file: !14, line: 3924, baseType: !1227, size: 32, align: 32, offset: 96)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1392, file: !14, line: 3925, baseType: !1402, size: 64, align: 64, offset: 128)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1405)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1406)
!1406 = !{!1407, !1408, !1409, !1410, !1411, !1412, !1418, !1422, !1424, !1425, !1427, !1428}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1405, file: !14, line: 3886, baseType: !932, size: 32, align: 32)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1405, file: !14, line: 3887, baseType: !932, size: 32, align: 32, offset: 32)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1405, file: !14, line: 3888, baseType: !932, size: 32, align: 32, offset: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1405, file: !14, line: 3889, baseType: !932, size: 32, align: 32, offset: 96)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1405, file: !14, line: 3890, baseType: !932, size: 32, align: 32, offset: 128)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1405, file: !14, line: 3897, baseType: !1413, size: 768, align: 64, offset: 192)
!1413 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1414)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1415)
!1415 = !{!1416, !1417}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1414, file: !14, line: 3855, baseType: !1142, size: 512, align: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1414, file: !14, line: 3857, baseType: !1146, size: 256, align: 32, offset: 512)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1405, file: !14, line: 3903, baseType: !1419, size: 256, align: 64, offset: 960)
!1419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1041, size: 256, align: 64, elements: !1420)
!1420 = !{!1421}
!1421 = !DISubrange(count: 4)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1405, file: !14, line: 3904, baseType: !1423, size: 128, align: 32, offset: 1216)
!1423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 128, align: 32, elements: !1420)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1405, file: !14, line: 3906, baseType: !870, size: 32, align: 32, offset: 1344)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1405, file: !14, line: 3908, baseType: !1426, size: 64, align: 64, offset: 1408)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1405, file: !14, line: 3915, baseType: !1426, size: 64, align: 64, offset: 1472)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1405, file: !14, line: 3917, baseType: !932, size: 32, align: 32, offset: 1536)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1392, file: !14, line: 3926, baseType: !1046, size: 64, align: 64, offset: 192)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1330, file: !14, line: 3564, baseType: !1431, size: 64, align: 64, offset: 1344)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{!932, !1320, !1026, !1434, !1436}
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1138)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1330, file: !14, line: 3566, baseType: !1438, size: 64, align: 64, offset: 1408)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DISubroutineType(types: !1440)
!1440 = !{!932, !1320, !953, !1436, !1026}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1330, file: !14, line: 3567, baseType: !1367, size: 64, align: 64, offset: 1472)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1330, file: !14, line: 3576, baseType: !1443, size: 64, align: 64, offset: 1536)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DISubroutineType(types: !1445)
!1445 = !{!932, !1320, !1434}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1330, file: !14, line: 3577, baseType: !1447, size: 64, align: 64, offset: 1600)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DISubroutineType(types: !1449)
!1449 = !{!932, !1320, !1026}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1330, file: !14, line: 3584, baseType: !1451, size: 64, align: 64, offset: 1664)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DISubroutineType(types: !1453)
!1453 = !{!932, !1320, !1137}
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1330, file: !14, line: 3589, baseType: !1455, size: 64, align: 64, offset: 1728)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{null, !1320}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1330, file: !14, line: 3594, baseType: !932, size: 32, align: 32, offset: 1792)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1330, file: !14, line: 3600, baseType: !925, size: 64, align: 64, offset: 1856)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1330, file: !14, line: 3609, baseType: !1461, size: 64, align: 64, offset: 1920)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1464)
!1464 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1322, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1322, file: !14, line: 1581, baseType: !1227, size: 32, align: 32, offset: 224)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1322, file: !14, line: 1583, baseType: !953, size: 64, align: 64, offset: 256)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1322, file: !14, line: 1591, baseType: !1469, size: 64, align: 64, offset: 320)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1322, file: !14, line: 1598, baseType: !953, size: 64, align: 64, offset: 384)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1322, file: !14, line: 1606, baseType: !1046, size: 64, align: 64, offset: 448)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1322, file: !14, line: 1614, baseType: !932, size: 32, align: 32, offset: 512)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1322, file: !14, line: 1622, baseType: !932, size: 32, align: 32, offset: 544)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1322, file: !14, line: 1628, baseType: !932, size: 32, align: 32, offset: 576)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1322, file: !14, line: 1636, baseType: !932, size: 32, align: 32, offset: 608)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1322, file: !14, line: 1643, baseType: !932, size: 32, align: 32, offset: 640)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1322, file: !14, line: 1657, baseType: !1041, size: 64, align: 64, offset: 704)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1322, file: !14, line: 1658, baseType: !932, size: 32, align: 32, offset: 768)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1322, file: !14, line: 1679, baseType: !1156, size: 64, align: 32, offset: 800)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1322, file: !14, line: 1688, baseType: !932, size: 32, align: 32, offset: 864)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1322, file: !14, line: 1712, baseType: !932, size: 32, align: 32, offset: 896)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1322, file: !14, line: 1729, baseType: !932, size: 32, align: 32, offset: 928)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1322, file: !14, line: 1729, baseType: !932, size: 32, align: 32, offset: 960)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1322, file: !14, line: 1744, baseType: !932, size: 32, align: 32, offset: 992)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1322, file: !14, line: 1744, baseType: !932, size: 32, align: 32, offset: 1024)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1322, file: !14, line: 1751, baseType: !932, size: 32, align: 32, offset: 1056)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1322, file: !14, line: 1766, baseType: !654, size: 32, align: 32, offset: 1088)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1322, file: !14, line: 1791, baseType: !1490, size: 64, align: 64, offset: 1152)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{null, !1493, !1434, !1436, !932, !932, !932}
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1322, file: !14, line: 1808, baseType: !1495, size: 64, align: 64, offset: 1216)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!654, !1493, !1341}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1322, file: !14, line: 1816, baseType: !932, size: 32, align: 32, offset: 1280)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1322, file: !14, line: 1825, baseType: !1500, size: 32, align: 32, offset: 1312)
!1500 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1322, file: !14, line: 1830, baseType: !932, size: 32, align: 32, offset: 1344)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1322, file: !14, line: 1838, baseType: !1500, size: 32, align: 32, offset: 1376)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1322, file: !14, line: 1846, baseType: !932, size: 32, align: 32, offset: 1408)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1322, file: !14, line: 1851, baseType: !932, size: 32, align: 32, offset: 1440)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1322, file: !14, line: 1861, baseType: !1500, size: 32, align: 32, offset: 1472)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1322, file: !14, line: 1868, baseType: !1500, size: 32, align: 32, offset: 1504)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1322, file: !14, line: 1875, baseType: !1500, size: 32, align: 32, offset: 1536)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1322, file: !14, line: 1882, baseType: !1500, size: 32, align: 32, offset: 1568)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1322, file: !14, line: 1889, baseType: !1500, size: 32, align: 32, offset: 1600)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1322, file: !14, line: 1896, baseType: !1500, size: 32, align: 32, offset: 1632)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1322, file: !14, line: 1903, baseType: !1500, size: 32, align: 32, offset: 1664)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1322, file: !14, line: 1910, baseType: !932, size: 32, align: 32, offset: 1696)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1322, file: !14, line: 1915, baseType: !932, size: 32, align: 32, offset: 1728)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1322, file: !14, line: 1926, baseType: !1436, size: 64, align: 64, offset: 1792)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1322, file: !14, line: 1935, baseType: !1156, size: 64, align: 32, offset: 1856)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1322, file: !14, line: 1942, baseType: !932, size: 32, align: 32, offset: 1920)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1322, file: !14, line: 1948, baseType: !932, size: 32, align: 32, offset: 1952)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1322, file: !14, line: 1954, baseType: !932, size: 32, align: 32, offset: 1984)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1322, file: !14, line: 1960, baseType: !932, size: 32, align: 32, offset: 2016)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1322, file: !14, line: 1984, baseType: !932, size: 32, align: 32, offset: 2048)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1322, file: !14, line: 1991, baseType: !932, size: 32, align: 32, offset: 2080)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1322, file: !14, line: 1996, baseType: !932, size: 32, align: 32, offset: 2112)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1322, file: !14, line: 2004, baseType: !932, size: 32, align: 32, offset: 2144)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1322, file: !14, line: 2011, baseType: !932, size: 32, align: 32, offset: 2176)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1322, file: !14, line: 2018, baseType: !932, size: 32, align: 32, offset: 2208)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1322, file: !14, line: 2027, baseType: !932, size: 32, align: 32, offset: 2240)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1322, file: !14, line: 2034, baseType: !932, size: 32, align: 32, offset: 2272)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1322, file: !14, line: 2044, baseType: !932, size: 32, align: 32, offset: 2304)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1322, file: !14, line: 2054, baseType: !1530, size: 64, align: 64, offset: 2368)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1322, file: !14, line: 2061, baseType: !1530, size: 64, align: 64, offset: 2432)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1322, file: !14, line: 2066, baseType: !932, size: 32, align: 32, offset: 2496)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1322, file: !14, line: 2070, baseType: !932, size: 32, align: 32, offset: 2528)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1322, file: !14, line: 2078, baseType: !932, size: 32, align: 32, offset: 2560)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1322, file: !14, line: 2085, baseType: !932, size: 32, align: 32, offset: 2592)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1322, file: !14, line: 2092, baseType: !932, size: 32, align: 32, offset: 2624)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1322, file: !14, line: 2099, baseType: !932, size: 32, align: 32, offset: 2656)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1322, file: !14, line: 2106, baseType: !932, size: 32, align: 32, offset: 2688)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1322, file: !14, line: 2113, baseType: !932, size: 32, align: 32, offset: 2720)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1322, file: !14, line: 2120, baseType: !932, size: 32, align: 32, offset: 2752)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1322, file: !14, line: 2125, baseType: !932, size: 32, align: 32, offset: 2784)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1322, file: !14, line: 2133, baseType: !932, size: 32, align: 32, offset: 2816)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1322, file: !14, line: 2140, baseType: !932, size: 32, align: 32, offset: 2848)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1322, file: !14, line: 2145, baseType: !932, size: 32, align: 32, offset: 2880)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1322, file: !14, line: 2153, baseType: !932, size: 32, align: 32, offset: 2912)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1322, file: !14, line: 2158, baseType: !932, size: 32, align: 32, offset: 2944)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1322, file: !14, line: 2166, baseType: !574, size: 32, align: 32, offset: 2976)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1322, file: !14, line: 2173, baseType: !592, size: 32, align: 32, offset: 3008)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1322, file: !14, line: 2180, baseType: !616, size: 32, align: 32, offset: 3040)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1322, file: !14, line: 2187, baseType: !567, size: 32, align: 32, offset: 3072)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1322, file: !14, line: 2194, baseType: !635, size: 32, align: 32, offset: 3104)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1322, file: !14, line: 2203, baseType: !932, size: 32, align: 32, offset: 3136)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1322, file: !14, line: 2209, baseType: !876, size: 32, align: 32, offset: 3168)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1322, file: !14, line: 2212, baseType: !932, size: 32, align: 32, offset: 3200)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1322, file: !14, line: 2213, baseType: !932, size: 32, align: 32, offset: 3232)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1322, file: !14, line: 2220, baseType: !853, size: 32, align: 32, offset: 3264)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1322, file: !14, line: 2232, baseType: !932, size: 32, align: 32, offset: 3296)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1322, file: !14, line: 2243, baseType: !932, size: 32, align: 32, offset: 3328)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1322, file: !14, line: 2249, baseType: !932, size: 32, align: 32, offset: 3360)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1322, file: !14, line: 2256, baseType: !932, size: 32, align: 32, offset: 3392)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1322, file: !14, line: 2263, baseType: !1171, size: 64, align: 64, offset: 3456)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1322, file: !14, line: 2270, baseType: !1171, size: 64, align: 64, offset: 3520)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1322, file: !14, line: 2277, baseType: !884, size: 32, align: 32, offset: 3584)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1322, file: !14, line: 2285, baseType: !853, size: 32, align: 32, offset: 3616)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1322, file: !14, line: 2367, baseType: !1566, size: 64, align: 64, offset: 3648)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64, align: 64)
!1567 = !DISubroutineType(types: !1568)
!1568 = !{!932, !1493, !1137, !932}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1322, file: !14, line: 2383, baseType: !932, size: 32, align: 32, offset: 3712)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1322, file: !14, line: 2386, baseType: !1500, size: 32, align: 32, offset: 3744)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1322, file: !14, line: 2387, baseType: !1500, size: 32, align: 32, offset: 3776)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1322, file: !14, line: 2394, baseType: !932, size: 32, align: 32, offset: 3808)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1322, file: !14, line: 2401, baseType: !932, size: 32, align: 32, offset: 3840)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1322, file: !14, line: 2408, baseType: !932, size: 32, align: 32, offset: 3872)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1322, file: !14, line: 2415, baseType: !932, size: 32, align: 32, offset: 3904)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1322, file: !14, line: 2422, baseType: !932, size: 32, align: 32, offset: 3936)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1322, file: !14, line: 2423, baseType: !1578, size: 64, align: 64, offset: 3968)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1580)
!1580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1581)
!1581 = !{!1582, !1583, !1584, !1585}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1580, file: !14, line: 827, baseType: !932, size: 32, align: 32)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1580, file: !14, line: 828, baseType: !932, size: 32, align: 32, offset: 32)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1580, file: !14, line: 829, baseType: !932, size: 32, align: 32, offset: 64)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1580, file: !14, line: 830, baseType: !1500, size: 32, align: 32, offset: 96)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1322, file: !14, line: 2430, baseType: !1046, size: 64, align: 64, offset: 4032)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1322, file: !14, line: 2437, baseType: !1046, size: 64, align: 64, offset: 4096)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1322, file: !14, line: 2444, baseType: !1500, size: 32, align: 32, offset: 4160)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1322, file: !14, line: 2451, baseType: !1500, size: 32, align: 32, offset: 4192)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1322, file: !14, line: 2458, baseType: !932, size: 32, align: 32, offset: 4224)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1322, file: !14, line: 2469, baseType: !932, size: 32, align: 32, offset: 4256)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1322, file: !14, line: 2475, baseType: !932, size: 32, align: 32, offset: 4288)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1322, file: !14, line: 2481, baseType: !932, size: 32, align: 32, offset: 4320)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1322, file: !14, line: 2485, baseType: !932, size: 32, align: 32, offset: 4352)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1322, file: !14, line: 2489, baseType: !932, size: 32, align: 32, offset: 4384)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1322, file: !14, line: 2493, baseType: !932, size: 32, align: 32, offset: 4416)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1322, file: !14, line: 2501, baseType: !932, size: 32, align: 32, offset: 4448)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1322, file: !14, line: 2506, baseType: !932, size: 32, align: 32, offset: 4480)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1322, file: !14, line: 2510, baseType: !932, size: 32, align: 32, offset: 4512)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1322, file: !14, line: 2514, baseType: !1046, size: 64, align: 64, offset: 4544)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1322, file: !14, line: 2528, baseType: !1602, size: 64, align: 64, offset: 4608)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DISubroutineType(types: !1604)
!1604 = !{null, !1493, !953, !932, !932}
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1322, file: !14, line: 2534, baseType: !932, size: 32, align: 32, offset: 4672)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1322, file: !14, line: 2545, baseType: !932, size: 32, align: 32, offset: 4704)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1322, file: !14, line: 2547, baseType: !932, size: 32, align: 32, offset: 4736)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1322, file: !14, line: 2549, baseType: !932, size: 32, align: 32, offset: 4768)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1322, file: !14, line: 2551, baseType: !932, size: 32, align: 32, offset: 4800)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1322, file: !14, line: 2553, baseType: !932, size: 32, align: 32, offset: 4832)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1322, file: !14, line: 2555, baseType: !932, size: 32, align: 32, offset: 4864)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1322, file: !14, line: 2557, baseType: !932, size: 32, align: 32, offset: 4896)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1322, file: !14, line: 2559, baseType: !932, size: 32, align: 32, offset: 4928)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1322, file: !14, line: 2563, baseType: !932, size: 32, align: 32, offset: 4960)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1322, file: !14, line: 2571, baseType: !1426, size: 64, align: 64, offset: 4992)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1322, file: !14, line: 2579, baseType: !1426, size: 64, align: 64, offset: 5056)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1322, file: !14, line: 2586, baseType: !932, size: 32, align: 32, offset: 5120)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1322, file: !14, line: 2615, baseType: !932, size: 32, align: 32, offset: 5152)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1322, file: !14, line: 2627, baseType: !932, size: 32, align: 32, offset: 5184)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1322, file: !14, line: 2637, baseType: !932, size: 32, align: 32, offset: 5216)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1322, file: !14, line: 2681, baseType: !932, size: 32, align: 32, offset: 5248)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1322, file: !14, line: 2709, baseType: !1046, size: 64, align: 64, offset: 5312)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1322, file: !14, line: 2716, baseType: !1624, size: 64, align: 64, offset: 5376)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1626)
!1626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1627)
!1627 = !{!1628, !1629, !1630, !1631, !1632, !1633, !1634, !1638, !1642, !1643, !1644, !1645, !1651, !1652, !1653, !1654, !1655}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1626, file: !14, line: 3642, baseType: !925, size: 64, align: 64)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1626, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1626, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1626, file: !14, line: 3663, baseType: !654, size: 32, align: 32, offset: 128)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1626, file: !14, line: 3669, baseType: !932, size: 32, align: 32, offset: 160)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1626, file: !14, line: 3682, baseType: !1451, size: 64, align: 64, offset: 192)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1626, file: !14, line: 3698, baseType: !1635, size: 64, align: 64, offset: 256)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{!932, !1320, !1274, !1398}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1626, file: !14, line: 3712, baseType: !1639, size: 64, align: 64, offset: 320)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{!932, !1320, !932, !1274, !1398}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1626, file: !14, line: 3726, baseType: !1635, size: 64, align: 64, offset: 384)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1626, file: !14, line: 3737, baseType: !1367, size: 64, align: 64, offset: 448)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1626, file: !14, line: 3746, baseType: !932, size: 32, align: 32, offset: 512)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1626, file: !14, line: 3757, baseType: !1646, size: 64, align: 64, offset: 576)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{null, !1649}
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1626, file: !14, line: 3766, baseType: !1367, size: 64, align: 64, offset: 640)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1626, file: !14, line: 3774, baseType: !1367, size: 64, align: 64, offset: 704)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1626, file: !14, line: 3780, baseType: !932, size: 32, align: 32, offset: 768)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1626, file: !14, line: 3785, baseType: !932, size: 32, align: 32, offset: 800)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1626, file: !14, line: 3795, baseType: !1656, size: 64, align: 64, offset: 832)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DISubroutineType(types: !1658)
!1658 = !{!932, !1320, !1031}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1322, file: !14, line: 2728, baseType: !953, size: 64, align: 64, offset: 5440)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1322, file: !14, line: 2735, baseType: !1170, size: 512, align: 64, offset: 5504)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1322, file: !14, line: 2742, baseType: !932, size: 32, align: 32, offset: 6016)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1322, file: !14, line: 2755, baseType: !932, size: 32, align: 32, offset: 6048)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1322, file: !14, line: 2776, baseType: !932, size: 32, align: 32, offset: 6080)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1322, file: !14, line: 2783, baseType: !932, size: 32, align: 32, offset: 6112)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1322, file: !14, line: 2791, baseType: !932, size: 32, align: 32, offset: 6144)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1322, file: !14, line: 2802, baseType: !1137, size: 64, align: 64, offset: 6208)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1322, file: !14, line: 2811, baseType: !932, size: 32, align: 32, offset: 6272)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1322, file: !14, line: 2821, baseType: !932, size: 32, align: 32, offset: 6304)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1322, file: !14, line: 2830, baseType: !932, size: 32, align: 32, offset: 6336)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1322, file: !14, line: 2840, baseType: !932, size: 32, align: 32, offset: 6368)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1322, file: !14, line: 2851, baseType: !1672, size: 64, align: 64, offset: 6400)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{!932, !1493, !1675, !953, !1436, !932, !932}
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DISubroutineType(types: !1677)
!1677 = !{!932, !1493, !953}
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1322, file: !14, line: 2871, baseType: !1679, size: 64, align: 64, offset: 6464)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DISubroutineType(types: !1681)
!1681 = !{!932, !1493, !1682, !953, !1436, !932}
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64, align: 64)
!1683 = !DISubroutineType(types: !1684)
!1684 = !{!932, !1493, !953, !932, !932}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1322, file: !14, line: 2878, baseType: !932, size: 32, align: 32, offset: 6528)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1322, file: !14, line: 2885, baseType: !932, size: 32, align: 32, offset: 6560)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1322, file: !14, line: 3005, baseType: !932, size: 32, align: 32, offset: 6592)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1322, file: !14, line: 3013, baseType: !896, size: 32, align: 32, offset: 6624)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1322, file: !14, line: 3020, baseType: !896, size: 32, align: 32, offset: 6656)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1322, file: !14, line: 3027, baseType: !896, size: 32, align: 32, offset: 6688)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1322, file: !14, line: 3037, baseType: !1041, size: 64, align: 64, offset: 6720)
