; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpenc_h263.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtpenc_h263.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFormatContext = type { %struct.AVClass*, %struct.AVInputFormat*, %struct.AVOutputFormat*, i8*, %struct.AVIOContext*, i32, i32, %struct.AVStream**, [1024 x i8], i8*, i64, i64, i64, i32, i32, i32, i64, i64, i8*, i32, i32, %struct.AVProgram**, i32, i32, i32, i32, i32, i32, %struct.AVChapter**, %struct.AVDictionary*, i64, i32, i32, %struct.AVIOInterruptCB, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i8*, i8*, %struct.AVFormatInternal*, i32, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, i32, i8*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i64, i8*, i32, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVIOInterruptCB*, %struct.AVDictionary**)*, i8*, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVDictionary**)*, void (%struct.AVFormatContext*, %struct.AVIOContext*)*, i8*, i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }

!920 = !DIFile(filename: "libavformat/rtpenc_h263.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!921 = !DISubroutineType(types: !922)
!922 = !{!923, !928, !928}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !926, line: 48, baseType: !927)
!926 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!927 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!928 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !923)
!929 = !{}
!930 = !DILocalVariable(name: "start", arg: 1, scope: !919, file: !920, line: 26, type: !928)
!931 = !DIExpression()
!932 = !DILocation(line: 26, column: 75, scope: !919)
!933 = !DILocalVariable(name: "end", arg: 2, scope: !919, file: !920, line: 27, type: !928)
!934 = !DILocation(line: 27, column: 75, scope: !919)
!935 = !DILocalVariable(name: "p", scope: !919, file: !920, line: 29, type: !923)
!936 = !DILocation(line: 29, column: 20, scope: !919)
!937 = !DILocation(line: 29, column: 24, scope: !919)
!938 = !DILocation(line: 29, column: 28, scope: !919)
!939 = !DILocation(line: 30, column: 11, scope: !919)
!940 = !DILocation(line: 31, column: 5, scope: !919)
!941 = !DILocation(line: 31, column: 12, scope: !942)
!942 = !DILexicalBlockFile(scope: !943, file: !920, discriminator: 1)
!943 = distinct !DILexicalBlock(scope: !944, file: !920, line: 31, column: 5)
!944 = distinct !DILexicalBlock(scope: !919, file: !920, line: 31, column: 5)
!945 = !DILocation(line: 31, column: 16, scope: !942)
!946 = !DILocation(line: 31, column: 14, scope: !942)
!947 = !DILocation(line: 31, column: 5, scope: !942)
!948 = !DILocation(line: 32, column: 15, scope: !949)
!949 = distinct !DILexicalBlock(scope: !950, file: !920, line: 32, column: 13)
!950 = distinct !DILexicalBlock(scope: !943, file: !920, line: 31, column: 31)
!951 = !DILocation(line: 32, column: 14, scope: !949)
!952 = !DILocation(line: 32, column: 13, scope: !950)
!953 = !DILocation(line: 33, column: 18, scope: !954)
!954 = distinct !DILexicalBlock(scope: !955, file: !920, line: 33, column: 17)
!955 = distinct !DILexicalBlock(scope: !949, file: !920, line: 32, column: 18)
!956 = !DILocation(line: 33, column: 24, scope: !954)
!957 = !DILocation(line: 33, column: 27, scope: !958)
!958 = !DILexicalBlockFile(scope: !954, file: !920, discriminator: 1)
!959 = !DILocation(line: 33, column: 17, scope: !958)
!960 = !DILocation(line: 33, column: 40, scope: !961)
!961 = !DILexicalBlockFile(scope: !954, file: !920, discriminator: 2)
!962 = !DILocation(line: 33, column: 33, scope: !961)
!963 = !DILocation(line: 34, column: 23, scope: !964)
!964 = distinct !DILexicalBlock(scope: !954, file: !920, line: 34, column: 22)
!965 = !DILocation(line: 34, column: 29, scope: !964)
!966 = !DILocation(line: 34, column: 32, scope: !967)
!967 = !DILexicalBlockFile(scope: !964, file: !920, discriminator: 1)
!968 = !DILocation(line: 34, column: 22, scope: !967)
!969 = !DILocation(line: 34, column: 45, scope: !970)
!970 = !DILexicalBlockFile(scope: !964, file: !920, discriminator: 2)
!971 = !DILocation(line: 34, column: 47, scope: !970)
!972 = !DILocation(line: 34, column: 38, scope: !970)
!973 = !DILocation(line: 35, column: 9, scope: !955)
!974 = !DILocation(line: 36, column: 5, scope: !950)
!975 = !DILocation(line: 31, column: 25, scope: !976)
!976 = !DILexicalBlockFile(scope: !943, file: !920, discriminator: 2)
!977 = !DILocation(line: 31, column: 5, scope: !976)
!978 = distinct !{!978, !940}
!979 = !DILocation(line: 37, column: 12, scope: !919)
!980 = !DILocation(line: 37, column: 5, scope: !919)
!981 = !DILocation(line: 38, column: 1, scope: !919)
!982 = distinct !DISubprogram(name: "ff_rtp_send_h263", scope: !920, file: !920, line: 43, type: !983, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !929)
!983 = !DISubroutineType(types: !984)
!984 = !{null, !985, !923, !1009}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !988)
!988 = !{!989, !1035, !1142, !1291, !1292, !1355, !1356, !1357, !1989, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2043, !2044, !2045, !2046, !2047, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2078, !2079, !2082, !2083, !2084, !2085, !2086, !2087, !2089, !2090, !2091, !2092, !2100, !2101, !2105, !2109, !2110, !2111}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !987, file: !897, line: 1342, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !994)
!994 = !{!995, !999, !1004, !1008, !1010, !1011, !1012, !1016, !1022, !1024, !1028}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !993, file: !4, line: 72, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !993, file: !4, line: 78, baseType: !1000, size: 64, align: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!996, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !993, file: !4, line: 85, baseType: !1005, size: 64, align: 64, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !993, file: !4, line: 93, baseType: !1009, size: 32, align: 32, offset: 192)
!1009 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !993, file: !4, line: 99, baseType: !1009, size: 32, align: 32, offset: 224)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !993, file: !4, line: 108, baseType: !1009, size: 32, align: 32, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !993, file: !4, line: 113, baseType: !1013, size: 64, align: 64, offset: 320)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!1003, !1003, !1003}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !993, file: !4, line: 123, baseType: !1017, size: 64, align: 64, offset: 384)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!1020, !1020}
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !993, file: !4, line: 130, baseType: !1023, size: 32, align: 32, offset: 448)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !993, file: !4, line: 136, baseType: !1025, size: 64, align: 64, offset: 512)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!1023, !1003}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !993, file: !4, line: 142, baseType: !1029, size: 64, align: 64, offset: 576)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!1009, !1032, !1003, !996, !1009}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !987, file: !897, line: 1349, baseType: !1036, size: 64, align: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1049, !1050, !1051, !1052, !1053, !1054, !1067, !1072, !1113, !1114, !1118, !1123, !1124, !1125, !1129, !1135, !1141}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1037, file: !897, line: 638, baseType: !996, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1037, file: !897, line: 645, baseType: !996, size: 64, align: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1037, file: !897, line: 652, baseType: !1009, size: 32, align: 32, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1037, file: !897, line: 659, baseType: !996, size: 64, align: 64, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1037, file: !897, line: 661, baseType: !1044, size: 64, align: 64, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1048 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !897, line: 443, flags: DIFlagFwdDecl)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1037, file: !897, line: 663, baseType: !990, size: 64, align: 64, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1037, file: !897, line: 670, baseType: !996, size: 64, align: 64, offset: 384)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1037, file: !897, line: 679, baseType: !1036, size: 64, align: 64, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1037, file: !897, line: 684, baseType: !1009, size: 32, align: 32, offset: 512)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1037, file: !897, line: 689, baseType: !1009, size: 32, align: 32, offset: 544)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1037, file: !897, line: 696, baseType: !1055, size: 64, align: 64, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!1009, !1058}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1061)
!1061 = !{!1062, !1063, !1065, !1066}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1060, file: !897, line: 449, baseType: !996, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1060, file: !897, line: 450, baseType: !1064, size: 64, align: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1060, file: !897, line: 451, baseType: !1009, size: 32, align: 32, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1060, file: !897, line: 452, baseType: !996, size: 64, align: 64, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1037, file: !897, line: 703, baseType: !1068, size: 64, align: 64, offset: 640)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!1009, !1071}
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1037, file: !897, line: 714, baseType: !1073, size: 64, align: 64, offset: 704)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!1009, !1071, !1076}
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !25, line: 1499, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !25, line: 1445, size: 704, align: 64, elements: !1079)
!1079 = !{!1080, !1093, !1096, !1097, !1098, !1099, !1100, !1101, !1109, !1110, !1111, !1112}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1078, file: !25, line: 1451, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1083, line: 94, baseType: !1084)
!1083 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1083, line: 81, size: 192, align: 64, elements: !1085)
!1085 = !{!1086, !1090, !1092}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1084, file: !1083, line: 82, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1083, line: 73, baseType: !1089)
!1089 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1083, line: 73, flags: DIFlagFwdDecl)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1084, file: !1083, line: 89, baseType: !1091, size: 64, align: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1084, file: !1083, line: 93, baseType: !1009, size: 32, align: 32, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1078, file: !25, line: 1461, baseType: !1094, size: 64, align: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !926, line: 40, baseType: !1095)
!1095 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1078, file: !25, line: 1467, baseType: !1094, size: 64, align: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1078, file: !25, line: 1468, baseType: !1091, size: 64, align: 64, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1078, file: !25, line: 1469, baseType: !1009, size: 32, align: 32, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1078, file: !25, line: 1470, baseType: !1009, size: 32, align: 32, offset: 288)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1078, file: !25, line: 1474, baseType: !1009, size: 32, align: 32, offset: 320)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1078, file: !25, line: 1479, baseType: !1102, size: 64, align: 64, offset: 384)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !25, line: 1415, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !25, line: 1411, size: 128, align: 64, elements: !1105)
!1105 = !{!1106, !1107, !1108}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1104, file: !25, line: 1412, baseType: !1091, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1104, file: !25, line: 1413, baseType: !1009, size: 32, align: 32, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1104, file: !25, line: 1414, baseType: !24, size: 32, align: 32, offset: 96)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1078, file: !25, line: 1480, baseType: !1009, size: 32, align: 32, offset: 448)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1078, file: !25, line: 1486, baseType: !1094, size: 64, align: 64, offset: 512)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1078, file: !25, line: 1488, baseType: !1094, size: 64, align: 64, offset: 576)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1078, file: !25, line: 1497, baseType: !1094, size: 64, align: 64, offset: 640)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1037, file: !897, line: 720, baseType: !1068, size: 64, align: 64, offset: 768)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1037, file: !897, line: 730, baseType: !1115, size: 64, align: 64, offset: 832)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!1009, !1071, !1009, !1094, !1009}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1037, file: !897, line: 737, baseType: !1119, size: 64, align: 64, offset: 896)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!1094, !1071, !1009, !1122, !1094}
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1037, file: !897, line: 744, baseType: !1068, size: 64, align: 64, offset: 960)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1037, file: !897, line: 750, baseType: !1068, size: 64, align: 64, offset: 1024)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1037, file: !897, line: 758, baseType: !1126, size: 64, align: 64, offset: 1088)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!1009, !1071, !1009, !1094, !1094, !1094, !1009}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1037, file: !897, line: 764, baseType: !1130, size: 64, align: 64, offset: 1152)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!1009, !1071, !1133}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1037, file: !897, line: 770, baseType: !1136, size: 64, align: 64, offset: 1216)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!1009, !1071, !1139}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1037, file: !897, line: 776, baseType: !1136, size: 64, align: 64, offset: 1280)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !987, file: !897, line: 1356, baseType: !1143, size: 64, align: 64, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1145)
!1145 = !{!1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1165, !1169, !1173, !1180, !1276, !1277, !1278, !1279, !1280, !1281, !1285}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1144, file: !897, line: 498, baseType: !996, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1144, file: !897, line: 504, baseType: !996, size: 64, align: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1144, file: !897, line: 505, baseType: !996, size: 64, align: 64, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1144, file: !897, line: 506, baseType: !996, size: 64, align: 64, offset: 192)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1144, file: !897, line: 508, baseType: !55, size: 32, align: 32, offset: 256)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1144, file: !897, line: 509, baseType: !55, size: 32, align: 32, offset: 288)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1144, file: !897, line: 510, baseType: !55, size: 32, align: 32, offset: 320)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1144, file: !897, line: 517, baseType: !1009, size: 32, align: 32, offset: 352)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1144, file: !897, line: 523, baseType: !1044, size: 64, align: 64, offset: 384)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1144, file: !897, line: 526, baseType: !990, size: 64, align: 64, offset: 448)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1144, file: !897, line: 535, baseType: !1143, size: 64, align: 64, offset: 512)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1144, file: !897, line: 539, baseType: !1009, size: 32, align: 32, offset: 576)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1144, file: !897, line: 541, baseType: !1068, size: 64, align: 64, offset: 640)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1144, file: !897, line: 549, baseType: !1073, size: 64, align: 64, offset: 704)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1144, file: !897, line: 550, baseType: !1068, size: 64, align: 64, offset: 768)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1144, file: !897, line: 554, baseType: !1162, size: 64, align: 64, offset: 832)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!1009, !1071, !1076, !1076, !1009}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1144, file: !897, line: 563, baseType: !1166, size: 64, align: 64, offset: 896)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!1009, !55, !1009}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1144, file: !897, line: 565, baseType: !1170, size: 64, align: 64, offset: 960)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{null, !1071, !1009, !1122, !1122}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1144, file: !897, line: 570, baseType: !1174, size: 64, align: 64, offset: 1024)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!1009, !1071, !1009, !1003, !1177}
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1178, line: 216, baseType: !1179)
!1178 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1179 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1144, file: !897, line: 581, baseType: !1181, size: 64, align: 64, offset: 1088)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!1009, !1071, !1009, !1184, !1275}
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1188)
!1188 = !{!1189, !1193, !1195, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1229, !1231, !1232, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1187, file: !526, line: 282, baseType: !1190, size: 512, align: 64)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 512, align: 64, elements: !1191)
!1191 = !{!1192}
!1192 = !DISubrange(count: 8)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1187, file: !526, line: 299, baseType: !1194, size: 256, align: 32, offset: 512)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1009, size: 256, align: 32, elements: !1191)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1187, file: !526, line: 315, baseType: !1196, size: 64, align: 64, offset: 768)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1187, file: !526, line: 326, baseType: !1009, size: 32, align: 32, offset: 832)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1187, file: !526, line: 326, baseType: !1009, size: 32, align: 32, offset: 864)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1187, file: !526, line: 334, baseType: !1009, size: 32, align: 32, offset: 896)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1187, file: !526, line: 341, baseType: !1009, size: 32, align: 32, offset: 928)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1187, file: !526, line: 346, baseType: !1009, size: 32, align: 32, offset: 960)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1187, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1187, file: !526, line: 356, baseType: !1204, size: 64, align: 32, offset: 1024)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1205, line: 61, baseType: !1206)
!1205 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1205, line: 58, size: 64, align: 32, elements: !1207)
!1207 = !{!1208, !1209}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1206, file: !1205, line: 59, baseType: !1009, size: 32, align: 32)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1206, file: !1205, line: 60, baseType: !1009, size: 32, align: 32, offset: 32)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1187, file: !526, line: 361, baseType: !1094, size: 64, align: 64, offset: 1088)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1187, file: !526, line: 369, baseType: !1094, size: 64, align: 64, offset: 1152)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1187, file: !526, line: 377, baseType: !1094, size: 64, align: 64, offset: 1216)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1187, file: !526, line: 382, baseType: !1009, size: 32, align: 32, offset: 1280)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1187, file: !526, line: 386, baseType: !1009, size: 32, align: 32, offset: 1312)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1187, file: !526, line: 391, baseType: !1009, size: 32, align: 32, offset: 1344)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1187, file: !526, line: 396, baseType: !1003, size: 64, align: 64, offset: 1408)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1187, file: !526, line: 403, baseType: !1218, size: 512, align: 64, offset: 1472)
!1218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1219, size: 512, align: 64, elements: !1191)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !926, line: 55, baseType: !1179)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1187, file: !526, line: 410, baseType: !1009, size: 32, align: 32, offset: 1984)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1187, file: !526, line: 415, baseType: !1009, size: 32, align: 32, offset: 2016)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1187, file: !526, line: 420, baseType: !1009, size: 32, align: 32, offset: 2048)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1187, file: !526, line: 425, baseType: !1009, size: 32, align: 32, offset: 2080)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1187, file: !526, line: 435, baseType: !1094, size: 64, align: 64, offset: 2112)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1187, file: !526, line: 440, baseType: !1009, size: 32, align: 32, offset: 2176)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1187, file: !526, line: 445, baseType: !1219, size: 64, align: 64, offset: 2240)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1187, file: !526, line: 459, baseType: !1228, size: 512, align: 64, offset: 2304)
!1228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1081, size: 512, align: 64, elements: !1191)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1187, file: !526, line: 473, baseType: !1230, size: 64, align: 64, offset: 2816)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1187, file: !526, line: 477, baseType: !1009, size: 32, align: 32, offset: 2880)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1187, file: !526, line: 479, baseType: !1233, size: 64, align: 64, offset: 2944)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1236)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1237)
!1237 = !{!1238, !1239, !1240, !1241, !1246}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1236, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1236, file: !526, line: 203, baseType: !1091, size: 64, align: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1236, file: !526, line: 204, baseType: !1009, size: 32, align: 32, offset: 128)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1236, file: !526, line: 205, baseType: !1242, size: 64, align: 64, offset: 192)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1244, line: 86, baseType: !1245)
!1244 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1245 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1244, line: 86, flags: DIFlagFwdDecl)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1236, file: !526, line: 206, baseType: !1081, size: 64, align: 64, offset: 256)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1187, file: !526, line: 480, baseType: !1009, size: 32, align: 32, offset: 3008)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1187, file: !526, line: 505, baseType: !1009, size: 32, align: 32, offset: 3040)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1187, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1187, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1187, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1187, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1187, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1187, file: !526, line: 532, baseType: !1094, size: 64, align: 64, offset: 3264)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1187, file: !526, line: 539, baseType: !1094, size: 64, align: 64, offset: 3328)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1187, file: !526, line: 547, baseType: !1094, size: 64, align: 64, offset: 3392)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1187, file: !526, line: 554, baseType: !1242, size: 64, align: 64, offset: 3456)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1187, file: !526, line: 563, baseType: !1009, size: 32, align: 32, offset: 3520)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1187, file: !526, line: 572, baseType: !1009, size: 32, align: 32, offset: 3552)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1187, file: !526, line: 581, baseType: !1009, size: 32, align: 32, offset: 3584)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1187, file: !526, line: 588, baseType: !1262, size: 64, align: 64, offset: 3648)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !926, line: 36, baseType: !1264)
!1264 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1187, file: !526, line: 593, baseType: !1009, size: 32, align: 32, offset: 3712)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1187, file: !526, line: 596, baseType: !1009, size: 32, align: 32, offset: 3744)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1187, file: !526, line: 599, baseType: !1081, size: 64, align: 64, offset: 3776)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1187, file: !526, line: 605, baseType: !1081, size: 64, align: 64, offset: 3840)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1187, file: !526, line: 616, baseType: !1081, size: 64, align: 64, offset: 3904)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1187, file: !526, line: 626, baseType: !1177, size: 64, align: 64, offset: 3968)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1187, file: !526, line: 627, baseType: !1177, size: 64, align: 64, offset: 4032)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1187, file: !526, line: 628, baseType: !1177, size: 64, align: 64, offset: 4096)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1187, file: !526, line: 629, baseType: !1177, size: 64, align: 64, offset: 4160)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1187, file: !526, line: 645, baseType: !1081, size: 64, align: 64, offset: 4224)
!1275 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1144, file: !897, line: 587, baseType: !1130, size: 64, align: 64, offset: 1152)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1144, file: !897, line: 592, baseType: !1136, size: 64, align: 64, offset: 1216)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1144, file: !897, line: 597, baseType: !1136, size: 64, align: 64, offset: 1280)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1144, file: !897, line: 598, baseType: !55, size: 32, align: 32, offset: 1344)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1144, file: !897, line: 608, baseType: !1068, size: 64, align: 64, offset: 1408)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1144, file: !897, line: 617, baseType: !1282, size: 64, align: 64, offset: 1472)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{null, !1071}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1144, file: !897, line: 623, baseType: !1286, size: 64, align: 64, offset: 1536)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!1009, !1071, !1289}
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1077)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !987, file: !897, line: 1365, baseType: !1003, size: 64, align: 64, offset: 192)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !987, file: !897, line: 1379, baseType: !1293, size: 64, align: 64, offset: 256)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1296)
!1296 = !{!1297, !1298, !1299, !1300, !1301, !1302, !1303, !1307, !1308, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1322, !1323, !1327, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1345, !1346, !1347, !1348, !1352, !1353, !1354}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1295, file: !628, line: 174, baseType: !990, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1295, file: !628, line: 226, baseType: !1064, size: 64, align: 64, offset: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1295, file: !628, line: 227, baseType: !1009, size: 32, align: 32, offset: 128)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1295, file: !628, line: 228, baseType: !1064, size: 64, align: 64, offset: 192)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1295, file: !628, line: 229, baseType: !1064, size: 64, align: 64, offset: 256)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1295, file: !628, line: 233, baseType: !1003, size: 64, align: 64, offset: 320)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1295, file: !628, line: 235, baseType: !1304, size: 64, align: 64, offset: 384)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{!1009, !1003, !1091, !1009}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1295, file: !628, line: 236, baseType: !1304, size: 64, align: 64, offset: 448)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1295, file: !628, line: 237, baseType: !1309, size: 64, align: 64, offset: 512)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!1094, !1003, !1094, !1009}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1295, file: !628, line: 238, baseType: !1094, size: 64, align: 64, offset: 576)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1295, file: !628, line: 239, baseType: !1009, size: 32, align: 32, offset: 640)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1295, file: !628, line: 240, baseType: !1009, size: 32, align: 32, offset: 672)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1295, file: !628, line: 241, baseType: !1009, size: 32, align: 32, offset: 704)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1295, file: !628, line: 242, baseType: !1179, size: 64, align: 64, offset: 768)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1295, file: !628, line: 243, baseType: !1064, size: 64, align: 64, offset: 832)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1295, file: !628, line: 244, baseType: !1319, size: 64, align: 64, offset: 896)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!1179, !1179, !923, !1275}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1295, file: !628, line: 245, baseType: !1009, size: 32, align: 32, offset: 960)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1295, file: !628, line: 249, baseType: !1324, size: 64, align: 64, offset: 1024)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!1009, !1003, !1009}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1295, file: !628, line: 255, baseType: !1328, size: 64, align: 64, offset: 1088)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DISubroutineType(types: !1330)
!1330 = !{!1094, !1003, !1009, !1094, !1009}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1295, file: !628, line: 260, baseType: !1009, size: 32, align: 32, offset: 1152)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1295, file: !628, line: 266, baseType: !1094, size: 64, align: 64, offset: 1216)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1295, file: !628, line: 273, baseType: !1009, size: 32, align: 32, offset: 1280)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1295, file: !628, line: 279, baseType: !1094, size: 64, align: 64, offset: 1344)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1295, file: !628, line: 285, baseType: !1009, size: 32, align: 32, offset: 1408)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1295, file: !628, line: 291, baseType: !1009, size: 32, align: 32, offset: 1440)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1295, file: !628, line: 298, baseType: !1009, size: 32, align: 32, offset: 1472)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1295, file: !628, line: 304, baseType: !1009, size: 32, align: 32, offset: 1504)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1295, file: !628, line: 309, baseType: !996, size: 64, align: 64, offset: 1536)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1295, file: !628, line: 314, baseType: !996, size: 64, align: 64, offset: 1600)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1295, file: !628, line: 319, baseType: !1342, size: 64, align: 64, offset: 1664)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!1009, !1003, !1091, !1009, !627, !1094}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1295, file: !628, line: 326, baseType: !1009, size: 32, align: 32, offset: 1728)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1295, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1295, file: !628, line: 332, baseType: !1094, size: 64, align: 64, offset: 1792)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1295, file: !628, line: 338, baseType: !1349, size: 64, align: 64, offset: 1856)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!1009, !1003}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1295, file: !628, line: 340, baseType: !1094, size: 64, align: 64, offset: 1920)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1295, file: !628, line: 346, baseType: !1064, size: 64, align: 64, offset: 1984)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1295, file: !628, line: 351, baseType: !1009, size: 32, align: 32, offset: 2048)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !987, file: !897, line: 1386, baseType: !1009, size: 32, align: 32, offset: 320)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !987, file: !897, line: 1393, baseType: !1275, size: 32, align: 32, offset: 352)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !987, file: !897, line: 1405, baseType: !1358, size: 64, align: 64, offset: 384)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1362)
!1362 = !{!1363, !1364, !1365, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1836, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1937, !1943, !1944, !1948, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1980, !1981, !1982, !1983, !1984, !1985}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1361, file: !897, line: 866, baseType: !1009, size: 32, align: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1361, file: !897, line: 872, baseType: !1009, size: 32, align: 32, offset: 32)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1361, file: !897, line: 878, baseType: !1366, size: 64, align: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !25, line: 3360, baseType: !1368)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !25, line: 1556, size: 8448, align: 64, elements: !1369)
!1369 = !{!1370, !1371, !1372, !1373, !1511, !1512, !1513, !1514, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1540, !1544, !1545, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1724, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1368, file: !25, line: 1561, baseType: !990, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1368, file: !25, line: 1562, baseType: !1009, size: 32, align: 32, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1368, file: !25, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1368, file: !25, line: 1565, baseType: !1374, size: 64, align: 64, offset: 128)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1376)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !25, line: 3468, size: 1984, align: 64, elements: !1377)
!1377 = !{!1378, !1379, !1380, !1381, !1382, !1383, !1386, !1389, !1392, !1395, !1398, !1399, !1400, !1408, !1409, !1410, !1412, !1416, !1422, !1427, !1431, !1432, !1476, !1483, !1487, !1488, !1492, !1496, !1500, !1504, !1505, !1506}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1376, file: !25, line: 3475, baseType: !996, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1376, file: !25, line: 3480, baseType: !996, size: 64, align: 64, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1376, file: !25, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1376, file: !25, line: 3482, baseType: !55, size: 32, align: 32, offset: 160)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1376, file: !25, line: 3487, baseType: !1009, size: 32, align: 32, offset: 192)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1376, file: !25, line: 3488, baseType: !1384, size: 64, align: 64, offset: 256)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1204)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1376, file: !25, line: 3489, baseType: !1387, size: 64, align: 64, offset: 320)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1376, file: !25, line: 3490, baseType: !1390, size: 64, align: 64, offset: 384)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1376, file: !25, line: 3491, baseType: !1393, size: 64, align: 64, offset: 448)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1376, file: !25, line: 3492, baseType: !1396, size: 64, align: 64, offset: 512)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1219)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1376, file: !25, line: 3493, baseType: !925, size: 8, align: 8, offset: 576)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1376, file: !25, line: 3494, baseType: !990, size: 64, align: 64, offset: 640)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1376, file: !25, line: 3495, baseType: !1401, size: 64, align: 64, offset: 704)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1403)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !25, line: 3404, baseType: !1404)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !25, line: 3401, size: 128, align: 64, elements: !1405)
!1405 = !{!1406, !1407}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1404, file: !25, line: 3402, baseType: !1009, size: 32, align: 32)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1404, file: !25, line: 3403, baseType: !996, size: 64, align: 64, offset: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1376, file: !25, line: 3507, baseType: !996, size: 64, align: 64, offset: 768)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1376, file: !25, line: 3516, baseType: !1009, size: 32, align: 32, offset: 832)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1376, file: !25, line: 3517, baseType: !1411, size: 64, align: 64, offset: 896)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1376, file: !25, line: 3527, baseType: !1413, size: 64, align: 64, offset: 960)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DISubroutineType(types: !1415)
!1415 = !{!1009, !1366}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1376, file: !25, line: 3535, baseType: !1417, size: 64, align: 64, offset: 1024)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DISubroutineType(types: !1419)
!1419 = !{!1009, !1366, !1420}
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1367)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1376, file: !25, line: 3541, baseType: !1423, size: 64, align: 64, offset: 1088)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1425)
!1425 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !25, line: 3461, baseType: !1426)
!1426 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !25, line: 3461, flags: DIFlagFwdDecl)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1376, file: !25, line: 3549, baseType: !1428, size: 64, align: 64, offset: 1152)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{null, !1411}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1376, file: !25, line: 3551, baseType: !1413, size: 64, align: 64, offset: 1216)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1376, file: !25, line: 3552, baseType: !1433, size: 64, align: 64, offset: 1280)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DISubroutineType(types: !1435)
!1435 = !{!1009, !1366, !1091, !1009, !1436}
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1438)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !25, line: 3920, size: 256, align: 64, elements: !1439)
!1439 = !{!1440, !1443, !1445, !1446, !1447, !1475}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1438, file: !25, line: 3921, baseType: !1441, size: 16, align: 16)
!1441 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !926, line: 49, baseType: !1442)
!1442 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1438, file: !25, line: 3922, baseType: !1444, size: 32, align: 32, offset: 32)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !926, line: 51, baseType: !1275)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1438, file: !25, line: 3923, baseType: !1444, size: 32, align: 32, offset: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1438, file: !25, line: 3924, baseType: !1275, size: 32, align: 32, offset: 96)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1438, file: !25, line: 3925, baseType: !1448, size: 64, align: 64, offset: 128)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !25, line: 3918, baseType: !1451)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !25, line: 3885, size: 1600, align: 64, elements: !1452)
!1452 = !{!1453, !1454, !1455, !1456, !1457, !1458, !1464, !1468, !1470, !1471, !1473, !1474}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1451, file: !25, line: 3886, baseType: !1009, size: 32, align: 32)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1451, file: !25, line: 3887, baseType: !1009, size: 32, align: 32, offset: 32)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1451, file: !25, line: 3888, baseType: !1009, size: 32, align: 32, offset: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1451, file: !25, line: 3889, baseType: !1009, size: 32, align: 32, offset: 96)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1451, file: !25, line: 3890, baseType: !1009, size: 32, align: 32, offset: 128)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1451, file: !25, line: 3897, baseType: !1459, size: 768, align: 64, offset: 192)
!1459 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !25, line: 3858, baseType: !1460)
!1460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !25, line: 3853, size: 768, align: 64, elements: !1461)
!1461 = !{!1462, !1463}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1460, file: !25, line: 3855, baseType: !1190, size: 512, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1460, file: !25, line: 3857, baseType: !1194, size: 256, align: 32, offset: 512)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1451, file: !25, line: 3903, baseType: !1465, size: 256, align: 64, offset: 960)
!1465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 256, align: 64, elements: !1466)
!1466 = !{!1467}
!1467 = !DISubrange(count: 4)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1451, file: !25, line: 3904, baseType: !1469, size: 128, align: 32, offset: 1216)
!1469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1009, size: 128, align: 32, elements: !1466)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1451, file: !25, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1451, file: !25, line: 3908, baseType: !1472, size: 64, align: 64, offset: 1408)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1451, file: !25, line: 3915, baseType: !1472, size: 64, align: 64, offset: 1472)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1451, file: !25, line: 3917, baseType: !1009, size: 32, align: 32, offset: 1536)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1438, file: !25, line: 3926, baseType: !1094, size: 64, align: 64, offset: 192)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1376, file: !25, line: 3564, baseType: !1477, size: 64, align: 64, offset: 1344)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{!1009, !1366, !1076, !1480, !1482}
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1186)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1376, file: !25, line: 3566, baseType: !1484, size: 64, align: 64, offset: 1408)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!1009, !1366, !1003, !1482, !1076}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1376, file: !25, line: 3567, baseType: !1413, size: 64, align: 64, offset: 1472)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1376, file: !25, line: 3576, baseType: !1489, size: 64, align: 64, offset: 1536)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{!1009, !1366, !1480}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1376, file: !25, line: 3577, baseType: !1493, size: 64, align: 64, offset: 1600)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{!1009, !1366, !1076}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1376, file: !25, line: 3584, baseType: !1497, size: 64, align: 64, offset: 1664)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!1009, !1366, !1185}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1376, file: !25, line: 3589, baseType: !1501, size: 64, align: 64, offset: 1728)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{null, !1366}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1376, file: !25, line: 3594, baseType: !1009, size: 32, align: 32, offset: 1792)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1376, file: !25, line: 3600, baseType: !996, size: 64, align: 64, offset: 1856)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1376, file: !25, line: 3609, baseType: !1507, size: 64, align: 64, offset: 1920)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1510)
!1510 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !25, line: 3609, flags: DIFlagFwdDecl)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1368, file: !25, line: 1566, baseType: !55, size: 32, align: 32, offset: 192)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1368, file: !25, line: 1581, baseType: !1275, size: 32, align: 32, offset: 224)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1368, file: !25, line: 1583, baseType: !1003, size: 64, align: 64, offset: 256)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1368, file: !25, line: 1591, baseType: !1515, size: 64, align: 64, offset: 320)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !25, line: 1532, flags: DIFlagFwdDecl)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1368, file: !25, line: 1598, baseType: !1003, size: 64, align: 64, offset: 384)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1368, file: !25, line: 1606, baseType: !1094, size: 64, align: 64, offset: 448)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1368, file: !25, line: 1614, baseType: !1009, size: 32, align: 32, offset: 512)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1368, file: !25, line: 1622, baseType: !1009, size: 32, align: 32, offset: 544)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1368, file: !25, line: 1628, baseType: !1009, size: 32, align: 32, offset: 576)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1368, file: !25, line: 1636, baseType: !1009, size: 32, align: 32, offset: 608)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1368, file: !25, line: 1643, baseType: !1009, size: 32, align: 32, offset: 640)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1368, file: !25, line: 1657, baseType: !1091, size: 64, align: 64, offset: 704)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1368, file: !25, line: 1658, baseType: !1009, size: 32, align: 32, offset: 768)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1368, file: !25, line: 1679, baseType: !1204, size: 64, align: 32, offset: 800)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1368, file: !25, line: 1688, baseType: !1009, size: 32, align: 32, offset: 864)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1368, file: !25, line: 1712, baseType: !1009, size: 32, align: 32, offset: 896)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1368, file: !25, line: 1729, baseType: !1009, size: 32, align: 32, offset: 928)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1368, file: !25, line: 1729, baseType: !1009, size: 32, align: 32, offset: 960)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1368, file: !25, line: 1744, baseType: !1009, size: 32, align: 32, offset: 992)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1368, file: !25, line: 1744, baseType: !1009, size: 32, align: 32, offset: 1024)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1368, file: !25, line: 1751, baseType: !1009, size: 32, align: 32, offset: 1056)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1368, file: !25, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1368, file: !25, line: 1791, baseType: !1536, size: 64, align: 64, offset: 1152)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{null, !1539, !1480, !1482, !1009, !1009, !1009}
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1368, file: !25, line: 1808, baseType: !1541, size: 64, align: 64, offset: 1216)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{!645, !1539, !1387}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1368, file: !25, line: 1816, baseType: !1009, size: 32, align: 32, offset: 1280)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1368, file: !25, line: 1825, baseType: !1546, size: 32, align: 32, offset: 1312)
!1546 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1368, file: !25, line: 1830, baseType: !1009, size: 32, align: 32, offset: 1344)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1368, file: !25, line: 1838, baseType: !1546, size: 32, align: 32, offset: 1376)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1368, file: !25, line: 1846, baseType: !1009, size: 32, align: 32, offset: 1408)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1368, file: !25, line: 1851, baseType: !1009, size: 32, align: 32, offset: 1440)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1368, file: !25, line: 1861, baseType: !1546, size: 32, align: 32, offset: 1472)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1368, file: !25, line: 1868, baseType: !1546, size: 32, align: 32, offset: 1504)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1368, file: !25, line: 1875, baseType: !1546, size: 32, align: 32, offset: 1536)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1368, file: !25, line: 1882, baseType: !1546, size: 32, align: 32, offset: 1568)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1368, file: !25, line: 1889, baseType: !1546, size: 32, align: 32, offset: 1600)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1368, file: !25, line: 1896, baseType: !1546, size: 32, align: 32, offset: 1632)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1368, file: !25, line: 1903, baseType: !1546, size: 32, align: 32, offset: 1664)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1368, file: !25, line: 1910, baseType: !1009, size: 32, align: 32, offset: 1696)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1368, file: !25, line: 1915, baseType: !1009, size: 32, align: 32, offset: 1728)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1368, file: !25, line: 1926, baseType: !1482, size: 64, align: 64, offset: 1792)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1368, file: !25, line: 1935, baseType: !1204, size: 64, align: 32, offset: 1856)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1368, file: !25, line: 1942, baseType: !1009, size: 32, align: 32, offset: 1920)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1368, file: !25, line: 1948, baseType: !1009, size: 32, align: 32, offset: 1952)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1368, file: !25, line: 1954, baseType: !1009, size: 32, align: 32, offset: 1984)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1368, file: !25, line: 1960, baseType: !1009, size: 32, align: 32, offset: 2016)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1368, file: !25, line: 1984, baseType: !1009, size: 32, align: 32, offset: 2048)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1368, file: !25, line: 1991, baseType: !1009, size: 32, align: 32, offset: 2080)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1368, file: !25, line: 1996, baseType: !1009, size: 32, align: 32, offset: 2112)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1368, file: !25, line: 2004, baseType: !1009, size: 32, align: 32, offset: 2144)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1368, file: !25, line: 2011, baseType: !1009, size: 32, align: 32, offset: 2176)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1368, file: !25, line: 2018, baseType: !1009, size: 32, align: 32, offset: 2208)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1368, file: !25, line: 2027, baseType: !1009, size: 32, align: 32, offset: 2240)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1368, file: !25, line: 2034, baseType: !1009, size: 32, align: 32, offset: 2272)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1368, file: !25, line: 2044, baseType: !1009, size: 32, align: 32, offset: 2304)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1368, file: !25, line: 2054, baseType: !1576, size: 64, align: 64, offset: 2368)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1368, file: !25, line: 2061, baseType: !1576, size: 64, align: 64, offset: 2432)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1368, file: !25, line: 2066, baseType: !1009, size: 32, align: 32, offset: 2496)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1368, file: !25, line: 2070, baseType: !1009, size: 32, align: 32, offset: 2528)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1368, file: !25, line: 2078, baseType: !1009, size: 32, align: 32, offset: 2560)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1368, file: !25, line: 2085, baseType: !1009, size: 32, align: 32, offset: 2592)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1368, file: !25, line: 2092, baseType: !1009, size: 32, align: 32, offset: 2624)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1368, file: !25, line: 2099, baseType: !1009, size: 32, align: 32, offset: 2656)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1368, file: !25, line: 2106, baseType: !1009, size: 32, align: 32, offset: 2688)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1368, file: !25, line: 2113, baseType: !1009, size: 32, align: 32, offset: 2720)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1368, file: !25, line: 2120, baseType: !1009, size: 32, align: 32, offset: 2752)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1368, file: !25, line: 2125, baseType: !1009, size: 32, align: 32, offset: 2784)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1368, file: !25, line: 2133, baseType: !1009, size: 32, align: 32, offset: 2816)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1368, file: !25, line: 2140, baseType: !1009, size: 32, align: 32, offset: 2848)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1368, file: !25, line: 2145, baseType: !1009, size: 32, align: 32, offset: 2880)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1368, file: !25, line: 2153, baseType: !1009, size: 32, align: 32, offset: 2912)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1368, file: !25, line: 2158, baseType: !1009, size: 32, align: 32, offset: 2944)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1368, file: !25, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1368, file: !25, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1368, file: !25, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1368, file: !25, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1368, file: !25, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1368, file: !25, line: 2203, baseType: !1009, size: 32, align: 32, offset: 3136)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1368, file: !25, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1368, file: !25, line: 2212, baseType: !1009, size: 32, align: 32, offset: 3200)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1368, file: !25, line: 2213, baseType: !1009, size: 32, align: 32, offset: 3232)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1368, file: !25, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1368, file: !25, line: 2232, baseType: !1009, size: 32, align: 32, offset: 3296)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1368, file: !25, line: 2243, baseType: !1009, size: 32, align: 32, offset: 3328)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1368, file: !25, line: 2249, baseType: !1009, size: 32, align: 32, offset: 3360)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1368, file: !25, line: 2256, baseType: !1009, size: 32, align: 32, offset: 3392)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1368, file: !25, line: 2263, baseType: !1219, size: 64, align: 64, offset: 3456)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1368, file: !25, line: 2270, baseType: !1219, size: 64, align: 64, offset: 3520)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1368, file: !25, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1368, file: !25, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1368, file: !25, line: 2367, baseType: !1612, size: 64, align: 64, offset: 3648)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DISubroutineType(types: !1614)
!1614 = !{!1009, !1539, !1185, !1009}
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1368, file: !25, line: 2383, baseType: !1009, size: 32, align: 32, offset: 3712)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1368, file: !25, line: 2386, baseType: !1546, size: 32, align: 32, offset: 3744)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1368, file: !25, line: 2387, baseType: !1546, size: 32, align: 32, offset: 3776)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1368, file: !25, line: 2394, baseType: !1009, size: 32, align: 32, offset: 3808)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1368, file: !25, line: 2401, baseType: !1009, size: 32, align: 32, offset: 3840)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1368, file: !25, line: 2408, baseType: !1009, size: 32, align: 32, offset: 3872)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1368, file: !25, line: 2415, baseType: !1009, size: 32, align: 32, offset: 3904)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1368, file: !25, line: 2422, baseType: !1009, size: 32, align: 32, offset: 3936)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1368, file: !25, line: 2423, baseType: !1624, size: 64, align: 64, offset: 3968)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !25, line: 831, baseType: !1626)
!1626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !25, line: 826, size: 128, align: 32, elements: !1627)
!1627 = !{!1628, !1629, !1630, !1631}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1626, file: !25, line: 827, baseType: !1009, size: 32, align: 32)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1626, file: !25, line: 828, baseType: !1009, size: 32, align: 32, offset: 32)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1626, file: !25, line: 829, baseType: !1009, size: 32, align: 32, offset: 64)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1626, file: !25, line: 830, baseType: !1546, size: 32, align: 32, offset: 96)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1368, file: !25, line: 2430, baseType: !1094, size: 64, align: 64, offset: 4032)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1368, file: !25, line: 2437, baseType: !1094, size: 64, align: 64, offset: 4096)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1368, file: !25, line: 2444, baseType: !1546, size: 32, align: 32, offset: 4160)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1368, file: !25, line: 2451, baseType: !1546, size: 32, align: 32, offset: 4192)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1368, file: !25, line: 2458, baseType: !1009, size: 32, align: 32, offset: 4224)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1368, file: !25, line: 2469, baseType: !1009, size: 32, align: 32, offset: 4256)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1368, file: !25, line: 2475, baseType: !1009, size: 32, align: 32, offset: 4288)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1368, file: !25, line: 2481, baseType: !1009, size: 32, align: 32, offset: 4320)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1368, file: !25, line: 2485, baseType: !1009, size: 32, align: 32, offset: 4352)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1368, file: !25, line: 2489, baseType: !1009, size: 32, align: 32, offset: 4384)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1368, file: !25, line: 2493, baseType: !1009, size: 32, align: 32, offset: 4416)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1368, file: !25, line: 2501, baseType: !1009, size: 32, align: 32, offset: 4448)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1368, file: !25, line: 2506, baseType: !1009, size: 32, align: 32, offset: 4480)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1368, file: !25, line: 2510, baseType: !1009, size: 32, align: 32, offset: 4512)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1368, file: !25, line: 2514, baseType: !1094, size: 64, align: 64, offset: 4544)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1368, file: !25, line: 2528, baseType: !1648, size: 64, align: 64, offset: 4608)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{null, !1539, !1003, !1009, !1009}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1368, file: !25, line: 2534, baseType: !1009, size: 32, align: 32, offset: 4672)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1368, file: !25, line: 2545, baseType: !1009, size: 32, align: 32, offset: 4704)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1368, file: !25, line: 2547, baseType: !1009, size: 32, align: 32, offset: 4736)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1368, file: !25, line: 2549, baseType: !1009, size: 32, align: 32, offset: 4768)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1368, file: !25, line: 2551, baseType: !1009, size: 32, align: 32, offset: 4800)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1368, file: !25, line: 2553, baseType: !1009, size: 32, align: 32, offset: 4832)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1368, file: !25, line: 2555, baseType: !1009, size: 32, align: 32, offset: 4864)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1368, file: !25, line: 2557, baseType: !1009, size: 32, align: 32, offset: 4896)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1368, file: !25, line: 2559, baseType: !1009, size: 32, align: 32, offset: 4928)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1368, file: !25, line: 2563, baseType: !1009, size: 32, align: 32, offset: 4960)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1368, file: !25, line: 2571, baseType: !1472, size: 64, align: 64, offset: 4992)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1368, file: !25, line: 2579, baseType: !1472, size: 64, align: 64, offset: 5056)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1368, file: !25, line: 2586, baseType: !1009, size: 32, align: 32, offset: 5120)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1368, file: !25, line: 2615, baseType: !1009, size: 32, align: 32, offset: 5152)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1368, file: !25, line: 2627, baseType: !1009, size: 32, align: 32, offset: 5184)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1368, file: !25, line: 2637, baseType: !1009, size: 32, align: 32, offset: 5216)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1368, file: !25, line: 2681, baseType: !1009, size: 32, align: 32, offset: 5248)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1368, file: !25, line: 2709, baseType: !1094, size: 64, align: 64, offset: 5312)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1368, file: !25, line: 2716, baseType: !1670, size: 64, align: 64, offset: 5376)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1672)
!1672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !25, line: 3636, size: 896, align: 64, elements: !1673)
!1673 = !{!1674, !1675, !1676, !1677, !1678, !1679, !1680, !1684, !1688, !1689, !1690, !1691, !1697, !1698, !1699, !1700, !1701}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1672, file: !25, line: 3642, baseType: !996, size: 64, align: 64)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1672, file: !25, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1672, file: !25, line: 3656, baseType: !55, size: 32, align: 32, offset: 96)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1672, file: !25, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1672, file: !25, line: 3669, baseType: !1009, size: 32, align: 32, offset: 160)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1672, file: !25, line: 3682, baseType: !1497, size: 64, align: 64, offset: 192)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1672, file: !25, line: 3698, baseType: !1681, size: 64, align: 64, offset: 256)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{!1009, !1366, !923, !1444}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1672, file: !25, line: 3712, baseType: !1685, size: 64, align: 64, offset: 320)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DISubroutineType(types: !1687)
!1687 = !{!1009, !1366, !1009, !923, !1444}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1672, file: !25, line: 3726, baseType: !1681, size: 64, align: 64, offset: 384)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1672, file: !25, line: 3737, baseType: !1413, size: 64, align: 64, offset: 448)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1672, file: !25, line: 3746, baseType: !1009, size: 32, align: 32, offset: 512)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1672, file: !25, line: 3757, baseType: !1692, size: 64, align: 64, offset: 576)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{null, !1695}
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64, align: 64)
!1696 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !25, line: 3617, flags: DIFlagFwdDecl)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1672, file: !25, line: 3766, baseType: !1413, size: 64, align: 64, offset: 640)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1672, file: !25, line: 3774, baseType: !1413, size: 64, align: 64, offset: 704)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1672, file: !25, line: 3780, baseType: !1009, size: 32, align: 32, offset: 768)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1672, file: !25, line: 3785, baseType: !1009, size: 32, align: 32, offset: 800)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1672, file: !25, line: 3795, baseType: !1702, size: 64, align: 64, offset: 832)
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
!1703 = !DISubroutineType(types: !1704)
!1704 = !{!1009, !1366, !1081}
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1368, file: !25, line: 2728, baseType: !1003, size: 64, align: 64, offset: 5440)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1368, file: !25, line: 2735, baseType: !1218, size: 512, align: 64, offset: 5504)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1368, file: !25, line: 2742, baseType: !1009, size: 32, align: 32, offset: 6016)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1368, file: !25, line: 2755, baseType: !1009, size: 32, align: 32, offset: 6048)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1368, file: !25, line: 2776, baseType: !1009, size: 32, align: 32, offset: 6080)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1368, file: !25, line: 2783, baseType: !1009, size: 32, align: 32, offset: 6112)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1368, file: !25, line: 2791, baseType: !1009, size: 32, align: 32, offset: 6144)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1368, file: !25, line: 2802, baseType: !1185, size: 64, align: 64, offset: 6208)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1368, file: !25, line: 2811, baseType: !1009, size: 32, align: 32, offset: 6272)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1368, file: !25, line: 2821, baseType: !1009, size: 32, align: 32, offset: 6304)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1368, file: !25, line: 2830, baseType: !1009, size: 32, align: 32, offset: 6336)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1368, file: !25, line: 2840, baseType: !1009, size: 32, align: 32, offset: 6368)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1368, file: !25, line: 2851, baseType: !1718, size: 64, align: 64, offset: 6400)
!1718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1719, size: 64, align: 64)
!1719 = !DISubroutineType(types: !1720)
!1720 = !{!1009, !1539, !1721, !1003, !1482, !1009, !1009}
!1721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1722, size: 64, align: 64)
!1722 = !DISubroutineType(types: !1723)
!1723 = !{!1009, !1539, !1003}
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1368, file: !25, line: 2871, baseType: !1725, size: 64, align: 64, offset: 6464)
!1725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1726, size: 64, align: 64)
!1726 = !DISubroutineType(types: !1727)
!1727 = !{!1009, !1539, !1728, !1003, !1482, !1009}
!1728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1729, size: 64, align: 64)
!1729 = !DISubroutineType(types: !1730)
!1730 = !{!1009, !1539, !1003, !1009, !1009}
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1368, file: !25, line: 2878, baseType: !1009, size: 32, align: 32, offset: 6528)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1368, file: !25, line: 2885, baseType: !1009, size: 32, align: 32, offset: 6560)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1368, file: !25, line: 3005, baseType: !1009, size: 32, align: 32, offset: 6592)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1368, file: !25, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1368, file: !25, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1368, file: !25, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1368, file: !25, line: 3037, baseType: !1091, size: 64, align: 64, offset: 6720)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1368, file: !25, line: 3038, baseType: !1009, size: 32, align: 32, offset: 6784)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1368, file: !25, line: 3050, baseType: !1219, size: 64, align: 64, offset: 6848)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1368, file: !25, line: 3065, baseType: !1009, size: 32, align: 32, offset: 6912)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1368, file: !25, line: 3083, baseType: !1009, size: 32, align: 32, offset: 6944)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1368, file: !25, line: 3092, baseType: !1204, size: 64, align: 32, offset: 6976)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1368, file: !25, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1368, file: !25, line: 3106, baseType: !1204, size: 64, align: 32, offset: 7072)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1368, file: !25, line: 3113, baseType: !1746, size: 64, align: 64, offset: 7168)
!1746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1747, size: 64, align: 64)
!1747 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1748)
!1748 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !25, line: 740, baseType: !1749)
!1749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !25, line: 712, size: 384, align: 64, elements: !1750)
!1750 = !{!1751, !1752, !1753, !1754, !1755, !1756, !1759}
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1749, file: !25, line: 713, baseType: !55, size: 32, align: 32)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1749, file: !25, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1749, file: !25, line: 720, baseType: !996, size: 64, align: 64, offset: 64)
