; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtspdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--rtspdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, {}*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, {}*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, {}*, {}*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVProbeData = type { i8*, i8*, i32, i8* }

!988 = !DIEnumerator(name: "RTSP_STATUS_NOT_ACCEPTABLE", value: 406)
!989 = !DIEnumerator(name: "RTSP_STATUS_PROXY_AUTH_REQUIRED", value: 407)
!990 = !DIEnumerator(name: "RTSP_STATUS_REQ_TIME_OUT", value: 408)
!991 = !DIEnumerator(name: "RTSP_STATUS_GONE", value: 410)
!992 = !DIEnumerator(name: "RTSP_STATUS_LENGTH_REQUIRED", value: 411)
!993 = !DIEnumerator(name: "RTSP_STATUS_PRECONDITION_FAILED", value: 412)
!994 = !DIEnumerator(name: "RTSP_STATUS_REQ_ENTITY_2LARGE", value: 413)
!995 = !DIEnumerator(name: "RTSP_STATUS_REQ_URI_2LARGE", value: 414)
!996 = !DIEnumerator(name: "RTSP_STATUS_UNSUPPORTED_MTYPE", value: 415)
!997 = !DIEnumerator(name: "RTSP_STATUS_PARAM_NOT_UNDERSTOOD", value: 451)
!998 = !DIEnumerator(name: "RTSP_STATUS_CONFERENCE_NOT_FOUND", value: 452)
!999 = !DIEnumerator(name: "RTSP_STATUS_BANDWIDTH", value: 453)
!1000 = !DIEnumerator(name: "RTSP_STATUS_SESSION", value: 454)
!1001 = !DIEnumerator(name: "RTSP_STATUS_STATE", value: 455)
!1002 = !DIEnumerator(name: "RTSP_STATUS_INVALID_HEADER_FIELD", value: 456)
!1003 = !DIEnumerator(name: "RTSP_STATUS_INVALID_RANGE", value: 457)
!1004 = !DIEnumerator(name: "RTSP_STATUS_RONLY_PARAMETER", value: 458)
!1005 = !DIEnumerator(name: "RTSP_STATUS_AGGREGATE", value: 459)
!1006 = !DIEnumerator(name: "RTSP_STATUS_ONLY_AGGREGATE", value: 460)
!1007 = !DIEnumerator(name: "RTSP_STATUS_TRANSPORT", value: 461)
!1008 = !DIEnumerator(name: "RTSP_STATUS_UNREACHABLE", value: 462)
!1009 = !DIEnumerator(name: "RTSP_STATUS_INTERNAL", value: 500)
!1010 = !DIEnumerator(name: "RTSP_STATUS_NOT_IMPLEMENTED", value: 501)
!1011 = !DIEnumerator(name: "RTSP_STATUS_BAD_GATEWAY", value: 502)
!1012 = !DIEnumerator(name: "RTSP_STATUS_SERVICE", value: 503)
!1013 = !DIEnumerator(name: "RTSP_STATUS_GATEWAY_TIME_OUT", value: 504)
!1014 = !DIEnumerator(name: "RTSP_STATUS_VERSION", value: 505)
!1015 = !DIEnumerator(name: "RTSP_STATUS_UNSUPPORTED_OPTION", value: 551)
!1016 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RTSPMethod", file: !970, line: 129, size: 32, align: 32, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029}
!1018 = !DIEnumerator(name: "DESCRIBE", value: 0)
!1019 = !DIEnumerator(name: "ANNOUNCE", value: 1)
!1020 = !DIEnumerator(name: "OPTIONS", value: 2)
!1021 = !DIEnumerator(name: "SETUP", value: 3)
!1022 = !DIEnumerator(name: "PLAY", value: 4)
!1023 = !DIEnumerator(name: "PAUSE", value: 5)
!1024 = !DIEnumerator(name: "TEARDOWN", value: 6)
!1025 = !DIEnumerator(name: "GET_PARAMETER", value: 7)
!1026 = !DIEnumerator(name: "SET_PARAMETER", value: 8)
!1027 = !DIEnumerator(name: "REDIRECT", value: 9)
!1028 = !DIEnumerator(name: "RECORD", value: 10)
!1029 = !DIEnumerator(name: "UNKNOWN", value: -1)
!1030 = !{!1031, !1032, !1033, !1036, !1045, !1046}
!1031 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1032 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1035 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !1039, line: 222, size: 16, align: 8, elements: !1040)
!1039 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1040 = !{!1041}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1038, file: !1039, line: 222, baseType: !1042, size: 16, align: 16)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1043, line: 49, baseType: !1044)
!1043 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1044 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1043, line: 40, baseType: !1047)
!1047 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1048 = !{!1049, !2288, !2297}
!1049 = distinct !DIGlobalVariable(name: "ff_rtsp_demuxer", scope: !0, file: !1050, line: 962, type: !1051, isLocal: false, isDefinition: true, variable: { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }* @ff_rtsp_demuxer)
!1050 = !DIFile(filename: "libavformat/rtspdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1068, !1147, !1148, !1150, !1151, !1152, !1166, !2269, !2270, !2271, !2275, !2279, !2280, !2281, !2285, !2286, !2287}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1052, file: !919, line: 638, baseType: !1033, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1052, file: !919, line: 645, baseType: !1033, size: 64, align: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1052, file: !919, line: 652, baseType: !1031, size: 32, align: 32, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1052, file: !919, line: 659, baseType: !1033, size: 64, align: 64, offset: 192)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1052, file: !919, line: 661, baseType: !1059, size: 64, align: 64, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1064, line: 44, size: 64, align: 32, elements: !1065)
!1064 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1065 = !{!1066, !1067}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1063, file: !1064, line: 45, baseType: !46, size: 32, align: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1063, file: !1064, line: 46, baseType: !1032, size: 32, align: 32, offset: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1052, file: !919, line: 663, baseType: !1069, size: 64, align: 64, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1071)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !1073)
!1073 = !{!1074, !1075, !1079, !1106, !1107, !1108, !1109, !1113, !1119, !1121, !1125}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1072, file: !26, line: 72, baseType: !1033, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1072, file: !26, line: 78, baseType: !1076, size: 64, align: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!1033, !1045}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1072, file: !26, line: 85, baseType: !1080, size: 64, align: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1083)
!1083 = !{!1084, !1085, !1086, !1087, !1088, !1102, !1103, !1104, !1105}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1082, file: !4, line: 247, baseType: !1033, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1082, file: !4, line: 253, baseType: !1033, size: 64, align: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1082, file: !4, line: 259, baseType: !1031, size: 32, align: 32, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1082, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1082, file: !4, line: 271, baseType: !1089, size: 64, align: 64, offset: 192)
!1089 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1082, file: !4, line: 265, size: 64, align: 64, elements: !1090)
!1090 = !{!1091, !1092, !1094, !1095}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1089, file: !4, line: 266, baseType: !1046, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1089, file: !4, line: 267, baseType: !1093, size: 64, align: 64)
!1093 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1089, file: !4, line: 268, baseType: !1033, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1089, file: !4, line: 270, baseType: !1096, size: 64, align: 32)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1097, line: 61, baseType: !1098)
!1097 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1097, line: 58, size: 64, align: 32, elements: !1099)
!1099 = !{!1100, !1101}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1098, file: !1097, line: 59, baseType: !1031, size: 32, align: 32)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1098, file: !1097, line: 60, baseType: !1031, size: 32, align: 32, offset: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1082, file: !4, line: 272, baseType: !1093, size: 64, align: 64, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1082, file: !4, line: 273, baseType: !1093, size: 64, align: 64, offset: 320)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1082, file: !4, line: 275, baseType: !1031, size: 32, align: 32, offset: 384)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1082, file: !4, line: 300, baseType: !1033, size: 64, align: 64, offset: 448)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1072, file: !26, line: 93, baseType: !1031, size: 32, align: 32, offset: 192)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1072, file: !26, line: 99, baseType: !1031, size: 32, align: 32, offset: 224)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1072, file: !26, line: 108, baseType: !1031, size: 32, align: 32, offset: 256)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1072, file: !26, line: 113, baseType: !1110, size: 64, align: 64, offset: 320)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!1045, !1045, !1045}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1072, file: !26, line: 123, baseType: !1114, size: 64, align: 64, offset: 384)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!1117, !1117}
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1072)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1072, file: !26, line: 130, baseType: !1120, size: 32, align: 32, offset: 448)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1072, file: !26, line: 136, baseType: !1122, size: 64, align: 64, offset: 512)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!1120, !1045}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1072, file: !26, line: 142, baseType: !1126, size: 64, align: 64, offset: 576)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!1031, !1129, !1045, !1033, !1031}
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1132)
!1132 = !{!1133, !1145, !1146}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1131, file: !4, line: 360, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1137)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1138)
!1138 = !{!1139, !1140, !1141, !1142, !1143, !1144}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1137, file: !4, line: 307, baseType: !1033, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1137, file: !4, line: 313, baseType: !1093, size: 64, align: 64, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1137, file: !4, line: 313, baseType: !1093, size: 64, align: 64, offset: 128)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1137, file: !4, line: 318, baseType: !1093, size: 64, align: 64, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1137, file: !4, line: 318, baseType: !1093, size: 64, align: 64, offset: 256)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1137, file: !4, line: 323, baseType: !1031, size: 32, align: 32, offset: 320)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1131, file: !4, line: 364, baseType: !1031, size: 32, align: 32, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1131, file: !4, line: 368, baseType: !1031, size: 32, align: 32, offset: 96)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1052, file: !919, line: 670, baseType: !1033, size: 64, align: 64, offset: 384)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1052, file: !919, line: 679, baseType: !1149, size: 64, align: 64, offset: 448)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1052, file: !919, line: 684, baseType: !1031, size: 32, align: 32, offset: 512)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1052, file: !919, line: 689, baseType: !1031, size: 32, align: 32, offset: 544)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1052, file: !919, line: 696, baseType: !1153, size: 64, align: 64, offset: 576)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!1031, !1156}
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1159)
!1159 = !{!1160, !1161, !1164, !1165}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1158, file: !919, line: 449, baseType: !1033, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1158, file: !919, line: 450, baseType: !1162, size: 64, align: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1158, file: !919, line: 451, baseType: !1031, size: 32, align: 32, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1158, file: !919, line: 452, baseType: !1033, size: 64, align: 64, offset: 192)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1052, file: !919, line: 703, baseType: !1167, size: 64, align: 64, offset: 640)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!1031, !1170}
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1172)
!1172 = !{!1173, !1174, !1175, !1367, !1368, !1433, !1434, !1435, !2126, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2180, !2181, !2182, !2183, !2184, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2235, !2236, !2239, !2240, !2241, !2242, !2243, !2244, !2246, !2247, !2248, !2249, !2257, !2258, !2262, !2266, !2267, !2268}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1171, file: !919, line: 1342, baseType: !1069, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1171, file: !919, line: 1349, baseType: !1149, size: 64, align: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1171, file: !919, line: 1356, baseType: !1176, size: 64, align: 64, offset: 128)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1178)
!1178 = !{!1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1232, !1233, !1237, !1241, !1246, !1253, !1342, !1348, !1354, !1355, !1356, !1357, !1361}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1177, file: !919, line: 498, baseType: !1033, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1177, file: !919, line: 504, baseType: !1033, size: 64, align: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1177, file: !919, line: 505, baseType: !1033, size: 64, align: 64, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1177, file: !919, line: 506, baseType: !1033, size: 64, align: 64, offset: 192)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1177, file: !919, line: 508, baseType: !46, size: 32, align: 32, offset: 256)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1177, file: !919, line: 509, baseType: !46, size: 32, align: 32, offset: 288)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1177, file: !919, line: 510, baseType: !46, size: 32, align: 32, offset: 320)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1177, file: !919, line: 517, baseType: !1031, size: 32, align: 32, offset: 352)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1177, file: !919, line: 523, baseType: !1059, size: 64, align: 64, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1177, file: !919, line: 526, baseType: !1069, size: 64, align: 64, offset: 448)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1177, file: !919, line: 535, baseType: !1176, size: 64, align: 64, offset: 512)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1177, file: !919, line: 539, baseType: !1031, size: 32, align: 32, offset: 576)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1177, file: !919, line: 541, baseType: !1167, size: 64, align: 64, offset: 640)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1177, file: !919, line: 549, baseType: !1193, size: 64, align: 64, offset: 704)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!1031, !1170, !1196}
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !47, line: 1499, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !47, line: 1445, size: 704, align: 64, elements: !1199)
!1199 = !{!1200, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1228, !1229, !1230, !1231}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1198, file: !47, line: 1451, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1203, line: 94, baseType: !1204)
!1203 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1203, line: 81, size: 192, align: 64, elements: !1205)
!1205 = !{!1206, !1210, !1213}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1204, file: !1203, line: 82, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1203, line: 73, baseType: !1209)
!1209 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1203, line: 73, flags: DIFlagFwdDecl)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1204, file: !1203, line: 89, baseType: !1211, size: 64, align: 64, offset: 64)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1043, line: 48, baseType: !1163)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1204, file: !1203, line: 93, baseType: !1031, size: 32, align: 32, offset: 128)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1198, file: !47, line: 1461, baseType: !1046, size: 64, align: 64, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1198, file: !47, line: 1467, baseType: !1046, size: 64, align: 64, offset: 128)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1198, file: !47, line: 1468, baseType: !1211, size: 64, align: 64, offset: 192)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1198, file: !47, line: 1469, baseType: !1031, size: 32, align: 32, offset: 256)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1198, file: !47, line: 1470, baseType: !1031, size: 32, align: 32, offset: 288)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1198, file: !47, line: 1474, baseType: !1031, size: 32, align: 32, offset: 320)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1198, file: !47, line: 1479, baseType: !1221, size: 64, align: 64, offset: 384)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !47, line: 1415, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !47, line: 1411, size: 128, align: 64, elements: !1224)
!1224 = !{!1225, !1226, !1227}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1223, file: !47, line: 1412, baseType: !1211, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1223, file: !47, line: 1413, baseType: !1031, size: 32, align: 32, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1223, file: !47, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1198, file: !47, line: 1480, baseType: !1031, size: 32, align: 32, offset: 448)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1198, file: !47, line: 1486, baseType: !1046, size: 64, align: 64, offset: 512)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1198, file: !47, line: 1488, baseType: !1046, size: 64, align: 64, offset: 576)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1198, file: !47, line: 1497, baseType: !1046, size: 64, align: 64, offset: 640)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1177, file: !919, line: 550, baseType: !1167, size: 64, align: 64, offset: 768)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1177, file: !919, line: 554, baseType: !1234, size: 64, align: 64, offset: 832)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!1031, !1170, !1196, !1196, !1031}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1177, file: !919, line: 563, baseType: !1238, size: 64, align: 64, offset: 896)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!1031, !46, !1031}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1177, file: !919, line: 565, baseType: !1242, size: 64, align: 64, offset: 960)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{null, !1170, !1031, !1245, !1245}
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1177, file: !919, line: 570, baseType: !1247, size: 64, align: 64, offset: 1024)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!1031, !1170, !1031, !1045, !1250}
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1251, line: 216, baseType: !1252)
!1251 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1252 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1177, file: !919, line: 581, baseType: !1254, size: 64, align: 64, offset: 1088)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!1031, !1170, !1031, !1257, !1032}
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1260)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1261)
!1261 = !{!1262, !1266, !1268, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1296, !1298, !1299, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1260, file: !548, line: 282, baseType: !1263, size: 512, align: 64)
!1263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1211, size: 512, align: 64, elements: !1264)
!1264 = !{!1265}
!1265 = !DISubrange(count: 8)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1260, file: !548, line: 299, baseType: !1267, size: 256, align: 32, offset: 512)
!1267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1031, size: 256, align: 32, elements: !1264)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1260, file: !548, line: 315, baseType: !1269, size: 64, align: 64, offset: 768)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1260, file: !548, line: 326, baseType: !1031, size: 32, align: 32, offset: 832)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1260, file: !548, line: 326, baseType: !1031, size: 32, align: 32, offset: 864)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1260, file: !548, line: 334, baseType: !1031, size: 32, align: 32, offset: 896)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1260, file: !548, line: 341, baseType: !1031, size: 32, align: 32, offset: 928)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1260, file: !548, line: 346, baseType: !1031, size: 32, align: 32, offset: 960)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1260, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1260, file: !548, line: 356, baseType: !1096, size: 64, align: 32, offset: 1024)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1260, file: !548, line: 361, baseType: !1046, size: 64, align: 64, offset: 1088)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1260, file: !548, line: 369, baseType: !1046, size: 64, align: 64, offset: 1152)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1260, file: !548, line: 377, baseType: !1046, size: 64, align: 64, offset: 1216)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1260, file: !548, line: 382, baseType: !1031, size: 32, align: 32, offset: 1280)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1260, file: !548, line: 386, baseType: !1031, size: 32, align: 32, offset: 1312)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1260, file: !548, line: 391, baseType: !1031, size: 32, align: 32, offset: 1344)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1260, file: !548, line: 396, baseType: !1045, size: 64, align: 64, offset: 1408)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1260, file: !548, line: 403, baseType: !1285, size: 512, align: 64, offset: 1472)
!1285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1286, size: 512, align: 64, elements: !1264)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1043, line: 55, baseType: !1252)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1260, file: !548, line: 410, baseType: !1031, size: 32, align: 32, offset: 1984)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1260, file: !548, line: 415, baseType: !1031, size: 32, align: 32, offset: 2016)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1260, file: !548, line: 420, baseType: !1031, size: 32, align: 32, offset: 2048)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1260, file: !548, line: 425, baseType: !1031, size: 32, align: 32, offset: 2080)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1260, file: !548, line: 435, baseType: !1046, size: 64, align: 64, offset: 2112)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1260, file: !548, line: 440, baseType: !1031, size: 32, align: 32, offset: 2176)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1260, file: !548, line: 445, baseType: !1286, size: 64, align: 64, offset: 2240)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1260, file: !548, line: 459, baseType: !1295, size: 512, align: 64, offset: 2304)
!1295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1201, size: 512, align: 64, elements: !1264)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1260, file: !548, line: 473, baseType: !1297, size: 64, align: 64, offset: 2816)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1260, file: !548, line: 477, baseType: !1031, size: 32, align: 32, offset: 2880)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1260, file: !548, line: 479, baseType: !1300, size: 64, align: 64, offset: 2944)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1304)
!1304 = !{!1305, !1306, !1307, !1308, !1313}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1303, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1303, file: !548, line: 203, baseType: !1211, size: 64, align: 64, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1303, file: !548, line: 204, baseType: !1031, size: 32, align: 32, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1303, file: !548, line: 205, baseType: !1309, size: 64, align: 64, offset: 192)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1311, line: 86, baseType: !1312)
!1311 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1312 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1311, line: 86, flags: DIFlagFwdDecl)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1303, file: !548, line: 206, baseType: !1201, size: 64, align: 64, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1260, file: !548, line: 480, baseType: !1031, size: 32, align: 32, offset: 3008)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1260, file: !548, line: 505, baseType: !1031, size: 32, align: 32, offset: 3040)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1260, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1260, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1260, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1260, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1260, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1260, file: !548, line: 532, baseType: !1046, size: 64, align: 64, offset: 3264)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1260, file: !548, line: 539, baseType: !1046, size: 64, align: 64, offset: 3328)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1260, file: !548, line: 547, baseType: !1046, size: 64, align: 64, offset: 3392)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1260, file: !548, line: 554, baseType: !1309, size: 64, align: 64, offset: 3456)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1260, file: !548, line: 563, baseType: !1031, size: 32, align: 32, offset: 3520)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1260, file: !548, line: 572, baseType: !1031, size: 32, align: 32, offset: 3552)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1260, file: !548, line: 581, baseType: !1031, size: 32, align: 32, offset: 3584)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1260, file: !548, line: 588, baseType: !1329, size: 64, align: 64, offset: 3648)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1043, line: 36, baseType: !1331)
!1331 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1260, file: !548, line: 593, baseType: !1031, size: 32, align: 32, offset: 3712)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1260, file: !548, line: 596, baseType: !1031, size: 32, align: 32, offset: 3744)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1260, file: !548, line: 599, baseType: !1201, size: 64, align: 64, offset: 3776)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1260, file: !548, line: 605, baseType: !1201, size: 64, align: 64, offset: 3840)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1260, file: !548, line: 616, baseType: !1201, size: 64, align: 64, offset: 3904)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1260, file: !548, line: 626, baseType: !1250, size: 64, align: 64, offset: 3968)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1260, file: !548, line: 627, baseType: !1250, size: 64, align: 64, offset: 4032)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1260, file: !548, line: 628, baseType: !1250, size: 64, align: 64, offset: 4096)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1260, file: !548, line: 629, baseType: !1250, size: 64, align: 64, offset: 4160)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1260, file: !548, line: 645, baseType: !1201, size: 64, align: 64, offset: 4224)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1177, file: !919, line: 587, baseType: !1343, size: 64, align: 64, offset: 1152)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{!1031, !1170, !1346}
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1177, file: !919, line: 592, baseType: !1349, size: 64, align: 64, offset: 1216)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!1031, !1170, !1352}
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1177, file: !919, line: 597, baseType: !1349, size: 64, align: 64, offset: 1280)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1177, file: !919, line: 598, baseType: !46, size: 32, align: 32, offset: 1344)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1177, file: !919, line: 608, baseType: !1167, size: 64, align: 64, offset: 1408)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1177, file: !919, line: 617, baseType: !1358, size: 64, align: 64, offset: 1472)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DISubroutineType(types: !1360)
!1360 = !{null, !1170}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1177, file: !919, line: 623, baseType: !1362, size: 64, align: 64, offset: 1536)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{!1031, !1170, !1365}
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1197)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1171, file: !919, line: 1365, baseType: !1045, size: 64, align: 64, offset: 192)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1171, file: !919, line: 1379, baseType: !1369, size: 64, align: 64, offset: 256)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1372)
!1372 = !{!1373, !1374, !1375, !1376, !1377, !1378, !1379, !1383, !1384, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1400, !1401, !1405, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1423, !1424, !1425, !1426, !1430, !1431, !1432}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1371, file: !650, line: 174, baseType: !1069, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1371, file: !650, line: 226, baseType: !1162, size: 64, align: 64, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1371, file: !650, line: 227, baseType: !1031, size: 32, align: 32, offset: 128)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1371, file: !650, line: 228, baseType: !1162, size: 64, align: 64, offset: 192)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1371, file: !650, line: 229, baseType: !1162, size: 64, align: 64, offset: 256)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1371, file: !650, line: 233, baseType: !1045, size: 64, align: 64, offset: 320)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1371, file: !650, line: 235, baseType: !1380, size: 64, align: 64, offset: 384)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DISubroutineType(types: !1382)
!1382 = !{!1031, !1045, !1211, !1031}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1371, file: !650, line: 236, baseType: !1380, size: 64, align: 64, offset: 448)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1371, file: !650, line: 237, baseType: !1385, size: 64, align: 64, offset: 512)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DISubroutineType(types: !1387)
!1387 = !{!1046, !1045, !1046, !1031}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1371, file: !650, line: 238, baseType: !1046, size: 64, align: 64, offset: 576)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1371, file: !650, line: 239, baseType: !1031, size: 32, align: 32, offset: 640)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1371, file: !650, line: 240, baseType: !1031, size: 32, align: 32, offset: 672)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1371, file: !650, line: 241, baseType: !1031, size: 32, align: 32, offset: 704)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1371, file: !650, line: 242, baseType: !1252, size: 64, align: 64, offset: 768)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1371, file: !650, line: 243, baseType: !1162, size: 64, align: 64, offset: 832)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1371, file: !650, line: 244, baseType: !1395, size: 64, align: 64, offset: 896)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DISubroutineType(types: !1397)
!1397 = !{!1252, !1252, !1398, !1032}
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1212)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1371, file: !650, line: 245, baseType: !1031, size: 32, align: 32, offset: 960)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1371, file: !650, line: 249, baseType: !1402, size: 64, align: 64, offset: 1024)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DISubroutineType(types: !1404)
!1404 = !{!1031, !1045, !1031}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1371, file: !650, line: 255, baseType: !1406, size: 64, align: 64, offset: 1088)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DISubroutineType(types: !1408)
!1408 = !{!1046, !1045, !1031, !1046, !1031}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1371, file: !650, line: 260, baseType: !1031, size: 32, align: 32, offset: 1152)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1371, file: !650, line: 266, baseType: !1046, size: 64, align: 64, offset: 1216)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1371, file: !650, line: 273, baseType: !1031, size: 32, align: 32, offset: 1280)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1371, file: !650, line: 279, baseType: !1046, size: 64, align: 64, offset: 1344)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1371, file: !650, line: 285, baseType: !1031, size: 32, align: 32, offset: 1408)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1371, file: !650, line: 291, baseType: !1031, size: 32, align: 32, offset: 1440)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1371, file: !650, line: 298, baseType: !1031, size: 32, align: 32, offset: 1472)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1371, file: !650, line: 304, baseType: !1031, size: 32, align: 32, offset: 1504)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1371, file: !650, line: 309, baseType: !1033, size: 64, align: 64, offset: 1536)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1371, file: !650, line: 314, baseType: !1033, size: 64, align: 64, offset: 1600)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1371, file: !650, line: 319, baseType: !1420, size: 64, align: 64, offset: 1664)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DISubroutineType(types: !1422)
!1422 = !{!1031, !1045, !1211, !1031, !649, !1046}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1371, file: !650, line: 326, baseType: !1031, size: 32, align: 32, offset: 1728)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1371, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1371, file: !650, line: 332, baseType: !1046, size: 64, align: 64, offset: 1792)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1371, file: !650, line: 338, baseType: !1427, size: 64, align: 64, offset: 1856)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!1031, !1045}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1371, file: !650, line: 340, baseType: !1046, size: 64, align: 64, offset: 1920)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1371, file: !650, line: 346, baseType: !1162, size: 64, align: 64, offset: 1984)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1371, file: !650, line: 351, baseType: !1031, size: 32, align: 32, offset: 2048)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1171, file: !919, line: 1386, baseType: !1031, size: 32, align: 32, offset: 320)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1171, file: !919, line: 1393, baseType: !1032, size: 32, align: 32, offset: 352)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1171, file: !919, line: 1405, baseType: !1436, size: 64, align: 64, offset: 384)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1439)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1440)
!1440 = !{!1441, !1442, !1443, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1912, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !2012, !2018, !2019, !2023, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2055, !2056, !2057, !2058, !2059, !2060}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1439, file: !919, line: 866, baseType: !1031, size: 32, align: 32)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1439, file: !919, line: 872, baseType: !1031, size: 32, align: 32, offset: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1439, file: !919, line: 878, baseType: !1444, size: 64, align: 64, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !47, line: 3360, baseType: !1446)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !47, line: 1556, size: 8448, align: 64, elements: !1447)
!1447 = !{!1448, !1449, !1450, !1451, !1587, !1588, !1589, !1590, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1616, !1620, !1621, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1800, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1446, file: !47, line: 1561, baseType: !1069, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1446, file: !47, line: 1562, baseType: !1031, size: 32, align: 32, offset: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1446, file: !47, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1446, file: !47, line: 1565, baseType: !1452, size: 64, align: 64, offset: 128)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1454)
!1454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !47, line: 3468, size: 1984, align: 64, elements: !1455)
!1455 = !{!1456, !1457, !1458, !1459, !1460, !1461, !1464, !1467, !1470, !1473, !1476, !1477, !1478, !1486, !1487, !1488, !1490, !1494, !1500, !1505, !1509, !1510, !1552, !1559, !1563, !1564, !1568, !1572, !1576, !1580, !1581, !1582}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1454, file: !47, line: 3475, baseType: !1033, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1454, file: !47, line: 3480, baseType: !1033, size: 64, align: 64, offset: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1454, file: !47, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1454, file: !47, line: 3482, baseType: !46, size: 32, align: 32, offset: 160)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1454, file: !47, line: 3487, baseType: !1031, size: 32, align: 32, offset: 192)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1454, file: !47, line: 3488, baseType: !1462, size: 64, align: 64, offset: 256)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1096)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1454, file: !47, line: 3489, baseType: !1465, size: 64, align: 64, offset: 320)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1454, file: !47, line: 3490, baseType: !1468, size: 64, align: 64, offset: 384)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1454, file: !47, line: 3491, baseType: !1471, size: 64, align: 64, offset: 448)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1454, file: !47, line: 3492, baseType: !1474, size: 64, align: 64, offset: 512)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64, align: 64)
!1475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1286)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1454, file: !47, line: 3493, baseType: !1212, size: 8, align: 8, offset: 576)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1454, file: !47, line: 3494, baseType: !1069, size: 64, align: 64, offset: 640)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1454, file: !47, line: 3495, baseType: !1479, size: 64, align: 64, offset: 704)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1481)
!1481 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !47, line: 3404, baseType: !1482)
!1482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !47, line: 3401, size: 128, align: 64, elements: !1483)
!1483 = !{!1484, !1485}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1482, file: !47, line: 3402, baseType: !1031, size: 32, align: 32)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1482, file: !47, line: 3403, baseType: !1033, size: 64, align: 64, offset: 64)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1454, file: !47, line: 3507, baseType: !1033, size: 64, align: 64, offset: 768)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1454, file: !47, line: 3516, baseType: !1031, size: 32, align: 32, offset: 832)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1454, file: !47, line: 3517, baseType: !1489, size: 64, align: 64, offset: 896)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1454, file: !47, line: 3527, baseType: !1491, size: 64, align: 64, offset: 960)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!1031, !1444}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1454, file: !47, line: 3535, baseType: !1495, size: 64, align: 64, offset: 1024)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!1031, !1444, !1498}
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1445)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1454, file: !47, line: 3541, baseType: !1501, size: 64, align: 64, offset: 1088)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1503)
!1503 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !47, line: 3461, baseType: !1504)
!1504 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !47, line: 3461, flags: DIFlagFwdDecl)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1454, file: !47, line: 3549, baseType: !1506, size: 64, align: 64, offset: 1152)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{null, !1489}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1454, file: !47, line: 3551, baseType: !1491, size: 64, align: 64, offset: 1216)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1454, file: !47, line: 3552, baseType: !1511, size: 64, align: 64, offset: 1280)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{!1031, !1444, !1211, !1031, !1514}
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1516)
!1516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !47, line: 3920, size: 256, align: 64, elements: !1517)
!1517 = !{!1518, !1519, !1521, !1522, !1523, !1551}
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1516, file: !47, line: 3921, baseType: !1042, size: 16, align: 16)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1516, file: !47, line: 3922, baseType: !1520, size: 32, align: 32, offset: 32)
!1520 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1043, line: 51, baseType: !1032)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1516, file: !47, line: 3923, baseType: !1520, size: 32, align: 32, offset: 64)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1516, file: !47, line: 3924, baseType: !1032, size: 32, align: 32, offset: 96)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1516, file: !47, line: 3925, baseType: !1524, size: 64, align: 64, offset: 128)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !47, line: 3918, baseType: !1527)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !47, line: 3885, size: 1600, align: 64, elements: !1528)
!1528 = !{!1529, !1530, !1531, !1532, !1533, !1534, !1540, !1544, !1546, !1547, !1549, !1550}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1527, file: !47, line: 3886, baseType: !1031, size: 32, align: 32)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1527, file: !47, line: 3887, baseType: !1031, size: 32, align: 32, offset: 32)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1527, file: !47, line: 3888, baseType: !1031, size: 32, align: 32, offset: 64)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1527, file: !47, line: 3889, baseType: !1031, size: 32, align: 32, offset: 96)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1527, file: !47, line: 3890, baseType: !1031, size: 32, align: 32, offset: 128)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1527, file: !47, line: 3897, baseType: !1535, size: 768, align: 64, offset: 192)
!1535 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !47, line: 3858, baseType: !1536)
!1536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !47, line: 3853, size: 768, align: 64, elements: !1537)
!1537 = !{!1538, !1539}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1536, file: !47, line: 3855, baseType: !1263, size: 512, align: 64)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1536, file: !47, line: 3857, baseType: !1267, size: 256, align: 32, offset: 512)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1527, file: !47, line: 3903, baseType: !1541, size: 256, align: 64, offset: 960)
!1541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1211, size: 256, align: 64, elements: !1542)
!1542 = !{!1543}
!1543 = !DISubrange(count: 4)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1527, file: !47, line: 3904, baseType: !1545, size: 128, align: 32, offset: 1216)
!1545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1031, size: 128, align: 32, elements: !1542)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1527, file: !47, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1527, file: !47, line: 3908, baseType: !1548, size: 64, align: 64, offset: 1408)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1527, file: !47, line: 3915, baseType: !1548, size: 64, align: 64, offset: 1472)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1527, file: !47, line: 3917, baseType: !1031, size: 32, align: 32, offset: 1536)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1516, file: !47, line: 3926, baseType: !1046, size: 64, align: 64, offset: 192)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1454, file: !47, line: 3564, baseType: !1553, size: 64, align: 64, offset: 1344)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DISubroutineType(types: !1555)
!1555 = !{!1031, !1444, !1196, !1556, !1558}
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1259)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1454, file: !47, line: 3566, baseType: !1560, size: 64, align: 64, offset: 1408)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DISubroutineType(types: !1562)
!1562 = !{!1031, !1444, !1045, !1558, !1196}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1454, file: !47, line: 3567, baseType: !1491, size: 64, align: 64, offset: 1472)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1454, file: !47, line: 3576, baseType: !1565, size: 64, align: 64, offset: 1536)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64, align: 64)
!1566 = !DISubroutineType(types: !1567)
!1567 = !{!1031, !1444, !1556}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1454, file: !47, line: 3577, baseType: !1569, size: 64, align: 64, offset: 1600)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DISubroutineType(types: !1571)
!1571 = !{!1031, !1444, !1196}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1454, file: !47, line: 3584, baseType: !1573, size: 64, align: 64, offset: 1664)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DISubroutineType(types: !1575)
!1575 = !{!1031, !1444, !1258}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1454, file: !47, line: 3589, baseType: !1577, size: 64, align: 64, offset: 1728)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DISubroutineType(types: !1579)
!1579 = !{null, !1444}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1454, file: !47, line: 3594, baseType: !1031, size: 32, align: 32, offset: 1792)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1454, file: !47, line: 3600, baseType: !1033, size: 64, align: 64, offset: 1856)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1454, file: !47, line: 3609, baseType: !1583, size: 64, align: 64, offset: 1920)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1586)
!1586 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !47, line: 3609, flags: DIFlagFwdDecl)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1446, file: !47, line: 1566, baseType: !46, size: 32, align: 32, offset: 192)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1446, file: !47, line: 1581, baseType: !1032, size: 32, align: 32, offset: 224)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1446, file: !47, line: 1583, baseType: !1045, size: 64, align: 64, offset: 256)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1446, file: !47, line: 1591, baseType: !1591, size: 64, align: 64, offset: 320)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1592 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !47, line: 1532, flags: DIFlagFwdDecl)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1446, file: !47, line: 1598, baseType: !1045, size: 64, align: 64, offset: 384)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1446, file: !47, line: 1606, baseType: !1046, size: 64, align: 64, offset: 448)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1446, file: !47, line: 1614, baseType: !1031, size: 32, align: 32, offset: 512)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1446, file: !47, line: 1622, baseType: !1031, size: 32, align: 32, offset: 544)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1446, file: !47, line: 1628, baseType: !1031, size: 32, align: 32, offset: 576)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1446, file: !47, line: 1636, baseType: !1031, size: 32, align: 32, offset: 608)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1446, file: !47, line: 1643, baseType: !1031, size: 32, align: 32, offset: 640)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1446, file: !47, line: 1657, baseType: !1211, size: 64, align: 64, offset: 704)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1446, file: !47, line: 1658, baseType: !1031, size: 32, align: 32, offset: 768)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1446, file: !47, line: 1679, baseType: !1096, size: 64, align: 32, offset: 800)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1446, file: !47, line: 1688, baseType: !1031, size: 32, align: 32, offset: 864)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1446, file: !47, line: 1712, baseType: !1031, size: 32, align: 32, offset: 896)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1446, file: !47, line: 1729, baseType: !1031, size: 32, align: 32, offset: 928)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1446, file: !47, line: 1729, baseType: !1031, size: 32, align: 32, offset: 960)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1446, file: !47, line: 1744, baseType: !1031, size: 32, align: 32, offset: 992)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1446, file: !47, line: 1744, baseType: !1031, size: 32, align: 32, offset: 1024)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1446, file: !47, line: 1751, baseType: !1031, size: 32, align: 32, offset: 1056)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1446, file: !47, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1446, file: !47, line: 1791, baseType: !1612, size: 64, align: 64, offset: 1152)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DISubroutineType(types: !1614)
!1614 = !{null, !1615, !1556, !1558, !1031, !1031, !1031}
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1446, file: !47, line: 1808, baseType: !1617, size: 64, align: 64, offset: 1216)
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64, align: 64)
!1618 = !DISubroutineType(types: !1619)
!1619 = !{!667, !1615, !1465}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1446, file: !47, line: 1816, baseType: !1031, size: 32, align: 32, offset: 1280)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1446, file: !47, line: 1825, baseType: !1622, size: 32, align: 32, offset: 1312)
!1622 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1446, file: !47, line: 1830, baseType: !1031, size: 32, align: 32, offset: 1344)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1446, file: !47, line: 1838, baseType: !1622, size: 32, align: 32, offset: 1376)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1446, file: !47, line: 1846, baseType: !1031, size: 32, align: 32, offset: 1408)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1446, file: !47, line: 1851, baseType: !1031, size: 32, align: 32, offset: 1440)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1446, file: !47, line: 1861, baseType: !1622, size: 32, align: 32, offset: 1472)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1446, file: !47, line: 1868, baseType: !1622, size: 32, align: 32, offset: 1504)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1446, file: !47, line: 1875, baseType: !1622, size: 32, align: 32, offset: 1536)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1446, file: !47, line: 1882, baseType: !1622, size: 32, align: 32, offset: 1568)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1446, file: !47, line: 1889, baseType: !1622, size: 32, align: 32, offset: 1600)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1446, file: !47, line: 1896, baseType: !1622, size: 32, align: 32, offset: 1632)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1446, file: !47, line: 1903, baseType: !1622, size: 32, align: 32, offset: 1664)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1446, file: !47, line: 1910, baseType: !1031, size: 32, align: 32, offset: 1696)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1446, file: !47, line: 1915, baseType: !1031, size: 32, align: 32, offset: 1728)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1446, file: !47, line: 1926, baseType: !1558, size: 64, align: 64, offset: 1792)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1446, file: !47, line: 1935, baseType: !1096, size: 64, align: 32, offset: 1856)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1446, file: !47, line: 1942, baseType: !1031, size: 32, align: 32, offset: 1920)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1446, file: !47, line: 1948, baseType: !1031, size: 32, align: 32, offset: 1952)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1446, file: !47, line: 1954, baseType: !1031, size: 32, align: 32, offset: 1984)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1446, file: !47, line: 1960, baseType: !1031, size: 32, align: 32, offset: 2016)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1446, file: !47, line: 1984, baseType: !1031, size: 32, align: 32, offset: 2048)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1446, file: !47, line: 1991, baseType: !1031, size: 32, align: 32, offset: 2080)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1446, file: !47, line: 1996, baseType: !1031, size: 32, align: 32, offset: 2112)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1446, file: !47, line: 2004, baseType: !1031, size: 32, align: 32, offset: 2144)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1446, file: !47, line: 2011, baseType: !1031, size: 32, align: 32, offset: 2176)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1446, file: !47, line: 2018, baseType: !1031, size: 32, align: 32, offset: 2208)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1446, file: !47, line: 2027, baseType: !1031, size: 32, align: 32, offset: 2240)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1446, file: !47, line: 2034, baseType: !1031, size: 32, align: 32, offset: 2272)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1446, file: !47, line: 2044, baseType: !1031, size: 32, align: 32, offset: 2304)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1446, file: !47, line: 2054, baseType: !1652, size: 64, align: 64, offset: 2368)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1446, file: !47, line: 2061, baseType: !1652, size: 64, align: 64, offset: 2432)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1446, file: !47, line: 2066, baseType: !1031, size: 32, align: 32, offset: 2496)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1446, file: !47, line: 2070, baseType: !1031, size: 32, align: 32, offset: 2528)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1446, file: !47, line: 2078, baseType: !1031, size: 32, align: 32, offset: 2560)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1446, file: !47, line: 2085, baseType: !1031, size: 32, align: 32, offset: 2592)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1446, file: !47, line: 2092, baseType: !1031, size: 32, align: 32, offset: 2624)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1446, file: !47, line: 2099, baseType: !1031, size: 32, align: 32, offset: 2656)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1446, file: !47, line: 2106, baseType: !1031, size: 32, align: 32, offset: 2688)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1446, file: !47, line: 2113, baseType: !1031, size: 32, align: 32, offset: 2720)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1446, file: !47, line: 2120, baseType: !1031, size: 32, align: 32, offset: 2752)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1446, file: !47, line: 2125, baseType: !1031, size: 32, align: 32, offset: 2784)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1446, file: !47, line: 2133, baseType: !1031, size: 32, align: 32, offset: 2816)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1446, file: !47, line: 2140, baseType: !1031, size: 32, align: 32, offset: 2848)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1446, file: !47, line: 2145, baseType: !1031, size: 32, align: 32, offset: 2880)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1446, file: !47, line: 2153, baseType: !1031, size: 32, align: 32, offset: 2912)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1446, file: !47, line: 2158, baseType: !1031, size: 32, align: 32, offset: 2944)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1446, file: !47, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1446, file: !47, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1446, file: !47, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1446, file: !47, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1446, file: !47, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1446, file: !47, line: 2203, baseType: !1031, size: 32, align: 32, offset: 3136)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1446, file: !47, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1446, file: !47, line: 2212, baseType: !1031, size: 32, align: 32, offset: 3200)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1446, file: !47, line: 2213, baseType: !1031, size: 32, align: 32, offset: 3232)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1446, file: !47, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1446, file: !47, line: 2232, baseType: !1031, size: 32, align: 32, offset: 3296)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1446, file: !47, line: 2243, baseType: !1031, size: 32, align: 32, offset: 3328)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1446, file: !47, line: 2249, baseType: !1031, size: 32, align: 32, offset: 3360)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1446, file: !47, line: 2256, baseType: !1031, size: 32, align: 32, offset: 3392)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1446, file: !47, line: 2263, baseType: !1286, size: 64, align: 64, offset: 3456)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1446, file: !47, line: 2270, baseType: !1286, size: 64, align: 64, offset: 3520)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1446, file: !47, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1446, file: !47, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1446, file: !47, line: 2367, baseType: !1688, size: 64, align: 64, offset: 3648)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!1031, !1615, !1258, !1031}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1446, file: !47, line: 2383, baseType: !1031, size: 32, align: 32, offset: 3712)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1446, file: !47, line: 2386, baseType: !1622, size: 32, align: 32, offset: 3744)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1446, file: !47, line: 2387, baseType: !1622, size: 32, align: 32, offset: 3776)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1446, file: !47, line: 2394, baseType: !1031, size: 32, align: 32, offset: 3808)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1446, file: !47, line: 2401, baseType: !1031, size: 32, align: 32, offset: 3840)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1446, file: !47, line: 2408, baseType: !1031, size: 32, align: 32, offset: 3872)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1446, file: !47, line: 2415, baseType: !1031, size: 32, align: 32, offset: 3904)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1446, file: !47, line: 2422, baseType: !1031, size: 32, align: 32, offset: 3936)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1446, file: !47, line: 2423, baseType: !1700, size: 64, align: 64, offset: 3968)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64, align: 64)
!1701 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !47, line: 831, baseType: !1702)
!1702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !47, line: 826, size: 128, align: 32, elements: !1703)
!1703 = !{!1704, !1705, !1706, !1707}
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1702, file: !47, line: 827, baseType: !1031, size: 32, align: 32)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1702, file: !47, line: 828, baseType: !1031, size: 32, align: 32, offset: 32)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1702, file: !47, line: 829, baseType: !1031, size: 32, align: 32, offset: 64)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1702, file: !47, line: 830, baseType: !1622, size: 32, align: 32, offset: 96)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1446, file: !47, line: 2430, baseType: !1046, size: 64, align: 64, offset: 4032)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1446, file: !47, line: 2437, baseType: !1046, size: 64, align: 64, offset: 4096)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1446, file: !47, line: 2444, baseType: !1622, size: 32, align: 32, offset: 4160)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1446, file: !47, line: 2451, baseType: !1622, size: 32, align: 32, offset: 4192)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1446, file: !47, line: 2458, baseType: !1031, size: 32, align: 32, offset: 4224)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1446, file: !47, line: 2469, baseType: !1031, size: 32, align: 32, offset: 4256)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1446, file: !47, line: 2475, baseType: !1031, size: 32, align: 32, offset: 4288)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1446, file: !47, line: 2481, baseType: !1031, size: 32, align: 32, offset: 4320)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1446, file: !47, line: 2485, baseType: !1031, size: 32, align: 32, offset: 4352)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1446, file: !47, line: 2489, baseType: !1031, size: 32, align: 32, offset: 4384)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1446, file: !47, line: 2493, baseType: !1031, size: 32, align: 32, offset: 4416)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1446, file: !47, line: 2501, baseType: !1031, size: 32, align: 32, offset: 4448)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1446, file: !47, line: 2506, baseType: !1031, size: 32, align: 32, offset: 4480)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1446, file: !47, line: 2510, baseType: !1031, size: 32, align: 32, offset: 4512)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1446, file: !47, line: 2514, baseType: !1046, size: 64, align: 64, offset: 4544)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1446, file: !47, line: 2528, baseType: !1724, size: 64, align: 64, offset: 4608)
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1725, size: 64, align: 64)
!1725 = !DISubroutineType(types: !1726)
!1726 = !{null, !1615, !1045, !1031, !1031}
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1446, file: !47, line: 2534, baseType: !1031, size: 32, align: 32, offset: 4672)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1446, file: !47, line: 2545, baseType: !1031, size: 32, align: 32, offset: 4704)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1446, file: !47, line: 2547, baseType: !1031, size: 32, align: 32, offset: 4736)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1446, file: !47, line: 2549, baseType: !1031, size: 32, align: 32, offset: 4768)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1446, file: !47, line: 2551, baseType: !1031, size: 32, align: 32, offset: 4800)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1446, file: !47, line: 2553, baseType: !1031, size: 32, align: 32, offset: 4832)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1446, file: !47, line: 2555, baseType: !1031, size: 32, align: 32, offset: 4864)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1446, file: !47, line: 2557, baseType: !1031, size: 32, align: 32, offset: 4896)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1446, file: !47, line: 2559, baseType: !1031, size: 32, align: 32, offset: 4928)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1446, file: !47, line: 2563, baseType: !1031, size: 32, align: 32, offset: 4960)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1446, file: !47, line: 2571, baseType: !1548, size: 64, align: 64, offset: 4992)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1446, file: !47, line: 2579, baseType: !1548, size: 64, align: 64, offset: 5056)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1446, file: !47, line: 2586, baseType: !1031, size: 32, align: 32, offset: 5120)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1446, file: !47, line: 2615, baseType: !1031, size: 32, align: 32, offset: 5152)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1446, file: !47, line: 2627, baseType: !1031, size: 32, align: 32, offset: 5184)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1446, file: !47, line: 2637, baseType: !1031, size: 32, align: 32, offset: 5216)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1446, file: !47, line: 2681, baseType: !1031, size: 32, align: 32, offset: 5248)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1446, file: !47, line: 2709, baseType: !1046, size: 64, align: 64, offset: 5312)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1446, file: !47, line: 2716, baseType: !1746, size: 64, align: 64, offset: 5376)
!1746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1747, size: 64, align: 64)
!1747 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1748)
!1748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !47, line: 3636, size: 896, align: 64, elements: !1749)
!1749 = !{!1750, !1751, !1752, !1753, !1754, !1755, !1756, !1760, !1764, !1765, !1766, !1767, !1773, !1774, !1775, !1776, !1777}
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1748, file: !47, line: 3642, baseType: !1033, size: 64, align: 64)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1748, file: !47, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1748, file: !47, line: 3656, baseType: !46, size: 32, align: 32, offset: 96)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1748, file: !47, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1748, file: !47, line: 3669, baseType: !1031, size: 32, align: 32, offset: 160)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1748, file: !47, line: 3682, baseType: !1573, size: 64, align: 64, offset: 192)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1748, file: !47, line: 3698, baseType: !1757, size: 64, align: 64, offset: 256)
!1757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1758, size: 64, align: 64)
!1758 = !DISubroutineType(types: !1759)
!1759 = !{!1031, !1444, !1398, !1520}
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1748, file: !47, line: 3712, baseType: !1761, size: 64, align: 64, offset: 320)
!1761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1762, size: 64, align: 64)
!1762 = !DISubroutineType(types: !1763)
!1763 = !{!1031, !1444, !1031, !1398, !1520}
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1748, file: !47, line: 3726, baseType: !1757, size: 64, align: 64, offset: 384)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1748, file: !47, line: 3737, baseType: !1491, size: 64, align: 64, offset: 448)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1748, file: !47, line: 3746, baseType: !1031, size: 32, align: 32, offset: 512)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1748, file: !47, line: 3757, baseType: !1768, size: 64, align: 64, offset: 576)
!1768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1769, size: 64, align: 64)
!1769 = !DISubroutineType(types: !1770)
!1770 = !{null, !1771}
!1771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1772, size: 64, align: 64)
!1772 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !47, line: 3617, flags: DIFlagFwdDecl)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1748, file: !47, line: 3766, baseType: !1491, size: 64, align: 64, offset: 640)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1748, file: !47, line: 3774, baseType: !1491, size: 64, align: 64, offset: 704)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1748, file: !47, line: 3780, baseType: !1031, size: 32, align: 32, offset: 768)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1748, file: !47, line: 3785, baseType: !1031, size: 32, align: 32, offset: 800)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1748, file: !47, line: 3795, baseType: !1778, size: 64, align: 64, offset: 832)
!1778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1779, size: 64, align: 64)
!1779 = !DISubroutineType(types: !1780)
!1780 = !{!1031, !1444, !1201}
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1446, file: !47, line: 2728, baseType: !1045, size: 64, align: 64, offset: 5440)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1446, file: !47, line: 2735, baseType: !1285, size: 512, align: 64, offset: 5504)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1446, file: !47, line: 2742, baseType: !1031, size: 32, align: 32, offset: 6016)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1446, file: !47, line: 2755, baseType: !1031, size: 32, align: 32, offset: 6048)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1446, file: !47, line: 2776, baseType: !1031, size: 32, align: 32, offset: 6080)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1446, file: !47, line: 2783, baseType: !1031, size: 32, align: 32, offset: 6112)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1446, file: !47, line: 2791, baseType: !1031, size: 32, align: 32, offset: 6144)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1446, file: !47, line: 2802, baseType: !1258, size: 64, align: 64, offset: 6208)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1446, file: !47, line: 2811, baseType: !1031, size: 32, align: 32, offset: 6272)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1446, file: !47, line: 2821, baseType: !1031, size: 32, align: 32, offset: 6304)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1446, file: !47, line: 2830, baseType: !1031, size: 32, align: 32, offset: 6336)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1446, file: !47, line: 2840, baseType: !1031, size: 32, align: 32, offset: 6368)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1446, file: !47, line: 2851, baseType: !1794, size: 64, align: 64, offset: 6400)
!1794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1795, size: 64, align: 64)
!1795 = !DISubroutineType(types: !1796)
!1796 = !{!1031, !1615, !1797, !1045, !1558, !1031, !1031}
!1797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1798, size: 64, align: 64)
!1798 = !DISubroutineType(types: !1799)
!1799 = !{!1031, !1615, !1045}
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1446, file: !47, line: 2871, baseType: !1801, size: 64, align: 64, offset: 6464)
!1801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1802, size: 64, align: 64)
!1802 = !DISubroutineType(types: !1803)
!1803 = !{!1031, !1615, !1804, !1045, !1558, !1031}
!1804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1805, size: 64, align: 64)
!1805 = !DISubroutineType(types: !1806)
!1806 = !{!1031, !1615, !1045, !1031, !1031}
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1446, file: !47, line: 2878, baseType: !1031, size: 32, align: 32, offset: 6528)
