; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--mpeg.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--mpeg.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }

!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sub_sort", file: !939, line: 29, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "libavformat/subtitles.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!940 = !{!941, !942}
!941 = !DIEnumerator(name: "SUB_SORT_TS_POS", value: 0)
!942 = !DIEnumerator(name: "SUB_SORT_POS_TS", value: 1)
!943 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVRounding", file: !944, line: 79, size: 32, align: 32, elements: !945)
!944 = !DIFile(filename: "./libavutil/mathematics.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!945 = !{!946, !947, !948, !949, !950, !951}
!946 = !DIEnumerator(name: "AV_ROUND_ZERO", value: 0)
!947 = !DIEnumerator(name: "AV_ROUND_INF", value: 1)
!948 = !DIEnumerator(name: "AV_ROUND_DOWN", value: 2)
!949 = !DIEnumerator(name: "AV_ROUND_UP", value: 3)
!950 = !DIEnumerator(name: "AV_ROUND_NEAR_INF", value: 5)
!951 = !DIEnumerator(name: "AV_ROUND_PASS_MINMAX", value: 8192)
!952 = !{!953, !954, !955, !963, !965, !972}
!953 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!954 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !958, line: 221, size: 32, align: 8, elements: !959)
!958 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!959 = !{!960}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !957, file: !958, line: 221, baseType: !961, size: 32, align: 32)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !962, line: 51, baseType: !953)
!962 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !962, line: 40, baseType: !964)
!964 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !958, line: 222, size: 16, align: 8, elements: !968)
!968 = !{!969}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !967, file: !958, line: 222, baseType: !970, size: 16, align: 16)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !962, line: 49, baseType: !971)
!971 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!973 = !{!974, !2215, !2216, !2225, !2226}
!974 = distinct !DIGlobalVariable(name: "ff_mpegps_demuxer", scope: !0, file: !975, line: 690, type: !976, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_mpegps_demuxer)
!975 = !DIFile(filename: "libavformat/mpeg.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !978)
!978 = !{!979, !983, !984, !985, !986, !996, !1075, !1076, !1078, !1079, !1080, !1094, !2196, !2197, !2198, !2202, !2206, !2207, !2208, !2212, !2213, !2214}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !977, file: !919, line: 638, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !977, file: !919, line: 645, baseType: !980, size: 64, align: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !977, file: !919, line: 652, baseType: !954, size: 32, align: 32, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !977, file: !919, line: 659, baseType: !980, size: 64, align: 64, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !977, file: !919, line: 661, baseType: !987, size: 64, align: 64, offset: 256)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !992, line: 44, size: 64, align: 32, elements: !993)
!992 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !991, file: !992, line: 45, baseType: !3, size: 32, align: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !991, file: !992, line: 46, baseType: !953, size: 32, align: 32, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !977, file: !919, line: 663, baseType: !997, size: 64, align: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1001)
!1001 = !{!1002, !1003, !1007, !1034, !1035, !1036, !1037, !1041, !1047, !1049, !1053}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1000, file: !486, line: 72, baseType: !980, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1000, file: !486, line: 78, baseType: !1004, size: 64, align: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!980, !972}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1000, file: !486, line: 85, baseType: !1008, size: 64, align: 64, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016, !1030, !1031, !1032, !1033}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1010, file: !464, line: 247, baseType: !980, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1010, file: !464, line: 253, baseType: !980, size: 64, align: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1010, file: !464, line: 259, baseType: !954, size: 32, align: 32, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1010, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1010, file: !464, line: 271, baseType: !1017, size: 64, align: 64, offset: 192)
!1017 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1010, file: !464, line: 265, size: 64, align: 64, elements: !1018)
!1018 = !{!1019, !1020, !1022, !1023}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1017, file: !464, line: 266, baseType: !963, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1017, file: !464, line: 267, baseType: !1021, size: 64, align: 64)
!1021 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1017, file: !464, line: 268, baseType: !980, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1017, file: !464, line: 270, baseType: !1024, size: 64, align: 32)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1025, line: 61, baseType: !1026)
!1025 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1025, line: 58, size: 64, align: 32, elements: !1027)
!1027 = !{!1028, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1026, file: !1025, line: 59, baseType: !954, size: 32, align: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1026, file: !1025, line: 60, baseType: !954, size: 32, align: 32, offset: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1010, file: !464, line: 272, baseType: !1021, size: 64, align: 64, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1010, file: !464, line: 273, baseType: !1021, size: 64, align: 64, offset: 320)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1010, file: !464, line: 275, baseType: !954, size: 32, align: 32, offset: 384)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1010, file: !464, line: 300, baseType: !980, size: 64, align: 64, offset: 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1000, file: !486, line: 93, baseType: !954, size: 32, align: 32, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1000, file: !486, line: 99, baseType: !954, size: 32, align: 32, offset: 224)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1000, file: !486, line: 108, baseType: !954, size: 32, align: 32, offset: 256)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1000, file: !486, line: 113, baseType: !1038, size: 64, align: 64, offset: 320)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!972, !972, !972}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1000, file: !486, line: 123, baseType: !1042, size: 64, align: 64, offset: 384)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!1045, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1000, file: !486, line: 130, baseType: !1048, size: 32, align: 32, offset: 448)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1000, file: !486, line: 136, baseType: !1050, size: 64, align: 64, offset: 512)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!1048, !972}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1000, file: !486, line: 142, baseType: !1054, size: 64, align: 64, offset: 576)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!954, !1057, !972, !980, !954}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1060)
!1060 = !{!1061, !1073, !1074}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1059, file: !464, line: 360, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1070, !1071, !1072}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1065, file: !464, line: 307, baseType: !980, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1065, file: !464, line: 313, baseType: !1021, size: 64, align: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1065, file: !464, line: 313, baseType: !1021, size: 64, align: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1065, file: !464, line: 318, baseType: !1021, size: 64, align: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1065, file: !464, line: 318, baseType: !1021, size: 64, align: 64, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1065, file: !464, line: 323, baseType: !954, size: 32, align: 32, offset: 320)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1059, file: !464, line: 364, baseType: !954, size: 32, align: 32, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1059, file: !464, line: 368, baseType: !954, size: 32, align: 32, offset: 96)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !977, file: !919, line: 670, baseType: !980, size: 64, align: 64, offset: 384)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !977, file: !919, line: 679, baseType: !1077, size: 64, align: 64, offset: 448)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !977, file: !919, line: 684, baseType: !954, size: 32, align: 32, offset: 512)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !977, file: !919, line: 689, baseType: !954, size: 32, align: 32, offset: 544)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !977, file: !919, line: 696, baseType: !1081, size: 64, align: 64, offset: 576)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!954, !1084}
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1087)
!1087 = !{!1088, !1089, !1092, !1093}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1086, file: !919, line: 449, baseType: !980, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1086, file: !919, line: 450, baseType: !1090, size: 64, align: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1086, file: !919, line: 451, baseType: !954, size: 32, align: 32, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1086, file: !919, line: 452, baseType: !980, size: 64, align: 64, offset: 192)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !977, file: !919, line: 703, baseType: !1095, size: 64, align: 64, offset: 640)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!954, !1098}
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1295, !1296, !1361, !1362, !1363, !2053, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2107, !2108, !2109, !2110, !2111, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2162, !2163, !2166, !2167, !2168, !2169, !2170, !2171, !2173, !2174, !2175, !2176, !2184, !2185, !2189, !2193, !2194, !2195}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1099, file: !919, line: 1342, baseType: !997, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1099, file: !919, line: 1349, baseType: !1077, size: 64, align: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1099, file: !919, line: 1356, baseType: !1104, size: 64, align: 64, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1160, !1161, !1165, !1169, !1174, !1181, !1270, !1276, !1282, !1283, !1284, !1285, !1289}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1105, file: !919, line: 498, baseType: !980, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1105, file: !919, line: 504, baseType: !980, size: 64, align: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1105, file: !919, line: 505, baseType: !980, size: 64, align: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1105, file: !919, line: 506, baseType: !980, size: 64, align: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1105, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1105, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1105, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1105, file: !919, line: 517, baseType: !954, size: 32, align: 32, offset: 352)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1105, file: !919, line: 523, baseType: !987, size: 64, align: 64, offset: 384)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1105, file: !919, line: 526, baseType: !997, size: 64, align: 64, offset: 448)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1105, file: !919, line: 535, baseType: !1104, size: 64, align: 64, offset: 512)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1105, file: !919, line: 539, baseType: !954, size: 32, align: 32, offset: 576)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1105, file: !919, line: 541, baseType: !1095, size: 64, align: 64, offset: 640)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1105, file: !919, line: 549, baseType: !1121, size: 64, align: 64, offset: 704)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!954, !1098, !1124}
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1126)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1127)
!1127 = !{!1128, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1156, !1157, !1158, !1159}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1126, file: !4, line: 1451, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1131, line: 94, baseType: !1132)
!1131 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1131, line: 81, size: 192, align: 64, elements: !1133)
!1133 = !{!1134, !1138, !1141}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1132, file: !1131, line: 82, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1131, line: 73, baseType: !1137)
!1137 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1131, line: 73, flags: DIFlagFwdDecl)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1132, file: !1131, line: 89, baseType: !1139, size: 64, align: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !962, line: 48, baseType: !1091)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1132, file: !1131, line: 93, baseType: !954, size: 32, align: 32, offset: 128)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1126, file: !4, line: 1461, baseType: !963, size: 64, align: 64, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1126, file: !4, line: 1467, baseType: !963, size: 64, align: 64, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1126, file: !4, line: 1468, baseType: !1139, size: 64, align: 64, offset: 192)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1126, file: !4, line: 1469, baseType: !954, size: 32, align: 32, offset: 256)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1126, file: !4, line: 1470, baseType: !954, size: 32, align: 32, offset: 288)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1126, file: !4, line: 1474, baseType: !954, size: 32, align: 32, offset: 320)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1126, file: !4, line: 1479, baseType: !1149, size: 64, align: 64, offset: 384)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1151)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1152)
!1152 = !{!1153, !1154, !1155}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1151, file: !4, line: 1412, baseType: !1139, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1151, file: !4, line: 1413, baseType: !954, size: 32, align: 32, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1151, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1126, file: !4, line: 1480, baseType: !954, size: 32, align: 32, offset: 448)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1126, file: !4, line: 1486, baseType: !963, size: 64, align: 64, offset: 512)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1126, file: !4, line: 1488, baseType: !963, size: 64, align: 64, offset: 576)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1126, file: !4, line: 1497, baseType: !963, size: 64, align: 64, offset: 640)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1105, file: !919, line: 550, baseType: !1095, size: 64, align: 64, offset: 768)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1105, file: !919, line: 554, baseType: !1162, size: 64, align: 64, offset: 832)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!954, !1098, !1124, !1124, !954}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1105, file: !919, line: 563, baseType: !1166, size: 64, align: 64, offset: 896)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!954, !3, !954}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1105, file: !919, line: 565, baseType: !1170, size: 64, align: 64, offset: 960)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{null, !1098, !954, !1173, !1173}
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1105, file: !919, line: 570, baseType: !1175, size: 64, align: 64, offset: 1024)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!954, !1098, !954, !972, !1178}
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1179, line: 216, baseType: !1180)
!1179 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1180 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1105, file: !919, line: 581, baseType: !1182, size: 64, align: 64, offset: 1088)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!954, !1098, !954, !1185, !953}
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1188)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1189)
!1189 = !{!1190, !1194, !1196, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1224, !1226, !1227, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1188, file: !548, line: 282, baseType: !1191, size: 512, align: 64)
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 512, align: 64, elements: !1192)
!1192 = !{!1193}
!1193 = !DISubrange(count: 8)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1188, file: !548, line: 299, baseType: !1195, size: 256, align: 32, offset: 512)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 256, align: 32, elements: !1192)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1188, file: !548, line: 315, baseType: !1197, size: 64, align: 64, offset: 768)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1188, file: !548, line: 326, baseType: !954, size: 32, align: 32, offset: 832)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1188, file: !548, line: 326, baseType: !954, size: 32, align: 32, offset: 864)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1188, file: !548, line: 334, baseType: !954, size: 32, align: 32, offset: 896)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1188, file: !548, line: 341, baseType: !954, size: 32, align: 32, offset: 928)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1188, file: !548, line: 346, baseType: !954, size: 32, align: 32, offset: 960)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1188, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1188, file: !548, line: 356, baseType: !1024, size: 64, align: 32, offset: 1024)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1188, file: !548, line: 361, baseType: !963, size: 64, align: 64, offset: 1088)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1188, file: !548, line: 369, baseType: !963, size: 64, align: 64, offset: 1152)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1188, file: !548, line: 377, baseType: !963, size: 64, align: 64, offset: 1216)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1188, file: !548, line: 382, baseType: !954, size: 32, align: 32, offset: 1280)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1188, file: !548, line: 386, baseType: !954, size: 32, align: 32, offset: 1312)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1188, file: !548, line: 391, baseType: !954, size: 32, align: 32, offset: 1344)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1188, file: !548, line: 396, baseType: !972, size: 64, align: 64, offset: 1408)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1188, file: !548, line: 403, baseType: !1213, size: 512, align: 64, offset: 1472)
!1213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1214, size: 512, align: 64, elements: !1192)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !962, line: 55, baseType: !1180)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1188, file: !548, line: 410, baseType: !954, size: 32, align: 32, offset: 1984)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1188, file: !548, line: 415, baseType: !954, size: 32, align: 32, offset: 2016)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1188, file: !548, line: 420, baseType: !954, size: 32, align: 32, offset: 2048)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1188, file: !548, line: 425, baseType: !954, size: 32, align: 32, offset: 2080)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1188, file: !548, line: 435, baseType: !963, size: 64, align: 64, offset: 2112)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1188, file: !548, line: 440, baseType: !954, size: 32, align: 32, offset: 2176)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1188, file: !548, line: 445, baseType: !1214, size: 64, align: 64, offset: 2240)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1188, file: !548, line: 459, baseType: !1223, size: 512, align: 64, offset: 2304)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1129, size: 512, align: 64, elements: !1192)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1188, file: !548, line: 473, baseType: !1225, size: 64, align: 64, offset: 2816)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1188, file: !548, line: 477, baseType: !954, size: 32, align: 32, offset: 2880)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1188, file: !548, line: 479, baseType: !1228, size: 64, align: 64, offset: 2944)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1232)
!1232 = !{!1233, !1234, !1235, !1236, !1241}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1231, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1231, file: !548, line: 203, baseType: !1139, size: 64, align: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1231, file: !548, line: 204, baseType: !954, size: 32, align: 32, offset: 128)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1231, file: !548, line: 205, baseType: !1237, size: 64, align: 64, offset: 192)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1239, line: 86, baseType: !1240)
!1239 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1240 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1239, line: 86, flags: DIFlagFwdDecl)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1231, file: !548, line: 206, baseType: !1129, size: 64, align: 64, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1188, file: !548, line: 480, baseType: !954, size: 32, align: 32, offset: 3008)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1188, file: !548, line: 505, baseType: !954, size: 32, align: 32, offset: 3040)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1188, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1188, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1188, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1188, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1188, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1188, file: !548, line: 532, baseType: !963, size: 64, align: 64, offset: 3264)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1188, file: !548, line: 539, baseType: !963, size: 64, align: 64, offset: 3328)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1188, file: !548, line: 547, baseType: !963, size: 64, align: 64, offset: 3392)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1188, file: !548, line: 554, baseType: !1237, size: 64, align: 64, offset: 3456)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1188, file: !548, line: 563, baseType: !954, size: 32, align: 32, offset: 3520)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1188, file: !548, line: 572, baseType: !954, size: 32, align: 32, offset: 3552)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1188, file: !548, line: 581, baseType: !954, size: 32, align: 32, offset: 3584)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1188, file: !548, line: 588, baseType: !1257, size: 64, align: 64, offset: 3648)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !962, line: 36, baseType: !1259)
!1259 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1188, file: !548, line: 593, baseType: !954, size: 32, align: 32, offset: 3712)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1188, file: !548, line: 596, baseType: !954, size: 32, align: 32, offset: 3744)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1188, file: !548, line: 599, baseType: !1129, size: 64, align: 64, offset: 3776)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1188, file: !548, line: 605, baseType: !1129, size: 64, align: 64, offset: 3840)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1188, file: !548, line: 616, baseType: !1129, size: 64, align: 64, offset: 3904)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1188, file: !548, line: 626, baseType: !1178, size: 64, align: 64, offset: 3968)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1188, file: !548, line: 627, baseType: !1178, size: 64, align: 64, offset: 4032)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1188, file: !548, line: 628, baseType: !1178, size: 64, align: 64, offset: 4096)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1188, file: !548, line: 629, baseType: !1178, size: 64, align: 64, offset: 4160)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1188, file: !548, line: 645, baseType: !1129, size: 64, align: 64, offset: 4224)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1105, file: !919, line: 587, baseType: !1271, size: 64, align: 64, offset: 1152)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!954, !1098, !1274}
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1105, file: !919, line: 592, baseType: !1277, size: 64, align: 64, offset: 1216)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!954, !1098, !1280}
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1105, file: !919, line: 597, baseType: !1277, size: 64, align: 64, offset: 1280)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1105, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1105, file: !919, line: 608, baseType: !1095, size: 64, align: 64, offset: 1408)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1105, file: !919, line: 617, baseType: !1286, size: 64, align: 64, offset: 1472)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{null, !1098}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1105, file: !919, line: 623, baseType: !1290, size: 64, align: 64, offset: 1536)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!954, !1098, !1293}
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1125)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1099, file: !919, line: 1365, baseType: !972, size: 64, align: 64, offset: 192)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1099, file: !919, line: 1379, baseType: !1297, size: 64, align: 64, offset: 256)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1299)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1300)
!1300 = !{!1301, !1302, !1303, !1304, !1305, !1306, !1307, !1311, !1312, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1328, !1329, !1333, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1351, !1352, !1353, !1354, !1358, !1359, !1360}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1299, file: !650, line: 174, baseType: !997, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1299, file: !650, line: 226, baseType: !1090, size: 64, align: 64, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1299, file: !650, line: 227, baseType: !954, size: 32, align: 32, offset: 128)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1299, file: !650, line: 228, baseType: !1090, size: 64, align: 64, offset: 192)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1299, file: !650, line: 229, baseType: !1090, size: 64, align: 64, offset: 256)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1299, file: !650, line: 233, baseType: !972, size: 64, align: 64, offset: 320)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1299, file: !650, line: 235, baseType: !1308, size: 64, align: 64, offset: 384)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!954, !972, !1139, !954}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1299, file: !650, line: 236, baseType: !1308, size: 64, align: 64, offset: 448)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1299, file: !650, line: 237, baseType: !1313, size: 64, align: 64, offset: 512)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!963, !972, !963, !954}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1299, file: !650, line: 238, baseType: !963, size: 64, align: 64, offset: 576)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1299, file: !650, line: 239, baseType: !954, size: 32, align: 32, offset: 640)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1299, file: !650, line: 240, baseType: !954, size: 32, align: 32, offset: 672)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1299, file: !650, line: 241, baseType: !954, size: 32, align: 32, offset: 704)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1299, file: !650, line: 242, baseType: !1180, size: 64, align: 64, offset: 768)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1299, file: !650, line: 243, baseType: !1090, size: 64, align: 64, offset: 832)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1299, file: !650, line: 244, baseType: !1323, size: 64, align: 64, offset: 896)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!1180, !1180, !1326, !953}
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1140)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1299, file: !650, line: 245, baseType: !954, size: 32, align: 32, offset: 960)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1299, file: !650, line: 249, baseType: !1330, size: 64, align: 64, offset: 1024)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{!954, !972, !954}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1299, file: !650, line: 255, baseType: !1334, size: 64, align: 64, offset: 1088)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DISubroutineType(types: !1336)
!1336 = !{!963, !972, !954, !963, !954}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1299, file: !650, line: 260, baseType: !954, size: 32, align: 32, offset: 1152)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1299, file: !650, line: 266, baseType: !963, size: 64, align: 64, offset: 1216)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1299, file: !650, line: 273, baseType: !954, size: 32, align: 32, offset: 1280)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1299, file: !650, line: 279, baseType: !963, size: 64, align: 64, offset: 1344)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1299, file: !650, line: 285, baseType: !954, size: 32, align: 32, offset: 1408)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1299, file: !650, line: 291, baseType: !954, size: 32, align: 32, offset: 1440)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1299, file: !650, line: 298, baseType: !954, size: 32, align: 32, offset: 1472)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1299, file: !650, line: 304, baseType: !954, size: 32, align: 32, offset: 1504)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1299, file: !650, line: 309, baseType: !980, size: 64, align: 64, offset: 1536)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1299, file: !650, line: 314, baseType: !980, size: 64, align: 64, offset: 1600)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1299, file: !650, line: 319, baseType: !1348, size: 64, align: 64, offset: 1664)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DISubroutineType(types: !1350)
!1350 = !{!954, !972, !1139, !954, !649, !963}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1299, file: !650, line: 326, baseType: !954, size: 32, align: 32, offset: 1728)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1299, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1299, file: !650, line: 332, baseType: !963, size: 64, align: 64, offset: 1792)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1299, file: !650, line: 338, baseType: !1355, size: 64, align: 64, offset: 1856)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!954, !972}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1299, file: !650, line: 340, baseType: !963, size: 64, align: 64, offset: 1920)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1299, file: !650, line: 346, baseType: !1090, size: 64, align: 64, offset: 1984)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1299, file: !650, line: 351, baseType: !954, size: 32, align: 32, offset: 2048)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1099, file: !919, line: 1386, baseType: !954, size: 32, align: 32, offset: 320)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1099, file: !919, line: 1393, baseType: !953, size: 32, align: 32, offset: 352)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1099, file: !919, line: 1405, baseType: !1364, size: 64, align: 64, offset: 384)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1367)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1368)
!1368 = !{!1369, !1370, !1371, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1839, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1939, !1945, !1946, !1950, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1982, !1983, !1984, !1985, !1986, !1987}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1367, file: !919, line: 866, baseType: !954, size: 32, align: 32)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1367, file: !919, line: 872, baseType: !954, size: 32, align: 32, offset: 32)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1367, file: !919, line: 878, baseType: !1372, size: 64, align: 64, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1374)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1375)
!1375 = !{!1376, !1377, !1378, !1379, !1514, !1515, !1516, !1517, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1543, !1547, !1548, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1727, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1374, file: !4, line: 1561, baseType: !997, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1374, file: !4, line: 1562, baseType: !954, size: 32, align: 32, offset: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1374, file: !4, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1374, file: !4, line: 1565, baseType: !1380, size: 64, align: 64, offset: 128)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1382)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1383)
!1383 = !{!1384, !1385, !1386, !1387, !1388, !1389, !1392, !1395, !1398, !1401, !1404, !1405, !1406, !1414, !1415, !1416, !1418, !1422, !1428, !1433, !1437, !1438, !1479, !1486, !1490, !1491, !1495, !1499, !1503, !1507, !1508, !1509}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1382, file: !4, line: 3475, baseType: !980, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1382, file: !4, line: 3480, baseType: !980, size: 64, align: 64, offset: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1382, file: !4, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1382, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1382, file: !4, line: 3487, baseType: !954, size: 32, align: 32, offset: 192)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1382, file: !4, line: 3488, baseType: !1390, size: 64, align: 64, offset: 256)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1024)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1382, file: !4, line: 3489, baseType: !1393, size: 64, align: 64, offset: 320)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1382, file: !4, line: 3490, baseType: !1396, size: 64, align: 64, offset: 384)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1382, file: !4, line: 3491, baseType: !1399, size: 64, align: 64, offset: 448)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1382, file: !4, line: 3492, baseType: !1402, size: 64, align: 64, offset: 512)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1214)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1382, file: !4, line: 3493, baseType: !1140, size: 8, align: 8, offset: 576)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1382, file: !4, line: 3494, baseType: !997, size: 64, align: 64, offset: 640)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1382, file: !4, line: 3495, baseType: !1407, size: 64, align: 64, offset: 704)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1409)
!1409 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1410)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1411)
!1411 = !{!1412, !1413}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1410, file: !4, line: 3402, baseType: !954, size: 32, align: 32)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1410, file: !4, line: 3403, baseType: !980, size: 64, align: 64, offset: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1382, file: !4, line: 3507, baseType: !980, size: 64, align: 64, offset: 768)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1382, file: !4, line: 3516, baseType: !954, size: 32, align: 32, offset: 832)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1382, file: !4, line: 3517, baseType: !1417, size: 64, align: 64, offset: 896)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1382, file: !4, line: 3527, baseType: !1419, size: 64, align: 64, offset: 960)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DISubroutineType(types: !1421)
!1421 = !{!954, !1372}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1382, file: !4, line: 3535, baseType: !1423, size: 64, align: 64, offset: 1024)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{!954, !1372, !1426}
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1373)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1382, file: !4, line: 3541, baseType: !1429, size: 64, align: 64, offset: 1088)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1431)
!1431 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1432)
!1432 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1382, file: !4, line: 3549, baseType: !1434, size: 64, align: 64, offset: 1152)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DISubroutineType(types: !1436)
!1436 = !{null, !1417}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1382, file: !4, line: 3551, baseType: !1419, size: 64, align: 64, offset: 1216)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1382, file: !4, line: 3552, baseType: !1439, size: 64, align: 64, offset: 1280)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1440 = !DISubroutineType(types: !1441)
!1441 = !{!954, !1372, !1139, !954, !1442}
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1444)
!1444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1445)
!1445 = !{!1446, !1447, !1448, !1449, !1450, !1478}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1444, file: !4, line: 3921, baseType: !970, size: 16, align: 16)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1444, file: !4, line: 3922, baseType: !961, size: 32, align: 32, offset: 32)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1444, file: !4, line: 3923, baseType: !961, size: 32, align: 32, offset: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1444, file: !4, line: 3924, baseType: !953, size: 32, align: 32, offset: 96)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1444, file: !4, line: 3925, baseType: !1451, size: 64, align: 64, offset: 128)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1454)
!1454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1455)
!1455 = !{!1456, !1457, !1458, !1459, !1460, !1461, !1467, !1471, !1473, !1474, !1476, !1477}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1454, file: !4, line: 3886, baseType: !954, size: 32, align: 32)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1454, file: !4, line: 3887, baseType: !954, size: 32, align: 32, offset: 32)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1454, file: !4, line: 3888, baseType: !954, size: 32, align: 32, offset: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1454, file: !4, line: 3889, baseType: !954, size: 32, align: 32, offset: 96)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1454, file: !4, line: 3890, baseType: !954, size: 32, align: 32, offset: 128)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1454, file: !4, line: 3897, baseType: !1462, size: 768, align: 64, offset: 192)
!1462 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1463)
!1463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1464)
!1464 = !{!1465, !1466}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1463, file: !4, line: 3855, baseType: !1191, size: 512, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1463, file: !4, line: 3857, baseType: !1195, size: 256, align: 32, offset: 512)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1454, file: !4, line: 3903, baseType: !1468, size: 256, align: 64, offset: 960)
!1468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 256, align: 64, elements: !1469)
!1469 = !{!1470}
!1470 = !DISubrange(count: 4)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1454, file: !4, line: 3904, baseType: !1472, size: 128, align: 32, offset: 1216)
!1472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 128, align: 32, elements: !1469)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1454, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1454, file: !4, line: 3908, baseType: !1475, size: 64, align: 64, offset: 1408)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1454, file: !4, line: 3915, baseType: !1475, size: 64, align: 64, offset: 1472)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1454, file: !4, line: 3917, baseType: !954, size: 32, align: 32, offset: 1536)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1444, file: !4, line: 3926, baseType: !963, size: 64, align: 64, offset: 192)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1382, file: !4, line: 3564, baseType: !1480, size: 64, align: 64, offset: 1344)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DISubroutineType(types: !1482)
!1482 = !{!954, !1372, !1124, !1483, !1485}
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1187)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1382, file: !4, line: 3566, baseType: !1487, size: 64, align: 64, offset: 1408)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DISubroutineType(types: !1489)
!1489 = !{!954, !1372, !972, !1485, !1124}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1382, file: !4, line: 3567, baseType: !1419, size: 64, align: 64, offset: 1472)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1382, file: !4, line: 3576, baseType: !1492, size: 64, align: 64, offset: 1536)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{!954, !1372, !1483}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1382, file: !4, line: 3577, baseType: !1496, size: 64, align: 64, offset: 1600)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{!954, !1372, !1124}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1382, file: !4, line: 3584, baseType: !1500, size: 64, align: 64, offset: 1664)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{!954, !1372, !1186}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1382, file: !4, line: 3589, baseType: !1504, size: 64, align: 64, offset: 1728)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{null, !1372}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1382, file: !4, line: 3594, baseType: !954, size: 32, align: 32, offset: 1792)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1382, file: !4, line: 3600, baseType: !980, size: 64, align: 64, offset: 1856)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1382, file: !4, line: 3609, baseType: !1510, size: 64, align: 64, offset: 1920)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1513)
!1513 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1374, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1374, file: !4, line: 1581, baseType: !953, size: 32, align: 32, offset: 224)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1374, file: !4, line: 1583, baseType: !972, size: 64, align: 64, offset: 256)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1374, file: !4, line: 1591, baseType: !1518, size: 64, align: 64, offset: 320)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1374, file: !4, line: 1598, baseType: !972, size: 64, align: 64, offset: 384)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1374, file: !4, line: 1606, baseType: !963, size: 64, align: 64, offset: 448)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1374, file: !4, line: 1614, baseType: !954, size: 32, align: 32, offset: 512)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1374, file: !4, line: 1622, baseType: !954, size: 32, align: 32, offset: 544)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1374, file: !4, line: 1628, baseType: !954, size: 32, align: 32, offset: 576)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1374, file: !4, line: 1636, baseType: !954, size: 32, align: 32, offset: 608)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1374, file: !4, line: 1643, baseType: !954, size: 32, align: 32, offset: 640)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1374, file: !4, line: 1657, baseType: !1139, size: 64, align: 64, offset: 704)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1374, file: !4, line: 1658, baseType: !954, size: 32, align: 32, offset: 768)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1374, file: !4, line: 1679, baseType: !1024, size: 64, align: 32, offset: 800)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1374, file: !4, line: 1688, baseType: !954, size: 32, align: 32, offset: 864)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1374, file: !4, line: 1712, baseType: !954, size: 32, align: 32, offset: 896)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1374, file: !4, line: 1729, baseType: !954, size: 32, align: 32, offset: 928)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1374, file: !4, line: 1729, baseType: !954, size: 32, align: 32, offset: 960)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1374, file: !4, line: 1744, baseType: !954, size: 32, align: 32, offset: 992)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1374, file: !4, line: 1744, baseType: !954, size: 32, align: 32, offset: 1024)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1374, file: !4, line: 1751, baseType: !954, size: 32, align: 32, offset: 1056)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1374, file: !4, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1374, file: !4, line: 1791, baseType: !1539, size: 64, align: 64, offset: 1152)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DISubroutineType(types: !1541)
!1541 = !{null, !1542, !1483, !1485, !954, !954, !954}
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1374, file: !4, line: 1808, baseType: !1544, size: 64, align: 64, offset: 1216)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DISubroutineType(types: !1546)
!1546 = !{!667, !1542, !1393}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1374, file: !4, line: 1816, baseType: !954, size: 32, align: 32, offset: 1280)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1374, file: !4, line: 1825, baseType: !1549, size: 32, align: 32, offset: 1312)
!1549 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1374, file: !4, line: 1830, baseType: !954, size: 32, align: 32, offset: 1344)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1374, file: !4, line: 1838, baseType: !1549, size: 32, align: 32, offset: 1376)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1374, file: !4, line: 1846, baseType: !954, size: 32, align: 32, offset: 1408)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1374, file: !4, line: 1851, baseType: !954, size: 32, align: 32, offset: 1440)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1374, file: !4, line: 1861, baseType: !1549, size: 32, align: 32, offset: 1472)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1374, file: !4, line: 1868, baseType: !1549, size: 32, align: 32, offset: 1504)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1374, file: !4, line: 1875, baseType: !1549, size: 32, align: 32, offset: 1536)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1374, file: !4, line: 1882, baseType: !1549, size: 32, align: 32, offset: 1568)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1374, file: !4, line: 1889, baseType: !1549, size: 32, align: 32, offset: 1600)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1374, file: !4, line: 1896, baseType: !1549, size: 32, align: 32, offset: 1632)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1374, file: !4, line: 1903, baseType: !1549, size: 32, align: 32, offset: 1664)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1374, file: !4, line: 1910, baseType: !954, size: 32, align: 32, offset: 1696)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1374, file: !4, line: 1915, baseType: !954, size: 32, align: 32, offset: 1728)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1374, file: !4, line: 1926, baseType: !1485, size: 64, align: 64, offset: 1792)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1374, file: !4, line: 1935, baseType: !1024, size: 64, align: 32, offset: 1856)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1374, file: !4, line: 1942, baseType: !954, size: 32, align: 32, offset: 1920)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1374, file: !4, line: 1948, baseType: !954, size: 32, align: 32, offset: 1952)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1374, file: !4, line: 1954, baseType: !954, size: 32, align: 32, offset: 1984)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1374, file: !4, line: 1960, baseType: !954, size: 32, align: 32, offset: 2016)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1374, file: !4, line: 1984, baseType: !954, size: 32, align: 32, offset: 2048)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1374, file: !4, line: 1991, baseType: !954, size: 32, align: 32, offset: 2080)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1374, file: !4, line: 1996, baseType: !954, size: 32, align: 32, offset: 2112)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1374, file: !4, line: 2004, baseType: !954, size: 32, align: 32, offset: 2144)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1374, file: !4, line: 2011, baseType: !954, size: 32, align: 32, offset: 2176)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1374, file: !4, line: 2018, baseType: !954, size: 32, align: 32, offset: 2208)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1374, file: !4, line: 2027, baseType: !954, size: 32, align: 32, offset: 2240)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1374, file: !4, line: 2034, baseType: !954, size: 32, align: 32, offset: 2272)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1374, file: !4, line: 2044, baseType: !954, size: 32, align: 32, offset: 2304)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1374, file: !4, line: 2054, baseType: !1579, size: 64, align: 64, offset: 2368)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1374, file: !4, line: 2061, baseType: !1579, size: 64, align: 64, offset: 2432)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1374, file: !4, line: 2066, baseType: !954, size: 32, align: 32, offset: 2496)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1374, file: !4, line: 2070, baseType: !954, size: 32, align: 32, offset: 2528)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1374, file: !4, line: 2078, baseType: !954, size: 32, align: 32, offset: 2560)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1374, file: !4, line: 2085, baseType: !954, size: 32, align: 32, offset: 2592)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1374, file: !4, line: 2092, baseType: !954, size: 32, align: 32, offset: 2624)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1374, file: !4, line: 2099, baseType: !954, size: 32, align: 32, offset: 2656)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1374, file: !4, line: 2106, baseType: !954, size: 32, align: 32, offset: 2688)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1374, file: !4, line: 2113, baseType: !954, size: 32, align: 32, offset: 2720)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1374, file: !4, line: 2120, baseType: !954, size: 32, align: 32, offset: 2752)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1374, file: !4, line: 2125, baseType: !954, size: 32, align: 32, offset: 2784)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1374, file: !4, line: 2133, baseType: !954, size: 32, align: 32, offset: 2816)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1374, file: !4, line: 2140, baseType: !954, size: 32, align: 32, offset: 2848)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1374, file: !4, line: 2145, baseType: !954, size: 32, align: 32, offset: 2880)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1374, file: !4, line: 2153, baseType: !954, size: 32, align: 32, offset: 2912)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1374, file: !4, line: 2158, baseType: !954, size: 32, align: 32, offset: 2944)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1374, file: !4, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1374, file: !4, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1374, file: !4, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1374, file: !4, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1374, file: !4, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1374, file: !4, line: 2203, baseType: !954, size: 32, align: 32, offset: 3136)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1374, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1374, file: !4, line: 2212, baseType: !954, size: 32, align: 32, offset: 3200)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1374, file: !4, line: 2213, baseType: !954, size: 32, align: 32, offset: 3232)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1374, file: !4, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1374, file: !4, line: 2232, baseType: !954, size: 32, align: 32, offset: 3296)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1374, file: !4, line: 2243, baseType: !954, size: 32, align: 32, offset: 3328)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1374, file: !4, line: 2249, baseType: !954, size: 32, align: 32, offset: 3360)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1374, file: !4, line: 2256, baseType: !954, size: 32, align: 32, offset: 3392)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1374, file: !4, line: 2263, baseType: !1214, size: 64, align: 64, offset: 3456)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1374, file: !4, line: 2270, baseType: !1214, size: 64, align: 64, offset: 3520)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1374, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1374, file: !4, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1374, file: !4, line: 2367, baseType: !1615, size: 64, align: 64, offset: 3648)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DISubroutineType(types: !1617)
!1617 = !{!954, !1542, !1186, !954}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1374, file: !4, line: 2383, baseType: !954, size: 32, align: 32, offset: 3712)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1374, file: !4, line: 2386, baseType: !1549, size: 32, align: 32, offset: 3744)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1374, file: !4, line: 2387, baseType: !1549, size: 32, align: 32, offset: 3776)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1374, file: !4, line: 2394, baseType: !954, size: 32, align: 32, offset: 3808)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1374, file: !4, line: 2401, baseType: !954, size: 32, align: 32, offset: 3840)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1374, file: !4, line: 2408, baseType: !954, size: 32, align: 32, offset: 3872)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1374, file: !4, line: 2415, baseType: !954, size: 32, align: 32, offset: 3904)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1374, file: !4, line: 2422, baseType: !954, size: 32, align: 32, offset: 3936)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1374, file: !4, line: 2423, baseType: !1627, size: 64, align: 64, offset: 3968)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1629)
!1629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1630)
!1630 = !{!1631, !1632, !1633, !1634}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1629, file: !4, line: 827, baseType: !954, size: 32, align: 32)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1629, file: !4, line: 828, baseType: !954, size: 32, align: 32, offset: 32)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1629, file: !4, line: 829, baseType: !954, size: 32, align: 32, offset: 64)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1629, file: !4, line: 830, baseType: !1549, size: 32, align: 32, offset: 96)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1374, file: !4, line: 2430, baseType: !963, size: 64, align: 64, offset: 4032)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1374, file: !4, line: 2437, baseType: !963, size: 64, align: 64, offset: 4096)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1374, file: !4, line: 2444, baseType: !1549, size: 32, align: 32, offset: 4160)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1374, file: !4, line: 2451, baseType: !1549, size: 32, align: 32, offset: 4192)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1374, file: !4, line: 2458, baseType: !954, size: 32, align: 32, offset: 4224)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1374, file: !4, line: 2469, baseType: !954, size: 32, align: 32, offset: 4256)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1374, file: !4, line: 2475, baseType: !954, size: 32, align: 32, offset: 4288)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1374, file: !4, line: 2481, baseType: !954, size: 32, align: 32, offset: 4320)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1374, file: !4, line: 2485, baseType: !954, size: 32, align: 32, offset: 4352)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1374, file: !4, line: 2489, baseType: !954, size: 32, align: 32, offset: 4384)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1374, file: !4, line: 2493, baseType: !954, size: 32, align: 32, offset: 4416)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1374, file: !4, line: 2501, baseType: !954, size: 32, align: 32, offset: 4448)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1374, file: !4, line: 2506, baseType: !954, size: 32, align: 32, offset: 4480)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1374, file: !4, line: 2510, baseType: !954, size: 32, align: 32, offset: 4512)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1374, file: !4, line: 2514, baseType: !963, size: 64, align: 64, offset: 4544)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1374, file: !4, line: 2528, baseType: !1651, size: 64, align: 64, offset: 4608)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{null, !1542, !972, !954, !954}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1374, file: !4, line: 2534, baseType: !954, size: 32, align: 32, offset: 4672)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1374, file: !4, line: 2545, baseType: !954, size: 32, align: 32, offset: 4704)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1374, file: !4, line: 2547, baseType: !954, size: 32, align: 32, offset: 4736)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1374, file: !4, line: 2549, baseType: !954, size: 32, align: 32, offset: 4768)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1374, file: !4, line: 2551, baseType: !954, size: 32, align: 32, offset: 4800)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1374, file: !4, line: 2553, baseType: !954, size: 32, align: 32, offset: 4832)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1374, file: !4, line: 2555, baseType: !954, size: 32, align: 32, offset: 4864)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1374, file: !4, line: 2557, baseType: !954, size: 32, align: 32, offset: 4896)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1374, file: !4, line: 2559, baseType: !954, size: 32, align: 32, offset: 4928)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1374, file: !4, line: 2563, baseType: !954, size: 32, align: 32, offset: 4960)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1374, file: !4, line: 2571, baseType: !1475, size: 64, align: 64, offset: 4992)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1374, file: !4, line: 2579, baseType: !1475, size: 64, align: 64, offset: 5056)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1374, file: !4, line: 2586, baseType: !954, size: 32, align: 32, offset: 5120)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1374, file: !4, line: 2615, baseType: !954, size: 32, align: 32, offset: 5152)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1374, file: !4, line: 2627, baseType: !954, size: 32, align: 32, offset: 5184)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1374, file: !4, line: 2637, baseType: !954, size: 32, align: 32, offset: 5216)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1374, file: !4, line: 2681, baseType: !954, size: 32, align: 32, offset: 5248)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1374, file: !4, line: 2709, baseType: !963, size: 64, align: 64, offset: 5312)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1374, file: !4, line: 2716, baseType: !1673, size: 64, align: 64, offset: 5376)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1675)
!1675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1676)
!1676 = !{!1677, !1678, !1679, !1680, !1681, !1682, !1683, !1687, !1691, !1692, !1693, !1694, !1700, !1701, !1702, !1703, !1704}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1675, file: !4, line: 3642, baseType: !980, size: 64, align: 64)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1675, file: !4, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1675, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1675, file: !4, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1675, file: !4, line: 3669, baseType: !954, size: 32, align: 32, offset: 160)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1675, file: !4, line: 3682, baseType: !1500, size: 64, align: 64, offset: 192)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1675, file: !4, line: 3698, baseType: !1684, size: 64, align: 64, offset: 256)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{!954, !1372, !1326, !961}
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1675, file: !4, line: 3712, baseType: !1688, size: 64, align: 64, offset: 320)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!954, !1372, !954, !1326, !961}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1675, file: !4, line: 3726, baseType: !1684, size: 64, align: 64, offset: 384)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1675, file: !4, line: 3737, baseType: !1419, size: 64, align: 64, offset: 448)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1675, file: !4, line: 3746, baseType: !954, size: 32, align: 32, offset: 512)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1675, file: !4, line: 3757, baseType: !1695, size: 64, align: 64, offset: 576)
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64, align: 64)
!1696 = !DISubroutineType(types: !1697)
!1697 = !{null, !1698}
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1675, file: !4, line: 3766, baseType: !1419, size: 64, align: 64, offset: 640)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1675, file: !4, line: 3774, baseType: !1419, size: 64, align: 64, offset: 704)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1675, file: !4, line: 3780, baseType: !954, size: 32, align: 32, offset: 768)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1675, file: !4, line: 3785, baseType: !954, size: 32, align: 32, offset: 800)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1675, file: !4, line: 3795, baseType: !1705, size: 64, align: 64, offset: 832)
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64, align: 64)
!1706 = !DISubroutineType(types: !1707)
!1707 = !{!954, !1372, !1129}
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1374, file: !4, line: 2728, baseType: !972, size: 64, align: 64, offset: 5440)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1374, file: !4, line: 2735, baseType: !1213, size: 512, align: 64, offset: 5504)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1374, file: !4, line: 2742, baseType: !954, size: 32, align: 32, offset: 6016)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1374, file: !4, line: 2755, baseType: !954, size: 32, align: 32, offset: 6048)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1374, file: !4, line: 2776, baseType: !954, size: 32, align: 32, offset: 6080)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1374, file: !4, line: 2783, baseType: !954, size: 32, align: 32, offset: 6112)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1374, file: !4, line: 2791, baseType: !954, size: 32, align: 32, offset: 6144)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1374, file: !4, line: 2802, baseType: !1186, size: 64, align: 64, offset: 6208)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1374, file: !4, line: 2811, baseType: !954, size: 32, align: 32, offset: 6272)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1374, file: !4, line: 2821, baseType: !954, size: 32, align: 32, offset: 6304)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1374, file: !4, line: 2830, baseType: !954, size: 32, align: 32, offset: 6336)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1374, file: !4, line: 2840, baseType: !954, size: 32, align: 32, offset: 6368)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1374, file: !4, line: 2851, baseType: !1721, size: 64, align: 64, offset: 6400)
!1721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1722, size: 64, align: 64)
!1722 = !DISubroutineType(types: !1723)
!1723 = !{!954, !1542, !1724, !972, !1485, !954, !954}
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1725, size: 64, align: 64)
!1725 = !DISubroutineType(types: !1726)
!1726 = !{!954, !1542, !972}
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1374, file: !4, line: 2871, baseType: !1728, size: 64, align: 64, offset: 6464)
!1728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1729, size: 64, align: 64)
!1729 = !DISubroutineType(types: !1730)
!1730 = !{!954, !1542, !1731, !972, !1485, !954}
!1731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1732, size: 64, align: 64)
!1732 = !DISubroutineType(types: !1733)
!1733 = !{!954, !1542, !972, !954, !954}
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1374, file: !4, line: 2878, baseType: !954, size: 32, align: 32, offset: 6528)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1374, file: !4, line: 2885, baseType: !954, size: 32, align: 32, offset: 6560)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1374, file: !4, line: 3005, baseType: !954, size: 32, align: 32, offset: 6592)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1374, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1374, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
