; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--yuv4mpegenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--yuv4mpegenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVOutputFormat = type { i8*, i8*, i8*, i8*, i32, i32, i32, i32, %struct.AVCodecTag**, %struct.AVClass*, %struct.AVOutputFormat*, i32, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*, %struct.AVPacket*, i32)*, i32 (i32, i32)*, void (%struct.AVFormatContext*, i32, i64*, i64*)*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i32 (%struct.AVFormatContext*, i32, %struct.AVFrame**, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32, i32 (%struct.AVFormatContext*)*, void (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque

!854 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!855 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!856 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!857 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !534, line: 538, size: 32, align: 32, elements: !858)
!858 = !{!859, !860, !861, !862, !863, !864, !865, !866}
!859 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!860 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!861 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!862 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!863 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!864 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !918, !919}
!917 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!918 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !767, line: 646, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !767, line: 268, size: 4288, align: 64, elements: !922)
!922 = !{!923, !931, !933, !935, !936, !937, !938, !939, !940, !941, !948, !951, !952, !953, !954, !955, !956, !958, !962, !963, !964, !965, !966, !967, !968, !969, !982, !984, !985, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1018, !1019, !1020, !1021, !1022, !1023, !1026, !1027, !1028, !1029}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !921, file: !767, line: 282, baseType: !924, size: 512, align: 64)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 512, align: 64, elements: !929)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !927, line: 48, baseType: !928)
!927 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!928 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!929 = !{!930}
!930 = !DISubrange(count: 8)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !921, file: !767, line: 299, baseType: !932, size: 256, align: 32, offset: 512)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 32, elements: !929)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !921, file: !767, line: 315, baseType: !934, size: 64, align: 64, offset: 768)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !921, file: !767, line: 326, baseType: !917, size: 32, align: 32, offset: 832)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !921, file: !767, line: 326, baseType: !917, size: 32, align: 32, offset: 864)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !921, file: !767, line: 334, baseType: !917, size: 32, align: 32, offset: 896)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !921, file: !767, line: 341, baseType: !917, size: 32, align: 32, offset: 928)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !921, file: !767, line: 346, baseType: !917, size: 32, align: 32, offset: 960)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !921, file: !767, line: 351, baseType: !756, size: 32, align: 32, offset: 992)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !921, file: !767, line: 356, baseType: !942, size: 64, align: 32, offset: 1024)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !943, line: 61, baseType: !944)
!943 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !943, line: 58, size: 64, align: 32, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !944, file: !943, line: 59, baseType: !917, size: 32, align: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !944, file: !943, line: 60, baseType: !917, size: 32, align: 32, offset: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !921, file: !767, line: 361, baseType: !949, size: 64, align: 64, offset: 1088)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !927, line: 40, baseType: !950)
!950 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !921, file: !767, line: 369, baseType: !949, size: 64, align: 64, offset: 1152)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !921, file: !767, line: 377, baseType: !949, size: 64, align: 64, offset: 1216)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !921, file: !767, line: 382, baseType: !917, size: 32, align: 32, offset: 1280)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !921, file: !767, line: 386, baseType: !917, size: 32, align: 32, offset: 1312)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !921, file: !767, line: 391, baseType: !917, size: 32, align: 32, offset: 1344)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !921, file: !767, line: 396, baseType: !957, size: 64, align: 64, offset: 1408)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !921, file: !767, line: 403, baseType: !959, size: 512, align: 64, offset: 1472)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 512, align: 64, elements: !929)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !927, line: 55, baseType: !961)
!961 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !921, file: !767, line: 410, baseType: !917, size: 32, align: 32, offset: 1984)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !921, file: !767, line: 415, baseType: !917, size: 32, align: 32, offset: 2016)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !921, file: !767, line: 420, baseType: !917, size: 32, align: 32, offset: 2048)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !921, file: !767, line: 425, baseType: !917, size: 32, align: 32, offset: 2080)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !921, file: !767, line: 435, baseType: !949, size: 64, align: 64, offset: 2112)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !921, file: !767, line: 440, baseType: !917, size: 32, align: 32, offset: 2176)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !921, file: !767, line: 445, baseType: !960, size: 64, align: 64, offset: 2240)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !921, file: !767, line: 459, baseType: !970, size: 512, align: 64, offset: 2304)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 512, align: 64, elements: !929)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !973, line: 94, baseType: !974)
!973 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !973, line: 81, size: 192, align: 64, elements: !975)
!975 = !{!976, !980, !981}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !974, file: !973, line: 82, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !973, line: 73, baseType: !979)
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !973, line: 73, flags: DIFlagFwdDecl)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !974, file: !973, line: 89, baseType: !925, size: 64, align: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !974, file: !973, line: 93, baseType: !917, size: 32, align: 32, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !921, file: !767, line: 473, baseType: !983, size: 64, align: 64, offset: 2816)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !921, file: !767, line: 477, baseType: !917, size: 32, align: 32, offset: 2880)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !921, file: !767, line: 479, baseType: !986, size: 64, align: 64, offset: 2944)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !767, line: 207, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !767, line: 201, size: 320, align: 64, elements: !990)
!990 = !{!991, !992, !993, !994, !999}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !989, file: !767, line: 202, baseType: !766, size: 32, align: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !989, file: !767, line: 203, baseType: !925, size: 64, align: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !989, file: !767, line: 204, baseType: !917, size: 32, align: 32, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !989, file: !767, line: 205, baseType: !995, size: 64, align: 64, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !997, line: 86, baseType: !998)
!997 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!998 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !997, line: 86, flags: DIFlagFwdDecl)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !989, file: !767, line: 206, baseType: !971, size: 64, align: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !921, file: !767, line: 480, baseType: !917, size: 32, align: 32, offset: 3008)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !921, file: !767, line: 505, baseType: !917, size: 32, align: 32, offset: 3040)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !921, file: !767, line: 512, baseType: !790, size: 32, align: 32, offset: 3072)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !921, file: !767, line: 514, baseType: !796, size: 32, align: 32, offset: 3104)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !921, file: !767, line: 516, baseType: !814, size: 32, align: 32, offset: 3136)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !921, file: !767, line: 523, baseType: !838, size: 32, align: 32, offset: 3168)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !921, file: !767, line: 525, baseType: !857, size: 32, align: 32, offset: 3200)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !921, file: !767, line: 532, baseType: !949, size: 64, align: 64, offset: 3264)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !921, file: !767, line: 539, baseType: !949, size: 64, align: 64, offset: 3328)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !921, file: !767, line: 547, baseType: !949, size: 64, align: 64, offset: 3392)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !921, file: !767, line: 554, baseType: !995, size: 64, align: 64, offset: 3456)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !921, file: !767, line: 563, baseType: !917, size: 32, align: 32, offset: 3520)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !921, file: !767, line: 572, baseType: !917, size: 32, align: 32, offset: 3552)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !921, file: !767, line: 581, baseType: !917, size: 32, align: 32, offset: 3584)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !921, file: !767, line: 588, baseType: !1015, size: 64, align: 64, offset: 3648)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !927, line: 36, baseType: !1017)
!1017 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !921, file: !767, line: 593, baseType: !917, size: 32, align: 32, offset: 3712)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !921, file: !767, line: 596, baseType: !917, size: 32, align: 32, offset: 3744)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !921, file: !767, line: 599, baseType: !971, size: 64, align: 64, offset: 3776)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !921, file: !767, line: 605, baseType: !971, size: 64, align: 64, offset: 3840)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !921, file: !767, line: 616, baseType: !971, size: 64, align: 64, offset: 3904)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !921, file: !767, line: 626, baseType: !1024, size: 64, align: 64, offset: 3968)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1025, line: 216, baseType: !961)
!1025 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !921, file: !767, line: 627, baseType: !1024, size: 64, align: 64, offset: 4032)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !921, file: !767, line: 628, baseType: !1024, size: 64, align: 64, offset: 4096)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !921, file: !767, line: 629, baseType: !1024, size: 64, align: 64, offset: 4160)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !921, file: !767, line: 645, baseType: !971, size: 64, align: 64, offset: 4224)
!1030 = !{!1031}
!1031 = distinct !DIGlobalVariable(name: "ff_yuv4mpegpipe_muxer", scope: !0, file: !1032, line: 354, type: !1033, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_yuv4mpegpipe_muxer)
!1032 = !DIFile(filename: "libavformat/yuv4mpegenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !897, line: 624, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1035)
!1035 = !{!1036, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1057, !1098, !1100, !1101, !2102, !2103, !2104, !2108, !2112, !2116, !2117, !2122, !2123, !2124, !2125, !2126, !2127, !2131}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1034, file: !897, line: 498, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1039 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1034, file: !897, line: 504, baseType: !1037, size: 64, align: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1034, file: !897, line: 505, baseType: !1037, size: 64, align: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1034, file: !897, line: 506, baseType: !1037, size: 64, align: 64, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1034, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1034, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1034, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1034, file: !897, line: 517, baseType: !917, size: 32, align: 32, offset: 352)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1034, file: !897, line: 523, baseType: !1048, size: 64, align: 64, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1053, line: 44, size: 64, align: 32, elements: !1054)
!1053 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1054 = !{!1055, !1056}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1052, file: !1053, line: 45, baseType: !3, size: 32, align: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1052, file: !1053, line: 46, baseType: !918, size: 32, align: 32, offset: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1034, file: !897, line: 526, baseType: !1058, size: 64, align: 64, offset: 448)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !1062)
!1062 = !{!1063, !1064, !1068, !1072, !1073, !1074, !1075, !1079, !1085, !1087, !1091}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1061, file: !464, line: 72, baseType: !1037, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1061, file: !464, line: 78, baseType: !1065, size: 64, align: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!1037, !957}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1061, file: !464, line: 85, baseType: !1069, size: 64, align: 64, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1071)
!1071 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1061, file: !464, line: 93, baseType: !917, size: 32, align: 32, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1061, file: !464, line: 99, baseType: !917, size: 32, align: 32, offset: 224)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1061, file: !464, line: 108, baseType: !917, size: 32, align: 32, offset: 256)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1061, file: !464, line: 113, baseType: !1076, size: 64, align: 64, offset: 320)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!957, !957, !957}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1061, file: !464, line: 123, baseType: !1080, size: 64, align: 64, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!1083, !1083}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1061)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1061, file: !464, line: 130, baseType: !1086, size: 32, align: 32, offset: 448)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1061, file: !464, line: 136, baseType: !1088, size: 64, align: 64, offset: 512)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!1086, !957}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1061, file: !464, line: 142, baseType: !1092, size: 64, align: 64, offset: 576)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!917, !1095, !957, !1037, !917}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1034, file: !897, line: 535, baseType: !1099, size: 64, align: 64, offset: 512)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1034, file: !897, line: 539, baseType: !917, size: 32, align: 32, offset: 576)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1034, file: !897, line: 541, baseType: !1102, size: 64, align: 64, offset: 640)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!917, !1105}
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1107)
!1107 = !{!1108, !1109, !1193, !1194, !1195, !1260, !1261, !1262, !1956, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2010, !2011, !2012, !2013, !2014, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2065, !2066, !2069, !2070, !2071, !2072, !2073, !2074, !2079, !2080, !2081, !2082, !2090, !2091, !2095, !2099, !2100, !2101}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1106, file: !897, line: 1342, baseType: !1058, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1106, file: !897, line: 1349, baseType: !1110, size: 64, align: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1136, !1137, !1164, !1165, !1169, !1174, !1175, !1176, !1180, !1186, !1192}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1111, file: !897, line: 638, baseType: !1037, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1111, file: !897, line: 645, baseType: !1037, size: 64, align: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1111, file: !897, line: 652, baseType: !917, size: 32, align: 32, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1111, file: !897, line: 659, baseType: !1037, size: 64, align: 64, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1111, file: !897, line: 661, baseType: !1048, size: 64, align: 64, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1111, file: !897, line: 663, baseType: !1058, size: 64, align: 64, offset: 320)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1111, file: !897, line: 670, baseType: !1037, size: 64, align: 64, offset: 384)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1111, file: !897, line: 679, baseType: !1110, size: 64, align: 64, offset: 448)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1111, file: !897, line: 684, baseType: !917, size: 32, align: 32, offset: 512)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1111, file: !897, line: 689, baseType: !917, size: 32, align: 32, offset: 544)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1111, file: !897, line: 696, baseType: !1124, size: 64, align: 64, offset: 576)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!917, !1127}
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1130)
!1130 = !{!1131, !1132, !1134, !1135}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1129, file: !897, line: 449, baseType: !1037, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1129, file: !897, line: 450, baseType: !1133, size: 64, align: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1129, file: !897, line: 451, baseType: !917, size: 32, align: 32, offset: 128)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1129, file: !897, line: 452, baseType: !1037, size: 64, align: 64, offset: 192)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1111, file: !897, line: 703, baseType: !1102, size: 64, align: 64, offset: 640)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1111, file: !897, line: 714, baseType: !1138, size: 64, align: 64, offset: 704)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!917, !1105, !1141}
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1144)
!1144 = !{!1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1160, !1161, !1162, !1163}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1143, file: !4, line: 1451, baseType: !971, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1143, file: !4, line: 1461, baseType: !949, size: 64, align: 64, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1143, file: !4, line: 1467, baseType: !949, size: 64, align: 64, offset: 128)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1143, file: !4, line: 1468, baseType: !925, size: 64, align: 64, offset: 192)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1143, file: !4, line: 1469, baseType: !917, size: 32, align: 32, offset: 256)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1143, file: !4, line: 1470, baseType: !917, size: 32, align: 32, offset: 288)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1143, file: !4, line: 1474, baseType: !917, size: 32, align: 32, offset: 320)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1143, file: !4, line: 1479, baseType: !1153, size: 64, align: 64, offset: 384)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1155)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1156)
!1156 = !{!1157, !1158, !1159}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1155, file: !4, line: 1412, baseType: !925, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1155, file: !4, line: 1413, baseType: !917, size: 32, align: 32, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1155, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1143, file: !4, line: 1480, baseType: !917, size: 32, align: 32, offset: 448)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1143, file: !4, line: 1486, baseType: !949, size: 64, align: 64, offset: 512)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1143, file: !4, line: 1488, baseType: !949, size: 64, align: 64, offset: 576)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1143, file: !4, line: 1497, baseType: !949, size: 64, align: 64, offset: 640)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1111, file: !897, line: 720, baseType: !1102, size: 64, align: 64, offset: 768)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1111, file: !897, line: 730, baseType: !1166, size: 64, align: 64, offset: 832)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!917, !1105, !917, !949, !917}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1111, file: !897, line: 737, baseType: !1170, size: 64, align: 64, offset: 896)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!949, !1105, !917, !1173, !949}
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1111, file: !897, line: 744, baseType: !1102, size: 64, align: 64, offset: 960)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1111, file: !897, line: 750, baseType: !1102, size: 64, align: 64, offset: 1024)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1111, file: !897, line: 758, baseType: !1177, size: 64, align: 64, offset: 1088)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!917, !1105, !917, !949, !949, !949, !917}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1111, file: !897, line: 764, baseType: !1181, size: 64, align: 64, offset: 1152)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!917, !1105, !1184}
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1111, file: !897, line: 770, baseType: !1187, size: 64, align: 64, offset: 1216)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!917, !1105, !1190}
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1111, file: !897, line: 776, baseType: !1187, size: 64, align: 64, offset: 1280)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1106, file: !897, line: 1356, baseType: !1099, size: 64, align: 64, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1106, file: !897, line: 1365, baseType: !957, size: 64, align: 64, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1106, file: !897, line: 1379, baseType: !1196, size: 64, align: 64, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !515, line: 352, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !515, line: 161, size: 2112, align: 64, elements: !1199)
!1199 = !{!1200, !1201, !1202, !1203, !1204, !1205, !1206, !1210, !1211, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1227, !1228, !1232, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1250, !1251, !1252, !1253, !1257, !1258, !1259}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1198, file: !515, line: 174, baseType: !1058, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1198, file: !515, line: 226, baseType: !1133, size: 64, align: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1198, file: !515, line: 227, baseType: !917, size: 32, align: 32, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1198, file: !515, line: 228, baseType: !1133, size: 64, align: 64, offset: 192)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1198, file: !515, line: 229, baseType: !1133, size: 64, align: 64, offset: 256)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1198, file: !515, line: 233, baseType: !957, size: 64, align: 64, offset: 320)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1198, file: !515, line: 235, baseType: !1207, size: 64, align: 64, offset: 384)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!917, !957, !925, !917}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1198, file: !515, line: 236, baseType: !1207, size: 64, align: 64, offset: 448)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1198, file: !515, line: 237, baseType: !1212, size: 64, align: 64, offset: 512)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!949, !957, !949, !917}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1198, file: !515, line: 238, baseType: !949, size: 64, align: 64, offset: 576)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1198, file: !515, line: 239, baseType: !917, size: 32, align: 32, offset: 640)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1198, file: !515, line: 240, baseType: !917, size: 32, align: 32, offset: 672)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1198, file: !515, line: 241, baseType: !917, size: 32, align: 32, offset: 704)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1198, file: !515, line: 242, baseType: !961, size: 64, align: 64, offset: 768)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1198, file: !515, line: 243, baseType: !1133, size: 64, align: 64, offset: 832)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1198, file: !515, line: 244, baseType: !1222, size: 64, align: 64, offset: 896)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!961, !961, !1225, !918}
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1198, file: !515, line: 245, baseType: !917, size: 32, align: 32, offset: 960)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1198, file: !515, line: 249, baseType: !1229, size: 64, align: 64, offset: 1024)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!917, !957, !917}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1198, file: !515, line: 255, baseType: !1233, size: 64, align: 64, offset: 1088)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!949, !957, !917, !949, !917}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1198, file: !515, line: 260, baseType: !917, size: 32, align: 32, offset: 1152)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1198, file: !515, line: 266, baseType: !949, size: 64, align: 64, offset: 1216)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1198, file: !515, line: 273, baseType: !917, size: 32, align: 32, offset: 1280)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1198, file: !515, line: 279, baseType: !949, size: 64, align: 64, offset: 1344)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1198, file: !515, line: 285, baseType: !917, size: 32, align: 32, offset: 1408)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1198, file: !515, line: 291, baseType: !917, size: 32, align: 32, offset: 1440)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1198, file: !515, line: 298, baseType: !917, size: 32, align: 32, offset: 1472)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1198, file: !515, line: 304, baseType: !917, size: 32, align: 32, offset: 1504)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1198, file: !515, line: 309, baseType: !1037, size: 64, align: 64, offset: 1536)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1198, file: !515, line: 314, baseType: !1037, size: 64, align: 64, offset: 1600)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1198, file: !515, line: 319, baseType: !1247, size: 64, align: 64, offset: 1664)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!917, !957, !925, !917, !514, !949}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1198, file: !515, line: 326, baseType: !917, size: 32, align: 32, offset: 1728)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1198, file: !515, line: 331, baseType: !514, size: 32, align: 32, offset: 1760)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1198, file: !515, line: 332, baseType: !949, size: 64, align: 64, offset: 1792)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1198, file: !515, line: 338, baseType: !1254, size: 64, align: 64, offset: 1856)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!917, !957}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1198, file: !515, line: 340, baseType: !949, size: 64, align: 64, offset: 1920)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1198, file: !515, line: 346, baseType: !1133, size: 64, align: 64, offset: 1984)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1198, file: !515, line: 351, baseType: !917, size: 32, align: 32, offset: 2048)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1106, file: !897, line: 1386, baseType: !917, size: 32, align: 32, offset: 320)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1106, file: !897, line: 1393, baseType: !918, size: 32, align: 32, offset: 352)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1106, file: !897, line: 1405, baseType: !1263, size: 64, align: 64, offset: 384)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1266)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1267)
!1267 = !{!1268, !1269, !1270, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1741, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1842, !1848, !1849, !1853, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1885, !1886, !1887, !1888, !1889, !1890}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1266, file: !897, line: 866, baseType: !917, size: 32, align: 32)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1266, file: !897, line: 872, baseType: !917, size: 32, align: 32, offset: 32)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1266, file: !897, line: 878, baseType: !1271, size: 64, align: 64, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1274)
!1274 = !{!1275, !1276, !1277, !1278, !1416, !1417, !1418, !1419, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1445, !1449, !1450, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1629, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1273, file: !4, line: 1561, baseType: !1058, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1273, file: !4, line: 1562, baseType: !917, size: 32, align: 32, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1273, file: !4, line: 1564, baseType: !523, size: 32, align: 32, offset: 96)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1273, file: !4, line: 1565, baseType: !1279, size: 64, align: 64, offset: 128)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1281)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1282)
!1282 = !{!1283, !1284, !1285, !1286, !1287, !1288, !1291, !1294, !1297, !1300, !1303, !1304, !1305, !1313, !1314, !1315, !1317, !1321, !1327, !1332, !1336, !1337, !1381, !1388, !1392, !1393, !1397, !1401, !1405, !1409, !1410, !1411}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1281, file: !4, line: 3475, baseType: !1037, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1281, file: !4, line: 3480, baseType: !1037, size: 64, align: 64, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1281, file: !4, line: 3481, baseType: !523, size: 32, align: 32, offset: 128)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1281, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1281, file: !4, line: 3487, baseType: !917, size: 32, align: 32, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1281, file: !4, line: 3488, baseType: !1289, size: 64, align: 64, offset: 256)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1281, file: !4, line: 3489, baseType: !1292, size: 64, align: 64, offset: 320)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1281, file: !4, line: 3490, baseType: !1295, size: 64, align: 64, offset: 384)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1281, file: !4, line: 3491, baseType: !1298, size: 64, align: 64, offset: 448)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1281, file: !4, line: 3492, baseType: !1301, size: 64, align: 64, offset: 512)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1281, file: !4, line: 3493, baseType: !926, size: 8, align: 8, offset: 576)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1281, file: !4, line: 3494, baseType: !1058, size: 64, align: 64, offset: 640)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1281, file: !4, line: 3495, baseType: !1306, size: 64, align: 64, offset: 704)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1308)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1309)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1310)
!1310 = !{!1311, !1312}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1309, file: !4, line: 3402, baseType: !917, size: 32, align: 32)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1309, file: !4, line: 3403, baseType: !1037, size: 64, align: 64, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1281, file: !4, line: 3507, baseType: !1037, size: 64, align: 64, offset: 768)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1281, file: !4, line: 3516, baseType: !917, size: 32, align: 32, offset: 832)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1281, file: !4, line: 3517, baseType: !1316, size: 64, align: 64, offset: 896)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1281, file: !4, line: 3527, baseType: !1318, size: 64, align: 64, offset: 960)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{!917, !1271}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1281, file: !4, line: 3535, baseType: !1322, size: 64, align: 64, offset: 1024)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!917, !1271, !1325}
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1272)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1281, file: !4, line: 3541, baseType: !1328, size: 64, align: 64, offset: 1088)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1330)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1331)
!1331 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1281, file: !4, line: 3549, baseType: !1333, size: 64, align: 64, offset: 1152)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{null, !1316}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1281, file: !4, line: 3551, baseType: !1318, size: 64, align: 64, offset: 1216)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1281, file: !4, line: 3552, baseType: !1338, size: 64, align: 64, offset: 1280)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!917, !1271, !925, !917, !1341}
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1343)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1344)
!1344 = !{!1345, !1348, !1350, !1351, !1352, !1380}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1343, file: !4, line: 3921, baseType: !1346, size: 16, align: 16)
!1346 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !927, line: 49, baseType: !1347)
!1347 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1343, file: !4, line: 3922, baseType: !1349, size: 32, align: 32, offset: 32)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !927, line: 51, baseType: !918)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1343, file: !4, line: 3923, baseType: !1349, size: 32, align: 32, offset: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1343, file: !4, line: 3924, baseType: !918, size: 32, align: 32, offset: 96)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1343, file: !4, line: 3925, baseType: !1353, size: 64, align: 64, offset: 128)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1356)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1357)
!1357 = !{!1358, !1359, !1360, !1361, !1362, !1363, !1369, !1373, !1375, !1376, !1378, !1379}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1356, file: !4, line: 3886, baseType: !917, size: 32, align: 32)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1356, file: !4, line: 3887, baseType: !917, size: 32, align: 32, offset: 32)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1356, file: !4, line: 3888, baseType: !917, size: 32, align: 32, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1356, file: !4, line: 3889, baseType: !917, size: 32, align: 32, offset: 96)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1356, file: !4, line: 3890, baseType: !917, size: 32, align: 32, offset: 128)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1356, file: !4, line: 3897, baseType: !1364, size: 768, align: 64, offset: 192)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1365)
!1365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1366)
!1366 = !{!1367, !1368}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1365, file: !4, line: 3855, baseType: !924, size: 512, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1365, file: !4, line: 3857, baseType: !932, size: 256, align: 32, offset: 512)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1356, file: !4, line: 3903, baseType: !1370, size: 256, align: 64, offset: 960)
!1370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 256, align: 64, elements: !1371)
!1371 = !{!1372}
!1372 = !DISubrange(count: 4)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1356, file: !4, line: 3904, baseType: !1374, size: 128, align: 32, offset: 1216)
!1374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 128, align: 32, elements: !1371)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1356, file: !4, line: 3906, baseType: !750, size: 32, align: 32, offset: 1344)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1356, file: !4, line: 3908, baseType: !1377, size: 64, align: 64, offset: 1408)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1356, file: !4, line: 3915, baseType: !1377, size: 64, align: 64, offset: 1472)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1356, file: !4, line: 3917, baseType: !917, size: 32, align: 32, offset: 1536)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1343, file: !4, line: 3926, baseType: !949, size: 64, align: 64, offset: 192)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1281, file: !4, line: 3564, baseType: !1382, size: 64, align: 64, offset: 1344)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DISubroutineType(types: !1384)
!1384 = !{!917, !1271, !1141, !1385, !1387}
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1281, file: !4, line: 3566, baseType: !1389, size: 64, align: 64, offset: 1408)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DISubroutineType(types: !1391)
!1391 = !{!917, !1271, !957, !1387, !1141}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1281, file: !4, line: 3567, baseType: !1318, size: 64, align: 64, offset: 1472)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1281, file: !4, line: 3576, baseType: !1394, size: 64, align: 64, offset: 1536)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{!917, !1271, !1385}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1281, file: !4, line: 3577, baseType: !1398, size: 64, align: 64, offset: 1600)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DISubroutineType(types: !1400)
!1400 = !{!917, !1271, !1141}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1281, file: !4, line: 3584, baseType: !1402, size: 64, align: 64, offset: 1664)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DISubroutineType(types: !1404)
!1404 = !{!917, !1271, !919}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1281, file: !4, line: 3589, baseType: !1406, size: 64, align: 64, offset: 1728)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DISubroutineType(types: !1408)
!1408 = !{null, !1271}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1281, file: !4, line: 3594, baseType: !917, size: 32, align: 32, offset: 1792)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1281, file: !4, line: 3600, baseType: !1037, size: 64, align: 64, offset: 1856)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1281, file: !4, line: 3609, baseType: !1412, size: 64, align: 64, offset: 1920)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1415)
!1415 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1273, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1273, file: !4, line: 1581, baseType: !918, size: 32, align: 32, offset: 224)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1273, file: !4, line: 1583, baseType: !957, size: 64, align: 64, offset: 256)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1273, file: !4, line: 1591, baseType: !1420, size: 64, align: 64, offset: 320)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1273, file: !4, line: 1598, baseType: !957, size: 64, align: 64, offset: 384)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1273, file: !4, line: 1606, baseType: !949, size: 64, align: 64, offset: 448)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1273, file: !4, line: 1614, baseType: !917, size: 32, align: 32, offset: 512)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1273, file: !4, line: 1622, baseType: !917, size: 32, align: 32, offset: 544)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1273, file: !4, line: 1628, baseType: !917, size: 32, align: 32, offset: 576)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1273, file: !4, line: 1636, baseType: !917, size: 32, align: 32, offset: 608)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1273, file: !4, line: 1643, baseType: !917, size: 32, align: 32, offset: 640)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1273, file: !4, line: 1657, baseType: !925, size: 64, align: 64, offset: 704)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1273, file: !4, line: 1658, baseType: !917, size: 32, align: 32, offset: 768)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1273, file: !4, line: 1679, baseType: !942, size: 64, align: 32, offset: 800)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1273, file: !4, line: 1688, baseType: !917, size: 32, align: 32, offset: 864)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1273, file: !4, line: 1712, baseType: !917, size: 32, align: 32, offset: 896)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1273, file: !4, line: 1729, baseType: !917, size: 32, align: 32, offset: 928)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1273, file: !4, line: 1729, baseType: !917, size: 32, align: 32, offset: 960)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1273, file: !4, line: 1744, baseType: !917, size: 32, align: 32, offset: 992)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1273, file: !4, line: 1744, baseType: !917, size: 32, align: 32, offset: 1024)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1273, file: !4, line: 1751, baseType: !917, size: 32, align: 32, offset: 1056)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1273, file: !4, line: 1766, baseType: !533, size: 32, align: 32, offset: 1088)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1273, file: !4, line: 1791, baseType: !1441, size: 64, align: 64, offset: 1152)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DISubroutineType(types: !1443)
!1443 = !{null, !1444, !1385, !1387, !917, !917, !917}
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1273, file: !4, line: 1808, baseType: !1446, size: 64, align: 64, offset: 1216)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DISubroutineType(types: !1448)
!1448 = !{!533, !1444, !1292}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1273, file: !4, line: 1816, baseType: !917, size: 32, align: 32, offset: 1280)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1273, file: !4, line: 1825, baseType: !1451, size: 32, align: 32, offset: 1312)
!1451 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1273, file: !4, line: 1830, baseType: !917, size: 32, align: 32, offset: 1344)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1273, file: !4, line: 1838, baseType: !1451, size: 32, align: 32, offset: 1376)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1273, file: !4, line: 1846, baseType: !917, size: 32, align: 32, offset: 1408)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1273, file: !4, line: 1851, baseType: !917, size: 32, align: 32, offset: 1440)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1273, file: !4, line: 1861, baseType: !1451, size: 32, align: 32, offset: 1472)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1273, file: !4, line: 1868, baseType: !1451, size: 32, align: 32, offset: 1504)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1273, file: !4, line: 1875, baseType: !1451, size: 32, align: 32, offset: 1536)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1273, file: !4, line: 1882, baseType: !1451, size: 32, align: 32, offset: 1568)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1273, file: !4, line: 1889, baseType: !1451, size: 32, align: 32, offset: 1600)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1273, file: !4, line: 1896, baseType: !1451, size: 32, align: 32, offset: 1632)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1273, file: !4, line: 1903, baseType: !1451, size: 32, align: 32, offset: 1664)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1273, file: !4, line: 1910, baseType: !917, size: 32, align: 32, offset: 1696)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1273, file: !4, line: 1915, baseType: !917, size: 32, align: 32, offset: 1728)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1273, file: !4, line: 1926, baseType: !1387, size: 64, align: 64, offset: 1792)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1273, file: !4, line: 1935, baseType: !942, size: 64, align: 32, offset: 1856)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1273, file: !4, line: 1942, baseType: !917, size: 32, align: 32, offset: 1920)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1273, file: !4, line: 1948, baseType: !917, size: 32, align: 32, offset: 1952)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1273, file: !4, line: 1954, baseType: !917, size: 32, align: 32, offset: 1984)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1273, file: !4, line: 1960, baseType: !917, size: 32, align: 32, offset: 2016)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1273, file: !4, line: 1984, baseType: !917, size: 32, align: 32, offset: 2048)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1273, file: !4, line: 1991, baseType: !917, size: 32, align: 32, offset: 2080)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1273, file: !4, line: 1996, baseType: !917, size: 32, align: 32, offset: 2112)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1273, file: !4, line: 2004, baseType: !917, size: 32, align: 32, offset: 2144)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1273, file: !4, line: 2011, baseType: !917, size: 32, align: 32, offset: 2176)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1273, file: !4, line: 2018, baseType: !917, size: 32, align: 32, offset: 2208)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1273, file: !4, line: 2027, baseType: !917, size: 32, align: 32, offset: 2240)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1273, file: !4, line: 2034, baseType: !917, size: 32, align: 32, offset: 2272)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1273, file: !4, line: 2044, baseType: !917, size: 32, align: 32, offset: 2304)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1273, file: !4, line: 2054, baseType: !1481, size: 64, align: 64, offset: 2368)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1273, file: !4, line: 2061, baseType: !1481, size: 64, align: 64, offset: 2432)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1273, file: !4, line: 2066, baseType: !917, size: 32, align: 32, offset: 2496)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1273, file: !4, line: 2070, baseType: !917, size: 32, align: 32, offset: 2528)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1273, file: !4, line: 2078, baseType: !917, size: 32, align: 32, offset: 2560)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1273, file: !4, line: 2085, baseType: !917, size: 32, align: 32, offset: 2592)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1273, file: !4, line: 2092, baseType: !917, size: 32, align: 32, offset: 2624)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1273, file: !4, line: 2099, baseType: !917, size: 32, align: 32, offset: 2656)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1273, file: !4, line: 2106, baseType: !917, size: 32, align: 32, offset: 2688)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1273, file: !4, line: 2113, baseType: !917, size: 32, align: 32, offset: 2720)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1273, file: !4, line: 2120, baseType: !917, size: 32, align: 32, offset: 2752)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1273, file: !4, line: 2125, baseType: !917, size: 32, align: 32, offset: 2784)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1273, file: !4, line: 2133, baseType: !917, size: 32, align: 32, offset: 2816)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1273, file: !4, line: 2140, baseType: !917, size: 32, align: 32, offset: 2848)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1273, file: !4, line: 2145, baseType: !917, size: 32, align: 32, offset: 2880)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1273, file: !4, line: 2153, baseType: !917, size: 32, align: 32, offset: 2912)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1273, file: !4, line: 2158, baseType: !917, size: 32, align: 32, offset: 2944)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1273, file: !4, line: 2166, baseType: !796, size: 32, align: 32, offset: 2976)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1273, file: !4, line: 2173, baseType: !814, size: 32, align: 32, offset: 3008)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1273, file: !4, line: 2180, baseType: !838, size: 32, align: 32, offset: 3040)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1273, file: !4, line: 2187, baseType: !790, size: 32, align: 32, offset: 3072)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1273, file: !4, line: 2194, baseType: !857, size: 32, align: 32, offset: 3104)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1273, file: !4, line: 2203, baseType: !917, size: 32, align: 32, offset: 3136)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1273, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1273, file: !4, line: 2212, baseType: !917, size: 32, align: 32, offset: 3200)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1273, file: !4, line: 2213, baseType: !917, size: 32, align: 32, offset: 3232)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1273, file: !4, line: 2220, baseType: !733, size: 32, align: 32, offset: 3264)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1273, file: !4, line: 2232, baseType: !917, size: 32, align: 32, offset: 3296)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1273, file: !4, line: 2243, baseType: !917, size: 32, align: 32, offset: 3328)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1273, file: !4, line: 2249, baseType: !917, size: 32, align: 32, offset: 3360)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1273, file: !4, line: 2256, baseType: !917, size: 32, align: 32, offset: 3392)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1273, file: !4, line: 2263, baseType: !960, size: 64, align: 64, offset: 3456)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1273, file: !4, line: 2270, baseType: !960, size: 64, align: 64, offset: 3520)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1273, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1273, file: !4, line: 2285, baseType: !733, size: 32, align: 32, offset: 3616)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1273, file: !4, line: 2367, baseType: !1517, size: 64, align: 64, offset: 3648)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1518 = !DISubroutineType(types: !1519)
!1519 = !{!917, !1444, !919, !917}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1273, file: !4, line: 2383, baseType: !917, size: 32, align: 32, offset: 3712)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1273, file: !4, line: 2386, baseType: !1451, size: 32, align: 32, offset: 3744)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1273, file: !4, line: 2387, baseType: !1451, size: 32, align: 32, offset: 3776)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1273, file: !4, line: 2394, baseType: !917, size: 32, align: 32, offset: 3808)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1273, file: !4, line: 2401, baseType: !917, size: 32, align: 32, offset: 3840)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1273, file: !4, line: 2408, baseType: !917, size: 32, align: 32, offset: 3872)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1273, file: !4, line: 2415, baseType: !917, size: 32, align: 32, offset: 3904)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1273, file: !4, line: 2422, baseType: !917, size: 32, align: 32, offset: 3936)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1273, file: !4, line: 2423, baseType: !1529, size: 64, align: 64, offset: 3968)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1531)
!1531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1532)
!1532 = !{!1533, !1534, !1535, !1536}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1531, file: !4, line: 827, baseType: !917, size: 32, align: 32)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1531, file: !4, line: 828, baseType: !917, size: 32, align: 32, offset: 32)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1531, file: !4, line: 829, baseType: !917, size: 32, align: 32, offset: 64)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1531, file: !4, line: 830, baseType: !1451, size: 32, align: 32, offset: 96)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1273, file: !4, line: 2430, baseType: !949, size: 64, align: 64, offset: 4032)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1273, file: !4, line: 2437, baseType: !949, size: 64, align: 64, offset: 4096)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1273, file: !4, line: 2444, baseType: !1451, size: 32, align: 32, offset: 4160)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1273, file: !4, line: 2451, baseType: !1451, size: 32, align: 32, offset: 4192)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1273, file: !4, line: 2458, baseType: !917, size: 32, align: 32, offset: 4224)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1273, file: !4, line: 2469, baseType: !917, size: 32, align: 32, offset: 4256)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1273, file: !4, line: 2475, baseType: !917, size: 32, align: 32, offset: 4288)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1273, file: !4, line: 2481, baseType: !917, size: 32, align: 32, offset: 4320)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1273, file: !4, line: 2485, baseType: !917, size: 32, align: 32, offset: 4352)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1273, file: !4, line: 2489, baseType: !917, size: 32, align: 32, offset: 4384)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1273, file: !4, line: 2493, baseType: !917, size: 32, align: 32, offset: 4416)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1273, file: !4, line: 2501, baseType: !917, size: 32, align: 32, offset: 4448)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1273, file: !4, line: 2506, baseType: !917, size: 32, align: 32, offset: 4480)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1273, file: !4, line: 2510, baseType: !917, size: 32, align: 32, offset: 4512)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1273, file: !4, line: 2514, baseType: !949, size: 64, align: 64, offset: 4544)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1273, file: !4, line: 2528, baseType: !1553, size: 64, align: 64, offset: 4608)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DISubroutineType(types: !1555)
!1555 = !{null, !1444, !957, !917, !917}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1273, file: !4, line: 2534, baseType: !917, size: 32, align: 32, offset: 4672)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1273, file: !4, line: 2545, baseType: !917, size: 32, align: 32, offset: 4704)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1273, file: !4, line: 2547, baseType: !917, size: 32, align: 32, offset: 4736)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1273, file: !4, line: 2549, baseType: !917, size: 32, align: 32, offset: 4768)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1273, file: !4, line: 2551, baseType: !917, size: 32, align: 32, offset: 4800)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1273, file: !4, line: 2553, baseType: !917, size: 32, align: 32, offset: 4832)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1273, file: !4, line: 2555, baseType: !917, size: 32, align: 32, offset: 4864)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1273, file: !4, line: 2557, baseType: !917, size: 32, align: 32, offset: 4896)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1273, file: !4, line: 2559, baseType: !917, size: 32, align: 32, offset: 4928)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1273, file: !4, line: 2563, baseType: !917, size: 32, align: 32, offset: 4960)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1273, file: !4, line: 2571, baseType: !1377, size: 64, align: 64, offset: 4992)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1273, file: !4, line: 2579, baseType: !1377, size: 64, align: 64, offset: 5056)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1273, file: !4, line: 2586, baseType: !917, size: 32, align: 32, offset: 5120)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1273, file: !4, line: 2615, baseType: !917, size: 32, align: 32, offset: 5152)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1273, file: !4, line: 2627, baseType: !917, size: 32, align: 32, offset: 5184)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1273, file: !4, line: 2637, baseType: !917, size: 32, align: 32, offset: 5216)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1273, file: !4, line: 2681, baseType: !917, size: 32, align: 32, offset: 5248)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1273, file: !4, line: 2709, baseType: !949, size: 64, align: 64, offset: 5312)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1273, file: !4, line: 2716, baseType: !1575, size: 64, align: 64, offset: 5376)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64, align: 64)
!1576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1577)
!1577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1578)
!1578 = !{!1579, !1580, !1581, !1582, !1583, !1584, !1585, !1589, !1593, !1594, !1595, !1596, !1602, !1603, !1604, !1605, !1606}
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1577, file: !4, line: 3642, baseType: !1037, size: 64, align: 64)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1577, file: !4, line: 3649, baseType: !523, size: 32, align: 32, offset: 64)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1577, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1577, file: !4, line: 3663, baseType: !533, size: 32, align: 32, offset: 128)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1577, file: !4, line: 3669, baseType: !917, size: 32, align: 32, offset: 160)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1577, file: !4, line: 3682, baseType: !1402, size: 64, align: 64, offset: 192)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1577, file: !4, line: 3698, baseType: !1586, size: 64, align: 64, offset: 256)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DISubroutineType(types: !1588)
!1588 = !{!917, !1271, !1225, !1349}
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1577, file: !4, line: 3712, baseType: !1590, size: 64, align: 64, offset: 320)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DISubroutineType(types: !1592)
!1592 = !{!917, !1271, !917, !1225, !1349}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1577, file: !4, line: 3726, baseType: !1586, size: 64, align: 64, offset: 384)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1577, file: !4, line: 3737, baseType: !1318, size: 64, align: 64, offset: 448)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1577, file: !4, line: 3746, baseType: !917, size: 32, align: 32, offset: 512)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1577, file: !4, line: 3757, baseType: !1597, size: 64, align: 64, offset: 576)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DISubroutineType(types: !1599)
!1599 = !{null, !1600}
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1577, file: !4, line: 3766, baseType: !1318, size: 64, align: 64, offset: 640)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1577, file: !4, line: 3774, baseType: !1318, size: 64, align: 64, offset: 704)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1577, file: !4, line: 3780, baseType: !917, size: 32, align: 32, offset: 768)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1577, file: !4, line: 3785, baseType: !917, size: 32, align: 32, offset: 800)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1577, file: !4, line: 3795, baseType: !1607, size: 64, align: 64, offset: 832)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DISubroutineType(types: !1609)
!1609 = !{!917, !1271, !971}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1273, file: !4, line: 2728, baseType: !957, size: 64, align: 64, offset: 5440)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1273, file: !4, line: 2735, baseType: !959, size: 512, align: 64, offset: 5504)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1273, file: !4, line: 2742, baseType: !917, size: 32, align: 32, offset: 6016)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1273, file: !4, line: 2755, baseType: !917, size: 32, align: 32, offset: 6048)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1273, file: !4, line: 2776, baseType: !917, size: 32, align: 32, offset: 6080)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1273, file: !4, line: 2783, baseType: !917, size: 32, align: 32, offset: 6112)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1273, file: !4, line: 2791, baseType: !917, size: 32, align: 32, offset: 6144)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1273, file: !4, line: 2802, baseType: !919, size: 64, align: 64, offset: 6208)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1273, file: !4, line: 2811, baseType: !917, size: 32, align: 32, offset: 6272)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1273, file: !4, line: 2821, baseType: !917, size: 32, align: 32, offset: 6304)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1273, file: !4, line: 2830, baseType: !917, size: 32, align: 32, offset: 6336)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1273, file: !4, line: 2840, baseType: !917, size: 32, align: 32, offset: 6368)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1273, file: !4, line: 2851, baseType: !1623, size: 64, align: 64, offset: 6400)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DISubroutineType(types: !1625)
!1625 = !{!917, !1444, !1626, !957, !1387, !917, !917}
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{!917, !1444, !957}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1273, file: !4, line: 2871, baseType: !1630, size: 64, align: 64, offset: 6464)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DISubroutineType(types: !1632)
!1632 = !{!917, !1444, !1633, !957, !1387, !917}
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DISubroutineType(types: !1635)
!1635 = !{!917, !1444, !957, !917, !917}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1273, file: !4, line: 2878, baseType: !917, size: 32, align: 32, offset: 6528)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1273, file: !4, line: 2885, baseType: !917, size: 32, align: 32, offset: 6560)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1273, file: !4, line: 3005, baseType: !917, size: 32, align: 32, offset: 6592)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1273, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1273, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1273, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1273, file: !4, line: 3037, baseType: !925, size: 64, align: 64, offset: 6720)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1273, file: !4, line: 3038, baseType: !917, size: 32, align: 32, offset: 6784)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1273, file: !4, line: 3050, baseType: !960, size: 64, align: 64, offset: 6848)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1273, file: !4, line: 3065, baseType: !917, size: 32, align: 32, offset: 6912)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1273, file: !4, line: 3083, baseType: !917, size: 32, align: 32, offset: 6944)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1273, file: !4, line: 3092, baseType: !942, size: 64, align: 32, offset: 6976)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1273, file: !4, line: 3099, baseType: !533, size: 32, align: 32, offset: 7040)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1273, file: !4, line: 3106, baseType: !942, size: 64, align: 32, offset: 7072)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1273, file: !4, line: 3113, baseType: !1651, size: 64, align: 64, offset: 7168)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1653)
!1653 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1654)
!1654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1655)
!1655 = !{!1656, !1657, !1658, !1659, !1660, !1661, !1664}
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1654, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1654, file: !4, line: 714, baseType: !523, size: 32, align: 32, offset: 32)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1654, file: !4, line: 720, baseType: !1037, size: 64, align: 64, offset: 64)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1654, file: !4, line: 724, baseType: !1037, size: 64, align: 64, offset: 128)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1654, file: !4, line: 728, baseType: !917, size: 32, align: 32, offset: 192)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1654, file: !4, line: 734, baseType: !1662, size: 64, align: 64, offset: 256)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1654, file: !4, line: 739, baseType: !1665, size: 64, align: 64, offset: 320)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1309)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1273, file: !4, line: 3129, baseType: !949, size: 64, align: 64, offset: 7232)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1273, file: !4, line: 3130, baseType: !949, size: 64, align: 64, offset: 7296)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1273, file: !4, line: 3131, baseType: !949, size: 64, align: 64, offset: 7360)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1273, file: !4, line: 3132, baseType: !949, size: 64, align: 64, offset: 7424)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1273, file: !4, line: 3139, baseType: !1377, size: 64, align: 64, offset: 7488)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1273, file: !4, line: 3147, baseType: !917, size: 32, align: 32, offset: 7552)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1273, file: !4, line: 3165, baseType: !917, size: 32, align: 32, offset: 7584)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1273, file: !4, line: 3172, baseType: !917, size: 32, align: 32, offset: 7616)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1273, file: !4, line: 3180, baseType: !917, size: 32, align: 32, offset: 7648)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1273, file: !4, line: 3191, baseType: !1481, size: 64, align: 64, offset: 7680)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1273, file: !4, line: 3199, baseType: !925, size: 64, align: 64, offset: 7744)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1273, file: !4, line: 3207, baseType: !1377, size: 64, align: 64, offset: 7808)
