; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--hls.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--hls.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PlaylistType", file: !939, line: 82, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "libavformat/hls.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!940 = !{!941, !942, !943}
!941 = !DIEnumerator(name: "PLS_TYPE_UNSPECIFIED", value: 0)
!942 = !DIEnumerator(name: "PLS_TYPE_EVENT", value: 1)
!943 = !DIEnumerator(name: "PLS_TYPE_VOD", value: 2)
!944 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "KeyType", file: !939, line: 62, size: 32, align: 32, elements: !945)
!945 = !{!946, !947, !948}
!946 = !DIEnumerator(name: "KEY_NONE", value: 0)
!947 = !DIEnumerator(name: "KEY_AES_128", value: 1)
!948 = !DIEnumerator(name: "KEY_SAMPLE_AES", value: 2)
!949 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVRounding", file: !950, line: 79, size: 32, align: 32, elements: !951)
!950 = !DIFile(filename: "./libavutil/mathematics.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!951 = !{!952, !953, !954, !955, !956, !957}
!952 = !DIEnumerator(name: "AV_ROUND_ZERO", value: 0)
!953 = !DIEnumerator(name: "AV_ROUND_INF", value: 1)
!954 = !DIEnumerator(name: "AV_ROUND_DOWN", value: 2)
!955 = !DIEnumerator(name: "AV_ROUND_UP", value: 3)
!956 = !DIEnumerator(name: "AV_ROUND_NEAR_INF", value: 5)
!957 = !DIEnumerator(name: "AV_ROUND_PASS_MINMAX", value: 8192)
!958 = !{!959, !962, !963, !964, !965, !976, !970, !982, !986, !991}
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !960, line: 40, baseType: !961)
!960 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!961 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!963 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!964 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "ff_parse_key_val_cb", file: !966, line: 366, baseType: !967)
!966 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{null, !962, !970, !963, !973, !975}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !978, line: 221, size: 32, align: 8, elements: !979)
!978 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!979 = !{!980}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !977, file: !978, line: 221, baseType: !981, size: 32, align: 32)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !960, line: 51, baseType: !964)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !960, line: 48, baseType: !985)
!985 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !978, line: 220, size: 64, align: 8, elements: !989)
!989 = !{!990}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !988, file: !978, line: 220, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !960, line: 55, baseType: !992)
!992 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!993 = !{!994, !2224, !2225, !2231, !2241, !2335}
!994 = distinct !DIGlobalVariable(name: "ff_hls_demuxer", scope: !0, file: !939, line: 2327, type: !995, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_hls_demuxer)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1011, !1090, !1091, !1093, !1094, !1095, !1108, !2205, !2206, !2207, !2211, !2215, !2216, !2217, !2221, !2222, !2223}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !996, file: !919, line: 638, baseType: !970, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !996, file: !919, line: 645, baseType: !970, size: 64, align: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !996, file: !919, line: 652, baseType: !963, size: 32, align: 32, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !996, file: !919, line: 659, baseType: !970, size: 64, align: 64, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !996, file: !919, line: 661, baseType: !1003, size: 64, align: 64, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !966, line: 44, size: 64, align: 32, elements: !1008)
!1008 = !{!1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1007, file: !966, line: 45, baseType: !3, size: 32, align: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1007, file: !966, line: 46, baseType: !964, size: 32, align: 32, offset: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !996, file: !919, line: 663, baseType: !1012, size: 64, align: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1016)
!1016 = !{!1017, !1018, !1022, !1049, !1050, !1051, !1052, !1056, !1062, !1064, !1068}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1015, file: !486, line: 72, baseType: !970, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1015, file: !486, line: 78, baseType: !1019, size: 64, align: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!970, !962}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1015, file: !486, line: 85, baseType: !1023, size: 64, align: 64, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030, !1031, !1045, !1046, !1047, !1048}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1025, file: !464, line: 247, baseType: !970, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1025, file: !464, line: 253, baseType: !970, size: 64, align: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1025, file: !464, line: 259, baseType: !963, size: 32, align: 32, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1025, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1025, file: !464, line: 271, baseType: !1032, size: 64, align: 64, offset: 192)
!1032 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1025, file: !464, line: 265, size: 64, align: 64, elements: !1033)
!1033 = !{!1034, !1035, !1037, !1038}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1032, file: !464, line: 266, baseType: !959, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1032, file: !464, line: 267, baseType: !1036, size: 64, align: 64)
!1036 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1032, file: !464, line: 268, baseType: !970, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1032, file: !464, line: 270, baseType: !1039, size: 64, align: 32)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1040, line: 61, baseType: !1041)
!1040 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1040, line: 58, size: 64, align: 32, elements: !1042)
!1042 = !{!1043, !1044}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1041, file: !1040, line: 59, baseType: !963, size: 32, align: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1041, file: !1040, line: 60, baseType: !963, size: 32, align: 32, offset: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1025, file: !464, line: 272, baseType: !1036, size: 64, align: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1025, file: !464, line: 273, baseType: !1036, size: 64, align: 64, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1025, file: !464, line: 275, baseType: !963, size: 32, align: 32, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1025, file: !464, line: 300, baseType: !970, size: 64, align: 64, offset: 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1015, file: !486, line: 93, baseType: !963, size: 32, align: 32, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1015, file: !486, line: 99, baseType: !963, size: 32, align: 32, offset: 224)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1015, file: !486, line: 108, baseType: !963, size: 32, align: 32, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1015, file: !486, line: 113, baseType: !1053, size: 64, align: 64, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!962, !962, !962}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1015, file: !486, line: 123, baseType: !1057, size: 64, align: 64, offset: 384)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!1060, !1060}
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1015, file: !486, line: 130, baseType: !1063, size: 32, align: 32, offset: 448)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1015, file: !486, line: 136, baseType: !1065, size: 64, align: 64, offset: 512)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!1063, !962}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1015, file: !486, line: 142, baseType: !1069, size: 64, align: 64, offset: 576)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!963, !1072, !962, !970, !963}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1075)
!1075 = !{!1076, !1088, !1089}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1074, file: !464, line: 360, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1085, !1086, !1087}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1080, file: !464, line: 307, baseType: !970, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1080, file: !464, line: 313, baseType: !1036, size: 64, align: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1080, file: !464, line: 313, baseType: !1036, size: 64, align: 64, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1080, file: !464, line: 318, baseType: !1036, size: 64, align: 64, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1080, file: !464, line: 318, baseType: !1036, size: 64, align: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1080, file: !464, line: 323, baseType: !963, size: 32, align: 32, offset: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1074, file: !464, line: 364, baseType: !963, size: 32, align: 32, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1074, file: !464, line: 368, baseType: !963, size: 32, align: 32, offset: 96)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !996, file: !919, line: 670, baseType: !970, size: 64, align: 64, offset: 384)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !996, file: !919, line: 679, baseType: !1092, size: 64, align: 64, offset: 448)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !996, file: !919, line: 684, baseType: !963, size: 32, align: 32, offset: 512)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !996, file: !919, line: 689, baseType: !963, size: 32, align: 32, offset: 544)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !996, file: !919, line: 696, baseType: !1096, size: 64, align: 64, offset: 576)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!963, !1099}
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1102)
!1102 = !{!1103, !1104, !1106, !1107}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1101, file: !919, line: 449, baseType: !970, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1101, file: !919, line: 450, baseType: !1105, size: 64, align: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1101, file: !919, line: 451, baseType: !963, size: 32, align: 32, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1101, file: !919, line: 452, baseType: !970, size: 64, align: 64, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !996, file: !919, line: 703, baseType: !1109, size: 64, align: 64, offset: 640)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!963, !1112}
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1304, !1305, !1370, !1371, !1372, !2062, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2116, !2117, !2118, !2119, !2120, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2171, !2172, !2175, !2176, !2177, !2178, !2179, !2180, !2182, !2183, !2184, !2185, !2193, !2194, !2198, !2202, !2203, !2204}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1113, file: !919, line: 1342, baseType: !1012, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1113, file: !919, line: 1349, baseType: !1092, size: 64, align: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1113, file: !919, line: 1356, baseType: !1118, size: 64, align: 64, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1120)
!1120 = !{!1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1172, !1173, !1177, !1181, !1186, !1192, !1279, !1285, !1291, !1292, !1293, !1294, !1298}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1119, file: !919, line: 498, baseType: !970, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1119, file: !919, line: 504, baseType: !970, size: 64, align: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1119, file: !919, line: 505, baseType: !970, size: 64, align: 64, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1119, file: !919, line: 506, baseType: !970, size: 64, align: 64, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1119, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1119, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1119, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1119, file: !919, line: 517, baseType: !963, size: 32, align: 32, offset: 352)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1119, file: !919, line: 523, baseType: !1003, size: 64, align: 64, offset: 384)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1119, file: !919, line: 526, baseType: !1012, size: 64, align: 64, offset: 448)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1119, file: !919, line: 535, baseType: !1118, size: 64, align: 64, offset: 512)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1119, file: !919, line: 539, baseType: !963, size: 32, align: 32, offset: 576)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1119, file: !919, line: 541, baseType: !1109, size: 64, align: 64, offset: 640)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1119, file: !919, line: 549, baseType: !1135, size: 64, align: 64, offset: 704)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!963, !1112, !1138}
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1141)
!1141 = !{!1142, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1168, !1169, !1170, !1171}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1140, file: !4, line: 1451, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1145, line: 94, baseType: !1146)
!1145 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1145, line: 81, size: 192, align: 64, elements: !1147)
!1147 = !{!1148, !1152, !1153}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1146, file: !1145, line: 82, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1145, line: 73, baseType: !1151)
!1151 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1145, line: 73, flags: DIFlagFwdDecl)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1146, file: !1145, line: 89, baseType: !983, size: 64, align: 64, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1146, file: !1145, line: 93, baseType: !963, size: 32, align: 32, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1140, file: !4, line: 1461, baseType: !959, size: 64, align: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1140, file: !4, line: 1467, baseType: !959, size: 64, align: 64, offset: 128)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1140, file: !4, line: 1468, baseType: !983, size: 64, align: 64, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1140, file: !4, line: 1469, baseType: !963, size: 32, align: 32, offset: 256)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1140, file: !4, line: 1470, baseType: !963, size: 32, align: 32, offset: 288)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1140, file: !4, line: 1474, baseType: !963, size: 32, align: 32, offset: 320)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1140, file: !4, line: 1479, baseType: !1161, size: 64, align: 64, offset: 384)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1164)
!1164 = !{!1165, !1166, !1167}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1163, file: !4, line: 1412, baseType: !983, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1163, file: !4, line: 1413, baseType: !963, size: 32, align: 32, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1163, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1140, file: !4, line: 1480, baseType: !963, size: 32, align: 32, offset: 448)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1140, file: !4, line: 1486, baseType: !959, size: 64, align: 64, offset: 512)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1140, file: !4, line: 1488, baseType: !959, size: 64, align: 64, offset: 576)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1140, file: !4, line: 1497, baseType: !959, size: 64, align: 64, offset: 640)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1119, file: !919, line: 550, baseType: !1109, size: 64, align: 64, offset: 768)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1119, file: !919, line: 554, baseType: !1174, size: 64, align: 64, offset: 832)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!963, !1112, !1138, !1138, !963}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1119, file: !919, line: 563, baseType: !1178, size: 64, align: 64, offset: 896)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!963, !3, !963}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1119, file: !919, line: 565, baseType: !1182, size: 64, align: 64, offset: 960)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{null, !1112, !963, !1185, !1185}
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1119, file: !919, line: 570, baseType: !1187, size: 64, align: 64, offset: 1024)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!963, !1112, !963, !962, !1190}
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1191, line: 216, baseType: !992)
!1191 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1119, file: !919, line: 581, baseType: !1193, size: 64, align: 64, offset: 1088)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!963, !1112, !963, !1196, !964}
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1200)
!1200 = !{!1201, !1205, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1233, !1235, !1236, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1199, file: !548, line: 282, baseType: !1202, size: 512, align: 64)
!1202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !983, size: 512, align: 64, elements: !1203)
!1203 = !{!1204}
!1204 = !DISubrange(count: 8)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1199, file: !548, line: 299, baseType: !1206, size: 256, align: 32, offset: 512)
!1206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 256, align: 32, elements: !1203)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1199, file: !548, line: 315, baseType: !982, size: 64, align: 64, offset: 768)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1199, file: !548, line: 326, baseType: !963, size: 32, align: 32, offset: 832)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1199, file: !548, line: 326, baseType: !963, size: 32, align: 32, offset: 864)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1199, file: !548, line: 334, baseType: !963, size: 32, align: 32, offset: 896)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1199, file: !548, line: 341, baseType: !963, size: 32, align: 32, offset: 928)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1199, file: !548, line: 346, baseType: !963, size: 32, align: 32, offset: 960)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1199, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1199, file: !548, line: 356, baseType: !1039, size: 64, align: 32, offset: 1024)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1199, file: !548, line: 361, baseType: !959, size: 64, align: 64, offset: 1088)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1199, file: !548, line: 369, baseType: !959, size: 64, align: 64, offset: 1152)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1199, file: !548, line: 377, baseType: !959, size: 64, align: 64, offset: 1216)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1199, file: !548, line: 382, baseType: !963, size: 32, align: 32, offset: 1280)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1199, file: !548, line: 386, baseType: !963, size: 32, align: 32, offset: 1312)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1199, file: !548, line: 391, baseType: !963, size: 32, align: 32, offset: 1344)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1199, file: !548, line: 396, baseType: !962, size: 64, align: 64, offset: 1408)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1199, file: !548, line: 403, baseType: !1223, size: 512, align: 64, offset: 1472)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 512, align: 64, elements: !1203)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1199, file: !548, line: 410, baseType: !963, size: 32, align: 32, offset: 1984)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1199, file: !548, line: 415, baseType: !963, size: 32, align: 32, offset: 2016)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1199, file: !548, line: 420, baseType: !963, size: 32, align: 32, offset: 2048)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1199, file: !548, line: 425, baseType: !963, size: 32, align: 32, offset: 2080)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1199, file: !548, line: 435, baseType: !959, size: 64, align: 64, offset: 2112)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1199, file: !548, line: 440, baseType: !963, size: 32, align: 32, offset: 2176)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1199, file: !548, line: 445, baseType: !991, size: 64, align: 64, offset: 2240)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1199, file: !548, line: 459, baseType: !1232, size: 512, align: 64, offset: 2304)
!1232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1143, size: 512, align: 64, elements: !1203)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1199, file: !548, line: 473, baseType: !1234, size: 64, align: 64, offset: 2816)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1199, file: !548, line: 477, baseType: !963, size: 32, align: 32, offset: 2880)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1199, file: !548, line: 479, baseType: !1237, size: 64, align: 64, offset: 2944)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1241)
!1241 = !{!1242, !1243, !1244, !1245, !1250}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1240, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1240, file: !548, line: 203, baseType: !983, size: 64, align: 64, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1240, file: !548, line: 204, baseType: !963, size: 32, align: 32, offset: 128)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1240, file: !548, line: 205, baseType: !1246, size: 64, align: 64, offset: 192)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1248, line: 86, baseType: !1249)
!1248 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1249 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1248, line: 86, flags: DIFlagFwdDecl)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1240, file: !548, line: 206, baseType: !1143, size: 64, align: 64, offset: 256)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1199, file: !548, line: 480, baseType: !963, size: 32, align: 32, offset: 3008)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1199, file: !548, line: 505, baseType: !963, size: 32, align: 32, offset: 3040)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1199, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1199, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1199, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1199, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1199, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1199, file: !548, line: 532, baseType: !959, size: 64, align: 64, offset: 3264)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1199, file: !548, line: 539, baseType: !959, size: 64, align: 64, offset: 3328)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1199, file: !548, line: 547, baseType: !959, size: 64, align: 64, offset: 3392)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1199, file: !548, line: 554, baseType: !1246, size: 64, align: 64, offset: 3456)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1199, file: !548, line: 563, baseType: !963, size: 32, align: 32, offset: 3520)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1199, file: !548, line: 572, baseType: !963, size: 32, align: 32, offset: 3552)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1199, file: !548, line: 581, baseType: !963, size: 32, align: 32, offset: 3584)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1199, file: !548, line: 588, baseType: !1266, size: 64, align: 64, offset: 3648)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !960, line: 36, baseType: !1268)
!1268 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1199, file: !548, line: 593, baseType: !963, size: 32, align: 32, offset: 3712)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1199, file: !548, line: 596, baseType: !963, size: 32, align: 32, offset: 3744)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1199, file: !548, line: 599, baseType: !1143, size: 64, align: 64, offset: 3776)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1199, file: !548, line: 605, baseType: !1143, size: 64, align: 64, offset: 3840)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1199, file: !548, line: 616, baseType: !1143, size: 64, align: 64, offset: 3904)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1199, file: !548, line: 626, baseType: !1190, size: 64, align: 64, offset: 3968)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1199, file: !548, line: 627, baseType: !1190, size: 64, align: 64, offset: 4032)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1199, file: !548, line: 628, baseType: !1190, size: 64, align: 64, offset: 4096)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1199, file: !548, line: 629, baseType: !1190, size: 64, align: 64, offset: 4160)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1199, file: !548, line: 645, baseType: !1143, size: 64, align: 64, offset: 4224)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1119, file: !919, line: 587, baseType: !1280, size: 64, align: 64, offset: 1152)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!963, !1112, !1283}
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1119, file: !919, line: 592, baseType: !1286, size: 64, align: 64, offset: 1216)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!963, !1112, !1289}
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1119, file: !919, line: 597, baseType: !1286, size: 64, align: 64, offset: 1280)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1119, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1119, file: !919, line: 608, baseType: !1109, size: 64, align: 64, offset: 1408)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1119, file: !919, line: 617, baseType: !1295, size: 64, align: 64, offset: 1472)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{null, !1112}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1119, file: !919, line: 623, baseType: !1299, size: 64, align: 64, offset: 1536)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DISubroutineType(types: !1301)
!1301 = !{!963, !1112, !1302}
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1139)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1113, file: !919, line: 1365, baseType: !962, size: 64, align: 64, offset: 192)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1113, file: !919, line: 1379, baseType: !1306, size: 64, align: 64, offset: 256)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1308)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1309)
!1309 = !{!1310, !1311, !1312, !1313, !1314, !1315, !1316, !1320, !1321, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1337, !1338, !1342, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1360, !1361, !1362, !1363, !1367, !1368, !1369}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1308, file: !650, line: 174, baseType: !1012, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1308, file: !650, line: 226, baseType: !1105, size: 64, align: 64, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1308, file: !650, line: 227, baseType: !963, size: 32, align: 32, offset: 128)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1308, file: !650, line: 228, baseType: !1105, size: 64, align: 64, offset: 192)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1308, file: !650, line: 229, baseType: !1105, size: 64, align: 64, offset: 256)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1308, file: !650, line: 233, baseType: !962, size: 64, align: 64, offset: 320)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1308, file: !650, line: 235, baseType: !1317, size: 64, align: 64, offset: 384)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!963, !962, !983, !963}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1308, file: !650, line: 236, baseType: !1317, size: 64, align: 64, offset: 448)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1308, file: !650, line: 237, baseType: !1322, size: 64, align: 64, offset: 512)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!959, !962, !959, !963}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1308, file: !650, line: 238, baseType: !959, size: 64, align: 64, offset: 576)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1308, file: !650, line: 239, baseType: !963, size: 32, align: 32, offset: 640)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1308, file: !650, line: 240, baseType: !963, size: 32, align: 32, offset: 672)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1308, file: !650, line: 241, baseType: !963, size: 32, align: 32, offset: 704)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1308, file: !650, line: 242, baseType: !992, size: 64, align: 64, offset: 768)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1308, file: !650, line: 243, baseType: !1105, size: 64, align: 64, offset: 832)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1308, file: !650, line: 244, baseType: !1332, size: 64, align: 64, offset: 896)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!992, !992, !1335, !964}
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1308, file: !650, line: 245, baseType: !963, size: 32, align: 32, offset: 960)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1308, file: !650, line: 249, baseType: !1339, size: 64, align: 64, offset: 1024)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DISubroutineType(types: !1341)
!1341 = !{!963, !962, !963}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1308, file: !650, line: 255, baseType: !1343, size: 64, align: 64, offset: 1088)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{!959, !962, !963, !959, !963}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1308, file: !650, line: 260, baseType: !963, size: 32, align: 32, offset: 1152)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1308, file: !650, line: 266, baseType: !959, size: 64, align: 64, offset: 1216)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1308, file: !650, line: 273, baseType: !963, size: 32, align: 32, offset: 1280)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1308, file: !650, line: 279, baseType: !959, size: 64, align: 64, offset: 1344)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1308, file: !650, line: 285, baseType: !963, size: 32, align: 32, offset: 1408)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1308, file: !650, line: 291, baseType: !963, size: 32, align: 32, offset: 1440)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1308, file: !650, line: 298, baseType: !963, size: 32, align: 32, offset: 1472)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1308, file: !650, line: 304, baseType: !963, size: 32, align: 32, offset: 1504)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1308, file: !650, line: 309, baseType: !970, size: 64, align: 64, offset: 1536)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1308, file: !650, line: 314, baseType: !970, size: 64, align: 64, offset: 1600)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1308, file: !650, line: 319, baseType: !1357, size: 64, align: 64, offset: 1664)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DISubroutineType(types: !1359)
!1359 = !{!963, !962, !983, !963, !649, !959}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1308, file: !650, line: 326, baseType: !963, size: 32, align: 32, offset: 1728)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1308, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1308, file: !650, line: 332, baseType: !959, size: 64, align: 64, offset: 1792)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1308, file: !650, line: 338, baseType: !1364, size: 64, align: 64, offset: 1856)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DISubroutineType(types: !1366)
!1366 = !{!963, !962}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1308, file: !650, line: 340, baseType: !959, size: 64, align: 64, offset: 1920)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1308, file: !650, line: 346, baseType: !1105, size: 64, align: 64, offset: 1984)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1308, file: !650, line: 351, baseType: !963, size: 32, align: 32, offset: 2048)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1113, file: !919, line: 1386, baseType: !963, size: 32, align: 32, offset: 320)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1113, file: !919, line: 1393, baseType: !964, size: 32, align: 32, offset: 352)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1113, file: !919, line: 1405, baseType: !1373, size: 64, align: 64, offset: 384)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1376)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1377)
!1377 = !{!1378, !1379, !1380, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1848, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1948, !1954, !1955, !1959, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1991, !1992, !1993, !1994, !1995, !1996}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1376, file: !919, line: 866, baseType: !963, size: 32, align: 32)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1376, file: !919, line: 872, baseType: !963, size: 32, align: 32, offset: 32)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1376, file: !919, line: 878, baseType: !1381, size: 64, align: 64, offset: 64)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1383)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1384)
!1384 = !{!1385, !1386, !1387, !1388, !1523, !1524, !1525, !1526, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1552, !1556, !1557, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1736, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1383, file: !4, line: 1561, baseType: !1012, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1383, file: !4, line: 1562, baseType: !963, size: 32, align: 32, offset: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1383, file: !4, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1383, file: !4, line: 1565, baseType: !1389, size: 64, align: 64, offset: 128)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1391)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1392)
!1392 = !{!1393, !1394, !1395, !1396, !1397, !1398, !1401, !1404, !1407, !1410, !1413, !1414, !1415, !1423, !1424, !1425, !1427, !1431, !1437, !1442, !1446, !1447, !1489, !1495, !1499, !1500, !1504, !1508, !1512, !1516, !1517, !1518}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1391, file: !4, line: 3475, baseType: !970, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1391, file: !4, line: 3480, baseType: !970, size: 64, align: 64, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1391, file: !4, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1391, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1391, file: !4, line: 3487, baseType: !963, size: 32, align: 32, offset: 192)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1391, file: !4, line: 3488, baseType: !1399, size: 64, align: 64, offset: 256)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1391, file: !4, line: 3489, baseType: !1402, size: 64, align: 64, offset: 320)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1391, file: !4, line: 3490, baseType: !1405, size: 64, align: 64, offset: 384)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1391, file: !4, line: 3491, baseType: !1408, size: 64, align: 64, offset: 448)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1391, file: !4, line: 3492, baseType: !1411, size: 64, align: 64, offset: 512)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1391, file: !4, line: 3493, baseType: !984, size: 8, align: 8, offset: 576)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1391, file: !4, line: 3494, baseType: !1012, size: 64, align: 64, offset: 640)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1391, file: !4, line: 3495, baseType: !1416, size: 64, align: 64, offset: 704)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1418)
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1419)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1420)
!1420 = !{!1421, !1422}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1419, file: !4, line: 3402, baseType: !963, size: 32, align: 32)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1419, file: !4, line: 3403, baseType: !970, size: 64, align: 64, offset: 64)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1391, file: !4, line: 3507, baseType: !970, size: 64, align: 64, offset: 768)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1391, file: !4, line: 3516, baseType: !963, size: 32, align: 32, offset: 832)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1391, file: !4, line: 3517, baseType: !1426, size: 64, align: 64, offset: 896)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1391, file: !4, line: 3527, baseType: !1428, size: 64, align: 64, offset: 960)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{!963, !1381}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1391, file: !4, line: 3535, baseType: !1432, size: 64, align: 64, offset: 1024)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DISubroutineType(types: !1434)
!1434 = !{!963, !1381, !1435}
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1382)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1391, file: !4, line: 3541, baseType: !1438, size: 64, align: 64, offset: 1088)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1440)
!1440 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1441)
!1441 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1391, file: !4, line: 3549, baseType: !1443, size: 64, align: 64, offset: 1152)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DISubroutineType(types: !1445)
!1445 = !{null, !1426}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1391, file: !4, line: 3551, baseType: !1428, size: 64, align: 64, offset: 1216)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1391, file: !4, line: 3552, baseType: !1448, size: 64, align: 64, offset: 1280)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!963, !1381, !983, !963, !1451}
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1453)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1454)
!1454 = !{!1455, !1458, !1459, !1460, !1461, !1488}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1453, file: !4, line: 3921, baseType: !1456, size: 16, align: 16)
!1456 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !960, line: 49, baseType: !1457)
!1457 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1453, file: !4, line: 3922, baseType: !981, size: 32, align: 32, offset: 32)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1453, file: !4, line: 3923, baseType: !981, size: 32, align: 32, offset: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1453, file: !4, line: 3924, baseType: !964, size: 32, align: 32, offset: 96)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1453, file: !4, line: 3925, baseType: !1462, size: 64, align: 64, offset: 128)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1465)
!1465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1466)
!1466 = !{!1467, !1468, !1469, !1470, !1471, !1472, !1478, !1482, !1484, !1485, !1486, !1487}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1465, file: !4, line: 3886, baseType: !963, size: 32, align: 32)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1465, file: !4, line: 3887, baseType: !963, size: 32, align: 32, offset: 32)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1465, file: !4, line: 3888, baseType: !963, size: 32, align: 32, offset: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1465, file: !4, line: 3889, baseType: !963, size: 32, align: 32, offset: 96)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1465, file: !4, line: 3890, baseType: !963, size: 32, align: 32, offset: 128)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1465, file: !4, line: 3897, baseType: !1473, size: 768, align: 64, offset: 192)
!1473 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1474)
!1474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1475)
!1475 = !{!1476, !1477}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1474, file: !4, line: 3855, baseType: !1202, size: 512, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1474, file: !4, line: 3857, baseType: !1206, size: 256, align: 32, offset: 512)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1465, file: !4, line: 3903, baseType: !1479, size: 256, align: 64, offset: 960)
!1479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !983, size: 256, align: 64, elements: !1480)
!1480 = !{!1481}
!1481 = !DISubrange(count: 4)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1465, file: !4, line: 3904, baseType: !1483, size: 128, align: 32, offset: 1216)
!1483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 128, align: 32, elements: !1480)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1465, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1465, file: !4, line: 3908, baseType: !974, size: 64, align: 64, offset: 1408)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1465, file: !4, line: 3915, baseType: !974, size: 64, align: 64, offset: 1472)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1465, file: !4, line: 3917, baseType: !963, size: 32, align: 32, offset: 1536)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1453, file: !4, line: 3926, baseType: !959, size: 64, align: 64, offset: 192)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1391, file: !4, line: 3564, baseType: !1490, size: 64, align: 64, offset: 1344)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{!963, !1381, !1138, !1493, !975}
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1198)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1391, file: !4, line: 3566, baseType: !1496, size: 64, align: 64, offset: 1408)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{!963, !1381, !962, !975, !1138}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1391, file: !4, line: 3567, baseType: !1428, size: 64, align: 64, offset: 1472)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1391, file: !4, line: 3576, baseType: !1501, size: 64, align: 64, offset: 1536)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{!963, !1381, !1493}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1391, file: !4, line: 3577, baseType: !1505, size: 64, align: 64, offset: 1600)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DISubroutineType(types: !1507)
!1507 = !{!963, !1381, !1138}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1391, file: !4, line: 3584, baseType: !1509, size: 64, align: 64, offset: 1664)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DISubroutineType(types: !1511)
!1511 = !{!963, !1381, !1197}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1391, file: !4, line: 3589, baseType: !1513, size: 64, align: 64, offset: 1728)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{null, !1381}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1391, file: !4, line: 3594, baseType: !963, size: 32, align: 32, offset: 1792)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1391, file: !4, line: 3600, baseType: !970, size: 64, align: 64, offset: 1856)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1391, file: !4, line: 3609, baseType: !1519, size: 64, align: 64, offset: 1920)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1522)
!1522 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1383, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1383, file: !4, line: 1581, baseType: !964, size: 32, align: 32, offset: 224)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1383, file: !4, line: 1583, baseType: !962, size: 64, align: 64, offset: 256)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1383, file: !4, line: 1591, baseType: !1527, size: 64, align: 64, offset: 320)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1383, file: !4, line: 1598, baseType: !962, size: 64, align: 64, offset: 384)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1383, file: !4, line: 1606, baseType: !959, size: 64, align: 64, offset: 448)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1383, file: !4, line: 1614, baseType: !963, size: 32, align: 32, offset: 512)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1383, file: !4, line: 1622, baseType: !963, size: 32, align: 32, offset: 544)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1383, file: !4, line: 1628, baseType: !963, size: 32, align: 32, offset: 576)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1383, file: !4, line: 1636, baseType: !963, size: 32, align: 32, offset: 608)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1383, file: !4, line: 1643, baseType: !963, size: 32, align: 32, offset: 640)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1383, file: !4, line: 1657, baseType: !983, size: 64, align: 64, offset: 704)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1383, file: !4, line: 1658, baseType: !963, size: 32, align: 32, offset: 768)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1383, file: !4, line: 1679, baseType: !1039, size: 64, align: 32, offset: 800)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1383, file: !4, line: 1688, baseType: !963, size: 32, align: 32, offset: 864)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1383, file: !4, line: 1712, baseType: !963, size: 32, align: 32, offset: 896)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1383, file: !4, line: 1729, baseType: !963, size: 32, align: 32, offset: 928)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1383, file: !4, line: 1729, baseType: !963, size: 32, align: 32, offset: 960)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1383, file: !4, line: 1744, baseType: !963, size: 32, align: 32, offset: 992)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1383, file: !4, line: 1744, baseType: !963, size: 32, align: 32, offset: 1024)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1383, file: !4, line: 1751, baseType: !963, size: 32, align: 32, offset: 1056)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1383, file: !4, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1383, file: !4, line: 1791, baseType: !1548, size: 64, align: 64, offset: 1152)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DISubroutineType(types: !1550)
!1550 = !{null, !1551, !1493, !975, !963, !963, !963}
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1383, file: !4, line: 1808, baseType: !1553, size: 64, align: 64, offset: 1216)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DISubroutineType(types: !1555)
!1555 = !{!667, !1551, !1402}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1383, file: !4, line: 1816, baseType: !963, size: 32, align: 32, offset: 1280)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1383, file: !4, line: 1825, baseType: !1558, size: 32, align: 32, offset: 1312)
!1558 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1383, file: !4, line: 1830, baseType: !963, size: 32, align: 32, offset: 1344)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1383, file: !4, line: 1838, baseType: !1558, size: 32, align: 32, offset: 1376)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1383, file: !4, line: 1846, baseType: !963, size: 32, align: 32, offset: 1408)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1383, file: !4, line: 1851, baseType: !963, size: 32, align: 32, offset: 1440)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1383, file: !4, line: 1861, baseType: !1558, size: 32, align: 32, offset: 1472)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1383, file: !4, line: 1868, baseType: !1558, size: 32, align: 32, offset: 1504)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1383, file: !4, line: 1875, baseType: !1558, size: 32, align: 32, offset: 1536)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1383, file: !4, line: 1882, baseType: !1558, size: 32, align: 32, offset: 1568)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1383, file: !4, line: 1889, baseType: !1558, size: 32, align: 32, offset: 1600)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1383, file: !4, line: 1896, baseType: !1558, size: 32, align: 32, offset: 1632)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1383, file: !4, line: 1903, baseType: !1558, size: 32, align: 32, offset: 1664)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1383, file: !4, line: 1910, baseType: !963, size: 32, align: 32, offset: 1696)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1383, file: !4, line: 1915, baseType: !963, size: 32, align: 32, offset: 1728)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1383, file: !4, line: 1926, baseType: !975, size: 64, align: 64, offset: 1792)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1383, file: !4, line: 1935, baseType: !1039, size: 64, align: 32, offset: 1856)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1383, file: !4, line: 1942, baseType: !963, size: 32, align: 32, offset: 1920)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1383, file: !4, line: 1948, baseType: !963, size: 32, align: 32, offset: 1952)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1383, file: !4, line: 1954, baseType: !963, size: 32, align: 32, offset: 1984)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1383, file: !4, line: 1960, baseType: !963, size: 32, align: 32, offset: 2016)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1383, file: !4, line: 1984, baseType: !963, size: 32, align: 32, offset: 2048)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1383, file: !4, line: 1991, baseType: !963, size: 32, align: 32, offset: 2080)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1383, file: !4, line: 1996, baseType: !963, size: 32, align: 32, offset: 2112)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1383, file: !4, line: 2004, baseType: !963, size: 32, align: 32, offset: 2144)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1383, file: !4, line: 2011, baseType: !963, size: 32, align: 32, offset: 2176)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1383, file: !4, line: 2018, baseType: !963, size: 32, align: 32, offset: 2208)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1383, file: !4, line: 2027, baseType: !963, size: 32, align: 32, offset: 2240)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1383, file: !4, line: 2034, baseType: !963, size: 32, align: 32, offset: 2272)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1383, file: !4, line: 2044, baseType: !963, size: 32, align: 32, offset: 2304)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1383, file: !4, line: 2054, baseType: !1588, size: 64, align: 64, offset: 2368)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1383, file: !4, line: 2061, baseType: !1588, size: 64, align: 64, offset: 2432)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1383, file: !4, line: 2066, baseType: !963, size: 32, align: 32, offset: 2496)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1383, file: !4, line: 2070, baseType: !963, size: 32, align: 32, offset: 2528)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1383, file: !4, line: 2078, baseType: !963, size: 32, align: 32, offset: 2560)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1383, file: !4, line: 2085, baseType: !963, size: 32, align: 32, offset: 2592)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1383, file: !4, line: 2092, baseType: !963, size: 32, align: 32, offset: 2624)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1383, file: !4, line: 2099, baseType: !963, size: 32, align: 32, offset: 2656)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1383, file: !4, line: 2106, baseType: !963, size: 32, align: 32, offset: 2688)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1383, file: !4, line: 2113, baseType: !963, size: 32, align: 32, offset: 2720)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1383, file: !4, line: 2120, baseType: !963, size: 32, align: 32, offset: 2752)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1383, file: !4, line: 2125, baseType: !963, size: 32, align: 32, offset: 2784)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1383, file: !4, line: 2133, baseType: !963, size: 32, align: 32, offset: 2816)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1383, file: !4, line: 2140, baseType: !963, size: 32, align: 32, offset: 2848)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1383, file: !4, line: 2145, baseType: !963, size: 32, align: 32, offset: 2880)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1383, file: !4, line: 2153, baseType: !963, size: 32, align: 32, offset: 2912)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1383, file: !4, line: 2158, baseType: !963, size: 32, align: 32, offset: 2944)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1383, file: !4, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1383, file: !4, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1383, file: !4, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1383, file: !4, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1383, file: !4, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1383, file: !4, line: 2203, baseType: !963, size: 32, align: 32, offset: 3136)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1383, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1383, file: !4, line: 2212, baseType: !963, size: 32, align: 32, offset: 3200)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1383, file: !4, line: 2213, baseType: !963, size: 32, align: 32, offset: 3232)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1383, file: !4, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1383, file: !4, line: 2232, baseType: !963, size: 32, align: 32, offset: 3296)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1383, file: !4, line: 2243, baseType: !963, size: 32, align: 32, offset: 3328)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1383, file: !4, line: 2249, baseType: !963, size: 32, align: 32, offset: 3360)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1383, file: !4, line: 2256, baseType: !963, size: 32, align: 32, offset: 3392)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1383, file: !4, line: 2263, baseType: !991, size: 64, align: 64, offset: 3456)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1383, file: !4, line: 2270, baseType: !991, size: 64, align: 64, offset: 3520)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1383, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1383, file: !4, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1383, file: !4, line: 2367, baseType: !1624, size: 64, align: 64, offset: 3648)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DISubroutineType(types: !1626)
!1626 = !{!963, !1551, !1197, !963}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1383, file: !4, line: 2383, baseType: !963, size: 32, align: 32, offset: 3712)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1383, file: !4, line: 2386, baseType: !1558, size: 32, align: 32, offset: 3744)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1383, file: !4, line: 2387, baseType: !1558, size: 32, align: 32, offset: 3776)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1383, file: !4, line: 2394, baseType: !963, size: 32, align: 32, offset: 3808)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1383, file: !4, line: 2401, baseType: !963, size: 32, align: 32, offset: 3840)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1383, file: !4, line: 2408, baseType: !963, size: 32, align: 32, offset: 3872)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1383, file: !4, line: 2415, baseType: !963, size: 32, align: 32, offset: 3904)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1383, file: !4, line: 2422, baseType: !963, size: 32, align: 32, offset: 3936)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1383, file: !4, line: 2423, baseType: !1636, size: 64, align: 64, offset: 3968)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1638)
!1638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1639)
!1639 = !{!1640, !1641, !1642, !1643}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1638, file: !4, line: 827, baseType: !963, size: 32, align: 32)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1638, file: !4, line: 828, baseType: !963, size: 32, align: 32, offset: 32)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1638, file: !4, line: 829, baseType: !963, size: 32, align: 32, offset: 64)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1638, file: !4, line: 830, baseType: !1558, size: 32, align: 32, offset: 96)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1383, file: !4, line: 2430, baseType: !959, size: 64, align: 64, offset: 4032)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1383, file: !4, line: 2437, baseType: !959, size: 64, align: 64, offset: 4096)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1383, file: !4, line: 2444, baseType: !1558, size: 32, align: 32, offset: 4160)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1383, file: !4, line: 2451, baseType: !1558, size: 32, align: 32, offset: 4192)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1383, file: !4, line: 2458, baseType: !963, size: 32, align: 32, offset: 4224)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1383, file: !4, line: 2469, baseType: !963, size: 32, align: 32, offset: 4256)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1383, file: !4, line: 2475, baseType: !963, size: 32, align: 32, offset: 4288)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1383, file: !4, line: 2481, baseType: !963, size: 32, align: 32, offset: 4320)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1383, file: !4, line: 2485, baseType: !963, size: 32, align: 32, offset: 4352)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1383, file: !4, line: 2489, baseType: !963, size: 32, align: 32, offset: 4384)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1383, file: !4, line: 2493, baseType: !963, size: 32, align: 32, offset: 4416)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1383, file: !4, line: 2501, baseType: !963, size: 32, align: 32, offset: 4448)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1383, file: !4, line: 2506, baseType: !963, size: 32, align: 32, offset: 4480)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1383, file: !4, line: 2510, baseType: !963, size: 32, align: 32, offset: 4512)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1383, file: !4, line: 2514, baseType: !959, size: 64, align: 64, offset: 4544)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1383, file: !4, line: 2528, baseType: !1660, size: 64, align: 64, offset: 4608)
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64, align: 64)
!1661 = !DISubroutineType(types: !1662)
!1662 = !{null, !1551, !962, !963, !963}
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1383, file: !4, line: 2534, baseType: !963, size: 32, align: 32, offset: 4672)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1383, file: !4, line: 2545, baseType: !963, size: 32, align: 32, offset: 4704)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1383, file: !4, line: 2547, baseType: !963, size: 32, align: 32, offset: 4736)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1383, file: !4, line: 2549, baseType: !963, size: 32, align: 32, offset: 4768)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1383, file: !4, line: 2551, baseType: !963, size: 32, align: 32, offset: 4800)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1383, file: !4, line: 2553, baseType: !963, size: 32, align: 32, offset: 4832)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1383, file: !4, line: 2555, baseType: !963, size: 32, align: 32, offset: 4864)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1383, file: !4, line: 2557, baseType: !963, size: 32, align: 32, offset: 4896)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1383, file: !4, line: 2559, baseType: !963, size: 32, align: 32, offset: 4928)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1383, file: !4, line: 2563, baseType: !963, size: 32, align: 32, offset: 4960)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1383, file: !4, line: 2571, baseType: !974, size: 64, align: 64, offset: 4992)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1383, file: !4, line: 2579, baseType: !974, size: 64, align: 64, offset: 5056)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1383, file: !4, line: 2586, baseType: !963, size: 32, align: 32, offset: 5120)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1383, file: !4, line: 2615, baseType: !963, size: 32, align: 32, offset: 5152)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1383, file: !4, line: 2627, baseType: !963, size: 32, align: 32, offset: 5184)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1383, file: !4, line: 2637, baseType: !963, size: 32, align: 32, offset: 5216)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1383, file: !4, line: 2681, baseType: !963, size: 32, align: 32, offset: 5248)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1383, file: !4, line: 2709, baseType: !959, size: 64, align: 64, offset: 5312)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1383, file: !4, line: 2716, baseType: !1682, size: 64, align: 64, offset: 5376)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64, align: 64)
!1683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1684)
!1684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1685)
!1685 = !{!1686, !1687, !1688, !1689, !1690, !1691, !1692, !1696, !1700, !1701, !1702, !1703, !1709, !1710, !1711, !1712, !1713}
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1684, file: !4, line: 3642, baseType: !970, size: 64, align: 64)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1684, file: !4, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1684, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1684, file: !4, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1684, file: !4, line: 3669, baseType: !963, size: 32, align: 32, offset: 160)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1684, file: !4, line: 3682, baseType: !1509, size: 64, align: 64, offset: 192)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1684, file: !4, line: 3698, baseType: !1693, size: 64, align: 64, offset: 256)
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DISubroutineType(types: !1695)
!1695 = !{!963, !1381, !1335, !981}
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1684, file: !4, line: 3712, baseType: !1697, size: 64, align: 64, offset: 320)
!1697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64, align: 64)
!1698 = !DISubroutineType(types: !1699)
!1699 = !{!963, !1381, !963, !1335, !981}
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1684, file: !4, line: 3726, baseType: !1693, size: 64, align: 64, offset: 384)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1684, file: !4, line: 3737, baseType: !1428, size: 64, align: 64, offset: 448)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1684, file: !4, line: 3746, baseType: !963, size: 32, align: 32, offset: 512)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1684, file: !4, line: 3757, baseType: !1704, size: 64, align: 64, offset: 576)
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1705, size: 64, align: 64)
!1705 = !DISubroutineType(types: !1706)
!1706 = !{null, !1707}
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64, align: 64)
!1708 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1684, file: !4, line: 3766, baseType: !1428, size: 64, align: 64, offset: 640)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1684, file: !4, line: 3774, baseType: !1428, size: 64, align: 64, offset: 704)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1684, file: !4, line: 3780, baseType: !963, size: 32, align: 32, offset: 768)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1684, file: !4, line: 3785, baseType: !963, size: 32, align: 32, offset: 800)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1684, file: !4, line: 3795, baseType: !1714, size: 64, align: 64, offset: 832)
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1715, size: 64, align: 64)
!1715 = !DISubroutineType(types: !1716)
!1716 = !{!963, !1381, !1143}
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1383, file: !4, line: 2728, baseType: !962, size: 64, align: 64, offset: 5440)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1383, file: !4, line: 2735, baseType: !1223, size: 512, align: 64, offset: 5504)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1383, file: !4, line: 2742, baseType: !963, size: 32, align: 32, offset: 6016)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1383, file: !4, line: 2755, baseType: !963, size: 32, align: 32, offset: 6048)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1383, file: !4, line: 2776, baseType: !963, size: 32, align: 32, offset: 6080)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1383, file: !4, line: 2783, baseType: !963, size: 32, align: 32, offset: 6112)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1383, file: !4, line: 2791, baseType: !963, size: 32, align: 32, offset: 6144)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1383, file: !4, line: 2802, baseType: !1197, size: 64, align: 64, offset: 6208)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1383, file: !4, line: 2811, baseType: !963, size: 32, align: 32, offset: 6272)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1383, file: !4, line: 2821, baseType: !963, size: 32, align: 32, offset: 6304)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1383, file: !4, line: 2830, baseType: !963, size: 32, align: 32, offset: 6336)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1383, file: !4, line: 2840, baseType: !963, size: 32, align: 32, offset: 6368)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1383, file: !4, line: 2851, baseType: !1730, size: 64, align: 64, offset: 6400)
!1730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1731, size: 64, align: 64)
!1731 = !DISubroutineType(types: !1732)
!1732 = !{!963, !1551, !1733, !962, !975, !963, !963}
!1733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1734, size: 64, align: 64)
!1734 = !DISubroutineType(types: !1735)
!1735 = !{!963, !1551, !962}
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1383, file: !4, line: 2871, baseType: !1737, size: 64, align: 64, offset: 6464)
!1737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1738, size: 64, align: 64)
!1738 = !DISubroutineType(types: !1739)
!1739 = !{!963, !1551, !1740, !962, !975, !963}
!1740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1741, size: 64, align: 64)
!1741 = !DISubroutineType(types: !1742)
!1742 = !{!963, !1551, !962, !963, !963}
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1383, file: !4, line: 2878, baseType: !963, size: 32, align: 32, offset: 6528)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1383, file: !4, line: 2885, baseType: !963, size: 32, align: 32, offset: 6560)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1383, file: !4, line: 3005, baseType: !963, size: 32, align: 32, offset: 6592)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1383, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1383, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1383, file: !4, line: 3027, baseType: !909, size: 32, align: 32, offset: 6688)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1383, file: !4, line: 3037, baseType: !983, size: 64, align: 64, offset: 6720)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1383, file: !4, line: 3038, baseType: !963, size: 32, align: 32, offset: 6784)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1383, file: !4, line: 3050, baseType: !991, size: 64, align: 64, offset: 6848)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1383, file: !4, line: 3065, baseType: !963, size: 32, align: 32, offset: 6912)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1383, file: !4, line: 3083, baseType: !963, size: 32, align: 32, offset: 6944)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1383, file: !4, line: 3092, baseType: !1039, size: 64, align: 32, offset: 6976)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1383, file: !4, line: 3099, baseType: !667, size: 32, align: 32, offset: 7040)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1383, file: !4, line: 3106, baseType: !1039, size: 64, align: 32, offset: 7072)
