; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--srtp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--srtp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SRTPContext = type { %struct.AVAES*, %struct.AVHMAC*, i32, i32, [16 x i8], [14 x i8], [16 x i8], [16 x i8], [14 x i8], [14 x i8], [20 x i8], [20 x i8], i32, i32, i32, i32 }
%struct.AVAES = type opaque
%struct.AVHMAC = type opaque
%union.unaligned_16 = type { i16 }
%union.unaligned_32 = type { i32 }
%union.unaligned_64 = type { i64 }

@.str = private unnamed_addr constant [24 x i8] c"AES_CM_128_HMAC_SHA1_80\00", align 1
@.str.1 = private unnamed_addr constant [28 x i8] c"SRTP_AES128_CM_HMAC_SHA1_80\00", align 1
@.str.2 = private unnamed_addr constant [24 x i8] c"AES_CM_128_HMAC_SHA1_32\00", align 1
@.str.3 = private unnamed_addr constant [28 x i8] c"SRTP_AES128_CM_HMAC_SHA1_32\00", align 1
@.str.4 = private unnamed_addr constant [36 x i8] c"SRTP Crypto suite %s not supported\0A\00", align 1
@.str.5 = private unnamed_addr constant [33 x i8] c"Incorrect amount of SRTP params\0A\00", align 1
@.str.6 = private unnamed_addr constant [15 x i8] c"HMAC mismatch\0A\00", align 1

; Function Attrs: nounwind uwtable
define void @ff_srtp_free(%struct.SRTPContext* %s) #0 !dbg !60 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !30)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--srtp.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!2 = !{!3, !12}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVHMACType", file: !4, line: 33, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/hmac.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!5 = !{!6, !7, !8, !9, !10, !11}
!6 = !DIEnumerator(name: "AV_HMAC_MD5", value: 0)
!7 = !DIEnumerator(name: "AV_HMAC_SHA1", value: 1)
!8 = !DIEnumerator(name: "AV_HMAC_SHA224", value: 2)
!9 = !DIEnumerator(name: "AV_HMAC_SHA256", value: 3)
!10 = !DIEnumerator(name: "AV_HMAC_SHA384", value: 4)
!11 = !DIEnumerator(name: "AV_HMAC_SHA512", value: 5)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RTCPType", file: !13, line: 92, size: 32, align: 32, elements: !14)
!13 = !DIFile(filename: "libavformat/rtp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29}
!15 = !DIEnumerator(name: "RTCP_FIR", value: 192)
!16 = !DIEnumerator(name: "RTCP_NACK", value: 193)
!17 = !DIEnumerator(name: "RTCP_SMPTETC", value: 194)
!18 = !DIEnumerator(name: "RTCP_IJ", value: 195)
!19 = !DIEnumerator(name: "RTCP_SR", value: 200)
!20 = !DIEnumerator(name: "RTCP_RR", value: 201)
!21 = !DIEnumerator(name: "RTCP_SDES", value: 202)
!22 = !DIEnumerator(name: "RTCP_BYE", value: 203)
!23 = !DIEnumerator(name: "RTCP_APP", value: 204)
!24 = !DIEnumerator(name: "RTCP_RTPFB", value: 205)
!25 = !DIEnumerator(name: "RTCP_PSFB", value: 206)
!26 = !DIEnumerator(name: "RTCP_XR", value: 207)
!27 = !DIEnumerator(name: "RTCP_AVB", value: 208)
!28 = !DIEnumerator(name: "RTCP_RSI", value: 209)
!29 = !DIEnumerator(name: "RTCP_TOKEN", value: 210)
!30 = !{!31, !32, !33, !34, !43, !45, !50, !52, !56}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!32 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!33 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !37, line: 222, size: 16, align: 8, elements: !38)
!37 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !36, file: !37, line: 222, baseType: !40, size: 16, align: 16)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !41, line: 49, baseType: !42)
!41 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!42 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !41, line: 55, baseType: !44)
!44 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !37, line: 221, size: 32, align: 8, elements: !47)
!47 = !{!48}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !46, file: !37, line: 221, baseType: !49, size: 32, align: 32)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !41, line: 51, baseType: !33)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !37, line: 220, size: 64, align: 8, elements: !54)
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !53, file: !37, line: 220, baseType: !43, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!57 = !{i32 2, !"Dwarf Version", i32 4}
!58 = !{i32 2, !"Debug Info Version", i32 3}
!59 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!60 = distinct !DISubprogram(name: "ff_srtp_free", scope: !61, file: !61, line: 31, type: !62, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !100)
!61 = !DIFile(filename: "libavformat/srtp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!62 = !DISubroutineType(types: !63)
!63 = !{null, !64}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SRTPContext", file: !66, line: 30, size: 1408, align: 64, elements: !67)
!66 = !DIFile(filename: "libavformat/srtp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!67 = !{!68, !72, !75, !76, !77, !83, !87, !88, !89, !90, !91, !95, !96, !97, !98, !99}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "aes", scope: !65, file: !66, line: 31, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVAES", file: !71, line: 37, flags: DIFlagFwdDecl)
!71 = !DIFile(filename: "./libavutil/aes.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!72 = !DIDerivedType(tag: DW_TAG_member, name: "hmac", scope: !65, file: !66, line: 32, baseType: !73, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVHMAC", file: !4, line: 42, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_hmac_size", scope: !65, file: !66, line: 33, baseType: !32, size: 32, align: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "rtcp_hmac_size", scope: !65, file: !66, line: 33, baseType: !32, size: 32, align: 32, offset: 160)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "master_key", scope: !65, file: !66, line: 34, baseType: !78, size: 128, align: 8, offset: 192)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 128, align: 8, elements: !81)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !41, line: 48, baseType: !80)
!80 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!81 = !{!82}
!82 = !DISubrange(count: 16)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "master_salt", scope: !65, file: !66, line: 35, baseType: !84, size: 112, align: 8, offset: 320)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 112, align: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 14)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_key", scope: !65, file: !66, line: 36, baseType: !78, size: 128, align: 8, offset: 432)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "rtcp_key", scope: !65, file: !66, line: 36, baseType: !78, size: 128, align: 8, offset: 560)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_salt", scope: !65, file: !66, line: 37, baseType: !84, size: 112, align: 8, offset: 688)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "rtcp_salt", scope: !65, file: !66, line: 37, baseType: !84, size: 112, align: 8, offset: 800)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_auth", scope: !65, file: !66, line: 38, baseType: !92, size: 160, align: 8, offset: 912)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 160, align: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 20)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "rtcp_auth", scope: !65, file: !66, line: 38, baseType: !92, size: 160, align: 8, offset: 1072)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "seq_largest", scope: !65, file: !66, line: 39, baseType: !32, size: 32, align: 32, offset: 1248)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "seq_initialized", scope: !65, file: !66, line: 39, baseType: !32, size: 32, align: 32, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "roc", scope: !65, file: !66, line: 40, baseType: !49, size: 32, align: 32, offset: 1312)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "rtcp_index", scope: !65, file: !66, line: 42, baseType: !49, size: 32, align: 32, offset: 1344)
!100 = !{}
!101 = !DILocalVariable(name: "s", arg: 1, scope: !60, file: !61, line: 31, type: !64)
!102 = !DIExpression()
!103 = !DILocation(line: 31, column: 39, scope: !60)
!104 = !DILocation(line: 33, column: 10, scope: !105)
!105 = distinct !DILexicalBlock(scope: !60, file: !61, line: 33, column: 9)
!106 = !DILocation(line: 33, column: 9, scope: !60)
!107 = !DILocation(line: 34, column: 9, scope: !105)
!108 = !DILocation(line: 35, column: 15, scope: !60)
!109 = !DILocation(line: 35, column: 18, scope: !60)
!110 = !DILocation(line: 35, column: 14, scope: !60)
!111 = !DILocation(line: 35, column: 5, scope: !60)
!112 = !DILocation(line: 36, column: 9, scope: !113)
!113 = distinct !DILexicalBlock(scope: !60, file: !61, line: 36, column: 9)
!114 = !DILocation(line: 36, column: 12, scope: !113)
!115 = !DILocation(line: 36, column: 9, scope: !60)
!116 = !DILocation(line: 37, column: 22, scope: !113)
!117 = !DILocation(line: 37, column: 25, scope: !113)
!118 = !DILocation(line: 37, column: 9, scope: !113)
!119 = !DILocation(line: 38, column: 5, scope: !60)
!120 = !DILocation(line: 38, column: 8, scope: !60)
!121 = !DILocation(line: 38, column: 13, scope: !60)
!122 = !DILocation(line: 39, column: 1, scope: !60)
!123 = !DILocation(line: 39, column: 1, scope: !124)
!124 = !DILexicalBlockFile(scope: !60, file: !61, discriminator: 1)
!125 = distinct !DISubprogram(name: "ff_srtp_set_crypto", scope: !61, file: !61, line: 65, type: !126, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !100)
!126 = !DISubroutineType(types: !127)
!127 = !{!32, !64, !128, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!131 = !DILocalVariable(name: "s", arg: 1, scope: !125, file: !61, line: 65, type: !64)
!132 = !DILocation(line: 65, column: 44, scope: !125)
!133 = !DILocalVariable(name: "suite", arg: 2, scope: !125, file: !61, line: 65, type: !128)
!134 = !DILocation(line: 65, column: 59, scope: !125)
!135 = !DILocalVariable(name: "params", arg: 3, scope: !125, file: !61, line: 66, type: !128)
!136 = !DILocation(line: 66, column: 36, scope: !125)
!137 = !DILocalVariable(name: "buf", scope: !125, file: !61, line: 68, type: !138)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 240, align: 8, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 30)
!141 = !DILocation(line: 68, column: 13, scope: !125)
!142 = !DILocation(line: 70, column: 18, scope: !125)
!143 = !DILocation(line: 70, column: 5, scope: !125)
!144 = !DILocation(line: 73, column: 17, scope: !145)
!145 = distinct !DILexicalBlock(scope: !125, file: !61, line: 73, column: 9)
!146 = !DILocation(line: 73, column: 10, scope: !145)
!147 = !DILocation(line: 73, column: 51, scope: !145)
!148 = !DILocation(line: 74, column: 17, scope: !145)
!149 = !DILocation(line: 74, column: 10, scope: !145)
!150 = !DILocation(line: 73, column: 9, scope: !151)
!151 = !DILexicalBlockFile(scope: !125, file: !61, discriminator: 1)
!152 = !DILocation(line: 75, column: 28, scope: !153)
!153 = distinct !DILexicalBlock(scope: !145, file: !61, line: 74, column: 56)
!154 = !DILocation(line: 75, column: 31, scope: !153)
!155 = !DILocation(line: 75, column: 46, scope: !153)
!156 = !DILocation(line: 75, column: 9, scope: !153)
!157 = !DILocation(line: 75, column: 12, scope: !153)
!158 = !DILocation(line: 75, column: 26, scope: !153)
!159 = !DILocation(line: 76, column: 5, scope: !153)
!160 = !DILocation(line: 76, column: 24, scope: !161)
!161 = !DILexicalBlockFile(scope: !162, file: !61, discriminator: 1)
!162 = distinct !DILexicalBlock(scope: !145, file: !61, line: 76, column: 16)
!163 = !DILocation(line: 76, column: 17, scope: !161)
