; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--fifo.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--fifo.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FifoMessageType", file: !939, line: 104, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "libavformat/fifo.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!940 = !{!941, !942, !943}
!941 = !DIEnumerator(name: "FIFO_WRITE_HEADER", value: 0)
!942 = !DIEnumerator(name: "FIFO_WRITE_PACKET", value: 1)
!943 = !DIEnumerator(name: "FIFO_FLUSH_OUTPUT", value: 2)
!944 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVThreadMessageFlags", file: !945, line: 24, size: 32, align: 32, elements: !946)
!945 = !DIFile(filename: "./libavutil/threadmessage.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!946 = !{!947}
!947 = !DIEnumerator(name: "AV_THREAD_MESSAGE_NONBLOCK", value: 1)
!948 = !{!949, !950, !953, !954}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !951, line: 197, baseType: !952)
!951 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!952 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!953 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!954 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!955 = !{!956, !2200, !2201}
!956 = distinct !DIGlobalVariable(name: "ff_fifo_muxer", scope: !0, file: !939, line: 656, type: !957, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_fifo_muxer)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !959)
!959 = !{!960, !964, !965, !966, !967, !968, !969, !970, !971, !981, !1060, !1062, !1063, !2165, !2166, !2167, !2171, !2175, !2179, !2180, !2185, !2186, !2187, !2188, !2189, !2190, !2194}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !958, file: !919, line: 498, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !958, file: !919, line: 504, baseType: !961, size: 64, align: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !958, file: !919, line: 505, baseType: !961, size: 64, align: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !958, file: !919, line: 506, baseType: !961, size: 64, align: 64, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !958, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !958, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !958, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !958, file: !919, line: 517, baseType: !953, size: 32, align: 32, offset: 352)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !958, file: !919, line: 523, baseType: !972, size: 64, align: 64, offset: 384)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !977, line: 44, size: 64, align: 32, elements: !978)
!977 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !976, file: !977, line: 45, baseType: !3, size: 32, align: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !976, file: !977, line: 46, baseType: !954, size: 32, align: 32, offset: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !958, file: !919, line: 526, baseType: !982, size: 64, align: 64, offset: 448)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !986)
!986 = !{!987, !988, !992, !1019, !1020, !1021, !1022, !1026, !1032, !1034, !1038}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !985, file: !486, line: 72, baseType: !961, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !985, file: !486, line: 78, baseType: !989, size: 64, align: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!961, !949}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !985, file: !486, line: 85, baseType: !993, size: 64, align: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !996)
!996 = !{!997, !998, !999, !1000, !1001, !1015, !1016, !1017, !1018}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !995, file: !464, line: 247, baseType: !961, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !995, file: !464, line: 253, baseType: !961, size: 64, align: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !995, file: !464, line: 259, baseType: !953, size: 32, align: 32, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !995, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !995, file: !464, line: 271, baseType: !1002, size: 64, align: 64, offset: 192)
!1002 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !995, file: !464, line: 265, size: 64, align: 64, elements: !1003)
!1003 = !{!1004, !1005, !1007, !1008}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1002, file: !464, line: 266, baseType: !950, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1002, file: !464, line: 267, baseType: !1006, size: 64, align: 64)
!1006 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1002, file: !464, line: 268, baseType: !961, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1002, file: !464, line: 270, baseType: !1009, size: 64, align: 32)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1010, line: 61, baseType: !1011)
!1010 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1010, line: 58, size: 64, align: 32, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1011, file: !1010, line: 59, baseType: !953, size: 32, align: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1011, file: !1010, line: 60, baseType: !953, size: 32, align: 32, offset: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !995, file: !464, line: 272, baseType: !1006, size: 64, align: 64, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !995, file: !464, line: 273, baseType: !1006, size: 64, align: 64, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !995, file: !464, line: 275, baseType: !953, size: 32, align: 32, offset: 384)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !995, file: !464, line: 300, baseType: !961, size: 64, align: 64, offset: 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !985, file: !486, line: 93, baseType: !953, size: 32, align: 32, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !985, file: !486, line: 99, baseType: !953, size: 32, align: 32, offset: 224)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !985, file: !486, line: 108, baseType: !953, size: 32, align: 32, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !985, file: !486, line: 113, baseType: !1023, size: 64, align: 64, offset: 320)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!949, !949, !949}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !985, file: !486, line: 123, baseType: !1027, size: 64, align: 64, offset: 384)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!1030, !1030}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !985, file: !486, line: 130, baseType: !1033, size: 32, align: 32, offset: 448)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !985, file: !486, line: 136, baseType: !1035, size: 64, align: 64, offset: 512)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!1033, !949}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !985, file: !486, line: 142, baseType: !1039, size: 64, align: 64, offset: 576)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!953, !1042, !949, !961, !953}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1045)
!1045 = !{!1046, !1058, !1059}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1044, file: !464, line: 360, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1051)
!1051 = !{!1052, !1053, !1054, !1055, !1056, !1057}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1050, file: !464, line: 307, baseType: !961, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1050, file: !464, line: 313, baseType: !1006, size: 64, align: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1050, file: !464, line: 313, baseType: !1006, size: 64, align: 64, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1050, file: !464, line: 318, baseType: !1006, size: 64, align: 64, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1050, file: !464, line: 318, baseType: !1006, size: 64, align: 64, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1050, file: !464, line: 323, baseType: !953, size: 32, align: 32, offset: 320)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1044, file: !464, line: 364, baseType: !953, size: 32, align: 32, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1044, file: !464, line: 368, baseType: !953, size: 32, align: 32, offset: 96)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !958, file: !919, line: 535, baseType: !1061, size: 64, align: 64, offset: 512)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !958, file: !919, line: 539, baseType: !953, size: 32, align: 32, offset: 576)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !958, file: !919, line: 541, baseType: !1064, size: 64, align: 64, offset: 640)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!953, !1067}
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1069)
!1069 = !{!1070, !1071, !1170, !1171, !1172, !1238, !1239, !1240, !2019, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2073, !2074, !2075, !2076, !2077, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2128, !2129, !2132, !2133, !2134, !2135, !2136, !2137, !2142, !2143, !2144, !2145, !2153, !2154, !2158, !2162, !2163, !2164}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1068, file: !919, line: 1342, baseType: !982, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1068, file: !919, line: 1349, baseType: !1072, size: 64, align: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1099, !1100, !1141, !1142, !1146, !1151, !1152, !1153, !1157, !1163, !1169}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1073, file: !919, line: 638, baseType: !961, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1073, file: !919, line: 645, baseType: !961, size: 64, align: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1073, file: !919, line: 652, baseType: !953, size: 32, align: 32, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1073, file: !919, line: 659, baseType: !961, size: 64, align: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1073, file: !919, line: 661, baseType: !972, size: 64, align: 64, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1073, file: !919, line: 663, baseType: !982, size: 64, align: 64, offset: 320)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1073, file: !919, line: 670, baseType: !961, size: 64, align: 64, offset: 384)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1073, file: !919, line: 679, baseType: !1072, size: 64, align: 64, offset: 448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1073, file: !919, line: 684, baseType: !953, size: 32, align: 32, offset: 512)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1073, file: !919, line: 689, baseType: !953, size: 32, align: 32, offset: 544)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1073, file: !919, line: 696, baseType: !1086, size: 64, align: 64, offset: 576)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!953, !1089}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1092)
!1092 = !{!1093, !1094, !1097, !1098}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1091, file: !919, line: 449, baseType: !961, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1091, file: !919, line: 450, baseType: !1095, size: 64, align: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1091, file: !919, line: 451, baseType: !953, size: 32, align: 32, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1091, file: !919, line: 452, baseType: !961, size: 64, align: 64, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1073, file: !919, line: 703, baseType: !1064, size: 64, align: 64, offset: 640)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1073, file: !919, line: 714, baseType: !1101, size: 64, align: 64, offset: 704)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!953, !1067, !1104}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1107)
!1107 = !{!1108, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1137, !1138, !1139, !1140}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1106, file: !4, line: 1451, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1111, line: 94, baseType: !1112)
!1111 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1111, line: 81, size: 192, align: 64, elements: !1113)
!1113 = !{!1114, !1118, !1122}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1112, file: !1111, line: 82, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1111, line: 73, baseType: !1117)
!1117 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1111, line: 73, flags: DIFlagFwdDecl)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1112, file: !1111, line: 89, baseType: !1119, size: 64, align: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1121, line: 48, baseType: !1096)
!1121 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1112, file: !1111, line: 93, baseType: !953, size: 32, align: 32, offset: 128)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1106, file: !4, line: 1461, baseType: !950, size: 64, align: 64, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1106, file: !4, line: 1467, baseType: !950, size: 64, align: 64, offset: 128)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1106, file: !4, line: 1468, baseType: !1119, size: 64, align: 64, offset: 192)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1106, file: !4, line: 1469, baseType: !953, size: 32, align: 32, offset: 256)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1106, file: !4, line: 1470, baseType: !953, size: 32, align: 32, offset: 288)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1106, file: !4, line: 1474, baseType: !953, size: 32, align: 32, offset: 320)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1106, file: !4, line: 1479, baseType: !1130, size: 64, align: 64, offset: 384)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1132)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1133)
!1133 = !{!1134, !1135, !1136}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1132, file: !4, line: 1412, baseType: !1119, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1132, file: !4, line: 1413, baseType: !953, size: 32, align: 32, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1132, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1106, file: !4, line: 1480, baseType: !953, size: 32, align: 32, offset: 448)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1106, file: !4, line: 1486, baseType: !950, size: 64, align: 64, offset: 512)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1106, file: !4, line: 1488, baseType: !950, size: 64, align: 64, offset: 576)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1106, file: !4, line: 1497, baseType: !950, size: 64, align: 64, offset: 640)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1073, file: !919, line: 720, baseType: !1064, size: 64, align: 64, offset: 768)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1073, file: !919, line: 730, baseType: !1143, size: 64, align: 64, offset: 832)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!953, !1067, !953, !950, !953}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1073, file: !919, line: 737, baseType: !1147, size: 64, align: 64, offset: 896)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!950, !1067, !953, !1150, !950}
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1073, file: !919, line: 744, baseType: !1064, size: 64, align: 64, offset: 960)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1073, file: !919, line: 750, baseType: !1064, size: 64, align: 64, offset: 1024)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1073, file: !919, line: 758, baseType: !1154, size: 64, align: 64, offset: 1088)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!953, !1067, !953, !950, !950, !950, !953}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1073, file: !919, line: 764, baseType: !1158, size: 64, align: 64, offset: 1152)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!953, !1067, !1161}
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1073, file: !919, line: 770, baseType: !1164, size: 64, align: 64, offset: 1216)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!953, !1067, !1167}
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1073, file: !919, line: 776, baseType: !1164, size: 64, align: 64, offset: 1280)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1068, file: !919, line: 1356, baseType: !1061, size: 64, align: 64, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1068, file: !919, line: 1365, baseType: !949, size: 64, align: 64, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1068, file: !919, line: 1379, baseType: !1173, size: 64, align: 64, offset: 256)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1176)
!1176 = !{!1177, !1178, !1179, !1180, !1181, !1182, !1183, !1187, !1188, !1192, !1193, !1194, !1195, !1196, !1198, !1199, !1205, !1206, !1210, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1228, !1229, !1230, !1231, !1235, !1236, !1237}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1175, file: !537, line: 174, baseType: !982, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1175, file: !537, line: 226, baseType: !1095, size: 64, align: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1175, file: !537, line: 227, baseType: !953, size: 32, align: 32, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1175, file: !537, line: 228, baseType: !1095, size: 64, align: 64, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1175, file: !537, line: 229, baseType: !1095, size: 64, align: 64, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1175, file: !537, line: 233, baseType: !949, size: 64, align: 64, offset: 320)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1175, file: !537, line: 235, baseType: !1184, size: 64, align: 64, offset: 384)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!953, !949, !1119, !953}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1175, file: !537, line: 236, baseType: !1184, size: 64, align: 64, offset: 448)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1175, file: !537, line: 237, baseType: !1189, size: 64, align: 64, offset: 512)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!950, !949, !950, !953}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1175, file: !537, line: 238, baseType: !950, size: 64, align: 64, offset: 576)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1175, file: !537, line: 239, baseType: !953, size: 32, align: 32, offset: 640)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1175, file: !537, line: 240, baseType: !953, size: 32, align: 32, offset: 672)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1175, file: !537, line: 241, baseType: !953, size: 32, align: 32, offset: 704)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1175, file: !537, line: 242, baseType: !1197, size: 64, align: 64, offset: 768)
!1197 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1175, file: !537, line: 243, baseType: !1095, size: 64, align: 64, offset: 832)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1175, file: !537, line: 244, baseType: !1200, size: 64, align: 64, offset: 896)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!1197, !1197, !1203, !954}
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1175, file: !537, line: 245, baseType: !953, size: 32, align: 32, offset: 960)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1175, file: !537, line: 249, baseType: !1207, size: 64, align: 64, offset: 1024)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!953, !949, !953}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1175, file: !537, line: 255, baseType: !1211, size: 64, align: 64, offset: 1088)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!950, !949, !953, !950, !953}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1175, file: !537, line: 260, baseType: !953, size: 32, align: 32, offset: 1152)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1175, file: !537, line: 266, baseType: !950, size: 64, align: 64, offset: 1216)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1175, file: !537, line: 273, baseType: !953, size: 32, align: 32, offset: 1280)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1175, file: !537, line: 279, baseType: !950, size: 64, align: 64, offset: 1344)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1175, file: !537, line: 285, baseType: !953, size: 32, align: 32, offset: 1408)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1175, file: !537, line: 291, baseType: !953, size: 32, align: 32, offset: 1440)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1175, file: !537, line: 298, baseType: !953, size: 32, align: 32, offset: 1472)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1175, file: !537, line: 304, baseType: !953, size: 32, align: 32, offset: 1504)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1175, file: !537, line: 309, baseType: !961, size: 64, align: 64, offset: 1536)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1175, file: !537, line: 314, baseType: !961, size: 64, align: 64, offset: 1600)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1175, file: !537, line: 319, baseType: !1225, size: 64, align: 64, offset: 1664)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!953, !949, !1119, !953, !536, !950}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1175, file: !537, line: 326, baseType: !953, size: 32, align: 32, offset: 1728)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1175, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1175, file: !537, line: 332, baseType: !950, size: 64, align: 64, offset: 1792)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1175, file: !537, line: 338, baseType: !1232, size: 64, align: 64, offset: 1856)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!953, !949}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1175, file: !537, line: 340, baseType: !950, size: 64, align: 64, offset: 1920)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1175, file: !537, line: 346, baseType: !1095, size: 64, align: 64, offset: 1984)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1175, file: !537, line: 351, baseType: !953, size: 32, align: 32, offset: 2048)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1068, file: !919, line: 1386, baseType: !953, size: 32, align: 32, offset: 320)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1068, file: !919, line: 1393, baseType: !954, size: 32, align: 32, offset: 352)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1068, file: !919, line: 1405, baseType: !1241, size: 64, align: 64, offset: 384)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1244)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1245)
!1245 = !{!1246, !1247, !1248, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1805, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1905, !1911, !1912, !1916, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1948, !1949, !1950, !1951, !1952, !1953}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1244, file: !919, line: 866, baseType: !953, size: 32, align: 32)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1244, file: !919, line: 872, baseType: !953, size: 32, align: 32, offset: 32)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1244, file: !919, line: 878, baseType: !1249, size: 64, align: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1252)
!1252 = !{!1253, !1254, !1255, !1256, !1480, !1481, !1482, !1483, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1509, !1513, !1514, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1693, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1251, file: !4, line: 1561, baseType: !982, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1251, file: !4, line: 1562, baseType: !953, size: 32, align: 32, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1251, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1251, file: !4, line: 1565, baseType: !1257, size: 64, align: 64, offset: 128)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1259)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1260)
!1260 = !{!1261, !1262, !1263, !1264, !1265, !1266, !1269, !1272, !1275, !1278, !1282, !1283, !1284, !1292, !1293, !1294, !1296, !1300, !1306, !1311, !1315, !1316, !1364, !1451, !1455, !1456, !1460, !1464, !1469, !1473, !1474, !1475}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1259, file: !4, line: 3475, baseType: !961, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1259, file: !4, line: 3480, baseType: !961, size: 64, align: 64, offset: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1259, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1259, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1259, file: !4, line: 3487, baseType: !953, size: 32, align: 32, offset: 192)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1259, file: !4, line: 3488, baseType: !1267, size: 64, align: 64, offset: 256)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1259, file: !4, line: 3489, baseType: !1270, size: 64, align: 64, offset: 320)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1259, file: !4, line: 3490, baseType: !1273, size: 64, align: 64, offset: 384)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1259, file: !4, line: 3491, baseType: !1276, size: 64, align: 64, offset: 448)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1259, file: !4, line: 3492, baseType: !1279, size: 64, align: 64, offset: 512)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1281)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1121, line: 55, baseType: !1197)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1259, file: !4, line: 3493, baseType: !1120, size: 8, align: 8, offset: 576)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1259, file: !4, line: 3494, baseType: !982, size: 64, align: 64, offset: 640)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1259, file: !4, line: 3495, baseType: !1285, size: 64, align: 64, offset: 704)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1287)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1289)
!1289 = !{!1290, !1291}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1288, file: !4, line: 3402, baseType: !953, size: 32, align: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1288, file: !4, line: 3403, baseType: !961, size: 64, align: 64, offset: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1259, file: !4, line: 3507, baseType: !961, size: 64, align: 64, offset: 768)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1259, file: !4, line: 3516, baseType: !953, size: 32, align: 32, offset: 832)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1259, file: !4, line: 3517, baseType: !1295, size: 64, align: 64, offset: 896)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1259, file: !4, line: 3527, baseType: !1297, size: 64, align: 64, offset: 960)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!953, !1249}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1259, file: !4, line: 3535, baseType: !1301, size: 64, align: 64, offset: 1024)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!953, !1249, !1304}
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1250)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1259, file: !4, line: 3541, baseType: !1307, size: 64, align: 64, offset: 1088)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1309)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1310)
!1310 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1259, file: !4, line: 3549, baseType: !1312, size: 64, align: 64, offset: 1152)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{null, !1295}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1259, file: !4, line: 3551, baseType: !1297, size: 64, align: 64, offset: 1216)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1259, file: !4, line: 3552, baseType: !1317, size: 64, align: 64, offset: 1280)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!953, !1249, !1119, !953, !1320}
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1323)
!1323 = !{!1324, !1327, !1329, !1330, !1331, !1363}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1322, file: !4, line: 3921, baseType: !1325, size: 16, align: 16)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1121, line: 49, baseType: !1326)
!1326 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1322, file: !4, line: 3922, baseType: !1328, size: 32, align: 32, offset: 32)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1121, line: 51, baseType: !954)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1322, file: !4, line: 3923, baseType: !1328, size: 32, align: 32, offset: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1322, file: !4, line: 3924, baseType: !954, size: 32, align: 32, offset: 96)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1322, file: !4, line: 3925, baseType: !1332, size: 64, align: 64, offset: 128)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1335)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1336)
!1336 = !{!1337, !1338, !1339, !1340, !1341, !1342, !1352, !1356, !1358, !1359, !1361, !1362}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1335, file: !4, line: 3886, baseType: !953, size: 32, align: 32)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1335, file: !4, line: 3887, baseType: !953, size: 32, align: 32, offset: 32)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1335, file: !4, line: 3888, baseType: !953, size: 32, align: 32, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1335, file: !4, line: 3889, baseType: !953, size: 32, align: 32, offset: 96)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1335, file: !4, line: 3890, baseType: !953, size: 32, align: 32, offset: 128)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1335, file: !4, line: 3897, baseType: !1343, size: 768, align: 64, offset: 192)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1344)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1345)
!1345 = !{!1346, !1350}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1344, file: !4, line: 3855, baseType: !1347, size: 512, align: 64)
!1347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1119, size: 512, align: 64, elements: !1348)
!1348 = !{!1349}
!1349 = !DISubrange(count: 8)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1344, file: !4, line: 3857, baseType: !1351, size: 256, align: 32, offset: 512)
!1351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !953, size: 256, align: 32, elements: !1348)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1335, file: !4, line: 3903, baseType: !1353, size: 256, align: 64, offset: 960)
!1353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1119, size: 256, align: 64, elements: !1354)
!1354 = !{!1355}
!1355 = !DISubrange(count: 4)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1335, file: !4, line: 3904, baseType: !1357, size: 128, align: 32, offset: 1216)
!1357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !953, size: 128, align: 32, elements: !1354)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1335, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1335, file: !4, line: 3908, baseType: !1360, size: 64, align: 64, offset: 1408)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1335, file: !4, line: 3915, baseType: !1360, size: 64, align: 64, offset: 1472)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1335, file: !4, line: 3917, baseType: !953, size: 32, align: 32, offset: 1536)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1322, file: !4, line: 3926, baseType: !950, size: 64, align: 64, offset: 192)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1259, file: !4, line: 3564, baseType: !1365, size: 64, align: 64, offset: 1344)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{!953, !1249, !1104, !1368, !1450}
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1370)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1372)
!1372 = !{!1373, !1374, !1375, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1402, !1404, !1405, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1438, !1439, !1440, !1441, !1442, !1443, !1446, !1447, !1448, !1449}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1371, file: !789, line: 282, baseType: !1347, size: 512, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1371, file: !789, line: 299, baseType: !1351, size: 256, align: 32, offset: 512)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1371, file: !789, line: 315, baseType: !1376, size: 64, align: 64, offset: 768)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1371, file: !789, line: 326, baseType: !953, size: 32, align: 32, offset: 832)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1371, file: !789, line: 326, baseType: !953, size: 32, align: 32, offset: 864)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1371, file: !789, line: 334, baseType: !953, size: 32, align: 32, offset: 896)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1371, file: !789, line: 341, baseType: !953, size: 32, align: 32, offset: 928)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1371, file: !789, line: 346, baseType: !953, size: 32, align: 32, offset: 960)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1371, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1371, file: !789, line: 356, baseType: !1009, size: 64, align: 32, offset: 1024)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1371, file: !789, line: 361, baseType: !950, size: 64, align: 64, offset: 1088)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1371, file: !789, line: 369, baseType: !950, size: 64, align: 64, offset: 1152)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1371, file: !789, line: 377, baseType: !950, size: 64, align: 64, offset: 1216)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1371, file: !789, line: 382, baseType: !953, size: 32, align: 32, offset: 1280)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1371, file: !789, line: 386, baseType: !953, size: 32, align: 32, offset: 1312)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1371, file: !789, line: 391, baseType: !953, size: 32, align: 32, offset: 1344)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1371, file: !789, line: 396, baseType: !949, size: 64, align: 64, offset: 1408)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1371, file: !789, line: 403, baseType: !1392, size: 512, align: 64, offset: 1472)
!1392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1281, size: 512, align: 64, elements: !1348)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1371, file: !789, line: 410, baseType: !953, size: 32, align: 32, offset: 1984)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1371, file: !789, line: 415, baseType: !953, size: 32, align: 32, offset: 2016)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1371, file: !789, line: 420, baseType: !953, size: 32, align: 32, offset: 2048)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1371, file: !789, line: 425, baseType: !953, size: 32, align: 32, offset: 2080)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1371, file: !789, line: 435, baseType: !950, size: 64, align: 64, offset: 2112)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1371, file: !789, line: 440, baseType: !953, size: 32, align: 32, offset: 2176)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1371, file: !789, line: 445, baseType: !1281, size: 64, align: 64, offset: 2240)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1371, file: !789, line: 459, baseType: !1401, size: 512, align: 64, offset: 2304)
!1401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1109, size: 512, align: 64, elements: !1348)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1371, file: !789, line: 473, baseType: !1403, size: 64, align: 64, offset: 2816)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1371, file: !789, line: 477, baseType: !953, size: 32, align: 32, offset: 2880)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1371, file: !789, line: 479, baseType: !1406, size: 64, align: 64, offset: 2944)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1409)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1410)
!1410 = !{!1411, !1412, !1413, !1414, !1419}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1409, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1409, file: !789, line: 203, baseType: !1119, size: 64, align: 64, offset: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1409, file: !789, line: 204, baseType: !953, size: 32, align: 32, offset: 128)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1409, file: !789, line: 205, baseType: !1415, size: 64, align: 64, offset: 192)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1417, line: 86, baseType: !1418)
!1417 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1418 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1417, line: 86, flags: DIFlagFwdDecl)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1409, file: !789, line: 206, baseType: !1109, size: 64, align: 64, offset: 256)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1371, file: !789, line: 480, baseType: !953, size: 32, align: 32, offset: 3008)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1371, file: !789, line: 505, baseType: !953, size: 32, align: 32, offset: 3040)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1371, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1371, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1371, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1371, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1371, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1371, file: !789, line: 532, baseType: !950, size: 64, align: 64, offset: 3264)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1371, file: !789, line: 539, baseType: !950, size: 64, align: 64, offset: 3328)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1371, file: !789, line: 547, baseType: !950, size: 64, align: 64, offset: 3392)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1371, file: !789, line: 554, baseType: !1415, size: 64, align: 64, offset: 3456)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1371, file: !789, line: 563, baseType: !953, size: 32, align: 32, offset: 3520)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1371, file: !789, line: 572, baseType: !953, size: 32, align: 32, offset: 3552)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1371, file: !789, line: 581, baseType: !953, size: 32, align: 32, offset: 3584)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1371, file: !789, line: 588, baseType: !1435, size: 64, align: 64, offset: 3648)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !951, line: 194, baseType: !1437)
!1437 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1371, file: !789, line: 593, baseType: !953, size: 32, align: 32, offset: 3712)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1371, file: !789, line: 596, baseType: !953, size: 32, align: 32, offset: 3744)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1371, file: !789, line: 599, baseType: !1109, size: 64, align: 64, offset: 3776)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1371, file: !789, line: 605, baseType: !1109, size: 64, align: 64, offset: 3840)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1371, file: !789, line: 616, baseType: !1109, size: 64, align: 64, offset: 3904)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1371, file: !789, line: 626, baseType: !1444, size: 64, align: 64, offset: 3968)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1445, line: 216, baseType: !1197)
!1445 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1371, file: !789, line: 627, baseType: !1444, size: 64, align: 64, offset: 4032)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1371, file: !789, line: 628, baseType: !1444, size: 64, align: 64, offset: 4096)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1371, file: !789, line: 629, baseType: !1444, size: 64, align: 64, offset: 4160)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1371, file: !789, line: 645, baseType: !1109, size: 64, align: 64, offset: 4224)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1259, file: !4, line: 3566, baseType: !1452, size: 64, align: 64, offset: 1408)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{!953, !1249, !949, !1450, !1104}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1259, file: !4, line: 3567, baseType: !1297, size: 64, align: 64, offset: 1472)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1259, file: !4, line: 3576, baseType: !1457, size: 64, align: 64, offset: 1536)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!953, !1249, !1368}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1259, file: !4, line: 3577, baseType: !1461, size: 64, align: 64, offset: 1600)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!953, !1249, !1104}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1259, file: !4, line: 3584, baseType: !1465, size: 64, align: 64, offset: 1664)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!953, !1249, !1468}
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1259, file: !4, line: 3589, baseType: !1470, size: 64, align: 64, offset: 1728)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{null, !1249}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1259, file: !4, line: 3594, baseType: !953, size: 32, align: 32, offset: 1792)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1259, file: !4, line: 3600, baseType: !961, size: 64, align: 64, offset: 1856)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1259, file: !4, line: 3609, baseType: !1476, size: 64, align: 64, offset: 1920)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1479)
!1479 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1251, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1251, file: !4, line: 1581, baseType: !954, size: 32, align: 32, offset: 224)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1251, file: !4, line: 1583, baseType: !949, size: 64, align: 64, offset: 256)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1251, file: !4, line: 1591, baseType: !1484, size: 64, align: 64, offset: 320)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1251, file: !4, line: 1598, baseType: !949, size: 64, align: 64, offset: 384)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1251, file: !4, line: 1606, baseType: !950, size: 64, align: 64, offset: 448)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1251, file: !4, line: 1614, baseType: !953, size: 32, align: 32, offset: 512)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1251, file: !4, line: 1622, baseType: !953, size: 32, align: 32, offset: 544)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1251, file: !4, line: 1628, baseType: !953, size: 32, align: 32, offset: 576)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1251, file: !4, line: 1636, baseType: !953, size: 32, align: 32, offset: 608)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1251, file: !4, line: 1643, baseType: !953, size: 32, align: 32, offset: 640)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1251, file: !4, line: 1657, baseType: !1119, size: 64, align: 64, offset: 704)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1251, file: !4, line: 1658, baseType: !953, size: 32, align: 32, offset: 768)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1251, file: !4, line: 1679, baseType: !1009, size: 64, align: 32, offset: 800)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1251, file: !4, line: 1688, baseType: !953, size: 32, align: 32, offset: 864)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1251, file: !4, line: 1712, baseType: !953, size: 32, align: 32, offset: 896)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1251, file: !4, line: 1729, baseType: !953, size: 32, align: 32, offset: 928)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1251, file: !4, line: 1729, baseType: !953, size: 32, align: 32, offset: 960)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1251, file: !4, line: 1744, baseType: !953, size: 32, align: 32, offset: 992)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1251, file: !4, line: 1744, baseType: !953, size: 32, align: 32, offset: 1024)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1251, file: !4, line: 1751, baseType: !953, size: 32, align: 32, offset: 1056)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1251, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1251, file: !4, line: 1791, baseType: !1505, size: 64, align: 64, offset: 1152)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DISubroutineType(types: !1507)
!1507 = !{null, !1508, !1368, !1450, !953, !953, !953}
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1251, file: !4, line: 1808, baseType: !1510, size: 64, align: 64, offset: 1216)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DISubroutineType(types: !1512)
!1512 = !{!555, !1508, !1270}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1251, file: !4, line: 1816, baseType: !953, size: 32, align: 32, offset: 1280)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1251, file: !4, line: 1825, baseType: !1515, size: 32, align: 32, offset: 1312)
!1515 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1251, file: !4, line: 1830, baseType: !953, size: 32, align: 32, offset: 1344)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1251, file: !4, line: 1838, baseType: !1515, size: 32, align: 32, offset: 1376)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1251, file: !4, line: 1846, baseType: !953, size: 32, align: 32, offset: 1408)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1251, file: !4, line: 1851, baseType: !953, size: 32, align: 32, offset: 1440)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1251, file: !4, line: 1861, baseType: !1515, size: 32, align: 32, offset: 1472)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1251, file: !4, line: 1868, baseType: !1515, size: 32, align: 32, offset: 1504)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1251, file: !4, line: 1875, baseType: !1515, size: 32, align: 32, offset: 1536)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1251, file: !4, line: 1882, baseType: !1515, size: 32, align: 32, offset: 1568)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1251, file: !4, line: 1889, baseType: !1515, size: 32, align: 32, offset: 1600)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1251, file: !4, line: 1896, baseType: !1515, size: 32, align: 32, offset: 1632)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1251, file: !4, line: 1903, baseType: !1515, size: 32, align: 32, offset: 1664)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1251, file: !4, line: 1910, baseType: !953, size: 32, align: 32, offset: 1696)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1251, file: !4, line: 1915, baseType: !953, size: 32, align: 32, offset: 1728)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1251, file: !4, line: 1926, baseType: !1450, size: 64, align: 64, offset: 1792)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1251, file: !4, line: 1935, baseType: !1009, size: 64, align: 32, offset: 1856)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1251, file: !4, line: 1942, baseType: !953, size: 32, align: 32, offset: 1920)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1251, file: !4, line: 1948, baseType: !953, size: 32, align: 32, offset: 1952)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1251, file: !4, line: 1954, baseType: !953, size: 32, align: 32, offset: 1984)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1251, file: !4, line: 1960, baseType: !953, size: 32, align: 32, offset: 2016)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1251, file: !4, line: 1984, baseType: !953, size: 32, align: 32, offset: 2048)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1251, file: !4, line: 1991, baseType: !953, size: 32, align: 32, offset: 2080)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1251, file: !4, line: 1996, baseType: !953, size: 32, align: 32, offset: 2112)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1251, file: !4, line: 2004, baseType: !953, size: 32, align: 32, offset: 2144)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1251, file: !4, line: 2011, baseType: !953, size: 32, align: 32, offset: 2176)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1251, file: !4, line: 2018, baseType: !953, size: 32, align: 32, offset: 2208)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1251, file: !4, line: 2027, baseType: !953, size: 32, align: 32, offset: 2240)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1251, file: !4, line: 2034, baseType: !953, size: 32, align: 32, offset: 2272)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1251, file: !4, line: 2044, baseType: !953, size: 32, align: 32, offset: 2304)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1251, file: !4, line: 2054, baseType: !1545, size: 64, align: 64, offset: 2368)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1251, file: !4, line: 2061, baseType: !1545, size: 64, align: 64, offset: 2432)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1251, file: !4, line: 2066, baseType: !953, size: 32, align: 32, offset: 2496)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1251, file: !4, line: 2070, baseType: !953, size: 32, align: 32, offset: 2528)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1251, file: !4, line: 2078, baseType: !953, size: 32, align: 32, offset: 2560)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1251, file: !4, line: 2085, baseType: !953, size: 32, align: 32, offset: 2592)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1251, file: !4, line: 2092, baseType: !953, size: 32, align: 32, offset: 2624)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1251, file: !4, line: 2099, baseType: !953, size: 32, align: 32, offset: 2656)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1251, file: !4, line: 2106, baseType: !953, size: 32, align: 32, offset: 2688)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1251, file: !4, line: 2113, baseType: !953, size: 32, align: 32, offset: 2720)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1251, file: !4, line: 2120, baseType: !953, size: 32, align: 32, offset: 2752)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1251, file: !4, line: 2125, baseType: !953, size: 32, align: 32, offset: 2784)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1251, file: !4, line: 2133, baseType: !953, size: 32, align: 32, offset: 2816)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1251, file: !4, line: 2140, baseType: !953, size: 32, align: 32, offset: 2848)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1251, file: !4, line: 2145, baseType: !953, size: 32, align: 32, offset: 2880)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1251, file: !4, line: 2153, baseType: !953, size: 32, align: 32, offset: 2912)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1251, file: !4, line: 2158, baseType: !953, size: 32, align: 32, offset: 2944)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1251, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1251, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1251, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1251, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1251, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1251, file: !4, line: 2203, baseType: !953, size: 32, align: 32, offset: 3136)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1251, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1251, file: !4, line: 2212, baseType: !953, size: 32, align: 32, offset: 3200)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1251, file: !4, line: 2213, baseType: !953, size: 32, align: 32, offset: 3232)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1251, file: !4, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1251, file: !4, line: 2232, baseType: !953, size: 32, align: 32, offset: 3296)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1251, file: !4, line: 2243, baseType: !953, size: 32, align: 32, offset: 3328)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1251, file: !4, line: 2249, baseType: !953, size: 32, align: 32, offset: 3360)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1251, file: !4, line: 2256, baseType: !953, size: 32, align: 32, offset: 3392)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1251, file: !4, line: 2263, baseType: !1281, size: 64, align: 64, offset: 3456)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1251, file: !4, line: 2270, baseType: !1281, size: 64, align: 64, offset: 3520)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1251, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1251, file: !4, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1251, file: !4, line: 2367, baseType: !1581, size: 64, align: 64, offset: 3648)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DISubroutineType(types: !1583)
!1583 = !{!953, !1508, !1468, !953}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1251, file: !4, line: 2383, baseType: !953, size: 32, align: 32, offset: 3712)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1251, file: !4, line: 2386, baseType: !1515, size: 32, align: 32, offset: 3744)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1251, file: !4, line: 2387, baseType: !1515, size: 32, align: 32, offset: 3776)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1251, file: !4, line: 2394, baseType: !953, size: 32, align: 32, offset: 3808)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1251, file: !4, line: 2401, baseType: !953, size: 32, align: 32, offset: 3840)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1251, file: !4, line: 2408, baseType: !953, size: 32, align: 32, offset: 3872)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1251, file: !4, line: 2415, baseType: !953, size: 32, align: 32, offset: 3904)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1251, file: !4, line: 2422, baseType: !953, size: 32, align: 32, offset: 3936)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1251, file: !4, line: 2423, baseType: !1593, size: 64, align: 64, offset: 3968)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1595)
!1595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1596)
!1596 = !{!1597, !1598, !1599, !1600}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1595, file: !4, line: 827, baseType: !953, size: 32, align: 32)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1595, file: !4, line: 828, baseType: !953, size: 32, align: 32, offset: 32)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1595, file: !4, line: 829, baseType: !953, size: 32, align: 32, offset: 64)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1595, file: !4, line: 830, baseType: !1515, size: 32, align: 32, offset: 96)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1251, file: !4, line: 2430, baseType: !950, size: 64, align: 64, offset: 4032)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1251, file: !4, line: 2437, baseType: !950, size: 64, align: 64, offset: 4096)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1251, file: !4, line: 2444, baseType: !1515, size: 32, align: 32, offset: 4160)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1251, file: !4, line: 2451, baseType: !1515, size: 32, align: 32, offset: 4192)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1251, file: !4, line: 2458, baseType: !953, size: 32, align: 32, offset: 4224)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1251, file: !4, line: 2469, baseType: !953, size: 32, align: 32, offset: 4256)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1251, file: !4, line: 2475, baseType: !953, size: 32, align: 32, offset: 4288)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1251, file: !4, line: 2481, baseType: !953, size: 32, align: 32, offset: 4320)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1251, file: !4, line: 2485, baseType: !953, size: 32, align: 32, offset: 4352)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1251, file: !4, line: 2489, baseType: !953, size: 32, align: 32, offset: 4384)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1251, file: !4, line: 2493, baseType: !953, size: 32, align: 32, offset: 4416)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1251, file: !4, line: 2501, baseType: !953, size: 32, align: 32, offset: 4448)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1251, file: !4, line: 2506, baseType: !953, size: 32, align: 32, offset: 4480)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1251, file: !4, line: 2510, baseType: !953, size: 32, align: 32, offset: 4512)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1251, file: !4, line: 2514, baseType: !950, size: 64, align: 64, offset: 4544)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1251, file: !4, line: 2528, baseType: !1617, size: 64, align: 64, offset: 4608)
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64, align: 64)
!1618 = !DISubroutineType(types: !1619)
!1619 = !{null, !1508, !949, !953, !953}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1251, file: !4, line: 2534, baseType: !953, size: 32, align: 32, offset: 4672)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1251, file: !4, line: 2545, baseType: !953, size: 32, align: 32, offset: 4704)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1251, file: !4, line: 2547, baseType: !953, size: 32, align: 32, offset: 4736)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1251, file: !4, line: 2549, baseType: !953, size: 32, align: 32, offset: 4768)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1251, file: !4, line: 2551, baseType: !953, size: 32, align: 32, offset: 4800)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1251, file: !4, line: 2553, baseType: !953, size: 32, align: 32, offset: 4832)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1251, file: !4, line: 2555, baseType: !953, size: 32, align: 32, offset: 4864)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1251, file: !4, line: 2557, baseType: !953, size: 32, align: 32, offset: 4896)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1251, file: !4, line: 2559, baseType: !953, size: 32, align: 32, offset: 4928)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1251, file: !4, line: 2563, baseType: !953, size: 32, align: 32, offset: 4960)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1251, file: !4, line: 2571, baseType: !1360, size: 64, align: 64, offset: 4992)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1251, file: !4, line: 2579, baseType: !1360, size: 64, align: 64, offset: 5056)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1251, file: !4, line: 2586, baseType: !953, size: 32, align: 32, offset: 5120)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1251, file: !4, line: 2615, baseType: !953, size: 32, align: 32, offset: 5152)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1251, file: !4, line: 2627, baseType: !953, size: 32, align: 32, offset: 5184)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1251, file: !4, line: 2637, baseType: !953, size: 32, align: 32, offset: 5216)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1251, file: !4, line: 2681, baseType: !953, size: 32, align: 32, offset: 5248)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1251, file: !4, line: 2709, baseType: !950, size: 64, align: 64, offset: 5312)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1251, file: !4, line: 2716, baseType: !1639, size: 64, align: 64, offset: 5376)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1641)
!1641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1642)
!1642 = !{!1643, !1644, !1645, !1646, !1647, !1648, !1649, !1653, !1657, !1658, !1659, !1660, !1666, !1667, !1668, !1669, !1670}
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1641, file: !4, line: 3642, baseType: !961, size: 64, align: 64)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1641, file: !4, line: 3649, baseType: !545, size: 32, align: 32, offset: 64)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1641, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1641, file: !4, line: 3663, baseType: !555, size: 32, align: 32, offset: 128)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1641, file: !4, line: 3669, baseType: !953, size: 32, align: 32, offset: 160)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1641, file: !4, line: 3682, baseType: !1465, size: 64, align: 64, offset: 192)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1641, file: !4, line: 3698, baseType: !1650, size: 64, align: 64, offset: 256)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DISubroutineType(types: !1652)
!1652 = !{!953, !1249, !1203, !1328}
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1641, file: !4, line: 3712, baseType: !1654, size: 64, align: 64, offset: 320)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{!953, !1249, !953, !1203, !1328}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1641, file: !4, line: 3726, baseType: !1650, size: 64, align: 64, offset: 384)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1641, file: !4, line: 3737, baseType: !1297, size: 64, align: 64, offset: 448)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1641, file: !4, line: 3746, baseType: !953, size: 32, align: 32, offset: 512)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1641, file: !4, line: 3757, baseType: !1661, size: 64, align: 64, offset: 576)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DISubroutineType(types: !1663)
!1663 = !{null, !1664}
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1641, file: !4, line: 3766, baseType: !1297, size: 64, align: 64, offset: 640)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1641, file: !4, line: 3774, baseType: !1297, size: 64, align: 64, offset: 704)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1641, file: !4, line: 3780, baseType: !953, size: 32, align: 32, offset: 768)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1641, file: !4, line: 3785, baseType: !953, size: 32, align: 32, offset: 800)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1641, file: !4, line: 3795, baseType: !1671, size: 64, align: 64, offset: 832)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DISubroutineType(types: !1673)
!1673 = !{!953, !1249, !1109}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1251, file: !4, line: 2728, baseType: !949, size: 64, align: 64, offset: 5440)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1251, file: !4, line: 2735, baseType: !1392, size: 512, align: 64, offset: 5504)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1251, file: !4, line: 2742, baseType: !953, size: 32, align: 32, offset: 6016)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1251, file: !4, line: 2755, baseType: !953, size: 32, align: 32, offset: 6048)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1251, file: !4, line: 2776, baseType: !953, size: 32, align: 32, offset: 6080)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1251, file: !4, line: 2783, baseType: !953, size: 32, align: 32, offset: 6112)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1251, file: !4, line: 2791, baseType: !953, size: 32, align: 32, offset: 6144)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1251, file: !4, line: 2802, baseType: !1468, size: 64, align: 64, offset: 6208)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1251, file: !4, line: 2811, baseType: !953, size: 32, align: 32, offset: 6272)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1251, file: !4, line: 2821, baseType: !953, size: 32, align: 32, offset: 6304)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1251, file: !4, line: 2830, baseType: !953, size: 32, align: 32, offset: 6336)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1251, file: !4, line: 2840, baseType: !953, size: 32, align: 32, offset: 6368)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1251, file: !4, line: 2851, baseType: !1687, size: 64, align: 64, offset: 6400)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DISubroutineType(types: !1689)
!1689 = !{!953, !1508, !1690, !949, !1450, !953, !953}
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DISubroutineType(types: !1692)
!1692 = !{!953, !1508, !949}
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1251, file: !4, line: 2871, baseType: !1694, size: 64, align: 64, offset: 6464)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DISubroutineType(types: !1696)
!1696 = !{!953, !1508, !1697, !949, !1450, !953}
!1697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64, align: 64)
!1698 = !DISubroutineType(types: !1699)
!1699 = !{!953, !1508, !949, !953, !953}
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1251, file: !4, line: 2878, baseType: !953, size: 32, align: 32, offset: 6528)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1251, file: !4, line: 2885, baseType: !953, size: 32, align: 32, offset: 6560)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1251, file: !4, line: 3005, baseType: !953, size: 32, align: 32, offset: 6592)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1251, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1251, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1251, file: !4, line: 3027, baseType: !909, size: 32, align: 32, offset: 6688)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1251, file: !4, line: 3037, baseType: !1119, size: 64, align: 64, offset: 6720)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1251, file: !4, line: 3038, baseType: !953, size: 32, align: 32, offset: 6784)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1251, file: !4, line: 3050, baseType: !1281, size: 64, align: 64, offset: 6848)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1251, file: !4, line: 3065, baseType: !953, size: 32, align: 32, offset: 6912)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1251, file: !4, line: 3083, baseType: !953, size: 32, align: 32, offset: 6944)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1251, file: !4, line: 3092, baseType: !1009, size: 64, align: 32, offset: 6976)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1251, file: !4, line: 3099, baseType: !555, size: 32, align: 32, offset: 7040)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1251, file: !4, line: 3106, baseType: !1009, size: 64, align: 32, offset: 7072)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1251, file: !4, line: 3113, baseType: !1715, size: 64, align: 64, offset: 7168)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1717)
!1717 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1718)
