; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--tedcaptionsdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--tedcaptionsdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!883 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !4, line: 3865, size: 32, align: 32, elements: !884)
!884 = !{!885, !886, !887, !888}
!885 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!886 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!887 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!888 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sub_sort", file: !939, line: 29, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "libavformat/subtitles.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!940 = !{!941, !942}
!941 = !DIEnumerator(name: "SUB_SORT_TS_POS", value: 0)
!942 = !DIEnumerator(name: "SUB_SORT_POS_TS", value: 1)
!943 = !{!944, !945, !946}
!944 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!945 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !947, line: 40, baseType: !948)
!947 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!948 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!949 = !{!950, !2195, !2196, !2201, !2205}
!950 = distinct !DIGlobalVariable(name: "ff_tedcaptions_demuxer", scope: !0, file: !951, line: 356, type: !952, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_tedcaptions_demuxer)
!951 = !DIFile(filename: "libavformat/tedcaptionsdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !954)
!954 = !{!955, !959, !960, !961, !962, !972, !1052, !1053, !1055, !1056, !1057, !1071, !2176, !2177, !2178, !2182, !2186, !2187, !2188, !2192, !2193, !2194}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !953, file: !919, line: 638, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !953, file: !919, line: 645, baseType: !956, size: 64, align: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !953, file: !919, line: 652, baseType: !944, size: 32, align: 32, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !953, file: !919, line: 659, baseType: !956, size: 64, align: 64, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !953, file: !919, line: 661, baseType: !963, size: 64, align: 64, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !968, line: 44, size: 64, align: 32, elements: !969)
!968 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !967, file: !968, line: 45, baseType: !3, size: 32, align: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !967, file: !968, line: 46, baseType: !945, size: 32, align: 32, offset: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !953, file: !919, line: 663, baseType: !973, size: 64, align: 64, offset: 320)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !977)
!977 = !{!978, !979, !984, !1011, !1012, !1013, !1014, !1018, !1024, !1026, !1030}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !976, file: !486, line: 72, baseType: !956, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !976, file: !486, line: 78, baseType: !980, size: 64, align: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!956, !983}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !976, file: !486, line: 85, baseType: !985, size: 64, align: 64, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !988)
!988 = !{!989, !990, !991, !992, !993, !1007, !1008, !1009, !1010}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !987, file: !464, line: 247, baseType: !956, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !987, file: !464, line: 253, baseType: !956, size: 64, align: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !987, file: !464, line: 259, baseType: !944, size: 32, align: 32, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !987, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !987, file: !464, line: 271, baseType: !994, size: 64, align: 64, offset: 192)
!994 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !987, file: !464, line: 265, size: 64, align: 64, elements: !995)
!995 = !{!996, !997, !999, !1000}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !994, file: !464, line: 266, baseType: !946, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !994, file: !464, line: 267, baseType: !998, size: 64, align: 64)
!998 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !994, file: !464, line: 268, baseType: !956, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !994, file: !464, line: 270, baseType: !1001, size: 64, align: 32)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1002, line: 61, baseType: !1003)
!1002 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1002, line: 58, size: 64, align: 32, elements: !1004)
!1004 = !{!1005, !1006}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1003, file: !1002, line: 59, baseType: !944, size: 32, align: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1003, file: !1002, line: 60, baseType: !944, size: 32, align: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !987, file: !464, line: 272, baseType: !998, size: 64, align: 64, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !987, file: !464, line: 273, baseType: !998, size: 64, align: 64, offset: 320)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !987, file: !464, line: 275, baseType: !944, size: 32, align: 32, offset: 384)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !987, file: !464, line: 300, baseType: !956, size: 64, align: 64, offset: 448)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !976, file: !486, line: 93, baseType: !944, size: 32, align: 32, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !976, file: !486, line: 99, baseType: !944, size: 32, align: 32, offset: 224)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !976, file: !486, line: 108, baseType: !944, size: 32, align: 32, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !976, file: !486, line: 113, baseType: !1015, size: 64, align: 64, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!983, !983, !983}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !976, file: !486, line: 123, baseType: !1019, size: 64, align: 64, offset: 384)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!1022, !1022}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !976, file: !486, line: 130, baseType: !1025, size: 32, align: 32, offset: 448)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !976, file: !486, line: 136, baseType: !1027, size: 64, align: 64, offset: 512)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!1025, !983}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !976, file: !486, line: 142, baseType: !1031, size: 64, align: 64, offset: 576)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!944, !1034, !983, !956, !944}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1037)
!1037 = !{!1038, !1050, !1051}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1036, file: !464, line: 360, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1042, file: !464, line: 307, baseType: !956, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1042, file: !464, line: 313, baseType: !998, size: 64, align: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1042, file: !464, line: 313, baseType: !998, size: 64, align: 64, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1042, file: !464, line: 318, baseType: !998, size: 64, align: 64, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1042, file: !464, line: 318, baseType: !998, size: 64, align: 64, offset: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1042, file: !464, line: 323, baseType: !944, size: 32, align: 32, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1036, file: !464, line: 364, baseType: !944, size: 32, align: 32, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1036, file: !464, line: 368, baseType: !944, size: 32, align: 32, offset: 96)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !953, file: !919, line: 670, baseType: !956, size: 64, align: 64, offset: 384)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !953, file: !919, line: 679, baseType: !1054, size: 64, align: 64, offset: 448)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !953, file: !919, line: 684, baseType: !944, size: 32, align: 32, offset: 512)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !953, file: !919, line: 689, baseType: !944, size: 32, align: 32, offset: 544)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !953, file: !919, line: 696, baseType: !1058, size: 64, align: 64, offset: 576)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!944, !1061}
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1064)
!1064 = !{!1065, !1066, !1069, !1070}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1063, file: !919, line: 449, baseType: !956, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1063, file: !919, line: 450, baseType: !1067, size: 64, align: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1063, file: !919, line: 451, baseType: !944, size: 32, align: 32, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1063, file: !919, line: 452, baseType: !956, size: 64, align: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !953, file: !919, line: 703, baseType: !1072, size: 64, align: 64, offset: 640)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!944, !1075}
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1077)
!1077 = !{!1078, !1079, !1080, !1272, !1273, !1338, !1339, !1340, !2033, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2087, !2088, !2089, !2090, !2091, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2142, !2143, !2146, !2147, !2148, !2149, !2150, !2151, !2153, !2154, !2155, !2156, !2164, !2165, !2169, !2173, !2174, !2175}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1076, file: !919, line: 1342, baseType: !973, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1076, file: !919, line: 1349, baseType: !1054, size: 64, align: 64, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1076, file: !919, line: 1356, baseType: !1081, size: 64, align: 64, offset: 128)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1083)
!1083 = !{!1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1137, !1138, !1142, !1146, !1151, !1158, !1247, !1253, !1259, !1260, !1261, !1262, !1266}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1082, file: !919, line: 498, baseType: !956, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1082, file: !919, line: 504, baseType: !956, size: 64, align: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1082, file: !919, line: 505, baseType: !956, size: 64, align: 64, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1082, file: !919, line: 506, baseType: !956, size: 64, align: 64, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1082, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1082, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1082, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1082, file: !919, line: 517, baseType: !944, size: 32, align: 32, offset: 352)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1082, file: !919, line: 523, baseType: !963, size: 64, align: 64, offset: 384)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1082, file: !919, line: 526, baseType: !973, size: 64, align: 64, offset: 448)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1082, file: !919, line: 535, baseType: !1081, size: 64, align: 64, offset: 512)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1082, file: !919, line: 539, baseType: !944, size: 32, align: 32, offset: 576)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1082, file: !919, line: 541, baseType: !1072, size: 64, align: 64, offset: 640)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1082, file: !919, line: 549, baseType: !1098, size: 64, align: 64, offset: 704)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!944, !1075, !1101}
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1104)
!1104 = !{!1105, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1133, !1134, !1135, !1136}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1103, file: !4, line: 1451, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1108, line: 94, baseType: !1109)
!1108 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1108, line: 81, size: 192, align: 64, elements: !1110)
!1110 = !{!1111, !1115, !1118}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1109, file: !1108, line: 82, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1108, line: 73, baseType: !1114)
!1114 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1108, line: 73, flags: DIFlagFwdDecl)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1109, file: !1108, line: 89, baseType: !1116, size: 64, align: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !947, line: 48, baseType: !1068)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1109, file: !1108, line: 93, baseType: !944, size: 32, align: 32, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1103, file: !4, line: 1461, baseType: !946, size: 64, align: 64, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1103, file: !4, line: 1467, baseType: !946, size: 64, align: 64, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1103, file: !4, line: 1468, baseType: !1116, size: 64, align: 64, offset: 192)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1103, file: !4, line: 1469, baseType: !944, size: 32, align: 32, offset: 256)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1103, file: !4, line: 1470, baseType: !944, size: 32, align: 32, offset: 288)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1103, file: !4, line: 1474, baseType: !944, size: 32, align: 32, offset: 320)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1103, file: !4, line: 1479, baseType: !1126, size: 64, align: 64, offset: 384)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1129)
!1129 = !{!1130, !1131, !1132}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1128, file: !4, line: 1412, baseType: !1116, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1128, file: !4, line: 1413, baseType: !944, size: 32, align: 32, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1128, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1103, file: !4, line: 1480, baseType: !944, size: 32, align: 32, offset: 448)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1103, file: !4, line: 1486, baseType: !946, size: 64, align: 64, offset: 512)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1103, file: !4, line: 1488, baseType: !946, size: 64, align: 64, offset: 576)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1103, file: !4, line: 1497, baseType: !946, size: 64, align: 64, offset: 640)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1082, file: !919, line: 550, baseType: !1072, size: 64, align: 64, offset: 768)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1082, file: !919, line: 554, baseType: !1139, size: 64, align: 64, offset: 832)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!944, !1075, !1101, !1101, !944}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1082, file: !919, line: 563, baseType: !1143, size: 64, align: 64, offset: 896)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!944, !3, !944}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1082, file: !919, line: 565, baseType: !1147, size: 64, align: 64, offset: 960)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{null, !1075, !944, !1150, !1150}
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1082, file: !919, line: 570, baseType: !1152, size: 64, align: 64, offset: 1024)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!944, !1075, !944, !983, !1155}
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1156, line: 216, baseType: !1157)
!1156 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1157 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1082, file: !919, line: 581, baseType: !1159, size: 64, align: 64, offset: 1088)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!944, !1075, !944, !1162, !945}
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1166)
!1166 = !{!1167, !1171, !1173, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1201, !1203, !1204, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1165, file: !548, line: 282, baseType: !1168, size: 512, align: 64)
!1168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 512, align: 64, elements: !1169)
!1169 = !{!1170}
!1170 = !DISubrange(count: 8)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1165, file: !548, line: 299, baseType: !1172, size: 256, align: 32, offset: 512)
!1172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 256, align: 32, elements: !1169)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1165, file: !548, line: 315, baseType: !1174, size: 64, align: 64, offset: 768)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1165, file: !548, line: 326, baseType: !944, size: 32, align: 32, offset: 832)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1165, file: !548, line: 326, baseType: !944, size: 32, align: 32, offset: 864)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1165, file: !548, line: 334, baseType: !944, size: 32, align: 32, offset: 896)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1165, file: !548, line: 341, baseType: !944, size: 32, align: 32, offset: 928)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1165, file: !548, line: 346, baseType: !944, size: 32, align: 32, offset: 960)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1165, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1165, file: !548, line: 356, baseType: !1001, size: 64, align: 32, offset: 1024)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1165, file: !548, line: 361, baseType: !946, size: 64, align: 64, offset: 1088)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1165, file: !548, line: 369, baseType: !946, size: 64, align: 64, offset: 1152)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1165, file: !548, line: 377, baseType: !946, size: 64, align: 64, offset: 1216)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1165, file: !548, line: 382, baseType: !944, size: 32, align: 32, offset: 1280)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1165, file: !548, line: 386, baseType: !944, size: 32, align: 32, offset: 1312)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1165, file: !548, line: 391, baseType: !944, size: 32, align: 32, offset: 1344)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1165, file: !548, line: 396, baseType: !983, size: 64, align: 64, offset: 1408)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1165, file: !548, line: 403, baseType: !1190, size: 512, align: 64, offset: 1472)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1191, size: 512, align: 64, elements: !1169)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !947, line: 55, baseType: !1157)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1165, file: !548, line: 410, baseType: !944, size: 32, align: 32, offset: 1984)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1165, file: !548, line: 415, baseType: !944, size: 32, align: 32, offset: 2016)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1165, file: !548, line: 420, baseType: !944, size: 32, align: 32, offset: 2048)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1165, file: !548, line: 425, baseType: !944, size: 32, align: 32, offset: 2080)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1165, file: !548, line: 435, baseType: !946, size: 64, align: 64, offset: 2112)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1165, file: !548, line: 440, baseType: !944, size: 32, align: 32, offset: 2176)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1165, file: !548, line: 445, baseType: !1191, size: 64, align: 64, offset: 2240)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1165, file: !548, line: 459, baseType: !1200, size: 512, align: 64, offset: 2304)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1106, size: 512, align: 64, elements: !1169)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1165, file: !548, line: 473, baseType: !1202, size: 64, align: 64, offset: 2816)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1165, file: !548, line: 477, baseType: !944, size: 32, align: 32, offset: 2880)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1165, file: !548, line: 479, baseType: !1205, size: 64, align: 64, offset: 2944)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1209)
!1209 = !{!1210, !1211, !1212, !1213, !1218}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1208, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1208, file: !548, line: 203, baseType: !1116, size: 64, align: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1208, file: !548, line: 204, baseType: !944, size: 32, align: 32, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1208, file: !548, line: 205, baseType: !1214, size: 64, align: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1216, line: 86, baseType: !1217)
!1216 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1216, line: 86, flags: DIFlagFwdDecl)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1208, file: !548, line: 206, baseType: !1106, size: 64, align: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1165, file: !548, line: 480, baseType: !944, size: 32, align: 32, offset: 3008)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1165, file: !548, line: 505, baseType: !944, size: 32, align: 32, offset: 3040)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1165, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1165, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1165, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1165, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1165, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1165, file: !548, line: 532, baseType: !946, size: 64, align: 64, offset: 3264)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1165, file: !548, line: 539, baseType: !946, size: 64, align: 64, offset: 3328)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1165, file: !548, line: 547, baseType: !946, size: 64, align: 64, offset: 3392)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1165, file: !548, line: 554, baseType: !1214, size: 64, align: 64, offset: 3456)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1165, file: !548, line: 563, baseType: !944, size: 32, align: 32, offset: 3520)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1165, file: !548, line: 572, baseType: !944, size: 32, align: 32, offset: 3552)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1165, file: !548, line: 581, baseType: !944, size: 32, align: 32, offset: 3584)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1165, file: !548, line: 588, baseType: !1234, size: 64, align: 64, offset: 3648)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !947, line: 36, baseType: !1236)
!1236 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1165, file: !548, line: 593, baseType: !944, size: 32, align: 32, offset: 3712)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1165, file: !548, line: 596, baseType: !944, size: 32, align: 32, offset: 3744)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1165, file: !548, line: 599, baseType: !1106, size: 64, align: 64, offset: 3776)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1165, file: !548, line: 605, baseType: !1106, size: 64, align: 64, offset: 3840)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1165, file: !548, line: 616, baseType: !1106, size: 64, align: 64, offset: 3904)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1165, file: !548, line: 626, baseType: !1155, size: 64, align: 64, offset: 3968)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1165, file: !548, line: 627, baseType: !1155, size: 64, align: 64, offset: 4032)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1165, file: !548, line: 628, baseType: !1155, size: 64, align: 64, offset: 4096)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1165, file: !548, line: 629, baseType: !1155, size: 64, align: 64, offset: 4160)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1165, file: !548, line: 645, baseType: !1106, size: 64, align: 64, offset: 4224)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1082, file: !919, line: 587, baseType: !1248, size: 64, align: 64, offset: 1152)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!944, !1075, !1251}
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1082, file: !919, line: 592, baseType: !1254, size: 64, align: 64, offset: 1216)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!944, !1075, !1257}
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1082, file: !919, line: 597, baseType: !1254, size: 64, align: 64, offset: 1280)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1082, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1082, file: !919, line: 608, baseType: !1072, size: 64, align: 64, offset: 1408)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1082, file: !919, line: 617, baseType: !1263, size: 64, align: 64, offset: 1472)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{null, !1075}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1082, file: !919, line: 623, baseType: !1267, size: 64, align: 64, offset: 1536)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!944, !1075, !1270}
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1102)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1076, file: !919, line: 1365, baseType: !983, size: 64, align: 64, offset: 192)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1076, file: !919, line: 1379, baseType: !1274, size: 64, align: 64, offset: 256)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1277)
!1277 = !{!1278, !1279, !1280, !1281, !1282, !1283, !1284, !1288, !1289, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1305, !1306, !1310, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1328, !1329, !1330, !1331, !1335, !1336, !1337}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1276, file: !650, line: 174, baseType: !973, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1276, file: !650, line: 226, baseType: !1067, size: 64, align: 64, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1276, file: !650, line: 227, baseType: !944, size: 32, align: 32, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1276, file: !650, line: 228, baseType: !1067, size: 64, align: 64, offset: 192)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1276, file: !650, line: 229, baseType: !1067, size: 64, align: 64, offset: 256)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1276, file: !650, line: 233, baseType: !983, size: 64, align: 64, offset: 320)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1276, file: !650, line: 235, baseType: !1285, size: 64, align: 64, offset: 384)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!944, !983, !1116, !944}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1276, file: !650, line: 236, baseType: !1285, size: 64, align: 64, offset: 448)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1276, file: !650, line: 237, baseType: !1290, size: 64, align: 64, offset: 512)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!946, !983, !946, !944}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1276, file: !650, line: 238, baseType: !946, size: 64, align: 64, offset: 576)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1276, file: !650, line: 239, baseType: !944, size: 32, align: 32, offset: 640)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1276, file: !650, line: 240, baseType: !944, size: 32, align: 32, offset: 672)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1276, file: !650, line: 241, baseType: !944, size: 32, align: 32, offset: 704)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1276, file: !650, line: 242, baseType: !1157, size: 64, align: 64, offset: 768)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1276, file: !650, line: 243, baseType: !1067, size: 64, align: 64, offset: 832)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1276, file: !650, line: 244, baseType: !1300, size: 64, align: 64, offset: 896)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!1157, !1157, !1303, !945}
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1117)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1276, file: !650, line: 245, baseType: !944, size: 32, align: 32, offset: 960)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1276, file: !650, line: 249, baseType: !1307, size: 64, align: 64, offset: 1024)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!944, !983, !944}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1276, file: !650, line: 255, baseType: !1311, size: 64, align: 64, offset: 1088)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!946, !983, !944, !946, !944}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1276, file: !650, line: 260, baseType: !944, size: 32, align: 32, offset: 1152)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1276, file: !650, line: 266, baseType: !946, size: 64, align: 64, offset: 1216)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1276, file: !650, line: 273, baseType: !944, size: 32, align: 32, offset: 1280)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1276, file: !650, line: 279, baseType: !946, size: 64, align: 64, offset: 1344)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1276, file: !650, line: 285, baseType: !944, size: 32, align: 32, offset: 1408)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1276, file: !650, line: 291, baseType: !944, size: 32, align: 32, offset: 1440)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1276, file: !650, line: 298, baseType: !944, size: 32, align: 32, offset: 1472)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1276, file: !650, line: 304, baseType: !944, size: 32, align: 32, offset: 1504)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1276, file: !650, line: 309, baseType: !956, size: 64, align: 64, offset: 1536)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1276, file: !650, line: 314, baseType: !956, size: 64, align: 64, offset: 1600)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1276, file: !650, line: 319, baseType: !1325, size: 64, align: 64, offset: 1664)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{!944, !983, !1116, !944, !649, !946}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1276, file: !650, line: 326, baseType: !944, size: 32, align: 32, offset: 1728)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1276, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1276, file: !650, line: 332, baseType: !946, size: 64, align: 64, offset: 1792)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1276, file: !650, line: 338, baseType: !1332, size: 64, align: 64, offset: 1856)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!944, !983}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1276, file: !650, line: 340, baseType: !946, size: 64, align: 64, offset: 1920)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1276, file: !650, line: 346, baseType: !1067, size: 64, align: 64, offset: 1984)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1276, file: !650, line: 351, baseType: !944, size: 32, align: 32, offset: 2048)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1076, file: !919, line: 1386, baseType: !944, size: 32, align: 32, offset: 320)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1076, file: !919, line: 1393, baseType: !945, size: 32, align: 32, offset: 352)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1076, file: !919, line: 1405, baseType: !1341, size: 64, align: 64, offset: 384)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1344)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1345)
!1345 = !{!1346, !1347, !1348, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1819, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1919, !1925, !1926, !1930, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1962, !1963, !1964, !1965, !1966, !1967}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1344, file: !919, line: 866, baseType: !944, size: 32, align: 32)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1344, file: !919, line: 872, baseType: !944, size: 32, align: 32, offset: 32)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1344, file: !919, line: 878, baseType: !1349, size: 64, align: 64, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1351)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1352)
!1352 = !{!1353, !1354, !1355, !1356, !1494, !1495, !1496, !1497, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1523, !1527, !1528, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1707, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1351, file: !4, line: 1561, baseType: !973, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1351, file: !4, line: 1562, baseType: !944, size: 32, align: 32, offset: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1351, file: !4, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1351, file: !4, line: 1565, baseType: !1357, size: 64, align: 64, offset: 128)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1359)
!1359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1360)
!1360 = !{!1361, !1362, !1363, !1364, !1365, !1366, !1369, !1372, !1375, !1378, !1381, !1382, !1383, !1391, !1392, !1393, !1395, !1399, !1405, !1410, !1414, !1415, !1459, !1466, !1470, !1471, !1475, !1479, !1483, !1487, !1488, !1489}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1359, file: !4, line: 3475, baseType: !956, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1359, file: !4, line: 3480, baseType: !956, size: 64, align: 64, offset: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1359, file: !4, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1359, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1359, file: !4, line: 3487, baseType: !944, size: 32, align: 32, offset: 192)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1359, file: !4, line: 3488, baseType: !1367, size: 64, align: 64, offset: 256)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1359, file: !4, line: 3489, baseType: !1370, size: 64, align: 64, offset: 320)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1359, file: !4, line: 3490, baseType: !1373, size: 64, align: 64, offset: 384)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1359, file: !4, line: 3491, baseType: !1376, size: 64, align: 64, offset: 448)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1359, file: !4, line: 3492, baseType: !1379, size: 64, align: 64, offset: 512)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1191)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1359, file: !4, line: 3493, baseType: !1117, size: 8, align: 8, offset: 576)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1359, file: !4, line: 3494, baseType: !973, size: 64, align: 64, offset: 640)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1359, file: !4, line: 3495, baseType: !1384, size: 64, align: 64, offset: 704)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1386)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1387)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1388)
!1388 = !{!1389, !1390}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1387, file: !4, line: 3402, baseType: !944, size: 32, align: 32)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1387, file: !4, line: 3403, baseType: !956, size: 64, align: 64, offset: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1359, file: !4, line: 3507, baseType: !956, size: 64, align: 64, offset: 768)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1359, file: !4, line: 3516, baseType: !944, size: 32, align: 32, offset: 832)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1359, file: !4, line: 3517, baseType: !1394, size: 64, align: 64, offset: 896)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1359, file: !4, line: 3527, baseType: !1396, size: 64, align: 64, offset: 960)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DISubroutineType(types: !1398)
!1398 = !{!944, !1349}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1359, file: !4, line: 3535, baseType: !1400, size: 64, align: 64, offset: 1024)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DISubroutineType(types: !1402)
!1402 = !{!944, !1349, !1403}
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1350)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1359, file: !4, line: 3541, baseType: !1406, size: 64, align: 64, offset: 1088)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1408)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1409)
!1409 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1359, file: !4, line: 3549, baseType: !1411, size: 64, align: 64, offset: 1152)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DISubroutineType(types: !1413)
!1413 = !{null, !1394}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1359, file: !4, line: 3551, baseType: !1396, size: 64, align: 64, offset: 1216)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1359, file: !4, line: 3552, baseType: !1416, size: 64, align: 64, offset: 1280)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{!944, !1349, !1116, !944, !1419}
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1421)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1422)
!1422 = !{!1423, !1426, !1428, !1429, !1430, !1458}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1421, file: !4, line: 3921, baseType: !1424, size: 16, align: 16)
!1424 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !947, line: 49, baseType: !1425)
!1425 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1421, file: !4, line: 3922, baseType: !1427, size: 32, align: 32, offset: 32)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !947, line: 51, baseType: !945)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1421, file: !4, line: 3923, baseType: !1427, size: 32, align: 32, offset: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1421, file: !4, line: 3924, baseType: !945, size: 32, align: 32, offset: 96)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1421, file: !4, line: 3925, baseType: !1431, size: 64, align: 64, offset: 128)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1434)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1435)
!1435 = !{!1436, !1437, !1438, !1439, !1440, !1441, !1447, !1451, !1453, !1454, !1456, !1457}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1434, file: !4, line: 3886, baseType: !944, size: 32, align: 32)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1434, file: !4, line: 3887, baseType: !944, size: 32, align: 32, offset: 32)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1434, file: !4, line: 3888, baseType: !944, size: 32, align: 32, offset: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1434, file: !4, line: 3889, baseType: !944, size: 32, align: 32, offset: 96)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1434, file: !4, line: 3890, baseType: !944, size: 32, align: 32, offset: 128)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1434, file: !4, line: 3897, baseType: !1442, size: 768, align: 64, offset: 192)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1443)
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1444)
!1444 = !{!1445, !1446}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1443, file: !4, line: 3855, baseType: !1168, size: 512, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1443, file: !4, line: 3857, baseType: !1172, size: 256, align: 32, offset: 512)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1434, file: !4, line: 3903, baseType: !1448, size: 256, align: 64, offset: 960)
!1448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 256, align: 64, elements: !1449)
!1449 = !{!1450}
!1450 = !DISubrange(count: 4)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1434, file: !4, line: 3904, baseType: !1452, size: 128, align: 32, offset: 1216)
!1452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 128, align: 32, elements: !1449)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1434, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1434, file: !4, line: 3908, baseType: !1455, size: 64, align: 64, offset: 1408)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1434, file: !4, line: 3915, baseType: !1455, size: 64, align: 64, offset: 1472)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1434, file: !4, line: 3917, baseType: !944, size: 32, align: 32, offset: 1536)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1421, file: !4, line: 3926, baseType: !946, size: 64, align: 64, offset: 192)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1359, file: !4, line: 3564, baseType: !1460, size: 64, align: 64, offset: 1344)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DISubroutineType(types: !1462)
!1462 = !{!944, !1349, !1101, !1463, !1465}
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1164)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1359, file: !4, line: 3566, baseType: !1467, size: 64, align: 64, offset: 1408)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DISubroutineType(types: !1469)
!1469 = !{!944, !1349, !983, !1465, !1101}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1359, file: !4, line: 3567, baseType: !1396, size: 64, align: 64, offset: 1472)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1359, file: !4, line: 3576, baseType: !1472, size: 64, align: 64, offset: 1536)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{!944, !1349, !1463}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1359, file: !4, line: 3577, baseType: !1476, size: 64, align: 64, offset: 1600)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{!944, !1349, !1101}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1359, file: !4, line: 3584, baseType: !1480, size: 64, align: 64, offset: 1664)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DISubroutineType(types: !1482)
!1482 = !{!944, !1349, !1163}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1359, file: !4, line: 3589, baseType: !1484, size: 64, align: 64, offset: 1728)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{null, !1349}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1359, file: !4, line: 3594, baseType: !944, size: 32, align: 32, offset: 1792)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1359, file: !4, line: 3600, baseType: !956, size: 64, align: 64, offset: 1856)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1359, file: !4, line: 3609, baseType: !1490, size: 64, align: 64, offset: 1920)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1493)
!1493 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1351, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1351, file: !4, line: 1581, baseType: !945, size: 32, align: 32, offset: 224)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1351, file: !4, line: 1583, baseType: !983, size: 64, align: 64, offset: 256)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1351, file: !4, line: 1591, baseType: !1498, size: 64, align: 64, offset: 320)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1351, file: !4, line: 1598, baseType: !983, size: 64, align: 64, offset: 384)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1351, file: !4, line: 1606, baseType: !946, size: 64, align: 64, offset: 448)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1351, file: !4, line: 1614, baseType: !944, size: 32, align: 32, offset: 512)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1351, file: !4, line: 1622, baseType: !944, size: 32, align: 32, offset: 544)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1351, file: !4, line: 1628, baseType: !944, size: 32, align: 32, offset: 576)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1351, file: !4, line: 1636, baseType: !944, size: 32, align: 32, offset: 608)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1351, file: !4, line: 1643, baseType: !944, size: 32, align: 32, offset: 640)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1351, file: !4, line: 1657, baseType: !1116, size: 64, align: 64, offset: 704)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1351, file: !4, line: 1658, baseType: !944, size: 32, align: 32, offset: 768)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1351, file: !4, line: 1679, baseType: !1001, size: 64, align: 32, offset: 800)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1351, file: !4, line: 1688, baseType: !944, size: 32, align: 32, offset: 864)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1351, file: !4, line: 1712, baseType: !944, size: 32, align: 32, offset: 896)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1351, file: !4, line: 1729, baseType: !944, size: 32, align: 32, offset: 928)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1351, file: !4, line: 1729, baseType: !944, size: 32, align: 32, offset: 960)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1351, file: !4, line: 1744, baseType: !944, size: 32, align: 32, offset: 992)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1351, file: !4, line: 1744, baseType: !944, size: 32, align: 32, offset: 1024)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1351, file: !4, line: 1751, baseType: !944, size: 32, align: 32, offset: 1056)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1351, file: !4, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1351, file: !4, line: 1791, baseType: !1519, size: 64, align: 64, offset: 1152)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DISubroutineType(types: !1521)
!1521 = !{null, !1522, !1463, !1465, !944, !944, !944}
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1351, file: !4, line: 1808, baseType: !1524, size: 64, align: 64, offset: 1216)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DISubroutineType(types: !1526)
!1526 = !{!667, !1522, !1370}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1351, file: !4, line: 1816, baseType: !944, size: 32, align: 32, offset: 1280)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1351, file: !4, line: 1825, baseType: !1529, size: 32, align: 32, offset: 1312)
!1529 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1351, file: !4, line: 1830, baseType: !944, size: 32, align: 32, offset: 1344)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1351, file: !4, line: 1838, baseType: !1529, size: 32, align: 32, offset: 1376)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1351, file: !4, line: 1846, baseType: !944, size: 32, align: 32, offset: 1408)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1351, file: !4, line: 1851, baseType: !944, size: 32, align: 32, offset: 1440)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1351, file: !4, line: 1861, baseType: !1529, size: 32, align: 32, offset: 1472)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1351, file: !4, line: 1868, baseType: !1529, size: 32, align: 32, offset: 1504)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1351, file: !4, line: 1875, baseType: !1529, size: 32, align: 32, offset: 1536)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1351, file: !4, line: 1882, baseType: !1529, size: 32, align: 32, offset: 1568)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1351, file: !4, line: 1889, baseType: !1529, size: 32, align: 32, offset: 1600)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1351, file: !4, line: 1896, baseType: !1529, size: 32, align: 32, offset: 1632)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1351, file: !4, line: 1903, baseType: !1529, size: 32, align: 32, offset: 1664)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1351, file: !4, line: 1910, baseType: !944, size: 32, align: 32, offset: 1696)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1351, file: !4, line: 1915, baseType: !944, size: 32, align: 32, offset: 1728)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1351, file: !4, line: 1926, baseType: !1465, size: 64, align: 64, offset: 1792)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1351, file: !4, line: 1935, baseType: !1001, size: 64, align: 32, offset: 1856)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1351, file: !4, line: 1942, baseType: !944, size: 32, align: 32, offset: 1920)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1351, file: !4, line: 1948, baseType: !944, size: 32, align: 32, offset: 1952)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1351, file: !4, line: 1954, baseType: !944, size: 32, align: 32, offset: 1984)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1351, file: !4, line: 1960, baseType: !944, size: 32, align: 32, offset: 2016)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1351, file: !4, line: 1984, baseType: !944, size: 32, align: 32, offset: 2048)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1351, file: !4, line: 1991, baseType: !944, size: 32, align: 32, offset: 2080)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1351, file: !4, line: 1996, baseType: !944, size: 32, align: 32, offset: 2112)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1351, file: !4, line: 2004, baseType: !944, size: 32, align: 32, offset: 2144)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1351, file: !4, line: 2011, baseType: !944, size: 32, align: 32, offset: 2176)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1351, file: !4, line: 2018, baseType: !944, size: 32, align: 32, offset: 2208)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1351, file: !4, line: 2027, baseType: !944, size: 32, align: 32, offset: 2240)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1351, file: !4, line: 2034, baseType: !944, size: 32, align: 32, offset: 2272)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1351, file: !4, line: 2044, baseType: !944, size: 32, align: 32, offset: 2304)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1351, file: !4, line: 2054, baseType: !1559, size: 64, align: 64, offset: 2368)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1351, file: !4, line: 2061, baseType: !1559, size: 64, align: 64, offset: 2432)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1351, file: !4, line: 2066, baseType: !944, size: 32, align: 32, offset: 2496)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1351, file: !4, line: 2070, baseType: !944, size: 32, align: 32, offset: 2528)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1351, file: !4, line: 2078, baseType: !944, size: 32, align: 32, offset: 2560)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1351, file: !4, line: 2085, baseType: !944, size: 32, align: 32, offset: 2592)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1351, file: !4, line: 2092, baseType: !944, size: 32, align: 32, offset: 2624)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1351, file: !4, line: 2099, baseType: !944, size: 32, align: 32, offset: 2656)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1351, file: !4, line: 2106, baseType: !944, size: 32, align: 32, offset: 2688)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1351, file: !4, line: 2113, baseType: !944, size: 32, align: 32, offset: 2720)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1351, file: !4, line: 2120, baseType: !944, size: 32, align: 32, offset: 2752)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1351, file: !4, line: 2125, baseType: !944, size: 32, align: 32, offset: 2784)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1351, file: !4, line: 2133, baseType: !944, size: 32, align: 32, offset: 2816)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1351, file: !4, line: 2140, baseType: !944, size: 32, align: 32, offset: 2848)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1351, file: !4, line: 2145, baseType: !944, size: 32, align: 32, offset: 2880)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1351, file: !4, line: 2153, baseType: !944, size: 32, align: 32, offset: 2912)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1351, file: !4, line: 2158, baseType: !944, size: 32, align: 32, offset: 2944)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1351, file: !4, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1351, file: !4, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1351, file: !4, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1351, file: !4, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1351, file: !4, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1351, file: !4, line: 2203, baseType: !944, size: 32, align: 32, offset: 3136)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1351, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1351, file: !4, line: 2212, baseType: !944, size: 32, align: 32, offset: 3200)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1351, file: !4, line: 2213, baseType: !944, size: 32, align: 32, offset: 3232)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1351, file: !4, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1351, file: !4, line: 2232, baseType: !944, size: 32, align: 32, offset: 3296)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1351, file: !4, line: 2243, baseType: !944, size: 32, align: 32, offset: 3328)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1351, file: !4, line: 2249, baseType: !944, size: 32, align: 32, offset: 3360)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1351, file: !4, line: 2256, baseType: !944, size: 32, align: 32, offset: 3392)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1351, file: !4, line: 2263, baseType: !1191, size: 64, align: 64, offset: 3456)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1351, file: !4, line: 2270, baseType: !1191, size: 64, align: 64, offset: 3520)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1351, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1351, file: !4, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1351, file: !4, line: 2367, baseType: !1595, size: 64, align: 64, offset: 3648)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64, align: 64)
!1596 = !DISubroutineType(types: !1597)
!1597 = !{!944, !1522, !1163, !944}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1351, file: !4, line: 2383, baseType: !944, size: 32, align: 32, offset: 3712)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1351, file: !4, line: 2386, baseType: !1529, size: 32, align: 32, offset: 3744)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1351, file: !4, line: 2387, baseType: !1529, size: 32, align: 32, offset: 3776)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1351, file: !4, line: 2394, baseType: !944, size: 32, align: 32, offset: 3808)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1351, file: !4, line: 2401, baseType: !944, size: 32, align: 32, offset: 3840)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1351, file: !4, line: 2408, baseType: !944, size: 32, align: 32, offset: 3872)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1351, file: !4, line: 2415, baseType: !944, size: 32, align: 32, offset: 3904)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1351, file: !4, line: 2422, baseType: !944, size: 32, align: 32, offset: 3936)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1351, file: !4, line: 2423, baseType: !1607, size: 64, align: 64, offset: 3968)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1609)
!1609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1610)
!1610 = !{!1611, !1612, !1613, !1614}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1609, file: !4, line: 827, baseType: !944, size: 32, align: 32)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1609, file: !4, line: 828, baseType: !944, size: 32, align: 32, offset: 32)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1609, file: !4, line: 829, baseType: !944, size: 32, align: 32, offset: 64)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1609, file: !4, line: 830, baseType: !1529, size: 32, align: 32, offset: 96)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1351, file: !4, line: 2430, baseType: !946, size: 64, align: 64, offset: 4032)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1351, file: !4, line: 2437, baseType: !946, size: 64, align: 64, offset: 4096)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1351, file: !4, line: 2444, baseType: !1529, size: 32, align: 32, offset: 4160)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1351, file: !4, line: 2451, baseType: !1529, size: 32, align: 32, offset: 4192)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1351, file: !4, line: 2458, baseType: !944, size: 32, align: 32, offset: 4224)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1351, file: !4, line: 2469, baseType: !944, size: 32, align: 32, offset: 4256)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1351, file: !4, line: 2475, baseType: !944, size: 32, align: 32, offset: 4288)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1351, file: !4, line: 2481, baseType: !944, size: 32, align: 32, offset: 4320)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1351, file: !4, line: 2485, baseType: !944, size: 32, align: 32, offset: 4352)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1351, file: !4, line: 2489, baseType: !944, size: 32, align: 32, offset: 4384)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1351, file: !4, line: 2493, baseType: !944, size: 32, align: 32, offset: 4416)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1351, file: !4, line: 2501, baseType: !944, size: 32, align: 32, offset: 4448)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1351, file: !4, line: 2506, baseType: !944, size: 32, align: 32, offset: 4480)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1351, file: !4, line: 2510, baseType: !944, size: 32, align: 32, offset: 4512)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1351, file: !4, line: 2514, baseType: !946, size: 64, align: 64, offset: 4544)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1351, file: !4, line: 2528, baseType: !1631, size: 64, align: 64, offset: 4608)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64, align: 64)
!1632 = !DISubroutineType(types: !1633)
!1633 = !{null, !1522, !983, !944, !944}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1351, file: !4, line: 2534, baseType: !944, size: 32, align: 32, offset: 4672)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1351, file: !4, line: 2545, baseType: !944, size: 32, align: 32, offset: 4704)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1351, file: !4, line: 2547, baseType: !944, size: 32, align: 32, offset: 4736)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1351, file: !4, line: 2549, baseType: !944, size: 32, align: 32, offset: 4768)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1351, file: !4, line: 2551, baseType: !944, size: 32, align: 32, offset: 4800)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1351, file: !4, line: 2553, baseType: !944, size: 32, align: 32, offset: 4832)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1351, file: !4, line: 2555, baseType: !944, size: 32, align: 32, offset: 4864)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1351, file: !4, line: 2557, baseType: !944, size: 32, align: 32, offset: 4896)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1351, file: !4, line: 2559, baseType: !944, size: 32, align: 32, offset: 4928)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1351, file: !4, line: 2563, baseType: !944, size: 32, align: 32, offset: 4960)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1351, file: !4, line: 2571, baseType: !1455, size: 64, align: 64, offset: 4992)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1351, file: !4, line: 2579, baseType: !1455, size: 64, align: 64, offset: 5056)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1351, file: !4, line: 2586, baseType: !944, size: 32, align: 32, offset: 5120)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1351, file: !4, line: 2615, baseType: !944, size: 32, align: 32, offset: 5152)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1351, file: !4, line: 2627, baseType: !944, size: 32, align: 32, offset: 5184)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1351, file: !4, line: 2637, baseType: !944, size: 32, align: 32, offset: 5216)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1351, file: !4, line: 2681, baseType: !944, size: 32, align: 32, offset: 5248)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1351, file: !4, line: 2709, baseType: !946, size: 64, align: 64, offset: 5312)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1351, file: !4, line: 2716, baseType: !1653, size: 64, align: 64, offset: 5376)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1655)
!1655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1656)
!1656 = !{!1657, !1658, !1659, !1660, !1661, !1662, !1663, !1667, !1671, !1672, !1673, !1674, !1680, !1681, !1682, !1683, !1684}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1655, file: !4, line: 3642, baseType: !956, size: 64, align: 64)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1655, file: !4, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1655, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1655, file: !4, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1655, file: !4, line: 3669, baseType: !944, size: 32, align: 32, offset: 160)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1655, file: !4, line: 3682, baseType: !1480, size: 64, align: 64, offset: 192)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1655, file: !4, line: 3698, baseType: !1664, size: 64, align: 64, offset: 256)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DISubroutineType(types: !1666)
!1666 = !{!944, !1349, !1303, !1427}
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1655, file: !4, line: 3712, baseType: !1668, size: 64, align: 64, offset: 320)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{!944, !1349, !944, !1303, !1427}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1655, file: !4, line: 3726, baseType: !1664, size: 64, align: 64, offset: 384)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1655, file: !4, line: 3737, baseType: !1396, size: 64, align: 64, offset: 448)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1655, file: !4, line: 3746, baseType: !944, size: 32, align: 32, offset: 512)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1655, file: !4, line: 3757, baseType: !1675, size: 64, align: 64, offset: 576)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DISubroutineType(types: !1677)
!1677 = !{null, !1678}
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1655, file: !4, line: 3766, baseType: !1396, size: 64, align: 64, offset: 640)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1655, file: !4, line: 3774, baseType: !1396, size: 64, align: 64, offset: 704)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1655, file: !4, line: 3780, baseType: !944, size: 32, align: 32, offset: 768)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1655, file: !4, line: 3785, baseType: !944, size: 32, align: 32, offset: 800)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1655, file: !4, line: 3795, baseType: !1685, size: 64, align: 64, offset: 832)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DISubroutineType(types: !1687)
!1687 = !{!944, !1349, !1106}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1351, file: !4, line: 2728, baseType: !983, size: 64, align: 64, offset: 5440)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1351, file: !4, line: 2735, baseType: !1190, size: 512, align: 64, offset: 5504)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1351, file: !4, line: 2742, baseType: !944, size: 32, align: 32, offset: 6016)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1351, file: !4, line: 2755, baseType: !944, size: 32, align: 32, offset: 6048)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1351, file: !4, line: 2776, baseType: !944, size: 32, align: 32, offset: 6080)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1351, file: !4, line: 2783, baseType: !944, size: 32, align: 32, offset: 6112)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1351, file: !4, line: 2791, baseType: !944, size: 32, align: 32, offset: 6144)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1351, file: !4, line: 2802, baseType: !1163, size: 64, align: 64, offset: 6208)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1351, file: !4, line: 2811, baseType: !944, size: 32, align: 32, offset: 6272)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1351, file: !4, line: 2821, baseType: !944, size: 32, align: 32, offset: 6304)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1351, file: !4, line: 2830, baseType: !944, size: 32, align: 32, offset: 6336)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1351, file: !4, line: 2840, baseType: !944, size: 32, align: 32, offset: 6368)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1351, file: !4, line: 2851, baseType: !1701, size: 64, align: 64, offset: 6400)
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DISubroutineType(types: !1703)
!1703 = !{!944, !1522, !1704, !983, !1465, !944, !944}
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1705, size: 64, align: 64)
!1705 = !DISubroutineType(types: !1706)
!1706 = !{!944, !1522, !983}
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1351, file: !4, line: 2871, baseType: !1708, size: 64, align: 64, offset: 6464)
!1708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1709, size: 64, align: 64)
!1709 = !DISubroutineType(types: !1710)
!1710 = !{!944, !1522, !1711, !983, !1465, !944}
!1711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1712, size: 64, align: 64)
!1712 = !DISubroutineType(types: !1713)
!1713 = !{!944, !1522, !983, !944, !944}
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1351, file: !4, line: 2878, baseType: !944, size: 32, align: 32, offset: 6528)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1351, file: !4, line: 2885, baseType: !944, size: 32, align: 32, offset: 6560)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1351, file: !4, line: 3005, baseType: !944, size: 32, align: 32, offset: 6592)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1351, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1351, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1351, file: !4, line: 3027, baseType: !909, size: 32, align: 32, offset: 6688)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1351, file: !4, line: 3037, baseType: !1116, size: 64, align: 64, offset: 6720)
