; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--img2dec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--img2dec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, {}*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, {}*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, {}*, {}*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVProbeData = type { i8*, i8*, i32, i8* }

!984 = !DIEnumerator(name: "APP3", value: 227)
!985 = !DIEnumerator(name: "APP4", value: 228)
!986 = !DIEnumerator(name: "APP5", value: 229)
!987 = !DIEnumerator(name: "APP6", value: 230)
!988 = !DIEnumerator(name: "APP7", value: 231)
!989 = !DIEnumerator(name: "APP8", value: 232)
!990 = !DIEnumerator(name: "APP9", value: 233)
!991 = !DIEnumerator(name: "APP10", value: 234)
!992 = !DIEnumerator(name: "APP11", value: 235)
!993 = !DIEnumerator(name: "APP12", value: 236)
!994 = !DIEnumerator(name: "APP13", value: 237)
!995 = !DIEnumerator(name: "APP14", value: 238)
!996 = !DIEnumerator(name: "APP15", value: 239)
!997 = !DIEnumerator(name: "JPG0", value: 240)
!998 = !DIEnumerator(name: "JPG1", value: 241)
!999 = !DIEnumerator(name: "JPG2", value: 242)
!1000 = !DIEnumerator(name: "JPG3", value: 243)
!1001 = !DIEnumerator(name: "JPG4", value: 244)
!1002 = !DIEnumerator(name: "JPG5", value: 245)
!1003 = !DIEnumerator(name: "JPG6", value: 246)
!1004 = !DIEnumerator(name: "SOF48", value: 247)
!1005 = !DIEnumerator(name: "LSE", value: 248)
!1006 = !DIEnumerator(name: "JPG9", value: 249)
!1007 = !DIEnumerator(name: "JPG10", value: 250)
!1008 = !DIEnumerator(name: "JPG11", value: 251)
!1009 = !DIEnumerator(name: "JPG12", value: 252)
!1010 = !DIEnumerator(name: "JPG13", value: 253)
!1011 = !DIEnumerator(name: "COM", value: 254)
!1012 = !DIEnumerator(name: "TEM", value: 1)
!1013 = !{!1014, !1015, !1016, !1017, !1020, !1028, !1034, !1039}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1015 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1016 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1018, line: 40, baseType: !1019)
!1018 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1019 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !1023, line: 222, size: 16, align: 8, elements: !1024)
!1023 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1024 = !{!1025}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1022, file: !1023, line: 222, baseType: !1026, size: 16, align: 16)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1018, line: 49, baseType: !1027)
!1027 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1023, line: 221, size: 32, align: 8, elements: !1031)
!1031 = !{!1032}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1030, file: !1023, line: 221, baseType: !1033, size: 32, align: 32)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1018, line: 51, baseType: !1016)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !1023, line: 220, size: 64, align: 8, elements: !1037)
!1037 = !{!1038}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1036, file: !1023, line: 220, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1018, line: 55, baseType: !1040)
!1040 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1041 = !{!1042, !1076, !2287, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351}
!1042 = distinct !DIGlobalVariable(name: "ff_img_options", scope: !0, file: !1043, line: 575, type: !1044, isLocal: false, isDefinition: true, variable: <{ %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption }>* @ff_img_options)
!1043 = !DIFile(filename: "libavformat/img2dec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1045, size: 8192, align: 64, elements: !1074)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1048)
!1048 = !{!1049, !1053, !1054, !1055, !1056, !1070, !1071, !1072, !1073}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1047, file: !4, line: 247, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1052 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1047, file: !4, line: 253, baseType: !1050, size: 64, align: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1047, file: !4, line: 259, baseType: !1015, size: 32, align: 32, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1047, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1047, file: !4, line: 271, baseType: !1057, size: 64, align: 64, offset: 192)
!1057 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1047, file: !4, line: 265, size: 64, align: 64, elements: !1058)
!1058 = !{!1059, !1060, !1062, !1063}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1057, file: !4, line: 266, baseType: !1017, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1057, file: !4, line: 267, baseType: !1061, size: 64, align: 64)
!1061 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1057, file: !4, line: 268, baseType: !1050, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1057, file: !4, line: 270, baseType: !1064, size: 64, align: 32)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1065, line: 61, baseType: !1066)
!1065 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1065, line: 58, size: 64, align: 32, elements: !1067)
!1067 = !{!1068, !1069}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1066, file: !1065, line: 59, baseType: !1015, size: 32, align: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1066, file: !1065, line: 60, baseType: !1015, size: 32, align: 32, offset: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1047, file: !4, line: 272, baseType: !1061, size: 64, align: 64, offset: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1047, file: !4, line: 273, baseType: !1061, size: 64, align: 64, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1047, file: !4, line: 275, baseType: !1015, size: 32, align: 32, offset: 384)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1047, file: !4, line: 300, baseType: !1050, size: 64, align: 64, offset: 448)
!1074 = !{!1075}
!1075 = !DISubrange(count: 16)
!1076 = distinct !DIGlobalVariable(name: "ff_image2_demuxer", scope: !0, file: !1043, line: 596, type: !1077, isLocal: false, isDefinition: true, variable: { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }* @ff_image2_demuxer)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1079)
!1079 = !{!1080, !1081, !1082, !1083, !1084, !1094, !1149, !1150, !1152, !1153, !1154, !1168, !2268, !2269, !2270, !2274, !2278, !2279, !2280, !2284, !2285, !2286}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1078, file: !919, line: 638, baseType: !1050, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1078, file: !919, line: 645, baseType: !1050, size: 64, align: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1078, file: !919, line: 652, baseType: !1015, size: 32, align: 32, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1078, file: !919, line: 659, baseType: !1050, size: 64, align: 64, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1078, file: !919, line: 661, baseType: !1085, size: 64, align: 64, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1090, line: 44, size: 64, align: 32, elements: !1091)
!1090 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1091 = !{!1092, !1093}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1089, file: !1090, line: 45, baseType: !46, size: 32, align: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1089, file: !1090, line: 46, baseType: !1016, size: 32, align: 32, offset: 32)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1078, file: !919, line: 663, baseType: !1095, size: 64, align: 64, offset: 320)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !1099)
!1099 = !{!1100, !1101, !1105, !1108, !1109, !1110, !1111, !1115, !1121, !1123, !1127}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1098, file: !26, line: 72, baseType: !1050, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1098, file: !26, line: 78, baseType: !1102, size: 64, align: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!1050, !1014}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1098, file: !26, line: 85, baseType: !1106, size: 64, align: 64, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1047)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1098, file: !26, line: 93, baseType: !1015, size: 32, align: 32, offset: 192)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1098, file: !26, line: 99, baseType: !1015, size: 32, align: 32, offset: 224)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1098, file: !26, line: 108, baseType: !1015, size: 32, align: 32, offset: 256)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1098, file: !26, line: 113, baseType: !1112, size: 64, align: 64, offset: 320)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!1014, !1014, !1014}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1098, file: !26, line: 123, baseType: !1116, size: 64, align: 64, offset: 384)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!1119, !1119}
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1098)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1098, file: !26, line: 130, baseType: !1122, size: 32, align: 32, offset: 448)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1098, file: !26, line: 136, baseType: !1124, size: 64, align: 64, offset: 512)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!1122, !1014}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1098, file: !26, line: 142, baseType: !1128, size: 64, align: 64, offset: 576)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!1015, !1131, !1014, !1050, !1015}
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1134)
!1134 = !{!1135, !1147, !1148}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1133, file: !4, line: 360, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1139)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1140)
!1140 = !{!1141, !1142, !1143, !1144, !1145, !1146}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1139, file: !4, line: 307, baseType: !1050, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1139, file: !4, line: 313, baseType: !1061, size: 64, align: 64, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1139, file: !4, line: 313, baseType: !1061, size: 64, align: 64, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1139, file: !4, line: 318, baseType: !1061, size: 64, align: 64, offset: 192)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1139, file: !4, line: 318, baseType: !1061, size: 64, align: 64, offset: 256)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1139, file: !4, line: 323, baseType: !1015, size: 32, align: 32, offset: 320)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1133, file: !4, line: 364, baseType: !1015, size: 32, align: 32, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1133, file: !4, line: 368, baseType: !1015, size: 32, align: 32, offset: 96)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1078, file: !919, line: 670, baseType: !1050, size: 64, align: 64, offset: 384)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1078, file: !919, line: 679, baseType: !1151, size: 64, align: 64, offset: 448)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1078, file: !919, line: 684, baseType: !1015, size: 32, align: 32, offset: 512)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1078, file: !919, line: 689, baseType: !1015, size: 32, align: 32, offset: 544)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1078, file: !919, line: 696, baseType: !1155, size: 64, align: 64, offset: 576)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!1015, !1158}
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1161)
!1161 = !{!1162, !1163, !1166, !1167}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1160, file: !919, line: 449, baseType: !1050, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1160, file: !919, line: 450, baseType: !1164, size: 64, align: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1160, file: !919, line: 451, baseType: !1015, size: 32, align: 32, offset: 128)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1160, file: !919, line: 452, baseType: !1050, size: 64, align: 64, offset: 192)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1078, file: !919, line: 703, baseType: !1169, size: 64, align: 64, offset: 640)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!1015, !1172}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1174)
!1174 = !{!1175, !1176, !1177, !1367, !1368, !1433, !1434, !1435, !2125, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2179, !2180, !2181, !2182, !2183, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2234, !2235, !2238, !2239, !2240, !2241, !2242, !2243, !2245, !2246, !2247, !2248, !2256, !2257, !2261, !2265, !2266, !2267}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1173, file: !919, line: 1342, baseType: !1095, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1173, file: !919, line: 1349, baseType: !1151, size: 64, align: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1173, file: !919, line: 1356, baseType: !1178, size: 64, align: 64, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1180)
!1180 = !{!1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1234, !1235, !1239, !1243, !1248, !1254, !1342, !1348, !1354, !1355, !1356, !1357, !1361}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1179, file: !919, line: 498, baseType: !1050, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1179, file: !919, line: 504, baseType: !1050, size: 64, align: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1179, file: !919, line: 505, baseType: !1050, size: 64, align: 64, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1179, file: !919, line: 506, baseType: !1050, size: 64, align: 64, offset: 192)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1179, file: !919, line: 508, baseType: !46, size: 32, align: 32, offset: 256)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1179, file: !919, line: 509, baseType: !46, size: 32, align: 32, offset: 288)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1179, file: !919, line: 510, baseType: !46, size: 32, align: 32, offset: 320)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1179, file: !919, line: 517, baseType: !1015, size: 32, align: 32, offset: 352)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1179, file: !919, line: 523, baseType: !1085, size: 64, align: 64, offset: 384)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1179, file: !919, line: 526, baseType: !1095, size: 64, align: 64, offset: 448)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1179, file: !919, line: 535, baseType: !1178, size: 64, align: 64, offset: 512)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1179, file: !919, line: 539, baseType: !1015, size: 32, align: 32, offset: 576)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1179, file: !919, line: 541, baseType: !1169, size: 64, align: 64, offset: 640)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1179, file: !919, line: 549, baseType: !1195, size: 64, align: 64, offset: 704)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!1015, !1172, !1198}
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !47, line: 1499, baseType: !1200)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !47, line: 1445, size: 704, align: 64, elements: !1201)
!1201 = !{!1202, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1230, !1231, !1232, !1233}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1200, file: !47, line: 1451, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1205, line: 94, baseType: !1206)
!1205 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1205, line: 81, size: 192, align: 64, elements: !1207)
!1207 = !{!1208, !1212, !1215}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1206, file: !1205, line: 82, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1205, line: 73, baseType: !1211)
!1211 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1205, line: 73, flags: DIFlagFwdDecl)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1206, file: !1205, line: 89, baseType: !1213, size: 64, align: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1018, line: 48, baseType: !1165)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1206, file: !1205, line: 93, baseType: !1015, size: 32, align: 32, offset: 128)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1200, file: !47, line: 1461, baseType: !1017, size: 64, align: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1200, file: !47, line: 1467, baseType: !1017, size: 64, align: 64, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1200, file: !47, line: 1468, baseType: !1213, size: 64, align: 64, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1200, file: !47, line: 1469, baseType: !1015, size: 32, align: 32, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1200, file: !47, line: 1470, baseType: !1015, size: 32, align: 32, offset: 288)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1200, file: !47, line: 1474, baseType: !1015, size: 32, align: 32, offset: 320)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1200, file: !47, line: 1479, baseType: !1223, size: 64, align: 64, offset: 384)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !47, line: 1415, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !47, line: 1411, size: 128, align: 64, elements: !1226)
!1226 = !{!1227, !1228, !1229}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1225, file: !47, line: 1412, baseType: !1213, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1225, file: !47, line: 1413, baseType: !1015, size: 32, align: 32, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1225, file: !47, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1200, file: !47, line: 1480, baseType: !1015, size: 32, align: 32, offset: 448)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1200, file: !47, line: 1486, baseType: !1017, size: 64, align: 64, offset: 512)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1200, file: !47, line: 1488, baseType: !1017, size: 64, align: 64, offset: 576)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1200, file: !47, line: 1497, baseType: !1017, size: 64, align: 64, offset: 640)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1179, file: !919, line: 550, baseType: !1169, size: 64, align: 64, offset: 768)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1179, file: !919, line: 554, baseType: !1236, size: 64, align: 64, offset: 832)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!1015, !1172, !1198, !1198, !1015}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1179, file: !919, line: 563, baseType: !1240, size: 64, align: 64, offset: 896)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!1015, !46, !1015}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1179, file: !919, line: 565, baseType: !1244, size: 64, align: 64, offset: 960)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{null, !1172, !1015, !1247, !1247}
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1179, file: !919, line: 570, baseType: !1249, size: 64, align: 64, offset: 1024)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!1015, !1172, !1015, !1014, !1252}
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1253, line: 216, baseType: !1040)
!1253 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1179, file: !919, line: 581, baseType: !1255, size: 64, align: 64, offset: 1088)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!1015, !1172, !1015, !1258, !1016}
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1262)
!1262 = !{!1263, !1267, !1269, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1296, !1298, !1299, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1261, file: !548, line: 282, baseType: !1264, size: 512, align: 64)
!1264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1213, size: 512, align: 64, elements: !1265)
!1265 = !{!1266}
!1266 = !DISubrange(count: 8)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1261, file: !548, line: 299, baseType: !1268, size: 256, align: 32, offset: 512)
!1268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 256, align: 32, elements: !1265)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1261, file: !548, line: 315, baseType: !1270, size: 64, align: 64, offset: 768)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1261, file: !548, line: 326, baseType: !1015, size: 32, align: 32, offset: 832)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1261, file: !548, line: 326, baseType: !1015, size: 32, align: 32, offset: 864)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1261, file: !548, line: 334, baseType: !1015, size: 32, align: 32, offset: 896)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1261, file: !548, line: 341, baseType: !1015, size: 32, align: 32, offset: 928)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1261, file: !548, line: 346, baseType: !1015, size: 32, align: 32, offset: 960)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1261, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1261, file: !548, line: 356, baseType: !1064, size: 64, align: 32, offset: 1024)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1261, file: !548, line: 361, baseType: !1017, size: 64, align: 64, offset: 1088)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1261, file: !548, line: 369, baseType: !1017, size: 64, align: 64, offset: 1152)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1261, file: !548, line: 377, baseType: !1017, size: 64, align: 64, offset: 1216)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1261, file: !548, line: 382, baseType: !1015, size: 32, align: 32, offset: 1280)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1261, file: !548, line: 386, baseType: !1015, size: 32, align: 32, offset: 1312)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1261, file: !548, line: 391, baseType: !1015, size: 32, align: 32, offset: 1344)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1261, file: !548, line: 396, baseType: !1014, size: 64, align: 64, offset: 1408)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1261, file: !548, line: 403, baseType: !1286, size: 512, align: 64, offset: 1472)
!1286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 512, align: 64, elements: !1265)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1261, file: !548, line: 410, baseType: !1015, size: 32, align: 32, offset: 1984)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1261, file: !548, line: 415, baseType: !1015, size: 32, align: 32, offset: 2016)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1261, file: !548, line: 420, baseType: !1015, size: 32, align: 32, offset: 2048)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1261, file: !548, line: 425, baseType: !1015, size: 32, align: 32, offset: 2080)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1261, file: !548, line: 435, baseType: !1017, size: 64, align: 64, offset: 2112)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1261, file: !548, line: 440, baseType: !1015, size: 32, align: 32, offset: 2176)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1261, file: !548, line: 445, baseType: !1039, size: 64, align: 64, offset: 2240)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1261, file: !548, line: 459, baseType: !1295, size: 512, align: 64, offset: 2304)
!1295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1203, size: 512, align: 64, elements: !1265)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1261, file: !548, line: 473, baseType: !1297, size: 64, align: 64, offset: 2816)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1261, file: !548, line: 477, baseType: !1015, size: 32, align: 32, offset: 2880)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1261, file: !548, line: 479, baseType: !1300, size: 64, align: 64, offset: 2944)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1304)
!1304 = !{!1305, !1306, !1307, !1308, !1313}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1303, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1303, file: !548, line: 203, baseType: !1213, size: 64, align: 64, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1303, file: !548, line: 204, baseType: !1015, size: 32, align: 32, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1303, file: !548, line: 205, baseType: !1309, size: 64, align: 64, offset: 192)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1311, line: 86, baseType: !1312)
!1311 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1312 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1311, line: 86, flags: DIFlagFwdDecl)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1303, file: !548, line: 206, baseType: !1203, size: 64, align: 64, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1261, file: !548, line: 480, baseType: !1015, size: 32, align: 32, offset: 3008)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1261, file: !548, line: 505, baseType: !1015, size: 32, align: 32, offset: 3040)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1261, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1261, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1261, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1261, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1261, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1261, file: !548, line: 532, baseType: !1017, size: 64, align: 64, offset: 3264)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1261, file: !548, line: 539, baseType: !1017, size: 64, align: 64, offset: 3328)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1261, file: !548, line: 547, baseType: !1017, size: 64, align: 64, offset: 3392)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1261, file: !548, line: 554, baseType: !1309, size: 64, align: 64, offset: 3456)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1261, file: !548, line: 563, baseType: !1015, size: 32, align: 32, offset: 3520)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1261, file: !548, line: 572, baseType: !1015, size: 32, align: 32, offset: 3552)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1261, file: !548, line: 581, baseType: !1015, size: 32, align: 32, offset: 3584)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1261, file: !548, line: 588, baseType: !1329, size: 64, align: 64, offset: 3648)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1018, line: 36, baseType: !1331)
!1331 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1261, file: !548, line: 593, baseType: !1015, size: 32, align: 32, offset: 3712)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1261, file: !548, line: 596, baseType: !1015, size: 32, align: 32, offset: 3744)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1261, file: !548, line: 599, baseType: !1203, size: 64, align: 64, offset: 3776)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1261, file: !548, line: 605, baseType: !1203, size: 64, align: 64, offset: 3840)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1261, file: !548, line: 616, baseType: !1203, size: 64, align: 64, offset: 3904)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1261, file: !548, line: 626, baseType: !1252, size: 64, align: 64, offset: 3968)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1261, file: !548, line: 627, baseType: !1252, size: 64, align: 64, offset: 4032)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1261, file: !548, line: 628, baseType: !1252, size: 64, align: 64, offset: 4096)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1261, file: !548, line: 629, baseType: !1252, size: 64, align: 64, offset: 4160)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1261, file: !548, line: 645, baseType: !1203, size: 64, align: 64, offset: 4224)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1179, file: !919, line: 587, baseType: !1343, size: 64, align: 64, offset: 1152)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{!1015, !1172, !1346}
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1179, file: !919, line: 592, baseType: !1349, size: 64, align: 64, offset: 1216)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!1015, !1172, !1352}
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1179, file: !919, line: 597, baseType: !1349, size: 64, align: 64, offset: 1280)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1179, file: !919, line: 598, baseType: !46, size: 32, align: 32, offset: 1344)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1179, file: !919, line: 608, baseType: !1169, size: 64, align: 64, offset: 1408)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1179, file: !919, line: 617, baseType: !1358, size: 64, align: 64, offset: 1472)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DISubroutineType(types: !1360)
!1360 = !{null, !1172}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1179, file: !919, line: 623, baseType: !1362, size: 64, align: 64, offset: 1536)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{!1015, !1172, !1365}
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1199)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1173, file: !919, line: 1365, baseType: !1014, size: 64, align: 64, offset: 192)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1173, file: !919, line: 1379, baseType: !1369, size: 64, align: 64, offset: 256)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1372)
!1372 = !{!1373, !1374, !1375, !1376, !1377, !1378, !1379, !1383, !1384, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1400, !1401, !1405, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1423, !1424, !1425, !1426, !1430, !1431, !1432}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1371, file: !650, line: 174, baseType: !1095, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1371, file: !650, line: 226, baseType: !1164, size: 64, align: 64, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1371, file: !650, line: 227, baseType: !1015, size: 32, align: 32, offset: 128)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1371, file: !650, line: 228, baseType: !1164, size: 64, align: 64, offset: 192)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1371, file: !650, line: 229, baseType: !1164, size: 64, align: 64, offset: 256)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1371, file: !650, line: 233, baseType: !1014, size: 64, align: 64, offset: 320)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1371, file: !650, line: 235, baseType: !1380, size: 64, align: 64, offset: 384)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DISubroutineType(types: !1382)
!1382 = !{!1015, !1014, !1213, !1015}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1371, file: !650, line: 236, baseType: !1380, size: 64, align: 64, offset: 448)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1371, file: !650, line: 237, baseType: !1385, size: 64, align: 64, offset: 512)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DISubroutineType(types: !1387)
!1387 = !{!1017, !1014, !1017, !1015}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1371, file: !650, line: 238, baseType: !1017, size: 64, align: 64, offset: 576)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1371, file: !650, line: 239, baseType: !1015, size: 32, align: 32, offset: 640)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1371, file: !650, line: 240, baseType: !1015, size: 32, align: 32, offset: 672)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1371, file: !650, line: 241, baseType: !1015, size: 32, align: 32, offset: 704)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1371, file: !650, line: 242, baseType: !1040, size: 64, align: 64, offset: 768)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1371, file: !650, line: 243, baseType: !1164, size: 64, align: 64, offset: 832)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1371, file: !650, line: 244, baseType: !1395, size: 64, align: 64, offset: 896)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DISubroutineType(types: !1397)
!1397 = !{!1040, !1040, !1398, !1016}
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1214)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1371, file: !650, line: 245, baseType: !1015, size: 32, align: 32, offset: 960)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1371, file: !650, line: 249, baseType: !1402, size: 64, align: 64, offset: 1024)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DISubroutineType(types: !1404)
!1404 = !{!1015, !1014, !1015}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1371, file: !650, line: 255, baseType: !1406, size: 64, align: 64, offset: 1088)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DISubroutineType(types: !1408)
!1408 = !{!1017, !1014, !1015, !1017, !1015}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1371, file: !650, line: 260, baseType: !1015, size: 32, align: 32, offset: 1152)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1371, file: !650, line: 266, baseType: !1017, size: 64, align: 64, offset: 1216)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1371, file: !650, line: 273, baseType: !1015, size: 32, align: 32, offset: 1280)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1371, file: !650, line: 279, baseType: !1017, size: 64, align: 64, offset: 1344)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1371, file: !650, line: 285, baseType: !1015, size: 32, align: 32, offset: 1408)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1371, file: !650, line: 291, baseType: !1015, size: 32, align: 32, offset: 1440)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1371, file: !650, line: 298, baseType: !1015, size: 32, align: 32, offset: 1472)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1371, file: !650, line: 304, baseType: !1015, size: 32, align: 32, offset: 1504)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1371, file: !650, line: 309, baseType: !1050, size: 64, align: 64, offset: 1536)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1371, file: !650, line: 314, baseType: !1050, size: 64, align: 64, offset: 1600)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1371, file: !650, line: 319, baseType: !1420, size: 64, align: 64, offset: 1664)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DISubroutineType(types: !1422)
!1422 = !{!1015, !1014, !1213, !1015, !649, !1017}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1371, file: !650, line: 326, baseType: !1015, size: 32, align: 32, offset: 1728)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1371, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1371, file: !650, line: 332, baseType: !1017, size: 64, align: 64, offset: 1792)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1371, file: !650, line: 338, baseType: !1427, size: 64, align: 64, offset: 1856)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!1015, !1014}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1371, file: !650, line: 340, baseType: !1017, size: 64, align: 64, offset: 1920)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1371, file: !650, line: 346, baseType: !1164, size: 64, align: 64, offset: 1984)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1371, file: !650, line: 351, baseType: !1015, size: 32, align: 32, offset: 2048)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1173, file: !919, line: 1386, baseType: !1015, size: 32, align: 32, offset: 320)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1173, file: !919, line: 1393, baseType: !1016, size: 32, align: 32, offset: 352)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1173, file: !919, line: 1405, baseType: !1436, size: 64, align: 64, offset: 384)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1439)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1440)
!1440 = !{!1441, !1442, !1443, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1911, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !2011, !2017, !2018, !2022, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2054, !2055, !2056, !2057, !2058, !2059}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1439, file: !919, line: 866, baseType: !1015, size: 32, align: 32)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1439, file: !919, line: 872, baseType: !1015, size: 32, align: 32, offset: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1439, file: !919, line: 878, baseType: !1444, size: 64, align: 64, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !47, line: 3360, baseType: !1446)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !47, line: 1556, size: 8448, align: 64, elements: !1447)
!1447 = !{!1448, !1449, !1450, !1451, !1586, !1587, !1588, !1589, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1615, !1619, !1620, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1799, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1446, file: !47, line: 1561, baseType: !1095, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1446, file: !47, line: 1562, baseType: !1015, size: 32, align: 32, offset: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1446, file: !47, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1446, file: !47, line: 1565, baseType: !1452, size: 64, align: 64, offset: 128)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1454)
!1454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !47, line: 3468, size: 1984, align: 64, elements: !1455)
!1455 = !{!1456, !1457, !1458, !1459, !1460, !1461, !1464, !1467, !1470, !1473, !1476, !1477, !1478, !1486, !1487, !1488, !1490, !1494, !1500, !1505, !1509, !1510, !1551, !1558, !1562, !1563, !1567, !1571, !1575, !1579, !1580, !1581}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1454, file: !47, line: 3475, baseType: !1050, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1454, file: !47, line: 3480, baseType: !1050, size: 64, align: 64, offset: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1454, file: !47, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1454, file: !47, line: 3482, baseType: !46, size: 32, align: 32, offset: 160)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1454, file: !47, line: 3487, baseType: !1015, size: 32, align: 32, offset: 192)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1454, file: !47, line: 3488, baseType: !1462, size: 64, align: 64, offset: 256)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1064)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1454, file: !47, line: 3489, baseType: !1465, size: 64, align: 64, offset: 320)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1454, file: !47, line: 3490, baseType: !1468, size: 64, align: 64, offset: 384)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1454, file: !47, line: 3491, baseType: !1471, size: 64, align: 64, offset: 448)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1454, file: !47, line: 3492, baseType: !1474, size: 64, align: 64, offset: 512)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64, align: 64)
!1475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1454, file: !47, line: 3493, baseType: !1214, size: 8, align: 8, offset: 576)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1454, file: !47, line: 3494, baseType: !1095, size: 64, align: 64, offset: 640)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1454, file: !47, line: 3495, baseType: !1479, size: 64, align: 64, offset: 704)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1481)
!1481 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !47, line: 3404, baseType: !1482)
!1482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !47, line: 3401, size: 128, align: 64, elements: !1483)
!1483 = !{!1484, !1485}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1482, file: !47, line: 3402, baseType: !1015, size: 32, align: 32)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1482, file: !47, line: 3403, baseType: !1050, size: 64, align: 64, offset: 64)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1454, file: !47, line: 3507, baseType: !1050, size: 64, align: 64, offset: 768)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1454, file: !47, line: 3516, baseType: !1015, size: 32, align: 32, offset: 832)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1454, file: !47, line: 3517, baseType: !1489, size: 64, align: 64, offset: 896)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1454, file: !47, line: 3527, baseType: !1491, size: 64, align: 64, offset: 960)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!1015, !1444}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1454, file: !47, line: 3535, baseType: !1495, size: 64, align: 64, offset: 1024)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!1015, !1444, !1498}
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1445)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1454, file: !47, line: 3541, baseType: !1501, size: 64, align: 64, offset: 1088)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1503)
!1503 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !47, line: 3461, baseType: !1504)
!1504 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !47, line: 3461, flags: DIFlagFwdDecl)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1454, file: !47, line: 3549, baseType: !1506, size: 64, align: 64, offset: 1152)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{null, !1489}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1454, file: !47, line: 3551, baseType: !1491, size: 64, align: 64, offset: 1216)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1454, file: !47, line: 3552, baseType: !1511, size: 64, align: 64, offset: 1280)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{!1015, !1444, !1213, !1015, !1514}
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1516)
!1516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !47, line: 3920, size: 256, align: 64, elements: !1517)
!1517 = !{!1518, !1519, !1520, !1521, !1522, !1550}
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1516, file: !47, line: 3921, baseType: !1026, size: 16, align: 16)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1516, file: !47, line: 3922, baseType: !1033, size: 32, align: 32, offset: 32)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1516, file: !47, line: 3923, baseType: !1033, size: 32, align: 32, offset: 64)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1516, file: !47, line: 3924, baseType: !1016, size: 32, align: 32, offset: 96)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1516, file: !47, line: 3925, baseType: !1523, size: 64, align: 64, offset: 128)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !47, line: 3918, baseType: !1526)
!1526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !47, line: 3885, size: 1600, align: 64, elements: !1527)
!1527 = !{!1528, !1529, !1530, !1531, !1532, !1533, !1539, !1543, !1545, !1546, !1548, !1549}
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1526, file: !47, line: 3886, baseType: !1015, size: 32, align: 32)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1526, file: !47, line: 3887, baseType: !1015, size: 32, align: 32, offset: 32)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1526, file: !47, line: 3888, baseType: !1015, size: 32, align: 32, offset: 64)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1526, file: !47, line: 3889, baseType: !1015, size: 32, align: 32, offset: 96)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1526, file: !47, line: 3890, baseType: !1015, size: 32, align: 32, offset: 128)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1526, file: !47, line: 3897, baseType: !1534, size: 768, align: 64, offset: 192)
!1534 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !47, line: 3858, baseType: !1535)
!1535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !47, line: 3853, size: 768, align: 64, elements: !1536)
!1536 = !{!1537, !1538}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1535, file: !47, line: 3855, baseType: !1264, size: 512, align: 64)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1535, file: !47, line: 3857, baseType: !1268, size: 256, align: 32, offset: 512)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1526, file: !47, line: 3903, baseType: !1540, size: 256, align: 64, offset: 960)
!1540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1213, size: 256, align: 64, elements: !1541)
!1541 = !{!1542}
!1542 = !DISubrange(count: 4)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1526, file: !47, line: 3904, baseType: !1544, size: 128, align: 32, offset: 1216)
!1544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 128, align: 32, elements: !1541)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1526, file: !47, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1526, file: !47, line: 3908, baseType: !1547, size: 64, align: 64, offset: 1408)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1526, file: !47, line: 3915, baseType: !1547, size: 64, align: 64, offset: 1472)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1526, file: !47, line: 3917, baseType: !1015, size: 32, align: 32, offset: 1536)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1516, file: !47, line: 3926, baseType: !1017, size: 64, align: 64, offset: 192)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1454, file: !47, line: 3564, baseType: !1552, size: 64, align: 64, offset: 1344)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DISubroutineType(types: !1554)
!1554 = !{!1015, !1444, !1198, !1555, !1557}
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1260)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1454, file: !47, line: 3566, baseType: !1559, size: 64, align: 64, offset: 1408)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64, align: 64)
!1560 = !DISubroutineType(types: !1561)
!1561 = !{!1015, !1444, !1014, !1557, !1198}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1454, file: !47, line: 3567, baseType: !1491, size: 64, align: 64, offset: 1472)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1454, file: !47, line: 3576, baseType: !1564, size: 64, align: 64, offset: 1536)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DISubroutineType(types: !1566)
!1566 = !{!1015, !1444, !1555}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1454, file: !47, line: 3577, baseType: !1568, size: 64, align: 64, offset: 1600)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DISubroutineType(types: !1570)
!1570 = !{!1015, !1444, !1198}
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1454, file: !47, line: 3584, baseType: !1572, size: 64, align: 64, offset: 1664)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DISubroutineType(types: !1574)
!1574 = !{!1015, !1444, !1259}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1454, file: !47, line: 3589, baseType: !1576, size: 64, align: 64, offset: 1728)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{null, !1444}
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1454, file: !47, line: 3594, baseType: !1015, size: 32, align: 32, offset: 1792)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1454, file: !47, line: 3600, baseType: !1050, size: 64, align: 64, offset: 1856)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1454, file: !47, line: 3609, baseType: !1582, size: 64, align: 64, offset: 1920)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1585)
!1585 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !47, line: 3609, flags: DIFlagFwdDecl)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1446, file: !47, line: 1566, baseType: !46, size: 32, align: 32, offset: 192)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1446, file: !47, line: 1581, baseType: !1016, size: 32, align: 32, offset: 224)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1446, file: !47, line: 1583, baseType: !1014, size: 64, align: 64, offset: 256)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1446, file: !47, line: 1591, baseType: !1590, size: 64, align: 64, offset: 320)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !47, line: 1532, flags: DIFlagFwdDecl)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1446, file: !47, line: 1598, baseType: !1014, size: 64, align: 64, offset: 384)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1446, file: !47, line: 1606, baseType: !1017, size: 64, align: 64, offset: 448)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1446, file: !47, line: 1614, baseType: !1015, size: 32, align: 32, offset: 512)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1446, file: !47, line: 1622, baseType: !1015, size: 32, align: 32, offset: 544)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1446, file: !47, line: 1628, baseType: !1015, size: 32, align: 32, offset: 576)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1446, file: !47, line: 1636, baseType: !1015, size: 32, align: 32, offset: 608)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1446, file: !47, line: 1643, baseType: !1015, size: 32, align: 32, offset: 640)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1446, file: !47, line: 1657, baseType: !1213, size: 64, align: 64, offset: 704)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1446, file: !47, line: 1658, baseType: !1015, size: 32, align: 32, offset: 768)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1446, file: !47, line: 1679, baseType: !1064, size: 64, align: 32, offset: 800)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1446, file: !47, line: 1688, baseType: !1015, size: 32, align: 32, offset: 864)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1446, file: !47, line: 1712, baseType: !1015, size: 32, align: 32, offset: 896)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1446, file: !47, line: 1729, baseType: !1015, size: 32, align: 32, offset: 928)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1446, file: !47, line: 1729, baseType: !1015, size: 32, align: 32, offset: 960)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1446, file: !47, line: 1744, baseType: !1015, size: 32, align: 32, offset: 992)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1446, file: !47, line: 1744, baseType: !1015, size: 32, align: 32, offset: 1024)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1446, file: !47, line: 1751, baseType: !1015, size: 32, align: 32, offset: 1056)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1446, file: !47, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1446, file: !47, line: 1791, baseType: !1611, size: 64, align: 64, offset: 1152)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DISubroutineType(types: !1613)
!1613 = !{null, !1614, !1555, !1557, !1015, !1015, !1015}
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1446, file: !47, line: 1808, baseType: !1616, size: 64, align: 64, offset: 1216)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DISubroutineType(types: !1618)
!1618 = !{!667, !1614, !1465}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1446, file: !47, line: 1816, baseType: !1015, size: 32, align: 32, offset: 1280)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1446, file: !47, line: 1825, baseType: !1621, size: 32, align: 32, offset: 1312)
!1621 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1446, file: !47, line: 1830, baseType: !1015, size: 32, align: 32, offset: 1344)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1446, file: !47, line: 1838, baseType: !1621, size: 32, align: 32, offset: 1376)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1446, file: !47, line: 1846, baseType: !1015, size: 32, align: 32, offset: 1408)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1446, file: !47, line: 1851, baseType: !1015, size: 32, align: 32, offset: 1440)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1446, file: !47, line: 1861, baseType: !1621, size: 32, align: 32, offset: 1472)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1446, file: !47, line: 1868, baseType: !1621, size: 32, align: 32, offset: 1504)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1446, file: !47, line: 1875, baseType: !1621, size: 32, align: 32, offset: 1536)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1446, file: !47, line: 1882, baseType: !1621, size: 32, align: 32, offset: 1568)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1446, file: !47, line: 1889, baseType: !1621, size: 32, align: 32, offset: 1600)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1446, file: !47, line: 1896, baseType: !1621, size: 32, align: 32, offset: 1632)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1446, file: !47, line: 1903, baseType: !1621, size: 32, align: 32, offset: 1664)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1446, file: !47, line: 1910, baseType: !1015, size: 32, align: 32, offset: 1696)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1446, file: !47, line: 1915, baseType: !1015, size: 32, align: 32, offset: 1728)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1446, file: !47, line: 1926, baseType: !1557, size: 64, align: 64, offset: 1792)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1446, file: !47, line: 1935, baseType: !1064, size: 64, align: 32, offset: 1856)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1446, file: !47, line: 1942, baseType: !1015, size: 32, align: 32, offset: 1920)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1446, file: !47, line: 1948, baseType: !1015, size: 32, align: 32, offset: 1952)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1446, file: !47, line: 1954, baseType: !1015, size: 32, align: 32, offset: 1984)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1446, file: !47, line: 1960, baseType: !1015, size: 32, align: 32, offset: 2016)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1446, file: !47, line: 1984, baseType: !1015, size: 32, align: 32, offset: 2048)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1446, file: !47, line: 1991, baseType: !1015, size: 32, align: 32, offset: 2080)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1446, file: !47, line: 1996, baseType: !1015, size: 32, align: 32, offset: 2112)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1446, file: !47, line: 2004, baseType: !1015, size: 32, align: 32, offset: 2144)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1446, file: !47, line: 2011, baseType: !1015, size: 32, align: 32, offset: 2176)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1446, file: !47, line: 2018, baseType: !1015, size: 32, align: 32, offset: 2208)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1446, file: !47, line: 2027, baseType: !1015, size: 32, align: 32, offset: 2240)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1446, file: !47, line: 2034, baseType: !1015, size: 32, align: 32, offset: 2272)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1446, file: !47, line: 2044, baseType: !1015, size: 32, align: 32, offset: 2304)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1446, file: !47, line: 2054, baseType: !1651, size: 64, align: 64, offset: 2368)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1446, file: !47, line: 2061, baseType: !1651, size: 64, align: 64, offset: 2432)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1446, file: !47, line: 2066, baseType: !1015, size: 32, align: 32, offset: 2496)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1446, file: !47, line: 2070, baseType: !1015, size: 32, align: 32, offset: 2528)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1446, file: !47, line: 2078, baseType: !1015, size: 32, align: 32, offset: 2560)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1446, file: !47, line: 2085, baseType: !1015, size: 32, align: 32, offset: 2592)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1446, file: !47, line: 2092, baseType: !1015, size: 32, align: 32, offset: 2624)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1446, file: !47, line: 2099, baseType: !1015, size: 32, align: 32, offset: 2656)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1446, file: !47, line: 2106, baseType: !1015, size: 32, align: 32, offset: 2688)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1446, file: !47, line: 2113, baseType: !1015, size: 32, align: 32, offset: 2720)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1446, file: !47, line: 2120, baseType: !1015, size: 32, align: 32, offset: 2752)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1446, file: !47, line: 2125, baseType: !1015, size: 32, align: 32, offset: 2784)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1446, file: !47, line: 2133, baseType: !1015, size: 32, align: 32, offset: 2816)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1446, file: !47, line: 2140, baseType: !1015, size: 32, align: 32, offset: 2848)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1446, file: !47, line: 2145, baseType: !1015, size: 32, align: 32, offset: 2880)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1446, file: !47, line: 2153, baseType: !1015, size: 32, align: 32, offset: 2912)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1446, file: !47, line: 2158, baseType: !1015, size: 32, align: 32, offset: 2944)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1446, file: !47, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1446, file: !47, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1446, file: !47, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1446, file: !47, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1446, file: !47, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1446, file: !47, line: 2203, baseType: !1015, size: 32, align: 32, offset: 3136)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1446, file: !47, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1446, file: !47, line: 2212, baseType: !1015, size: 32, align: 32, offset: 3200)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1446, file: !47, line: 2213, baseType: !1015, size: 32, align: 32, offset: 3232)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1446, file: !47, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1446, file: !47, line: 2232, baseType: !1015, size: 32, align: 32, offset: 3296)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1446, file: !47, line: 2243, baseType: !1015, size: 32, align: 32, offset: 3328)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1446, file: !47, line: 2249, baseType: !1015, size: 32, align: 32, offset: 3360)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1446, file: !47, line: 2256, baseType: !1015, size: 32, align: 32, offset: 3392)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1446, file: !47, line: 2263, baseType: !1039, size: 64, align: 64, offset: 3456)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1446, file: !47, line: 2270, baseType: !1039, size: 64, align: 64, offset: 3520)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1446, file: !47, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1446, file: !47, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1446, file: !47, line: 2367, baseType: !1687, size: 64, align: 64, offset: 3648)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DISubroutineType(types: !1689)
!1689 = !{!1015, !1614, !1259, !1015}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1446, file: !47, line: 2383, baseType: !1015, size: 32, align: 32, offset: 3712)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1446, file: !47, line: 2386, baseType: !1621, size: 32, align: 32, offset: 3744)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1446, file: !47, line: 2387, baseType: !1621, size: 32, align: 32, offset: 3776)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1446, file: !47, line: 2394, baseType: !1015, size: 32, align: 32, offset: 3808)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1446, file: !47, line: 2401, baseType: !1015, size: 32, align: 32, offset: 3840)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1446, file: !47, line: 2408, baseType: !1015, size: 32, align: 32, offset: 3872)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1446, file: !47, line: 2415, baseType: !1015, size: 32, align: 32, offset: 3904)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1446, file: !47, line: 2422, baseType: !1015, size: 32, align: 32, offset: 3936)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1446, file: !47, line: 2423, baseType: !1699, size: 64, align: 64, offset: 3968)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !47, line: 831, baseType: !1701)
!1701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !47, line: 826, size: 128, align: 32, elements: !1702)
!1702 = !{!1703, !1704, !1705, !1706}
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1701, file: !47, line: 827, baseType: !1015, size: 32, align: 32)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1701, file: !47, line: 828, baseType: !1015, size: 32, align: 32, offset: 32)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1701, file: !47, line: 829, baseType: !1015, size: 32, align: 32, offset: 64)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1701, file: !47, line: 830, baseType: !1621, size: 32, align: 32, offset: 96)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1446, file: !47, line: 2430, baseType: !1017, size: 64, align: 64, offset: 4032)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1446, file: !47, line: 2437, baseType: !1017, size: 64, align: 64, offset: 4096)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1446, file: !47, line: 2444, baseType: !1621, size: 32, align: 32, offset: 4160)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1446, file: !47, line: 2451, baseType: !1621, size: 32, align: 32, offset: 4192)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1446, file: !47, line: 2458, baseType: !1015, size: 32, align: 32, offset: 4224)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1446, file: !47, line: 2469, baseType: !1015, size: 32, align: 32, offset: 4256)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1446, file: !47, line: 2475, baseType: !1015, size: 32, align: 32, offset: 4288)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1446, file: !47, line: 2481, baseType: !1015, size: 32, align: 32, offset: 4320)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1446, file: !47, line: 2485, baseType: !1015, size: 32, align: 32, offset: 4352)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1446, file: !47, line: 2489, baseType: !1015, size: 32, align: 32, offset: 4384)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1446, file: !47, line: 2493, baseType: !1015, size: 32, align: 32, offset: 4416)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1446, file: !47, line: 2501, baseType: !1015, size: 32, align: 32, offset: 4448)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1446, file: !47, line: 2506, baseType: !1015, size: 32, align: 32, offset: 4480)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1446, file: !47, line: 2510, baseType: !1015, size: 32, align: 32, offset: 4512)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1446, file: !47, line: 2514, baseType: !1017, size: 64, align: 64, offset: 4544)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1446, file: !47, line: 2528, baseType: !1723, size: 64, align: 64, offset: 4608)
!1723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1724, size: 64, align: 64)
!1724 = !DISubroutineType(types: !1725)
!1725 = !{null, !1614, !1014, !1015, !1015}
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1446, file: !47, line: 2534, baseType: !1015, size: 32, align: 32, offset: 4672)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1446, file: !47, line: 2545, baseType: !1015, size: 32, align: 32, offset: 4704)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1446, file: !47, line: 2547, baseType: !1015, size: 32, align: 32, offset: 4736)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1446, file: !47, line: 2549, baseType: !1015, size: 32, align: 32, offset: 4768)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1446, file: !47, line: 2551, baseType: !1015, size: 32, align: 32, offset: 4800)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1446, file: !47, line: 2553, baseType: !1015, size: 32, align: 32, offset: 4832)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1446, file: !47, line: 2555, baseType: !1015, size: 32, align: 32, offset: 4864)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1446, file: !47, line: 2557, baseType: !1015, size: 32, align: 32, offset: 4896)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1446, file: !47, line: 2559, baseType: !1015, size: 32, align: 32, offset: 4928)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1446, file: !47, line: 2563, baseType: !1015, size: 32, align: 32, offset: 4960)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1446, file: !47, line: 2571, baseType: !1547, size: 64, align: 64, offset: 4992)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1446, file: !47, line: 2579, baseType: !1547, size: 64, align: 64, offset: 5056)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1446, file: !47, line: 2586, baseType: !1015, size: 32, align: 32, offset: 5120)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1446, file: !47, line: 2615, baseType: !1015, size: 32, align: 32, offset: 5152)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1446, file: !47, line: 2627, baseType: !1015, size: 32, align: 32, offset: 5184)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1446, file: !47, line: 2637, baseType: !1015, size: 32, align: 32, offset: 5216)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1446, file: !47, line: 2681, baseType: !1015, size: 32, align: 32, offset: 5248)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1446, file: !47, line: 2709, baseType: !1017, size: 64, align: 64, offset: 5312)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1446, file: !47, line: 2716, baseType: !1745, size: 64, align: 64, offset: 5376)
!1745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1746, size: 64, align: 64)
!1746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1747)
!1747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !47, line: 3636, size: 896, align: 64, elements: !1748)
!1748 = !{!1749, !1750, !1751, !1752, !1753, !1754, !1755, !1759, !1763, !1764, !1765, !1766, !1772, !1773, !1774, !1775, !1776}
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1747, file: !47, line: 3642, baseType: !1050, size: 64, align: 64)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1747, file: !47, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1747, file: !47, line: 3656, baseType: !46, size: 32, align: 32, offset: 96)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1747, file: !47, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1747, file: !47, line: 3669, baseType: !1015, size: 32, align: 32, offset: 160)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1747, file: !47, line: 3682, baseType: !1572, size: 64, align: 64, offset: 192)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1747, file: !47, line: 3698, baseType: !1756, size: 64, align: 64, offset: 256)
!1756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1757, size: 64, align: 64)
!1757 = !DISubroutineType(types: !1758)
!1758 = !{!1015, !1444, !1398, !1033}
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1747, file: !47, line: 3712, baseType: !1760, size: 64, align: 64, offset: 320)
!1760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1761, size: 64, align: 64)
!1761 = !DISubroutineType(types: !1762)
!1762 = !{!1015, !1444, !1015, !1398, !1033}
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1747, file: !47, line: 3726, baseType: !1756, size: 64, align: 64, offset: 384)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1747, file: !47, line: 3737, baseType: !1491, size: 64, align: 64, offset: 448)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1747, file: !47, line: 3746, baseType: !1015, size: 32, align: 32, offset: 512)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1747, file: !47, line: 3757, baseType: !1767, size: 64, align: 64, offset: 576)
!1767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1768, size: 64, align: 64)
!1768 = !DISubroutineType(types: !1769)
!1769 = !{null, !1770}
!1770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1771, size: 64, align: 64)
!1771 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !47, line: 3617, flags: DIFlagFwdDecl)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1747, file: !47, line: 3766, baseType: !1491, size: 64, align: 64, offset: 640)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1747, file: !47, line: 3774, baseType: !1491, size: 64, align: 64, offset: 704)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1747, file: !47, line: 3780, baseType: !1015, size: 32, align: 32, offset: 768)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1747, file: !47, line: 3785, baseType: !1015, size: 32, align: 32, offset: 800)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1747, file: !47, line: 3795, baseType: !1777, size: 64, align: 64, offset: 832)
!1777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1778, size: 64, align: 64)
!1778 = !DISubroutineType(types: !1779)
!1779 = !{!1015, !1444, !1203}
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1446, file: !47, line: 2728, baseType: !1014, size: 64, align: 64, offset: 5440)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1446, file: !47, line: 2735, baseType: !1286, size: 512, align: 64, offset: 5504)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1446, file: !47, line: 2742, baseType: !1015, size: 32, align: 32, offset: 6016)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1446, file: !47, line: 2755, baseType: !1015, size: 32, align: 32, offset: 6048)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1446, file: !47, line: 2776, baseType: !1015, size: 32, align: 32, offset: 6080)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1446, file: !47, line: 2783, baseType: !1015, size: 32, align: 32, offset: 6112)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1446, file: !47, line: 2791, baseType: !1015, size: 32, align: 32, offset: 6144)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1446, file: !47, line: 2802, baseType: !1259, size: 64, align: 64, offset: 6208)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1446, file: !47, line: 2811, baseType: !1015, size: 32, align: 32, offset: 6272)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1446, file: !47, line: 2821, baseType: !1015, size: 32, align: 32, offset: 6304)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1446, file: !47, line: 2830, baseType: !1015, size: 32, align: 32, offset: 6336)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1446, file: !47, line: 2840, baseType: !1015, size: 32, align: 32, offset: 6368)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1446, file: !47, line: 2851, baseType: !1793, size: 64, align: 64, offset: 6400)
!1793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1794, size: 64, align: 64)
!1794 = !DISubroutineType(types: !1795)
!1795 = !{!1015, !1614, !1796, !1014, !1557, !1015, !1015}
