; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--frmdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--frmdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type opaque
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProbeData = type { i8*, i8*, i32, i8* }

!863 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!864 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!865 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!866 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !25, line: 1534, size: 32, align: 32, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !25, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !25, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !25, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !926, !927}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !920, line: 222, size: 16, align: 8, elements: !921)
!920 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !919, file: !920, line: 222, baseType: !923, size: 16, align: 16)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !924, line: 49, baseType: !925)
!924 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!925 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!926 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!927 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!928 = !{!929, !2155}
!929 = distinct !DIGlobalVariable(name: "ff_frm_demuxer", scope: !0, file: !930, line: 104, type: !931, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_frm_demuxer)
!930 = !DIFile(filename: "libavformat/frmdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !897, line: 777, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !933)
!933 = !{!934, !938, !939, !940, !941, !947, !989, !990, !992, !993, !994, !1008, !2136, !2137, !2138, !2142, !2146, !2147, !2148, !2152, !2153, !2154}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !932, file: !897, line: 638, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !932, file: !897, line: 645, baseType: !935, size: 64, align: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !932, file: !897, line: 652, baseType: !926, size: 32, align: 32, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !932, file: !897, line: 659, baseType: !935, size: 64, align: 64, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !932, file: !897, line: 661, baseType: !942, size: 64, align: 64, offset: 256)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !897, line: 443, flags: DIFlagFwdDecl)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !932, file: !897, line: 663, baseType: !948, size: 64, align: 64, offset: 320)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !952)
!952 = !{!953, !954, !959, !963, !964, !965, !966, !970, !976, !978, !982}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !951, file: !4, line: 72, baseType: !935, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !951, file: !4, line: 78, baseType: !955, size: 64, align: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!935, !958}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !951, file: !4, line: 85, baseType: !960, size: 64, align: 64, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !951, file: !4, line: 93, baseType: !926, size: 32, align: 32, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !951, file: !4, line: 99, baseType: !926, size: 32, align: 32, offset: 224)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !951, file: !4, line: 108, baseType: !926, size: 32, align: 32, offset: 256)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !951, file: !4, line: 113, baseType: !967, size: 64, align: 64, offset: 320)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!958, !958, !958}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !951, file: !4, line: 123, baseType: !971, size: 64, align: 64, offset: 384)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!974, !974}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !951, file: !4, line: 130, baseType: !977, size: 32, align: 32, offset: 448)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !951, file: !4, line: 136, baseType: !979, size: 64, align: 64, offset: 512)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!977, !958}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !951, file: !4, line: 142, baseType: !983, size: 64, align: 64, offset: 576)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!926, !986, !958, !935, !926}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !932, file: !897, line: 670, baseType: !935, size: 64, align: 64, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !932, file: !897, line: 679, baseType: !991, size: 64, align: 64, offset: 448)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !932, file: !897, line: 684, baseType: !926, size: 32, align: 32, offset: 512)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !932, file: !897, line: 689, baseType: !926, size: 32, align: 32, offset: 544)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !932, file: !897, line: 696, baseType: !995, size: 64, align: 64, offset: 576)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!926, !998}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1001)
!1001 = !{!1002, !1003, !1006, !1007}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1000, file: !897, line: 449, baseType: !935, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1000, file: !897, line: 450, baseType: !1004, size: 64, align: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1000, file: !897, line: 451, baseType: !926, size: 32, align: 32, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1000, file: !897, line: 452, baseType: !935, size: 64, align: 64, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !932, file: !897, line: 703, baseType: !1009, size: 64, align: 64, offset: 640)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!926, !1012}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1217, !1218, !1283, !1284, !1285, !2013, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2067, !2068, !2069, !2070, !2071, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2102, !2103, !2106, !2107, !2108, !2109, !2110, !2111, !2113, !2114, !2115, !2116, !2124, !2125, !2129, !2133, !2134, !2135}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1013, file: !897, line: 1342, baseType: !948, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1013, file: !897, line: 1349, baseType: !991, size: 64, align: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1013, file: !897, line: 1356, baseType: !1018, size: 64, align: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1076, !1077, !1081, !1085, !1090, !1097, !1192, !1198, !1204, !1205, !1206, !1207, !1211}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1019, file: !897, line: 498, baseType: !935, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1019, file: !897, line: 504, baseType: !935, size: 64, align: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1019, file: !897, line: 505, baseType: !935, size: 64, align: 64, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1019, file: !897, line: 506, baseType: !935, size: 64, align: 64, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1019, file: !897, line: 508, baseType: !24, size: 32, align: 32, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1019, file: !897, line: 509, baseType: !24, size: 32, align: 32, offset: 288)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1019, file: !897, line: 510, baseType: !24, size: 32, align: 32, offset: 320)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1019, file: !897, line: 517, baseType: !926, size: 32, align: 32, offset: 352)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1019, file: !897, line: 523, baseType: !942, size: 64, align: 64, offset: 384)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1019, file: !897, line: 526, baseType: !948, size: 64, align: 64, offset: 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1019, file: !897, line: 535, baseType: !1018, size: 64, align: 64, offset: 512)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1019, file: !897, line: 539, baseType: !926, size: 32, align: 32, offset: 576)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1019, file: !897, line: 541, baseType: !1009, size: 64, align: 64, offset: 640)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1019, file: !897, line: 549, baseType: !1035, size: 64, align: 64, offset: 704)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!926, !1012, !1038}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !25, line: 1499, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !25, line: 1445, size: 704, align: 64, elements: !1041)
!1041 = !{!1042, !1056, !1059, !1060, !1061, !1062, !1063, !1064, !1072, !1073, !1074, !1075}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1040, file: !25, line: 1451, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1045, line: 94, baseType: !1046)
!1045 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1045, line: 81, size: 192, align: 64, elements: !1047)
!1047 = !{!1048, !1052, !1055}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1046, file: !1045, line: 82, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1045, line: 73, baseType: !1051)
!1051 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1045, line: 73, flags: DIFlagFwdDecl)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1046, file: !1045, line: 89, baseType: !1053, size: 64, align: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !924, line: 48, baseType: !1005)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1046, file: !1045, line: 93, baseType: !926, size: 32, align: 32, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1040, file: !25, line: 1461, baseType: !1057, size: 64, align: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !924, line: 40, baseType: !1058)
!1058 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1040, file: !25, line: 1467, baseType: !1057, size: 64, align: 64, offset: 128)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1040, file: !25, line: 1468, baseType: !1053, size: 64, align: 64, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1040, file: !25, line: 1469, baseType: !926, size: 32, align: 32, offset: 256)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1040, file: !25, line: 1470, baseType: !926, size: 32, align: 32, offset: 288)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1040, file: !25, line: 1474, baseType: !926, size: 32, align: 32, offset: 320)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1040, file: !25, line: 1479, baseType: !1065, size: 64, align: 64, offset: 384)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !25, line: 1415, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !25, line: 1411, size: 128, align: 64, elements: !1068)
!1068 = !{!1069, !1070, !1071}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1067, file: !25, line: 1412, baseType: !1053, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1067, file: !25, line: 1413, baseType: !926, size: 32, align: 32, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1067, file: !25, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1040, file: !25, line: 1480, baseType: !926, size: 32, align: 32, offset: 448)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1040, file: !25, line: 1486, baseType: !1057, size: 64, align: 64, offset: 512)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1040, file: !25, line: 1488, baseType: !1057, size: 64, align: 64, offset: 576)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1040, file: !25, line: 1497, baseType: !1057, size: 64, align: 64, offset: 640)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1019, file: !897, line: 550, baseType: !1009, size: 64, align: 64, offset: 768)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1019, file: !897, line: 554, baseType: !1078, size: 64, align: 64, offset: 832)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!926, !1012, !1038, !1038, !926}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1019, file: !897, line: 563, baseType: !1082, size: 64, align: 64, offset: 896)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!926, !24, !926}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1019, file: !897, line: 565, baseType: !1086, size: 64, align: 64, offset: 960)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{null, !1012, !926, !1089, !1089}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1019, file: !897, line: 570, baseType: !1091, size: 64, align: 64, offset: 1024)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!926, !1012, !926, !958, !1094}
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1095, line: 216, baseType: !1096)
!1095 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1096 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1019, file: !897, line: 581, baseType: !1098, size: 64, align: 64, offset: 1088)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!926, !1012, !926, !1101, !927}
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1105)
!1105 = !{!1106, !1110, !1112, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1146, !1148, !1149, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1104, file: !526, line: 282, baseType: !1107, size: 512, align: 64)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1053, size: 512, align: 64, elements: !1108)
!1108 = !{!1109}
!1109 = !DISubrange(count: 8)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1104, file: !526, line: 299, baseType: !1111, size: 256, align: 32, offset: 512)
!1111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 256, align: 32, elements: !1108)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1104, file: !526, line: 315, baseType: !1113, size: 64, align: 64, offset: 768)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1104, file: !526, line: 326, baseType: !926, size: 32, align: 32, offset: 832)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1104, file: !526, line: 326, baseType: !926, size: 32, align: 32, offset: 864)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1104, file: !526, line: 334, baseType: !926, size: 32, align: 32, offset: 896)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1104, file: !526, line: 341, baseType: !926, size: 32, align: 32, offset: 928)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1104, file: !526, line: 346, baseType: !926, size: 32, align: 32, offset: 960)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1104, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1104, file: !526, line: 356, baseType: !1121, size: 64, align: 32, offset: 1024)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1122, line: 61, baseType: !1123)
!1122 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1122, line: 58, size: 64, align: 32, elements: !1124)
!1124 = !{!1125, !1126}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1123, file: !1122, line: 59, baseType: !926, size: 32, align: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1123, file: !1122, line: 60, baseType: !926, size: 32, align: 32, offset: 32)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1104, file: !526, line: 361, baseType: !1057, size: 64, align: 64, offset: 1088)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1104, file: !526, line: 369, baseType: !1057, size: 64, align: 64, offset: 1152)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1104, file: !526, line: 377, baseType: !1057, size: 64, align: 64, offset: 1216)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1104, file: !526, line: 382, baseType: !926, size: 32, align: 32, offset: 1280)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1104, file: !526, line: 386, baseType: !926, size: 32, align: 32, offset: 1312)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1104, file: !526, line: 391, baseType: !926, size: 32, align: 32, offset: 1344)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1104, file: !526, line: 396, baseType: !958, size: 64, align: 64, offset: 1408)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1104, file: !526, line: 403, baseType: !1135, size: 512, align: 64, offset: 1472)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 512, align: 64, elements: !1108)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !924, line: 55, baseType: !1096)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1104, file: !526, line: 410, baseType: !926, size: 32, align: 32, offset: 1984)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1104, file: !526, line: 415, baseType: !926, size: 32, align: 32, offset: 2016)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1104, file: !526, line: 420, baseType: !926, size: 32, align: 32, offset: 2048)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1104, file: !526, line: 425, baseType: !926, size: 32, align: 32, offset: 2080)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1104, file: !526, line: 435, baseType: !1057, size: 64, align: 64, offset: 2112)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1104, file: !526, line: 440, baseType: !926, size: 32, align: 32, offset: 2176)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1104, file: !526, line: 445, baseType: !1136, size: 64, align: 64, offset: 2240)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1104, file: !526, line: 459, baseType: !1145, size: 512, align: 64, offset: 2304)
!1145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1043, size: 512, align: 64, elements: !1108)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1104, file: !526, line: 473, baseType: !1147, size: 64, align: 64, offset: 2816)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1104, file: !526, line: 477, baseType: !926, size: 32, align: 32, offset: 2880)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1104, file: !526, line: 479, baseType: !1150, size: 64, align: 64, offset: 2944)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1154)
!1154 = !{!1155, !1156, !1157, !1158, !1163}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1153, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1153, file: !526, line: 203, baseType: !1053, size: 64, align: 64, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1153, file: !526, line: 204, baseType: !926, size: 32, align: 32, offset: 128)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1153, file: !526, line: 205, baseType: !1159, size: 64, align: 64, offset: 192)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1161, line: 86, baseType: !1162)
!1161 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1162 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1161, line: 86, flags: DIFlagFwdDecl)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1153, file: !526, line: 206, baseType: !1043, size: 64, align: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1104, file: !526, line: 480, baseType: !926, size: 32, align: 32, offset: 3008)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1104, file: !526, line: 505, baseType: !926, size: 32, align: 32, offset: 3040)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1104, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1104, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1104, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1104, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1104, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1104, file: !526, line: 532, baseType: !1057, size: 64, align: 64, offset: 3264)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1104, file: !526, line: 539, baseType: !1057, size: 64, align: 64, offset: 3328)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1104, file: !526, line: 547, baseType: !1057, size: 64, align: 64, offset: 3392)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1104, file: !526, line: 554, baseType: !1159, size: 64, align: 64, offset: 3456)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1104, file: !526, line: 563, baseType: !926, size: 32, align: 32, offset: 3520)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1104, file: !526, line: 572, baseType: !926, size: 32, align: 32, offset: 3552)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1104, file: !526, line: 581, baseType: !926, size: 32, align: 32, offset: 3584)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1104, file: !526, line: 588, baseType: !1179, size: 64, align: 64, offset: 3648)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !924, line: 36, baseType: !1181)
!1181 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1104, file: !526, line: 593, baseType: !926, size: 32, align: 32, offset: 3712)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1104, file: !526, line: 596, baseType: !926, size: 32, align: 32, offset: 3744)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1104, file: !526, line: 599, baseType: !1043, size: 64, align: 64, offset: 3776)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1104, file: !526, line: 605, baseType: !1043, size: 64, align: 64, offset: 3840)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1104, file: !526, line: 616, baseType: !1043, size: 64, align: 64, offset: 3904)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1104, file: !526, line: 626, baseType: !1094, size: 64, align: 64, offset: 3968)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1104, file: !526, line: 627, baseType: !1094, size: 64, align: 64, offset: 4032)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1104, file: !526, line: 628, baseType: !1094, size: 64, align: 64, offset: 4096)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1104, file: !526, line: 629, baseType: !1094, size: 64, align: 64, offset: 4160)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1104, file: !526, line: 645, baseType: !1043, size: 64, align: 64, offset: 4224)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1019, file: !897, line: 587, baseType: !1193, size: 64, align: 64, offset: 1152)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!926, !1012, !1196}
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1019, file: !897, line: 592, baseType: !1199, size: 64, align: 64, offset: 1216)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!926, !1012, !1202}
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1019, file: !897, line: 597, baseType: !1199, size: 64, align: 64, offset: 1280)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1019, file: !897, line: 598, baseType: !24, size: 32, align: 32, offset: 1344)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1019, file: !897, line: 608, baseType: !1009, size: 64, align: 64, offset: 1408)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1019, file: !897, line: 617, baseType: !1208, size: 64, align: 64, offset: 1472)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{null, !1012}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1019, file: !897, line: 623, baseType: !1212, size: 64, align: 64, offset: 1536)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!926, !1012, !1215}
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1013, file: !897, line: 1365, baseType: !958, size: 64, align: 64, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1013, file: !897, line: 1379, baseType: !1219, size: 64, align: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1222)
!1222 = !{!1223, !1224, !1225, !1226, !1227, !1228, !1229, !1233, !1234, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1250, !1251, !1255, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1273, !1274, !1275, !1276, !1280, !1281, !1282}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1221, file: !628, line: 174, baseType: !948, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1221, file: !628, line: 226, baseType: !1004, size: 64, align: 64, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1221, file: !628, line: 227, baseType: !926, size: 32, align: 32, offset: 128)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1221, file: !628, line: 228, baseType: !1004, size: 64, align: 64, offset: 192)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1221, file: !628, line: 229, baseType: !1004, size: 64, align: 64, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1221, file: !628, line: 233, baseType: !958, size: 64, align: 64, offset: 320)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1221, file: !628, line: 235, baseType: !1230, size: 64, align: 64, offset: 384)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!926, !958, !1053, !926}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1221, file: !628, line: 236, baseType: !1230, size: 64, align: 64, offset: 448)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1221, file: !628, line: 237, baseType: !1235, size: 64, align: 64, offset: 512)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!1057, !958, !1057, !926}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1221, file: !628, line: 238, baseType: !1057, size: 64, align: 64, offset: 576)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1221, file: !628, line: 239, baseType: !926, size: 32, align: 32, offset: 640)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1221, file: !628, line: 240, baseType: !926, size: 32, align: 32, offset: 672)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1221, file: !628, line: 241, baseType: !926, size: 32, align: 32, offset: 704)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1221, file: !628, line: 242, baseType: !1096, size: 64, align: 64, offset: 768)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1221, file: !628, line: 243, baseType: !1004, size: 64, align: 64, offset: 832)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1221, file: !628, line: 244, baseType: !1245, size: 64, align: 64, offset: 896)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!1096, !1096, !1248, !927}
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1054)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1221, file: !628, line: 245, baseType: !926, size: 32, align: 32, offset: 960)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1221, file: !628, line: 249, baseType: !1252, size: 64, align: 64, offset: 1024)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!926, !958, !926}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1221, file: !628, line: 255, baseType: !1256, size: 64, align: 64, offset: 1088)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!1057, !958, !926, !1057, !926}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1221, file: !628, line: 260, baseType: !926, size: 32, align: 32, offset: 1152)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1221, file: !628, line: 266, baseType: !1057, size: 64, align: 64, offset: 1216)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1221, file: !628, line: 273, baseType: !926, size: 32, align: 32, offset: 1280)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1221, file: !628, line: 279, baseType: !1057, size: 64, align: 64, offset: 1344)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1221, file: !628, line: 285, baseType: !926, size: 32, align: 32, offset: 1408)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1221, file: !628, line: 291, baseType: !926, size: 32, align: 32, offset: 1440)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1221, file: !628, line: 298, baseType: !926, size: 32, align: 32, offset: 1472)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1221, file: !628, line: 304, baseType: !926, size: 32, align: 32, offset: 1504)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1221, file: !628, line: 309, baseType: !935, size: 64, align: 64, offset: 1536)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1221, file: !628, line: 314, baseType: !935, size: 64, align: 64, offset: 1600)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1221, file: !628, line: 319, baseType: !1270, size: 64, align: 64, offset: 1664)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!926, !958, !1053, !926, !627, !1057}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1221, file: !628, line: 326, baseType: !926, size: 32, align: 32, offset: 1728)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1221, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1221, file: !628, line: 332, baseType: !1057, size: 64, align: 64, offset: 1792)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1221, file: !628, line: 338, baseType: !1277, size: 64, align: 64, offset: 1856)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!926, !958}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1221, file: !628, line: 340, baseType: !1057, size: 64, align: 64, offset: 1920)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1221, file: !628, line: 346, baseType: !1004, size: 64, align: 64, offset: 1984)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1221, file: !628, line: 351, baseType: !926, size: 32, align: 32, offset: 2048)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1013, file: !897, line: 1386, baseType: !926, size: 32, align: 32, offset: 320)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1013, file: !897, line: 1393, baseType: !927, size: 32, align: 32, offset: 352)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1013, file: !897, line: 1405, baseType: !1286, size: 64, align: 64, offset: 384)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1289)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1290)
!1290 = !{!1291, !1292, !1293, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1961, !1967, !1968, !1972, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2004, !2005, !2006, !2007, !2008, !2009}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1289, file: !897, line: 866, baseType: !926, size: 32, align: 32)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1289, file: !897, line: 872, baseType: !926, size: 32, align: 32, offset: 32)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1289, file: !897, line: 878, baseType: !1294, size: 64, align: 64, offset: 64)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !25, line: 3360, baseType: !1296)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !25, line: 1556, size: 8448, align: 64, elements: !1297)
!1297 = !{!1298, !1299, !1300, !1301, !1441, !1442, !1443, !1444, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1597, !1601, !1602, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1781, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1296, file: !25, line: 1561, baseType: !948, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1296, file: !25, line: 1562, baseType: !926, size: 32, align: 32, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1296, file: !25, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1296, file: !25, line: 1565, baseType: !1302, size: 64, align: 64, offset: 128)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !25, line: 3468, size: 1984, align: 64, elements: !1305)
!1305 = !{!1306, !1307, !1308, !1309, !1310, !1311, !1314, !1317, !1320, !1323, !1326, !1327, !1328, !1336, !1337, !1338, !1340, !1344, !1350, !1359, !1363, !1364, !1406, !1413, !1417, !1418, !1422, !1426, !1430, !1434, !1435, !1436}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1304, file: !25, line: 3475, baseType: !935, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1304, file: !25, line: 3480, baseType: !935, size: 64, align: 64, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1304, file: !25, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1304, file: !25, line: 3482, baseType: !24, size: 32, align: 32, offset: 160)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1304, file: !25, line: 3487, baseType: !926, size: 32, align: 32, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1304, file: !25, line: 3488, baseType: !1312, size: 64, align: 64, offset: 256)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1121)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1304, file: !25, line: 3489, baseType: !1315, size: 64, align: 64, offset: 320)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1304, file: !25, line: 3490, baseType: !1318, size: 64, align: 64, offset: 384)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1304, file: !25, line: 3491, baseType: !1321, size: 64, align: 64, offset: 448)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1304, file: !25, line: 3492, baseType: !1324, size: 64, align: 64, offset: 512)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1136)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1304, file: !25, line: 3493, baseType: !1054, size: 8, align: 8, offset: 576)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1304, file: !25, line: 3494, baseType: !948, size: 64, align: 64, offset: 640)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1304, file: !25, line: 3495, baseType: !1329, size: 64, align: 64, offset: 704)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1331)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !25, line: 3404, baseType: !1332)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !25, line: 3401, size: 128, align: 64, elements: !1333)
!1333 = !{!1334, !1335}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1332, file: !25, line: 3402, baseType: !926, size: 32, align: 32)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1332, file: !25, line: 3403, baseType: !935, size: 64, align: 64, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1304, file: !25, line: 3507, baseType: !935, size: 64, align: 64, offset: 768)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1304, file: !25, line: 3516, baseType: !926, size: 32, align: 32, offset: 832)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1304, file: !25, line: 3517, baseType: !1339, size: 64, align: 64, offset: 896)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1304, file: !25, line: 3527, baseType: !1341, size: 64, align: 64, offset: 960)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DISubroutineType(types: !1343)
!1343 = !{!926, !1294}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1304, file: !25, line: 3535, baseType: !1345, size: 64, align: 64, offset: 1024)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DISubroutineType(types: !1347)
!1347 = !{!926, !1294, !1348}
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1295)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1304, file: !25, line: 3541, baseType: !1351, size: 64, align: 64, offset: 1088)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1353)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !25, line: 3461, baseType: !1354)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1355, line: 223, size: 128, align: 64, elements: !1356)
!1355 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1356 = !{!1357, !1358}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1354, file: !1355, line: 224, baseType: !1248, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1354, file: !1355, line: 225, baseType: !1248, size: 64, align: 64, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1304, file: !25, line: 3549, baseType: !1360, size: 64, align: 64, offset: 1152)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{null, !1339}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1304, file: !25, line: 3551, baseType: !1341, size: 64, align: 64, offset: 1216)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1304, file: !25, line: 3552, baseType: !1365, size: 64, align: 64, offset: 1280)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{!926, !1294, !1053, !926, !1368}
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1370)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !25, line: 3920, size: 256, align: 64, elements: !1371)
!1371 = !{!1372, !1373, !1375, !1376, !1377, !1405}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1370, file: !25, line: 3921, baseType: !923, size: 16, align: 16)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1370, file: !25, line: 3922, baseType: !1374, size: 32, align: 32, offset: 32)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !924, line: 51, baseType: !927)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1370, file: !25, line: 3923, baseType: !1374, size: 32, align: 32, offset: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1370, file: !25, line: 3924, baseType: !927, size: 32, align: 32, offset: 96)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1370, file: !25, line: 3925, baseType: !1378, size: 64, align: 64, offset: 128)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !25, line: 3918, baseType: !1381)
!1381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !25, line: 3885, size: 1600, align: 64, elements: !1382)
!1382 = !{!1383, !1384, !1385, !1386, !1387, !1388, !1394, !1398, !1400, !1401, !1403, !1404}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1381, file: !25, line: 3886, baseType: !926, size: 32, align: 32)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1381, file: !25, line: 3887, baseType: !926, size: 32, align: 32, offset: 32)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1381, file: !25, line: 3888, baseType: !926, size: 32, align: 32, offset: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1381, file: !25, line: 3889, baseType: !926, size: 32, align: 32, offset: 96)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1381, file: !25, line: 3890, baseType: !926, size: 32, align: 32, offset: 128)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1381, file: !25, line: 3897, baseType: !1389, size: 768, align: 64, offset: 192)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !25, line: 3858, baseType: !1390)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !25, line: 3853, size: 768, align: 64, elements: !1391)
!1391 = !{!1392, !1393}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1390, file: !25, line: 3855, baseType: !1107, size: 512, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1390, file: !25, line: 3857, baseType: !1111, size: 256, align: 32, offset: 512)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1381, file: !25, line: 3903, baseType: !1395, size: 256, align: 64, offset: 960)
!1395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1053, size: 256, align: 64, elements: !1396)
!1396 = !{!1397}
!1397 = !DISubrange(count: 4)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1381, file: !25, line: 3904, baseType: !1399, size: 128, align: 32, offset: 1216)
!1399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 128, align: 32, elements: !1396)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1381, file: !25, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1381, file: !25, line: 3908, baseType: !1402, size: 64, align: 64, offset: 1408)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1381, file: !25, line: 3915, baseType: !1402, size: 64, align: 64, offset: 1472)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1381, file: !25, line: 3917, baseType: !926, size: 32, align: 32, offset: 1536)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1370, file: !25, line: 3926, baseType: !1057, size: 64, align: 64, offset: 192)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1304, file: !25, line: 3564, baseType: !1407, size: 64, align: 64, offset: 1344)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DISubroutineType(types: !1409)
!1409 = !{!926, !1294, !1038, !1410, !1412}
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1103)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1304, file: !25, line: 3566, baseType: !1414, size: 64, align: 64, offset: 1408)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{!926, !1294, !958, !1412, !1038}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1304, file: !25, line: 3567, baseType: !1341, size: 64, align: 64, offset: 1472)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1304, file: !25, line: 3576, baseType: !1419, size: 64, align: 64, offset: 1536)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DISubroutineType(types: !1421)
!1421 = !{!926, !1294, !1410}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1304, file: !25, line: 3577, baseType: !1423, size: 64, align: 64, offset: 1600)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{!926, !1294, !1038}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1304, file: !25, line: 3584, baseType: !1427, size: 64, align: 64, offset: 1664)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!926, !1294, !1102}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1304, file: !25, line: 3589, baseType: !1431, size: 64, align: 64, offset: 1728)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{null, !1294}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1304, file: !25, line: 3594, baseType: !926, size: 32, align: 32, offset: 1792)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1304, file: !25, line: 3600, baseType: !935, size: 64, align: 64, offset: 1856)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1304, file: !25, line: 3609, baseType: !1437, size: 64, align: 64, offset: 1920)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1440)
!1440 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !25, line: 3609, flags: DIFlagFwdDecl)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1296, file: !25, line: 1566, baseType: !24, size: 32, align: 32, offset: 192)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1296, file: !25, line: 1581, baseType: !927, size: 32, align: 32, offset: 224)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1296, file: !25, line: 1583, baseType: !958, size: 64, align: 64, offset: 256)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1296, file: !25, line: 1591, baseType: !1445, size: 64, align: 64, offset: 320)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1355, line: 129, size: 1664, align: 64, elements: !1447)
!1447 = !{!1448, !1449, !1450, !1451, !1452, !1470, !1471, !1477, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1446, file: !1355, line: 136, baseType: !926, size: 32, align: 32)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1446, file: !1355, line: 151, baseType: !926, size: 32, align: 32, offset: 32)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1446, file: !1355, line: 157, baseType: !926, size: 32, align: 32, offset: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1446, file: !1355, line: 159, baseType: !1102, size: 64, align: 64, offset: 128)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1446, file: !1355, line: 161, baseType: !1453, size: 64, align: 64, offset: 192)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1355, line: 117, baseType: !1455)
!1455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1355, line: 100, size: 832, align: 64, elements: !1456)
!1456 = !{!1457, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1455, file: !1355, line: 105, baseType: !1458, size: 256, align: 64)
!1458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1459, size: 256, align: 64, elements: !1396)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1045, line: 238, baseType: !1461)
!1461 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1045, line: 238, flags: DIFlagFwdDecl)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1455, file: !1355, line: 110, baseType: !926, size: 32, align: 32, offset: 256)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1455, file: !1355, line: 111, baseType: !926, size: 32, align: 32, offset: 288)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1455, file: !1355, line: 111, baseType: !926, size: 32, align: 32, offset: 320)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1455, file: !1355, line: 112, baseType: !1111, size: 256, align: 32, offset: 352)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1455, file: !1355, line: 113, baseType: !1399, size: 128, align: 32, offset: 608)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1455, file: !1355, line: 114, baseType: !926, size: 32, align: 32, offset: 736)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1455, file: !1355, line: 115, baseType: !926, size: 32, align: 32, offset: 768)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1455, file: !1355, line: 116, baseType: !926, size: 32, align: 32, offset: 800)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1446, file: !1355, line: 163, baseType: !958, size: 64, align: 64, offset: 256)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1446, file: !1355, line: 165, baseType: !1472, size: 128, align: 64, offset: 320)
!1472 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1355, line: 122, baseType: !1473)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1355, line: 119, size: 128, align: 64, elements: !1474)
!1474 = !{!1475, !1476}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1473, file: !1355, line: 120, baseType: !1038, size: 64, align: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1473, file: !1355, line: 121, baseType: !1102, size: 64, align: 64, offset: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1446, file: !1355, line: 166, baseType: !1478, size: 128, align: 64, offset: 448)
!1478 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1355, line: 127, baseType: !1479)
!1479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1355, line: 124, size: 128, align: 64, elements: !1480)
!1480 = !{!1481, !1554}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1479, file: !1355, line: 125, baseType: !1482, size: 64, align: 64)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !25, line: 5794, baseType: !1485)
!1485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !25, line: 5747, size: 512, align: 64, elements: !1486)
!1486 = !{!1487, !1488, !1512, !1516, !1517, !1551, !1552, !1553}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1485, file: !25, line: 5751, baseType: !948, size: 64, align: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1485, file: !25, line: 5756, baseType: !1489, size: 64, align: 64, offset: 64)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1491)
!1491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !25, line: 5796, size: 512, align: 64, elements: !1492)
!1492 = !{!1493, !1494, !1497, !1498, !1499, !1503, !1507, !1511}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1491, file: !25, line: 5797, baseType: !935, size: 64, align: 64)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1491, file: !25, line: 5804, baseType: !1495, size: 64, align: 64, offset: 64)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1491, file: !25, line: 5815, baseType: !948, size: 64, align: 64, offset: 128)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1491, file: !25, line: 5825, baseType: !926, size: 32, align: 32, offset: 192)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1491, file: !25, line: 5826, baseType: !1500, size: 64, align: 64, offset: 256)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{!926, !1483}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1491, file: !25, line: 5827, baseType: !1504, size: 64, align: 64, offset: 320)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{!926, !1483, !1038}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1491, file: !25, line: 5828, baseType: !1508, size: 64, align: 64, offset: 384)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{null, !1483}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1491, file: !25, line: 5829, baseType: !1508, size: 64, align: 64, offset: 448)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1485, file: !25, line: 5762, baseType: !1513, size: 64, align: 64, offset: 128)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !25, line: 5735, baseType: !1515)
!1515 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !25, line: 5735, flags: DIFlagFwdDecl)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1485, file: !25, line: 5768, baseType: !958, size: 64, align: 64, offset: 192)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1485, file: !25, line: 5775, baseType: !1518, size: 64, align: 64, offset: 256)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !25, line: 4085, baseType: !1520)
!1520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !25, line: 3936, size: 1152, align: 64, elements: !1521)
!1521 = !{!1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1520, file: !25, line: 3940, baseType: !636, size: 32, align: 32)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1520, file: !25, line: 3944, baseType: !24, size: 32, align: 32, offset: 32)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1520, file: !25, line: 3948, baseType: !1374, size: 32, align: 32, offset: 64)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1520, file: !25, line: 3958, baseType: !1053, size: 64, align: 64, offset: 128)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1520, file: !25, line: 3962, baseType: !926, size: 32, align: 32, offset: 192)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1520, file: !25, line: 3968, baseType: !926, size: 32, align: 32, offset: 224)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1520, file: !25, line: 3973, baseType: !1057, size: 64, align: 64, offset: 256)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1520, file: !25, line: 3986, baseType: !926, size: 32, align: 32, offset: 320)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1520, file: !25, line: 3999, baseType: !926, size: 32, align: 32, offset: 352)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1520, file: !25, line: 4004, baseType: !926, size: 32, align: 32, offset: 384)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1520, file: !25, line: 4005, baseType: !926, size: 32, align: 32, offset: 416)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1520, file: !25, line: 4010, baseType: !926, size: 32, align: 32, offset: 448)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1520, file: !25, line: 4011, baseType: !926, size: 32, align: 32, offset: 480)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1520, file: !25, line: 4020, baseType: !1121, size: 64, align: 32, offset: 512)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1520, file: !25, line: 4025, baseType: !867, size: 32, align: 32, offset: 576)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1520, file: !25, line: 4030, baseType: !549, size: 32, align: 32, offset: 608)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1520, file: !25, line: 4031, baseType: !556, size: 32, align: 32, offset: 640)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1520, file: !25, line: 4032, baseType: !574, size: 32, align: 32, offset: 672)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1520, file: !25, line: 4033, baseType: !598, size: 32, align: 32, offset: 704)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1520, file: !25, line: 4034, baseType: !617, size: 32, align: 32, offset: 736)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1520, file: !25, line: 4039, baseType: !926, size: 32, align: 32, offset: 768)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1520, file: !25, line: 4046, baseType: !1136, size: 64, align: 64, offset: 832)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1520, file: !25, line: 4050, baseType: !926, size: 32, align: 32, offset: 896)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1520, file: !25, line: 4054, baseType: !926, size: 32, align: 32, offset: 928)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1520, file: !25, line: 4061, baseType: !926, size: 32, align: 32, offset: 960)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1520, file: !25, line: 4065, baseType: !926, size: 32, align: 32, offset: 992)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1520, file: !25, line: 4073, baseType: !926, size: 32, align: 32, offset: 1024)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1520, file: !25, line: 4080, baseType: !926, size: 32, align: 32, offset: 1056)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1520, file: !25, line: 4084, baseType: !926, size: 32, align: 32, offset: 1088)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1485, file: !25, line: 5781, baseType: !1518, size: 64, align: 64, offset: 320)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1485, file: !25, line: 5787, baseType: !1121, size: 64, align: 32, offset: 384)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1485, file: !25, line: 5793, baseType: !1121, size: 64, align: 32, offset: 448)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1479, file: !1355, line: 126, baseType: !926, size: 32, align: 32, offset: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1446, file: !1355, line: 172, baseType: !1038, size: 64, align: 64, offset: 576)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1446, file: !1355, line: 177, baseType: !1053, size: 64, align: 64, offset: 640)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1446, file: !1355, line: 178, baseType: !927, size: 32, align: 32, offset: 704)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1446, file: !1355, line: 180, baseType: !958, size: 64, align: 64, offset: 768)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1446, file: !1355, line: 185, baseType: !926, size: 32, align: 32, offset: 832)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1446, file: !1355, line: 190, baseType: !958, size: 64, align: 64, offset: 896)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1446, file: !1355, line: 195, baseType: !926, size: 32, align: 32, offset: 960)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1446, file: !1355, line: 200, baseType: !1038, size: 64, align: 64, offset: 1024)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1446, file: !1355, line: 201, baseType: !926, size: 32, align: 32, offset: 1088)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1446, file: !1355, line: 202, baseType: !1102, size: 64, align: 64, offset: 1152)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1446, file: !1355, line: 203, baseType: !926, size: 32, align: 32, offset: 1216)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1446, file: !1355, line: 205, baseType: !926, size: 32, align: 32, offset: 1248)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1446, file: !1355, line: 206, baseType: !926, size: 32, align: 32, offset: 1280)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1446, file: !1355, line: 209, baseType: !1094, size: 64, align: 64, offset: 1344)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1446, file: !1355, line: 212, baseType: !1094, size: 64, align: 64, offset: 1408)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1446, file: !1355, line: 213, baseType: !1102, size: 64, align: 64, offset: 1472)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1446, file: !1355, line: 215, baseType: !926, size: 32, align: 32, offset: 1536)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1446, file: !1355, line: 217, baseType: !926, size: 32, align: 32, offset: 1568)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1446, file: !1355, line: 220, baseType: !926, size: 32, align: 32, offset: 1600)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1296, file: !25, line: 1598, baseType: !958, size: 64, align: 64, offset: 384)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1296, file: !25, line: 1606, baseType: !1057, size: 64, align: 64, offset: 448)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1296, file: !25, line: 1614, baseType: !926, size: 32, align: 32, offset: 512)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1296, file: !25, line: 1622, baseType: !926, size: 32, align: 32, offset: 544)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1296, file: !25, line: 1628, baseType: !926, size: 32, align: 32, offset: 576)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1296, file: !25, line: 1636, baseType: !926, size: 32, align: 32, offset: 608)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1296, file: !25, line: 1643, baseType: !926, size: 32, align: 32, offset: 640)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1296, file: !25, line: 1657, baseType: !1053, size: 64, align: 64, offset: 704)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1296, file: !25, line: 1658, baseType: !926, size: 32, align: 32, offset: 768)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1296, file: !25, line: 1679, baseType: !1121, size: 64, align: 32, offset: 800)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1296, file: !25, line: 1688, baseType: !926, size: 32, align: 32, offset: 864)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1296, file: !25, line: 1712, baseType: !926, size: 32, align: 32, offset: 896)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1296, file: !25, line: 1729, baseType: !926, size: 32, align: 32, offset: 928)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1296, file: !25, line: 1729, baseType: !926, size: 32, align: 32, offset: 960)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1296, file: !25, line: 1744, baseType: !926, size: 32, align: 32, offset: 992)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1296, file: !25, line: 1744, baseType: !926, size: 32, align: 32, offset: 1024)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1296, file: !25, line: 1751, baseType: !926, size: 32, align: 32, offset: 1056)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1296, file: !25, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1296, file: !25, line: 1791, baseType: !1593, size: 64, align: 64, offset: 1152)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DISubroutineType(types: !1595)
!1595 = !{null, !1596, !1410, !1412, !926, !926, !926}
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1296, file: !25, line: 1808, baseType: !1598, size: 64, align: 64, offset: 1216)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DISubroutineType(types: !1600)
!1600 = !{!645, !1596, !1315}
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1296, file: !25, line: 1816, baseType: !926, size: 32, align: 32, offset: 1280)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1296, file: !25, line: 1825, baseType: !1603, size: 32, align: 32, offset: 1312)
!1603 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1296, file: !25, line: 1830, baseType: !926, size: 32, align: 32, offset: 1344)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1296, file: !25, line: 1838, baseType: !1603, size: 32, align: 32, offset: 1376)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1296, file: !25, line: 1846, baseType: !926, size: 32, align: 32, offset: 1408)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1296, file: !25, line: 1851, baseType: !926, size: 32, align: 32, offset: 1440)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1296, file: !25, line: 1861, baseType: !1603, size: 32, align: 32, offset: 1472)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1296, file: !25, line: 1868, baseType: !1603, size: 32, align: 32, offset: 1504)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1296, file: !25, line: 1875, baseType: !1603, size: 32, align: 32, offset: 1536)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1296, file: !25, line: 1882, baseType: !1603, size: 32, align: 32, offset: 1568)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1296, file: !25, line: 1889, baseType: !1603, size: 32, align: 32, offset: 1600)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1296, file: !25, line: 1896, baseType: !1603, size: 32, align: 32, offset: 1632)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1296, file: !25, line: 1903, baseType: !1603, size: 32, align: 32, offset: 1664)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1296, file: !25, line: 1910, baseType: !926, size: 32, align: 32, offset: 1696)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1296, file: !25, line: 1915, baseType: !926, size: 32, align: 32, offset: 1728)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1296, file: !25, line: 1926, baseType: !1412, size: 64, align: 64, offset: 1792)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1296, file: !25, line: 1935, baseType: !1121, size: 64, align: 32, offset: 1856)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1296, file: !25, line: 1942, baseType: !926, size: 32, align: 32, offset: 1920)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1296, file: !25, line: 1948, baseType: !926, size: 32, align: 32, offset: 1952)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1296, file: !25, line: 1954, baseType: !926, size: 32, align: 32, offset: 1984)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1296, file: !25, line: 1960, baseType: !926, size: 32, align: 32, offset: 2016)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1296, file: !25, line: 1984, baseType: !926, size: 32, align: 32, offset: 2048)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1296, file: !25, line: 1991, baseType: !926, size: 32, align: 32, offset: 2080)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1296, file: !25, line: 1996, baseType: !926, size: 32, align: 32, offset: 2112)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1296, file: !25, line: 2004, baseType: !926, size: 32, align: 32, offset: 2144)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1296, file: !25, line: 2011, baseType: !926, size: 32, align: 32, offset: 2176)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1296, file: !25, line: 2018, baseType: !926, size: 32, align: 32, offset: 2208)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1296, file: !25, line: 2027, baseType: !926, size: 32, align: 32, offset: 2240)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1296, file: !25, line: 2034, baseType: !926, size: 32, align: 32, offset: 2272)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1296, file: !25, line: 2044, baseType: !926, size: 32, align: 32, offset: 2304)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1296, file: !25, line: 2054, baseType: !1633, size: 64, align: 64, offset: 2368)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1296, file: !25, line: 2061, baseType: !1633, size: 64, align: 64, offset: 2432)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1296, file: !25, line: 2066, baseType: !926, size: 32, align: 32, offset: 2496)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1296, file: !25, line: 2070, baseType: !926, size: 32, align: 32, offset: 2528)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1296, file: !25, line: 2078, baseType: !926, size: 32, align: 32, offset: 2560)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1296, file: !25, line: 2085, baseType: !926, size: 32, align: 32, offset: 2592)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1296, file: !25, line: 2092, baseType: !926, size: 32, align: 32, offset: 2624)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1296, file: !25, line: 2099, baseType: !926, size: 32, align: 32, offset: 2656)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1296, file: !25, line: 2106, baseType: !926, size: 32, align: 32, offset: 2688)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1296, file: !25, line: 2113, baseType: !926, size: 32, align: 32, offset: 2720)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1296, file: !25, line: 2120, baseType: !926, size: 32, align: 32, offset: 2752)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1296, file: !25, line: 2125, baseType: !926, size: 32, align: 32, offset: 2784)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1296, file: !25, line: 2133, baseType: !926, size: 32, align: 32, offset: 2816)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1296, file: !25, line: 2140, baseType: !926, size: 32, align: 32, offset: 2848)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1296, file: !25, line: 2145, baseType: !926, size: 32, align: 32, offset: 2880)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1296, file: !25, line: 2153, baseType: !926, size: 32, align: 32, offset: 2912)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1296, file: !25, line: 2158, baseType: !926, size: 32, align: 32, offset: 2944)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1296, file: !25, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1296, file: !25, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1296, file: !25, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1296, file: !25, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1296, file: !25, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1296, file: !25, line: 2203, baseType: !926, size: 32, align: 32, offset: 3136)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1296, file: !25, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1296, file: !25, line: 2212, baseType: !926, size: 32, align: 32, offset: 3200)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1296, file: !25, line: 2213, baseType: !926, size: 32, align: 32, offset: 3232)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1296, file: !25, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1296, file: !25, line: 2232, baseType: !926, size: 32, align: 32, offset: 3296)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1296, file: !25, line: 2243, baseType: !926, size: 32, align: 32, offset: 3328)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1296, file: !25, line: 2249, baseType: !926, size: 32, align: 32, offset: 3360)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1296, file: !25, line: 2256, baseType: !926, size: 32, align: 32, offset: 3392)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1296, file: !25, line: 2263, baseType: !1136, size: 64, align: 64, offset: 3456)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1296, file: !25, line: 2270, baseType: !1136, size: 64, align: 64, offset: 3520)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1296, file: !25, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1296, file: !25, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1296, file: !25, line: 2367, baseType: !1669, size: 64, align: 64, offset: 3648)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DISubroutineType(types: !1671)
!1671 = !{!926, !1596, !1102, !926}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1296, file: !25, line: 2383, baseType: !926, size: 32, align: 32, offset: 3712)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1296, file: !25, line: 2386, baseType: !1603, size: 32, align: 32, offset: 3744)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1296, file: !25, line: 2387, baseType: !1603, size: 32, align: 32, offset: 3776)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1296, file: !25, line: 2394, baseType: !926, size: 32, align: 32, offset: 3808)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1296, file: !25, line: 2401, baseType: !926, size: 32, align: 32, offset: 3840)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1296, file: !25, line: 2408, baseType: !926, size: 32, align: 32, offset: 3872)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1296, file: !25, line: 2415, baseType: !926, size: 32, align: 32, offset: 3904)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1296, file: !25, line: 2422, baseType: !926, size: 32, align: 32, offset: 3936)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1296, file: !25, line: 2423, baseType: !1681, size: 64, align: 64, offset: 3968)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !25, line: 831, baseType: !1683)
!1683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !25, line: 826, size: 128, align: 32, elements: !1684)
!1684 = !{!1685, !1686, !1687, !1688}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1683, file: !25, line: 827, baseType: !926, size: 32, align: 32)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1683, file: !25, line: 828, baseType: !926, size: 32, align: 32, offset: 32)
