; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--mp3dec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--mp3dec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CheckRet", file: !939, line: 60, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "libavformat/mp3dec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!940 = !{!941, !942}
!941 = !DIEnumerator(name: "CHECK_WRONG_HEADER", value: -1)
!942 = !DIEnumerator(name: "CHECK_SEEK_FAILED", value: -2)
!943 = !{!944, !953, !952, !955}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !947, line: 221, size: 32, align: 8, elements: !948)
!947 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!948 = !{!949}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !946, file: !947, line: 221, baseType: !950, size: 32, align: 32)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !951, line: 51, baseType: !952)
!951 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!952 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !951, line: 40, baseType: !954)
!954 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!955 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!956 = !{!957, !2200, !2201, !2206}
!957 = distinct !DIGlobalVariable(name: "ff_mp3_demuxer", scope: !0, file: !939, line: 597, type: !958, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_mp3_demuxer)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !960)
!960 = !{!961, !965, !966, !967, !968, !978, !1058, !1059, !1061, !1062, !1063, !1077, !2181, !2182, !2183, !2187, !2191, !2192, !2193, !2197, !2198, !2199}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !959, file: !919, line: 638, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !959, file: !919, line: 645, baseType: !962, size: 64, align: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !959, file: !919, line: 652, baseType: !955, size: 32, align: 32, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !959, file: !919, line: 659, baseType: !962, size: 64, align: 64, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !959, file: !919, line: 661, baseType: !969, size: 64, align: 64, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !974, line: 44, size: 64, align: 32, elements: !975)
!974 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !973, file: !974, line: 45, baseType: !3, size: 32, align: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !973, file: !974, line: 46, baseType: !952, size: 32, align: 32, offset: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !959, file: !919, line: 663, baseType: !979, size: 64, align: 64, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !983)
!983 = !{!984, !985, !990, !1017, !1018, !1019, !1020, !1024, !1030, !1032, !1036}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !982, file: !486, line: 72, baseType: !962, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !982, file: !486, line: 78, baseType: !986, size: 64, align: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!962, !989}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !982, file: !486, line: 85, baseType: !991, size: 64, align: 64, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !994)
!994 = !{!995, !996, !997, !998, !999, !1013, !1014, !1015, !1016}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !993, file: !464, line: 247, baseType: !962, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !993, file: !464, line: 253, baseType: !962, size: 64, align: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !993, file: !464, line: 259, baseType: !955, size: 32, align: 32, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !993, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !993, file: !464, line: 271, baseType: !1000, size: 64, align: 64, offset: 192)
!1000 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !993, file: !464, line: 265, size: 64, align: 64, elements: !1001)
!1001 = !{!1002, !1003, !1005, !1006}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1000, file: !464, line: 266, baseType: !953, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1000, file: !464, line: 267, baseType: !1004, size: 64, align: 64)
!1004 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1000, file: !464, line: 268, baseType: !962, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1000, file: !464, line: 270, baseType: !1007, size: 64, align: 32)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1008, line: 61, baseType: !1009)
!1008 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1008, line: 58, size: 64, align: 32, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1009, file: !1008, line: 59, baseType: !955, size: 32, align: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1009, file: !1008, line: 60, baseType: !955, size: 32, align: 32, offset: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !993, file: !464, line: 272, baseType: !1004, size: 64, align: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !993, file: !464, line: 273, baseType: !1004, size: 64, align: 64, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !993, file: !464, line: 275, baseType: !955, size: 32, align: 32, offset: 384)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !993, file: !464, line: 300, baseType: !962, size: 64, align: 64, offset: 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !982, file: !486, line: 93, baseType: !955, size: 32, align: 32, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !982, file: !486, line: 99, baseType: !955, size: 32, align: 32, offset: 224)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !982, file: !486, line: 108, baseType: !955, size: 32, align: 32, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !982, file: !486, line: 113, baseType: !1021, size: 64, align: 64, offset: 320)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!989, !989, !989}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !982, file: !486, line: 123, baseType: !1025, size: 64, align: 64, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!1028, !1028}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !982, file: !486, line: 130, baseType: !1031, size: 32, align: 32, offset: 448)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !982, file: !486, line: 136, baseType: !1033, size: 64, align: 64, offset: 512)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!1031, !989}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !982, file: !486, line: 142, baseType: !1037, size: 64, align: 64, offset: 576)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!955, !1040, !989, !962, !955}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1043)
!1043 = !{!1044, !1056, !1057}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1042, file: !464, line: 360, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1053, !1054, !1055}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1048, file: !464, line: 307, baseType: !962, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1048, file: !464, line: 313, baseType: !1004, size: 64, align: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1048, file: !464, line: 313, baseType: !1004, size: 64, align: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1048, file: !464, line: 318, baseType: !1004, size: 64, align: 64, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1048, file: !464, line: 318, baseType: !1004, size: 64, align: 64, offset: 256)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1048, file: !464, line: 323, baseType: !955, size: 32, align: 32, offset: 320)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1042, file: !464, line: 364, baseType: !955, size: 32, align: 32, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1042, file: !464, line: 368, baseType: !955, size: 32, align: 32, offset: 96)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !959, file: !919, line: 670, baseType: !962, size: 64, align: 64, offset: 384)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !959, file: !919, line: 679, baseType: !1060, size: 64, align: 64, offset: 448)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !959, file: !919, line: 684, baseType: !955, size: 32, align: 32, offset: 512)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !959, file: !919, line: 689, baseType: !955, size: 32, align: 32, offset: 544)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !959, file: !919, line: 696, baseType: !1064, size: 64, align: 64, offset: 576)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!955, !1067}
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1069)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1070)
!1070 = !{!1071, !1072, !1075, !1076}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1069, file: !919, line: 449, baseType: !962, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1069, file: !919, line: 450, baseType: !1073, size: 64, align: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1069, file: !919, line: 451, baseType: !955, size: 32, align: 32, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1069, file: !919, line: 452, baseType: !962, size: 64, align: 64, offset: 192)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !959, file: !919, line: 703, baseType: !1078, size: 64, align: 64, offset: 640)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!955, !1081}
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1083)
!1083 = !{!1084, !1085, !1086, !1278, !1279, !1344, !1345, !1346, !2038, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2092, !2093, !2094, !2095, !2096, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2147, !2148, !2151, !2152, !2153, !2154, !2155, !2156, !2158, !2159, !2160, !2161, !2169, !2170, !2174, !2178, !2179, !2180}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1082, file: !919, line: 1342, baseType: !979, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1082, file: !919, line: 1349, baseType: !1060, size: 64, align: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1082, file: !919, line: 1356, baseType: !1087, size: 64, align: 64, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1143, !1144, !1148, !1152, !1157, !1164, !1253, !1259, !1265, !1266, !1267, !1268, !1272}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1088, file: !919, line: 498, baseType: !962, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1088, file: !919, line: 504, baseType: !962, size: 64, align: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1088, file: !919, line: 505, baseType: !962, size: 64, align: 64, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1088, file: !919, line: 506, baseType: !962, size: 64, align: 64, offset: 192)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1088, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1088, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1088, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1088, file: !919, line: 517, baseType: !955, size: 32, align: 32, offset: 352)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1088, file: !919, line: 523, baseType: !969, size: 64, align: 64, offset: 384)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1088, file: !919, line: 526, baseType: !979, size: 64, align: 64, offset: 448)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1088, file: !919, line: 535, baseType: !1087, size: 64, align: 64, offset: 512)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1088, file: !919, line: 539, baseType: !955, size: 32, align: 32, offset: 576)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1088, file: !919, line: 541, baseType: !1078, size: 64, align: 64, offset: 640)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1088, file: !919, line: 549, baseType: !1104, size: 64, align: 64, offset: 704)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!955, !1081, !1107}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1110)
!1110 = !{!1111, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1139, !1140, !1141, !1142}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1109, file: !4, line: 1451, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1114, line: 94, baseType: !1115)
!1114 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1114, line: 81, size: 192, align: 64, elements: !1116)
!1116 = !{!1117, !1121, !1124}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1115, file: !1114, line: 82, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1114, line: 73, baseType: !1120)
!1120 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1114, line: 73, flags: DIFlagFwdDecl)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1115, file: !1114, line: 89, baseType: !1122, size: 64, align: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !951, line: 48, baseType: !1074)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1115, file: !1114, line: 93, baseType: !955, size: 32, align: 32, offset: 128)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1109, file: !4, line: 1461, baseType: !953, size: 64, align: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1109, file: !4, line: 1467, baseType: !953, size: 64, align: 64, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1109, file: !4, line: 1468, baseType: !1122, size: 64, align: 64, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1109, file: !4, line: 1469, baseType: !955, size: 32, align: 32, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1109, file: !4, line: 1470, baseType: !955, size: 32, align: 32, offset: 288)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1109, file: !4, line: 1474, baseType: !955, size: 32, align: 32, offset: 320)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1109, file: !4, line: 1479, baseType: !1132, size: 64, align: 64, offset: 384)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1134)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1135)
!1135 = !{!1136, !1137, !1138}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1134, file: !4, line: 1412, baseType: !1122, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1134, file: !4, line: 1413, baseType: !955, size: 32, align: 32, offset: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1134, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1109, file: !4, line: 1480, baseType: !955, size: 32, align: 32, offset: 448)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1109, file: !4, line: 1486, baseType: !953, size: 64, align: 64, offset: 512)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1109, file: !4, line: 1488, baseType: !953, size: 64, align: 64, offset: 576)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1109, file: !4, line: 1497, baseType: !953, size: 64, align: 64, offset: 640)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1088, file: !919, line: 550, baseType: !1078, size: 64, align: 64, offset: 768)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1088, file: !919, line: 554, baseType: !1145, size: 64, align: 64, offset: 832)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!955, !1081, !1107, !1107, !955}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1088, file: !919, line: 563, baseType: !1149, size: 64, align: 64, offset: 896)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!955, !3, !955}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1088, file: !919, line: 565, baseType: !1153, size: 64, align: 64, offset: 960)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{null, !1081, !955, !1156, !1156}
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1088, file: !919, line: 570, baseType: !1158, size: 64, align: 64, offset: 1024)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!955, !1081, !955, !989, !1161}
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1162, line: 216, baseType: !1163)
!1162 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1163 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1088, file: !919, line: 581, baseType: !1165, size: 64, align: 64, offset: 1088)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!955, !1081, !955, !1168, !952}
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1172)
!1172 = !{!1173, !1177, !1179, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1207, !1209, !1210, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1171, file: !548, line: 282, baseType: !1174, size: 512, align: 64)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1122, size: 512, align: 64, elements: !1175)
!1175 = !{!1176}
!1176 = !DISubrange(count: 8)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1171, file: !548, line: 299, baseType: !1178, size: 256, align: 32, offset: 512)
!1178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 256, align: 32, elements: !1175)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1171, file: !548, line: 315, baseType: !1180, size: 64, align: 64, offset: 768)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1171, file: !548, line: 326, baseType: !955, size: 32, align: 32, offset: 832)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1171, file: !548, line: 326, baseType: !955, size: 32, align: 32, offset: 864)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1171, file: !548, line: 334, baseType: !955, size: 32, align: 32, offset: 896)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1171, file: !548, line: 341, baseType: !955, size: 32, align: 32, offset: 928)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1171, file: !548, line: 346, baseType: !955, size: 32, align: 32, offset: 960)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1171, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1171, file: !548, line: 356, baseType: !1007, size: 64, align: 32, offset: 1024)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1171, file: !548, line: 361, baseType: !953, size: 64, align: 64, offset: 1088)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1171, file: !548, line: 369, baseType: !953, size: 64, align: 64, offset: 1152)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1171, file: !548, line: 377, baseType: !953, size: 64, align: 64, offset: 1216)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1171, file: !548, line: 382, baseType: !955, size: 32, align: 32, offset: 1280)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1171, file: !548, line: 386, baseType: !955, size: 32, align: 32, offset: 1312)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1171, file: !548, line: 391, baseType: !955, size: 32, align: 32, offset: 1344)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1171, file: !548, line: 396, baseType: !989, size: 64, align: 64, offset: 1408)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1171, file: !548, line: 403, baseType: !1196, size: 512, align: 64, offset: 1472)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1197, size: 512, align: 64, elements: !1175)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !951, line: 55, baseType: !1163)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1171, file: !548, line: 410, baseType: !955, size: 32, align: 32, offset: 1984)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1171, file: !548, line: 415, baseType: !955, size: 32, align: 32, offset: 2016)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1171, file: !548, line: 420, baseType: !955, size: 32, align: 32, offset: 2048)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1171, file: !548, line: 425, baseType: !955, size: 32, align: 32, offset: 2080)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1171, file: !548, line: 435, baseType: !953, size: 64, align: 64, offset: 2112)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1171, file: !548, line: 440, baseType: !955, size: 32, align: 32, offset: 2176)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1171, file: !548, line: 445, baseType: !1197, size: 64, align: 64, offset: 2240)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1171, file: !548, line: 459, baseType: !1206, size: 512, align: 64, offset: 2304)
!1206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1112, size: 512, align: 64, elements: !1175)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1171, file: !548, line: 473, baseType: !1208, size: 64, align: 64, offset: 2816)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1171, file: !548, line: 477, baseType: !955, size: 32, align: 32, offset: 2880)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1171, file: !548, line: 479, baseType: !1211, size: 64, align: 64, offset: 2944)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1215)
!1215 = !{!1216, !1217, !1218, !1219, !1224}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1214, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1214, file: !548, line: 203, baseType: !1122, size: 64, align: 64, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1214, file: !548, line: 204, baseType: !955, size: 32, align: 32, offset: 128)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1214, file: !548, line: 205, baseType: !1220, size: 64, align: 64, offset: 192)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1222, line: 86, baseType: !1223)
!1222 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1223 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1222, line: 86, flags: DIFlagFwdDecl)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1214, file: !548, line: 206, baseType: !1112, size: 64, align: 64, offset: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1171, file: !548, line: 480, baseType: !955, size: 32, align: 32, offset: 3008)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1171, file: !548, line: 505, baseType: !955, size: 32, align: 32, offset: 3040)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1171, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1171, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1171, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1171, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1171, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1171, file: !548, line: 532, baseType: !953, size: 64, align: 64, offset: 3264)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1171, file: !548, line: 539, baseType: !953, size: 64, align: 64, offset: 3328)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1171, file: !548, line: 547, baseType: !953, size: 64, align: 64, offset: 3392)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1171, file: !548, line: 554, baseType: !1220, size: 64, align: 64, offset: 3456)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1171, file: !548, line: 563, baseType: !955, size: 32, align: 32, offset: 3520)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1171, file: !548, line: 572, baseType: !955, size: 32, align: 32, offset: 3552)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1171, file: !548, line: 581, baseType: !955, size: 32, align: 32, offset: 3584)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1171, file: !548, line: 588, baseType: !1240, size: 64, align: 64, offset: 3648)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !951, line: 36, baseType: !1242)
!1242 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1171, file: !548, line: 593, baseType: !955, size: 32, align: 32, offset: 3712)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1171, file: !548, line: 596, baseType: !955, size: 32, align: 32, offset: 3744)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1171, file: !548, line: 599, baseType: !1112, size: 64, align: 64, offset: 3776)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1171, file: !548, line: 605, baseType: !1112, size: 64, align: 64, offset: 3840)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1171, file: !548, line: 616, baseType: !1112, size: 64, align: 64, offset: 3904)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1171, file: !548, line: 626, baseType: !1161, size: 64, align: 64, offset: 3968)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1171, file: !548, line: 627, baseType: !1161, size: 64, align: 64, offset: 4032)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1171, file: !548, line: 628, baseType: !1161, size: 64, align: 64, offset: 4096)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1171, file: !548, line: 629, baseType: !1161, size: 64, align: 64, offset: 4160)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1171, file: !548, line: 645, baseType: !1112, size: 64, align: 64, offset: 4224)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1088, file: !919, line: 587, baseType: !1254, size: 64, align: 64, offset: 1152)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!955, !1081, !1257}
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1088, file: !919, line: 592, baseType: !1260, size: 64, align: 64, offset: 1216)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!955, !1081, !1263}
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1088, file: !919, line: 597, baseType: !1260, size: 64, align: 64, offset: 1280)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1088, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1088, file: !919, line: 608, baseType: !1078, size: 64, align: 64, offset: 1408)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1088, file: !919, line: 617, baseType: !1269, size: 64, align: 64, offset: 1472)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{null, !1081}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1088, file: !919, line: 623, baseType: !1273, size: 64, align: 64, offset: 1536)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!955, !1081, !1276}
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1108)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1082, file: !919, line: 1365, baseType: !989, size: 64, align: 64, offset: 192)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1082, file: !919, line: 1379, baseType: !1280, size: 64, align: 64, offset: 256)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1282)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1283)
!1283 = !{!1284, !1285, !1286, !1287, !1288, !1289, !1290, !1294, !1295, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1311, !1312, !1316, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1334, !1335, !1336, !1337, !1341, !1342, !1343}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1282, file: !650, line: 174, baseType: !979, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1282, file: !650, line: 226, baseType: !1073, size: 64, align: 64, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1282, file: !650, line: 227, baseType: !955, size: 32, align: 32, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1282, file: !650, line: 228, baseType: !1073, size: 64, align: 64, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1282, file: !650, line: 229, baseType: !1073, size: 64, align: 64, offset: 256)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1282, file: !650, line: 233, baseType: !989, size: 64, align: 64, offset: 320)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1282, file: !650, line: 235, baseType: !1291, size: 64, align: 64, offset: 384)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!955, !989, !1122, !955}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1282, file: !650, line: 236, baseType: !1291, size: 64, align: 64, offset: 448)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1282, file: !650, line: 237, baseType: !1296, size: 64, align: 64, offset: 512)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!953, !989, !953, !955}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1282, file: !650, line: 238, baseType: !953, size: 64, align: 64, offset: 576)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1282, file: !650, line: 239, baseType: !955, size: 32, align: 32, offset: 640)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1282, file: !650, line: 240, baseType: !955, size: 32, align: 32, offset: 672)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1282, file: !650, line: 241, baseType: !955, size: 32, align: 32, offset: 704)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1282, file: !650, line: 242, baseType: !1163, size: 64, align: 64, offset: 768)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1282, file: !650, line: 243, baseType: !1073, size: 64, align: 64, offset: 832)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1282, file: !650, line: 244, baseType: !1306, size: 64, align: 64, offset: 896)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!1163, !1163, !1309, !952}
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1123)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1282, file: !650, line: 245, baseType: !955, size: 32, align: 32, offset: 960)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1282, file: !650, line: 249, baseType: !1313, size: 64, align: 64, offset: 1024)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!955, !989, !955}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1282, file: !650, line: 255, baseType: !1317, size: 64, align: 64, offset: 1088)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!953, !989, !955, !953, !955}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1282, file: !650, line: 260, baseType: !955, size: 32, align: 32, offset: 1152)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1282, file: !650, line: 266, baseType: !953, size: 64, align: 64, offset: 1216)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1282, file: !650, line: 273, baseType: !955, size: 32, align: 32, offset: 1280)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1282, file: !650, line: 279, baseType: !953, size: 64, align: 64, offset: 1344)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1282, file: !650, line: 285, baseType: !955, size: 32, align: 32, offset: 1408)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1282, file: !650, line: 291, baseType: !955, size: 32, align: 32, offset: 1440)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1282, file: !650, line: 298, baseType: !955, size: 32, align: 32, offset: 1472)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1282, file: !650, line: 304, baseType: !955, size: 32, align: 32, offset: 1504)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1282, file: !650, line: 309, baseType: !962, size: 64, align: 64, offset: 1536)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1282, file: !650, line: 314, baseType: !962, size: 64, align: 64, offset: 1600)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1282, file: !650, line: 319, baseType: !1331, size: 64, align: 64, offset: 1664)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!955, !989, !1122, !955, !649, !953}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1282, file: !650, line: 326, baseType: !955, size: 32, align: 32, offset: 1728)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1282, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1282, file: !650, line: 332, baseType: !953, size: 64, align: 64, offset: 1792)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1282, file: !650, line: 338, baseType: !1338, size: 64, align: 64, offset: 1856)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!955, !989}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1282, file: !650, line: 340, baseType: !953, size: 64, align: 64, offset: 1920)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1282, file: !650, line: 346, baseType: !1073, size: 64, align: 64, offset: 1984)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1282, file: !650, line: 351, baseType: !955, size: 32, align: 32, offset: 2048)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1082, file: !919, line: 1386, baseType: !955, size: 32, align: 32, offset: 320)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1082, file: !919, line: 1393, baseType: !952, size: 32, align: 32, offset: 352)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1082, file: !919, line: 1405, baseType: !1347, size: 64, align: 64, offset: 384)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1350)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1351)
!1351 = !{!1352, !1353, !1354, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1824, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1924, !1930, !1931, !1935, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1967, !1968, !1969, !1970, !1971, !1972}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1350, file: !919, line: 866, baseType: !955, size: 32, align: 32)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1350, file: !919, line: 872, baseType: !955, size: 32, align: 32, offset: 32)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1350, file: !919, line: 878, baseType: !1355, size: 64, align: 64, offset: 64)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1357)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1358)
!1358 = !{!1359, !1360, !1361, !1362, !1499, !1500, !1501, !1502, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1528, !1532, !1533, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1712, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1357, file: !4, line: 1561, baseType: !979, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1357, file: !4, line: 1562, baseType: !955, size: 32, align: 32, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1357, file: !4, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1357, file: !4, line: 1565, baseType: !1363, size: 64, align: 64, offset: 128)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1365)
!1365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1366)
!1366 = !{!1367, !1368, !1369, !1370, !1371, !1372, !1375, !1378, !1381, !1384, !1387, !1388, !1389, !1397, !1398, !1399, !1401, !1405, !1411, !1416, !1420, !1421, !1464, !1471, !1475, !1476, !1480, !1484, !1488, !1492, !1493, !1494}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1365, file: !4, line: 3475, baseType: !962, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1365, file: !4, line: 3480, baseType: !962, size: 64, align: 64, offset: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1365, file: !4, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1365, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1365, file: !4, line: 3487, baseType: !955, size: 32, align: 32, offset: 192)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1365, file: !4, line: 3488, baseType: !1373, size: 64, align: 64, offset: 256)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1365, file: !4, line: 3489, baseType: !1376, size: 64, align: 64, offset: 320)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1365, file: !4, line: 3490, baseType: !1379, size: 64, align: 64, offset: 384)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1365, file: !4, line: 3491, baseType: !1382, size: 64, align: 64, offset: 448)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1365, file: !4, line: 3492, baseType: !1385, size: 64, align: 64, offset: 512)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1197)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1365, file: !4, line: 3493, baseType: !1123, size: 8, align: 8, offset: 576)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1365, file: !4, line: 3494, baseType: !979, size: 64, align: 64, offset: 640)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1365, file: !4, line: 3495, baseType: !1390, size: 64, align: 64, offset: 704)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1392)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1393)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1394)
!1394 = !{!1395, !1396}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1393, file: !4, line: 3402, baseType: !955, size: 32, align: 32)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1393, file: !4, line: 3403, baseType: !962, size: 64, align: 64, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1365, file: !4, line: 3507, baseType: !962, size: 64, align: 64, offset: 768)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1365, file: !4, line: 3516, baseType: !955, size: 32, align: 32, offset: 832)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1365, file: !4, line: 3517, baseType: !1400, size: 64, align: 64, offset: 896)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1365, file: !4, line: 3527, baseType: !1402, size: 64, align: 64, offset: 960)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DISubroutineType(types: !1404)
!1404 = !{!955, !1355}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1365, file: !4, line: 3535, baseType: !1406, size: 64, align: 64, offset: 1024)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DISubroutineType(types: !1408)
!1408 = !{!955, !1355, !1409}
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1356)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1365, file: !4, line: 3541, baseType: !1412, size: 64, align: 64, offset: 1088)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1414)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1415)
!1415 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1365, file: !4, line: 3549, baseType: !1417, size: 64, align: 64, offset: 1152)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DISubroutineType(types: !1419)
!1419 = !{null, !1400}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1365, file: !4, line: 3551, baseType: !1402, size: 64, align: 64, offset: 1216)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1365, file: !4, line: 3552, baseType: !1422, size: 64, align: 64, offset: 1280)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{!955, !1355, !1122, !955, !1425}
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1427)
!1427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1428)
!1428 = !{!1429, !1432, !1433, !1434, !1435, !1463}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1427, file: !4, line: 3921, baseType: !1430, size: 16, align: 16)
!1430 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !951, line: 49, baseType: !1431)
!1431 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1427, file: !4, line: 3922, baseType: !950, size: 32, align: 32, offset: 32)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1427, file: !4, line: 3923, baseType: !950, size: 32, align: 32, offset: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1427, file: !4, line: 3924, baseType: !952, size: 32, align: 32, offset: 96)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1427, file: !4, line: 3925, baseType: !1436, size: 64, align: 64, offset: 128)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1439)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1440)
!1440 = !{!1441, !1442, !1443, !1444, !1445, !1446, !1452, !1456, !1458, !1459, !1461, !1462}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1439, file: !4, line: 3886, baseType: !955, size: 32, align: 32)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1439, file: !4, line: 3887, baseType: !955, size: 32, align: 32, offset: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1439, file: !4, line: 3888, baseType: !955, size: 32, align: 32, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1439, file: !4, line: 3889, baseType: !955, size: 32, align: 32, offset: 96)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1439, file: !4, line: 3890, baseType: !955, size: 32, align: 32, offset: 128)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1439, file: !4, line: 3897, baseType: !1447, size: 768, align: 64, offset: 192)
!1447 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1448)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1449)
!1449 = !{!1450, !1451}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1448, file: !4, line: 3855, baseType: !1174, size: 512, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1448, file: !4, line: 3857, baseType: !1178, size: 256, align: 32, offset: 512)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1439, file: !4, line: 3903, baseType: !1453, size: 256, align: 64, offset: 960)
!1453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1122, size: 256, align: 64, elements: !1454)
!1454 = !{!1455}
!1455 = !DISubrange(count: 4)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1439, file: !4, line: 3904, baseType: !1457, size: 128, align: 32, offset: 1216)
!1457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 128, align: 32, elements: !1454)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1439, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1439, file: !4, line: 3908, baseType: !1460, size: 64, align: 64, offset: 1408)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1439, file: !4, line: 3915, baseType: !1460, size: 64, align: 64, offset: 1472)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1439, file: !4, line: 3917, baseType: !955, size: 32, align: 32, offset: 1536)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1427, file: !4, line: 3926, baseType: !953, size: 64, align: 64, offset: 192)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1365, file: !4, line: 3564, baseType: !1465, size: 64, align: 64, offset: 1344)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!955, !1355, !1107, !1468, !1470}
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1170)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1365, file: !4, line: 3566, baseType: !1472, size: 64, align: 64, offset: 1408)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{!955, !1355, !989, !1470, !1107}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1365, file: !4, line: 3567, baseType: !1402, size: 64, align: 64, offset: 1472)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1365, file: !4, line: 3576, baseType: !1477, size: 64, align: 64, offset: 1536)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{!955, !1355, !1468}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1365, file: !4, line: 3577, baseType: !1481, size: 64, align: 64, offset: 1600)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{!955, !1355, !1107}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1365, file: !4, line: 3584, baseType: !1485, size: 64, align: 64, offset: 1664)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{!955, !1355, !1169}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1365, file: !4, line: 3589, baseType: !1489, size: 64, align: 64, offset: 1728)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{null, !1355}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1365, file: !4, line: 3594, baseType: !955, size: 32, align: 32, offset: 1792)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1365, file: !4, line: 3600, baseType: !962, size: 64, align: 64, offset: 1856)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1365, file: !4, line: 3609, baseType: !1495, size: 64, align: 64, offset: 1920)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1498)
!1498 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1357, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1357, file: !4, line: 1581, baseType: !952, size: 32, align: 32, offset: 224)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1357, file: !4, line: 1583, baseType: !989, size: 64, align: 64, offset: 256)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1357, file: !4, line: 1591, baseType: !1503, size: 64, align: 64, offset: 320)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1357, file: !4, line: 1598, baseType: !989, size: 64, align: 64, offset: 384)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1357, file: !4, line: 1606, baseType: !953, size: 64, align: 64, offset: 448)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1357, file: !4, line: 1614, baseType: !955, size: 32, align: 32, offset: 512)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1357, file: !4, line: 1622, baseType: !955, size: 32, align: 32, offset: 544)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1357, file: !4, line: 1628, baseType: !955, size: 32, align: 32, offset: 576)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1357, file: !4, line: 1636, baseType: !955, size: 32, align: 32, offset: 608)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1357, file: !4, line: 1643, baseType: !955, size: 32, align: 32, offset: 640)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1357, file: !4, line: 1657, baseType: !1122, size: 64, align: 64, offset: 704)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1357, file: !4, line: 1658, baseType: !955, size: 32, align: 32, offset: 768)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1357, file: !4, line: 1679, baseType: !1007, size: 64, align: 32, offset: 800)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1357, file: !4, line: 1688, baseType: !955, size: 32, align: 32, offset: 864)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1357, file: !4, line: 1712, baseType: !955, size: 32, align: 32, offset: 896)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1357, file: !4, line: 1729, baseType: !955, size: 32, align: 32, offset: 928)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1357, file: !4, line: 1729, baseType: !955, size: 32, align: 32, offset: 960)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1357, file: !4, line: 1744, baseType: !955, size: 32, align: 32, offset: 992)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1357, file: !4, line: 1744, baseType: !955, size: 32, align: 32, offset: 1024)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1357, file: !4, line: 1751, baseType: !955, size: 32, align: 32, offset: 1056)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1357, file: !4, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1357, file: !4, line: 1791, baseType: !1524, size: 64, align: 64, offset: 1152)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DISubroutineType(types: !1526)
!1526 = !{null, !1527, !1468, !1470, !955, !955, !955}
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1357, file: !4, line: 1808, baseType: !1529, size: 64, align: 64, offset: 1216)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!667, !1527, !1376}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1357, file: !4, line: 1816, baseType: !955, size: 32, align: 32, offset: 1280)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1357, file: !4, line: 1825, baseType: !1534, size: 32, align: 32, offset: 1312)
!1534 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1357, file: !4, line: 1830, baseType: !955, size: 32, align: 32, offset: 1344)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1357, file: !4, line: 1838, baseType: !1534, size: 32, align: 32, offset: 1376)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1357, file: !4, line: 1846, baseType: !955, size: 32, align: 32, offset: 1408)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1357, file: !4, line: 1851, baseType: !955, size: 32, align: 32, offset: 1440)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1357, file: !4, line: 1861, baseType: !1534, size: 32, align: 32, offset: 1472)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1357, file: !4, line: 1868, baseType: !1534, size: 32, align: 32, offset: 1504)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1357, file: !4, line: 1875, baseType: !1534, size: 32, align: 32, offset: 1536)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1357, file: !4, line: 1882, baseType: !1534, size: 32, align: 32, offset: 1568)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1357, file: !4, line: 1889, baseType: !1534, size: 32, align: 32, offset: 1600)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1357, file: !4, line: 1896, baseType: !1534, size: 32, align: 32, offset: 1632)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1357, file: !4, line: 1903, baseType: !1534, size: 32, align: 32, offset: 1664)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1357, file: !4, line: 1910, baseType: !955, size: 32, align: 32, offset: 1696)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1357, file: !4, line: 1915, baseType: !955, size: 32, align: 32, offset: 1728)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1357, file: !4, line: 1926, baseType: !1470, size: 64, align: 64, offset: 1792)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1357, file: !4, line: 1935, baseType: !1007, size: 64, align: 32, offset: 1856)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1357, file: !4, line: 1942, baseType: !955, size: 32, align: 32, offset: 1920)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1357, file: !4, line: 1948, baseType: !955, size: 32, align: 32, offset: 1952)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1357, file: !4, line: 1954, baseType: !955, size: 32, align: 32, offset: 1984)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1357, file: !4, line: 1960, baseType: !955, size: 32, align: 32, offset: 2016)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1357, file: !4, line: 1984, baseType: !955, size: 32, align: 32, offset: 2048)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1357, file: !4, line: 1991, baseType: !955, size: 32, align: 32, offset: 2080)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1357, file: !4, line: 1996, baseType: !955, size: 32, align: 32, offset: 2112)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1357, file: !4, line: 2004, baseType: !955, size: 32, align: 32, offset: 2144)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1357, file: !4, line: 2011, baseType: !955, size: 32, align: 32, offset: 2176)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1357, file: !4, line: 2018, baseType: !955, size: 32, align: 32, offset: 2208)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1357, file: !4, line: 2027, baseType: !955, size: 32, align: 32, offset: 2240)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1357, file: !4, line: 2034, baseType: !955, size: 32, align: 32, offset: 2272)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1357, file: !4, line: 2044, baseType: !955, size: 32, align: 32, offset: 2304)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1357, file: !4, line: 2054, baseType: !1564, size: 64, align: 64, offset: 2368)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1357, file: !4, line: 2061, baseType: !1564, size: 64, align: 64, offset: 2432)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1357, file: !4, line: 2066, baseType: !955, size: 32, align: 32, offset: 2496)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1357, file: !4, line: 2070, baseType: !955, size: 32, align: 32, offset: 2528)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1357, file: !4, line: 2078, baseType: !955, size: 32, align: 32, offset: 2560)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1357, file: !4, line: 2085, baseType: !955, size: 32, align: 32, offset: 2592)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1357, file: !4, line: 2092, baseType: !955, size: 32, align: 32, offset: 2624)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1357, file: !4, line: 2099, baseType: !955, size: 32, align: 32, offset: 2656)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1357, file: !4, line: 2106, baseType: !955, size: 32, align: 32, offset: 2688)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1357, file: !4, line: 2113, baseType: !955, size: 32, align: 32, offset: 2720)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1357, file: !4, line: 2120, baseType: !955, size: 32, align: 32, offset: 2752)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1357, file: !4, line: 2125, baseType: !955, size: 32, align: 32, offset: 2784)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1357, file: !4, line: 2133, baseType: !955, size: 32, align: 32, offset: 2816)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1357, file: !4, line: 2140, baseType: !955, size: 32, align: 32, offset: 2848)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1357, file: !4, line: 2145, baseType: !955, size: 32, align: 32, offset: 2880)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1357, file: !4, line: 2153, baseType: !955, size: 32, align: 32, offset: 2912)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1357, file: !4, line: 2158, baseType: !955, size: 32, align: 32, offset: 2944)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1357, file: !4, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1357, file: !4, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1357, file: !4, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1357, file: !4, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1357, file: !4, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1357, file: !4, line: 2203, baseType: !955, size: 32, align: 32, offset: 3136)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1357, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1357, file: !4, line: 2212, baseType: !955, size: 32, align: 32, offset: 3200)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1357, file: !4, line: 2213, baseType: !955, size: 32, align: 32, offset: 3232)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1357, file: !4, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1357, file: !4, line: 2232, baseType: !955, size: 32, align: 32, offset: 3296)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1357, file: !4, line: 2243, baseType: !955, size: 32, align: 32, offset: 3328)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1357, file: !4, line: 2249, baseType: !955, size: 32, align: 32, offset: 3360)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1357, file: !4, line: 2256, baseType: !955, size: 32, align: 32, offset: 3392)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1357, file: !4, line: 2263, baseType: !1197, size: 64, align: 64, offset: 3456)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1357, file: !4, line: 2270, baseType: !1197, size: 64, align: 64, offset: 3520)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1357, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1357, file: !4, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1357, file: !4, line: 2367, baseType: !1600, size: 64, align: 64, offset: 3648)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DISubroutineType(types: !1602)
!1602 = !{!955, !1527, !1169, !955}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1357, file: !4, line: 2383, baseType: !955, size: 32, align: 32, offset: 3712)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1357, file: !4, line: 2386, baseType: !1534, size: 32, align: 32, offset: 3744)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1357, file: !4, line: 2387, baseType: !1534, size: 32, align: 32, offset: 3776)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1357, file: !4, line: 2394, baseType: !955, size: 32, align: 32, offset: 3808)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1357, file: !4, line: 2401, baseType: !955, size: 32, align: 32, offset: 3840)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1357, file: !4, line: 2408, baseType: !955, size: 32, align: 32, offset: 3872)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1357, file: !4, line: 2415, baseType: !955, size: 32, align: 32, offset: 3904)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1357, file: !4, line: 2422, baseType: !955, size: 32, align: 32, offset: 3936)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1357, file: !4, line: 2423, baseType: !1612, size: 64, align: 64, offset: 3968)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1614)
!1614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1615)
!1615 = !{!1616, !1617, !1618, !1619}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1614, file: !4, line: 827, baseType: !955, size: 32, align: 32)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1614, file: !4, line: 828, baseType: !955, size: 32, align: 32, offset: 32)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1614, file: !4, line: 829, baseType: !955, size: 32, align: 32, offset: 64)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1614, file: !4, line: 830, baseType: !1534, size: 32, align: 32, offset: 96)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1357, file: !4, line: 2430, baseType: !953, size: 64, align: 64, offset: 4032)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1357, file: !4, line: 2437, baseType: !953, size: 64, align: 64, offset: 4096)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1357, file: !4, line: 2444, baseType: !1534, size: 32, align: 32, offset: 4160)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1357, file: !4, line: 2451, baseType: !1534, size: 32, align: 32, offset: 4192)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1357, file: !4, line: 2458, baseType: !955, size: 32, align: 32, offset: 4224)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1357, file: !4, line: 2469, baseType: !955, size: 32, align: 32, offset: 4256)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1357, file: !4, line: 2475, baseType: !955, size: 32, align: 32, offset: 4288)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1357, file: !4, line: 2481, baseType: !955, size: 32, align: 32, offset: 4320)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1357, file: !4, line: 2485, baseType: !955, size: 32, align: 32, offset: 4352)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1357, file: !4, line: 2489, baseType: !955, size: 32, align: 32, offset: 4384)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1357, file: !4, line: 2493, baseType: !955, size: 32, align: 32, offset: 4416)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1357, file: !4, line: 2501, baseType: !955, size: 32, align: 32, offset: 4448)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1357, file: !4, line: 2506, baseType: !955, size: 32, align: 32, offset: 4480)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1357, file: !4, line: 2510, baseType: !955, size: 32, align: 32, offset: 4512)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1357, file: !4, line: 2514, baseType: !953, size: 64, align: 64, offset: 4544)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1357, file: !4, line: 2528, baseType: !1636, size: 64, align: 64, offset: 4608)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DISubroutineType(types: !1638)
!1638 = !{null, !1527, !989, !955, !955}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1357, file: !4, line: 2534, baseType: !955, size: 32, align: 32, offset: 4672)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1357, file: !4, line: 2545, baseType: !955, size: 32, align: 32, offset: 4704)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1357, file: !4, line: 2547, baseType: !955, size: 32, align: 32, offset: 4736)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1357, file: !4, line: 2549, baseType: !955, size: 32, align: 32, offset: 4768)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1357, file: !4, line: 2551, baseType: !955, size: 32, align: 32, offset: 4800)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1357, file: !4, line: 2553, baseType: !955, size: 32, align: 32, offset: 4832)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1357, file: !4, line: 2555, baseType: !955, size: 32, align: 32, offset: 4864)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1357, file: !4, line: 2557, baseType: !955, size: 32, align: 32, offset: 4896)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1357, file: !4, line: 2559, baseType: !955, size: 32, align: 32, offset: 4928)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1357, file: !4, line: 2563, baseType: !955, size: 32, align: 32, offset: 4960)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1357, file: !4, line: 2571, baseType: !1460, size: 64, align: 64, offset: 4992)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1357, file: !4, line: 2579, baseType: !1460, size: 64, align: 64, offset: 5056)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1357, file: !4, line: 2586, baseType: !955, size: 32, align: 32, offset: 5120)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1357, file: !4, line: 2615, baseType: !955, size: 32, align: 32, offset: 5152)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1357, file: !4, line: 2627, baseType: !955, size: 32, align: 32, offset: 5184)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1357, file: !4, line: 2637, baseType: !955, size: 32, align: 32, offset: 5216)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1357, file: !4, line: 2681, baseType: !955, size: 32, align: 32, offset: 5248)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1357, file: !4, line: 2709, baseType: !953, size: 64, align: 64, offset: 5312)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1357, file: !4, line: 2716, baseType: !1658, size: 64, align: 64, offset: 5376)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1660)
!1660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1661)
!1661 = !{!1662, !1663, !1664, !1665, !1666, !1667, !1668, !1672, !1676, !1677, !1678, !1679, !1685, !1686, !1687, !1688, !1689}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1660, file: !4, line: 3642, baseType: !962, size: 64, align: 64)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1660, file: !4, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1660, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1660, file: !4, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1660, file: !4, line: 3669, baseType: !955, size: 32, align: 32, offset: 160)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1660, file: !4, line: 3682, baseType: !1485, size: 64, align: 64, offset: 192)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1660, file: !4, line: 3698, baseType: !1669, size: 64, align: 64, offset: 256)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DISubroutineType(types: !1671)
!1671 = !{!955, !1355, !1309, !950}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1660, file: !4, line: 3712, baseType: !1673, size: 64, align: 64, offset: 320)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DISubroutineType(types: !1675)
!1675 = !{!955, !1355, !955, !1309, !950}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1660, file: !4, line: 3726, baseType: !1669, size: 64, align: 64, offset: 384)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1660, file: !4, line: 3737, baseType: !1402, size: 64, align: 64, offset: 448)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1660, file: !4, line: 3746, baseType: !955, size: 32, align: 32, offset: 512)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1660, file: !4, line: 3757, baseType: !1680, size: 64, align: 64, offset: 576)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{null, !1683}
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1660, file: !4, line: 3766, baseType: !1402, size: 64, align: 64, offset: 640)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1660, file: !4, line: 3774, baseType: !1402, size: 64, align: 64, offset: 704)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1660, file: !4, line: 3780, baseType: !955, size: 32, align: 32, offset: 768)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1660, file: !4, line: 3785, baseType: !955, size: 32, align: 32, offset: 800)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1660, file: !4, line: 3795, baseType: !1690, size: 64, align: 64, offset: 832)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DISubroutineType(types: !1692)
!1692 = !{!955, !1355, !1112}
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1357, file: !4, line: 2728, baseType: !989, size: 64, align: 64, offset: 5440)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1357, file: !4, line: 2735, baseType: !1196, size: 512, align: 64, offset: 5504)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1357, file: !4, line: 2742, baseType: !955, size: 32, align: 32, offset: 6016)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1357, file: !4, line: 2755, baseType: !955, size: 32, align: 32, offset: 6048)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1357, file: !4, line: 2776, baseType: !955, size: 32, align: 32, offset: 6080)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1357, file: !4, line: 2783, baseType: !955, size: 32, align: 32, offset: 6112)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1357, file: !4, line: 2791, baseType: !955, size: 32, align: 32, offset: 6144)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1357, file: !4, line: 2802, baseType: !1169, size: 64, align: 64, offset: 6208)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1357, file: !4, line: 2811, baseType: !955, size: 32, align: 32, offset: 6272)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1357, file: !4, line: 2821, baseType: !955, size: 32, align: 32, offset: 6304)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1357, file: !4, line: 2830, baseType: !955, size: 32, align: 32, offset: 6336)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1357, file: !4, line: 2840, baseType: !955, size: 32, align: 32, offset: 6368)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1357, file: !4, line: 2851, baseType: !1706, size: 64, align: 64, offset: 6400)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DISubroutineType(types: !1708)
!1708 = !{!955, !1527, !1709, !989, !1470, !955, !955}
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DISubroutineType(types: !1711)
!1711 = !{!955, !1527, !989}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1357, file: !4, line: 2871, baseType: !1713, size: 64, align: 64, offset: 6464)
!1713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1714, size: 64, align: 64)
!1714 = !DISubroutineType(types: !1715)
!1715 = !{!955, !1527, !1716, !989, !1470, !955}
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1717 = !DISubroutineType(types: !1718)
!1718 = !{!955, !1527, !989, !955, !955}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1357, file: !4, line: 2878, baseType: !955, size: 32, align: 32, offset: 6528)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1357, file: !4, line: 2885, baseType: !955, size: 32, align: 32, offset: 6560)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1357, file: !4, line: 3005, baseType: !955, size: 32, align: 32, offset: 6592)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1357, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1357, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1357, file: !4, line: 3027, baseType: !909, size: 32, align: 32, offset: 6688)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1357, file: !4, line: 3037, baseType: !1122, size: 64, align: 64, offset: 6720)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1357, file: !4, line: 3038, baseType: !955, size: 32, align: 32, offset: 6784)
