; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--avc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--avc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVIOContext = type { %struct.AVClass*, i8*, i32, i8*, i8*, i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i64, i32, i32, i32, i64, i8*, i64 (i64, i8*, i32)*, i32, i32 (i8*, i32)*, i64 (i8*, i32, i64, i32)*, i32, i64, i32, i64, i32, i32, i32, i32, i8*, i8*, i32 (i8*, i8*, i32, i32, i64)*, i32, i32, i64, i32 (i8*)*, i64, i8*, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%union.unaligned_32 = type { i32 }
%union.unaligned_16 = type { i16 }

; Function Attrs: nounwind uwtable
define i8* @ff_avc_find_startcode(i8* %p, i8* %end) #0 !dbg !79 {
entry:
  %p.addr = alloca i8*, align 8
  %end.addr = alloca i8*, align 8
  %out = alloca i8*, align 8
  store i8* %p, i8** %p.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %p.addr, metadata !84, metadata !85), !dbg !86
  store i8* %end, i8** %end.addr, align 8

!207 = !DILocation(line: 46, column: 28, scope: !200)
!208 = !DILocation(line: 46, column: 29, scope: !200)
!209 = !DILocation(line: 46, column: 21, scope: !200)
!210 = !DILocation(line: 47, column: 13, scope: !190)
!211 = !DILocation(line: 48, column: 17, scope: !212)
!212 = distinct !DILexicalBlock(scope: !185, file: !80, line: 48, column: 17)
!213 = !DILocation(line: 48, column: 22, scope: !212)
!214 = !DILocation(line: 48, column: 17, scope: !185)
!215 = !DILocation(line: 49, column: 21, scope: !216)
!216 = distinct !DILexicalBlock(scope: !217, file: !80, line: 49, column: 21)
!217 = distinct !DILexicalBlock(scope: !212, file: !80, line: 48, column: 28)
!218 = !DILocation(line: 49, column: 26, scope: !216)
!219 = !DILocation(line: 49, column: 31, scope: !216)
!220 = !DILocation(line: 49, column: 34, scope: !221)
!221 = !DILexicalBlockFile(scope: !216, file: !80, discriminator: 1)
!222 = !DILocation(line: 49, column: 39, scope: !221)
!223 = !DILocation(line: 49, column: 21, scope: !221)
!224 = !DILocation(line: 50, column: 28, scope: !216)
!225 = !DILocation(line: 50, column: 29, scope: !216)
!226 = !DILocation(line: 50, column: 21, scope: !216)
!227 = !DILocation(line: 51, column: 21, scope: !228)
!228 = distinct !DILexicalBlock(scope: !217, file: !80, line: 51, column: 21)
!229 = !DILocation(line: 51, column: 26, scope: !228)
!230 = !DILocation(line: 51, column: 31, scope: !228)
!231 = !DILocation(line: 51, column: 34, scope: !232)
!232 = !DILexicalBlockFile(scope: !228, file: !80, discriminator: 1)
!233 = !DILocation(line: 51, column: 39, scope: !232)
!234 = !DILocation(line: 51, column: 21, scope: !232)
!235 = !DILocation(line: 52, column: 28, scope: !228)
!236 = !DILocation(line: 52, column: 29, scope: !228)
!237 = !DILocation(line: 52, column: 21, scope: !228)
!238 = !DILocation(line: 53, column: 13, scope: !217)
!239 = !DILocation(line: 54, column: 9, scope: !185)
!240 = !DILocation(line: 55, column: 5, scope: !171)
!241 = !DILocation(line: 37, column: 31, scope: !242)
!242 = !DILexicalBlockFile(scope: !166, file: !80, discriminator: 2)
!243 = !DILocation(line: 37, column: 5, scope: !242)
!244 = distinct !{!244, !245}
!245 = !DILocation(line: 37, column: 5, scope: !112)
!246 = !DILocation(line: 57, column: 14, scope: !247)
!247 = distinct !DILexicalBlock(scope: !112, file: !80, line: 57, column: 5)
!248 = !DILocation(line: 57, column: 10, scope: !247)
!249 = !DILocation(line: 57, column: 20, scope: !250)
!250 = !DILexicalBlockFile(scope: !251, file: !80, discriminator: 1)
!251 = distinct !DILexicalBlock(scope: !247, file: !80, line: 57, column: 5)
!252 = !DILocation(line: 57, column: 24, scope: !250)
!253 = !DILocation(line: 57, column: 22, scope: !250)
!254 = !DILocation(line: 57, column: 5, scope: !250)
!255 = !DILocation(line: 58, column: 13, scope: !256)
!256 = distinct !DILexicalBlock(scope: !257, file: !80, line: 58, column: 13)
!257 = distinct !DILexicalBlock(scope: !251, file: !80, line: 57, column: 34)
!258 = !DILocation(line: 58, column: 18, scope: !256)
!259 = !DILocation(line: 58, column: 23, scope: !256)
!260 = !DILocation(line: 58, column: 26, scope: !261)
!261 = !DILexicalBlockFile(scope: !256, file: !80, discriminator: 1)
!262 = !DILocation(line: 58, column: 31, scope: !261)
!263 = !DILocation(line: 58, column: 36, scope: !261)
!264 = !DILocation(line: 58, column: 39, scope: !265)
!265 = !DILexicalBlockFile(scope: !256, file: !80, discriminator: 2)
!266 = !DILocation(line: 58, column: 44, scope: !265)
!267 = !DILocation(line: 58, column: 13, scope: !265)
!268 = !DILocation(line: 59, column: 20, scope: !256)
!269 = !DILocation(line: 59, column: 13, scope: !256)
!270 = !DILocation(line: 60, column: 5, scope: !257)
!271 = !DILocation(line: 57, column: 30, scope: !272)
!272 = !DILexicalBlockFile(scope: !251, file: !80, discriminator: 2)
!273 = !DILocation(line: 57, column: 5, scope: !272)
!274 = distinct !{!274, !275}
!275 = !DILocation(line: 57, column: 5, scope: !112)
!276 = !DILocation(line: 62, column: 12, scope: !112)
!277 = !DILocation(line: 62, column: 16, scope: !112)
!278 = !DILocation(line: 62, column: 5, scope: !112)
!279 = !DILocation(line: 63, column: 1, scope: !112)
!280 = distinct !DISubprogram(name: "ff_avc_parse_nal_units", scope: !80, file: !80, line: 71, type: !281, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !83)
!281 = !DISubroutineType(types: !282)
!282 = !{!50, !283, !60, !50}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !25, line: 352, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !25, line: 161, size: 2112, align: 64, elements: !286)
!286 = !{!287, !332, !334, !335, !336, !337, !338, !343, !344, !349, !350, !351, !352, !353, !355, !356, !360, !361, !365, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !383, !384, !385, !386, !390, !391, !392}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !285, file: !25, line: 174, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !292)
!292 = !{!293, !297, !302, !306, !307, !308, !309, !313, !319, !321, !325}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !291, file: !4, line: 72, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!296 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !291, file: !4, line: 78, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!294, !301}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !291, file: !4, line: 85, baseType: !303, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !291, file: !4, line: 93, baseType: !50, size: 32, align: 32, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !291, file: !4, line: 99, baseType: !50, size: 32, align: 32, offset: 224)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !291, file: !4, line: 108, baseType: !50, size: 32, align: 32, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !291, file: !4, line: 113, baseType: !310, size: 64, align: 64, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!301, !301, !301}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !291, file: !4, line: 123, baseType: !314, size: 64, align: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!317, !317}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !291, file: !4, line: 130, baseType: !320, size: 32, align: 32, offset: 448)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !291, file: !4, line: 136, baseType: !322, size: 64, align: 64, offset: 512)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!320, !301}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !291, file: !4, line: 142, baseType: !326, size: 64, align: 64, offset: 576)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!50, !329, !301, !294, !50}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !285, file: !25, line: 226, baseType: !333, size: 64, align: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !285, file: !25, line: 227, baseType: !50, size: 32, align: 32, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !285, file: !25, line: 228, baseType: !333, size: 64, align: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !285, file: !25, line: 229, baseType: !333, size: 64, align: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !285, file: !25, line: 233, baseType: !301, size: 64, align: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !285, file: !25, line: 235, baseType: !339, size: 64, align: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!50, !301, !342, !50}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !285, file: !25, line: 236, baseType: !339, size: 64, align: 64, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !285, file: !25, line: 237, baseType: !345, size: 64, align: 64, offset: 512)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!348, !301, !348, !50}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !59, line: 40, baseType: !73)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !285, file: !25, line: 238, baseType: !348, size: 64, align: 64, offset: 576)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !285, file: !25, line: 239, baseType: !50, size: 32, align: 32, offset: 640)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !285, file: !25, line: 240, baseType: !50, size: 32, align: 32, offset: 672)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !285, file: !25, line: 241, baseType: !50, size: 32, align: 32, offset: 704)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !285, file: !25, line: 242, baseType: !354, size: 64, align: 64, offset: 768)
!354 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !285, file: !25, line: 243, baseType: !333, size: 64, align: 64, offset: 832)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !285, file: !25, line: 244, baseType: !357, size: 64, align: 64, offset: 896)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!354, !354, !60, !51}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !285, file: !25, line: 245, baseType: !50, size: 32, align: 32, offset: 960)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !285, file: !25, line: 249, baseType: !362, size: 64, align: 64, offset: 1024)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!50, !301, !50}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !285, file: !25, line: 255, baseType: !366, size: 64, align: 64, offset: 1088)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!348, !301, !50, !348, !50}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !285, file: !25, line: 260, baseType: !50, size: 32, align: 32, offset: 1152)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !285, file: !25, line: 266, baseType: !348, size: 64, align: 64, offset: 1216)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !285, file: !25, line: 273, baseType: !50, size: 32, align: 32, offset: 1280)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !285, file: !25, line: 279, baseType: !348, size: 64, align: 64, offset: 1344)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !285, file: !25, line: 285, baseType: !50, size: 32, align: 32, offset: 1408)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !285, file: !25, line: 291, baseType: !50, size: 32, align: 32, offset: 1440)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !285, file: !25, line: 298, baseType: !50, size: 32, align: 32, offset: 1472)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !285, file: !25, line: 304, baseType: !50, size: 32, align: 32, offset: 1504)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !285, file: !25, line: 309, baseType: !294, size: 64, align: 64, offset: 1536)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !285, file: !25, line: 314, baseType: !294, size: 64, align: 64, offset: 1600)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !285, file: !25, line: 319, baseType: !380, size: 64, align: 64, offset: 1664)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!50, !301, !342, !50, !24, !348}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !285, file: !25, line: 326, baseType: !50, size: 32, align: 32, offset: 1728)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !285, file: !25, line: 331, baseType: !24, size: 32, align: 32, offset: 1760)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !285, file: !25, line: 332, baseType: !348, size: 64, align: 64, offset: 1792)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !285, file: !25, line: 338, baseType: !387, size: 64, align: 64, offset: 1856)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!50, !301}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !285, file: !25, line: 340, baseType: !348, size: 64, align: 64, offset: 1920)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !285, file: !25, line: 346, baseType: !333, size: 64, align: 64, offset: 1984)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !285, file: !25, line: 351, baseType: !50, size: 32, align: 32, offset: 2048)
!393 = !DILocalVariable(name: "pb", arg: 1, scope: !280, file: !80, line: 71, type: !283)
!394 = !DILocation(line: 71, column: 41, scope: !280)
!395 = !DILocalVariable(name: "buf_in", arg: 2, scope: !280, file: !80, line: 71, type: !60)
!396 = !DILocation(line: 71, column: 60, scope: !280)
!397 = !DILocalVariable(name: "size", arg: 3, scope: !280, file: !80, line: 71, type: !50)
!398 = !DILocation(line: 71, column: 72, scope: !280)
!399 = !DILocalVariable(name: "p", scope: !280, file: !80, line: 73, type: !60)
!400 = !DILocation(line: 73, column: 20, scope: !280)
!401 = !DILocation(line: 73, column: 24, scope: !280)
!402 = !DILocalVariable(name: "end", scope: !280, file: !80, line: 74, type: !60)
!403 = !DILocation(line: 74, column: 20, scope: !280)
!404 = !DILocation(line: 74, column: 26, scope: !280)
!405 = !DILocation(line: 74, column: 30, scope: !280)
!406 = !DILocation(line: 74, column: 28, scope: !280)
!407 = !DILocalVariable(name: "nal_start", scope: !280, file: !80, line: 75, type: !60)
!408 = !DILocation(line: 75, column: 20, scope: !280)
!409 = !DILocalVariable(name: "nal_end", scope: !280, file: !80, line: 75, type: !60)
!410 = !DILocation(line: 75, column: 32, scope: !280)
!411 = !DILocation(line: 77, column: 10, scope: !280)
!412 = !DILocation(line: 78, column: 39, scope: !280)
!413 = !DILocation(line: 78, column: 42, scope: !280)
!414 = !DILocation(line: 78, column: 17, scope: !280)
!415 = !DILocation(line: 78, column: 15, scope: !280)
!416 = !DILocation(line: 79, column: 5, scope: !280)
!417 = !DILocation(line: 80, column: 9, scope: !418)
!418 = distinct !DILexicalBlock(scope: !419, file: !80, line: 79, column: 14)
!419 = distinct !DILexicalBlock(scope: !420, file: !80, line: 79, column: 5)
!420 = distinct !DILexicalBlock(scope: !280, file: !80, line: 79, column: 5)
!421 = !DILocation(line: 80, column: 16, scope: !422)
!422 = !DILexicalBlockFile(scope: !418, file: !80, discriminator: 1)
!423 = !DILocation(line: 80, column: 28, scope: !422)
!424 = !DILocation(line: 80, column: 26, scope: !422)
!425 = !DILocation(line: 80, column: 32, scope: !422)
!426 = !DILocation(line: 80, column: 47, scope: !427)
!427 = !DILexicalBlockFile(scope: !418, file: !80, discriminator: 2)
!428 = !DILocation(line: 80, column: 36, scope: !427)
!429 = !DILocation(line: 80, column: 35, scope: !427)
!430 = !DILocation(line: 80, column: 9, scope: !431)
!431 = !DILexicalBlockFile(scope: !418, file: !80, discriminator: 3)
!432 = !DILocation(line: 80, column: 9, scope: !433)
!433 = !DILexicalBlockFile(scope: !418, file: !80, discriminator: 4)
!434 = distinct !{!434, !417}
!435 = !DILocation(line: 81, column: 13, scope: !436)
!436 = distinct !DILexicalBlock(scope: !418, file: !80, line: 81, column: 13)
!437 = !DILocation(line: 81, column: 26, scope: !436)
!438 = !DILocation(line: 81, column: 23, scope: !436)
!439 = !DILocation(line: 81, column: 13, scope: !418)
!440 = !DILocation(line: 82, column: 13, scope: !436)
!441 = !DILocation(line: 84, column: 41, scope: !418)
!442 = !DILocation(line: 84, column: 52, scope: !418)
!443 = !DILocation(line: 84, column: 19, scope: !418)
!444 = !DILocation(line: 84, column: 17, scope: !418)
!445 = !DILocation(line: 85, column: 19, scope: !418)
!446 = !DILocation(line: 85, column: 23, scope: !418)
!447 = !DILocation(line: 85, column: 33, scope: !418)
!448 = !DILocation(line: 85, column: 31, scope: !418)
!449 = !DILocation(line: 85, column: 9, scope: !418)
!450 = !DILocation(line: 86, column: 20, scope: !418)
!451 = !DILocation(line: 86, column: 24, scope: !418)
!452 = !DILocation(line: 86, column: 35, scope: !418)
!453 = !DILocation(line: 86, column: 45, scope: !418)
!454 = !DILocation(line: 86, column: 43, scope: !418)
!455 = !DILocation(line: 86, column: 9, scope: !418)
!456 = !DILocation(line: 87, column: 21, scope: !418)
!457 = !DILocation(line: 87, column: 19, scope: !418)
