; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--sbgdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--sbgdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sbg_synth_type", file: !939, line: 58, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "libavformat/sbgdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!940 = !{!941, !942, !943, !944, !945, !946}
!941 = !DIEnumerator(name: "SBG_TYPE_NONE", value: 0)
!942 = !DIEnumerator(name: "SBG_TYPE_SINE", value: 1)
!943 = !DIEnumerator(name: "SBG_TYPE_NOISE", value: 2)
!944 = !DIEnumerator(name: "SBG_TYPE_BELL", value: 3)
!945 = !DIEnumerator(name: "SBG_TYPE_MIX", value: 4)
!946 = !DIEnumerator(name: "SBG_TYPE_SPIN", value: 5)
!947 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sbg_fade_type", file: !939, line: 48, size: 32, align: 32, elements: !948)
!948 = !{!949, !950, !951}
!949 = !DIEnumerator(name: "SBG_FADE_SILENCE", value: 0)
!950 = !DIEnumerator(name: "SBG_FADE_SAME", value: 1)
!951 = !DIEnumerator(name: "SBG_FADE_ADAPT", value: 3)
!952 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ws_interval_type", file: !939, line: 138, size: 32, align: 32, elements: !953)
!953 = !{!954, !955}
!954 = !DIEnumerator(name: "WS_SINE", value: 1162758483)
!955 = !DIEnumerator(name: "WS_NOISE", value: 1397313358)
!956 = !{!957, !958, !961, !962, !963, !964, !966, !968, !974}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !959, line: 197, baseType: !960)
!959 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!960 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!961 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!962 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !967, line: 119, baseType: !960)
!967 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !970, line: 221, size: 32, align: 8, elements: !971)
!970 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!971 = !{!972}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !969, file: !970, line: 221, baseType: !973, size: 32, align: 32)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !967, line: 51, baseType: !962)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !970, line: 220, size: 64, align: 8, elements: !976)
!976 = !{!977}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !975, file: !970, line: 220, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !967, line: 55, baseType: !979)
!979 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!980 = !{!981, !2219, !2220}
!981 = distinct !DIGlobalVariable(name: "ff_sbg_demuxer", scope: !0, file: !939, line: 1503, type: !982, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_sbg_demuxer)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !984)
!984 = !{!985, !988, !989, !990, !991, !1001, !1080, !1081, !1083, !1084, !1085, !1099, !2200, !2201, !2202, !2206, !2210, !2211, !2212, !2216, !2217, !2218}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !983, file: !919, line: 638, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !983, file: !919, line: 645, baseType: !986, size: 64, align: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !983, file: !919, line: 652, baseType: !961, size: 32, align: 32, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !983, file: !919, line: 659, baseType: !986, size: 64, align: 64, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !983, file: !919, line: 661, baseType: !992, size: 64, align: 64, offset: 256)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !997, line: 44, size: 64, align: 32, elements: !998)
!997 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !996, file: !997, line: 45, baseType: !3, size: 32, align: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !996, file: !997, line: 46, baseType: !962, size: 32, align: 32, offset: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !983, file: !919, line: 663, baseType: !1002, size: 64, align: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1006)
!1006 = !{!1007, !1008, !1012, !1039, !1040, !1041, !1042, !1046, !1052, !1054, !1058}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1005, file: !486, line: 72, baseType: !986, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1005, file: !486, line: 78, baseType: !1009, size: 64, align: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!986, !957}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1005, file: !486, line: 85, baseType: !1013, size: 64, align: 64, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1035, !1036, !1037, !1038}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1015, file: !464, line: 247, baseType: !986, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1015, file: !464, line: 253, baseType: !986, size: 64, align: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1015, file: !464, line: 259, baseType: !961, size: 32, align: 32, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1015, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1015, file: !464, line: 271, baseType: !1022, size: 64, align: 64, offset: 192)
!1022 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1015, file: !464, line: 265, size: 64, align: 64, elements: !1023)
!1023 = !{!1024, !1025, !1027, !1028}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1022, file: !464, line: 266, baseType: !958, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1022, file: !464, line: 267, baseType: !1026, size: 64, align: 64)
!1026 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1022, file: !464, line: 268, baseType: !986, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1022, file: !464, line: 270, baseType: !1029, size: 64, align: 32)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1030, line: 61, baseType: !1031)
!1030 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1030, line: 58, size: 64, align: 32, elements: !1032)
!1032 = !{!1033, !1034}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1031, file: !1030, line: 59, baseType: !961, size: 32, align: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1031, file: !1030, line: 60, baseType: !961, size: 32, align: 32, offset: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1015, file: !464, line: 272, baseType: !1026, size: 64, align: 64, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1015, file: !464, line: 273, baseType: !1026, size: 64, align: 64, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1015, file: !464, line: 275, baseType: !961, size: 32, align: 32, offset: 384)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1015, file: !464, line: 300, baseType: !986, size: 64, align: 64, offset: 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1005, file: !486, line: 93, baseType: !961, size: 32, align: 32, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1005, file: !486, line: 99, baseType: !961, size: 32, align: 32, offset: 224)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1005, file: !486, line: 108, baseType: !961, size: 32, align: 32, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1005, file: !486, line: 113, baseType: !1043, size: 64, align: 64, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!957, !957, !957}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1005, file: !486, line: 123, baseType: !1047, size: 64, align: 64, offset: 384)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!1050, !1050}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1005, file: !486, line: 130, baseType: !1053, size: 32, align: 32, offset: 448)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1005, file: !486, line: 136, baseType: !1055, size: 64, align: 64, offset: 512)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!1053, !957}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1005, file: !486, line: 142, baseType: !1059, size: 64, align: 64, offset: 576)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!961, !1062, !957, !986, !961}
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1065)
!1065 = !{!1066, !1078, !1079}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1064, file: !464, line: 360, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1070)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075, !1076, !1077}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1070, file: !464, line: 307, baseType: !986, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1070, file: !464, line: 313, baseType: !1026, size: 64, align: 64, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1070, file: !464, line: 313, baseType: !1026, size: 64, align: 64, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1070, file: !464, line: 318, baseType: !1026, size: 64, align: 64, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1070, file: !464, line: 318, baseType: !1026, size: 64, align: 64, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1070, file: !464, line: 323, baseType: !961, size: 32, align: 32, offset: 320)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1064, file: !464, line: 364, baseType: !961, size: 32, align: 32, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1064, file: !464, line: 368, baseType: !961, size: 32, align: 32, offset: 96)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !983, file: !919, line: 670, baseType: !986, size: 64, align: 64, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !983, file: !919, line: 679, baseType: !1082, size: 64, align: 64, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !983, file: !919, line: 684, baseType: !961, size: 32, align: 32, offset: 512)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !983, file: !919, line: 689, baseType: !961, size: 32, align: 32, offset: 544)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !983, file: !919, line: 696, baseType: !1086, size: 64, align: 64, offset: 576)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!961, !1089}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1092)
!1092 = !{!1093, !1094, !1097, !1098}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1091, file: !919, line: 449, baseType: !986, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1091, file: !919, line: 450, baseType: !1095, size: 64, align: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1091, file: !919, line: 451, baseType: !961, size: 32, align: 32, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1091, file: !919, line: 452, baseType: !986, size: 64, align: 64, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !983, file: !919, line: 703, baseType: !1100, size: 64, align: 64, offset: 640)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!961, !1103}
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1105)
!1105 = !{!1106, !1107, !1108, !1298, !1299, !1364, !1365, !1366, !2057, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2111, !2112, !2113, !2114, !2115, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2166, !2167, !2170, !2171, !2172, !2173, !2174, !2175, !2177, !2178, !2179, !2180, !2188, !2189, !2193, !2197, !2198, !2199}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1104, file: !919, line: 1342, baseType: !1002, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1104, file: !919, line: 1349, baseType: !1082, size: 64, align: 64, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1104, file: !919, line: 1356, baseType: !1109, size: 64, align: 64, offset: 128)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1111)
!1111 = !{!1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1165, !1166, !1170, !1174, !1179, !1185, !1273, !1279, !1285, !1286, !1287, !1288, !1292}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1110, file: !919, line: 498, baseType: !986, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1110, file: !919, line: 504, baseType: !986, size: 64, align: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1110, file: !919, line: 505, baseType: !986, size: 64, align: 64, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1110, file: !919, line: 506, baseType: !986, size: 64, align: 64, offset: 192)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1110, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1110, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1110, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1110, file: !919, line: 517, baseType: !961, size: 32, align: 32, offset: 352)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1110, file: !919, line: 523, baseType: !992, size: 64, align: 64, offset: 384)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1110, file: !919, line: 526, baseType: !1002, size: 64, align: 64, offset: 448)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1110, file: !919, line: 535, baseType: !1109, size: 64, align: 64, offset: 512)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1110, file: !919, line: 539, baseType: !961, size: 32, align: 32, offset: 576)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1110, file: !919, line: 541, baseType: !1100, size: 64, align: 64, offset: 640)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1110, file: !919, line: 549, baseType: !1126, size: 64, align: 64, offset: 704)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!961, !1103, !1129}
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1132)
!1132 = !{!1133, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1161, !1162, !1163, !1164}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1131, file: !4, line: 1451, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1136, line: 94, baseType: !1137)
!1136 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1136, line: 81, size: 192, align: 64, elements: !1138)
!1138 = !{!1139, !1143, !1146}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1137, file: !1136, line: 82, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1136, line: 73, baseType: !1142)
!1142 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1136, line: 73, flags: DIFlagFwdDecl)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1137, file: !1136, line: 89, baseType: !1144, size: 64, align: 64, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !967, line: 48, baseType: !1096)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1137, file: !1136, line: 93, baseType: !961, size: 32, align: 32, offset: 128)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1131, file: !4, line: 1461, baseType: !958, size: 64, align: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1131, file: !4, line: 1467, baseType: !958, size: 64, align: 64, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1131, file: !4, line: 1468, baseType: !1144, size: 64, align: 64, offset: 192)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1131, file: !4, line: 1469, baseType: !961, size: 32, align: 32, offset: 256)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1131, file: !4, line: 1470, baseType: !961, size: 32, align: 32, offset: 288)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1131, file: !4, line: 1474, baseType: !961, size: 32, align: 32, offset: 320)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1131, file: !4, line: 1479, baseType: !1154, size: 64, align: 64, offset: 384)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1157)
!1157 = !{!1158, !1159, !1160}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1156, file: !4, line: 1412, baseType: !1144, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1156, file: !4, line: 1413, baseType: !961, size: 32, align: 32, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1156, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1131, file: !4, line: 1480, baseType: !961, size: 32, align: 32, offset: 448)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1131, file: !4, line: 1486, baseType: !958, size: 64, align: 64, offset: 512)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1131, file: !4, line: 1488, baseType: !958, size: 64, align: 64, offset: 576)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1131, file: !4, line: 1497, baseType: !958, size: 64, align: 64, offset: 640)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1110, file: !919, line: 550, baseType: !1100, size: 64, align: 64, offset: 768)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1110, file: !919, line: 554, baseType: !1167, size: 64, align: 64, offset: 832)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!961, !1103, !1129, !1129, !961}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1110, file: !919, line: 563, baseType: !1171, size: 64, align: 64, offset: 896)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!961, !3, !961}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1110, file: !919, line: 565, baseType: !1175, size: 64, align: 64, offset: 960)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{null, !1103, !961, !1178, !1178}
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1110, file: !919, line: 570, baseType: !1180, size: 64, align: 64, offset: 1024)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!961, !1103, !961, !957, !1183}
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1184, line: 216, baseType: !979)
!1184 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1110, file: !919, line: 581, baseType: !1186, size: 64, align: 64, offset: 1088)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!961, !1103, !961, !1189, !962}
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1193)
!1193 = !{!1194, !1198, !1200, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1227, !1229, !1230, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1192, file: !548, line: 282, baseType: !1195, size: 512, align: 64)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1144, size: 512, align: 64, elements: !1196)
!1196 = !{!1197}
!1197 = !DISubrange(count: 8)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1192, file: !548, line: 299, baseType: !1199, size: 256, align: 32, offset: 512)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 256, align: 32, elements: !1196)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1192, file: !548, line: 315, baseType: !1201, size: 64, align: 64, offset: 768)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1192, file: !548, line: 326, baseType: !961, size: 32, align: 32, offset: 832)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1192, file: !548, line: 326, baseType: !961, size: 32, align: 32, offset: 864)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1192, file: !548, line: 334, baseType: !961, size: 32, align: 32, offset: 896)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1192, file: !548, line: 341, baseType: !961, size: 32, align: 32, offset: 928)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1192, file: !548, line: 346, baseType: !961, size: 32, align: 32, offset: 960)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1192, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1192, file: !548, line: 356, baseType: !1029, size: 64, align: 32, offset: 1024)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1192, file: !548, line: 361, baseType: !958, size: 64, align: 64, offset: 1088)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1192, file: !548, line: 369, baseType: !958, size: 64, align: 64, offset: 1152)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1192, file: !548, line: 377, baseType: !958, size: 64, align: 64, offset: 1216)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1192, file: !548, line: 382, baseType: !961, size: 32, align: 32, offset: 1280)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1192, file: !548, line: 386, baseType: !961, size: 32, align: 32, offset: 1312)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1192, file: !548, line: 391, baseType: !961, size: 32, align: 32, offset: 1344)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1192, file: !548, line: 396, baseType: !957, size: 64, align: 64, offset: 1408)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1192, file: !548, line: 403, baseType: !1217, size: 512, align: 64, offset: 1472)
!1217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 512, align: 64, elements: !1196)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1192, file: !548, line: 410, baseType: !961, size: 32, align: 32, offset: 1984)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1192, file: !548, line: 415, baseType: !961, size: 32, align: 32, offset: 2016)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1192, file: !548, line: 420, baseType: !961, size: 32, align: 32, offset: 2048)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1192, file: !548, line: 425, baseType: !961, size: 32, align: 32, offset: 2080)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1192, file: !548, line: 435, baseType: !958, size: 64, align: 64, offset: 2112)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1192, file: !548, line: 440, baseType: !961, size: 32, align: 32, offset: 2176)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1192, file: !548, line: 445, baseType: !978, size: 64, align: 64, offset: 2240)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1192, file: !548, line: 459, baseType: !1226, size: 512, align: 64, offset: 2304)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1134, size: 512, align: 64, elements: !1196)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1192, file: !548, line: 473, baseType: !1228, size: 64, align: 64, offset: 2816)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1192, file: !548, line: 477, baseType: !961, size: 32, align: 32, offset: 2880)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1192, file: !548, line: 479, baseType: !1231, size: 64, align: 64, offset: 2944)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1235)
!1235 = !{!1236, !1237, !1238, !1239, !1244}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1234, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1234, file: !548, line: 203, baseType: !1144, size: 64, align: 64, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1234, file: !548, line: 204, baseType: !961, size: 32, align: 32, offset: 128)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1234, file: !548, line: 205, baseType: !1240, size: 64, align: 64, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1242, line: 86, baseType: !1243)
!1242 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1243 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1242, line: 86, flags: DIFlagFwdDecl)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1234, file: !548, line: 206, baseType: !1134, size: 64, align: 64, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1192, file: !548, line: 480, baseType: !961, size: 32, align: 32, offset: 3008)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1192, file: !548, line: 505, baseType: !961, size: 32, align: 32, offset: 3040)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1192, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1192, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1192, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1192, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1192, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1192, file: !548, line: 532, baseType: !958, size: 64, align: 64, offset: 3264)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1192, file: !548, line: 539, baseType: !958, size: 64, align: 64, offset: 3328)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1192, file: !548, line: 547, baseType: !958, size: 64, align: 64, offset: 3392)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1192, file: !548, line: 554, baseType: !1240, size: 64, align: 64, offset: 3456)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1192, file: !548, line: 563, baseType: !961, size: 32, align: 32, offset: 3520)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1192, file: !548, line: 572, baseType: !961, size: 32, align: 32, offset: 3552)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1192, file: !548, line: 581, baseType: !961, size: 32, align: 32, offset: 3584)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1192, file: !548, line: 588, baseType: !1260, size: 64, align: 64, offset: 3648)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !959, line: 194, baseType: !1262)
!1262 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1192, file: !548, line: 593, baseType: !961, size: 32, align: 32, offset: 3712)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1192, file: !548, line: 596, baseType: !961, size: 32, align: 32, offset: 3744)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1192, file: !548, line: 599, baseType: !1134, size: 64, align: 64, offset: 3776)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1192, file: !548, line: 605, baseType: !1134, size: 64, align: 64, offset: 3840)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1192, file: !548, line: 616, baseType: !1134, size: 64, align: 64, offset: 3904)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1192, file: !548, line: 626, baseType: !1183, size: 64, align: 64, offset: 3968)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1192, file: !548, line: 627, baseType: !1183, size: 64, align: 64, offset: 4032)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1192, file: !548, line: 628, baseType: !1183, size: 64, align: 64, offset: 4096)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1192, file: !548, line: 629, baseType: !1183, size: 64, align: 64, offset: 4160)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1192, file: !548, line: 645, baseType: !1134, size: 64, align: 64, offset: 4224)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1110, file: !919, line: 587, baseType: !1274, size: 64, align: 64, offset: 1152)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!961, !1103, !1277}
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1110, file: !919, line: 592, baseType: !1280, size: 64, align: 64, offset: 1216)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!961, !1103, !1283}
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1110, file: !919, line: 597, baseType: !1280, size: 64, align: 64, offset: 1280)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1110, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1110, file: !919, line: 608, baseType: !1100, size: 64, align: 64, offset: 1408)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1110, file: !919, line: 617, baseType: !1289, size: 64, align: 64, offset: 1472)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{null, !1103}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1110, file: !919, line: 623, baseType: !1293, size: 64, align: 64, offset: 1536)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!961, !1103, !1296}
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1130)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1104, file: !919, line: 1365, baseType: !957, size: 64, align: 64, offset: 192)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1104, file: !919, line: 1379, baseType: !1300, size: 64, align: 64, offset: 256)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1302)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1303)
!1303 = !{!1304, !1305, !1306, !1307, !1308, !1309, !1310, !1314, !1315, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1331, !1332, !1336, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1354, !1355, !1356, !1357, !1361, !1362, !1363}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1302, file: !650, line: 174, baseType: !1002, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1302, file: !650, line: 226, baseType: !1095, size: 64, align: 64, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1302, file: !650, line: 227, baseType: !961, size: 32, align: 32, offset: 128)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1302, file: !650, line: 228, baseType: !1095, size: 64, align: 64, offset: 192)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1302, file: !650, line: 229, baseType: !1095, size: 64, align: 64, offset: 256)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1302, file: !650, line: 233, baseType: !957, size: 64, align: 64, offset: 320)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1302, file: !650, line: 235, baseType: !1311, size: 64, align: 64, offset: 384)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!961, !957, !1144, !961}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1302, file: !650, line: 236, baseType: !1311, size: 64, align: 64, offset: 448)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1302, file: !650, line: 237, baseType: !1316, size: 64, align: 64, offset: 512)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{!958, !957, !958, !961}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1302, file: !650, line: 238, baseType: !958, size: 64, align: 64, offset: 576)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1302, file: !650, line: 239, baseType: !961, size: 32, align: 32, offset: 640)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1302, file: !650, line: 240, baseType: !961, size: 32, align: 32, offset: 672)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1302, file: !650, line: 241, baseType: !961, size: 32, align: 32, offset: 704)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1302, file: !650, line: 242, baseType: !979, size: 64, align: 64, offset: 768)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1302, file: !650, line: 243, baseType: !1095, size: 64, align: 64, offset: 832)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1302, file: !650, line: 244, baseType: !1326, size: 64, align: 64, offset: 896)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!979, !979, !1329, !962}
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1145)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1302, file: !650, line: 245, baseType: !961, size: 32, align: 32, offset: 960)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1302, file: !650, line: 249, baseType: !1333, size: 64, align: 64, offset: 1024)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{!961, !957, !961}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1302, file: !650, line: 255, baseType: !1337, size: 64, align: 64, offset: 1088)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{!958, !957, !961, !958, !961}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1302, file: !650, line: 260, baseType: !961, size: 32, align: 32, offset: 1152)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1302, file: !650, line: 266, baseType: !958, size: 64, align: 64, offset: 1216)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1302, file: !650, line: 273, baseType: !961, size: 32, align: 32, offset: 1280)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1302, file: !650, line: 279, baseType: !958, size: 64, align: 64, offset: 1344)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1302, file: !650, line: 285, baseType: !961, size: 32, align: 32, offset: 1408)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1302, file: !650, line: 291, baseType: !961, size: 32, align: 32, offset: 1440)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1302, file: !650, line: 298, baseType: !961, size: 32, align: 32, offset: 1472)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1302, file: !650, line: 304, baseType: !961, size: 32, align: 32, offset: 1504)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1302, file: !650, line: 309, baseType: !986, size: 64, align: 64, offset: 1536)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1302, file: !650, line: 314, baseType: !986, size: 64, align: 64, offset: 1600)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1302, file: !650, line: 319, baseType: !1351, size: 64, align: 64, offset: 1664)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{!961, !957, !1144, !961, !649, !958}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1302, file: !650, line: 326, baseType: !961, size: 32, align: 32, offset: 1728)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1302, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1302, file: !650, line: 332, baseType: !958, size: 64, align: 64, offset: 1792)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1302, file: !650, line: 338, baseType: !1358, size: 64, align: 64, offset: 1856)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DISubroutineType(types: !1360)
!1360 = !{!961, !957}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1302, file: !650, line: 340, baseType: !958, size: 64, align: 64, offset: 1920)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1302, file: !650, line: 346, baseType: !1095, size: 64, align: 64, offset: 1984)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1302, file: !650, line: 351, baseType: !961, size: 32, align: 32, offset: 2048)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1104, file: !919, line: 1386, baseType: !961, size: 32, align: 32, offset: 320)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1104, file: !919, line: 1393, baseType: !962, size: 32, align: 32, offset: 352)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1104, file: !919, line: 1405, baseType: !1367, size: 64, align: 64, offset: 384)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1370)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1371)
!1371 = !{!1372, !1373, !1374, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1843, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1943, !1949, !1950, !1954, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1986, !1987, !1988, !1989, !1990, !1991}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1370, file: !919, line: 866, baseType: !961, size: 32, align: 32)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1370, file: !919, line: 872, baseType: !961, size: 32, align: 32, offset: 32)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1370, file: !919, line: 878, baseType: !1375, size: 64, align: 64, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1378)
!1378 = !{!1379, !1380, !1381, !1382, !1518, !1519, !1520, !1521, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1547, !1551, !1552, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1731, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1377, file: !4, line: 1561, baseType: !1002, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1377, file: !4, line: 1562, baseType: !961, size: 32, align: 32, offset: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1377, file: !4, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1377, file: !4, line: 1565, baseType: !1383, size: 64, align: 64, offset: 128)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1385)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1386)
!1386 = !{!1387, !1388, !1389, !1390, !1391, !1392, !1395, !1398, !1401, !1404, !1407, !1408, !1409, !1417, !1418, !1419, !1421, !1425, !1431, !1436, !1440, !1441, !1483, !1490, !1494, !1495, !1499, !1503, !1507, !1511, !1512, !1513}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1385, file: !4, line: 3475, baseType: !986, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1385, file: !4, line: 3480, baseType: !986, size: 64, align: 64, offset: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1385, file: !4, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1385, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1385, file: !4, line: 3487, baseType: !961, size: 32, align: 32, offset: 192)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1385, file: !4, line: 3488, baseType: !1393, size: 64, align: 64, offset: 256)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1385, file: !4, line: 3489, baseType: !1396, size: 64, align: 64, offset: 320)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1385, file: !4, line: 3490, baseType: !1399, size: 64, align: 64, offset: 384)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1385, file: !4, line: 3491, baseType: !1402, size: 64, align: 64, offset: 448)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1385, file: !4, line: 3492, baseType: !1405, size: 64, align: 64, offset: 512)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1385, file: !4, line: 3493, baseType: !1145, size: 8, align: 8, offset: 576)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1385, file: !4, line: 3494, baseType: !1002, size: 64, align: 64, offset: 640)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1385, file: !4, line: 3495, baseType: !1410, size: 64, align: 64, offset: 704)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1412)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1413)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1414)
!1414 = !{!1415, !1416}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1413, file: !4, line: 3402, baseType: !961, size: 32, align: 32)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1413, file: !4, line: 3403, baseType: !986, size: 64, align: 64, offset: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1385, file: !4, line: 3507, baseType: !986, size: 64, align: 64, offset: 768)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1385, file: !4, line: 3516, baseType: !961, size: 32, align: 32, offset: 832)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1385, file: !4, line: 3517, baseType: !1420, size: 64, align: 64, offset: 896)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1385, file: !4, line: 3527, baseType: !1422, size: 64, align: 64, offset: 960)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{!961, !1375}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1385, file: !4, line: 3535, baseType: !1426, size: 64, align: 64, offset: 1024)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DISubroutineType(types: !1428)
!1428 = !{!961, !1375, !1429}
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1376)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1385, file: !4, line: 3541, baseType: !1432, size: 64, align: 64, offset: 1088)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1434)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1435)
!1435 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1385, file: !4, line: 3549, baseType: !1437, size: 64, align: 64, offset: 1152)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DISubroutineType(types: !1439)
!1439 = !{null, !1420}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1385, file: !4, line: 3551, baseType: !1422, size: 64, align: 64, offset: 1216)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1385, file: !4, line: 3552, baseType: !1442, size: 64, align: 64, offset: 1280)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{!961, !1375, !1144, !961, !1445}
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1447)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1448)
!1448 = !{!1449, !1452, !1453, !1454, !1455, !1482}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1447, file: !4, line: 3921, baseType: !1450, size: 16, align: 16)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !967, line: 49, baseType: !1451)
!1451 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1447, file: !4, line: 3922, baseType: !973, size: 32, align: 32, offset: 32)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1447, file: !4, line: 3923, baseType: !973, size: 32, align: 32, offset: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1447, file: !4, line: 3924, baseType: !962, size: 32, align: 32, offset: 96)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1447, file: !4, line: 3925, baseType: !1456, size: 64, align: 64, offset: 128)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1459)
!1459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1460)
!1460 = !{!1461, !1462, !1463, !1464, !1465, !1466, !1472, !1476, !1478, !1479, !1480, !1481}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1459, file: !4, line: 3886, baseType: !961, size: 32, align: 32)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1459, file: !4, line: 3887, baseType: !961, size: 32, align: 32, offset: 32)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1459, file: !4, line: 3888, baseType: !961, size: 32, align: 32, offset: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1459, file: !4, line: 3889, baseType: !961, size: 32, align: 32, offset: 96)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1459, file: !4, line: 3890, baseType: !961, size: 32, align: 32, offset: 128)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1459, file: !4, line: 3897, baseType: !1467, size: 768, align: 64, offset: 192)
!1467 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1468)
!1468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1469)
!1469 = !{!1470, !1471}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1468, file: !4, line: 3855, baseType: !1195, size: 512, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1468, file: !4, line: 3857, baseType: !1199, size: 256, align: 32, offset: 512)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1459, file: !4, line: 3903, baseType: !1473, size: 256, align: 64, offset: 960)
!1473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1144, size: 256, align: 64, elements: !1474)
!1474 = !{!1475}
!1475 = !DISubrange(count: 4)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1459, file: !4, line: 3904, baseType: !1477, size: 128, align: 32, offset: 1216)
!1477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 128, align: 32, elements: !1474)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1459, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1459, file: !4, line: 3908, baseType: !964, size: 64, align: 64, offset: 1408)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1459, file: !4, line: 3915, baseType: !964, size: 64, align: 64, offset: 1472)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1459, file: !4, line: 3917, baseType: !961, size: 32, align: 32, offset: 1536)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1447, file: !4, line: 3926, baseType: !958, size: 64, align: 64, offset: 192)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1385, file: !4, line: 3564, baseType: !1484, size: 64, align: 64, offset: 1344)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!961, !1375, !1129, !1487, !1489}
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1191)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1385, file: !4, line: 3566, baseType: !1491, size: 64, align: 64, offset: 1408)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!961, !1375, !957, !1489, !1129}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1385, file: !4, line: 3567, baseType: !1422, size: 64, align: 64, offset: 1472)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1385, file: !4, line: 3576, baseType: !1496, size: 64, align: 64, offset: 1536)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{!961, !1375, !1487}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1385, file: !4, line: 3577, baseType: !1500, size: 64, align: 64, offset: 1600)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{!961, !1375, !1129}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1385, file: !4, line: 3584, baseType: !1504, size: 64, align: 64, offset: 1664)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{!961, !1375, !1190}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1385, file: !4, line: 3589, baseType: !1508, size: 64, align: 64, offset: 1728)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{null, !1375}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1385, file: !4, line: 3594, baseType: !961, size: 32, align: 32, offset: 1792)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1385, file: !4, line: 3600, baseType: !986, size: 64, align: 64, offset: 1856)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1385, file: !4, line: 3609, baseType: !1514, size: 64, align: 64, offset: 1920)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1517)
!1517 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1377, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1377, file: !4, line: 1581, baseType: !962, size: 32, align: 32, offset: 224)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1377, file: !4, line: 1583, baseType: !957, size: 64, align: 64, offset: 256)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1377, file: !4, line: 1591, baseType: !1522, size: 64, align: 64, offset: 320)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1377, file: !4, line: 1598, baseType: !957, size: 64, align: 64, offset: 384)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1377, file: !4, line: 1606, baseType: !958, size: 64, align: 64, offset: 448)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1377, file: !4, line: 1614, baseType: !961, size: 32, align: 32, offset: 512)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1377, file: !4, line: 1622, baseType: !961, size: 32, align: 32, offset: 544)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1377, file: !4, line: 1628, baseType: !961, size: 32, align: 32, offset: 576)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1377, file: !4, line: 1636, baseType: !961, size: 32, align: 32, offset: 608)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1377, file: !4, line: 1643, baseType: !961, size: 32, align: 32, offset: 640)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1377, file: !4, line: 1657, baseType: !1144, size: 64, align: 64, offset: 704)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1377, file: !4, line: 1658, baseType: !961, size: 32, align: 32, offset: 768)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1377, file: !4, line: 1679, baseType: !1029, size: 64, align: 32, offset: 800)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1377, file: !4, line: 1688, baseType: !961, size: 32, align: 32, offset: 864)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1377, file: !4, line: 1712, baseType: !961, size: 32, align: 32, offset: 896)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1377, file: !4, line: 1729, baseType: !961, size: 32, align: 32, offset: 928)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1377, file: !4, line: 1729, baseType: !961, size: 32, align: 32, offset: 960)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1377, file: !4, line: 1744, baseType: !961, size: 32, align: 32, offset: 992)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1377, file: !4, line: 1744, baseType: !961, size: 32, align: 32, offset: 1024)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1377, file: !4, line: 1751, baseType: !961, size: 32, align: 32, offset: 1056)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1377, file: !4, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1377, file: !4, line: 1791, baseType: !1543, size: 64, align: 64, offset: 1152)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DISubroutineType(types: !1545)
!1545 = !{null, !1546, !1487, !1489, !961, !961, !961}
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1377, file: !4, line: 1808, baseType: !1548, size: 64, align: 64, offset: 1216)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DISubroutineType(types: !1550)
!1550 = !{!667, !1546, !1396}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1377, file: !4, line: 1816, baseType: !961, size: 32, align: 32, offset: 1280)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1377, file: !4, line: 1825, baseType: !1553, size: 32, align: 32, offset: 1312)
!1553 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1377, file: !4, line: 1830, baseType: !961, size: 32, align: 32, offset: 1344)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1377, file: !4, line: 1838, baseType: !1553, size: 32, align: 32, offset: 1376)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1377, file: !4, line: 1846, baseType: !961, size: 32, align: 32, offset: 1408)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1377, file: !4, line: 1851, baseType: !961, size: 32, align: 32, offset: 1440)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1377, file: !4, line: 1861, baseType: !1553, size: 32, align: 32, offset: 1472)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1377, file: !4, line: 1868, baseType: !1553, size: 32, align: 32, offset: 1504)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1377, file: !4, line: 1875, baseType: !1553, size: 32, align: 32, offset: 1536)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1377, file: !4, line: 1882, baseType: !1553, size: 32, align: 32, offset: 1568)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1377, file: !4, line: 1889, baseType: !1553, size: 32, align: 32, offset: 1600)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1377, file: !4, line: 1896, baseType: !1553, size: 32, align: 32, offset: 1632)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1377, file: !4, line: 1903, baseType: !1553, size: 32, align: 32, offset: 1664)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1377, file: !4, line: 1910, baseType: !961, size: 32, align: 32, offset: 1696)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1377, file: !4, line: 1915, baseType: !961, size: 32, align: 32, offset: 1728)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1377, file: !4, line: 1926, baseType: !1489, size: 64, align: 64, offset: 1792)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1377, file: !4, line: 1935, baseType: !1029, size: 64, align: 32, offset: 1856)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1377, file: !4, line: 1942, baseType: !961, size: 32, align: 32, offset: 1920)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1377, file: !4, line: 1948, baseType: !961, size: 32, align: 32, offset: 1952)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1377, file: !4, line: 1954, baseType: !961, size: 32, align: 32, offset: 1984)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1377, file: !4, line: 1960, baseType: !961, size: 32, align: 32, offset: 2016)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1377, file: !4, line: 1984, baseType: !961, size: 32, align: 32, offset: 2048)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1377, file: !4, line: 1991, baseType: !961, size: 32, align: 32, offset: 2080)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1377, file: !4, line: 1996, baseType: !961, size: 32, align: 32, offset: 2112)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1377, file: !4, line: 2004, baseType: !961, size: 32, align: 32, offset: 2144)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1377, file: !4, line: 2011, baseType: !961, size: 32, align: 32, offset: 2176)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1377, file: !4, line: 2018, baseType: !961, size: 32, align: 32, offset: 2208)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1377, file: !4, line: 2027, baseType: !961, size: 32, align: 32, offset: 2240)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1377, file: !4, line: 2034, baseType: !961, size: 32, align: 32, offset: 2272)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1377, file: !4, line: 2044, baseType: !961, size: 32, align: 32, offset: 2304)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1377, file: !4, line: 2054, baseType: !1583, size: 64, align: 64, offset: 2368)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1377, file: !4, line: 2061, baseType: !1583, size: 64, align: 64, offset: 2432)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1377, file: !4, line: 2066, baseType: !961, size: 32, align: 32, offset: 2496)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1377, file: !4, line: 2070, baseType: !961, size: 32, align: 32, offset: 2528)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1377, file: !4, line: 2078, baseType: !961, size: 32, align: 32, offset: 2560)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1377, file: !4, line: 2085, baseType: !961, size: 32, align: 32, offset: 2592)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1377, file: !4, line: 2092, baseType: !961, size: 32, align: 32, offset: 2624)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1377, file: !4, line: 2099, baseType: !961, size: 32, align: 32, offset: 2656)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1377, file: !4, line: 2106, baseType: !961, size: 32, align: 32, offset: 2688)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1377, file: !4, line: 2113, baseType: !961, size: 32, align: 32, offset: 2720)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1377, file: !4, line: 2120, baseType: !961, size: 32, align: 32, offset: 2752)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1377, file: !4, line: 2125, baseType: !961, size: 32, align: 32, offset: 2784)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1377, file: !4, line: 2133, baseType: !961, size: 32, align: 32, offset: 2816)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1377, file: !4, line: 2140, baseType: !961, size: 32, align: 32, offset: 2848)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1377, file: !4, line: 2145, baseType: !961, size: 32, align: 32, offset: 2880)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1377, file: !4, line: 2153, baseType: !961, size: 32, align: 32, offset: 2912)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1377, file: !4, line: 2158, baseType: !961, size: 32, align: 32, offset: 2944)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1377, file: !4, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1377, file: !4, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1377, file: !4, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1377, file: !4, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1377, file: !4, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1377, file: !4, line: 2203, baseType: !961, size: 32, align: 32, offset: 3136)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1377, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1377, file: !4, line: 2212, baseType: !961, size: 32, align: 32, offset: 3200)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1377, file: !4, line: 2213, baseType: !961, size: 32, align: 32, offset: 3232)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1377, file: !4, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1377, file: !4, line: 2232, baseType: !961, size: 32, align: 32, offset: 3296)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1377, file: !4, line: 2243, baseType: !961, size: 32, align: 32, offset: 3328)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1377, file: !4, line: 2249, baseType: !961, size: 32, align: 32, offset: 3360)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1377, file: !4, line: 2256, baseType: !961, size: 32, align: 32, offset: 3392)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1377, file: !4, line: 2263, baseType: !978, size: 64, align: 64, offset: 3456)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1377, file: !4, line: 2270, baseType: !978, size: 64, align: 64, offset: 3520)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1377, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1377, file: !4, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1377, file: !4, line: 2367, baseType: !1619, size: 64, align: 64, offset: 3648)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DISubroutineType(types: !1621)
!1621 = !{!961, !1546, !1190, !961}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1377, file: !4, line: 2383, baseType: !961, size: 32, align: 32, offset: 3712)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1377, file: !4, line: 2386, baseType: !1553, size: 32, align: 32, offset: 3744)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1377, file: !4, line: 2387, baseType: !1553, size: 32, align: 32, offset: 3776)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1377, file: !4, line: 2394, baseType: !961, size: 32, align: 32, offset: 3808)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1377, file: !4, line: 2401, baseType: !961, size: 32, align: 32, offset: 3840)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1377, file: !4, line: 2408, baseType: !961, size: 32, align: 32, offset: 3872)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1377, file: !4, line: 2415, baseType: !961, size: 32, align: 32, offset: 3904)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1377, file: !4, line: 2422, baseType: !961, size: 32, align: 32, offset: 3936)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1377, file: !4, line: 2423, baseType: !1631, size: 64, align: 64, offset: 3968)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64, align: 64)
!1632 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1633)
!1633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1634)
!1634 = !{!1635, !1636, !1637, !1638}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1633, file: !4, line: 827, baseType: !961, size: 32, align: 32)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1633, file: !4, line: 828, baseType: !961, size: 32, align: 32, offset: 32)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1633, file: !4, line: 829, baseType: !961, size: 32, align: 32, offset: 64)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1633, file: !4, line: 830, baseType: !1553, size: 32, align: 32, offset: 96)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1377, file: !4, line: 2430, baseType: !958, size: 64, align: 64, offset: 4032)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1377, file: !4, line: 2437, baseType: !958, size: 64, align: 64, offset: 4096)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1377, file: !4, line: 2444, baseType: !1553, size: 32, align: 32, offset: 4160)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1377, file: !4, line: 2451, baseType: !1553, size: 32, align: 32, offset: 4192)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1377, file: !4, line: 2458, baseType: !961, size: 32, align: 32, offset: 4224)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1377, file: !4, line: 2469, baseType: !961, size: 32, align: 32, offset: 4256)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1377, file: !4, line: 2475, baseType: !961, size: 32, align: 32, offset: 4288)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1377, file: !4, line: 2481, baseType: !961, size: 32, align: 32, offset: 4320)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1377, file: !4, line: 2485, baseType: !961, size: 32, align: 32, offset: 4352)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1377, file: !4, line: 2489, baseType: !961, size: 32, align: 32, offset: 4384)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1377, file: !4, line: 2493, baseType: !961, size: 32, align: 32, offset: 4416)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1377, file: !4, line: 2501, baseType: !961, size: 32, align: 32, offset: 4448)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1377, file: !4, line: 2506, baseType: !961, size: 32, align: 32, offset: 4480)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1377, file: !4, line: 2510, baseType: !961, size: 32, align: 32, offset: 4512)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1377, file: !4, line: 2514, baseType: !958, size: 64, align: 64, offset: 4544)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1377, file: !4, line: 2528, baseType: !1655, size: 64, align: 64, offset: 4608)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{null, !1546, !957, !961, !961}
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1377, file: !4, line: 2534, baseType: !961, size: 32, align: 32, offset: 4672)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1377, file: !4, line: 2545, baseType: !961, size: 32, align: 32, offset: 4704)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1377, file: !4, line: 2547, baseType: !961, size: 32, align: 32, offset: 4736)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1377, file: !4, line: 2549, baseType: !961, size: 32, align: 32, offset: 4768)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1377, file: !4, line: 2551, baseType: !961, size: 32, align: 32, offset: 4800)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1377, file: !4, line: 2553, baseType: !961, size: 32, align: 32, offset: 4832)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1377, file: !4, line: 2555, baseType: !961, size: 32, align: 32, offset: 4864)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1377, file: !4, line: 2557, baseType: !961, size: 32, align: 32, offset: 4896)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1377, file: !4, line: 2559, baseType: !961, size: 32, align: 32, offset: 4928)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1377, file: !4, line: 2563, baseType: !961, size: 32, align: 32, offset: 4960)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1377, file: !4, line: 2571, baseType: !964, size: 64, align: 64, offset: 4992)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1377, file: !4, line: 2579, baseType: !964, size: 64, align: 64, offset: 5056)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1377, file: !4, line: 2586, baseType: !961, size: 32, align: 32, offset: 5120)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1377, file: !4, line: 2615, baseType: !961, size: 32, align: 32, offset: 5152)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1377, file: !4, line: 2627, baseType: !961, size: 32, align: 32, offset: 5184)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1377, file: !4, line: 2637, baseType: !961, size: 32, align: 32, offset: 5216)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1377, file: !4, line: 2681, baseType: !961, size: 32, align: 32, offset: 5248)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1377, file: !4, line: 2709, baseType: !958, size: 64, align: 64, offset: 5312)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1377, file: !4, line: 2716, baseType: !1677, size: 64, align: 64, offset: 5376)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1679)
!1679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1680)
!1680 = !{!1681, !1682, !1683, !1684, !1685, !1686, !1687, !1691, !1695, !1696, !1697, !1698, !1704, !1705, !1706, !1707, !1708}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1679, file: !4, line: 3642, baseType: !986, size: 64, align: 64)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1679, file: !4, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1679, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1679, file: !4, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1679, file: !4, line: 3669, baseType: !961, size: 32, align: 32, offset: 160)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1679, file: !4, line: 3682, baseType: !1504, size: 64, align: 64, offset: 192)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1679, file: !4, line: 3698, baseType: !1688, size: 64, align: 64, offset: 256)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!961, !1375, !1329, !973}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1679, file: !4, line: 3712, baseType: !1692, size: 64, align: 64, offset: 320)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{!961, !1375, !961, !1329, !973}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1679, file: !4, line: 3726, baseType: !1688, size: 64, align: 64, offset: 384)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1679, file: !4, line: 3737, baseType: !1422, size: 64, align: 64, offset: 448)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1679, file: !4, line: 3746, baseType: !961, size: 32, align: 32, offset: 512)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1679, file: !4, line: 3757, baseType: !1699, size: 64, align: 64, offset: 576)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{null, !1702}
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
!1703 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1679, file: !4, line: 3766, baseType: !1422, size: 64, align: 64, offset: 640)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1679, file: !4, line: 3774, baseType: !1422, size: 64, align: 64, offset: 704)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1679, file: !4, line: 3780, baseType: !961, size: 32, align: 32, offset: 768)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1679, file: !4, line: 3785, baseType: !961, size: 32, align: 32, offset: 800)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1679, file: !4, line: 3795, baseType: !1709, size: 64, align: 64, offset: 832)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DISubroutineType(types: !1711)
!1711 = !{!961, !1375, !1134}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1377, file: !4, line: 2728, baseType: !957, size: 64, align: 64, offset: 5440)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1377, file: !4, line: 2735, baseType: !1217, size: 512, align: 64, offset: 5504)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1377, file: !4, line: 2742, baseType: !961, size: 32, align: 32, offset: 6016)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1377, file: !4, line: 2755, baseType: !961, size: 32, align: 32, offset: 6048)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1377, file: !4, line: 2776, baseType: !961, size: 32, align: 32, offset: 6080)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1377, file: !4, line: 2783, baseType: !961, size: 32, align: 32, offset: 6112)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1377, file: !4, line: 2791, baseType: !961, size: 32, align: 32, offset: 6144)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1377, file: !4, line: 2802, baseType: !1190, size: 64, align: 64, offset: 6208)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1377, file: !4, line: 2811, baseType: !961, size: 32, align: 32, offset: 6272)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1377, file: !4, line: 2821, baseType: !961, size: 32, align: 32, offset: 6304)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1377, file: !4, line: 2830, baseType: !961, size: 32, align: 32, offset: 6336)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1377, file: !4, line: 2840, baseType: !961, size: 32, align: 32, offset: 6368)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1377, file: !4, line: 2851, baseType: !1725, size: 64, align: 64, offset: 6400)
!1725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1726, size: 64, align: 64)
!1726 = !DISubroutineType(types: !1727)
!1727 = !{!961, !1546, !1728, !957, !1489, !961, !961}
!1728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1729, size: 64, align: 64)
!1729 = !DISubroutineType(types: !1730)
!1730 = !{!961, !1546, !957}
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1377, file: !4, line: 2871, baseType: !1732, size: 64, align: 64, offset: 6464)
!1732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1733, size: 64, align: 64)
!1733 = !DISubroutineType(types: !1734)
!1734 = !{!961, !1546, !1735, !957, !1489, !961}
!1735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64, align: 64)
!1736 = !DISubroutineType(types: !1737)
!1737 = !{!961, !1546, !957, !961, !961}
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1377, file: !4, line: 2878, baseType: !961, size: 32, align: 32, offset: 6528)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1377, file: !4, line: 2885, baseType: !961, size: 32, align: 32, offset: 6560)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1377, file: !4, line: 3005, baseType: !961, size: 32, align: 32, offset: 6592)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1377, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1377, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1377, file: !4, line: 3027, baseType: !909, size: 32, align: 32, offset: 6688)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1377, file: !4, line: 3037, baseType: !1144, size: 64, align: 64, offset: 6720)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1377, file: !4, line: 3038, baseType: !961, size: 32, align: 32, offset: 6784)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1377, file: !4, line: 3050, baseType: !978, size: 64, align: 64, offset: 6848)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1377, file: !4, line: 3065, baseType: !961, size: 32, align: 32, offset: 6912)
