; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--oggparsevorbis.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a/[inter]libavformat--oggparsevorbis.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVMetadataConv = type { i8*, i8* }
%struct.ogg_codec = type { i8*, i8, i8*, i32 (%struct.AVFormatContext*, i32)*, i32 (%struct.AVFormatContext*, i32)*, i64 (%struct.AVFormatContext*, i32, i64, i64*)*, i32, i32, void (%struct.AVFormatContext*, i32)* }

!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !25, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !25, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !918, !919, !927, !930, !931, !935}
!917 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!918 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !922, line: 221, size: 32, align: 8, elements: !923)
!922 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!923 = !{!924}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !921, file: !922, line: 221, baseType: !925, size: 32, align: 32)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !926, line: 51, baseType: !918)
!926 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !928, line: 197, baseType: !929)
!928 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!929 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !926, line: 48, baseType: !934)
!934 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!936 = !{!937}
!937 = distinct !DIGlobalVariable(name: "ff_vorbis_codec", scope: !0, file: !938, line: 500, type: !939, isLocal: false, isDefinition: true, variable: %struct.ogg_codec* @ff_vorbis_codec)
!938 = !DIFile(filename: "libavformat/oggparsevorbis.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ogg_codec", file: !941, line: 31, size: 512, align: 64, elements: !942)
!941 = !DIFile(filename: "libavformat/oggdec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!942 = !{!943, !948, !949, !950, !2159, !2160, !2164, !2165, !2166}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !940, file: !941, line: 32, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !928, line: 194, baseType: !947)
!947 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "magicsize", scope: !940, file: !941, line: 33, baseType: !933, size: 8, align: 8, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !940, file: !941, line: 34, baseType: !944, size: 64, align: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !940, file: !941, line: 41, baseType: !951, size: 64, align: 64, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!917, !954, !917}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !957)
!957 = !{!958, !1002, !1111, !1257, !1258, !1321, !1322, !1323, !2016, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2070, !2071, !2072, !2073, !2074, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2125, !2126, !2129, !2130, !2131, !2132, !2133, !2134, !2136, !2137, !2138, !2139, !2147, !2148, !2152, !2156, !2157, !2158}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !956, file: !897, line: 1342, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !963)
!963 = !{!964, !968, !972, !976, !977, !978, !979, !983, !989, !991, !995}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !962, file: !4, line: 72, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !962, file: !4, line: 78, baseType: !969, size: 64, align: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!965, !935}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !962, file: !4, line: 85, baseType: !973, size: 64, align: 64, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!975 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !962, file: !4, line: 93, baseType: !917, size: 32, align: 32, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !962, file: !4, line: 99, baseType: !917, size: 32, align: 32, offset: 224)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !962, file: !4, line: 108, baseType: !917, size: 32, align: 32, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !962, file: !4, line: 113, baseType: !980, size: 64, align: 64, offset: 320)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!935, !935, !935}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !962, file: !4, line: 123, baseType: !984, size: 64, align: 64, offset: 384)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!987, !987}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !962, file: !4, line: 130, baseType: !990, size: 32, align: 32, offset: 448)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !962, file: !4, line: 136, baseType: !992, size: 64, align: 64, offset: 512)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!990, !935}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !962, file: !4, line: 142, baseType: !996, size: 64, align: 64, offset: 576)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!917, !999, !935, !965, !917}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !956, file: !897, line: 1349, baseType: !1003, size: 64, align: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1005)
!1005 = !{!1006, !1007, !1008, !1009, !1010, !1020, !1021, !1022, !1023, !1024, !1025, !1038, !1043, !1082, !1083, !1087, !1092, !1093, !1094, !1098, !1104, !1110}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1004, file: !897, line: 638, baseType: !965, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1004, file: !897, line: 645, baseType: !965, size: 64, align: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1004, file: !897, line: 652, baseType: !917, size: 32, align: 32, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1004, file: !897, line: 659, baseType: !965, size: 64, align: 64, offset: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1004, file: !897, line: 661, baseType: !1011, size: 64, align: 64, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1016, line: 44, size: 64, align: 32, elements: !1017)
!1016 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1017 = !{!1018, !1019}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1015, file: !1016, line: 45, baseType: !24, size: 32, align: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1015, file: !1016, line: 46, baseType: !918, size: 32, align: 32, offset: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1004, file: !897, line: 663, baseType: !959, size: 64, align: 64, offset: 320)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1004, file: !897, line: 670, baseType: !965, size: 64, align: 64, offset: 384)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1004, file: !897, line: 679, baseType: !1003, size: 64, align: 64, offset: 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1004, file: !897, line: 684, baseType: !917, size: 32, align: 32, offset: 512)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1004, file: !897, line: 689, baseType: !917, size: 32, align: 32, offset: 544)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1004, file: !897, line: 696, baseType: !1026, size: 64, align: 64, offset: 576)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!917, !1029}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1032)
!1032 = !{!1033, !1034, !1036, !1037}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1031, file: !897, line: 449, baseType: !965, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1031, file: !897, line: 450, baseType: !1035, size: 64, align: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1031, file: !897, line: 451, baseType: !917, size: 32, align: 32, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1031, file: !897, line: 452, baseType: !965, size: 64, align: 64, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1004, file: !897, line: 703, baseType: !1039, size: 64, align: 64, offset: 640)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!917, !1042}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1004, file: !897, line: 714, baseType: !1044, size: 64, align: 64, offset: 704)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!917, !1042, !1047}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !25, line: 1499, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !25, line: 1445, size: 704, align: 64, elements: !1050)
!1050 = !{!1051, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1078, !1079, !1080, !1081}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1049, file: !25, line: 1451, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1054, line: 94, baseType: !1055)
!1054 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1054, line: 81, size: 192, align: 64, elements: !1056)
!1056 = !{!1057, !1061, !1063}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1055, file: !1054, line: 82, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1054, line: 73, baseType: !1060)
!1060 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1054, line: 73, flags: DIFlagFwdDecl)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1055, file: !1054, line: 89, baseType: !1062, size: 64, align: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1055, file: !1054, line: 93, baseType: !917, size: 32, align: 32, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1049, file: !25, line: 1461, baseType: !927, size: 64, align: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1049, file: !25, line: 1467, baseType: !927, size: 64, align: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1049, file: !25, line: 1468, baseType: !1062, size: 64, align: 64, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1049, file: !25, line: 1469, baseType: !917, size: 32, align: 32, offset: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1049, file: !25, line: 1470, baseType: !917, size: 32, align: 32, offset: 288)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1049, file: !25, line: 1474, baseType: !917, size: 32, align: 32, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1049, file: !25, line: 1479, baseType: !1071, size: 64, align: 64, offset: 384)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !25, line: 1415, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !25, line: 1411, size: 128, align: 64, elements: !1074)
!1074 = !{!1075, !1076, !1077}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1073, file: !25, line: 1412, baseType: !1062, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1073, file: !25, line: 1413, baseType: !917, size: 32, align: 32, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1073, file: !25, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1049, file: !25, line: 1480, baseType: !917, size: 32, align: 32, offset: 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1049, file: !25, line: 1486, baseType: !927, size: 64, align: 64, offset: 512)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1049, file: !25, line: 1488, baseType: !927, size: 64, align: 64, offset: 576)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1049, file: !25, line: 1497, baseType: !927, size: 64, align: 64, offset: 640)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1004, file: !897, line: 720, baseType: !1039, size: 64, align: 64, offset: 768)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1004, file: !897, line: 730, baseType: !1084, size: 64, align: 64, offset: 832)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!917, !1042, !917, !927, !917}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1004, file: !897, line: 737, baseType: !1088, size: 64, align: 64, offset: 896)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!927, !1042, !917, !1091, !927}
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1004, file: !897, line: 744, baseType: !1039, size: 64, align: 64, offset: 960)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1004, file: !897, line: 750, baseType: !1039, size: 64, align: 64, offset: 1024)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1004, file: !897, line: 758, baseType: !1095, size: 64, align: 64, offset: 1088)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!917, !1042, !917, !927, !927, !927, !917}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1004, file: !897, line: 764, baseType: !1099, size: 64, align: 64, offset: 1152)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!917, !1042, !1102}
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1004, file: !897, line: 770, baseType: !1105, size: 64, align: 64, offset: 1216)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!917, !1042, !1108}
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1004, file: !897, line: 776, baseType: !1105, size: 64, align: 64, offset: 1280)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !956, file: !897, line: 1356, baseType: !1112, size: 64, align: 64, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1134, !1138, !1142, !1149, !1242, !1243, !1244, !1245, !1246, !1247, !1251}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1113, file: !897, line: 498, baseType: !965, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1113, file: !897, line: 504, baseType: !965, size: 64, align: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1113, file: !897, line: 505, baseType: !965, size: 64, align: 64, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1113, file: !897, line: 506, baseType: !965, size: 64, align: 64, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1113, file: !897, line: 508, baseType: !24, size: 32, align: 32, offset: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1113, file: !897, line: 509, baseType: !24, size: 32, align: 32, offset: 288)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1113, file: !897, line: 510, baseType: !24, size: 32, align: 32, offset: 320)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1113, file: !897, line: 517, baseType: !917, size: 32, align: 32, offset: 352)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1113, file: !897, line: 523, baseType: !1011, size: 64, align: 64, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1113, file: !897, line: 526, baseType: !959, size: 64, align: 64, offset: 448)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1113, file: !897, line: 535, baseType: !1112, size: 64, align: 64, offset: 512)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1113, file: !897, line: 539, baseType: !917, size: 32, align: 32, offset: 576)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1113, file: !897, line: 541, baseType: !1039, size: 64, align: 64, offset: 640)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1113, file: !897, line: 549, baseType: !1044, size: 64, align: 64, offset: 704)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1113, file: !897, line: 550, baseType: !1039, size: 64, align: 64, offset: 768)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1113, file: !897, line: 554, baseType: !1131, size: 64, align: 64, offset: 832)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!917, !1042, !1047, !1047, !917}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1113, file: !897, line: 563, baseType: !1135, size: 64, align: 64, offset: 896)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!917, !24, !917}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1113, file: !897, line: 565, baseType: !1139, size: 64, align: 64, offset: 960)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{null, !1042, !917, !1091, !1091}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1113, file: !897, line: 570, baseType: !1143, size: 64, align: 64, offset: 1024)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!917, !1042, !917, !935, !1146}
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1147, line: 216, baseType: !1148)
!1147 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1148 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1113, file: !897, line: 581, baseType: !1150, size: 64, align: 64, offset: 1088)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!917, !1042, !917, !1153, !918}
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1157)
!1157 = !{!1158, !1162, !1164, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1198, !1200, !1201, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1156, file: !526, line: 282, baseType: !1159, size: 512, align: 64)
!1159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 512, align: 64, elements: !1160)
!1160 = !{!1161}
!1161 = !DISubrange(count: 8)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1156, file: !526, line: 299, baseType: !1163, size: 256, align: 32, offset: 512)
!1163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 32, elements: !1160)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1156, file: !526, line: 315, baseType: !1165, size: 64, align: 64, offset: 768)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1156, file: !526, line: 326, baseType: !917, size: 32, align: 32, offset: 832)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1156, file: !526, line: 326, baseType: !917, size: 32, align: 32, offset: 864)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1156, file: !526, line: 334, baseType: !917, size: 32, align: 32, offset: 896)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1156, file: !526, line: 341, baseType: !917, size: 32, align: 32, offset: 928)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1156, file: !526, line: 346, baseType: !917, size: 32, align: 32, offset: 960)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1156, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1156, file: !526, line: 356, baseType: !1173, size: 64, align: 32, offset: 1024)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1174, line: 61, baseType: !1175)
!1174 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1174, line: 58, size: 64, align: 32, elements: !1176)
!1176 = !{!1177, !1178}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1175, file: !1174, line: 59, baseType: !917, size: 32, align: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1175, file: !1174, line: 60, baseType: !917, size: 32, align: 32, offset: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1156, file: !526, line: 361, baseType: !927, size: 64, align: 64, offset: 1088)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1156, file: !526, line: 369, baseType: !927, size: 64, align: 64, offset: 1152)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1156, file: !526, line: 377, baseType: !927, size: 64, align: 64, offset: 1216)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1156, file: !526, line: 382, baseType: !917, size: 32, align: 32, offset: 1280)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1156, file: !526, line: 386, baseType: !917, size: 32, align: 32, offset: 1312)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1156, file: !526, line: 391, baseType: !917, size: 32, align: 32, offset: 1344)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1156, file: !526, line: 396, baseType: !935, size: 64, align: 64, offset: 1408)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1156, file: !526, line: 403, baseType: !1187, size: 512, align: 64, offset: 1472)
!1187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1188, size: 512, align: 64, elements: !1160)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !926, line: 55, baseType: !1148)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1156, file: !526, line: 410, baseType: !917, size: 32, align: 32, offset: 1984)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1156, file: !526, line: 415, baseType: !917, size: 32, align: 32, offset: 2016)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1156, file: !526, line: 420, baseType: !917, size: 32, align: 32, offset: 2048)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1156, file: !526, line: 425, baseType: !917, size: 32, align: 32, offset: 2080)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1156, file: !526, line: 435, baseType: !927, size: 64, align: 64, offset: 2112)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1156, file: !526, line: 440, baseType: !917, size: 32, align: 32, offset: 2176)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1156, file: !526, line: 445, baseType: !1188, size: 64, align: 64, offset: 2240)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1156, file: !526, line: 459, baseType: !1197, size: 512, align: 64, offset: 2304)
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 512, align: 64, elements: !1160)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1156, file: !526, line: 473, baseType: !1199, size: 64, align: 64, offset: 2816)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1156, file: !526, line: 477, baseType: !917, size: 32, align: 32, offset: 2880)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1156, file: !526, line: 479, baseType: !1202, size: 64, align: 64, offset: 2944)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1205)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1206)
!1206 = !{!1207, !1208, !1209, !1210, !1215}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1205, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1205, file: !526, line: 203, baseType: !1062, size: 64, align: 64, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1205, file: !526, line: 204, baseType: !917, size: 32, align: 32, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1205, file: !526, line: 205, baseType: !1211, size: 64, align: 64, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1213, line: 86, baseType: !1214)
!1213 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavformat--libavformat.a")
!1214 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1213, line: 86, flags: DIFlagFwdDecl)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1205, file: !526, line: 206, baseType: !1052, size: 64, align: 64, offset: 256)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1156, file: !526, line: 480, baseType: !917, size: 32, align: 32, offset: 3008)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1156, file: !526, line: 505, baseType: !917, size: 32, align: 32, offset: 3040)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1156, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1156, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1156, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1156, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1156, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1156, file: !526, line: 532, baseType: !927, size: 64, align: 64, offset: 3264)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1156, file: !526, line: 539, baseType: !927, size: 64, align: 64, offset: 3328)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1156, file: !526, line: 547, baseType: !927, size: 64, align: 64, offset: 3392)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1156, file: !526, line: 554, baseType: !1211, size: 64, align: 64, offset: 3456)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1156, file: !526, line: 563, baseType: !917, size: 32, align: 32, offset: 3520)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1156, file: !526, line: 572, baseType: !917, size: 32, align: 32, offset: 3552)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1156, file: !526, line: 581, baseType: !917, size: 32, align: 32, offset: 3584)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1156, file: !526, line: 588, baseType: !1231, size: 64, align: 64, offset: 3648)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1156, file: !526, line: 593, baseType: !917, size: 32, align: 32, offset: 3712)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1156, file: !526, line: 596, baseType: !917, size: 32, align: 32, offset: 3744)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1156, file: !526, line: 599, baseType: !1052, size: 64, align: 64, offset: 3776)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1156, file: !526, line: 605, baseType: !1052, size: 64, align: 64, offset: 3840)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1156, file: !526, line: 616, baseType: !1052, size: 64, align: 64, offset: 3904)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1156, file: !526, line: 626, baseType: !1146, size: 64, align: 64, offset: 3968)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1156, file: !526, line: 627, baseType: !1146, size: 64, align: 64, offset: 4032)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1156, file: !526, line: 628, baseType: !1146, size: 64, align: 64, offset: 4096)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1156, file: !526, line: 629, baseType: !1146, size: 64, align: 64, offset: 4160)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1156, file: !526, line: 645, baseType: !1052, size: 64, align: 64, offset: 4224)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1113, file: !897, line: 587, baseType: !1099, size: 64, align: 64, offset: 1152)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1113, file: !897, line: 592, baseType: !1105, size: 64, align: 64, offset: 1216)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1113, file: !897, line: 597, baseType: !1105, size: 64, align: 64, offset: 1280)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1113, file: !897, line: 598, baseType: !24, size: 32, align: 32, offset: 1344)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1113, file: !897, line: 608, baseType: !1039, size: 64, align: 64, offset: 1408)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1113, file: !897, line: 617, baseType: !1248, size: 64, align: 64, offset: 1472)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{null, !1042}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1113, file: !897, line: 623, baseType: !1252, size: 64, align: 64, offset: 1536)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!917, !1042, !1255}
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !956, file: !897, line: 1365, baseType: !935, size: 64, align: 64, offset: 192)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !956, file: !897, line: 1379, baseType: !1259, size: 64, align: 64, offset: 256)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1262)
!1262 = !{!1263, !1264, !1265, !1266, !1267, !1268, !1269, !1273, !1274, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1288, !1289, !1293, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1311, !1312, !1313, !1314, !1318, !1319, !1320}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1261, file: !628, line: 174, baseType: !959, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1261, file: !628, line: 226, baseType: !1035, size: 64, align: 64, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1261, file: !628, line: 227, baseType: !917, size: 32, align: 32, offset: 128)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1261, file: !628, line: 228, baseType: !1035, size: 64, align: 64, offset: 192)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1261, file: !628, line: 229, baseType: !1035, size: 64, align: 64, offset: 256)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1261, file: !628, line: 233, baseType: !935, size: 64, align: 64, offset: 320)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1261, file: !628, line: 235, baseType: !1270, size: 64, align: 64, offset: 384)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!917, !935, !1062, !917}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1261, file: !628, line: 236, baseType: !1270, size: 64, align: 64, offset: 448)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1261, file: !628, line: 237, baseType: !1275, size: 64, align: 64, offset: 512)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!927, !935, !927, !917}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1261, file: !628, line: 238, baseType: !927, size: 64, align: 64, offset: 576)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1261, file: !628, line: 239, baseType: !917, size: 32, align: 32, offset: 640)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1261, file: !628, line: 240, baseType: !917, size: 32, align: 32, offset: 672)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1261, file: !628, line: 241, baseType: !917, size: 32, align: 32, offset: 704)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1261, file: !628, line: 242, baseType: !1148, size: 64, align: 64, offset: 768)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1261, file: !628, line: 243, baseType: !1035, size: 64, align: 64, offset: 832)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1261, file: !628, line: 244, baseType: !1285, size: 64, align: 64, offset: 896)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!1148, !1148, !931, !918}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1261, file: !628, line: 245, baseType: !917, size: 32, align: 32, offset: 960)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1261, file: !628, line: 249, baseType: !1290, size: 64, align: 64, offset: 1024)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!917, !935, !917}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1261, file: !628, line: 255, baseType: !1294, size: 64, align: 64, offset: 1088)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!927, !935, !917, !927, !917}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1261, file: !628, line: 260, baseType: !917, size: 32, align: 32, offset: 1152)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1261, file: !628, line: 266, baseType: !927, size: 64, align: 64, offset: 1216)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1261, file: !628, line: 273, baseType: !917, size: 32, align: 32, offset: 1280)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1261, file: !628, line: 279, baseType: !927, size: 64, align: 64, offset: 1344)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1261, file: !628, line: 285, baseType: !917, size: 32, align: 32, offset: 1408)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1261, file: !628, line: 291, baseType: !917, size: 32, align: 32, offset: 1440)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1261, file: !628, line: 298, baseType: !917, size: 32, align: 32, offset: 1472)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1261, file: !628, line: 304, baseType: !917, size: 32, align: 32, offset: 1504)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1261, file: !628, line: 309, baseType: !965, size: 64, align: 64, offset: 1536)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1261, file: !628, line: 314, baseType: !965, size: 64, align: 64, offset: 1600)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1261, file: !628, line: 319, baseType: !1308, size: 64, align: 64, offset: 1664)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!917, !935, !1062, !917, !627, !927}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1261, file: !628, line: 326, baseType: !917, size: 32, align: 32, offset: 1728)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1261, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1261, file: !628, line: 332, baseType: !927, size: 64, align: 64, offset: 1792)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1261, file: !628, line: 338, baseType: !1315, size: 64, align: 64, offset: 1856)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!917, !935}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1261, file: !628, line: 340, baseType: !927, size: 64, align: 64, offset: 1920)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1261, file: !628, line: 346, baseType: !1035, size: 64, align: 64, offset: 1984)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1261, file: !628, line: 351, baseType: !917, size: 32, align: 32, offset: 2048)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !956, file: !897, line: 1386, baseType: !917, size: 32, align: 32, offset: 320)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !956, file: !897, line: 1393, baseType: !918, size: 32, align: 32, offset: 352)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !956, file: !897, line: 1405, baseType: !1324, size: 64, align: 64, offset: 384)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1327)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1328)
!1328 = !{!1329, !1330, !1331, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1801, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1902, !1908, !1909, !1913, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1945, !1946, !1947, !1948, !1949, !1950}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1327, file: !897, line: 866, baseType: !917, size: 32, align: 32)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1327, file: !897, line: 872, baseType: !917, size: 32, align: 32, offset: 32)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1327, file: !897, line: 878, baseType: !1332, size: 64, align: 64, offset: 64)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !25, line: 3360, baseType: !1334)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !25, line: 1556, size: 8448, align: 64, elements: !1335)
!1335 = !{!1336, !1337, !1338, !1339, !1476, !1477, !1478, !1479, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1505, !1509, !1510, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1689, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1334, file: !25, line: 1561, baseType: !959, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1334, file: !25, line: 1562, baseType: !917, size: 32, align: 32, offset: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1334, file: !25, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1334, file: !25, line: 1565, baseType: !1340, size: 64, align: 64, offset: 128)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1342)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !25, line: 3468, size: 1984, align: 64, elements: !1343)
!1343 = !{!1344, !1345, !1346, !1347, !1348, !1349, !1352, !1355, !1358, !1361, !1364, !1365, !1366, !1374, !1375, !1376, !1378, !1382, !1388, !1393, !1397, !1398, !1441, !1448, !1452, !1453, !1457, !1461, !1465, !1469, !1470, !1471}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1342, file: !25, line: 3475, baseType: !965, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1342, file: !25, line: 3480, baseType: !965, size: 64, align: 64, offset: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1342, file: !25, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1342, file: !25, line: 3482, baseType: !24, size: 32, align: 32, offset: 160)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1342, file: !25, line: 3487, baseType: !917, size: 32, align: 32, offset: 192)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1342, file: !25, line: 3488, baseType: !1350, size: 64, align: 64, offset: 256)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1173)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1342, file: !25, line: 3489, baseType: !1353, size: 64, align: 64, offset: 320)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1342, file: !25, line: 3490, baseType: !1356, size: 64, align: 64, offset: 384)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1342, file: !25, line: 3491, baseType: !1359, size: 64, align: 64, offset: 448)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1342, file: !25, line: 3492, baseType: !1362, size: 64, align: 64, offset: 512)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1188)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1342, file: !25, line: 3493, baseType: !933, size: 8, align: 8, offset: 576)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1342, file: !25, line: 3494, baseType: !959, size: 64, align: 64, offset: 640)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1342, file: !25, line: 3495, baseType: !1367, size: 64, align: 64, offset: 704)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1369)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !25, line: 3404, baseType: !1370)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !25, line: 3401, size: 128, align: 64, elements: !1371)
!1371 = !{!1372, !1373}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1370, file: !25, line: 3402, baseType: !917, size: 32, align: 32)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1370, file: !25, line: 3403, baseType: !965, size: 64, align: 64, offset: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1342, file: !25, line: 3507, baseType: !965, size: 64, align: 64, offset: 768)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1342, file: !25, line: 3516, baseType: !917, size: 32, align: 32, offset: 832)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1342, file: !25, line: 3517, baseType: !1377, size: 64, align: 64, offset: 896)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1342, file: !25, line: 3527, baseType: !1379, size: 64, align: 64, offset: 960)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DISubroutineType(types: !1381)
!1381 = !{!917, !1332}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1342, file: !25, line: 3535, baseType: !1383, size: 64, align: 64, offset: 1024)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DISubroutineType(types: !1385)
!1385 = !{!917, !1332, !1386}
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1333)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1342, file: !25, line: 3541, baseType: !1389, size: 64, align: 64, offset: 1088)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1391)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !25, line: 3461, baseType: !1392)
!1392 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !25, line: 3461, flags: DIFlagFwdDecl)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1342, file: !25, line: 3549, baseType: !1394, size: 64, align: 64, offset: 1152)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{null, !1377}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1342, file: !25, line: 3551, baseType: !1379, size: 64, align: 64, offset: 1216)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1342, file: !25, line: 3552, baseType: !1399, size: 64, align: 64, offset: 1280)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DISubroutineType(types: !1401)
!1401 = !{!917, !1332, !1062, !917, !1402}
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1404)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !25, line: 3920, size: 256, align: 64, elements: !1405)
!1405 = !{!1406, !1409, !1410, !1411, !1412, !1440}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1404, file: !25, line: 3921, baseType: !1407, size: 16, align: 16)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !926, line: 49, baseType: !1408)
!1408 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1404, file: !25, line: 3922, baseType: !925, size: 32, align: 32, offset: 32)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1404, file: !25, line: 3923, baseType: !925, size: 32, align: 32, offset: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1404, file: !25, line: 3924, baseType: !918, size: 32, align: 32, offset: 96)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1404, file: !25, line: 3925, baseType: !1413, size: 64, align: 64, offset: 128)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !25, line: 3918, baseType: !1416)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !25, line: 3885, size: 1600, align: 64, elements: !1417)
!1417 = !{!1418, !1419, !1420, !1421, !1422, !1423, !1429, !1433, !1435, !1436, !1438, !1439}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1416, file: !25, line: 3886, baseType: !917, size: 32, align: 32)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1416, file: !25, line: 3887, baseType: !917, size: 32, align: 32, offset: 32)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1416, file: !25, line: 3888, baseType: !917, size: 32, align: 32, offset: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1416, file: !25, line: 3889, baseType: !917, size: 32, align: 32, offset: 96)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1416, file: !25, line: 3890, baseType: !917, size: 32, align: 32, offset: 128)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1416, file: !25, line: 3897, baseType: !1424, size: 768, align: 64, offset: 192)
!1424 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !25, line: 3858, baseType: !1425)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !25, line: 3853, size: 768, align: 64, elements: !1426)
!1426 = !{!1427, !1428}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1425, file: !25, line: 3855, baseType: !1159, size: 512, align: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1425, file: !25, line: 3857, baseType: !1163, size: 256, align: 32, offset: 512)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1416, file: !25, line: 3903, baseType: !1430, size: 256, align: 64, offset: 960)
!1430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 256, align: 64, elements: !1431)
!1431 = !{!1432}
!1432 = !DISubrange(count: 4)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1416, file: !25, line: 3904, baseType: !1434, size: 128, align: 32, offset: 1216)
!1434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 128, align: 32, elements: !1431)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1416, file: !25, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1416, file: !25, line: 3908, baseType: !1437, size: 64, align: 64, offset: 1408)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1416, file: !25, line: 3915, baseType: !1437, size: 64, align: 64, offset: 1472)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1416, file: !25, line: 3917, baseType: !917, size: 32, align: 32, offset: 1536)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1404, file: !25, line: 3926, baseType: !927, size: 64, align: 64, offset: 192)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1342, file: !25, line: 3564, baseType: !1442, size: 64, align: 64, offset: 1344)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{!917, !1332, !1047, !1445, !1447}
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1155)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1342, file: !25, line: 3566, baseType: !1449, size: 64, align: 64, offset: 1408)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DISubroutineType(types: !1451)
!1451 = !{!917, !1332, !935, !1447, !1047}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1342, file: !25, line: 3567, baseType: !1379, size: 64, align: 64, offset: 1472)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1342, file: !25, line: 3576, baseType: !1454, size: 64, align: 64, offset: 1536)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DISubroutineType(types: !1456)
!1456 = !{!917, !1332, !1445}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1342, file: !25, line: 3577, baseType: !1458, size: 64, align: 64, offset: 1600)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{!917, !1332, !1047}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1342, file: !25, line: 3584, baseType: !1462, size: 64, align: 64, offset: 1664)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{!917, !1332, !1154}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1342, file: !25, line: 3589, baseType: !1466, size: 64, align: 64, offset: 1728)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{null, !1332}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1342, file: !25, line: 3594, baseType: !917, size: 32, align: 32, offset: 1792)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1342, file: !25, line: 3600, baseType: !965, size: 64, align: 64, offset: 1856)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1342, file: !25, line: 3609, baseType: !1472, size: 64, align: 64, offset: 1920)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1475)
!1475 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !25, line: 3609, flags: DIFlagFwdDecl)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1334, file: !25, line: 1566, baseType: !24, size: 32, align: 32, offset: 192)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1334, file: !25, line: 1581, baseType: !918, size: 32, align: 32, offset: 224)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1334, file: !25, line: 1583, baseType: !935, size: 64, align: 64, offset: 256)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1334, file: !25, line: 1591, baseType: !1480, size: 64, align: 64, offset: 320)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !25, line: 1532, flags: DIFlagFwdDecl)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1334, file: !25, line: 1598, baseType: !935, size: 64, align: 64, offset: 384)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1334, file: !25, line: 1606, baseType: !927, size: 64, align: 64, offset: 448)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1334, file: !25, line: 1614, baseType: !917, size: 32, align: 32, offset: 512)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1334, file: !25, line: 1622, baseType: !917, size: 32, align: 32, offset: 544)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1334, file: !25, line: 1628, baseType: !917, size: 32, align: 32, offset: 576)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1334, file: !25, line: 1636, baseType: !917, size: 32, align: 32, offset: 608)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1334, file: !25, line: 1643, baseType: !917, size: 32, align: 32, offset: 640)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1334, file: !25, line: 1657, baseType: !1062, size: 64, align: 64, offset: 704)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1334, file: !25, line: 1658, baseType: !917, size: 32, align: 32, offset: 768)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1334, file: !25, line: 1679, baseType: !1173, size: 64, align: 32, offset: 800)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1334, file: !25, line: 1688, baseType: !917, size: 32, align: 32, offset: 864)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1334, file: !25, line: 1712, baseType: !917, size: 32, align: 32, offset: 896)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1334, file: !25, line: 1729, baseType: !917, size: 32, align: 32, offset: 928)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1334, file: !25, line: 1729, baseType: !917, size: 32, align: 32, offset: 960)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1334, file: !25, line: 1744, baseType: !917, size: 32, align: 32, offset: 992)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1334, file: !25, line: 1744, baseType: !917, size: 32, align: 32, offset: 1024)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1334, file: !25, line: 1751, baseType: !917, size: 32, align: 32, offset: 1056)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1334, file: !25, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1334, file: !25, line: 1791, baseType: !1501, size: 64, align: 64, offset: 1152)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{null, !1504, !1445, !1447, !917, !917, !917}
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1334, file: !25, line: 1808, baseType: !1506, size: 64, align: 64, offset: 1216)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{!645, !1504, !1353}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1334, file: !25, line: 1816, baseType: !917, size: 32, align: 32, offset: 1280)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1334, file: !25, line: 1825, baseType: !1511, size: 32, align: 32, offset: 1312)
!1511 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1334, file: !25, line: 1830, baseType: !917, size: 32, align: 32, offset: 1344)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1334, file: !25, line: 1838, baseType: !1511, size: 32, align: 32, offset: 1376)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1334, file: !25, line: 1846, baseType: !917, size: 32, align: 32, offset: 1408)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1334, file: !25, line: 1851, baseType: !917, size: 32, align: 32, offset: 1440)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1334, file: !25, line: 1861, baseType: !1511, size: 32, align: 32, offset: 1472)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1334, file: !25, line: 1868, baseType: !1511, size: 32, align: 32, offset: 1504)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1334, file: !25, line: 1875, baseType: !1511, size: 32, align: 32, offset: 1536)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1334, file: !25, line: 1882, baseType: !1511, size: 32, align: 32, offset: 1568)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1334, file: !25, line: 1889, baseType: !1511, size: 32, align: 32, offset: 1600)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1334, file: !25, line: 1896, baseType: !1511, size: 32, align: 32, offset: 1632)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1334, file: !25, line: 1903, baseType: !1511, size: 32, align: 32, offset: 1664)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1334, file: !25, line: 1910, baseType: !917, size: 32, align: 32, offset: 1696)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1334, file: !25, line: 1915, baseType: !917, size: 32, align: 32, offset: 1728)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1334, file: !25, line: 1926, baseType: !1447, size: 64, align: 64, offset: 1792)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1334, file: !25, line: 1935, baseType: !1173, size: 64, align: 32, offset: 1856)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1334, file: !25, line: 1942, baseType: !917, size: 32, align: 32, offset: 1920)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1334, file: !25, line: 1948, baseType: !917, size: 32, align: 32, offset: 1952)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1334, file: !25, line: 1954, baseType: !917, size: 32, align: 32, offset: 1984)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1334, file: !25, line: 1960, baseType: !917, size: 32, align: 32, offset: 2016)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1334, file: !25, line: 1984, baseType: !917, size: 32, align: 32, offset: 2048)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1334, file: !25, line: 1991, baseType: !917, size: 32, align: 32, offset: 2080)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1334, file: !25, line: 1996, baseType: !917, size: 32, align: 32, offset: 2112)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1334, file: !25, line: 2004, baseType: !917, size: 32, align: 32, offset: 2144)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1334, file: !25, line: 2011, baseType: !917, size: 32, align: 32, offset: 2176)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1334, file: !25, line: 2018, baseType: !917, size: 32, align: 32, offset: 2208)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1334, file: !25, line: 2027, baseType: !917, size: 32, align: 32, offset: 2240)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1334, file: !25, line: 2034, baseType: !917, size: 32, align: 32, offset: 2272)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1334, file: !25, line: 2044, baseType: !917, size: 32, align: 32, offset: 2304)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1334, file: !25, line: 2054, baseType: !1541, size: 64, align: 64, offset: 2368)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1334, file: !25, line: 2061, baseType: !1541, size: 64, align: 64, offset: 2432)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1334, file: !25, line: 2066, baseType: !917, size: 32, align: 32, offset: 2496)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1334, file: !25, line: 2070, baseType: !917, size: 32, align: 32, offset: 2528)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1334, file: !25, line: 2078, baseType: !917, size: 32, align: 32, offset: 2560)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1334, file: !25, line: 2085, baseType: !917, size: 32, align: 32, offset: 2592)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1334, file: !25, line: 2092, baseType: !917, size: 32, align: 32, offset: 2624)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1334, file: !25, line: 2099, baseType: !917, size: 32, align: 32, offset: 2656)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1334, file: !25, line: 2106, baseType: !917, size: 32, align: 32, offset: 2688)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1334, file: !25, line: 2113, baseType: !917, size: 32, align: 32, offset: 2720)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1334, file: !25, line: 2120, baseType: !917, size: 32, align: 32, offset: 2752)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1334, file: !25, line: 2125, baseType: !917, size: 32, align: 32, offset: 2784)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1334, file: !25, line: 2133, baseType: !917, size: 32, align: 32, offset: 2816)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1334, file: !25, line: 2140, baseType: !917, size: 32, align: 32, offset: 2848)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1334, file: !25, line: 2145, baseType: !917, size: 32, align: 32, offset: 2880)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1334, file: !25, line: 2153, baseType: !917, size: 32, align: 32, offset: 2912)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1334, file: !25, line: 2158, baseType: !917, size: 32, align: 32, offset: 2944)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1334, file: !25, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1334, file: !25, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1334, file: !25, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1334, file: !25, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1334, file: !25, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1334, file: !25, line: 2203, baseType: !917, size: 32, align: 32, offset: 3136)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1334, file: !25, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1334, file: !25, line: 2212, baseType: !917, size: 32, align: 32, offset: 3200)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1334, file: !25, line: 2213, baseType: !917, size: 32, align: 32, offset: 3232)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1334, file: !25, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1334, file: !25, line: 2232, baseType: !917, size: 32, align: 32, offset: 3296)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1334, file: !25, line: 2243, baseType: !917, size: 32, align: 32, offset: 3328)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1334, file: !25, line: 2249, baseType: !917, size: 32, align: 32, offset: 3360)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1334, file: !25, line: 2256, baseType: !917, size: 32, align: 32, offset: 3392)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1334, file: !25, line: 2263, baseType: !1188, size: 64, align: 64, offset: 3456)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1334, file: !25, line: 2270, baseType: !1188, size: 64, align: 64, offset: 3520)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1334, file: !25, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1334, file: !25, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1334, file: !25, line: 2367, baseType: !1577, size: 64, align: 64, offset: 3648)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DISubroutineType(types: !1579)
!1579 = !{!917, !1504, !1154, !917}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1334, file: !25, line: 2383, baseType: !917, size: 32, align: 32, offset: 3712)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1334, file: !25, line: 2386, baseType: !1511, size: 32, align: 32, offset: 3744)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1334, file: !25, line: 2387, baseType: !1511, size: 32, align: 32, offset: 3776)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1334, file: !25, line: 2394, baseType: !917, size: 32, align: 32, offset: 3808)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1334, file: !25, line: 2401, baseType: !917, size: 32, align: 32, offset: 3840)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1334, file: !25, line: 2408, baseType: !917, size: 32, align: 32, offset: 3872)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1334, file: !25, line: 2415, baseType: !917, size: 32, align: 32, offset: 3904)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1334, file: !25, line: 2422, baseType: !917, size: 32, align: 32, offset: 3936)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1334, file: !25, line: 2423, baseType: !1589, size: 64, align: 64, offset: 3968)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !25, line: 831, baseType: !1591)
!1591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !25, line: 826, size: 128, align: 32, elements: !1592)
!1592 = !{!1593, !1594, !1595, !1596}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1591, file: !25, line: 827, baseType: !917, size: 32, align: 32)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1591, file: !25, line: 828, baseType: !917, size: 32, align: 32, offset: 32)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1591, file: !25, line: 829, baseType: !917, size: 32, align: 32, offset: 64)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1591, file: !25, line: 830, baseType: !1511, size: 32, align: 32, offset: 96)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1334, file: !25, line: 2430, baseType: !927, size: 64, align: 64, offset: 4032)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1334, file: !25, line: 2437, baseType: !927, size: 64, align: 64, offset: 4096)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1334, file: !25, line: 2444, baseType: !1511, size: 32, align: 32, offset: 4160)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1334, file: !25, line: 2451, baseType: !1511, size: 32, align: 32, offset: 4192)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1334, file: !25, line: 2458, baseType: !917, size: 32, align: 32, offset: 4224)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1334, file: !25, line: 2469, baseType: !917, size: 32, align: 32, offset: 4256)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1334, file: !25, line: 2475, baseType: !917, size: 32, align: 32, offset: 4288)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1334, file: !25, line: 2481, baseType: !917, size: 32, align: 32, offset: 4320)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1334, file: !25, line: 2485, baseType: !917, size: 32, align: 32, offset: 4352)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1334, file: !25, line: 2489, baseType: !917, size: 32, align: 32, offset: 4384)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1334, file: !25, line: 2493, baseType: !917, size: 32, align: 32, offset: 4416)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1334, file: !25, line: 2501, baseType: !917, size: 32, align: 32, offset: 4448)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1334, file: !25, line: 2506, baseType: !917, size: 32, align: 32, offset: 4480)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1334, file: !25, line: 2510, baseType: !917, size: 32, align: 32, offset: 4512)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1334, file: !25, line: 2514, baseType: !927, size: 64, align: 64, offset: 4544)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1334, file: !25, line: 2528, baseType: !1613, size: 64, align: 64, offset: 4608)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{null, !1504, !935, !917, !917}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1334, file: !25, line: 2534, baseType: !917, size: 32, align: 32, offset: 4672)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1334, file: !25, line: 2545, baseType: !917, size: 32, align: 32, offset: 4704)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1334, file: !25, line: 2547, baseType: !917, size: 32, align: 32, offset: 4736)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1334, file: !25, line: 2549, baseType: !917, size: 32, align: 32, offset: 4768)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1334, file: !25, line: 2551, baseType: !917, size: 32, align: 32, offset: 4800)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1334, file: !25, line: 2553, baseType: !917, size: 32, align: 32, offset: 4832)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1334, file: !25, line: 2555, baseType: !917, size: 32, align: 32, offset: 4864)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1334, file: !25, line: 2557, baseType: !917, size: 32, align: 32, offset: 4896)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1334, file: !25, line: 2559, baseType: !917, size: 32, align: 32, offset: 4928)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1334, file: !25, line: 2563, baseType: !917, size: 32, align: 32, offset: 4960)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1334, file: !25, line: 2571, baseType: !1437, size: 64, align: 64, offset: 4992)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1334, file: !25, line: 2579, baseType: !1437, size: 64, align: 64, offset: 5056)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1334, file: !25, line: 2586, baseType: !917, size: 32, align: 32, offset: 5120)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1334, file: !25, line: 2615, baseType: !917, size: 32, align: 32, offset: 5152)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1334, file: !25, line: 2627, baseType: !917, size: 32, align: 32, offset: 5184)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1334, file: !25, line: 2637, baseType: !917, size: 32, align: 32, offset: 5216)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1334, file: !25, line: 2681, baseType: !917, size: 32, align: 32, offset: 5248)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1334, file: !25, line: 2709, baseType: !927, size: 64, align: 64, offset: 5312)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1334, file: !25, line: 2716, baseType: !1635, size: 64, align: 64, offset: 5376)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1637)
!1637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !25, line: 3636, size: 896, align: 64, elements: !1638)
!1638 = !{!1639, !1640, !1641, !1642, !1643, !1644, !1645, !1649, !1653, !1654, !1655, !1656, !1662, !1663, !1664, !1665, !1666}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1637, file: !25, line: 3642, baseType: !965, size: 64, align: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1637, file: !25, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1637, file: !25, line: 3656, baseType: !24, size: 32, align: 32, offset: 96)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1637, file: !25, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1637, file: !25, line: 3669, baseType: !917, size: 32, align: 32, offset: 160)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1637, file: !25, line: 3682, baseType: !1462, size: 64, align: 64, offset: 192)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1637, file: !25, line: 3698, baseType: !1646, size: 64, align: 64, offset: 256)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{!917, !1332, !931, !925}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1637, file: !25, line: 3712, baseType: !1650, size: 64, align: 64, offset: 320)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DISubroutineType(types: !1652)
!1652 = !{!917, !1332, !917, !931, !925}
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1637, file: !25, line: 3726, baseType: !1646, size: 64, align: 64, offset: 384)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1637, file: !25, line: 3737, baseType: !1379, size: 64, align: 64, offset: 448)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1637, file: !25, line: 3746, baseType: !917, size: 32, align: 32, offset: 512)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1637, file: !25, line: 3757, baseType: !1657, size: 64, align: 64, offset: 576)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DISubroutineType(types: !1659)
!1659 = !{null, !1660}
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64, align: 64)
!1661 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !25, line: 3617, flags: DIFlagFwdDecl)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1637, file: !25, line: 3766, baseType: !1379, size: 64, align: 64, offset: 640)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1637, file: !25, line: 3774, baseType: !1379, size: 64, align: 64, offset: 704)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1637, file: !25, line: 3780, baseType: !917, size: 32, align: 32, offset: 768)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1637, file: !25, line: 3785, baseType: !917, size: 32, align: 32, offset: 800)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1637, file: !25, line: 3795, baseType: !1667, size: 64, align: 64, offset: 832)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{!917, !1332, !1052}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1334, file: !25, line: 2728, baseType: !935, size: 64, align: 64, offset: 5440)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1334, file: !25, line: 2735, baseType: !1187, size: 512, align: 64, offset: 5504)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1334, file: !25, line: 2742, baseType: !917, size: 32, align: 32, offset: 6016)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1334, file: !25, line: 2755, baseType: !917, size: 32, align: 32, offset: 6048)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1334, file: !25, line: 2776, baseType: !917, size: 32, align: 32, offset: 6080)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1334, file: !25, line: 2783, baseType: !917, size: 32, align: 32, offset: 6112)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1334, file: !25, line: 2791, baseType: !917, size: 32, align: 32, offset: 6144)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1334, file: !25, line: 2802, baseType: !1154, size: 64, align: 64, offset: 6208)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1334, file: !25, line: 2811, baseType: !917, size: 32, align: 32, offset: 6272)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1334, file: !25, line: 2821, baseType: !917, size: 32, align: 32, offset: 6304)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1334, file: !25, line: 2830, baseType: !917, size: 32, align: 32, offset: 6336)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1334, file: !25, line: 2840, baseType: !917, size: 32, align: 32, offset: 6368)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1334, file: !25, line: 2851, baseType: !1683, size: 64, align: 64, offset: 6400)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DISubroutineType(types: !1685)
!1685 = !{!917, !1504, !1686, !935, !1447, !917, !917}
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64, align: 64)
!1687 = !DISubroutineType(types: !1688)
!1688 = !{!917, !1504, !935}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1334, file: !25, line: 2871, baseType: !1690, size: 64, align: 64, offset: 6464)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DISubroutineType(types: !1692)
!1692 = !{!917, !1504, !1693, !935, !1447, !917}
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DISubroutineType(types: !1695)
!1695 = !{!917, !1504, !935, !917, !917}
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1334, file: !25, line: 2878, baseType: !917, size: 32, align: 32, offset: 6528)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1334, file: !25, line: 2885, baseType: !917, size: 32, align: 32, offset: 6560)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1334, file: !25, line: 3005, baseType: !917, size: 32, align: 32, offset: 6592)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1334, file: !25, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1334, file: !25, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1334, file: !25, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1334, file: !25, line: 3037, baseType: !1062, size: 64, align: 64, offset: 6720)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1334, file: !25, line: 3038, baseType: !917, size: 32, align: 32, offset: 6784)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1334, file: !25, line: 3050, baseType: !1188, size: 64, align: 64, offset: 6848)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1334, file: !25, line: 3065, baseType: !917, size: 32, align: 32, offset: 6912)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1334, file: !25, line: 3083, baseType: !917, size: 32, align: 32, offset: 6944)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1334, file: !25, line: 3092, baseType: !1173, size: 64, align: 32, offset: 6976)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1334, file: !25, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1334, file: !25, line: 3106, baseType: !1173, size: 64, align: 32, offset: 7072)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1334, file: !25, line: 3113, baseType: !1711, size: 64, align: 64, offset: 7168)
