; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--rc4test/[inter]test--rc4test-bin-rc4test.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--rc4test/[inter]test--rc4test-bin-rc4test.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rc4_key_st = type { i32, i32, [256 x i32] }
%struct.SHAstate_st = type { i32, i32, i32, i32, i32, i32, i32, [16 x i32], i32 }

@.str = private unnamed_addr constant [17 x i8] c"test_rc4_encrypt\00", align 1
@.str.1 = private unnamed_addr constant [24 x i8] c"test_rc4_end_processing\00", align 1
@data_len = internal global [6 x i8] c"\08\08\08\14\1C\0A", align 1
@.str.2 = private unnamed_addr constant [20 x i8] c"test_rc4_multi_call\00", align 1
@.str.3 = private unnamed_addr constant [13 x i8] c"test_rc_bulk\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--rc4test/[inter]test--rc4test-bin-rc4test.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--rc4test")
!2 = !{}
!3 = !{!4, !11, !12, !13, !16}
!4 = distinct !DIGlobalVariable(name: "keys", scope: !0, file: !5, line: 19, type: !6, isLocal: true, isDefinition: true, variable: [6 x [30 x i8]]* @keys)
!5 = !DIFile(filename: "test/rc4test.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--rc4test")
!6 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1440, align: 8, elements: !8)
!7 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!8 = !{!9, !10}
!9 = !DISubrange(count: 6)
!10 = !DISubrange(count: 30)
!11 = distinct !DIGlobalVariable(name: "data", scope: !0, file: !5, line: 30, type: !6, isLocal: true, isDefinition: true, variable: [6 x [30 x i8]]* @data)
!12 = distinct !DIGlobalVariable(name: "output", scope: !0, file: !5, line: 44, type: !6, isLocal: true, isDefinition: true, variable: [6 x [30 x i8]]* @output)
!13 = distinct !DIGlobalVariable(name: "data_len", scope: !0, file: !5, line: 28, type: !14, isLocal: true, isDefinition: true, variable: [6 x i8]* @data_len)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 48, align: 8, elements: !15)
!15 = !{!9}
!16 = distinct !DIGlobalVariable(name: "expected", scope: !17, file: !5, line: 101, type: !21, isLocal: true, isDefinition: true, variable: [20 x i8]* @test_rc_bulk.expected)
!17 = distinct !DISubprogram(name: "test_rc_bulk", scope: !5, file: !5, line: 94, type: !18, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!18 = !DISubroutineType(types: !19)
!19 = !{!20}
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, align: 8, elements: !22)
!22 = !{!23}
!23 = !DISubrange(count: 20)
!24 = !{i32 2, !"Dwarf Version", i32 4}
!25 = !{i32 2, !"Debug Info Version", i32 3}
!26 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!27 = distinct !DISubprogram(name: "setup_tests", scope: !5, file: !5, line: 119, type: !18, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!28 = !DILocation(line: 122, column: 5, scope: !27)
!29 = !DILocation(line: 123, column: 71, scope: !27)
!30 = !DILocation(line: 123, column: 5, scope: !27)
!31 = !DILocation(line: 124, column: 63, scope: !27)
!32 = !DILocation(line: 124, column: 5, scope: !27)
!33 = !DILocation(line: 125, column: 5, scope: !27)
!34 = !DILocation(line: 127, column: 5, scope: !27)
!35 = distinct !DISubprogram(name: "test_rc4_encrypt", scope: !5, file: !5, line: 58, type: !36, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!36 = !DISubroutineType(types: !37)
!37 = !{!20, !38}
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!39 = !DILocalVariable(name: "i", arg: 1, scope: !35, file: !5, line: 58, type: !38)
!40 = !DIExpression()
!41 = !DILocation(line: 58, column: 39, scope: !35)
!42 = !DILocalVariable(name: "obuf", scope: !35, file: !5, line: 60, type: !43)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 4096, align: 8, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 512)
!46 = !DILocation(line: 60, column: 19, scope: !35)
!47 = !DILocalVariable(name: "key", scope: !35, file: !5, line: 61, type: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "RC4_KEY", file: !49, line: 24, baseType: !50)
!49 = !DIFile(filename: "include/openssl/rc4.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--rc4test")
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rc4_key_st", file: !49, line: 21, size: 8256, align: 32, elements: !51)
!51 = !{!52, !54, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !50, file: !49, line: 22, baseType: !53, size: 32, align: 32)
!53 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !50, file: !49, line: 22, baseType: !53, size: 32, align: 32, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !50, file: !49, line: 23, baseType: !56, size: 8192, align: 32, offset: 64)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 8192, align: 32, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 256)
!59 = !DILocation(line: 61, column: 13, scope: !35)
!60 = !DILocation(line: 63, column: 28, scope: !35)
!61 = !DILocation(line: 63, column: 23, scope: !35)
!62 = !DILocation(line: 63, column: 42, scope: !35)
!63 = !DILocation(line: 63, column: 37, scope: !35)
!64 = !DILocation(line: 63, column: 5, scope: !35)
!65 = !DILocation(line: 64, column: 5, scope: !35)
!66 = !DILocation(line: 65, column: 24, scope: !35)
!67 = !DILocation(line: 65, column: 15, scope: !35)
!68 = !DILocation(line: 65, column: 35, scope: !35)
!69 = !DILocation(line: 65, column: 30, scope: !35)
!70 = !DILocation(line: 65, column: 43, scope: !35)
!71 = !DILocation(line: 65, column: 5, scope: !35)
!72 = !DILocation(line: 66, column: 67, scope: !35)
!73 = !DILocation(line: 66, column: 82, scope: !35)
!74 = !DILocation(line: 66, column: 73, scope: !35)
!75 = !DILocation(line: 66, column: 85, scope: !35)
!76 = !DILocation(line: 66, column: 97, scope: !35)
!77 = !DILocation(line: 66, column: 90, scope: !35)
!78 = !DILocation(line: 66, column: 110, scope: !35)
!79 = !DILocation(line: 66, column: 101, scope: !35)
!80 = !DILocation(line: 66, column: 113, scope: !35)
!81 = !DILocation(line: 66, column: 12, scope: !35)
!82 = !DILocation(line: 66, column: 5, scope: !35)
!83 = distinct !DISubprogram(name: "test_rc4_end_processing", scope: !5, file: !5, line: 69, type: !36, isLocal: true, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!84 = !DILocalVariable(name: "i", arg: 1, scope: !83, file: !5, line: 69, type: !38)
!85 = !DILocation(line: 69, column: 46, scope: !83)
!86 = !DILocalVariable(name: "obuf", scope: !83, file: !5, line: 71, type: !43)
!87 = !DILocation(line: 71, column: 19, scope: !83)
!88 = !DILocalVariable(name: "key", scope: !83, file: !5, line: 72, type: !48)
!89 = !DILocation(line: 72, column: 13, scope: !83)
!90 = !DILocation(line: 74, column: 23, scope: !83)
!91 = !DILocation(line: 74, column: 5, scope: !83)
!92 = !DILocation(line: 75, column: 5, scope: !83)
!93 = !DILocation(line: 76, column: 15, scope: !83)
!94 = !DILocation(line: 76, column: 33, scope: !83)
!95 = !DILocation(line: 76, column: 5, scope: !83)
!96 = !DILocation(line: 77, column: 65, scope: !97)
!97 = distinct !DILexicalBlock(scope: !83, file: !5, line: 77, column: 9)
!98 = !DILocation(line: 77, column: 71, scope: !97)
!99 = !DILocation(line: 77, column: 85, scope: !97)
!100 = !DILocation(line: 77, column: 10, scope: !97)
!101 = !DILocation(line: 77, column: 9, scope: !83)
!102 = !DILocation(line: 78, column: 9, scope: !97)
!103 = !DILocation(line: 79, column: 69, scope: !83)
!104 = !DILocation(line: 79, column: 64, scope: !83)
!105 = !DILocation(line: 79, column: 12, scope: !83)
!106 = !DILocation(line: 79, column: 5, scope: !83)
!107 = !DILocation(line: 80, column: 1, scope: !83)
!108 = distinct !DISubprogram(name: "test_rc4_multi_call", scope: !5, file: !5, line: 82, type: !36, isLocal: true, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!109 = !DILocalVariable(name: "i", arg: 1, scope: !108, file: !5, line: 82, type: !38)
!110 = !DILocation(line: 82, column: 42, scope: !108)
!111 = !DILocalVariable(name: "obuf", scope: !108, file: !5, line: 84, type: !43)
!112 = !DILocation(line: 84, column: 19, scope: !108)
!113 = !DILocalVariable(name: "key", scope: !108, file: !5, line: 85, type: !48)
!114 = !DILocation(line: 85, column: 13, scope: !108)
!115 = !DILocation(line: 87, column: 23, scope: !108)
!116 = !DILocation(line: 87, column: 5, scope: !108)
!117 = !DILocation(line: 88, column: 5, scope: !108)
!118 = !DILocation(line: 89, column: 15, scope: !108)
!119 = !DILocation(line: 89, column: 33, scope: !108)
!120 = !DILocation(line: 89, column: 5, scope: !108)
!121 = !DILocation(line: 90, column: 15, scope: !108)
!122 = !DILocation(line: 90, column: 29, scope: !108)
!123 = !DILocation(line: 90, column: 27, scope: !108)
!124 = !DILocation(line: 90, column: 42, scope: !108)
!125 = !DILocation(line: 90, column: 34, scope: !108)
!126 = !DILocation(line: 90, column: 54, scope: !108)
!127 = !DILocation(line: 90, column: 49, scope: !108)
!128 = !DILocation(line: 90, column: 5, scope: !108)
!129 = !DILocation(line: 91, column: 67, scope: !108)
!130 = !DILocation(line: 91, column: 73, scope: !108)
!131 = !DILocation(line: 91, column: 85, scope: !108)
!132 = !DILocation(line: 91, column: 101, scope: !108)
!133 = !DILocation(line: 91, column: 113, scope: !108)
!134 = !DILocation(line: 91, column: 12, scope: !108)
!135 = !DILocation(line: 91, column: 5, scope: !108)
!136 = !DILocalVariable(name: "key", scope: !17, file: !5, line: 96, type: !48)
!137 = !DILocation(line: 96, column: 13, scope: !17)
!138 = !DILocalVariable(name: "buf", scope: !17, file: !5, line: 97, type: !139)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 4104, align: 8, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 513)
!142 = !DILocation(line: 97, column: 19, scope: !17)
!143 = !DILocalVariable(name: "c", scope: !17, file: !5, line: 98, type: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHA_CTX", file: !145, line: 39, baseType: !146)
!145 = !DIFile(filename: "include/openssl/sha.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--rc4test")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHAstate_st", file: !145, line: 34, size: 768, align: 32, elements: !147)
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !159}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "h0", scope: !146, file: !145, line: 35, baseType: !53, size: 32, align: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !146, file: !145, line: 35, baseType: !53, size: 32, align: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !146, file: !145, line: 35, baseType: !53, size: 32, align: 32, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "h3", scope: !146, file: !145, line: 35, baseType: !53, size: 32, align: 32, offset: 96)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "h4", scope: !146, file: !145, line: 35, baseType: !53, size: 32, align: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Nl", scope: !146, file: !145, line: 36, baseType: !53, size: 32, align: 32, offset: 160)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Nh", scope: !146, file: !145, line: 36, baseType: !53, size: 32, align: 32, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !145, line: 37, baseType: !156, size: 512, align: 32, offset: 224)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 512, align: 32, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 16)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !146, file: !145, line: 38, baseType: !53, size: 32, align: 32, offset: 736)
!160 = !DILocation(line: 98, column: 13, scope: !17)
!161 = !DILocalVariable(name: "md", scope: !17, file: !5, line: 99, type: !21)
!162 = !DILocation(line: 99, column: 19, scope: !17)
!163 = !DILocalVariable(name: "i", scope: !17, file: !5, line: 100, type: !20)
!164 = !DILocation(line: 100, column: 9, scope: !17)
!165 = !DILocation(line: 106, column: 23, scope: !17)
!166 = !DILocation(line: 106, column: 5, scope: !17)
!167 = !DILocation(line: 107, column: 5, scope: !17)
!168 = !DILocation(line: 108, column: 5, scope: !17)
!169 = !DILocation(line: 109, column: 12, scope: !170)
!170 = distinct !DILexicalBlock(scope: !17, file: !5, line: 109, column: 5)
!171 = !DILocation(line: 109, column: 10, scope: !170)
!172 = !DILocation(line: 109, column: 17, scope: !173)
!173 = !DILexicalBlockFile(scope: !174, file: !5, discriminator: 1)
!174 = distinct !DILexicalBlock(scope: !170, file: !5, line: 109, column: 5)
!175 = !DILocation(line: 109, column: 19, scope: !173)
!176 = !DILocation(line: 109, column: 5, scope: !173)
!177 = !DILocation(line: 110, column: 32, scope: !178)
!178 = distinct !DILexicalBlock(scope: !174, file: !5, line: 109, column: 32)
!179 = !DILocation(line: 110, column: 37, scope: !178)
!180 = !DILocation(line: 110, column: 9, scope: !178)
!181 = !DILocation(line: 111, column: 25, scope: !178)
!182 = !DILocation(line: 111, column: 9, scope: !178)
!183 = !DILocation(line: 112, column: 5, scope: !178)
!184 = !DILocation(line: 109, column: 28, scope: !185)
!185 = !DILexicalBlockFile(scope: !174, file: !5, discriminator: 2)
!186 = !DILocation(line: 109, column: 5, scope: !185)
!187 = distinct !{!187, !188}
!188 = !DILocation(line: 109, column: 5, scope: !17)
!189 = !DILocation(line: 113, column: 16, scope: !17)
!190 = !DILocation(line: 113, column: 5, scope: !17)
!191 = !DILocation(line: 115, column: 65, scope: !17)
!192 = !DILocation(line: 115, column: 12, scope: !17)
!193 = !DILocation(line: 115, column: 5, scope: !17)
