; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--sha--libcrypto-lib-sha1dgst.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--sha--libcrypto-lib-sha1dgst.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SHAstate_st = type { i32, i32, i32, i32, i32, i32, i32, [16 x i32], i32 }

; Function Attrs: nounwind uwtable
define i32 @SHA1_Update(%struct.SHAstate_st* %c, i8* %data_, i64 %len) #0 !dbg !10 {
entry:
  %retval = alloca i32, align 4
  %c.addr = alloca %struct.SHAstate_st*, align 8
  %data_.addr = alloca i8*, align 8
  %len.addr = alloca i64, align 8
  %data = alloca i8*, align 8
  %p = alloca i8*, align 8
  %l = alloca i32, align 4
  %n = alloca i64, align 8
  store %struct.SHAstate_st* %c, %struct.SHAstate_st** %c.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.SHAstate_st** %c.addr, metadata !37, metadata !38), !dbg !39
  store i8* %data_, i8** %data_.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %data_.addr, metadata !40, metadata !38), !dbg !41
  store i64 %len, i64* %len.addr, align 8
  call void @llvm.dbg.declare(metadata i64* %len.addr, metadata !42, metadata !38), !dbg !43
  call void @llvm.dbg.declare(metadata i8** %data, metadata !44, metadata !38), !dbg !47
  %0 = load i8*, i8** %data_.addr, align 8, !dbg !48
  store i8* %0, i8** %data, align 8, !dbg !47

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--sha--libcrypto-lib-sha1dgst.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!7 = !{i32 2, !"Dwarf Version", i32 4}
!8 = !{i32 2, !"Debug Info Version", i32 3}
!9 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!10 = distinct !DISubprogram(name: "SHA1_Update", scope: !11, file: !11, line: 128, type: !12, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!11 = !DIFile(filename: "crypto/include/internal/md32_common.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!12 = !DISubroutineType(types: !13)
!13 = !{!14, !15, !32, !34}
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHA_CTX", file: !17, line: 39, baseType: !18)
!17 = !DIFile(filename: "include/openssl/sha.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHAstate_st", file: !17, line: 34, size: 768, align: 32, elements: !19)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !31}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "h0", scope: !18, file: !17, line: 35, baseType: !4, size: 32, align: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !18, file: !17, line: 35, baseType: !4, size: 32, align: 32, offset: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !18, file: !17, line: 35, baseType: !4, size: 32, align: 32, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "h3", scope: !18, file: !17, line: 35, baseType: !4, size: 32, align: 32, offset: 96)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "h4", scope: !18, file: !17, line: 35, baseType: !4, size: 32, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "Nl", scope: !18, file: !17, line: 36, baseType: !4, size: 32, align: 32, offset: 160)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Nh", scope: !18, file: !17, line: 36, baseType: !4, size: 32, align: 32, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !18, file: !17, line: 37, baseType: !28, size: 512, align: 32, offset: 224)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, align: 32, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 16)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !18, file: !17, line: 38, baseType: !4, size: 32, align: 32, offset: 736)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !35, line: 216, baseType: !36)
!35 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!36 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!37 = !DILocalVariable(name: "c", arg: 1, scope: !10, file: !11, line: 128, type: !15)
!38 = !DIExpression()
!39 = !DILocation(line: 128, column: 26, scope: !10)
!40 = !DILocalVariable(name: "data_", arg: 2, scope: !10, file: !11, line: 128, type: !32)
!41 = !DILocation(line: 128, column: 41, scope: !10)
!42 = !DILocalVariable(name: "len", arg: 3, scope: !10, file: !11, line: 128, type: !34)
!43 = !DILocation(line: 128, column: 55, scope: !10)
!44 = !DILocalVariable(name: "data", scope: !10, file: !11, line: 130, type: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!47 = !DILocation(line: 130, column: 26, scope: !10)
!48 = !DILocation(line: 130, column: 33, scope: !10)
!49 = !DILocalVariable(name: "p", scope: !10, file: !11, line: 131, type: !5)
!50 = !DILocation(line: 131, column: 20, scope: !10)
!51 = !DILocalVariable(name: "l", scope: !10, file: !11, line: 132, type: !4)
!52 = !DILocation(line: 132, column: 18, scope: !10)
!53 = !DILocalVariable(name: "n", scope: !10, file: !11, line: 133, type: !34)
!54 = !DILocation(line: 133, column: 12, scope: !10)
!55 = !DILocation(line: 135, column: 9, scope: !56)
!56 = distinct !DILexicalBlock(scope: !10, file: !11, line: 135, column: 9)
!57 = !DILocation(line: 135, column: 13, scope: !56)
!58 = !DILocation(line: 135, column: 9, scope: !10)
!59 = !DILocation(line: 136, column: 9, scope: !56)
!60 = !DILocation(line: 138, column: 10, scope: !10)
!61 = !DILocation(line: 138, column: 13, scope: !10)
!62 = !DILocation(line: 138, column: 35, scope: !10)
!63 = !DILocation(line: 138, column: 20, scope: !10)
!64 = !DILocation(line: 138, column: 40, scope: !10)
!65 = !DILocation(line: 138, column: 16, scope: !10)
!66 = !DILocation(line: 138, column: 9, scope: !10)
!67 = !DILocation(line: 138, column: 47, scope: !10)
!68 = !DILocation(line: 138, column: 7, scope: !10)
!69 = !DILocation(line: 139, column: 9, scope: !70)
!70 = distinct !DILexicalBlock(scope: !10, file: !11, line: 139, column: 9)
!71 = !DILocation(line: 139, column: 13, scope: !70)
!72 = !DILocation(line: 139, column: 16, scope: !70)
!73 = !DILocation(line: 139, column: 11, scope: !70)
!74 = !DILocation(line: 139, column: 9, scope: !10)
!75 = !DILocation(line: 140, column: 9, scope: !70)
!76 = !DILocation(line: 140, column: 12, scope: !70)
!77 = !DILocation(line: 140, column: 14, scope: !70)
!78 = !DILocation(line: 141, column: 30, scope: !10)
!79 = !DILocation(line: 141, column: 34, scope: !10)
!80 = !DILocation(line: 141, column: 14, scope: !10)
!81 = !DILocation(line: 141, column: 5, scope: !10)
!82 = !DILocation(line: 141, column: 8, scope: !10)
!83 = !DILocation(line: 141, column: 11, scope: !10)
!84 = !DILocation(line: 143, column: 13, scope: !10)
!85 = !DILocation(line: 143, column: 5, scope: !10)
!86 = !DILocation(line: 143, column: 8, scope: !10)
!87 = !DILocation(line: 143, column: 11, scope: !10)
!88 = !DILocation(line: 145, column: 9, scope: !10)
!89 = !DILocation(line: 145, column: 12, scope: !10)
!90 = !DILocation(line: 145, column: 7, scope: !10)
!91 = !DILocation(line: 146, column: 9, scope: !92)
!92 = distinct !DILexicalBlock(scope: !10, file: !11, line: 146, column: 9)
!93 = !DILocation(line: 146, column: 11, scope: !92)
!94 = !DILocation(line: 146, column: 9, scope: !10)
!95 = !DILocation(line: 147, column: 30, scope: !96)
