; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--ectest-bin-ectest.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--ectest-bin-ectest.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EC_builtin_curve = type { i32, i8* }
%struct.c2_curve_test = type { i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i8*, i32 }
%struct.ec_group_st = type opaque
%struct.ec_parameters_st = type opaque
%struct.bignum_ctx = type opaque
%struct.bignum_st = type opaque
%struct.ec_point_st = type opaque
%struct.ec_method_st = type opaque
%struct.bn_gencb_st = type opaque

@crv_len = internal global i64 0, align 8
@.str = private unnamed_addr constant [14 x i8] c"test/ectest.c\00", align 1
@.str.1 = private unnamed_addr constant [51 x i8] c"curves = OPENSSL_malloc(sizeof(*curves) * crv_len)\00", align 1
@curves = internal global %struct.EC_builtin_curve* null, align 8
@.str.2 = private unnamed_addr constant [39 x i8] c"EC_get_builtin_curves(curves, crv_len)\00", align 1
@.str.3 = private unnamed_addr constant [15 x i8] c"parameter_test\00", align 1
@.str.4 = private unnamed_addr constant [18 x i8] c"prime_field_tests\00", align 1
@.str.5 = private unnamed_addr constant [18 x i8] c"char2_field_tests\00", align 1
@.str.6 = private unnamed_addr constant [17 x i8] c"char2_curve_test\00", align 1
@.str.7 = private unnamed_addr constant [20 x i8] c"internal_curve_test\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !9)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--ectest-bin-ectest.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 33, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "include/openssl/ec.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "POINT_CONVERSION_COMPRESSED", value: 2)
!7 = !DIEnumerator(name: "POINT_CONVERSION_UNCOMPRESSED", value: 4)
!8 = !DIEnumerator(name: "POINT_CONVERSION_HYBRID", value: 6)
!9 = !{!10, !15, !26, !32, !36}
!10 = distinct !DIGlobalVariable(name: "crv_len", scope: !0, file: !11, line: 26, type: !12, isLocal: true, isDefinition: true, variable: i64* @crv_len)
!11 = !DIFile(filename: "test/ectest.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 216, baseType: !14)
!13 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!14 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!15 = distinct !DIGlobalVariable(name: "curves", scope: !0, file: !11, line: 27, type: !16, isLocal: true, isDefinition: true, variable: %struct.EC_builtin_curve** @curves)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "EC_builtin_curve", file: !4, line: 413, baseType: !18)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 410, size: 128, align: 64, elements: !19)
!19 = !{!20, !22}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "nid", scope: !18, file: !4, line: 411, baseType: !21, size: 32, align: 32)
!21 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !18, file: !4, line: 412, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!25 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!26 = distinct !DIGlobalVariable(name: "p521_named", scope: !0, file: !11, line: 1445, type: !27, isLocal: true, isDefinition: true, variable: [7 x i8]* @p521_named)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 56, align: 8, elements: !30)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!29 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!30 = !{!31}
!31 = !DISubrange(count: 7)
!32 = distinct !DIGlobalVariable(name: "p521_explicit", scope: !0, file: !11, line: 1449, type: !33, isLocal: true, isDefinition: true, variable: [455 x i8]* @p521_explicit)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 3640, align: 8, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 455)
!36 = distinct !DIGlobalVariable(name: "char2_curve_tests", scope: !0, file: !11, line: 647, type: !37, isLocal: true, isDefinition: true, variable: [10 x %struct.c2_curve_test]* @char2_curve_tests)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 6400, align: 64, elements: !50)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "c2_curve_test", file: !11, line: 636, size: 640, align: 64, elements: !39)
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !38, file: !11, line: 637, baseType: !23, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !38, file: !11, line: 638, baseType: !23, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !38, file: !11, line: 639, baseType: !23, size: 64, align: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !38, file: !11, line: 640, baseType: !23, size: 64, align: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !38, file: !11, line: 641, baseType: !23, size: 64, align: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !38, file: !11, line: 642, baseType: !23, size: 64, align: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ybit", scope: !38, file: !11, line: 643, baseType: !21, size: 32, align: 32, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !38, file: !11, line: 644, baseType: !23, size: 64, align: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "cof", scope: !38, file: !11, line: 645, baseType: !23, size: 64, align: 64, offset: 512)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !38, file: !11, line: 646, baseType: !21, size: 32, align: 32, offset: 576)
!50 = !{!51}
!51 = !DISubrange(count: 10)
!52 = !{i32 2, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!55 = distinct !DISubprogram(name: "setup_tests", scope: !11, file: !11, line: 1534, type: !56, isLocal: false, isDefinition: true, scopeLine: 1535, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !58)
!56 = !DISubroutineType(types: !57)
!57 = !{!21}
!58 = !{}
!59 = !DILocation(line: 1537, column: 15, scope: !55)
!60 = !DILocation(line: 1537, column: 13, scope: !55)
!61 = !DILocation(line: 1538, column: 137, scope: !62)
!62 = distinct !DILexicalBlock(scope: !55, file: !11, line: 1538, column: 9)
!63 = !DILocation(line: 1538, column: 135, scope: !62)
!64 = !DILocation(line: 1538, column: 105, scope: !62)
!65 = !DILocation(line: 1538, column: 103, scope: !62)
!66 = !DILocation(line: 1538, column: 96, scope: !62)
!67 = !DILocation(line: 1538, column: 10, scope: !68)
!68 = !DILexicalBlockFile(scope: !62, file: !11, discriminator: 2)
!69 = !DILocation(line: 1538, column: 10, scope: !62)
!70 = !DILocation(line: 1539, column: 9, scope: !62)
!71 = !DILocation(line: 1539, column: 111, scope: !72)
!72 = !DILexicalBlockFile(scope: !62, file: !11, discriminator: 1)
!73 = !DILocation(line: 1539, column: 119, scope: !72)
!74 = !DILocation(line: 1539, column: 89, scope: !72)
!75 = !DILocation(line: 1539, column: 129, scope: !72)
!76 = !DILocation(line: 1539, column: 13, scope: !77)
!77 = !DILexicalBlockFile(scope: !72, file: !11, discriminator: 2)
!78 = !DILocation(line: 1539, column: 13, scope: !72)
!79 = !DILocation(line: 1538, column: 9, scope: !80)
!80 = !DILexicalBlockFile(scope: !55, file: !11, discriminator: 1)
!81 = !DILocation(line: 1540, column: 9, scope: !62)
!82 = !DILocation(line: 1542, column: 5, scope: !55)
!83 = !DILocation(line: 1543, column: 5, scope: !55)
!84 = !DILocation(line: 1545, column: 5, scope: !55)
!85 = !DILocation(line: 1546, column: 5, scope: !55)
!86 = !DILocation(line: 1551, column: 63, scope: !55)
!87 = !DILocation(line: 1551, column: 5, scope: !55)
!88 = !DILocation(line: 1552, column: 77, scope: !55)
!89 = !DILocation(line: 1552, column: 5, scope: !55)
!90 = !DILocation(line: 1553, column: 5, scope: !55)
!91 = !DILocation(line: 1555, column: 5, scope: !55)
!92 = !DILocation(line: 1556, column: 1, scope: !55)
!93 = distinct !DISubprogram(name: "parameter_test", scope: !11, file: !11, line: 1490, type: !56, isLocal: true, isDefinition: true, scopeLine: 1491, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !58)
!94 = !DILocalVariable(name: "group", scope: !93, file: !11, line: 1492, type: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "EC_GROUP", file: !4, line: 45, baseType: !97)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "ec_group_st", file: !4, line: 45, flags: DIFlagFwdDecl)
!98 = !DIExpression()
!99 = !DILocation(line: 1492, column: 15, scope: !93)
!100 = !DILocalVariable(name: "group2", scope: !93, file: !11, line: 1492, type: !95)
!101 = !DILocation(line: 1492, column: 29, scope: !93)
!102 = !DILocalVariable(name: "ecparameters", scope: !93, file: !11, line: 1493, type: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ECPARAMETERS", file: !4, line: 48, baseType: !105)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "ec_parameters_st", file: !4, line: 48, flags: DIFlagFwdDecl)
!106 = !DILocation(line: 1493, column: 19, scope: !93)
!107 = !DILocalVariable(name: "buf", scope: !93, file: !11, line: 1494, type: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!109 = !DILocation(line: 1494, column: 20, scope: !93)
