; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-lib-v3_akey.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-lib-v3_akey.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.v3_ext_method = type { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, {}*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }
%struct.stack_st_CONF_VALUE = type opaque
%struct.v3_ext_ctx = type { i32, %struct.x509_st*, %struct.x509_st*, %struct.X509_req_st*, %struct.X509_crl_st*, %struct.X509V3_CONF_METHOD_st*, i8* }
%struct.x509_st = type opaque
%struct.X509_req_st = type opaque
%struct.X509_crl_st = type opaque
%struct.X509V3_CONF_METHOD_st = type { i8* (i8*, i8*, i8*)*, %struct.stack_st_CONF_VALUE* (i8*, i8*)*, void (i8*, i8*)*, void (i8*, %struct.stack_st_CONF_VALUE*)* }
%struct.bio_st = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !26)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-lib-v3_akey.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !10, !20, !23, !24}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !8, line: 17, baseType: !9)
!8 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !8, line: 17, flags: DIFlagFwdDecl)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_VALUE", file: !12, line: 28, baseType: !13)
!12 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 24, size: 192, align: 64, elements: !14)
!14 = !{!15, !18, !19}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !13, file: !12, line: 25, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !13, file: !12, line: 26, baseType: !16, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !13, file: !12, line: 27, baseType: !16, size: 64, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_GENERAL_NAME", file: !22, line: 166, flags: DIFlagFwdDecl)
!22 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!26 = !{!27}
!27 = distinct !DIGlobalVariable(name: "v3_akey_id", scope: !0, file: !28, line: 26, type: !29, isLocal: false, isDefinition: true, variable: { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, i8* (%struct.v3_ext_method*, i8*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }* @v3_akey_id)
!28 = !DIFile(filename: "crypto/x509v3/v3_akey.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_METHOD", file: !22, line: 92, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_method", file: !22, line: 49, size: 832, align: 64, elements: !32)
!32 = !{!33, !35, !36, !67, !72, !77, !86, !93, !100, !147, !152, !157, !165, !167}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ext_nid", scope: !31, file: !22, line: 50, baseType: !34, size: 32, align: 32)
!34 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !31, file: !22, line: 51, baseType: !34, size: 32, align: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !31, file: !22, line: 53, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !39, line: 318, baseType: !40)
!39 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !42, line: 62, baseType: !43)
!42 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !44, line: 580, size: 448, align: 64, elements: !45)
!44 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!45 = !{!46, !47, !49, !63, !64, !65, !66}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !43, file: !44, line: 581, baseType: !17, size: 8, align: 8)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !43, file: !44, line: 583, baseType: !48, size: 64, align: 64, offset: 64)
!48 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !43, file: !44, line: 584, baseType: !50, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !39, line: 210, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !44, line: 468, size: 320, align: 64, elements: !54)
!54 = !{!55, !57, !58, !59, !62}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !53, file: !44, line: 469, baseType: !56, size: 64, align: 64)
!56 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !53, file: !44, line: 470, baseType: !48, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !53, file: !44, line: 471, baseType: !56, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !53, file: !44, line: 472, baseType: !60, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !53, file: !44, line: 473, baseType: !37, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !43, file: !44, line: 586, baseType: !48, size: 64, align: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !43, file: !44, line: 587, baseType: !24, size: 64, align: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !43, file: !44, line: 588, baseType: !48, size: 64, align: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !43, file: !44, line: 589, baseType: !60, size: 64, align: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ext_new", scope: !31, file: !22, line: 55, baseType: !68, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_NEW", file: !22, line: 28, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!4}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ext_free", scope: !31, file: !22, line: 56, baseType: !73, size: 64, align: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_FREE", file: !22, line: 29, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !4}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "d2i", scope: !31, file: !22, line: 57, baseType: !78, size: 64, align: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_D2I", file: !22, line: 30, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!4, !4, !82, !48}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "i2d", scope: !31, file: !22, line: 58, baseType: !87, size: 64, align: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2D", file: !22, line: 31, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!34, !4, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i2s", scope: !31, file: !22, line: 60, baseType: !94, size: 64, align: 64, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2S", file: !22, line: 38, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!16, !98, !4}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "s2i", scope: !31, file: !22, line: 61, baseType: !101, size: 64, align: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_S2I", file: !22, line: 40, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!4, !98, !105, !60}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_ctx", file: !22, line: 79, size: 448, align: 64, elements: !107)
!107 = !{!108, !109, !113, !114, !119, !123, !146}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !106, file: !22, line: 82, baseType: !34, size: 32, align: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_cert", scope: !106, file: !22, line: 83, baseType: !110, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !42, line: 124, baseType: !112)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !42, line: 124, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "subject_cert", scope: !106, file: !22, line: 84, baseType: !110, size: 64, align: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "subject_req", scope: !106, file: !22, line: 85, baseType: !115, size: 64, align: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_REQ", file: !117, line: 93, baseType: !118)
!117 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_req_st", file: !117, line: 93, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !106, file: !22, line: 86, baseType: !120, size: 64, align: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !42, line: 126, baseType: !122)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !42, line: 126, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "db_meth", scope: !106, file: !22, line: 87, baseType: !124, size: 64, align: 64, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CONF_METHOD", file: !22, line: 76, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509V3_CONF_METHOD_st", file: !22, line: 71, size: 256, align: 64, elements: !127)
!127 = !{!128, !132, !138, !142}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "get_string", scope: !126, file: !22, line: 72, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!16, !4, !60, !60}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "get_section", scope: !126, file: !22, line: 73, baseType: !133, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !4, !60}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !12, line: 30, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "free_string", scope: !126, file: !22, line: 74, baseType: !139, size: 64, align: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !4, !16}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "free_section", scope: !126, file: !22, line: 75, baseType: !143, size: 64, align: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !4, !136}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !106, file: !22, line: 88, baseType: !4, size: 64, align: 64, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "i2v", scope: !31, file: !22, line: 63, baseType: !148, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2V", file: !22, line: 33, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!136, !98, !4, !136}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "v2i", scope: !31, file: !22, line: 64, baseType: !153, size: 64, align: 64, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_V2I", file: !22, line: 35, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!4, !98, !105, !136}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "i2r", scope: !31, file: !22, line: 66, baseType: !158, size: 64, align: 64, offset: 640)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2R", file: !22, line: 42, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!34, !98, !4, !162, !34}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !42, line: 79, baseType: !164)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !42, line: 79, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "r2i", scope: !31, file: !22, line: 67, baseType: !166, size: 64, align: 64, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_R2I", file: !22, line: 44, baseType: !102)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "usr_data", scope: !31, file: !22, line: 68, baseType: !4, size: 64, align: 64, offset: 768)
!168 = !{i32 2, !"Dwarf Version", i32 4}
!169 = !{i32 2, !"Debug Info Version", i32 3}
!170 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!171 = distinct !DISubprogram(name: "i2v_AUTHORITY_KEYID", scope: !28, file: !28, line: 37, type: !172, isLocal: true, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!172 = !DISubroutineType(types: !173)
!173 = !{!136, !174, !175, !136}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AUTHORITY_KEYID", file: !42, line: 162, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AUTHORITY_KEYID_st", file: !22, line: 207, size: 192, align: 64, elements: !178)
!178 = !{!179, !188, !191}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "keyid", scope: !177, file: !22, line: 208, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !42, line: 43, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !39, line: 146, size: 192, align: 64, elements: !183)
!183 = !{!184, !185, !186, !187}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !182, file: !39, line: 147, baseType: !34, size: 32, align: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !182, file: !39, line: 148, baseType: !34, size: 32, align: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !182, file: !39, line: 149, baseType: !92, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !182, file: !39, line: 155, baseType: !48, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !177, file: !22, line: 209, baseType: !189, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "GENERAL_NAMES", file: !22, line: 167, baseType: !21)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !177, file: !22, line: 210, baseType: !192, size: 64, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !42, line: 40, baseType: !182)
!194 = !DILocalVariable(name: "method", arg: 1, scope: !171, file: !28, line: 37, type: !174)
!195 = !DIExpression()
!196 = !DILocation(line: 37, column: 75, scope: !171)
!197 = !DILocalVariable(name: "akeyid", arg: 2, scope: !171, file: !28, line: 38, type: !175)
!198 = !DILocation(line: 38, column: 67, scope: !171)
!199 = !DILocalVariable(name: "extlist", arg: 3, scope: !171, file: !28, line: 40, type: !136)
!200 = !DILocation(line: 40, column: 51, scope: !171)
!201 = !DILocalVariable(name: "tmp", scope: !171, file: !28, line: 42, type: !16)
!202 = !DILocation(line: 42, column: 11, scope: !171)
!203 = !DILocation(line: 43, column: 9, scope: !204)
!204 = distinct !DILexicalBlock(scope: !171, file: !28, line: 43, column: 9)
!205 = !DILocation(line: 43, column: 17, scope: !204)
!206 = !DILocation(line: 43, column: 9, scope: !171)
!207 = !DILocation(line: 44, column: 34, scope: !208)
!208 = distinct !DILexicalBlock(scope: !204, file: !28, line: 43, column: 24)
!209 = !DILocation(line: 44, column: 42, scope: !208)
!210 = !DILocation(line: 44, column: 49, scope: !208)
!211 = !DILocation(line: 44, column: 55, scope: !208)
!212 = !DILocation(line: 44, column: 63, scope: !208)
!213 = !DILocation(line: 44, column: 70, scope: !208)
!214 = !DILocation(line: 44, column: 15, scope: !208)
!215 = !DILocation(line: 44, column: 13, scope: !208)
!216 = !DILocation(line: 45, column: 35, scope: !208)
!217 = !DILocation(line: 45, column: 9, scope: !208)
!218 = !DILocation(line: 46, column: 21, scope: !208)
!219 = !DILocation(line: 46, column: 9, scope: !208)
!220 = !DILocation(line: 47, column: 5, scope: !208)
!221 = !DILocation(line: 48, column: 9, scope: !222)
!222 = distinct !DILexicalBlock(scope: !171, file: !28, line: 48, column: 9)
!223 = !DILocation(line: 48, column: 17, scope: !222)
!224 = !DILocation(line: 48, column: 9, scope: !171)
!225 = !DILocation(line: 49, column: 42, scope: !222)
!226 = !DILocation(line: 49, column: 50, scope: !222)
!227 = !DILocation(line: 49, column: 58, scope: !222)
!228 = !DILocation(line: 49, column: 19, scope: !222)
!229 = !DILocation(line: 49, column: 17, scope: !222)
!230 = !DILocation(line: 49, column: 9, scope: !222)
!231 = !DILocation(line: 50, column: 9, scope: !232)
!232 = distinct !DILexicalBlock(scope: !171, file: !28, line: 50, column: 9)
!233 = !DILocation(line: 50, column: 17, scope: !232)
!234 = !DILocation(line: 50, column: 9, scope: !171)
!235 = !DILocation(line: 51, column: 34, scope: !236)
!236 = distinct !DILexicalBlock(scope: !232, file: !28, line: 50, column: 25)
!237 = !DILocation(line: 51, column: 42, scope: !236)
!238 = !DILocation(line: 51, column: 50, scope: !236)
!239 = !DILocation(line: 51, column: 56, scope: !236)
!240 = !DILocation(line: 51, column: 64, scope: !236)
!241 = !DILocation(line: 51, column: 72, scope: !236)
!242 = !DILocation(line: 51, column: 15, scope: !236)
!243 = !DILocation(line: 51, column: 13, scope: !236)
!244 = !DILocation(line: 52, column: 36, scope: !236)
!245 = !DILocation(line: 52, column: 9, scope: !236)
!246 = !DILocation(line: 53, column: 21, scope: !236)
!247 = !DILocation(line: 53, column: 9, scope: !236)
!248 = !DILocation(line: 54, column: 5, scope: !236)
!249 = !DILocation(line: 55, column: 12, scope: !171)
!250 = !DILocation(line: 55, column: 5, scope: !171)
!251 = distinct !DISubprogram(name: "v2i_AUTHORITY_KEYID", scope: !28, file: !28, line: 67, type: !252, isLocal: true, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!252 = !DISubroutineType(types: !253)
!253 = !{!175, !174, !254, !136}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CTX", file: !42, line: 143, baseType: !106)
!256 = !DILocalVariable(name: "method", arg: 1, scope: !251, file: !28, line: 67, type: !174)
!257 = !DILocation(line: 67, column: 64, scope: !251)
!258 = !DILocalVariable(name: "ctx", arg: 2, scope: !251, file: !28, line: 68, type: !254)
!259 = !DILocation(line: 68, column: 57, scope: !251)
!260 = !DILocalVariable(name: "values", arg: 3, scope: !251, file: !28, line: 69, type: !136)
!261 = !DILocation(line: 69, column: 73, scope: !251)
!262 = !DILocalVariable(name: "keyid", scope: !251, file: !28, line: 71, type: !17)
!263 = !DILocation(line: 71, column: 10, scope: !251)
!264 = !DILocalVariable(name: "issuer", scope: !251, file: !28, line: 71, type: !17)
!265 = !DILocation(line: 71, column: 21, scope: !251)
!266 = !DILocalVariable(name: "i", scope: !251, file: !28, line: 72, type: !34)
!267 = !DILocation(line: 72, column: 9, scope: !251)
!268 = !DILocalVariable(name: "cnf", scope: !251, file: !28, line: 73, type: !10)
!269 = !DILocation(line: 73, column: 17, scope: !251)
!270 = !DILocalVariable(name: "ikeyid", scope: !251, file: !28, line: 74, type: !180)
!271 = !DILocation(line: 74, column: 24, scope: !251)
!272 = !DILocalVariable(name: "isname", scope: !251, file: !28, line: 75, type: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !42, line: 129, baseType: !275)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !42, line: 129, flags: DIFlagFwdDecl)
!276 = !DILocation(line: 75, column: 16, scope: !251)
!277 = !DILocalVariable(name: "gens", scope: !251, file: !28, line: 76, type: !189)
!278 = !DILocation(line: 76, column: 20, scope: !251)
!279 = !DILocalVariable(name: "gen", scope: !251, file: !28, line: 77, type: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "GENERAL_NAME", file: !22, line: 153, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GENERAL_NAME_st", file: !22, line: 123, size: 128, align: 64, elements: !283)
!283 = !{!284, !285}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !282, file: !22, line: 133, baseType: !34, size: 32, align: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !282, file: !22, line: 152, baseType: !286, size: 64, align: 64, offset: 64)
!286 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !282, file: !22, line: 134, size: 64, align: 64, elements: !287)
!287 = !{!288, !289, !358, !359, !360, !361, !362, !369, !370, !371, !372, !373, !374, !375, !376}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !286, file: !22, line: 135, baseType: !16, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "otherName", scope: !286, file: !22, line: 136, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "OTHERNAME", file: !22, line: 116, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "otherName_st", file: !22, line: 113, size: 128, align: 64, elements: !293)
!293 = !{!294, !298}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type_id", scope: !292, file: !22, line: 114, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !42, line: 60, baseType: !297)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !42, line: 60, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !292, file: !22, line: 115, baseType: !299, size: 64, align: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !39, line: 473, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !39, line: 444, size: 128, align: 64, elements: !302)
!302 = !{!303, !304}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !301, file: !39, line: 445, baseType: !34, size: 32, align: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !301, file: !39, line: 472, baseType: !305, size: 64, align: 64, offset: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !39, line: 446, size: 64, align: 64, elements: !306)
!306 = !{!307, !308, !310, !313, !314, !315, !318, !321, !322, !325, !328, !331, !334, !337, !340, !343, !346, !349, !352, !353, !354}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !305, file: !39, line: 447, baseType: !16, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !305, file: !39, line: 448, baseType: !309, size: 32, align: 32)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !42, line: 56, baseType: !34)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !305, file: !39, line: 449, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !42, line: 55, baseType: !182)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !305, file: !39, line: 450, baseType: !295, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !305, file: !39, line: 451, baseType: !192, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !305, file: !39, line: 452, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !42, line: 41, baseType: !182)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !305, file: !39, line: 453, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !42, line: 42, baseType: !182)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !305, file: !39, line: 454, baseType: !180, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !305, file: !39, line: 455, baseType: !323, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !42, line: 44, baseType: !182)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !305, file: !39, line: 456, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !42, line: 45, baseType: !182)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !305, file: !39, line: 457, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !42, line: 46, baseType: !182)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !305, file: !39, line: 458, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !42, line: 47, baseType: !182)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !305, file: !39, line: 459, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !42, line: 49, baseType: !182)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !305, file: !39, line: 460, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !42, line: 48, baseType: !182)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !305, file: !39, line: 461, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !42, line: 50, baseType: !182)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !305, file: !39, line: 462, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !42, line: 52, baseType: !182)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !305, file: !39, line: 463, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !42, line: 53, baseType: !182)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !305, file: !39, line: 464, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !42, line: 54, baseType: !182)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !305, file: !39, line: 469, baseType: !311, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !305, file: !39, line: 470, baseType: !311, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !305, file: !39, line: 471, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !39, line: 213, baseType: !357)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !39, line: 213, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rfc822Name", scope: !286, file: !22, line: 137, baseType: !329, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "dNSName", scope: !286, file: !22, line: 138, baseType: !329, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "x400Address", scope: !286, file: !22, line: 139, baseType: !299, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "directoryName", scope: !286, file: !22, line: 140, baseType: !273, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ediPartyName", scope: !286, file: !22, line: 141, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDIPARTYNAME", file: !22, line: 121, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EDIPartyName_st", file: !22, line: 118, size: 128, align: 64, elements: !366)
!366 = !{!367, !368}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "nameAssigner", scope: !365, file: !22, line: 119, baseType: !311, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "partyName", scope: !365, file: !22, line: 120, baseType: !311, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "uniformResourceIdentifier", scope: !286, file: !22, line: 142, baseType: !329, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "iPAddress", scope: !286, file: !22, line: 143, baseType: !180, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "registeredID", scope: !286, file: !22, line: 144, baseType: !295, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !286, file: !22, line: 146, baseType: !180, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dirn", scope: !286, file: !22, line: 147, baseType: !273, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ia5", scope: !286, file: !22, line: 148, baseType: !329, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "rid", scope: !286, file: !22, line: 150, baseType: !295, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !286, file: !22, line: 151, baseType: !299, size: 64, align: 64)
!377 = !DILocation(line: 77, column: 19, scope: !251)
!378 = !DILocalVariable(name: "serial", scope: !251, file: !28, line: 78, type: !192)
!379 = !DILocation(line: 78, column: 19, scope: !251)
!380 = !DILocalVariable(name: "ext", scope: !251, file: !28, line: 79, type: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_EXTENSION", file: !117, line: 81, baseType: !383)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_extension_st", file: !117, line: 81, flags: DIFlagFwdDecl)
!384 = !DILocation(line: 79, column: 21, scope: !251)
!385 = !DILocalVariable(name: "cert", scope: !251, file: !28, line: 80, type: !110)
!386 = !DILocation(line: 80, column: 11, scope: !251)
!387 = !DILocalVariable(name: "akeyid", scope: !251, file: !28, line: 81, type: !175)
!388 = !DILocation(line: 81, column: 22, scope: !251)
!389 = !DILocation(line: 83, column: 12, scope: !390)
!390 = distinct !DILexicalBlock(scope: !251, file: !28, line: 83, column: 5)
!391 = !DILocation(line: 83, column: 10, scope: !390)
!392 = !DILocation(line: 83, column: 17, scope: !393)
!393 = !DILexicalBlockFile(scope: !394, file: !28, discriminator: 1)
!394 = distinct !DILexicalBlock(scope: !390, file: !28, line: 83, column: 5)
!395 = !DILocation(line: 83, column: 39, scope: !393)
!396 = !DILocation(line: 83, column: 21, scope: !393)
!397 = !DILocation(line: 83, column: 19, scope: !393)
!398 = !DILocation(line: 83, column: 5, scope: !393)
!399 = !DILocation(line: 84, column: 35, scope: !400)
!400 = distinct !DILexicalBlock(scope: !394, file: !28, line: 83, column: 53)
!401 = !DILocation(line: 84, column: 43, scope: !400)
!402 = !DILocation(line: 84, column: 15, scope: !400)
!403 = !DILocation(line: 84, column: 13, scope: !400)
!404 = !DILocation(line: 85, column: 20, scope: !405)
!405 = distinct !DILexicalBlock(scope: !400, file: !28, line: 85, column: 13)
!406 = !DILocation(line: 85, column: 25, scope: !405)
!407 = !DILocation(line: 85, column: 13, scope: !405)
!408 = !DILocation(line: 85, column: 40, scope: !405)
!409 = !DILocation(line: 85, column: 13, scope: !400)
!410 = !DILocation(line: 86, column: 19, scope: !411)
!411 = distinct !DILexicalBlock(scope: !405, file: !28, line: 85, column: 46)
!412 = !DILocation(line: 87, column: 17, scope: !413)
!413 = distinct !DILexicalBlock(scope: !411, file: !28, line: 87, column: 17)
!414 = !DILocation(line: 87, column: 22, scope: !413)
!415 = !DILocation(line: 87, column: 28, scope: !413)
!416 = !DILocation(line: 87, column: 38, scope: !417)
!417 = !DILexicalBlockFile(scope: !413, file: !28, discriminator: 1)
!418 = !DILocation(line: 87, column: 43, scope: !417)
!419 = !DILocation(line: 87, column: 31, scope: !417)
!420 = !DILocation(line: 87, column: 60, scope: !417)
