; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-a_i2d_fp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-a_i2d_fp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.bio_st = type opaque
%struct.bio_method_st = type opaque
%struct.ASN1_ITEM_st = type opaque
%struct.ASN1_VALUE_st = type opaque

@.str = private unnamed_addr constant [23 x i8] c"crypto/asn1/a_i2d_fp.c\00", align 1

; Function Attrs: nounwind uwtable
define i32 @ASN1_i2d_fp(i32 (i8*, i8**)* %i2d, %struct._IO_FILE* %out, i8* %x) #0 !dbg !12 {
entry:
  %retval = alloca i32, align 4
  %i2d.addr = alloca i32 (i8*, i8**)*, align 8
  %out.addr = alloca %struct._IO_FILE*, align 8
  %x.addr = alloca i8*, align 8
  %b = alloca %struct.bio_st*, align 8
  %ret = alloca i32, align 4
  store i32 (i8*, i8**)* %i2d, i32 (i8*, i8**)** %i2d.addr, align 8
  call void @llvm.dbg.declare(metadata i32 (i8*, i8**)** %i2d.addr, metadata !82, metadata !83), !dbg !84
  store %struct._IO_FILE* %out, %struct._IO_FILE** %out.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-a_i2d_fp.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !7}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!9 = !{i32 2, !"Dwarf Version", i32 4}
!10 = !{i32 2, !"Debug Info Version", i32 3}
!11 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!12 = distinct !DISubprogram(name: "ASN1_i2d_fp", scope: !13, file: !13, line: 18, type: !14, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!13 = !DIFile(filename: "crypto/asn1/a_i2d_fp.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!14 = !DISubroutineType(types: !15)
!15 = !{!16, !17, !23, !4}
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2d_of_void", file: !19, line: 277, baseType: !20)
!19 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!20 = !DISubroutineType(types: !21)
!21 = !{!16, !4, !22}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !25, line: 48, baseType: !26)
!25 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !27, line: 241, size: 1728, align: 64, elements: !28)
!27 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !49, !50, !51, !52, !56, !58, !60, !64, !67, !69, !70, !71, !72, !73, !77, !78}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !26, file: !27, line: 242, baseType: !16, size: 32, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !26, file: !27, line: 247, baseType: !5, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !26, file: !27, line: 248, baseType: !5, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !26, file: !27, line: 249, baseType: !5, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !26, file: !27, line: 250, baseType: !5, size: 64, align: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !26, file: !27, line: 251, baseType: !5, size: 64, align: 64, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !26, file: !27, line: 252, baseType: !5, size: 64, align: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !26, file: !27, line: 253, baseType: !5, size: 64, align: 64, offset: 448)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !26, file: !27, line: 254, baseType: !5, size: 64, align: 64, offset: 512)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !26, file: !27, line: 256, baseType: !5, size: 64, align: 64, offset: 576)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !26, file: !27, line: 257, baseType: !5, size: 64, align: 64, offset: 640)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !26, file: !27, line: 258, baseType: !5, size: 64, align: 64, offset: 704)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !26, file: !27, line: 260, baseType: !42, size: 64, align: 64, offset: 768)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !27, line: 156, size: 192, align: 64, elements: !44)
!44 = !{!45, !46, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !43, file: !27, line: 157, baseType: !42, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !43, file: !27, line: 158, baseType: !47, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !43, file: !27, line: 162, baseType: !16, size: 32, align: 32, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !26, file: !27, line: 262, baseType: !47, size: 64, align: 64, offset: 832)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !26, file: !27, line: 264, baseType: !16, size: 32, align: 32, offset: 896)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !26, file: !27, line: 268, baseType: !16, size: 32, align: 32, offset: 928)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !26, file: !27, line: 270, baseType: !53, size: 64, align: 64, offset: 960)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !54, line: 131, baseType: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!55 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !26, file: !27, line: 274, baseType: !57, size: 16, align: 16, offset: 1024)
!57 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !26, file: !27, line: 275, baseType: !59, size: 8, align: 8, offset: 1040)
!59 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !26, file: !27, line: 276, baseType: !61, size: 8, align: 8, offset: 1048)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 8, align: 8, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 1)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !26, file: !27, line: 280, baseType: !65, size: 64, align: 64, offset: 1088)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !27, line: 150, baseType: null)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !26, file: !27, line: 289, baseType: !68, size: 64, align: 64, offset: 1152)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !54, line: 132, baseType: !55)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !26, file: !27, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !26, file: !27, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !26, file: !27, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !26, file: !27, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !26, file: !27, line: 302, baseType: !74, size: 64, align: 64, offset: 1472)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 216, baseType: !76)
!75 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!76 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !26, file: !27, line: 303, baseType: !16, size: 32, align: 32, offset: 1536)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !26, file: !27, line: 305, baseType: !79, size: 160, align: 8, offset: 1568)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 160, align: 8, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 20)
!82 = !DILocalVariable(name: "i2d", arg: 1, scope: !12, file: !13, line: 18, type: !17)
!83 = !DIExpression()
!84 = !DILocation(line: 18, column: 30, scope: !12)
!85 = !DILocalVariable(name: "out", arg: 2, scope: !12, file: !13, line: 18, type: !23)
!86 = !DILocation(line: 18, column: 41, scope: !12)
!87 = !DILocalVariable(name: "x", arg: 3, scope: !12, file: !13, line: 18, type: !4)
!88 = !DILocation(line: 18, column: 52, scope: !12)
!89 = !DILocalVariable(name: "b", scope: !12, file: !13, line: 20, type: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !92, line: 79, baseType: !93)
!92 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !92, line: 79, flags: DIFlagFwdDecl)
!94 = !DILocation(line: 20, column: 10, scope: !12)
!95 = !DILocalVariable(name: "ret", scope: !12, file: !13, line: 21, type: !16)
!96 = !DILocation(line: 21, column: 9, scope: !12)
!97 = !DILocation(line: 23, column: 22, scope: !98)
!98 = distinct !DILexicalBlock(scope: !12, file: !13, line: 23, column: 9)
!99 = !DILocation(line: 23, column: 14, scope: !100)
!100 = !DILexicalBlockFile(scope: !98, file: !13, discriminator: 1)
!101 = !DILocation(line: 23, column: 12, scope: !98)
!102 = !DILocation(line: 23, column: 37, scope: !98)
!103 = !DILocation(line: 23, column: 9, scope: !12)
!104 = !DILocation(line: 24, column: 9, scope: !105)
!105 = distinct !DILexicalBlock(scope: !98, file: !13, line: 23, column: 45)
!106 = !DILocation(line: 25, column: 9, scope: !105)
!107 = !DILocation(line: 27, column: 14, scope: !12)
!108 = !DILocation(line: 27, column: 34, scope: !12)
!109 = !DILocation(line: 27, column: 25, scope: !12)
!110 = !DILocation(line: 27, column: 5, scope: !12)
!111 = !DILocation(line: 28, column: 24, scope: !12)
!112 = !DILocation(line: 28, column: 29, scope: !12)
!113 = !DILocation(line: 28, column: 32, scope: !12)
!114 = !DILocation(line: 28, column: 11, scope: !12)
!115 = !DILocation(line: 28, column: 9, scope: !12)
!116 = !DILocation(line: 29, column: 14, scope: !12)
!117 = !DILocation(line: 29, column: 5, scope: !12)
!118 = !DILocation(line: 30, column: 12, scope: !12)
!119 = !DILocation(line: 30, column: 5, scope: !12)
!120 = !DILocation(line: 31, column: 1, scope: !12)
!121 = distinct !DISubprogram(name: "ASN1_i2d_bio", scope: !13, file: !13, line: 34, type: !122, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!122 = !DISubroutineType(types: !123)
!123 = !{!16, !17, !90, !7}
!124 = !DILocalVariable(name: "i2d", arg: 1, scope: !121, file: !13, line: 34, type: !17)
!125 = !DILocation(line: 34, column: 31, scope: !121)
!126 = !DILocalVariable(name: "out", arg: 2, scope: !121, file: !13, line: 34, type: !90)
!127 = !DILocation(line: 34, column: 41, scope: !121)
!128 = !DILocalVariable(name: "x", arg: 3, scope: !121, file: !13, line: 34, type: !7)
!129 = !DILocation(line: 34, column: 61, scope: !121)
!130 = !DILocalVariable(name: "b", scope: !121, file: !13, line: 36, type: !5)
!131 = !DILocation(line: 36, column: 11, scope: !121)
!132 = !DILocalVariable(name: "p", scope: !121, file: !13, line: 37, type: !7)
!133 = !DILocation(line: 37, column: 20, scope: !121)
!134 = !DILocalVariable(name: "i", scope: !121, file: !13, line: 38, type: !16)
!135 = !DILocation(line: 38, column: 9, scope: !121)
!136 = !DILocalVariable(name: "j", scope: !121, file: !13, line: 38, type: !16)
!137 = !DILocation(line: 38, column: 12, scope: !121)
