; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--pkcs7--libcrypto-lib-pk7_doit.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--pkcs7--libcrypto-lib-pk7_doit.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type opaque
%struct.pkcs7_st = type { i8*, i64, i32, i32, %struct.asn1_object_st*, %union.anon }
%struct.asn1_object_st = type opaque
%union.anon = type { i8* }
%struct.bio_st = type opaque
%struct.X509_algor_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_type_st = type { i32, %union.anon.0 }
%union.anon.0 = type { i8* }
%struct.evp_cipher_st = type opaque
%struct.stack_st_X509_ALGOR = type opaque
%struct.stack_st_PKCS7_RECIP_INFO = type opaque
%struct.pkcs7_recip_info_st = type { %struct.asn1_string_st*, %struct.pkcs7_issuer_and_serial_st*, %struct.X509_algor_st*, %struct.asn1_string_st*, %struct.x509_st* }
%struct.pkcs7_issuer_and_serial_st = type { %struct.X509_name_st*, %struct.asn1_string_st* }
%struct.X509_name_st = type opaque
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.x509_st = type opaque
%struct.evp_cipher_ctx_st = type opaque
%struct.pkcs7_signed_st = type { %struct.asn1_string_st*, %struct.stack_st_X509_ALGOR*, %struct.stack_st_X509*, %struct.stack_st_X509_CRL*, %struct.stack_st_PKCS7_SIGNER_INFO*, %struct.pkcs7_st* }
%struct.stack_st_X509 = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--pkcs7--libcrypto-lib-pk7_doit.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !7, !9, !13, !14, !19, !97, !119, !136, !137, !127, !141, !144}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !11, line: 213, baseType: !12)
!11 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !11, line: 213, flags: DIFlagFwdDecl)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !17, line: 17, baseType: !18)
!17 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !17, line: 17, flags: DIFlagFwdDecl)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !21, line: 125, baseType: !22)
!21 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !23, line: 59, size: 128, align: 64, elements: !24)
!23 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!24 = !{!25, !29}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !22, file: !23, line: 60, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !21, line: 60, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !21, line: 60, flags: DIFlagFwdDecl)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !22, file: !23, line: 61, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !11, line: 473, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !11, line: 444, size: 128, align: 64, elements: !33)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !32, file: !11, line: 445, baseType: !13, size: 32, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !32, file: !11, line: 472, baseType: !36, size: 64, align: 64, offset: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !32, file: !11, line: 446, size: 64, align: 64, elements: !37)
!37 = !{!38, !39, !41, !51, !52, !55, !58, !61, !64, !67, !70, !73, !76, !79, !82, !85, !88, !91, !94, !95, !96}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !36, file: !11, line: 447, baseType: !5, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !36, file: !11, line: 448, baseType: !40, size: 32, align: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !21, line: 56, baseType: !13)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !36, file: !11, line: 449, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !21, line: 55, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !11, line: 146, size: 192, align: 64, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !44, file: !11, line: 147, baseType: !13, size: 32, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !44, file: !11, line: 148, baseType: !13, size: 32, align: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !44, file: !11, line: 149, baseType: !7, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !44, file: !11, line: 155, baseType: !50, size: 64, align: 64, offset: 128)
!50 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !36, file: !11, line: 450, baseType: !26, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !36, file: !11, line: 451, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !21, line: 40, baseType: !44)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !36, file: !11, line: 452, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !21, line: 41, baseType: !44)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !36, file: !11, line: 453, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !21, line: 42, baseType: !44)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !36, file: !11, line: 454, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !21, line: 43, baseType: !44)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !36, file: !11, line: 455, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !21, line: 44, baseType: !44)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !36, file: !11, line: 456, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !21, line: 45, baseType: !44)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !36, file: !11, line: 457, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !21, line: 46, baseType: !44)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !36, file: !11, line: 458, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !21, line: 47, baseType: !44)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !36, file: !11, line: 459, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !21, line: 49, baseType: !44)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !36, file: !11, line: 460, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !21, line: 48, baseType: !44)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !36, file: !11, line: 461, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !21, line: 50, baseType: !44)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !36, file: !11, line: 462, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !21, line: 52, baseType: !44)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !36, file: !11, line: 463, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !21, line: 53, baseType: !44)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !36, file: !11, line: 464, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !21, line: 54, baseType: !44)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !36, file: !11, line: 469, baseType: !42, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !36, file: !11, line: 470, baseType: !42, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !36, file: !11, line: 471, baseType: !9, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_RECIP_INFO", file: !99, line: 57, baseType: !100)
!99 = !DIFile(filename: "include/openssl/pkcs7.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_recip_info_st", file: !99, line: 51, size: 320, align: 64, elements: !101)
!101 = !{!102, !103, !113, !114, !115}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !100, file: !99, line: 52, baseType: !53, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_and_serial", scope: !100, file: !99, line: 53, baseType: !104, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ISSUER_AND_SERIAL", file: !99, line: 35, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_issuer_and_serial_st", file: !99, line: 32, size: 128, align: 64, elements: !107)
!107 = !{!108, !112}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !106, file: !99, line: 33, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !21, line: 129, baseType: !111)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !21, line: 129, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !106, file: !99, line: 34, baseType: !53, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "key_enc_algor", scope: !100, file: !99, line: 54, baseType: !19, size: 64, align: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "enc_key", scope: !100, file: !99, line: 55, baseType: !62, size: 64, align: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !100, file: !99, line: 56, baseType: !116, size: 64, align: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !21, line: 124, baseType: !118)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !21, line: 124, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGNER_INFO", file: !99, line: 47, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signer_info_st", file: !99, line: 37, size: 512, align: 64, elements: !122)
!122 = !{!123, !124, !125, !126, !129, !130, !131, !132}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !121, file: !99, line: 38, baseType: !53, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_and_serial", scope: !121, file: !99, line: 39, baseType: !104, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "digest_alg", scope: !121, file: !99, line: 40, baseType: !19, size: 64, align: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "auth_attr", scope: !121, file: !99, line: 41, baseType: !127, size: 64, align: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ATTRIBUTE", file: !23, line: 89, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "digest_enc_alg", scope: !121, file: !99, line: 42, baseType: !19, size: 64, align: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "enc_digest", scope: !121, file: !99, line: 43, baseType: !62, size: 64, align: 64, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "unauth_attr", scope: !121, file: !99, line: 44, baseType: !127, size: 64, align: 64, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !121, file: !99, line: 46, baseType: !133, size: 64, align: 64, offset: 448)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !21, line: 95, baseType: !135)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !21, line: 95, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !17, line: 20, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !4}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ATTRIBUTE", file: !23, line: 87, baseType: !143)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_attributes_st", file: !23, line: 87, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!146 = !{i32 2, !"Dwarf Version", i32 4}
!147 = !{i32 2, !"Debug Info Version", i32 3}
!148 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!149 = distinct !DISubprogram(name: "PKCS7_dataInit", scope: !150, file: !150, line: 193, type: !151, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!150 = !DIFile(filename: "crypto/pkcs7/pk7_doit.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !156, !153}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !21, line: 79, baseType: !155)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !21, line: 79, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7", file: !99, line: 144, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_st", file: !99, line: 109, size: 320, align: 64, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "asn1", scope: !158, file: !99, line: 114, baseType: !7, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !158, file: !99, line: 115, baseType: !50, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !158, file: !99, line: 119, baseType: !13, size: 32, align: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !158, file: !99, line: 120, baseType: !13, size: 32, align: 32, offset: 160)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !158, file: !99, line: 121, baseType: !26, size: 64, align: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !158, file: !99, line: 143, baseType: !166, size: 64, align: 64, offset: 256)
!166 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !158, file: !99, line: 127, size: 64, align: 64, elements: !167)
!167 = !{!168, !169, !170, !190, !212, !224, !233, !240}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !166, file: !99, line: 128, baseType: !5, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !166, file: !99, line: 130, baseType: !62, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !166, file: !99, line: 132, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGNED", file: !99, line: 68, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signed_st", file: !99, line: 61, size: 384, align: 64, elements: !174)
!174 = !{!175, !176, !179, !182, !185, !188}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !173, file: !99, line: 62, baseType: !53, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !173, file: !99, line: 63, baseType: !177, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ALGOR", file: !11, line: 119, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !173, file: !99, line: 64, baseType: !180, size: 64, align: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !23, line: 99, flags: DIFlagFwdDecl)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !173, file: !99, line: 65, baseType: !183, size: 64, align: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_CRL", file: !23, line: 228, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !173, file: !99, line: 66, baseType: !186, size: 64, align: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_SIGNER_INFO", file: !99, line: 49, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !173, file: !99, line: 67, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "enveloped", scope: !166, file: !99, line: 134, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENVELOPE", file: !99, line: 85, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enveloped_st", file: !99, line: 81, size: 192, align: 64, elements: !194)
!194 = !{!195, !196, !199}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !193, file: !99, line: 82, baseType: !53, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !193, file: !99, line: 83, baseType: !197, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_RECIP_INFO", file: !99, line: 59, flags: DIFlagFwdDecl)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !193, file: !99, line: 84, baseType: !200, size: 64, align: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENC_CONTENT", file: !99, line: 79, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enc_content_st", file: !99, line: 74, size: 256, align: 64, elements: !203)
!203 = !{!204, !205, !206, !207}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !202, file: !99, line: 75, baseType: !26, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !202, file: !99, line: 76, baseType: !19, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !202, file: !99, line: 77, baseType: !62, size: 64, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !202, file: !99, line: 78, baseType: !208, size: 64, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !21, line: 89, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !21, line: 89, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "signed_and_enveloped", scope: !166, file: !99, line: 136, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGN_ENVELOPE", file: !99, line: 95, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signedandenveloped_st", file: !99, line: 87, size: 448, align: 64, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !215, file: !99, line: 88, baseType: !53, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !215, file: !99, line: 89, baseType: !177, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !215, file: !99, line: 90, baseType: !180, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !215, file: !99, line: 91, baseType: !183, size: 64, align: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !215, file: !99, line: 92, baseType: !186, size: 64, align: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !215, file: !99, line: 93, baseType: !200, size: 64, align: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !215, file: !99, line: 94, baseType: !197, size: 64, align: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !166, file: !99, line: 138, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_DIGEST", file: !99, line: 102, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_digest_st", file: !99, line: 97, size: 256, align: 64, elements: !228)
!228 = !{!229, !230, !231, !232}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !227, file: !99, line: 98, baseType: !53, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !227, file: !99, line: 99, baseType: !19, size: 64, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !227, file: !99, line: 100, baseType: !189, size: 64, align: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !227, file: !99, line: 101, baseType: !62, size: 64, align: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "encrypted", scope: !166, file: !99, line: 140, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENCRYPT", file: !99, line: 107, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_encrypted_st", file: !99, line: 104, size: 128, align: 64, elements: !237)
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !236, file: !99, line: 105, baseType: !53, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !236, file: !99, line: 106, baseType: !200, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !166, file: !99, line: 142, baseType: !30, size: 64, align: 64)
!241 = !DILocalVariable(name: "p7", arg: 1, scope: !149, file: !150, line: 193, type: !156)
!242 = !DIExpression()
!243 = !DILocation(line: 193, column: 28, scope: !149)
!244 = !DILocalVariable(name: "bio", arg: 2, scope: !149, file: !150, line: 193, type: !153)
!245 = !DILocation(line: 193, column: 37, scope: !149)
!246 = !DILocalVariable(name: "i", scope: !149, file: !150, line: 195, type: !13)
!247 = !DILocation(line: 195, column: 9, scope: !149)
!248 = !DILocalVariable(name: "out", scope: !149, file: !150, line: 196, type: !153)
!249 = !DILocation(line: 196, column: 10, scope: !149)
!250 = !DILocalVariable(name: "btmp", scope: !149, file: !150, line: 196, type: !153)
!251 = !DILocation(line: 196, column: 22, scope: !149)
!252 = !DILocalVariable(name: "xa", scope: !149, file: !150, line: 197, type: !19)
!253 = !DILocation(line: 197, column: 17, scope: !149)
!254 = !DILocalVariable(name: "evp_cipher", scope: !149, file: !150, line: 198, type: !208)
!255 = !DILocation(line: 198, column: 23, scope: !149)
!256 = !DILocalVariable(name: "md_sk", scope: !149, file: !150, line: 199, type: !177)
!257 = !DILocation(line: 199, column: 33, scope: !149)
!258 = !DILocalVariable(name: "rsk", scope: !149, file: !150, line: 200, type: !197)
!259 = !DILocation(line: 200, column: 39, scope: !149)
!260 = !DILocalVariable(name: "xalg", scope: !149, file: !150, line: 201, type: !19)
!261 = !DILocation(line: 201, column: 17, scope: !149)
!262 = !DILocalVariable(name: "ri", scope: !149, file: !150, line: 202, type: !97)
!263 = !DILocation(line: 202, column: 23, scope: !149)
!264 = !DILocalVariable(name: "os", scope: !149, file: !150, line: 203, type: !62)
!265 = !DILocation(line: 203, column: 24, scope: !149)
!266 = !DILocation(line: 205, column: 9, scope: !267)
!267 = distinct !DILexicalBlock(scope: !149, file: !150, line: 205, column: 9)
!268 = !DILocation(line: 205, column: 12, scope: !267)
!269 = !DILocation(line: 205, column: 9, scope: !149)
!270 = !DILocation(line: 206, column: 9, scope: !271)
!271 = distinct !DILexicalBlock(scope: !267, file: !150, line: 205, column: 20)
!272 = !DILocation(line: 207, column: 9, scope: !271)
!273 = !DILocation(line: 219, column: 9, scope: !274)
!274 = distinct !DILexicalBlock(scope: !149, file: !150, line: 219, column: 9)
!275 = !DILocation(line: 219, column: 13, scope: !274)
!276 = !DILocation(line: 219, column: 15, scope: !274)
!277 = !DILocation(line: 219, column: 19, scope: !274)
!278 = !DILocation(line: 219, column: 9, scope: !149)
!279 = !DILocation(line: 220, column: 9, scope: !280)
!280 = distinct !DILexicalBlock(scope: !274, file: !150, line: 219, column: 27)
!281 = !DILocation(line: 221, column: 9, scope: !280)
!282 = !DILocation(line: 224, column: 21, scope: !149)
!283 = !DILocation(line: 224, column: 25, scope: !149)
!284 = !DILocation(line: 224, column: 9, scope: !149)
!285 = !DILocation(line: 224, column: 7, scope: !149)
!286 = !DILocation(line: 225, column: 5, scope: !149)
!287 = !DILocation(line: 225, column: 9, scope: !149)
!288 = !DILocation(line: 225, column: 15, scope: !149)
!289 = !DILocation(line: 227, column: 13, scope: !149)
!290 = !DILocation(line: 227, column: 5, scope: !149)
!291 = !DILocation(line: 229, column: 17, scope: !292)
!292 = distinct !DILexicalBlock(scope: !149, file: !150, line: 227, column: 16)
!293 = !DILocation(line: 229, column: 21, scope: !292)
!294 = !DILocation(line: 229, column: 23, scope: !292)
!295 = !DILocation(line: 229, column: 29, scope: !292)
!296 = !DILocation(line: 229, column: 15, scope: !292)
!297 = !DILocation(line: 230, column: 37, scope: !292)
!298 = !DILocation(line: 230, column: 41, scope: !292)
!299 = !DILocation(line: 230, column: 43, scope: !292)
!300 = !DILocation(line: 230, column: 49, scope: !292)
