; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]ssl--libssl-lib-packet.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]ssl--libssl-lib-packet.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wpacket_st = type { %struct.buf_mem_st*, i8*, i64, i64, i64, %struct.wpacket_sub* }
%struct.buf_mem_st = type { i64, i8*, i64, i64 }
%struct.wpacket_sub = type { %struct.wpacket_sub*, i64, i64, i64, i32 }

@.str = private unnamed_addr constant [13 x i8] c"ssl/packet.c\00", align 1

; Function Attrs: nounwind uwtable
define i32 @WPACKET_allocate_bytes(%struct.wpacket_st* %pkt, i64 %len, i8** %allocbytes) #0 !dbg !13 {
entry:
  %retval = alloca i32, align 4
  %pkt.addr = alloca %struct.wpacket_st*, align 8
  %len.addr = alloca i64, align 8
  %allocbytes.addr = alloca i8**, align 8
  store %struct.wpacket_st* %pkt, %struct.wpacket_st** %pkt.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.wpacket_st** %pkt.addr, metadata !52, metadata !53), !dbg !54
  store i64 %len, i64* %len.addr, align 8
  call void @llvm.dbg.declare(metadata i64* %len.addr, metadata !55, metadata !53), !dbg !56
  store i8** %allocbytes, i8*** %allocbytes.addr, align 8
  call void @llvm.dbg.declare(metadata i8*** %allocbytes.addr, metadata !57, metadata !53), !dbg !58
  %0 = load %struct.wpacket_st*, %struct.wpacket_st** %pkt.addr, align 8, !dbg !59

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]ssl--libssl-lib-packet.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !7, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !8, line: 216, baseType: !9)
!8 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!9 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!10 = !{i32 2, !"Dwarf Version", i32 4}
!11 = !{i32 2, !"Debug Info Version", i32 3}
!12 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!13 = distinct !DISubprogram(name: "WPACKET_allocate_bytes", scope: !14, file: !14, line: 16, type: !15, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!14 = !DIFile(filename: "ssl/packet.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !18, !7, !51}
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "WPACKET", file: !20, line: 619, baseType: !21)
!20 = !DIFile(filename: "ssl/packet_locl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wpacket_st", file: !20, line: 620, size: 384, align: 64, elements: !22)
!22 = !{!23, !36, !37, !38, !39, !40}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !21, file: !20, line: 622, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUF_MEM", file: !26, line: 87, baseType: !27)
!26 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_mem_st", file: !28, line: 38, size: 256, align: 64, elements: !29)
!28 = !DIFile(filename: "include/openssl/buffer.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!29 = !{!30, !31, !34, !35}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !27, file: !28, line: 39, baseType: !7, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !27, file: !28, line: 40, baseType: !32, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !27, file: !28, line: 41, baseType: !7, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !27, file: !28, line: 42, baseType: !9, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "staticbuf", scope: !21, file: !20, line: 625, baseType: !5, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !21, file: !20, line: 631, baseType: !7, size: 64, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !21, file: !20, line: 634, baseType: !7, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !21, file: !20, line: 637, baseType: !7, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !21, file: !20, line: 640, baseType: !41, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "WPACKET_SUB", file: !20, line: 598, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wpacket_sub", file: !20, line: 599, size: 320, align: 64, elements: !44)
!44 = !{!45, !46, !47, !48, !49}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !43, file: !20, line: 601, baseType: !41, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "packet_len", scope: !43, file: !20, line: 607, baseType: !7, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "lenbytes", scope: !43, file: !20, line: 610, baseType: !7, size: 64, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "pwritten", scope: !43, file: !20, line: 613, baseType: !7, size: 64, align: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !43, file: !20, line: 616, baseType: !50, size: 32, align: 32, offset: 256)
!50 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!52 = !DILocalVariable(name: "pkt", arg: 1, scope: !13, file: !14, line: 16, type: !18)
!53 = !DIExpression()
!54 = !DILocation(line: 16, column: 37, scope: !13)
!55 = !DILocalVariable(name: "len", arg: 2, scope: !13, file: !14, line: 16, type: !7)
!56 = !DILocation(line: 16, column: 49, scope: !13)
!57 = !DILocalVariable(name: "allocbytes", arg: 3, scope: !13, file: !14, line: 16, type: !51)
!58 = !DILocation(line: 16, column: 70, scope: !13)
!59 = !DILocation(line: 18, column: 32, scope: !60)
!60 = distinct !DILexicalBlock(scope: !13, file: !14, line: 18, column: 9)
!61 = !DILocation(line: 18, column: 37, scope: !60)
!62 = !DILocation(line: 18, column: 42, scope: !60)
!63 = !DILocation(line: 18, column: 10, scope: !60)
!64 = !DILocation(line: 18, column: 9, scope: !13)
!65 = !DILocation(line: 19, column: 9, scope: !60)
!66 = !DILocation(line: 21, column: 21, scope: !13)
!67 = !DILocation(line: 21, column: 5, scope: !13)
!68 = !DILocation(line: 21, column: 10, scope: !13)
!69 = !DILocation(line: 21, column: 18, scope: !13)
!70 = !DILocation(line: 22, column: 18, scope: !13)
!71 = !DILocation(line: 22, column: 5, scope: !13)
!72 = !DILocation(line: 22, column: 10, scope: !13)
!73 = !DILocation(line: 22, column: 15, scope: !13)
!74 = !DILocation(line: 23, column: 5, scope: !13)
!75 = !DILocation(line: 24, column: 1, scope: !13)
!76 = distinct !DISubprogram(name: "WPACKET_reserve_bytes", scope: !14, file: !14, line: 40, type: !15, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!77 = !DILocalVariable(name: "pkt", arg: 1, scope: !76, file: !14, line: 40, type: !18)
!78 = !DILocation(line: 40, column: 36, scope: !76)
!79 = !DILocalVariable(name: "len", arg: 2, scope: !76, file: !14, line: 40, type: !7)
!80 = !DILocation(line: 40, column: 48, scope: !76)
!81 = !DILocalVariable(name: "allocbytes", arg: 3, scope: !76, file: !14, line: 40, type: !51)
!82 = !DILocation(line: 40, column: 69, scope: !76)
!83 = !DILocation(line: 43, column: 12, scope: !84)
!84 = distinct !DILexicalBlock(scope: !76, file: !14, line: 43, column: 9)
!85 = !DILocation(line: 43, column: 17, scope: !84)
!86 = !DILocation(line: 43, column: 22, scope: !84)
!87 = !DILocation(line: 43, column: 9, scope: !84)
!88 = !DILocation(line: 43, column: 12, scope: !89)
!89 = !DILexicalBlockFile(scope: !84, file: !14, discriminator: 1)
!90 = !DILocation(line: 43, column: 16, scope: !89)
!91 = !DILocation(line: 43, column: 9, scope: !92)
!92 = !DILexicalBlockFile(scope: !84, file: !14, discriminator: 2)
!93 = !DILocation(line: 43, column: 22, scope: !92)
!94 = !DILocation(line: 44, column: 9, scope: !84)
!95 = !DILocation(line: 46, column: 9, scope: !96)
!96 = distinct !DILexicalBlock(scope: !76, file: !14, line: 46, column: 9)
!97 = !DILocation(line: 46, column: 14, scope: !96)
!98 = !DILocation(line: 46, column: 24, scope: !96)
!99 = !DILocation(line: 46, column: 29, scope: !96)
!100 = !DILocation(line: 46, column: 22, scope: !96)
!101 = !DILocation(line: 46, column: 39, scope: !96)
!102 = !DILocation(line: 46, column: 37, scope: !96)
!103 = !DILocation(line: 46, column: 9, scope: !76)
!104 = !DILocation(line: 47, column: 9, scope: !96)
!105 = !DILocation(line: 49, column: 9, scope: !106)
!106 = distinct !DILexicalBlock(scope: !76, file: !14, line: 49, column: 9)
!107 = !DILocation(line: 49, column: 14, scope: !106)
!108 = !DILocation(line: 49, column: 24, scope: !106)
!109 = !DILocation(line: 49, column: 31, scope: !106)
!110 = !DILocation(line: 49, column: 35, scope: !111)
!111 = !DILexicalBlockFile(scope: !106, file: !14, discriminator: 1)
!112 = !DILocation(line: 49, column: 40, scope: !111)
