; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-x_long.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-x_long.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_PRIMITIVE_FUNCS_st = type { i8*, i64, i32 (%struct.ASN1_VALUE_st**, %struct.ASN1_ITEM_st*)*, void (%struct.ASN1_VALUE_st**, %struct.ASN1_ITEM_st*)*, void (%struct.ASN1_VALUE_st**, %struct.ASN1_ITEM_st*)*, i32 (%struct.ASN1_VALUE_st**, i8*, i32, i32, i8*, %struct.ASN1_ITEM_st*)*, i32 (%struct.ASN1_VALUE_st**, i8*, i32*, %struct.ASN1_ITEM_st*)*, i32 (%struct.bio_st*, %struct.ASN1_VALUE_st**, %struct.ASN1_ITEM_st*, i32, %struct.asn1_pctx_st*)* }
%struct.ASN1_VALUE_st = type opaque
%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.bio_st = type opaque
%struct.asn1_pctx_st = type opaque


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !9)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-x_long.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !6, !7, !8}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!6 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!8 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!9 = !{!10, !43, !44}
!10 = distinct !DIGlobalVariable(name: "LONG_it", scope: !0, file: !11, line: 45, type: !12, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @LONG_it)
!11 = !DIFile(filename: "crypto/asn1/x_long.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !14, line: 62, baseType: !15)
!14 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !16, line: 580, size: 448, align: 64, elements: !17)
!16 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!17 = !{!18, !20, !21, !37, !38, !41, !42}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !15, file: !16, line: 581, baseType: !19, size: 8, align: 8)
!19 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !15, file: !16, line: 583, baseType: !5, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !15, file: !16, line: 584, baseType: !22, size: 64, align: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !25, line: 210, baseType: !26)
!25 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !16, line: 468, size: 320, align: 64, elements: !27)
!27 = !{!28, !29, !30, !31, !34}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !26, file: !16, line: 469, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !26, file: !16, line: 470, baseType: !5, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !26, file: !16, line: 471, baseType: !6, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !26, file: !16, line: 472, baseType: !32, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !26, file: !16, line: 473, baseType: !35, size: 64, align: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !25, line: 318, baseType: !12)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !15, file: !16, line: 586, baseType: !5, size: 64, align: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !15, file: !16, line: 587, baseType: !39, size: 64, align: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !15, file: !16, line: 588, baseType: !5, size: 64, align: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !15, file: !16, line: 589, baseType: !32, size: 64, align: 64, offset: 384)
!43 = distinct !DIGlobalVariable(name: "ZLONG_it", scope: !0, file: !11, line: 49, type: !12, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ZLONG_it)
!44 = distinct !DIGlobalVariable(name: "long_pf", scope: !0, file: !11, line: 35, type: !45, isLocal: true, isDefinition: true, variable: %struct.ASN1_PRIMITIVE_FUNCS_st* @long_pf)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRIMITIVE_FUNCS", file: !16, line: 701, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_PRIMITIVE_FUNCS_st", file: !16, line: 692, size: 512, align: 64, elements: !47)
!47 = !{!48, !49, !50, !60, !65, !66, !74, !81}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !46, file: !16, line: 693, baseType: !7, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !46, file: !16, line: 694, baseType: !6, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "prim_new", scope: !46, file: !16, line: 695, baseType: !51, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ex_new_func", file: !16, line: 666, baseType: !53)
!53 = !DISubroutineType(types: !54)
!54 = !{!4, !55, !59}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !25, line: 213, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !25, line: 213, flags: DIFlagFwdDecl)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "prim_free", scope: !46, file: !16, line: 696, baseType: !61, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ex_free_func", file: !16, line: 667, baseType: !63)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !55, !59}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "prim_clear", scope: !46, file: !16, line: 697, baseType: !61, size: 64, align: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "prim_c2i", scope: !46, file: !16, line: 698, baseType: !67, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_primitive_c2i", file: !16, line: 675, baseType: !69)
!69 = !DISubroutineType(types: !70)
!70 = !{!4, !55, !71, !4, !4, !73, !59}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "prim_i2c", scope: !46, file: !16, line: 699, baseType: !75, size: 64, align: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_primitive_i2c", file: !16, line: 673, baseType: !77)
!77 = !DISubroutineType(types: !78)
!78 = !{!4, !55, !79, !80, !59}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "prim_print", scope: !46, file: !16, line: 700, baseType: !82, size: 64, align: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_primitive_print", file: !16, line: 678, baseType: !84)
!84 = !DISubroutineType(types: !85)
!85 = !{!4, !86, !55, !59, !4, !89}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !14, line: 79, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !14, line: 79, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PCTX", file: !14, line: 63, baseType: !92)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_pctx_st", file: !14, line: 63, flags: DIFlagFwdDecl)
!93 = !{i32 2, !"Dwarf Version", i32 4}
!94 = !{i32 2, !"Debug Info Version", i32 3}
!95 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!96 = distinct !DISubprogram(name: "long_new", scope: !11, file: !11, line: 53, type: !53, isLocal: true, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!97 = !DILocalVariable(name: "pval", arg: 1, scope: !96, file: !11, line: 53, type: !55)
!98 = !DIExpression()
!99 = !DILocation(line: 53, column: 34, scope: !96)
!100 = !DILocalVariable(name: "it", arg: 2, scope: !96, file: !11, line: 53, type: !59)
!101 = !DILocation(line: 53, column: 57, scope: !96)
!102 = !DILocation(line: 55, column: 12, scope: !96)
!103 = !DILocation(line: 55, column: 5, scope: !96)
!104 = !DILocation(line: 55, column: 19, scope: !96)
!105 = !DILocation(line: 55, column: 23, scope: !96)
!106 = !DILocation(line: 56, column: 5, scope: !96)
!107 = distinct !DISubprogram(name: "long_free", scope: !11, file: !11, line: 59, type: !63, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!108 = !DILocalVariable(name: "pval", arg: 1, scope: !107, file: !11, line: 59, type: !55)
!109 = !DILocation(line: 59, column: 36, scope: !107)
!110 = !DILocalVariable(name: "it", arg: 2, scope: !107, file: !11, line: 59, type: !59)
!111 = !DILocation(line: 59, column: 59, scope: !107)
!112 = !DILocation(line: 61, column: 12, scope: !107)
!113 = !DILocation(line: 61, column: 5, scope: !107)
!114 = !DILocation(line: 61, column: 19, scope: !107)
!115 = !DILocation(line: 61, column: 23, scope: !107)
!116 = !DILocation(line: 62, column: 1, scope: !107)
!117 = distinct !DISubprogram(name: "long_c2i", scope: !11, file: !11, line: 132, type: !69, isLocal: true, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!118 = !DILocalVariable(name: "pval", arg: 1, scope: !117, file: !11, line: 132, type: !55)
!119 = !DILocation(line: 132, column: 34, scope: !117)
!120 = !DILocalVariable(name: "cont", arg: 2, scope: !117, file: !11, line: 132, type: !71)
!121 = !DILocation(line: 132, column: 61, scope: !117)
!122 = !DILocalVariable(name: "len", arg: 3, scope: !117, file: !11, line: 132, type: !4)
!123 = !DILocation(line: 132, column: 71, scope: !117)
!124 = !DILocalVariable(name: "utype", arg: 4, scope: !117, file: !11, line: 133, type: !4)
!125 = !DILocation(line: 133, column: 25, scope: !117)
!126 = !DILocalVariable(name: "free_cont", arg: 5, scope: !117, file: !11, line: 133, type: !73)
!127 = !DILocation(line: 133, column: 38, scope: !117)
!128 = !DILocalVariable(name: "it", arg: 6, scope: !117, file: !11, line: 133, type: !59)
!129 = !DILocation(line: 133, column: 66, scope: !117)
!130 = !DILocalVariable(name: "i", scope: !117, file: !11, line: 135, type: !4)
!131 = !DILocation(line: 135, column: 9, scope: !117)
