; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--testutil--libtestutil-lib-stanza.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--testutil--libtestutil-lib-stanza.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.stanza_st = type { i8*, %struct.bio_st*, i32, i32, i32, i32, i32, i32, [20 x %struct.pair_st], %struct.bio_st*, [4096 x i8] }
%struct.pair_st = type { i8*, i8* }
%struct.bio_st = type opaque
%struct.bio_method_st = type opaque

@.str = private unnamed_addr constant [23 x i8] c"test/testutil/stanza.c\00", align 1
@.str.1 = private unnamed_addr constant [11 x i8] c"Reading %s\00", align 1
@.str.2 = private unnamed_addr constant [36 x i8] c"s->fp = BIO_new_file(testfile, \22r\22)\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.4 = private unnamed_addr constant [49 x i8] c"Completed %d tests with %d errors and %d skipped\00", align 1
@.str.5 = private unnamed_addr constant [26 x i8] c"p = strchr(s->buff, '\5Cn')\00", align 1
@.str.6 = private unnamed_addr constant [17 x i8] c"Line %d too long\00", align 1
@.str.7 = private unnamed_addr constant [30 x i8] c"equals = strchr(s->buff, '=')\00", align 1
@.str.8 = private unnamed_addr constant [22 x i8] c"Missing = at line %d\0A\00", align 1
@.str.9 = private unnamed_addr constant [28 x i8] c"key = strip_spaces(s->buff)\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !18)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--testutil--libtestutil-lib-stanza.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "_ISupper", value: 256)
!7 = !DIEnumerator(name: "_ISlower", value: 512)
!8 = !DIEnumerator(name: "_ISalpha", value: 1024)
!9 = !DIEnumerator(name: "_ISdigit", value: 2048)
!10 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!11 = !DIEnumerator(name: "_ISspace", value: 8192)
!12 = !DIEnumerator(name: "_ISprint", value: 16384)
!13 = !DIEnumerator(name: "_ISgraph", value: 32768)
!14 = !DIEnumerator(name: "_ISblank", value: 1)
!15 = !DIEnumerator(name: "_IScntrl", value: 2)
!16 = !DIEnumerator(name: "_ISpunct", value: 4)
!17 = !DIEnumerator(name: "_ISalnum", value: 8)
!18 = !{!19, !20, !21, !22}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!22 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!23 = !{i32 2, !"Dwarf Version", i32 4}
!24 = !{i32 2, !"Debug Info Version", i32 3}
!25 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!26 = distinct !DISubprogram(name: "test_start_file", scope: !27, file: !27, line: 19, type: !28, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !65)
!27 = !DIFile(filename: "test/testutil/stanza.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!28 = !DISubroutineType(types: !29)
!29 = !{!20, !30, !36}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "STANZA", file: !32, line: 498, baseType: !33)
!32 = !DIFile(filename: "test/testutil/../testutil.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stanza_st", file: !32, line: 486, size: 35712, align: 64, elements: !34)
!34 = !{!35, !39, !44, !45, !46, !47, !48, !49, !50, !60, !61}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "test_file", scope: !33, file: !32, line: 487, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !33, file: !32, line: 488, baseType: !40, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !42, line: 79, baseType: !43)
!42 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !42, line: 79, flags: DIFlagFwdDecl)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !33, file: !32, line: 489, baseType: !20, size: 32, align: 32, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !33, file: !32, line: 490, baseType: !20, size: 32, align: 32, offset: 160)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !33, file: !32, line: 491, baseType: !20, size: 32, align: 32, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "numtests", scope: !33, file: !32, line: 492, baseType: !20, size: 32, align: 32, offset: 224)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "numskip", scope: !33, file: !32, line: 493, baseType: !20, size: 32, align: 32, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "numpairs", scope: !33, file: !32, line: 494, baseType: !20, size: 32, align: 32, offset: 288)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "pairs", scope: !33, file: !32, line: 495, baseType: !51, size: 2560, align: 64, offset: 320)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 2560, align: 64, elements: !58)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "PAIR", file: !32, line: 484, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair_st", file: !32, line: 481, size: 128, align: 64, elements: !54)
!54 = !{!55, !57}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !53, file: !32, line: 482, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !53, file: !32, line: 483, baseType: !56, size: 64, align: 64, offset: 64)
!58 = !{!59}
!59 = !DISubrange(count: 20)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !33, file: !32, line: 496, baseType: !40, size: 64, align: 64, offset: 2880)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !33, file: !32, line: 497, baseType: !62, size: 32768, align: 8, offset: 2944)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 32768, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 4096)
!65 = !{}
!66 = !DILocalVariable(name: "s", arg: 1, scope: !26, file: !27, line: 19, type: !30)
!67 = !DIExpression()
!68 = !DILocation(line: 19, column: 29, scope: !26)
!69 = !DILocalVariable(name: "testfile", arg: 2, scope: !26, file: !27, line: 19, type: !36)
!70 = !DILocation(line: 19, column: 44, scope: !26)
!71 = !DILocation(line: 21, column: 59, scope: !26)
!72 = !DILocation(line: 21, column: 5, scope: !26)
!73 = !DILocation(line: 22, column: 20, scope: !26)
!74 = !DILocation(line: 22, column: 5, scope: !26)
!75 = !DILocation(line: 23, column: 12, scope: !26)
!76 = !DILocation(line: 23, column: 5, scope: !26)
!77 = !DILocation(line: 24, column: 111, scope: !78)
!78 = distinct !DILexicalBlock(scope: !26, file: !27, line: 24, column: 9)
!79 = !DILocation(line: 24, column: 98, scope: !78)
!80 = !DILocation(line: 24, column: 90, scope: !78)
!81 = !DILocation(line: 24, column: 93, scope: !78)
!82 = !DILocation(line: 24, column: 96, scope: !78)
!83 = !DILocation(line: 24, column: 10, scope: !84)
!84 = !DILexicalBlockFile(scope: !78, file: !27, discriminator: 1)
!85 = !DILocation(line: 24, column: 10, scope: !78)
!86 = !DILocation(line: 24, column: 9, scope: !26)
!87 = !DILocation(line: 25, column: 9, scope: !78)
!88 = !DILocation(line: 26, column: 20, scope: !26)
!89 = !DILocation(line: 26, column: 5, scope: !26)
!90 = !DILocation(line: 26, column: 8, scope: !26)
!91 = !DILocation(line: 26, column: 18, scope: !26)
!92 = !DILocation(line: 27, column: 5, scope: !26)
!93 = !DILocation(line: 28, column: 1, scope: !26)
!94 = distinct !DISubprogram(name: "test_end_file", scope: !27, file: !27, line: 30, type: !95, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !65)
!95 = !DISubroutineType(types: !96)
!96 = !{!20, !30}
!97 = !DILocalVariable(name: "s", arg: 1, scope: !94, file: !27, line: 30, type: !30)
!98 = !DILocation(line: 30, column: 27, scope: !94)
!99 = !DILocation(line: 32, column: 59, scope: !94)
!100 = !DILocation(line: 32, column: 62, scope: !94)
!101 = !DILocation(line: 32, column: 72, scope: !94)
!102 = !DILocation(line: 32, column: 75, scope: !94)
!103 = !DILocation(line: 32, column: 83, scope: !94)
!104 = !DILocation(line: 32, column: 86, scope: !94)
!105 = !DILocation(line: 32, column: 5, scope: !94)
!106 = !DILocation(line: 34, column: 14, scope: !94)
!107 = !DILocation(line: 34, column: 17, scope: !94)
!108 = !DILocation(line: 34, column: 5, scope: !94)
!109 = !DILocation(line: 35, column: 5, scope: !94)
!110 = distinct !DISubprogram(name: "test_readstanza", scope: !27, file: !27, line: 86, type: !95, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !65)
!111 = !DILocalVariable(name: "s", arg: 1, scope: !110, file: !27, line: 86, type: !30)
!112 = !DILocation(line: 86, column: 29, scope: !110)
!113 = !DILocalVariable(name: "pp", scope: !110, file: !27, line: 88, type: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!115 = !DILocation(line: 88, column: 11, scope: !110)
!116 = !DILocation(line: 88, column: 16, scope: !110)
!117 = !DILocation(line: 88, column: 19, scope: !110)
!118 = !DILocalVariable(name: "p", scope: !110, file: !27, line: 89, type: !56)
!119 = !DILocation(line: 89, column: 11, scope: !110)
!120 = !DILocalVariable(name: "equals", scope: !110, file: !27, line: 89, type: !56)
!121 = !DILocation(line: 89, column: 15, scope: !110)
!122 = !DILocalVariable(name: "key", scope: !110, file: !27, line: 89, type: !56)
!123 = !DILocation(line: 89, column: 24, scope: !110)
!124 = !DILocalVariable(name: "value", scope: !110, file: !27, line: 90, type: !36)
