; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--ct--libcrypto-shlib-ct_prn.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--ct--libcrypto-shlib-ct_prn.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sct_st = type { i32, i8*, i64, i8*, i64, i64, i8*, i64, i8, i8, i8*, i64, i32, i32, i32 }
%struct.bio_st = type opaque
%struct.ctlog_store_st = type opaque
%struct.ctlog_st = type opaque
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.stack_st_SCT = type opaque
%struct.stack_st = type opaque

@.str = private unnamed_addr constant [8 x i8] c"not set\00", align 1
@.str.1 = private unnamed_addr constant [16 x i8] c"unknown version\00", align 1
@.str.2 = private unnamed_addr constant [12 x i8] c"unknown log\00", align 1
@.str.3 = private unnamed_addr constant [11 x i8] c"unverified\00", align 1
@.str.4 = private unnamed_addr constant [8 x i8] c"invalid\00", align 1
@.str.5 = private unnamed_addr constant [6 x i8] c"valid\00", align 1
@.str.6 = private unnamed_addr constant [15 x i8] c"unknown status\00", align 1
@.str.7 = private unnamed_addr constant [33 x i8] c"%*sSigned Certificate Timestamp:\00", align 1
@.str.8 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.9 = private unnamed_addr constant [17 x i8] c"\0A%*sVersion   : \00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !27)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--ct--libcrypto-shlib-ct_prn.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{!3, !8, !13, !19}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 37, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "include/openssl/ct.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "SCT_VERSION_NOT_SET", value: -1)
!7 = !DIEnumerator(name: "SCT_VERSION_V1", value: 0)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 31, size: 32, align: 32, elements: !9)
!9 = !{!10, !11, !12}
!10 = !DIEnumerator(name: "CT_LOG_ENTRY_TYPE_NOT_SET", value: -1)
!11 = !DIEnumerator(name: "CT_LOG_ENTRY_TYPE_X509", value: 0)
!12 = !DIEnumerator(name: "CT_LOG_ENTRY_TYPE_PRECERT", value: 1)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 42, size: 32, align: 32, elements: !14)
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "SCT_SOURCE_UNKNOWN", value: 0)
!16 = !DIEnumerator(name: "SCT_SOURCE_TLS_EXTENSION", value: 1)
!17 = !DIEnumerator(name: "SCT_SOURCE_X509V3_EXTENSION", value: 2)
!18 = !DIEnumerator(name: "SCT_SOURCE_OCSP_STAPLED_RESPONSE", value: 3)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 49, size: 32, align: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26}
!21 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_NOT_SET", value: 0)
!22 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_UNKNOWN_LOG", value: 1)
!23 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_VALID", value: 2)
!24 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_INVALID", value: 3)
!25 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_UNVERIFIED", value: 4)
!26 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_UNKNOWN_VERSION", value: 5)
!27 = !{!28, !29, !34, !35, !36, !41}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !30, line: 75, baseType: !31)
!30 = !DIFile(filename: "/usr/include/time.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !32, line: 139, baseType: !33)
!32 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!33 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!34 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!35 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !39, line: 17, baseType: !40)
!39 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !39, line: 17, flags: DIFlagFwdDecl)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCT", file: !43, line: 173, baseType: !44)
!43 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sct_st", file: !45, line: 57, size: 832, align: 64, elements: !46)
!45 = !DIFile(filename: "crypto/ct/ct_locl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!46 = !{!47, !49, !52, !56, !57, !58, !61, !62, !63, !64, !65, !66, !67, !69, !71}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !44, file: !45, line: 58, baseType: !48, size: 32, align: 32)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "sct_version_t", file: !4, line: 40, baseType: !3)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "sct", scope: !44, file: !45, line: 60, baseType: !50, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "sct_len", scope: !44, file: !45, line: 61, baseType: !53, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !54, line: 216, baseType: !55)
!54 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!55 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "log_id", scope: !44, file: !45, line: 63, baseType: !50, size: 64, align: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "log_id_len", scope: !44, file: !45, line: 64, baseType: !53, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !44, file: !45, line: 70, baseType: !59, size: 64, align: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !60, line: 55, baseType: !55)
!60 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !44, file: !45, line: 71, baseType: !50, size: 64, align: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ext_len", scope: !44, file: !45, line: 72, baseType: !53, size: 64, align: 64, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "hash_alg", scope: !44, file: !45, line: 73, baseType: !51, size: 8, align: 8, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "sig_alg", scope: !44, file: !45, line: 74, baseType: !51, size: 8, align: 8, offset: 520)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !44, file: !45, line: 75, baseType: !50, size: 64, align: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "sig_len", scope: !44, file: !45, line: 76, baseType: !53, size: 64, align: 64, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "entry_type", scope: !44, file: !45, line: 78, baseType: !68, size: 32, align: 32, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "ct_log_entry_type_t", file: !4, line: 35, baseType: !8)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !44, file: !45, line: 80, baseType: !70, size: 32, align: 32, offset: 736)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "sct_source_t", file: !4, line: 47, baseType: !13)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "validation_status", scope: !44, file: !45, line: 82, baseType: !72, size: 32, align: 32, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "sct_validation_status_t", file: !4, line: 56, baseType: !19)
!73 = !{i32 2, !"Dwarf Version", i32 4}
!74 = !{i32 2, !"Debug Info Version", i32 3}
!75 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!76 = distinct !DISubprogram(name: "SCT_validation_status_string", scope: !77, file: !77, line: 50, type: !78, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !85)
!77 = !DIFile(filename: "crypto/ct/ct_prn.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !83}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!82 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!85 = !{}
!86 = !DILocalVariable(name: "sct", arg: 1, scope: !76, file: !77, line: 50, type: !83)
!87 = !DIExpression()
!88 = !DILocation(line: 50, column: 53, scope: !76)
!89 = !DILocation(line: 53, column: 39, scope: !76)
!90 = !DILocation(line: 53, column: 13, scope: !76)
!91 = !DILocation(line: 53, column: 5, scope: !76)
!92 = !DILocation(line: 55, column: 9, scope: !93)
!93 = distinct !DILexicalBlock(scope: !76, file: !77, line: 53, column: 45)
!94 = !DILocation(line: 57, column: 9, scope: !93)
!95 = !DILocation(line: 59, column: 9, scope: !93)
!96 = !DILocation(line: 61, column: 9, scope: !93)
!97 = !DILocation(line: 63, column: 9, scope: !93)
!98 = !DILocation(line: 65, column: 9, scope: !93)
!99 = !DILocation(line: 67, column: 5, scope: !76)
!100 = !DILocation(line: 68, column: 1, scope: !76)
!101 = distinct !DISubprogram(name: "SCT_print", scope: !77, file: !77, line: 70, type: !102, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !85)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !83, !104, !34, !107}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !43, line: 79, baseType: !106)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !43, line: 79, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "CTLOG_STORE", file: !43, line: 176, baseType: !110)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "ctlog_store_st", file: !43, line: 176, flags: DIFlagFwdDecl)
!111 = !DILocalVariable(name: "sct", arg: 1, scope: !101, file: !77, line: 70, type: !83)
!112 = !DILocation(line: 70, column: 27, scope: !101)
!113 = !DILocalVariable(name: "out", arg: 2, scope: !101, file: !77, line: 70, type: !104)
!114 = !DILocation(line: 70, column: 37, scope: !101)
!115 = !DILocalVariable(name: "indent", arg: 3, scope: !101, file: !77, line: 70, type: !34)
!116 = !DILocation(line: 70, column: 46, scope: !101)
!117 = !DILocalVariable(name: "log_store", arg: 4, scope: !101, file: !77, line: 71, type: !107)
!118 = !DILocation(line: 71, column: 35, scope: !101)
!119 = !DILocalVariable(name: "log", scope: !101, file: !77, line: 73, type: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "CTLOG", file: !43, line: 175, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "ctlog_st", file: !43, line: 175, flags: DIFlagFwdDecl)
!124 = !DILocation(line: 73, column: 18, scope: !101)
!125 = !DILocation(line: 75, column: 9, scope: !126)
!126 = distinct !DILexicalBlock(scope: !101, file: !77, line: 75, column: 9)
!127 = !DILocation(line: 75, column: 19, scope: !126)
!128 = !DILocation(line: 75, column: 9, scope: !101)
!129 = !DILocation(line: 76, column: 42, scope: !130)
!130 = distinct !DILexicalBlock(scope: !126, file: !77, line: 75, column: 27)
!131 = !DILocation(line: 76, column: 53, scope: !130)
!132 = !DILocation(line: 76, column: 58, scope: !130)
!133 = !DILocation(line: 77, column: 42, scope: !130)
!134 = !DILocation(line: 77, column: 47, scope: !130)
!135 = !DILocation(line: 76, column: 15, scope: !130)
!136 = !DILocation(line: 76, column: 13, scope: !130)
!137 = !DILocation(line: 78, column: 5, scope: !130)
!138 = !DILocation(line: 80, column: 16, scope: !101)
!139 = !DILocation(line: 80, column: 57, scope: !101)
!140 = !DILocation(line: 80, column: 5, scope: !101)
!141 = !DILocation(line: 81, column: 16, scope: !101)
!142 = !DILocation(line: 81, column: 42, scope: !101)
!143 = !DILocation(line: 81, column: 49, scope: !101)
!144 = !DILocation(line: 81, column: 5, scope: !101)
!145 = !DILocation(line: 83, column: 9, scope: !146)
!146 = distinct !DILexicalBlock(scope: !101, file: !77, line: 83, column: 9)
!147 = !DILocation(line: 83, column: 14, scope: !146)
!148 = !DILocation(line: 83, column: 22, scope: !146)
!149 = !DILocation(line: 83, column: 9, scope: !101)
!150 = !DILocation(line: 84, column: 20, scope: !151)
!151 = distinct !DILexicalBlock(scope: !146, file: !77, line: 83, column: 41)
!152 = !DILocation(line: 84, column: 41, scope: !151)
!153 = !DILocation(line: 84, column: 48, scope: !151)
!154 = !DILocation(line: 84, column: 9, scope: !151)
!155 = !DILocation(line: 85, column: 24, scope: !151)
!156 = !DILocation(line: 85, column: 29, scope: !151)
!157 = !DILocation(line: 85, column: 36, scope: !151)
!158 = !DILocation(line: 85, column: 46, scope: !151)
!159 = !DILocation(line: 85, column: 51, scope: !151)
!160 = !DILocation(line: 85, column: 56, scope: !151)
!161 = !DILocation(line: 85, column: 61, scope: !151)
!162 = !DILocation(line: 85, column: 9, scope: !151)
!163 = !DILocation(line: 86, column: 9, scope: !151)
!164 = !DILocation(line: 89, column: 16, scope: !101)
!165 = !DILocation(line: 89, column: 5, scope: !101)
!166 = !DILocation(line: 91, column: 9, scope: !167)
!167 = distinct !DILexicalBlock(scope: !101, file: !77, line: 91, column: 9)
!168 = !DILocation(line: 91, column: 13, scope: !167)
!169 = !DILocation(line: 91, column: 9, scope: !101)
!170 = !DILocation(line: 92, column: 20, scope: !171)
!171 = distinct !DILexicalBlock(scope: !167, file: !77, line: 91, column: 21)
!172 = !DILocation(line: 92, column: 48, scope: !171)
!173 = !DILocation(line: 92, column: 55, scope: !171)
!174 = !DILocation(line: 93, column: 36, scope: !171)
!175 = !DILocation(line: 93, column: 20, scope: !171)
!176 = !DILocation(line: 92, column: 9, scope: !171)
!177 = !DILocation(line: 94, column: 5, scope: !171)
!178 = !DILocation(line: 96, column: 16, scope: !101)
!179 = !DILocation(line: 96, column: 42, scope: !101)
!180 = !DILocation(line: 96, column: 49, scope: !101)
!181 = !DILocation(line: 96, column: 5, scope: !101)
!182 = !DILocation(line: 97, column: 20, scope: !101)
!183 = !DILocation(line: 97, column: 25, scope: !101)
!184 = !DILocation(line: 97, column: 32, scope: !101)
!185 = !DILocation(line: 97, column: 42, scope: !101)
!186 = !DILocation(line: 97, column: 47, scope: !101)
!187 = !DILocation(line: 97, column: 55, scope: !101)
!188 = !DILocation(line: 97, column: 60, scope: !101)
!189 = !DILocation(line: 97, column: 5, scope: !101)
!190 = !DILocation(line: 99, column: 16, scope: !101)
!191 = !DILocation(line: 99, column: 42, scope: !101)
!192 = !DILocation(line: 99, column: 49, scope: !101)
!193 = !DILocation(line: 99, column: 5, scope: !101)
!194 = !DILocation(line: 100, column: 21, scope: !101)
!195 = !DILocation(line: 100, column: 26, scope: !101)
!196 = !DILocation(line: 100, column: 37, scope: !101)
!197 = !DILocation(line: 100, column: 5, scope: !101)
!198 = !DILocation(line: 102, column: 16, scope: !101)
!199 = !DILocation(line: 102, column: 42, scope: !101)
!200 = !DILocation(line: 102, column: 49, scope: !101)
!201 = !DILocation(line: 102, column: 5, scope: !101)
!202 = !DILocation(line: 103, column: 9, scope: !203)
!203 = distinct !DILexicalBlock(scope: !101, file: !77, line: 103, column: 9)
!204 = !DILocation(line: 103, column: 14, scope: !203)
!205 = !DILocation(line: 103, column: 22, scope: !203)
!206 = !DILocation(line: 103, column: 9, scope: !101)
!207 = !DILocation(line: 104, column: 20, scope: !203)
!208 = !DILocation(line: 104, column: 9, scope: !203)
!209 = !DILocation(line: 106, column: 24, scope: !203)
!210 = !DILocation(line: 106, column: 29, scope: !203)
!211 = !DILocation(line: 106, column: 36, scope: !203)
!212 = !DILocation(line: 106, column: 46, scope: !203)
!213 = !DILocation(line: 106, column: 51, scope: !203)
!214 = !DILocation(line: 106, column: 56, scope: !203)
!215 = !DILocation(line: 106, column: 61, scope: !203)
!216 = !DILocation(line: 106, column: 9, scope: !203)
!217 = !DILocation(line: 108, column: 16, scope: !101)
!218 = !DILocation(line: 108, column: 42, scope: !101)
!219 = !DILocation(line: 108, column: 49, scope: !101)
!220 = !DILocation(line: 108, column: 5, scope: !101)
!221 = !DILocation(line: 109, column: 36, scope: !101)
!222 = !DILocation(line: 109, column: 41, scope: !101)
!223 = !DILocation(line: 109, column: 5, scope: !101)
!224 = !DILocation(line: 110, column: 16, scope: !101)
!225 = !DILocation(line: 110, column: 42, scope: !101)
!226 = !DILocation(line: 110, column: 49, scope: !101)
!227 = !DILocation(line: 110, column: 5, scope: !101)
!228 = !DILocation(line: 111, column: 20, scope: !101)
!229 = !DILocation(line: 111, column: 25, scope: !101)
!230 = !DILocation(line: 111, column: 32, scope: !101)
!231 = !DILocation(line: 111, column: 42, scope: !101)
!232 = !DILocation(line: 111, column: 47, scope: !101)
!233 = !DILocation(line: 111, column: 52, scope: !101)
!234 = !DILocation(line: 111, column: 57, scope: !101)
!235 = !DILocation(line: 111, column: 5, scope: !101)
!236 = !DILocation(line: 112, column: 1, scope: !101)
!237 = !DILocation(line: 112, column: 1, scope: !238)
!238 = !DILexicalBlockFile(scope: !101, file: !77, discriminator: 1)
!239 = distinct !DISubprogram(name: "timestamp_print", scope: !77, file: !77, line: 29, type: !240, isLocal: true, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !85)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !59, !104}
!242 = !DILocalVariable(name: "timestamp", arg: 1, scope: !239, file: !77, line: 29, type: !59)
!243 = !DILocation(line: 29, column: 38, scope: !239)
!244 = !DILocalVariable(name: "out", arg: 2, scope: !239, file: !77, line: 29, type: !104)
!245 = !DILocation(line: 29, column: 54, scope: !239)
!246 = !DILocalVariable(name: "gen", scope: !239, file: !77, line: 31, type: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !43, line: 52, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !250, line: 146, size: 192, align: 64, elements: !251)
!250 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!251 = !{!252, !253, !254, !255}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !249, file: !250, line: 147, baseType: !34, size: 32, align: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !249, file: !250, line: 148, baseType: !34, size: 32, align: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !249, file: !250, line: 149, baseType: !50, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !249, file: !250, line: 155, baseType: !33, size: 64, align: 64, offset: 128)
!256 = !DILocation(line: 31, column: 27, scope: !239)
!257 = !DILocation(line: 31, column: 33, scope: !239)
!258 = !DILocalVariable(name: "genstr", scope: !239, file: !77, line: 32, type: !259)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 160, align: 8, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 20)
!262 = !DILocation(line: 32, column: 10, scope: !239)
!263 = !DILocation(line: 34, column: 9, scope: !264)
!264 = distinct !DILexicalBlock(scope: !239, file: !77, line: 34, column: 9)
!265 = !DILocation(line: 34, column: 13, scope: !264)
!266 = !DILocation(line: 34, column: 9, scope: !239)
!267 = !DILocation(line: 35, column: 9, scope: !264)
!268 = !DILocation(line: 36, column: 30, scope: !239)
!269 = !DILocation(line: 37, column: 36, scope: !239)
!270 = !DILocation(line: 37, column: 46, scope: !239)
!271 = !DILocation(line: 37, column: 30, scope: !239)
!272 = !DILocation(line: 38, column: 31, scope: !239)
!273 = !DILocation(line: 38, column: 41, scope: !239)
!274 = !DILocation(line: 38, column: 53, scope: !239)
!275 = !DILocation(line: 36, column: 5, scope: !239)
!276 = !DILocation(line: 43, column: 18, scope: !239)
!277 = !DILocation(line: 44, column: 40, scope: !239)
!278 = !DILocation(line: 44, column: 18, scope: !239)
!279 = !DILocation(line: 44, column: 61, scope: !239)
!280 = !DILocation(line: 44, column: 71, scope: !239)
!281 = !DILocation(line: 44, column: 46, scope: !239)
!282 = !DILocation(line: 43, column: 5, scope: !239)
!283 = !DILocation(line: 45, column: 41, scope: !284)
!284 = distinct !DILexicalBlock(scope: !239, file: !77, line: 45, column: 9)
!285 = !DILocation(line: 45, column: 46, scope: !284)
!286 = !DILocation(line: 45, column: 9, scope: !284)
!287 = !DILocation(line: 45, column: 9, scope: !239)
!288 = !DILocation(line: 46, column: 36, scope: !284)
!289 = !DILocation(line: 46, column: 41, scope: !284)
!290 = !DILocation(line: 46, column: 9, scope: !284)
!291 = !DILocation(line: 47, column: 31, scope: !239)
!292 = !DILocation(line: 47, column: 5, scope: !239)
!293 = !DILocation(line: 48, column: 1, scope: !239)
!294 = !DILocation(line: 48, column: 1, scope: !295)
!295 = !DILexicalBlockFile(scope: !239, file: !77, discriminator: 1)
!296 = distinct !DISubprogram(name: "SCT_signature_algorithms_print", scope: !77, file: !77, line: 19, type: !297, isLocal: true, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !85)
!297 = !DISubroutineType(types: !298)
!298 = !{null, !83, !104}
!299 = !DILocalVariable(name: "sct", arg: 1, scope: !296, file: !77, line: 19, type: !83)
!300 = !DILocation(line: 19, column: 55, scope: !296)
!301 = !DILocalVariable(name: "out", arg: 2, scope: !296, file: !77, line: 19, type: !104)
!302 = !DILocation(line: 19, column: 65, scope: !296)
!303 = !DILocalVariable(name: "nid", scope: !296, file: !77, line: 21, type: !34)
!304 = !DILocation(line: 21, column: 9, scope: !296)
!305 = !DILocation(line: 21, column: 37, scope: !296)
!306 = !DILocation(line: 21, column: 15, scope: !296)
!307 = !DILocation(line: 23, column: 9, scope: !308)
!308 = distinct !DILexicalBlock(scope: !296, file: !77, line: 23, column: 9)
!309 = !DILocation(line: 23, column: 13, scope: !308)
!310 = !DILocation(line: 23, column: 9, scope: !296)
!311 = !DILocation(line: 24, column: 20, scope: !308)
!312 = !DILocation(line: 24, column: 37, scope: !308)
!313 = !DILocation(line: 24, column: 42, scope: !308)
!314 = !DILocation(line: 24, column: 52, scope: !308)
!315 = !DILocation(line: 24, column: 57, scope: !308)
!316 = !DILocation(line: 24, column: 9, scope: !308)
!317 = !DILocation(line: 26, column: 20, scope: !308)
!318 = !DILocation(line: 26, column: 42, scope: !308)
!319 = !DILocation(line: 26, column: 31, scope: !308)
!320 = !DILocation(line: 26, column: 9, scope: !321)
