; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--conf--libcrypto-shlib-conf_ssl.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--conf--libcrypto-shlib-conf_ssl.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ssl_conf_name_st = type { i8*, %struct.ssl_conf_cmd_st*, i64 }
%struct.ssl_conf_cmd_st = type { i8*, i8* }
%struct.conf_imodule_st = type opaque
%struct.conf_st = type { %struct.conf_method_st*, i8*, %struct.lhash_st_CONF_VALUE* }
%struct.conf_method_st = type { i8*, %struct.conf_st* (%struct.conf_method_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*, %struct.bio_st*, i64*)*, i32 (%struct.conf_st*, %struct.bio_st*)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8*, i64*)* }
%struct.bio_st = type opaque
%struct.lhash_st_CONF_VALUE = type { %union.lh_CONF_VALUE_dummy }
%union.lh_CONF_VALUE_dummy = type { i8* }
%struct.stack_st_CONF_VALUE = type opaque
%struct.CONF_VALUE = type { i8*, i8*, i8* }
%struct.stack_st = type opaque

@ssl_names = internal global %struct.ssl_conf_name_st* null, align 8
@ssl_names_count = internal global i64 0, align 8
@.str = private unnamed_addr constant [9 x i8] c"ssl_conf\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"crypto/conf/conf_ssl.c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !21)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--conf--libcrypto-shlib-conf_ssl.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !6, !11}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !9, line: 17, baseType: !10)
!9 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !9, line: 17, flags: DIFlagFwdDecl)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_VALUE", file: !13, line: 28, baseType: !14)
!13 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 24, size: 192, align: 64, elements: !15)
!15 = !{!16, !19, !20}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !14, file: !13, line: 25, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !13, line: 26, baseType: !17, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !14, file: !13, line: 27, baseType: !17, size: 64, align: 64, offset: 128)
!21 = !{!22, !40}
!22 = distinct !DIGlobalVariable(name: "ssl_names", scope: !0, file: !23, line: 38, type: !24, isLocal: true, isDefinition: true, variable: %struct.ssl_conf_name_st** @ssl_names)
!23 = !DIFile(filename: "crypto/conf/conf_ssl.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_conf_name_st", file: !23, line: 22, size: 192, align: 64, elements: !26)
!26 = !{!27, !28, !36}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !25, file: !23, line: 24, baseType: !17, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "cmds", scope: !25, file: !23, line: 26, baseType: !29, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CONF_CMD", file: !31, line: 13, baseType: !32)
!31 = !DIFile(filename: "include/internal/sslconf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_conf_cmd_st", file: !23, line: 31, size: 128, align: 64, elements: !33)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !32, file: !23, line: 33, baseType: !17, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !32, file: !23, line: 35, baseType: !17, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_count", scope: !25, file: !23, line: 28, baseType: !37, size: 64, align: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !38, line: 216, baseType: !39)
!38 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!39 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!40 = distinct !DIGlobalVariable(name: "ssl_names_count", scope: !0, file: !23, line: 39, type: !37, isLocal: true, isDefinition: true, variable: i64* @ssl_names_count)
!41 = !{i32 2, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!44 = distinct !DISubprogram(name: "conf_ssl_get", scope: !23, file: !23, line: 137, type: !45, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !37, !49, !52}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!53 = !DILocalVariable(name: "idx", arg: 1, scope: !44, file: !23, line: 137, type: !37)
!54 = !DIExpression()
!55 = !DILocation(line: 137, column: 41, scope: !44)
!56 = !DILocalVariable(name: "name", arg: 2, scope: !44, file: !23, line: 137, type: !49)
!57 = !DILocation(line: 137, column: 59, scope: !44)
!58 = !DILocalVariable(name: "cnt", arg: 3, scope: !44, file: !23, line: 137, type: !52)
!59 = !DILocation(line: 137, column: 73, scope: !44)
!60 = !DILocation(line: 139, column: 23, scope: !44)
!61 = !DILocation(line: 139, column: 13, scope: !44)
!62 = !DILocation(line: 139, column: 28, scope: !44)
!63 = !DILocation(line: 139, column: 6, scope: !44)
!64 = !DILocation(line: 139, column: 11, scope: !44)
!65 = !DILocation(line: 140, column: 22, scope: !44)
!66 = !DILocation(line: 140, column: 12, scope: !44)
!67 = !DILocation(line: 140, column: 27, scope: !44)
!68 = !DILocation(line: 140, column: 6, scope: !44)
!69 = !DILocation(line: 140, column: 10, scope: !44)
!70 = !DILocation(line: 141, column: 22, scope: !44)
!71 = !DILocation(line: 141, column: 12, scope: !44)
!72 = !DILocation(line: 141, column: 27, scope: !44)
!73 = !DILocation(line: 141, column: 5, scope: !44)
!74 = distinct !DISubprogram(name: "conf_ssl_name_find", scope: !23, file: !23, line: 149, type: !75, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!75 = !DISubroutineType(types: !76)
!76 = !{!5, !50, !52}
!77 = !DILocalVariable(name: "name", arg: 1, scope: !74, file: !23, line: 149, type: !50)
!78 = !DILocation(line: 149, column: 36, scope: !74)
!79 = !DILocalVariable(name: "idx", arg: 2, scope: !74, file: !23, line: 149, type: !52)
!80 = !DILocation(line: 149, column: 50, scope: !74)
!81 = !DILocalVariable(name: "i", scope: !74, file: !23, line: 151, type: !37)
!82 = !DILocation(line: 151, column: 12, scope: !74)
!83 = !DILocalVariable(name: "nm", scope: !74, file: !23, line: 152, type: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!86 = !DILocation(line: 152, column: 36, scope: !74)
!87 = !DILocation(line: 154, column: 9, scope: !88)
!88 = distinct !DILexicalBlock(scope: !74, file: !23, line: 154, column: 9)
!89 = !DILocation(line: 154, column: 14, scope: !88)
!90 = !DILocation(line: 154, column: 9, scope: !74)
!91 = !DILocation(line: 155, column: 9, scope: !88)
!92 = !DILocation(line: 156, column: 12, scope: !93)
!93 = distinct !DILexicalBlock(scope: !74, file: !23, line: 156, column: 5)
!94 = !DILocation(line: 156, column: 22, scope: !93)
!95 = !DILocation(line: 156, column: 20, scope: !93)
!96 = !DILocation(line: 156, column: 10, scope: !93)
!97 = !DILocation(line: 156, column: 33, scope: !98)
!98 = !DILexicalBlockFile(scope: !99, file: !23, discriminator: 1)
!99 = distinct !DILexicalBlock(scope: !93, file: !23, line: 156, column: 5)
!100 = !DILocation(line: 156, column: 37, scope: !98)
!101 = !DILocation(line: 156, column: 35, scope: !98)
!102 = !DILocation(line: 156, column: 5, scope: !98)
!103 = !DILocation(line: 157, column: 20, scope: !104)
!104 = distinct !DILexicalBlock(scope: !105, file: !23, line: 157, column: 13)
!105 = distinct !DILexicalBlock(scope: !99, file: !23, line: 156, column: 65)
!106 = !DILocation(line: 157, column: 24, scope: !104)
!107 = !DILocation(line: 157, column: 30, scope: !104)
!108 = !DILocation(line: 157, column: 13, scope: !104)
!109 = !DILocation(line: 157, column: 36, scope: !104)
!110 = !DILocation(line: 157, column: 13, scope: !105)
!111 = !DILocation(line: 158, column: 20, scope: !112)
!112 = distinct !DILexicalBlock(scope: !104, file: !23, line: 157, column: 42)
!113 = !DILocation(line: 158, column: 14, scope: !112)
!114 = !DILocation(line: 158, column: 18, scope: !112)
!115 = !DILocation(line: 159, column: 13, scope: !112)
!116 = !DILocation(line: 161, column: 5, scope: !105)
!117 = !DILocation(line: 156, column: 55, scope: !118)
!118 = !DILexicalBlockFile(scope: !99, file: !23, discriminator: 2)
!119 = !DILocation(line: 156, column: 61, scope: !118)
!120 = !DILocation(line: 156, column: 5, scope: !118)
!121 = distinct !{!121, !122}
!122 = !DILocation(line: 156, column: 5, scope: !74)
!123 = !DILocation(line: 162, column: 5, scope: !74)
!124 = !DILocation(line: 163, column: 1, scope: !74)
!125 = distinct !DISubprogram(name: "conf_ssl_get_cmd", scope: !23, file: !23, line: 171, type: !126, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !47, !37, !128, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!129 = !DILocalVariable(name: "cmd", arg: 1, scope: !125, file: !23, line: 171, type: !47)
!130 = !DILocation(line: 171, column: 43, scope: !125)
!131 = !DILocalVariable(name: "idx", arg: 2, scope: !125, file: !23, line: 171, type: !37)
!132 = !DILocation(line: 171, column: 55, scope: !125)
!133 = !DILocalVariable(name: "cmdstr", arg: 3, scope: !125, file: !23, line: 171, type: !128)
!134 = !DILocation(line: 171, column: 67, scope: !125)
!135 = !DILocalVariable(name: "arg", arg: 4, scope: !125, file: !23, line: 172, type: !128)
!136 = !DILocation(line: 172, column: 30, scope: !125)
!137 = !DILocation(line: 174, column: 19, scope: !125)
!138 = !DILocation(line: 174, column: 15, scope: !125)
!139 = !DILocation(line: 174, column: 24, scope: !125)
!140 = !DILocation(line: 174, column: 6, scope: !125)
!141 = !DILocation(line: 174, column: 13, scope: !125)
!142 = !DILocation(line: 175, column: 16, scope: !125)
!143 = !DILocation(line: 175, column: 12, scope: !125)
!144 = !DILocation(line: 175, column: 21, scope: !125)
!145 = !DILocation(line: 175, column: 6, scope: !125)
!146 = !DILocation(line: 175, column: 10, scope: !125)
!147 = !DILocation(line: 176, column: 1, scope: !125)
!148 = distinct !DISubprogram(name: "conf_add_ssl_module", scope: !23, file: !23, line: 178, type: !149, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!149 = !DISubroutineType(types: !150)
!150 = !{null}
!151 = !DILocation(line: 180, column: 5, scope: !148)
!152 = !DILocation(line: 181, column: 1, scope: !148)
!153 = distinct !DISubprogram(name: "ssl_module_init", scope: !23, file: !23, line: 61, type: !154, isLocal: true, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!154 = !DISubroutineType(types: !155)
!155 = !{!5, !156, !159}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_IMODULE", file: !13, line: 52, baseType: !158)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "conf_imodule_st", file: !13, line: 52, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF", file: !162, line: 144, baseType: !163)
!162 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_st", file: !13, line: 103, size: 192, align: 64, elements: !164)
!164 = !{!165, !204, !205}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !163, file: !13, line: 104, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_METHOD", file: !13, line: 35, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_method_st", file: !13, line: 37, size: 640, align: 64, elements: !169)
!169 = !{!170, !171, !176, !180, !181, !182, !191, !195, !199, !200}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !168, file: !13, line: 38, baseType: !50, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !168, file: !13, line: 39, baseType: !172, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!175, !166}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !168, file: !13, line: 40, baseType: !177, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!5, !175}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !168, file: !13, line: 41, baseType: !177, size: 64, align: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_data", scope: !168, file: !13, line: 42, baseType: !177, size: 64, align: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "load_bio", scope: !168, file: !13, line: 43, baseType: !183, size: 64, align: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!5, !175, !186, !189}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !162, line: 79, baseType: !188)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !162, line: 79, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !168, file: !13, line: 44, baseType: !192, size: 64, align: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!5, !159, !186}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "is_number", scope: !168, file: !13, line: 45, baseType: !196, size: 64, align: 64, offset: 448)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!5, !159, !18}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "to_int", scope: !168, file: !13, line: 46, baseType: !196, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !168, file: !13, line: 47, baseType: !201, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!5, !175, !50, !189}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "meth_data", scope: !163, file: !13, line: 105, baseType: !4, size: 64, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !163, file: !13, line: 106, baseType: !206, size: 64, align: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st_CONF_VALUE", file: !13, line: 31, size: 64, align: 64, elements: !208)
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !207, file: !13, line: 31, baseType: !210, size: 64, align: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "lh_CONF_VALUE_dummy", file: !13, line: 31, size: 64, align: 64, elements: !211)
!211 = !{!212, !213, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !210, file: !13, line: 31, baseType: !4, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !210, file: !13, line: 31, baseType: !39, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !210, file: !13, line: 31, baseType: !5, size: 32, align: 32)
!215 = !DILocalVariable(name: "md", arg: 1, scope: !153, file: !23, line: 61, type: !156)
!216 = !DILocation(line: 61, column: 42, scope: !153)
!217 = !DILocalVariable(name: "cnf", arg: 2, scope: !153, file: !23, line: 61, type: !159)
!218 = !DILocation(line: 61, column: 58, scope: !153)
!219 = !DILocalVariable(name: "i", scope: !153, file: !23, line: 63, type: !37)
!220 = !DILocation(line: 63, column: 12, scope: !153)
!221 = !DILocalVariable(name: "j", scope: !153, file: !23, line: 63, type: !37)
!222 = !DILocation(line: 63, column: 15, scope: !153)
!223 = !DILocalVariable(name: "cnt", scope: !153, file: !23, line: 63, type: !37)
!224 = !DILocation(line: 63, column: 18, scope: !153)
!225 = !DILocalVariable(name: "rv", scope: !153, file: !23, line: 64, type: !5)
!226 = !DILocation(line: 64, column: 9, scope: !153)
!227 = !DILocalVariable(name: "ssl_conf_section", scope: !153, file: !23, line: 65, type: !50)
!228 = !DILocation(line: 65, column: 17, scope: !153)
!229 = !DILocalVariable(name: "cmd_lists", scope: !153, file: !23, line: 66, type: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !13, line: 30, flags: DIFlagFwdDecl)
!232 = !DILocation(line: 66, column: 33, scope: !153)
!233 = !DILocation(line: 68, column: 47, scope: !153)
!234 = !DILocation(line: 68, column: 24, scope: !153)
!235 = !DILocation(line: 68, column: 22, scope: !153)
!236 = !DILocation(line: 69, column: 35, scope: !153)
!237 = !DILocation(line: 69, column: 40, scope: !153)
!238 = !DILocation(line: 69, column: 17, scope: !153)
!239 = !DILocation(line: 69, column: 15, scope: !153)
!240 = !DILocation(line: 70, column: 27, scope: !241)
!241 = distinct !DILexicalBlock(scope: !153, file: !23, line: 70, column: 9)
!242 = !DILocation(line: 70, column: 9, scope: !241)
!243 = !DILocation(line: 70, column: 38, scope: !241)
!244 = !DILocation(line: 70, column: 9, scope: !153)
!245 = !DILocation(line: 71, column: 13, scope: !246)
!246 = distinct !DILexicalBlock(scope: !247, file: !23, line: 71, column: 13)
!247 = distinct !DILexicalBlock(scope: !241, file: !23, line: 70, column: 44)
!248 = !DILocation(line: 71, column: 23, scope: !246)
!249 = !DILocation(line: 71, column: 13, scope: !247)
!250 = !DILocation(line: 72, column: 13, scope: !246)
!251 = !DILocation(line: 74, column: 13, scope: !246)
!252 = !DILocation(line: 75, column: 43, scope: !247)
!253 = !DILocation(line: 75, column: 9, scope: !247)
!254 = !DILocation(line: 76, column: 9, scope: !247)
!255 = !DILocation(line: 78, column: 29, scope: !153)
!256 = !DILocation(line: 78, column: 11, scope: !153)
!257 = !DILocation(line: 78, column: 9, scope: !153)
!258 = !DILocation(line: 79, column: 21, scope: !153)
!259 = !DILocation(line: 79, column: 5, scope: !153)
!260 = !DILocation(line: 80, column: 52, scope: !153)
!261 = !DILocation(line: 80, column: 50, scope: !153)
