; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--drbgtest-bin-drbgtest.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--drbgtest-bin-drbgtest.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.drbg_selftest_data_st = type { i32, i32, i32, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64 }
%struct.hook_ctx_st = type { %struct.rand_drbg_st*, i64 (%struct.rand_drbg_st*, i8**, i32, i64, i64, i32)*, i32, i32 }
%struct.rand_drbg_st = type { i8*, %struct.rand_drbg_st*, i32, i32, i32, i16, %struct.rand_pool_st*, %struct.rand_pool_st*, i32, i64, i64, i64, i64, i64, i64, i64, i32, i32, i64, i64, i32, i32, i64, i32, %struct.crypto_ex_data_st, %union.anon, %struct.rand_drbg_method_st*, i64 (%struct.rand_drbg_st*, i8**, i32, i64, i64, i32)*, void (%struct.rand_drbg_st*, i8*, i64)*, i64 (%struct.rand_drbg_st*, i8**, i32, i64, i64)*, void (%struct.rand_drbg_st*, i8*, i64)* }
%struct.rand_pool_st = type { i8*, i64, i32, i64, i64, i64, i64 }
%struct.crypto_ex_data_st = type { %struct.stack_st_void* }
%struct.stack_st_void = type opaque
%union.anon = type { %struct.rand_drbg_hash_st }
%struct.rand_drbg_hash_st = type { %struct.evp_md_st*, %struct.evp_md_ctx_st*, i64, [111 x i8], [111 x i8], [111 x i8] }
%struct.evp_md_st = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9, globals: !206)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--drbgtest-bin-drbgtest.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "drbg_status_e", file: !4, line: 77, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "test/../crypto/rand/rand_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "DRBG_UNINITIALISED", value: 0)
!7 = !DIEnumerator(name: "DRBG_READY", value: 1)
!8 = !DIEnumerator(name: "DRBG_ERROR", value: 2)
!9 = !{!10, !11, !29, !30}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEST_CTX", file: !13, line: 132, baseType: !14)
!13 = !DIFile(filename: "test/drbgtest.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "test_ctx_st", file: !13, line: 125, size: 384, align: 64, elements: !15)
!15 = !{!16, !20, !24, !26, !27, !28}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !14, file: !13, line: 126, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "entropylen", scope: !14, file: !13, line: 127, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !22, line: 216, baseType: !23)
!22 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!23 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "entropycnt", scope: !14, file: !13, line: 128, baseType: !25, size: 32, align: 32, offset: 128)
!25 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !14, file: !13, line: 129, baseType: !17, size: 64, align: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "noncelen", scope: !14, file: !13, line: 130, baseType: !21, size: 64, align: 64, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "noncecnt", scope: !14, file: !13, line: 131, baseType: !25, size: 32, align: 32, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "HOOK_CTX", file: !13, line: 511, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hook_ctx_st", file: !13, line: 499, size: 192, align: 64, elements: !33)
!33 = !{!34, !203, !204, !205}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "drbg", scope: !32, file: !13, line: 500, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG", file: !37, line: 121, baseType: !38)
!37 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rand_drbg_st", file: !4, line: 184, size: 4544, align: 64, elements: !39)
!39 = !{!40, !44, !45, !46, !47, !48, !50, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !72, !73, !79, !80, !81, !82, !83, !85, !92, !159, !184, !191, !196, !201}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !38, file: !4, line: 185, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_RWLOCK", file: !43, line: 67, baseType: null)
!43 = !DIFile(filename: "include/openssl/crypto.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!44 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !38, file: !4, line: 186, baseType: !35, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "secure", scope: !38, file: !4, line: 187, baseType: !25, size: 32, align: 32, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !38, file: !4, line: 188, baseType: !25, size: 32, align: 32, offset: 160)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "fork_count", scope: !38, file: !4, line: 195, baseType: !25, size: 32, align: 32, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !38, file: !4, line: 196, baseType: !49, size: 16, align: 16, offset: 224)
!49 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "seed_pool", scope: !38, file: !4, line: 206, baseType: !51, size: 64, align: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rand_pool_st", file: !4, line: 168, size: 448, align: 64, elements: !53)
!53 = !{!54, !55, !56, !57, !58, !59, !60}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !52, file: !4, line: 169, baseType: !29, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !52, file: !4, line: 170, baseType: !21, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "attached", scope: !52, file: !4, line: 172, baseType: !25, size: 32, align: 32, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "min_len", scope: !52, file: !4, line: 174, baseType: !21, size: 64, align: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !52, file: !4, line: 175, baseType: !21, size: 64, align: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !52, file: !4, line: 176, baseType: !21, size: 64, align: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_requested", scope: !52, file: !4, line: 177, baseType: !21, size: 64, align: 64, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "adin_pool", scope: !38, file: !4, line: 211, baseType: !51, size: 64, align: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !38, file: !4, line: 233, baseType: !25, size: 32, align: 32, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "max_request", scope: !38, file: !4, line: 234, baseType: !21, size: 64, align: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "min_entropylen", scope: !38, file: !4, line: 235, baseType: !21, size: 64, align: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "max_entropylen", scope: !38, file: !4, line: 235, baseType: !21, size: 64, align: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "min_noncelen", scope: !38, file: !4, line: 236, baseType: !21, size: 64, align: 64, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "max_noncelen", scope: !38, file: !4, line: 236, baseType: !21, size: 64, align: 64, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "max_perslen", scope: !38, file: !4, line: 237, baseType: !21, size: 64, align: 64, offset: 768)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "max_adinlen", scope: !38, file: !4, line: 237, baseType: !21, size: 64, align: 64, offset: 832)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_gen_counter", scope: !38, file: !4, line: 244, baseType: !71, size: 32, align: 32, offset: 896)
!71 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_interval", scope: !38, file: !4, line: 249, baseType: !71, size: 32, align: 32, offset: 928)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_time", scope: !38, file: !4, line: 251, baseType: !74, size: 64, align: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !75, line: 75, baseType: !76)
!75 = !DIFile(filename: "/usr/include/time.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !77, line: 139, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!78 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_time_interval", scope: !38, file: !4, line: 256, baseType: !74, size: 64, align: 64, offset: 1024)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_prop_counter", scope: !38, file: !4, line: 267, baseType: !71, size: 32, align: 32, offset: 1088)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_next_counter", scope: !38, file: !4, line: 268, baseType: !71, size: 32, align: 32, offset: 1120)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "seedlen", scope: !38, file: !4, line: 270, baseType: !21, size: 64, align: 64, offset: 1152)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !38, file: !4, line: 271, baseType: !84, size: 32, align: 32, offset: 1216)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "DRBG_STATUS", file: !4, line: 81, baseType: !3)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !38, file: !4, line: 274, baseType: !86, size: 64, align: 64, offset: 1280)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_EX_DATA", file: !37, line: 167, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_ex_data_st", file: !43, line: 86, size: 64, align: 64, elements: !88)
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !87, file: !43, line: 87, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_void", file: !43, line: 87, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !38, file: !4, line: 281, baseType: !93, size: 2880, align: 64, offset: 1344)
!93 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !38, file: !4, line: 277, size: 2880, align: 64, elements: !94)
!94 = !{!95, !124, !144}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ctr", scope: !93, file: !4, line: 278, baseType: !96, size: 1216, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_CTR", file: !4, line: 154, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rand_drbg_ctr_st", file: !4, line: 143, size: 1216, align: 64, elements: !98)
!98 = !{!99, !103, !104, !109, !110, !114, !118, !119, !120}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !97, file: !4, line: 144, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER_CTX", file: !37, line: 90, baseType: !102)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_ctx_st", file: !37, line: 90, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_df", scope: !97, file: !4, line: 145, baseType: !100, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !97, file: !4, line: 146, baseType: !105, size: 64, align: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !37, line: 89, baseType: !108)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !37, line: 89, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !97, file: !4, line: 147, baseType: !21, size: 64, align: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "K", scope: !97, file: !4, line: 148, baseType: !111, size: 256, align: 8, offset: 256)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 256, align: 8, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "V", scope: !97, file: !4, line: 149, baseType: !115, size: 128, align: 8, offset: 512)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 128, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 16)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "bltmp", scope: !97, file: !4, line: 151, baseType: !115, size: 128, align: 8, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "bltmp_pos", scope: !97, file: !4, line: 152, baseType: !21, size: 64, align: 64, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "KX", scope: !97, file: !4, line: 153, baseType: !121, size: 384, align: 8, offset: 832)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 384, align: 8, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 48)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !93, file: !4, line: 279, baseType: !125, size: 2880, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_HASH", file: !4, line: 130, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rand_drbg_hash_st", file: !4, line: 122, size: 2880, align: 64, elements: !127)
!127 = !{!128, !133, !137, !138, !142, !143}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !126, file: !4, line: 123, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD", file: !37, line: 91, baseType: !132)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_md_st", file: !37, line: 91, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !126, file: !4, line: 124, baseType: !134, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD_CTX", file: !37, line: 92, baseType: !136)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_md_ctx_st", file: !37, line: 92, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "blocklen", scope: !126, file: !4, line: 125, baseType: !21, size: 64, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "V", scope: !126, file: !4, line: 126, baseType: !139, size: 888, align: 8, offset: 192)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 888, align: 8, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 111)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !126, file: !4, line: 127, baseType: !139, size: 888, align: 8, offset: 1080)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "vtmp", scope: !126, file: !4, line: 129, baseType: !139, size: 888, align: 8, offset: 1968)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "hmac", scope: !93, file: !4, line: 280, baseType: !145, size: 1216, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_HMAC", file: !4, line: 138, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rand_drbg_hmac_st", file: !4, line: 132, size: 1216, align: 64, elements: !147)
!147 = !{!148, !149, !153, !154, !158}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !146, file: !4, line: 133, baseType: !129, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !146, file: !4, line: 134, baseType: !150, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "HMAC_CTX", file: !37, line: 106, baseType: !152)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "hmac_ctx_st", file: !37, line: 106, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "blocklen", scope: !146, file: !4, line: 135, baseType: !21, size: 64, align: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "K", scope: !146, file: !4, line: 136, baseType: !155, size: 512, align: 8, offset: 192)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 512, align: 8, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "V", scope: !146, file: !4, line: 137, baseType: !155, size: 512, align: 8, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !38, file: !4, line: 284, baseType: !160, size: 64, align: 64, offset: 4224)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_METHOD", file: !4, line: 117, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rand_drbg_method_st", file: !4, line: 112, size: 256, align: 64, elements: !163)
!163 = !{!164, !169, !174, !179}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "instantiate", scope: !162, file: !4, line: 113, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_instantiate_fn", file: !4, line: 85, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!25, !35, !17, !21, !17, !21, !17, !21}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "reseed", scope: !162, file: !4, line: 114, baseType: !170, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_reseed_fn", file: !4, line: 93, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!25, !35, !17, !21, !17, !21}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "generate", scope: !162, file: !4, line: 115, baseType: !175, size: 64, align: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_generate_fn", file: !4, line: 99, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!25, !35, !29, !21, !17, !21}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "uninstantiate", scope: !162, file: !4, line: 116, baseType: !180, size: 64, align: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_uninstantiate_fn", file: !4, line: 105, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!25, !35}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "get_entropy", scope: !38, file: !4, line: 287, baseType: !185, size: 64, align: 64, offset: 4288)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_get_entropy_fn", file: !186, line: 120, baseType: !187)
!186 = !DIFile(filename: "include/openssl/rand_drbg.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!21, !35, !190, !25, !21, !21, !25}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_entropy", scope: !38, file: !4, line: 288, baseType: !192, size: 64, align: 64, offset: 4352)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_cleanup_entropy_fn", file: !186, line: 125, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !35, !29, !21}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "get_nonce", scope: !38, file: !4, line: 289, baseType: !197, size: 64, align: 64, offset: 4416)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_get_nonce_fn", file: !186, line: 127, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!21, !35, !190, !25, !21, !21}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_nonce", scope: !38, file: !4, line: 290, baseType: !202, size: 64, align: 64, offset: 4480)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_cleanup_nonce_fn", file: !186, line: 130, baseType: !193)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "get_entropy", scope: !32, file: !13, line: 506, baseType: !185, size: 64, align: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !32, file: !13, line: 508, baseType: !25, size: 32, align: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_count", scope: !32, file: !13, line: 510, baseType: !25, size: 32, align: 32, offset: 160)
!206 = !{!207, !208, !252, !255, !259, !260, !261, !262, !263, !264, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !417, !418, !419, !420, !421, !422, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !573, !574, !575, !576, !577}
!207 = distinct !DIGlobalVariable(name: "app_data_index", scope: !0, file: !13, line: 120, type: !25, isLocal: true, isDefinition: true, variable: i32* @app_data_index)
!208 = distinct !DIGlobalVariable(name: "drbg_test", scope: !0, file: !13, line: 106, type: !209, isLocal: true, isDefinition: true, variable: [16 x %struct.drbg_selftest_data_st]* @drbg_test)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 38912, align: 64, elements: !116)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "DRBG_SELFTEST_DATA", file: !13, line: 72, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drbg_selftest_data_st", file: !13, line: 28, size: 2432, align: 64, elements: !212)
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !211, file: !13, line: 29, baseType: !25, size: 32, align: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "nid", scope: !211, file: !13, line: 30, baseType: !25, size: 32, align: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !211, file: !13, line: 31, baseType: !71, size: 32, align: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !211, file: !13, line: 34, baseType: !17, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "entropylen", scope: !211, file: !13, line: 35, baseType: !21, size: 64, align: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !211, file: !13, line: 36, baseType: !17, size: 64, align: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "noncelen", scope: !211, file: !13, line: 37, baseType: !21, size: 64, align: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pers", scope: !211, file: !13, line: 38, baseType: !17, size: 64, align: 64, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "perslen", scope: !211, file: !13, line: 39, baseType: !21, size: 64, align: 64, offset: 448)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "adin", scope: !211, file: !13, line: 40, baseType: !17, size: 64, align: 64, offset: 512)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "adinlen", scope: !211, file: !13, line: 41, baseType: !21, size: 64, align: 64, offset: 576)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "entropyreseed", scope: !211, file: !13, line: 42, baseType: !17, size: 64, align: 64, offset: 640)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "entropyreseedlen", scope: !211, file: !13, line: 43, baseType: !21, size: 64, align: 64, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "adinreseed", scope: !211, file: !13, line: 44, baseType: !17, size: 64, align: 64, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "adinreseedlen", scope: !211, file: !13, line: 45, baseType: !21, size: 64, align: 64, offset: 832)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "adin2", scope: !211, file: !13, line: 46, baseType: !17, size: 64, align: 64, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "adin2len", scope: !211, file: !13, line: 47, baseType: !21, size: 64, align: 64, offset: 960)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "expected", scope: !211, file: !13, line: 48, baseType: !17, size: 64, align: 64, offset: 1024)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "exlen", scope: !211, file: !13, line: 49, baseType: !21, size: 64, align: 64, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "kat2", scope: !211, file: !13, line: 50, baseType: !17, size: 64, align: 64, offset: 1152)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "kat2len", scope: !211, file: !13, line: 51, baseType: !21, size: 64, align: 64, offset: 1216)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_pr", scope: !211, file: !13, line: 54, baseType: !17, size: 64, align: 64, offset: 1280)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "entropylen_pr", scope: !211, file: !13, line: 55, baseType: !21, size: 64, align: 64, offset: 1344)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_pr", scope: !211, file: !13, line: 56, baseType: !17, size: 64, align: 64, offset: 1408)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "noncelen_pr", scope: !211, file: !13, line: 57, baseType: !21, size: 64, align: 64, offset: 1472)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pers_pr", scope: !211, file: !13, line: 58, baseType: !17, size: 64, align: 64, offset: 1536)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "perslen_pr", scope: !211, file: !13, line: 59, baseType: !21, size: 64, align: 64, offset: 1600)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "adin_pr", scope: !211, file: !13, line: 60, baseType: !17, size: 64, align: 64, offset: 1664)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "adinlen_pr", scope: !211, file: !13, line: 61, baseType: !21, size: 64, align: 64, offset: 1728)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "entropypr_pr", scope: !211, file: !13, line: 62, baseType: !17, size: 64, align: 64, offset: 1792)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "entropyprlen_pr", scope: !211, file: !13, line: 63, baseType: !21, size: 64, align: 64, offset: 1856)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ading_pr", scope: !211, file: !13, line: 64, baseType: !17, size: 64, align: 64, offset: 1920)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "adinglen_pr", scope: !211, file: !13, line: 65, baseType: !21, size: 64, align: 64, offset: 1984)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "entropyg_pr", scope: !211, file: !13, line: 66, baseType: !17, size: 64, align: 64, offset: 2048)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "entropyglen_pr", scope: !211, file: !13, line: 67, baseType: !21, size: 64, align: 64, offset: 2112)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "kat_pr", scope: !211, file: !13, line: 68, baseType: !17, size: 64, align: 64, offset: 2176)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "katlen_pr", scope: !211, file: !13, line: 69, baseType: !21, size: 64, align: 64, offset: 2240)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "kat2_pr", scope: !211, file: !13, line: 70, baseType: !17, size: 64, align: 64, offset: 2304)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "kat2len_pr", scope: !211, file: !13, line: 71, baseType: !21, size: 64, align: 64, offset: 2368)
!252 = distinct !DIGlobalVariable(name: "aes_128_no_df_entropyinput", scope: !0, file: !253, line: 327, type: !254, isLocal: true, isDefinition: true, variable: [32 x i8]* @aes_128_no_df_entropyinput)
!253 = !DIFile(filename: "test/drbgtest.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 256, align: 8, elements: !112)
!255 = distinct !DIGlobalVariable(name: "aes_128_no_df_nonce", scope: !0, file: !253, line: 332, type: !256, isLocal: true, isDefinition: true, variable: [8 x i8]* @aes_128_no_df_nonce)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, align: 8, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 8)
!259 = distinct !DIGlobalVariable(name: "aes_128_no_df_personalizationstring", scope: !0, file: !253, line: 335, type: !254, isLocal: true, isDefinition: true, variable: [32 x i8]* @aes_128_no_df_personalizationstring)
!260 = distinct !DIGlobalVariable(name: "aes_128_no_df_additionalinput", scope: !0, file: !253, line: 340, type: !254, isLocal: true, isDefinition: true, variable: [32 x i8]* @aes_128_no_df_additionalinput)
!261 = distinct !DIGlobalVariable(name: "aes_128_no_df_entropyinputreseed", scope: !0, file: !253, line: 349, type: !254, isLocal: true, isDefinition: true, variable: [32 x i8]* @aes_128_no_df_entropyinputreseed)
!262 = distinct !DIGlobalVariable(name: "aes_128_no_df_additionalinputreseed", scope: !0, file: !253, line: 354, type: !254, isLocal: true, isDefinition: true, variable: [32 x i8]* @aes_128_no_df_additionalinputreseed)
!263 = distinct !DIGlobalVariable(name: "aes_128_no_df_additionalinput2", scope: !0, file: !253, line: 359, type: !254, isLocal: true, isDefinition: true, variable: [32 x i8]* @aes_128_no_df_additionalinput2)
!264 = distinct !DIGlobalVariable(name: "aes_128_no_df_int_returnedbits", scope: !0, file: !253, line: 345, type: !265, isLocal: true, isDefinition: true, variable: [16 x i8]* @aes_128_no_df_int_returnedbits)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 128, align: 8, elements: !116)
!266 = distinct !DIGlobalVariable(name: "aes_128_no_df_returnedbits", scope: !0, file: !253, line: 364, type: !265, isLocal: true, isDefinition: true, variable: [16 x i8]* @aes_128_no_df_returnedbits)
!267 = distinct !DIGlobalVariable(name: "aes_128_no_df_pr_entropyinput", scope: !0, file: !253, line: 281, type: !254, isLocal: true, isDefinition: true, variable: [32 x i8]* @aes_128_no_df_pr_entropyinput)
!268 = distinct !DIGlobalVariable(name: "aes_128_no_df_pr_nonce", scope: !0, file: !253, line: 286, type: !256, isLocal: true, isDefinition: true, variable: [8 x i8]* @aes_128_no_df_pr_nonce)
!269 = distinct !DIGlobalVariable(name: "aes_128_no_df_pr_personalizationstring", scope: !0, file: !253, line: 289, type: !254, isLocal: true, isDefinition: true, variable: [32 x i8]* @aes_128_no_df_pr_personalizationstring)
!270 = distinct !DIGlobalVariable(name: "aes_128_no_df_pr_additionalinput", scope: !0, file: !253, line: 294, type: !254, isLocal: true, isDefinition: true, variable: [32 x i8]* @aes_128_no_df_pr_additionalinput)
!271 = distinct !DIGlobalVariable(name: "aes_128_no_df_pr_entropyinputpr", scope: !0, file: !253, line: 299, type: !254, isLocal: true, isDefinition: true, variable: [32 x i8]* @aes_128_no_df_pr_entropyinputpr)
!272 = distinct !DIGlobalVariable(name: "aes_128_no_df_pr_additionalinput2", scope: !0, file: !253, line: 308, type: !254, isLocal: true, isDefinition: true, variable: [32 x i8]* @aes_128_no_df_pr_additionalinput2)
!273 = distinct !DIGlobalVariable(name: "aes_128_no_df_pr_entropyinputpr2", scope: !0, file: !253, line: 313, type: !254, isLocal: true, isDefinition: true, variable: [32 x i8]* @aes_128_no_df_pr_entropyinputpr2)
