; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]apps--openssl-bin-spkac.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]apps--openssl-bin-spkac.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.options_st = type { i8*, i32, i32, i8* }
%struct.bio_st = type opaque
%struct.conf_st = type { %struct.conf_method_st*, i8*, %struct.lhash_st_CONF_VALUE* }
%struct.conf_method_st = type { i8*, %struct.conf_st* (%struct.conf_method_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*, %struct.bio_st*, i64*)*, i32 (%struct.conf_st*, %struct.bio_st*)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8*, i64*)* }
%struct.lhash_st_CONF_VALUE = type { %union.lh_CONF_VALUE_dummy }
%union.lh_CONF_VALUE_dummy = type { i8* }
%struct.engine_st = type opaque
%struct.evp_pkey_st = type opaque
%struct.Netscape_spki_st = type { %struct.Netscape_spkac_st*, %struct.X509_algor_st, %struct.asn1_string_st* }
%struct.Netscape_spkac_st = type { %struct.X509_pubkey_st*, %struct.asn1_string_st* }
%struct.X509_pubkey_st = type opaque
%struct.X509_algor_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_object_st = type opaque
%struct.asn1_type_st = type { i32, %union.anon }
%union.anon = type { i8* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.evp_md_st = type opaque


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !21, globals: !24)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]apps--openssl-bin-spkac.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OPTION_choice", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "apps/spkac.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!6 = !DIEnumerator(name: "OPT_ERR", value: -1)
!7 = !DIEnumerator(name: "OPT_EOF", value: 0)
!8 = !DIEnumerator(name: "OPT_HELP", value: 1)
!9 = !DIEnumerator(name: "OPT_NOOUT", value: 2)
!10 = !DIEnumerator(name: "OPT_PUBKEY", value: 3)
!11 = !DIEnumerator(name: "OPT_VERIFY", value: 4)
!12 = !DIEnumerator(name: "OPT_IN", value: 5)
!13 = !DIEnumerator(name: "OPT_OUT", value: 6)
!14 = !DIEnumerator(name: "OPT_ENGINE", value: 7)
!15 = !DIEnumerator(name: "OPT_KEY", value: 8)
!16 = !DIEnumerator(name: "OPT_CHALLENGE", value: 9)
!17 = !DIEnumerator(name: "OPT_PASSIN", value: 10)
!18 = !DIEnumerator(name: "OPT_SPKAC", value: 11)
!19 = !DIEnumerator(name: "OPT_SPKSECT", value: 12)
!20 = !DIEnumerator(name: "OPT_KEYFORM", value: 13)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !{!25}
!25 = distinct !DIGlobalVariable(name: "spkac_options", scope: !0, file: !4, line: 30, type: !26, isLocal: false, isDefinition: true, variable: [14 x %struct.options_st]* @spkac_options)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2688, align: 64, elements: !39)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPTIONS", file: !29, line: 280, baseType: !30)
!29 = !DIFile(filename: "apps/include/opt.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "options_st", file: !29, line: 269, size: 192, align: 64, elements: !31)
!31 = !{!32, !36, !37, !38}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !30, file: !29, line: 270, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !30, file: !29, line: 271, baseType: !23, size: 32, align: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "valtype", scope: !30, file: !29, line: 278, baseType: !23, size: 32, align: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "helpstr", scope: !30, file: !29, line: 279, baseType: !33, size: 64, align: 64, offset: 128)
!39 = !{!40}
!40 = !DISubrange(count: 14)
!41 = !{i32 2, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!44 = distinct !DISubprogram(name: "spkac_main", scope: !4, file: !4, line: 50, type: !45, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !49)
!45 = !DISubroutineType(types: !46)
!46 = !{!23, !23, !47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!49 = !{}
!50 = !DILocalVariable(name: "argc", arg: 1, scope: !44, file: !4, line: 50, type: !23)
!51 = !DIExpression()
!52 = !DILocation(line: 50, column: 20, scope: !44)
!53 = !DILocalVariable(name: "argv", arg: 2, scope: !44, file: !4, line: 50, type: !47)
!54 = !DILocation(line: 50, column: 33, scope: !44)
!55 = !DILocalVariable(name: "out", scope: !44, file: !4, line: 52, type: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !58, line: 79, baseType: !59)
!58 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !58, line: 79, flags: DIFlagFwdDecl)
!60 = !DILocation(line: 52, column: 10, scope: !44)
!61 = !DILocalVariable(name: "conf", scope: !44, file: !4, line: 53, type: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF", file: !58, line: 144, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_st", file: !65, line: 103, size: 192, align: 64, elements: !66)
!65 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!66 = !{!67, !104, !105}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !64, file: !65, line: 104, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_METHOD", file: !65, line: 35, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_method_st", file: !65, line: 37, size: 640, align: 64, elements: !71)
!71 = !{!72, !73, !77, !81, !82, !83, !89, !95, !99, !100}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !70, file: !65, line: 38, baseType: !33, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !70, file: !65, line: 39, baseType: !74, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!62, !68}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !70, file: !65, line: 40, baseType: !78, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!23, !62}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !70, file: !65, line: 41, baseType: !78, size: 64, align: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_data", scope: !70, file: !65, line: 42, baseType: !78, size: 64, align: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "load_bio", scope: !70, file: !65, line: 43, baseType: !84, size: 64, align: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!23, !62, !56, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !70, file: !65, line: 44, baseType: !90, size: 64, align: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!23, !93, !56}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "is_number", scope: !70, file: !65, line: 45, baseType: !96, size: 64, align: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!23, !93, !35}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "to_int", scope: !70, file: !65, line: 46, baseType: !96, size: 64, align: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !70, file: !65, line: 47, baseType: !101, size: 64, align: 64, offset: 576)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!23, !62, !33, !87}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "meth_data", scope: !64, file: !65, line: 105, baseType: !22, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !64, file: !65, line: 106, baseType: !106, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st_CONF_VALUE", file: !65, line: 31, size: 64, align: 64, elements: !108)
!108 = !{!109}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !107, file: !65, line: 31, baseType: !110, size: 64, align: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "lh_CONF_VALUE_dummy", file: !65, line: 31, size: 64, align: 64, elements: !111)
!111 = !{!112, !113, !115}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !110, file: !65, line: 31, baseType: !22, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !110, file: !65, line: 31, baseType: !114, size: 64, align: 64)
!114 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !110, file: !65, line: 31, baseType: !23, size: 32, align: 32)
!116 = !DILocation(line: 53, column: 11, scope: !44)
!117 = !DILocalVariable(name: "e", scope: !44, file: !4, line: 54, type: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENGINE", file: !58, line: 150, baseType: !120)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "engine_st", file: !58, line: 150, flags: DIFlagFwdDecl)
!121 = !DILocation(line: 54, column: 13, scope: !44)
!122 = !DILocalVariable(name: "pkey", scope: !44, file: !4, line: 55, type: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !58, line: 95, baseType: !125)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !58, line: 95, flags: DIFlagFwdDecl)
!126 = !DILocation(line: 55, column: 15, scope: !44)
!127 = !DILocalVariable(name: "spki", scope: !44, file: !4, line: 56, type: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETSCAPE_SPKI", file: !130, line: 269, baseType: !131)
!130 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Netscape_spki_st", file: !130, line: 265, size: 256, align: 64, elements: !132)
!132 = !{!133, !154, !224}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "spkac", scope: !131, file: !130, line: 266, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETSCAPE_SPKAC", file: !130, line: 263, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Netscape_spkac_st", file: !130, line: 260, size: 128, align: 64, elements: !137)
!137 = !{!138, !142}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pubkey", scope: !136, file: !130, line: 261, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_PUBKEY", file: !58, line: 130, baseType: !141)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_pubkey_st", file: !58, line: 130, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "challenge", scope: !136, file: !130, line: 262, baseType: !143, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !58, line: 46, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !146, line: 146, size: 192, align: 64, elements: !147)
!146 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!147 = !{!148, !149, !150, !153}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !145, file: !146, line: 147, baseType: !23, size: 32, align: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !145, file: !146, line: 148, baseType: !23, size: 32, align: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !145, file: !146, line: 149, baseType: !151, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !145, file: !146, line: 155, baseType: !88, size: 64, align: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "sig_algor", scope: !131, file: !130, line: 267, baseType: !155, size: 128, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !58, line: 125, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !130, line: 59, size: 128, align: 64, elements: !157)
!157 = !{!158, !162}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !156, file: !130, line: 60, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !58, line: 60, baseType: !161)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !58, line: 60, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !156, file: !130, line: 61, baseType: !163, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !146, line: 473, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !146, line: 444, size: 128, align: 64, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !165, file: !146, line: 445, baseType: !23, size: 32, align: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !165, file: !146, line: 472, baseType: !169, size: 64, align: 64, offset: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !165, file: !146, line: 446, size: 64, align: 64, elements: !170)
!170 = !{!171, !172, !174, !177, !178, !181, !184, !187, !190, !193, !196, !197, !200, !203, !206, !209, !212, !215, !218, !219, !220}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !169, file: !146, line: 447, baseType: !48, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !169, file: !146, line: 448, baseType: !173, size: 32, align: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !58, line: 56, baseType: !23)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !169, file: !146, line: 449, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !58, line: 55, baseType: !145)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !169, file: !146, line: 450, baseType: !159, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !169, file: !146, line: 451, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !58, line: 40, baseType: !145)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !169, file: !146, line: 452, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !58, line: 41, baseType: !145)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !169, file: !146, line: 453, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !58, line: 42, baseType: !145)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !169, file: !146, line: 454, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !58, line: 43, baseType: !145)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !169, file: !146, line: 455, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !58, line: 44, baseType: !145)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !169, file: !146, line: 456, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !58, line: 45, baseType: !145)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !169, file: !146, line: 457, baseType: !143, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !169, file: !146, line: 458, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !58, line: 47, baseType: !145)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !169, file: !146, line: 459, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !58, line: 49, baseType: !145)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !169, file: !146, line: 460, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !58, line: 48, baseType: !145)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !169, file: !146, line: 461, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !58, line: 50, baseType: !145)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !169, file: !146, line: 462, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !58, line: 52, baseType: !145)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !169, file: !146, line: 463, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !58, line: 53, baseType: !145)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !169, file: !146, line: 464, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !58, line: 54, baseType: !145)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !169, file: !146, line: 469, baseType: !175, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !169, file: !146, line: 470, baseType: !175, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !169, file: !146, line: 471, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !146, line: 213, baseType: !223)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !146, line: 213, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !131, file: !130, line: 268, baseType: !185, size: 64, align: 64, offset: 192)
!225 = !DILocation(line: 56, column: 20, scope: !44)
!226 = !DILocalVariable(name: "challenge", scope: !44, file: !4, line: 57, type: !48)
!227 = !DILocation(line: 57, column: 11, scope: !44)
!228 = !DILocalVariable(name: "keyfile", scope: !44, file: !4, line: 57, type: !48)
!229 = !DILocation(line: 57, column: 29, scope: !44)
!230 = !DILocalVariable(name: "infile", scope: !44, file: !4, line: 58, type: !48)
!231 = !DILocation(line: 58, column: 11, scope: !44)
!232 = !DILocalVariable(name: "outfile", scope: !44, file: !4, line: 58, type: !48)
!233 = !DILocation(line: 58, column: 26, scope: !44)
!234 = !DILocalVariable(name: "passinarg", scope: !44, file: !4, line: 58, type: !48)
!235 = !DILocation(line: 58, column: 43, scope: !44)
!236 = !DILocalVariable(name: "passin", scope: !44, file: !4, line: 58, type: !48)
!237 = !DILocation(line: 58, column: 62, scope: !44)
!238 = !DILocalVariable(name: "spkstr", scope: !44, file: !4, line: 59, type: !48)
!239 = !DILocation(line: 59, column: 11, scope: !44)
!240 = !DILocalVariable(name: "prog", scope: !44, file: !4, line: 59, type: !48)
!241 = !DILocation(line: 59, column: 26, scope: !44)
!242 = !DILocalVariable(name: "spkac", scope: !44, file: !4, line: 60, type: !33)
!243 = !DILocation(line: 60, column: 17, scope: !44)
!244 = !DILocalVariable(name: "spksect", scope: !44, file: !4, line: 60, type: !33)
!245 = !DILocation(line: 60, column: 35, scope: !44)
!246 = !DILocalVariable(name: "i", scope: !44, file: !4, line: 61, type: !23)
!247 = !DILocation(line: 61, column: 9, scope: !44)
!248 = !DILocalVariable(name: "ret", scope: !44, file: !4, line: 61, type: !23)
!249 = !DILocation(line: 61, column: 12, scope: !44)
!250 = !DILocalVariable(name: "verify", scope: !44, file: !4, line: 61, type: !23)
!251 = !DILocation(line: 61, column: 21, scope: !44)
!252 = !DILocalVariable(name: "noout", scope: !44, file: !4, line: 61, type: !23)
!253 = !DILocation(line: 61, column: 33, scope: !44)
!254 = !DILocalVariable(name: "pubkey", scope: !44, file: !4, line: 61, type: !23)
!255 = !DILocation(line: 61, column: 44, scope: !44)
!256 = !DILocalVariable(name: "keyformat", scope: !44, file: !4, line: 62, type: !23)
!257 = !DILocation(line: 62, column: 9, scope: !44)
!258 = !DILocalVariable(name: "o", scope: !44, file: !4, line: 63, type: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPTION_CHOICE", file: !4, line: 28, baseType: !3)
!260 = !DILocation(line: 63, column: 19, scope: !44)
!261 = !DILocation(line: 65, column: 21, scope: !44)
!262 = !DILocation(line: 65, column: 27, scope: !44)
!263 = !DILocation(line: 65, column: 12, scope: !44)
!264 = !DILocation(line: 65, column: 10, scope: !44)
!265 = !DILocation(line: 66, column: 5, scope: !44)
!266 = !DILocation(line: 66, column: 17, scope: !267)
!267 = !DILexicalBlockFile(scope: !44, file: !4, discriminator: 1)
!268 = !DILocation(line: 66, column: 15, scope: !267)
!269 = !DILocation(line: 66, column: 29, scope: !267)
!270 = !DILocation(line: 66, column: 5, scope: !267)
!271 = !DILocation(line: 67, column: 17, scope: !272)
!272 = distinct !DILexicalBlock(scope: !44, file: !4, line: 66, column: 41)
!273 = !DILocation(line: 67, column: 9, scope: !272)
!274 = !DILocation(line: 67, column: 20, scope: !275)
!275 = !DILexicalBlockFile(scope: !272, file: !4, discriminator: 1)
!276 = !DILocation(line: 71, column: 24, scope: !277)
!277 = distinct !DILexicalBlock(scope: !272, file: !4, line: 67, column: 20)
!278 = !DILocation(line: 71, column: 65, scope: !277)
!279 = !DILocation(line: 71, column: 13, scope: !277)
!280 = !DILocation(line: 72, column: 13, scope: !277)
!281 = !DILocation(line: 74, column: 13, scope: !277)
!282 = !DILocation(line: 75, column: 17, scope: !277)
!283 = !DILocation(line: 76, column: 13, scope: !277)
!284 = !DILocation(line: 78, column: 22, scope: !277)
!285 = !DILocation(line: 78, column: 20, scope: !277)
