; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-shlib-v3_pci.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-shlib-v3_pci.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type opaque
%struct.v3_ext_method = type { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, {}*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }
%struct.stack_st_CONF_VALUE = type opaque
%struct.v3_ext_ctx = type { i32, %struct.x509_st*, %struct.x509_st*, %struct.X509_req_st*, %struct.X509_crl_st*, %struct.X509V3_CONF_METHOD_st*, i8* }
%struct.x509_st = type opaque
%struct.X509_req_st = type opaque
%struct.X509_crl_st = type opaque
%struct.X509V3_CONF_METHOD_st = type { i8* (i8*, i8*, i8*)*, %struct.stack_st_CONF_VALUE* (i8*, i8*)*, void (i8*, i8*)*, void (i8*, %struct.stack_st_CONF_VALUE*)* }
%struct.bio_st = type opaque
%struct.PROXY_CERT_INFO_EXTENSION_st = type { %struct.asn1_string_st*, %struct.PROXY_POLICY_st* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !25)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-shlib-v3_pci.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !10, !20, !21}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !8, line: 17, baseType: !9)
!8 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !8, line: 17, flags: DIFlagFwdDecl)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_VALUE", file: !12, line: 28, baseType: !13)
!12 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 24, size: 192, align: 64, elements: !14)
!14 = !{!15, !18, !19}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !13, file: !12, line: 25, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !13, file: !12, line: 26, baseType: !16, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !13, file: !12, line: 27, baseType: !16, size: 64, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !8, line: 20, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DISubroutineType(types: !24)
!24 = !{null, !4}
!25 = !{!26}
!26 = distinct !DIGlobalVariable(name: "v3_pci", scope: !0, file: !27, line: 57, type: !28, isLocal: false, isDefinition: true, variable: { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, i8* (%struct.v3_ext_method*, i8*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }* @v3_pci)
!27 = !DIFile(filename: "crypto/x509v3/v3_pci.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_METHOD", file: !30, line: 92, baseType: !31)
!30 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_method", file: !30, line: 49, size: 832, align: 64, elements: !32)
!32 = !{!33, !35, !36, !44, !49, !51, !61, !68, !75, !124, !129, !134, !142, !144}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ext_nid", scope: !31, file: !30, line: 50, baseType: !34, size: 32, align: 32)
!34 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !31, file: !30, line: 51, baseType: !34, size: 32, align: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !31, file: !30, line: 53, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !39, line: 318, baseType: !40)
!39 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !42, line: 62, baseType: !43)
!42 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !42, line: 62, flags: DIFlagFwdDecl)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ext_new", scope: !31, file: !30, line: 55, baseType: !45, size: 64, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_NEW", file: !30, line: 28, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!4}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ext_free", scope: !31, file: !30, line: 56, baseType: !50, size: 64, align: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_FREE", file: !30, line: 29, baseType: !22)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "d2i", scope: !31, file: !30, line: 57, baseType: !52, size: 64, align: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_D2I", file: !30, line: 30, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!4, !4, !56, !60}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!59 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!60 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "i2d", scope: !31, file: !30, line: 58, baseType: !62, size: 64, align: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2D", file: !30, line: 31, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!34, !4, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "i2s", scope: !31, file: !30, line: 60, baseType: !69, size: 64, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2S", file: !30, line: 38, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!16, !73, !4}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "s2i", scope: !31, file: !30, line: 61, baseType: !76, size: 64, align: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_S2I", file: !30, line: 40, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!4, !73, !80, !107}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_ctx", file: !30, line: 79, size: 448, align: 64, elements: !82)
!82 = !{!83, !84, !88, !89, !94, !98, !123}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !81, file: !30, line: 82, baseType: !34, size: 32, align: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_cert", scope: !81, file: !30, line: 83, baseType: !85, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !42, line: 124, baseType: !87)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !42, line: 124, flags: DIFlagFwdDecl)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "subject_cert", scope: !81, file: !30, line: 84, baseType: !85, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "subject_req", scope: !81, file: !30, line: 85, baseType: !90, size: 64, align: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_REQ", file: !92, line: 93, baseType: !93)
!92 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_req_st", file: !92, line: 93, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !81, file: !30, line: 86, baseType: !95, size: 64, align: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !42, line: 126, baseType: !97)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !42, line: 126, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "db_meth", scope: !81, file: !30, line: 87, baseType: !99, size: 64, align: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CONF_METHOD", file: !30, line: 76, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509V3_CONF_METHOD_st", file: !30, line: 71, size: 256, align: 64, elements: !102)
!102 = !{!103, !109, !115, !119}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "get_string", scope: !101, file: !30, line: 72, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!16, !4, !107, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "get_section", scope: !101, file: !30, line: 73, baseType: !110, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !4, !107}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !12, line: 30, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "free_string", scope: !101, file: !30, line: 74, baseType: !116, size: 64, align: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !4, !16}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "free_section", scope: !101, file: !30, line: 75, baseType: !120, size: 64, align: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !4, !113}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !81, file: !30, line: 88, baseType: !4, size: 64, align: 64, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i2v", scope: !31, file: !30, line: 63, baseType: !125, size: 64, align: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2V", file: !30, line: 33, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!113, !73, !4, !113}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "v2i", scope: !31, file: !30, line: 64, baseType: !130, size: 64, align: 64, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_V2I", file: !30, line: 35, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!4, !73, !80, !113}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "i2r", scope: !31, file: !30, line: 66, baseType: !135, size: 64, align: 64, offset: 640)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2R", file: !30, line: 42, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!34, !73, !4, !139, !34}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !42, line: 79, baseType: !141)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !42, line: 79, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "r2i", scope: !31, file: !30, line: 67, baseType: !143, size: 64, align: 64, offset: 704)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_R2I", file: !30, line: 44, baseType: !77)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "usr_data", scope: !31, file: !30, line: 68, baseType: !4, size: 64, align: 64, offset: 768)
!145 = !{i32 2, !"Dwarf Version", i32 4}
!146 = !{i32 2, !"Debug Info Version", i32 3}
!147 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!148 = distinct !DISubprogram(name: "i2r_pci", scope: !27, file: !27, line: 67, type: !149, isLocal: true, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!149 = !DISubroutineType(types: !150)
!150 = !{!34, !151, !152, !139, !34}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROXY_CERT_INFO_EXTENSION", file: !30, line: 293, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PROXY_CERT_INFO_EXTENSION_st", file: !30, line: 290, size: 128, align: 64, elements: !155)
!155 = !{!156, !165}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pcPathLengthConstraint", scope: !154, file: !30, line: 291, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !42, line: 40, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !39, line: 146, size: 192, align: 64, elements: !160)
!160 = !{!161, !162, !163, !164}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !159, file: !39, line: 147, baseType: !34, size: 32, align: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !159, file: !39, line: 148, baseType: !34, size: 32, align: 32, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !159, file: !39, line: 149, baseType: !67, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !159, file: !39, line: 155, baseType: !60, size: 64, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "proxyPolicy", scope: !154, file: !30, line: 292, baseType: !166, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROXY_POLICY", file: !30, line: 288, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PROXY_POLICY_st", file: !30, line: 285, size: 128, align: 64, elements: !169)
!169 = !{!170, !174}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "policyLanguage", scope: !168, file: !30, line: 286, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !42, line: 60, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !42, line: 60, flags: DIFlagFwdDecl)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !168, file: !30, line: 287, baseType: !175, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !42, line: 43, baseType: !159)
!177 = !DILocalVariable(name: "method", arg: 1, scope: !148, file: !27, line: 67, type: !151)
!178 = !DIExpression()
!179 = !DILocation(line: 67, column: 39, scope: !148)
!180 = !DILocalVariable(name: "pci", arg: 2, scope: !148, file: !27, line: 67, type: !152)
!181 = !DILocation(line: 67, column: 74, scope: !148)
!182 = !DILocalVariable(name: "out", arg: 3, scope: !148, file: !27, line: 68, type: !139)
!183 = !DILocation(line: 68, column: 25, scope: !148)
!184 = !DILocalVariable(name: "indent", arg: 4, scope: !148, file: !27, line: 68, type: !34)
!185 = !DILocation(line: 68, column: 34, scope: !148)
!186 = !DILocation(line: 70, column: 16, scope: !148)
!187 = !DILocation(line: 70, column: 52, scope: !148)
!188 = !DILocation(line: 70, column: 5, scope: !148)
!189 = !DILocation(line: 71, column: 9, scope: !190)
!190 = distinct !DILexicalBlock(scope: !148, file: !27, line: 71, column: 9)
!191 = !DILocation(line: 71, column: 14, scope: !190)
!192 = !DILocation(line: 71, column: 9, scope: !148)
!193 = !DILocation(line: 72, column: 26, scope: !190)
!194 = !DILocation(line: 72, column: 31, scope: !190)
!195 = !DILocation(line: 72, column: 36, scope: !190)
!196 = !DILocation(line: 72, column: 9, scope: !190)
!197 = !DILocation(line: 74, column: 20, scope: !190)
!198 = !DILocation(line: 74, column: 9, scope: !190)
!199 = !DILocation(line: 75, column: 14, scope: !148)
!200 = !DILocation(line: 75, column: 5, scope: !148)
!201 = !DILocation(line: 76, column: 16, scope: !148)
!202 = !DILocation(line: 76, column: 45, scope: !148)
!203 = !DILocation(line: 76, column: 5, scope: !148)
!204 = !DILocation(line: 77, column: 21, scope: !148)
!205 = !DILocation(line: 77, column: 26, scope: !148)
!206 = !DILocation(line: 77, column: 31, scope: !148)
!207 = !DILocation(line: 77, column: 44, scope: !148)
!208 = !DILocation(line: 77, column: 5, scope: !148)
!209 = !DILocation(line: 78, column: 14, scope: !148)
!210 = !DILocation(line: 78, column: 5, scope: !148)
!211 = !DILocation(line: 79, column: 9, scope: !212)
!212 = distinct !DILexicalBlock(scope: !148, file: !27, line: 79, column: 9)
!213 = !DILocation(line: 79, column: 14, scope: !212)
!214 = !DILocation(line: 79, column: 27, scope: !212)
!215 = !DILocation(line: 79, column: 34, scope: !212)
!216 = !DILocation(line: 79, column: 37, scope: !217)
!217 = !DILexicalBlockFile(scope: !212, file: !27, discriminator: 1)
!218 = !DILocation(line: 79, column: 42, scope: !217)
!219 = !DILocation(line: 79, column: 55, scope: !217)
!220 = !DILocation(line: 79, column: 63, scope: !217)
!221 = !DILocation(line: 79, column: 9, scope: !217)
!222 = !DILocation(line: 80, column: 20, scope: !212)
!223 = !DILocation(line: 80, column: 49, scope: !212)
!224 = !DILocation(line: 81, column: 20, scope: !212)
!225 = !DILocation(line: 81, column: 25, scope: !212)
!226 = !DILocation(line: 81, column: 38, scope: !212)
!227 = !DILocation(line: 81, column: 46, scope: !212)
!228 = !DILocation(line: 80, column: 9, scope: !212)
!229 = !DILocation(line: 82, column: 5, scope: !148)
!230 = distinct !DISubprogram(name: "r2i_pci", scope: !27, file: !27, line: 243, type: !231, isLocal: true, isDefinition: true, scopeLine: 245, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!231 = !DISubroutineType(types: !232)
!232 = !{!152, !151, !233, !16}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CTX", file: !42, line: 143, baseType: !81)
!235 = !DILocalVariable(name: "method", arg: 1, scope: !230, file: !27, line: 243, type: !151)
!236 = !DILocation(line: 243, column: 62, scope: !230)
