; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-lib-v3_bcons.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-lib-v3_bcons.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.v3_ext_method = type { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, {}*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }
%struct.stack_st_CONF_VALUE = type opaque
%struct.v3_ext_ctx = type { i32, %struct.x509_st*, %struct.x509_st*, %struct.X509_req_st*, %struct.X509_crl_st*, %struct.X509V3_CONF_METHOD_st*, i8* }
%struct.x509_st = type opaque
%struct.X509_req_st = type opaque
%struct.X509_crl_st = type opaque
%struct.X509V3_CONF_METHOD_st = type { i8* (i8*, i8*, i8*)*, %struct.stack_st_CONF_VALUE* (i8*, i8*)*, void (i8*, i8*)*, void (i8*, %struct.stack_st_CONF_VALUE*)* }
%struct.bio_st = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !45)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-lib-v3_bcons.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !25, !26, !29, !30, !35}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "BASIC_CONSTRAINTS", file: !6, line: 106, baseType: !7)
!6 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BASIC_CONSTRAINTS_st", file: !6, line: 103, size: 128, align: 64, elements: !8)
!8 = !{!9, !11}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !7, file: !6, line: 104, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "pathlen", scope: !7, file: !6, line: 105, baseType: !12, size: 64, align: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !14, line: 40, baseType: !15)
!14 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !16, line: 146, size: 192, align: 64, elements: !17)
!16 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!17 = !{!18, !19, !20, !23}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !15, file: !16, line: 147, baseType: !10, size: 32, align: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !15, file: !16, line: 148, baseType: !10, size: 32, align: 32, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !15, file: !16, line: 149, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !15, file: !16, line: 155, baseType: !24, size: 64, align: 64, offset: 128)
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !16, line: 213, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !16, line: 213, flags: DIFlagFwdDecl)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !33, line: 17, baseType: !34)
!33 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !33, line: 17, flags: DIFlagFwdDecl)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_VALUE", file: !37, line: 28, baseType: !38)
!37 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 24, size: 192, align: 64, elements: !39)
!39 = !{!40, !43, !44}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !38, file: !37, line: 25, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !38, file: !37, line: 26, baseType: !41, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !38, file: !37, line: 27, baseType: !41, size: 64, align: 64, offset: 128)
!45 = !{!46, !183, !184}
!46 = distinct !DIGlobalVariable(name: "v3_bcons", scope: !0, file: !47, line: 26, type: !48, isLocal: false, isDefinition: true, variable: { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, i8* (%struct.v3_ext_method*, i8*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }* @v3_bcons)
!47 = !DIFile(filename: "crypto/x509v3/v3_bcons.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_METHOD", file: !6, line: 92, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_method", file: !6, line: 49, size: 832, align: 64, elements: !51)
!51 = !{!52, !53, !54, !84, !89, !94, !102, !108, !115, !162, !167, !172, !180, !182}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ext_nid", scope: !50, file: !6, line: 50, baseType: !10, size: 32, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !50, file: !6, line: 51, baseType: !10, size: 32, align: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !50, file: !6, line: 53, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !16, line: 318, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !14, line: 62, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !60, line: 580, size: 448, align: 64, elements: !61)
!60 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!61 = !{!62, !63, !64, !78, !79, !82, !83}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !59, file: !60, line: 581, baseType: !42, size: 8, align: 8)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !59, file: !60, line: 583, baseType: !24, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !59, file: !60, line: 584, baseType: !65, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !16, line: 210, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !60, line: 468, size: 320, align: 64, elements: !69)
!69 = !{!70, !72, !73, !74, !77}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !68, file: !60, line: 469, baseType: !71, size: 64, align: 64)
!71 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !68, file: !60, line: 470, baseType: !24, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !68, file: !60, line: 471, baseType: !71, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !68, file: !60, line: 472, baseType: !75, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !68, file: !60, line: 473, baseType: !55, size: 64, align: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !59, file: !60, line: 586, baseType: !24, size: 64, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !59, file: !60, line: 587, baseType: !80, size: 64, align: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !59, file: !60, line: 588, baseType: !24, size: 64, align: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !59, file: !60, line: 589, baseType: !75, size: 64, align: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ext_new", scope: !50, file: !6, line: 55, baseType: !85, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_NEW", file: !6, line: 28, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!29}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ext_free", scope: !50, file: !6, line: 56, baseType: !90, size: 64, align: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_FREE", file: !6, line: 29, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !29}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "d2i", scope: !50, file: !6, line: 57, baseType: !95, size: 64, align: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_D2I", file: !6, line: 30, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!29, !29, !99, !24}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i2d", scope: !50, file: !6, line: 58, baseType: !103, size: 64, align: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2D", file: !6, line: 31, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!10, !29, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i2s", scope: !50, file: !6, line: 60, baseType: !109, size: 64, align: 64, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2S", file: !6, line: 38, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!41, !113, !29}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "s2i", scope: !50, file: !6, line: 61, baseType: !116, size: 64, align: 64, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_S2I", file: !6, line: 40, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!29, !113, !120, !75}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_ctx", file: !6, line: 79, size: 448, align: 64, elements: !122)
!122 = !{!123, !124, !128, !129, !134, !138, !161}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !121, file: !6, line: 82, baseType: !10, size: 32, align: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_cert", scope: !121, file: !6, line: 83, baseType: !125, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !14, line: 124, baseType: !127)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !14, line: 124, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "subject_cert", scope: !121, file: !6, line: 84, baseType: !125, size: 64, align: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "subject_req", scope: !121, file: !6, line: 85, baseType: !130, size: 64, align: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_REQ", file: !132, line: 93, baseType: !133)
!132 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_req_st", file: !132, line: 93, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !121, file: !6, line: 86, baseType: !135, size: 64, align: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !14, line: 126, baseType: !137)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !14, line: 126, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "db_meth", scope: !121, file: !6, line: 87, baseType: !139, size: 64, align: 64, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CONF_METHOD", file: !6, line: 76, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509V3_CONF_METHOD_st", file: !6, line: 71, size: 256, align: 64, elements: !142)
!142 = !{!143, !147, !153, !157}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "get_string", scope: !141, file: !6, line: 72, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!41, !29, !75, !75}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "get_section", scope: !141, file: !6, line: 73, baseType: !148, size: 64, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !29, !75}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !37, line: 30, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "free_string", scope: !141, file: !6, line: 74, baseType: !154, size: 64, align: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !29, !41}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "free_section", scope: !141, file: !6, line: 75, baseType: !158, size: 64, align: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !29, !151}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !121, file: !6, line: 88, baseType: !29, size: 64, align: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i2v", scope: !50, file: !6, line: 63, baseType: !163, size: 64, align: 64, offset: 512)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2V", file: !6, line: 33, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!151, !113, !29, !151}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "v2i", scope: !50, file: !6, line: 64, baseType: !168, size: 64, align: 64, offset: 576)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_V2I", file: !6, line: 35, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!29, !113, !120, !151}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "i2r", scope: !50, file: !6, line: 66, baseType: !173, size: 64, align: 64, offset: 640)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2R", file: !6, line: 42, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!10, !113, !29, !177, !10}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !14, line: 79, baseType: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !14, line: 79, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "r2i", scope: !50, file: !6, line: 67, baseType: !181, size: 64, align: 64, offset: 704)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_R2I", file: !6, line: 44, baseType: !117)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "usr_data", scope: !50, file: !6, line: 68, baseType: !29, size: 64, align: 64, offset: 768)
!183 = distinct !DIGlobalVariable(name: "BASIC_CONSTRAINTS_it", scope: !0, file: !47, line: 40, type: !57, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @BASIC_CONSTRAINTS_it)
!184 = distinct !DIGlobalVariable(name: "BASIC_CONSTRAINTS_seq_tt", scope: !0, file: !47, line: 37, type: !185, isLocal: true, isDefinition: true, variable: [2 x %struct.ASN1_TEMPLATE_st]* @BASIC_CONSTRAINTS_seq_tt)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 640, align: 64, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 2)
!188 = !{i32 2, !"Dwarf Version", i32 4}
!189 = !{i32 2, !"Debug Info Version", i32 3}
!190 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!191 = distinct !DISubprogram(name: "i2v_BASIC_CONSTRAINTS", scope: !47, file: !47, line: 44, type: !192, isLocal: true, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!192 = !DISubroutineType(types: !193)
!193 = !{!151, !194, !4, !151}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!195 = !DILocalVariable(name: "method", arg: 1, scope: !191, file: !47, line: 44, type: !194)
!196 = !DIExpression()
!197 = !DILocation(line: 44, column: 77, scope: !191)
!198 = !DILocalVariable(name: "bcons", arg: 2, scope: !191, file: !47, line: 45, type: !4)
!199 = !DILocation(line: 45, column: 71, scope: !191)
!200 = !DILocalVariable(name: "extlist", arg: 3, scope: !191, file: !47, line: 47, type: !151)
!201 = !DILocation(line: 47, column: 53, scope: !191)
!202 = !DILocation(line: 49, column: 33, scope: !191)
!203 = !DILocation(line: 49, column: 40, scope: !191)
!204 = !DILocation(line: 49, column: 5, scope: !191)
!205 = !DILocation(line: 50, column: 37, scope: !191)
!206 = !DILocation(line: 50, column: 44, scope: !191)
!207 = !DILocation(line: 50, column: 5, scope: !191)
!208 = !DILocation(line: 51, column: 12, scope: !191)
!209 = !DILocation(line: 51, column: 5, scope: !191)
!210 = distinct !DISubprogram(name: "v2i_BASIC_CONSTRAINTS", scope: !47, file: !47, line: 54, type: !211, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!211 = !DISubroutineType(types: !212)
!212 = !{!4, !194, !213, !151}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CTX", file: !14, line: 143, baseType: !121)
!215 = !DILocalVariable(name: "method", arg: 1, scope: !210, file: !47, line: 54, type: !194)
!216 = !DILocation(line: 54, column: 68, scope: !210)
!217 = !DILocalVariable(name: "ctx", arg: 2, scope: !210, file: !47, line: 55, type: !213)
!218 = !DILocation(line: 55, column: 61, scope: !210)
!219 = !DILocalVariable(name: "values", arg: 3, scope: !210, file: !47, line: 56, type: !151)
!220 = !DILocation(line: 56, column: 77, scope: !210)
!221 = !DILocalVariable(name: "bcons", scope: !210, file: !47, line: 58, type: !4)
!222 = !DILocation(line: 58, column: 24, scope: !210)
!223 = !DILocalVariable(name: "val", scope: !210, file: !47, line: 59, type: !35)
!224 = !DILocation(line: 59, column: 17, scope: !210)
!225 = !DILocalVariable(name: "i", scope: !210, file: !47, line: 60, type: !10)
!226 = !DILocation(line: 60, column: 9, scope: !210)
!227 = !DILocation(line: 62, column: 18, scope: !228)
!228 = distinct !DILexicalBlock(scope: !210, file: !47, line: 62, column: 9)
!229 = !DILocation(line: 62, column: 16, scope: !228)
!230 = !DILocation(line: 62, column: 43, scope: !228)
!231 = !DILocation(line: 62, column: 9, scope: !210)
!232 = !DILocation(line: 63, column: 9, scope: !233)
!233 = distinct !DILexicalBlock(scope: !228, file: !47, line: 62, column: 51)
!234 = !DILocation(line: 64, column: 9, scope: !233)
!235 = !DILocation(line: 66, column: 12, scope: !236)
