; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--cms--libcrypto-shlib-cms_att.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--cms--libcrypto-shlib-cms_att.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CMS_SignerInfo_st = type { i32, %struct.CMS_SignerIdentifier_st*, %struct.X509_algor_st*, %struct.stack_st_X509_ATTRIBUTE*, %struct.X509_algor_st*, %struct.asn1_string_st*, %struct.stack_st_X509_ATTRIBUTE*, %struct.x509_st*, %struct.evp_pkey_st*, %struct.evp_md_ctx_st*, %struct.evp_pkey_ctx_st* }
%struct.CMS_SignerIdentifier_st = type { i32, %union.anon }
%union.anon = type { %struct.CMS_IssuerAndSerialNumber_st* }
%struct.CMS_IssuerAndSerialNumber_st = type { %struct.X509_name_st*, %struct.asn1_string_st* }
%struct.X509_name_st = type opaque
%struct.X509_algor_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_object_st = type opaque
%struct.asn1_type_st = type { i32, %union.anon.0 }
%union.anon.0 = type { i8* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.stack_st_X509_ATTRIBUTE = type opaque
%struct.x509_st = type opaque
%struct.evp_pkey_st = type opaque
%struct.evp_md_ctx_st = type opaque
%struct.evp_pkey_ctx_st = type opaque
%struct.x509_attributes_st = type opaque

; Function Attrs: nounwind uwtable
define i32 @CMS_signed_get_attr_count(%struct.CMS_SignerInfo_st* %si) #0 !dbg !6 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--cms--libcrypto-shlib-cms_att.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!6 = distinct !DISubprogram(name: "CMS_signed_get_attr_count", scope: !7, file: !7, line: 19, type: !8, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!7 = !DIFile(filename: "crypto/cms/cms_att.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11}
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_SignerInfo", file: !14, line: 25, baseType: !15)
!14 = !DIFile(filename: "include/openssl/cms.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_SignerInfo_st", file: !16, line: 81, size: 704, align: 64, elements: !17)
!16 = !DIFile(filename: "crypto/cms/cms_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!17 = !{!18, !21, !56, !128, !131, !132, !133, !134, !138, !142, !146}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !15, file: !16, line: 82, baseType: !19, size: 32, align: 32)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !20, line: 38, baseType: !10)
!20 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sid", scope: !15, file: !16, line: 83, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_SignerIdentifier", file: !16, line: 23, baseType: !24)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_SignerIdentifier_st", file: !16, line: 97, size: 128, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !24, file: !16, line: 98, baseType: !10, size: 32, align: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !24, file: !16, line: 102, baseType: !28, size: 64, align: 64, offset: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !24, file: !16, line: 99, size: 64, align: 64, elements: !29)
!29 = !{!30, !53}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "issuerAndSerialNumber", scope: !28, file: !16, line: 100, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_IssuerAndSerialNumber", file: !16, line: 21, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_IssuerAndSerialNumber_st", file: !16, line: 308, size: 128, align: 64, elements: !34)
!34 = !{!35, !40}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !33, file: !16, line: 309, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !38, line: 129, baseType: !39)
!38 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !38, line: 129, flags: DIFlagFwdDecl)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "serialNumber", scope: !33, file: !16, line: 310, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !38, line: 40, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !44, line: 146, size: 192, align: 64, elements: !45)
!44 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!45 = !{!46, !47, !48, !51}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !43, file: !44, line: 147, baseType: !10, size: 32, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !43, file: !44, line: 148, baseType: !10, size: 32, align: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !43, file: !44, line: 149, baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !43, file: !44, line: 155, baseType: !52, size: 64, align: 64, offset: 128)
!52 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "subjectKeyIdentifier", scope: !28, file: !16, line: 101, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !38, line: 43, baseType: !43)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "digestAlgorithm", scope: !15, file: !16, line: 84, baseType: !57, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !38, line: 125, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !60, line: 59, size: 128, align: 64, elements: !61)
!60 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!61 = !{!62, !66}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !59, file: !60, line: 60, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !38, line: 60, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !38, line: 60, flags: DIFlagFwdDecl)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !59, file: !60, line: 61, baseType: !67, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !44, line: 473, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !44, line: 444, size: 128, align: 64, elements: !70)
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !69, file: !44, line: 445, baseType: !10, size: 32, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !69, file: !44, line: 472, baseType: !73, size: 64, align: 64, offset: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !69, file: !44, line: 446, size: 64, align: 64, elements: !74)
!74 = !{!75, !78, !80, !83, !84, !85, !88, !91, !92, !95, !98, !101, !104, !107, !110, !113, !116, !119, !122, !123, !124}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !73, file: !44, line: 447, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !73, file: !44, line: 448, baseType: !79, size: 32, align: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !38, line: 56, baseType: !10)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !73, file: !44, line: 449, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !38, line: 55, baseType: !43)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !73, file: !44, line: 450, baseType: !63, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !73, file: !44, line: 451, baseType: !41, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !73, file: !44, line: 452, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !38, line: 41, baseType: !43)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !73, file: !44, line: 453, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !38, line: 42, baseType: !43)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !73, file: !44, line: 454, baseType: !54, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !73, file: !44, line: 455, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !38, line: 44, baseType: !43)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !73, file: !44, line: 456, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !38, line: 45, baseType: !43)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !73, file: !44, line: 457, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !38, line: 46, baseType: !43)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !73, file: !44, line: 458, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !38, line: 47, baseType: !43)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !73, file: !44, line: 459, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !38, line: 49, baseType: !43)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !73, file: !44, line: 460, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !38, line: 48, baseType: !43)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !73, file: !44, line: 461, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !38, line: 50, baseType: !43)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !73, file: !44, line: 462, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !38, line: 52, baseType: !43)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !73, file: !44, line: 463, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !38, line: 53, baseType: !43)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !73, file: !44, line: 464, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !38, line: 54, baseType: !43)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !73, file: !44, line: 469, baseType: !81, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !73, file: !44, line: 470, baseType: !81, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !73, file: !44, line: 471, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !44, line: 213, baseType: !127)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !44, line: 213, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "signedAttrs", scope: !15, file: !16, line: 85, baseType: !129, size: 64, align: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ATTRIBUTE", file: !60, line: 89, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "signatureAlgorithm", scope: !15, file: !16, line: 86, baseType: !57, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !15, file: !16, line: 87, baseType: !54, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "unsignedAttrs", scope: !15, file: !16, line: 88, baseType: !129, size: 64, align: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "signer", scope: !15, file: !16, line: 90, baseType: !135, size: 64, align: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !38, line: 124, baseType: !137)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !38, line: 124, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !15, file: !16, line: 91, baseType: !139, size: 64, align: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !38, line: 95, baseType: !141)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !38, line: 95, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !15, file: !16, line: 93, baseType: !143, size: 64, align: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD_CTX", file: !38, line: 92, baseType: !145)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_md_ctx_st", file: !38, line: 92, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pctx", scope: !15, file: !16, line: 94, baseType: !147, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY_CTX", file: !38, line: 100, baseType: !149)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_ctx_st", file: !38, line: 100, flags: DIFlagFwdDecl)
!150 = !DILocalVariable(name: "si", arg: 1, scope: !6, file: !7, line: 19, type: !11)
!151 = !DIExpression()
!152 = !DILocation(line: 19, column: 53, scope: !6)
!153 = !DILocation(line: 21, column: 34, scope: !6)
!154 = !DILocation(line: 21, column: 38, scope: !6)
!155 = !DILocation(line: 21, column: 12, scope: !6)
!156 = !DILocation(line: 21, column: 5, scope: !6)
!157 = distinct !DISubprogram(name: "CMS_signed_get_attr_by_NID", scope: !7, file: !7, line: 24, type: !158, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!158 = !DISubroutineType(types: !159)
!159 = !{!10, !11, !10, !10}
!160 = !DILocalVariable(name: "si", arg: 1, scope: !157, file: !7, line: 24, type: !11)
!161 = !DILocation(line: 24, column: 54, scope: !157)
!162 = !DILocalVariable(name: "nid", arg: 2, scope: !157, file: !7, line: 24, type: !10)
!163 = !DILocation(line: 24, column: 62, scope: !157)
!164 = !DILocalVariable(name: "lastpos", arg: 3, scope: !157, file: !7, line: 24, type: !10)
!165 = !DILocation(line: 24, column: 71, scope: !157)
!166 = !DILocation(line: 26, column: 35, scope: !157)
!167 = !DILocation(line: 26, column: 39, scope: !157)
!168 = !DILocation(line: 26, column: 52, scope: !157)
!169 = !DILocation(line: 26, column: 57, scope: !157)
!170 = !DILocation(line: 26, column: 12, scope: !157)
!171 = !DILocation(line: 26, column: 5, scope: !157)
!172 = distinct !DISubprogram(name: "CMS_signed_get_attr_by_OBJ", scope: !7, file: !7, line: 29, type: !173, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!173 = !DISubroutineType(types: !174)
!174 = !{!10, !11, !175, !10}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!177 = !DILocalVariable(name: "si", arg: 1, scope: !172, file: !7, line: 29, type: !11)
!178 = !DILocation(line: 29, column: 54, scope: !172)
!179 = !DILocalVariable(name: "obj", arg: 2, scope: !172, file: !7, line: 29, type: !175)
!180 = !DILocation(line: 29, column: 77, scope: !172)
!181 = !DILocalVariable(name: "lastpos", arg: 3, scope: !172, file: !7, line: 30, type: !10)
!182 = !DILocation(line: 30, column: 36, scope: !172)
!183 = !DILocation(line: 32, column: 35, scope: !172)
!184 = !DILocation(line: 32, column: 39, scope: !172)
!185 = !DILocation(line: 32, column: 52, scope: !172)
!186 = !DILocation(line: 32, column: 57, scope: !172)
!187 = !DILocation(line: 32, column: 12, scope: !172)
!188 = !DILocation(line: 32, column: 5, scope: !172)
!189 = distinct !DISubprogram(name: "CMS_signed_get_attr", scope: !7, file: !7, line: 35, type: !190, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!190 = !DISubroutineType(types: !191)
!191 = !{!192, !11, !10}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ATTRIBUTE", file: !60, line: 87, baseType: !194)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_attributes_st", file: !60, line: 87, flags: DIFlagFwdDecl)
!195 = !DILocalVariable(name: "si", arg: 1, scope: !189, file: !7, line: 35, type: !11)
!196 = !DILocation(line: 35, column: 59, scope: !189)
!197 = !DILocalVariable(name: "loc", arg: 2, scope: !189, file: !7, line: 35, type: !10)
!198 = !DILocation(line: 35, column: 67, scope: !189)
!199 = !DILocation(line: 37, column: 28, scope: !189)
