; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--ssl_test_ctx_test-bin-ssl_test_ctx.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--ssl_test_ctx_test-bin-ssl_test_ctx.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.test_enum = type { i8*, i32 }
%struct.ssl_test_ctx_option = type { i8*, i32 (%struct.SSL_TEST_CTX*, i8*)* }
%struct.SSL_TEST_CTX = type { i32, i32, i32, i32, i32, %struct.SSL_TEST_EXTRA_CONF, %struct.SSL_TEST_EXTRA_CONF, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, i32, i32, i32, %struct.stack_st_X509_NAME*, i32, i32, i32, %struct.stack_st_X509_NAME*, i32, i32, i32, i32, i8*, i8* }
%struct.SSL_TEST_EXTRA_CONF = type { %struct.SSL_TEST_CLIENT_CONF, %struct.SSL_TEST_SERVER_CONF, %struct.SSL_TEST_SERVER_CONF }
%struct.SSL_TEST_CLIENT_CONF = type { i32, i32, i32, i8*, i8*, i32, i8*, i8*, i8*, i32 }
%struct.SSL_TEST_SERVER_CONF = type { i32, i8*, i8*, i32, i32, i8*, i8*, i32, i8* }
%struct.stack_st_X509_NAME = type opaque
%struct.ssl_test_client_option = type { i8*, i32 (%struct.SSL_TEST_CLIENT_CONF*, i8*)* }
%struct.ssl_test_server_option = type { i8*, i32 (%struct.SSL_TEST_SERVER_CONF*, i8*)* }
%struct.X509_name_st = type opaque
%struct.stack_st = type opaque
%struct.conf_st = type { %struct.conf_method_st*, i8*, %struct.lhash_st_CONF_VALUE* }

!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--ssl_test_ctx_test-bin-ssl_test_ctx.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{!3, !11, !16, !22, !30, !36, !41, !45, !54, !59}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 16, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "test/ssl_test_ctx.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "SSL_TEST_SUCCESS", value: 0)
!7 = !DIEnumerator(name: "SSL_TEST_SERVER_FAIL", value: 1)
!8 = !DIEnumerator(name: "SSL_TEST_CLIENT_FAIL", value: 2)
!9 = !DIEnumerator(name: "SSL_TEST_INTERNAL_ERROR", value: 3)
!10 = !DIEnumerator(name: "SSL_TEST_FIRST_HANDSHAKE_FAILED", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 25, size: 32, align: 32, elements: !12)
!12 = !{!13, !14, !15}
!13 = !DIEnumerator(name: "SSL_TEST_VERIFY_NONE", value: 0)
!14 = !DIEnumerator(name: "SSL_TEST_VERIFY_ACCEPT_ALL", value: 1)
!15 = !DIEnumerator(name: "SSL_TEST_VERIFY_REJECT_ALL", value: 2)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 31, size: 32, align: 32, elements: !17)
!17 = !{!18, !19, !20, !21}
!18 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_NONE", value: 0)
!19 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_SERVER1", value: 1)
!20 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_SERVER2", value: 2)
!21 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_INVALID", value: 3)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 38, size: 32, align: 32, elements: !23)
!23 = !{!24, !25, !26, !27, !28, !29}
!24 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_CB_NONE", value: 0)
!25 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_IGNORE_MISMATCH", value: 1)
!26 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_REJECT_MISMATCH", value: 2)
!27 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_CLIENT_HELLO_IGNORE_MISMATCH", value: 3)
!28 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_CLIENT_HELLO_REJECT_MISMATCH", value: 4)
!29 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_CLIENT_HELLO_NO_V12", value: 5)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 47, size: 32, align: 32, elements: !31)
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "SSL_TEST_SESSION_TICKET_IGNORE", value: 0)
!33 = !DIEnumerator(name: "SSL_TEST_SESSION_TICKET_YES", value: 1)
!34 = !DIEnumerator(name: "SSL_TEST_SESSION_TICKET_NO", value: 2)
!35 = !DIEnumerator(name: "SSL_TEST_SESSION_TICKET_BROKEN", value: 3)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 59, size: 32, align: 32, elements: !37)
!37 = !{!38, !39, !40}
!38 = !DIEnumerator(name: "SSL_TEST_SESSION_ID_IGNORE", value: 0)
!39 = !DIEnumerator(name: "SSL_TEST_SESSION_ID_YES", value: 1)
!40 = !DIEnumerator(name: "SSL_TEST_SESSION_ID_NO", value: 2)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 65, size: 32, align: 32, elements: !42)
!42 = !{!43, !44}
!43 = !DIEnumerator(name: "SSL_TEST_METHOD_TLS", value: 0)
!44 = !DIEnumerator(name: "SSL_TEST_METHOD_DTLS", value: 1)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 70, size: 32, align: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53}
!47 = !DIEnumerator(name: "SSL_TEST_HANDSHAKE_SIMPLE", value: 0)
!48 = !DIEnumerator(name: "SSL_TEST_HANDSHAKE_RESUME", value: 1)
!49 = !DIEnumerator(name: "SSL_TEST_HANDSHAKE_RENEG_SERVER", value: 2)
!50 = !DIEnumerator(name: "SSL_TEST_HANDSHAKE_RENEG_CLIENT", value: 3)
!51 = !DIEnumerator(name: "SSL_TEST_HANDSHAKE_KEY_UPDATE_SERVER", value: 4)
!52 = !DIEnumerator(name: "SSL_TEST_HANDSHAKE_KEY_UPDATE_CLIENT", value: 5)
!53 = !DIEnumerator(name: "SSL_TEST_HANDSHAKE_POST_HANDSHAKE_AUTH", value: 6)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 80, size: 32, align: 32, elements: !55)
!55 = !{!56, !57, !58}
!56 = !DIEnumerator(name: "SSL_TEST_CT_VALIDATION_NONE", value: 0)
!57 = !DIEnumerator(name: "SSL_TEST_CT_VALIDATION_PERMISSIVE", value: 1)
!58 = !DIEnumerator(name: "SSL_TEST_CT_VALIDATION_STRICT", value: 2)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 86, size: 32, align: 32, elements: !60)
!60 = !{!61, !62, !63}
!61 = !DIEnumerator(name: "SSL_TEST_CERT_STATUS_NONE", value: 0)
!62 = !DIEnumerator(name: "SSL_TEST_CERT_STATUS_GOOD_RESPONSE", value: 1)
!63 = !DIEnumerator(name: "SSL_TEST_CERT_STATUS_BAD_RESPONSE", value: 2)
!64 = !{!65, !66, !70, !74, !76, !86}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !68, line: 17, baseType: !69)
!68 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !68, line: 17, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !68, line: 20, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !65}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_VALUE", file: !78, line: 28, baseType: !79)
!78 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 24, size: 192, align: 64, elements: !80)
!80 = !{!81, !84, !85}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !79, file: !78, line: 25, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !79, file: !78, line: 26, baseType: !82, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !79, file: !78, line: 27, baseType: !82, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_NAME", file: !88, line: 77, flags: DIFlagFwdDecl)
!88 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!89 = !{!90, !94, !95, !107, !111, !115, !119, !123, !124, !125, !126, !130, !131, !132, !133, !134, !164, !192, !252}
!90 = distinct !DIGlobalVariable(name: "default_app_data_size", scope: !0, file: !91, line: 23, type: !92, isLocal: true, isDefinition: true, variable: i32 256)
!91 = !DIFile(filename: "test/ssl_test_ctx.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!94 = distinct !DIGlobalVariable(name: "default_max_fragment_size", scope: !0, file: !91, line: 25, type: !92, isLocal: true, isDefinition: true, variable: i32 512)
!95 = distinct !DIGlobalVariable(name: "ssl_test_results", scope: !0, file: !91, line: 97, type: !96, isLocal: true, isDefinition: true, variable: [5 x %struct.test_enum]* @ssl_test_results)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 640, align: 64, elements: !105)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "test_enum", file: !91, line: 66, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 63, size: 128, align: 64, elements: !100)
!100 = !{!101, !104}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !99, file: !91, line: 64, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !99, file: !91, line: 65, baseType: !93, size: 32, align: 32, offset: 64)
!105 = !{!106}
!106 = !DISubrange(count: 5)
!107 = distinct !DIGlobalVariable(name: "ssl_alerts", scope: !0, file: !91, line: 123, type: !108, isLocal: true, isDefinition: true, variable: [6 x %struct.test_enum]* @ssl_alerts)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 768, align: 64, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 6)
!111 = distinct !DIGlobalVariable(name: "ssl_protocols", scope: !0, file: !91, line: 154, type: !112, isLocal: true, isDefinition: true, variable: [7 x %struct.test_enum]* @ssl_protocols)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 896, align: 64, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 7)
!115 = distinct !DIGlobalVariable(name: "ssl_verify_callbacks", scope: !0, file: !91, line: 177, type: !116, isLocal: true, isDefinition: true, variable: [3 x %struct.test_enum]* @ssl_verify_callbacks)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 384, align: 64, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 3)
!119 = distinct !DIGlobalVariable(name: "ssl_servername", scope: !0, file: !91, line: 203, type: !120, isLocal: true, isDefinition: true, variable: [4 x %struct.test_enum]* @ssl_servername)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 512, align: 64, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 4)
!123 = distinct !DIGlobalVariable(name: "ssl_servername_callbacks", scope: !0, file: !91, line: 242, type: !108, isLocal: true, isDefinition: true, variable: [6 x %struct.test_enum]* @ssl_servername_callbacks)
!124 = distinct !DIGlobalVariable(name: "ssl_session_ticket", scope: !0, file: !91, line: 273, type: !116, isLocal: true, isDefinition: true, variable: [3 x %struct.test_enum]* @ssl_session_ticket)
!125 = distinct !DIGlobalVariable(name: "ssl_session_id", scope: !0, file: !91, line: 303, type: !116, isLocal: true, isDefinition: true, variable: [3 x %struct.test_enum]* @ssl_session_id)
!126 = distinct !DIGlobalVariable(name: "ssl_test_methods", scope: !0, file: !91, line: 329, type: !127, isLocal: true, isDefinition: true, variable: [2 x %struct.test_enum]* @ssl_test_methods)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 256, align: 64, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 2)
!130 = distinct !DIGlobalVariable(name: "ssl_handshake_modes", scope: !0, file: !91, line: 371, type: !112, isLocal: true, isDefinition: true, variable: [7 x %struct.test_enum]* @ssl_handshake_modes)
!131 = distinct !DIGlobalVariable(name: "ssl_ct_validation_modes", scope: !0, file: !91, line: 422, type: !116, isLocal: true, isDefinition: true, variable: [3 x %struct.test_enum]* @ssl_ct_validation_modes)
!132 = distinct !DIGlobalVariable(name: "ssl_certstatus", scope: !0, file: !91, line: 454, type: !116, isLocal: true, isDefinition: true, variable: [3 x %struct.test_enum]* @ssl_certstatus)
!133 = distinct !DIGlobalVariable(name: "ssl_max_fragment_len_mode", scope: !0, file: !91, line: 488, type: !96, isLocal: true, isDefinition: true, variable: [5 x %struct.test_enum]* @ssl_max_fragment_len_mode)
!134 = distinct !DIGlobalVariable(name: "ssl_test_client_options", scope: !0, file: !91, line: 686, type: !135, isLocal: true, isDefinition: true, variable: [10 x %struct.ssl_test_client_option]* @ssl_test_client_options)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1280, align: 64, elements: !162)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_test_client_option", file: !91, line: 684, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 681, size: 128, align: 64, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !138, file: !91, line: 682, baseType: !102, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !138, file: !91, line: 683, baseType: !142, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!93, !145, !102}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_TEST_CLIENT_CONF", file: !4, line: 113, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 96, size: 576, align: 64, elements: !148)
!148 = !{!149, !151, !153, !154, !155, !156, !158, !159, !160, !161}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "verify_callback", scope: !147, file: !4, line: 98, baseType: !150, size: 32, align: 32)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_verify_callback_t", file: !4, line: 29, baseType: !11)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "servername", scope: !147, file: !4, line: 100, baseType: !152, size: 32, align: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_servername_t", file: !4, line: 36, baseType: !16)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "max_fragment_len_mode", scope: !147, file: !4, line: 102, baseType: !93, size: 32, align: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "npn_protocols", scope: !147, file: !4, line: 104, baseType: !82, size: 64, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "alpn_protocols", scope: !147, file: !4, line: 105, baseType: !82, size: 64, align: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ct_validation", scope: !147, file: !4, line: 106, baseType: !157, size: 32, align: 32, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_ct_validation_t", file: !4, line: 84, baseType: !54)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "reneg_ciphers", scope: !147, file: !4, line: 108, baseType: !82, size: 64, align: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "srp_user", scope: !147, file: !4, line: 109, baseType: !82, size: 64, align: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "srp_password", scope: !147, file: !4, line: 110, baseType: !82, size: 64, align: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "enable_pha", scope: !147, file: !4, line: 112, baseType: !93, size: 32, align: 32, offset: 512)
!162 = !{!163}
!163 = !DISubrange(count: 10)
!164 = distinct !DIGlobalVariable(name: "ssl_test_server_options", scope: !0, file: !91, line: 705, type: !165, isLocal: true, isDefinition: true, variable: [9 x %struct.ssl_test_server_option]* @ssl_test_server_options)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 1152, align: 64, elements: !190)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_test_server_option", file: !91, line: 703, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 700, size: 128, align: 64, elements: !169)
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !168, file: !91, line: 701, baseType: !102, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !168, file: !91, line: 702, baseType: !172, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!93, !175, !102}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_TEST_SERVER_CONF", file: !4, line: 131, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 115, size: 512, align: 64, elements: !178)
!178 = !{!179, !181, !182, !183, !184, !186, !187, !188, !189}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "servername_callback", scope: !177, file: !4, line: 117, baseType: !180, size: 32, align: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_servername_callback_t", file: !4, line: 45, baseType: !22)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "npn_protocols", scope: !177, file: !4, line: 119, baseType: !82, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "alpn_protocols", scope: !177, file: !4, line: 120, baseType: !82, size: 64, align: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "broken_session_ticket", scope: !177, file: !4, line: 122, baseType: !93, size: 32, align: 32, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "cert_status", scope: !177, file: !4, line: 124, baseType: !185, size: 32, align: 32, offset: 224)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_cert_status_t", file: !4, line: 90, baseType: !59)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "srp_user", scope: !177, file: !4, line: 126, baseType: !82, size: 64, align: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "srp_password", scope: !177, file: !4, line: 127, baseType: !82, size: 64, align: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "force_pha", scope: !177, file: !4, line: 129, baseType: !93, size: 32, align: 32, offset: 384)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "session_ticket_app_data", scope: !177, file: !4, line: 130, baseType: !82, size: 64, align: 64, offset: 448)
!190 = !{!191}
!191 = !DISubrange(count: 9)
!192 = distinct !DIGlobalVariable(name: "ssl_test_ctx_options", scope: !0, file: !91, line: 647, type: !193, isLocal: true, isDefinition: true, variable: [30 x %struct.ssl_test_ctx_option]* @ssl_test_ctx_options)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 3840, align: 64, elements: !250)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_test_ctx_option", file: !91, line: 645, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 642, size: 128, align: 64, elements: !197)
!197 = !{!198, !199}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !196, file: !91, line: 643, baseType: !102, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !196, file: !91, line: 644, baseType: !200, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!93, !203, !102}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_TEST_CTX", file: !4, line: 226, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 139, size: 4480, align: 64, elements: !206)
!206 = !{!207, !209, !211, !212, !213, !214, !221, !222, !224, !225, !226, !227, !228, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !248, !249}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !205, file: !4, line: 144, baseType: !208, size: 32, align: 32)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_test_method_t", file: !4, line: 68, baseType: !41)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_mode", scope: !205, file: !4, line: 146, baseType: !210, size: 32, align: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_handshake_mode_t", file: !4, line: 78, baseType: !45)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "app_data_size", scope: !205, file: !4, line: 151, baseType: !93, size: 32, align: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "max_fragment_size", scope: !205, file: !4, line: 153, baseType: !93, size: 32, align: 32, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "key_update_type", scope: !205, file: !4, line: 155, baseType: !93, size: 32, align: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !205, file: !4, line: 161, baseType: !215, size: 1600, align: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_TEST_EXTRA_CONF", file: !4, line: 137, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 133, size: 1600, align: 64, elements: !217)
!217 = !{!218, !219, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !216, file: !4, line: 134, baseType: !146, size: 576, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !216, file: !4, line: 135, baseType: !176, size: 512, align: 64, offset: 576)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "server2", scope: !216, file: !4, line: 136, baseType: !176, size: 512, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "resume_extra", scope: !205, file: !4, line: 163, baseType: !215, size: 1600, align: 64, offset: 1792)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "expected_result", scope: !205, file: !4, line: 169, baseType: !223, size: 32, align: 32, offset: 3392)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_test_result_t", file: !4, line: 23, baseType: !3)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "expected_client_alert", scope: !205, file: !4, line: 173, baseType: !93, size: 32, align: 32, offset: 3424)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "expected_server_alert", scope: !205, file: !4, line: 175, baseType: !93, size: 32, align: 32, offset: 3456)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "expected_protocol", scope: !205, file: !4, line: 178, baseType: !93, size: 32, align: 32, offset: 3488)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "expected_servername", scope: !205, file: !4, line: 189, baseType: !152, size: 32, align: 32, offset: 3520)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "session_ticket_expected", scope: !205, file: !4, line: 190, baseType: !229, size: 32, align: 32, offset: 3552)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_session_ticket_t", file: !4, line: 52, baseType: !30)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "compression_expected", scope: !205, file: !4, line: 191, baseType: !93, size: 32, align: 32, offset: 3584)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "expected_npn_protocol", scope: !205, file: !4, line: 193, baseType: !82, size: 64, align: 64, offset: 3648)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "expected_alpn_protocol", scope: !205, file: !4, line: 194, baseType: !82, size: 64, align: 64, offset: 3712)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "resumption_expected", scope: !205, file: !4, line: 196, baseType: !93, size: 32, align: 32, offset: 3776)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "expected_tmp_key_type", scope: !205, file: !4, line: 198, baseType: !93, size: 32, align: 32, offset: 3808)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "expected_server_cert_type", scope: !205, file: !4, line: 200, baseType: !93, size: 32, align: 32, offset: 3840)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "expected_server_sign_hash", scope: !205, file: !4, line: 202, baseType: !93, size: 32, align: 32, offset: 3872)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "expected_server_sign_type", scope: !205, file: !4, line: 204, baseType: !93, size: 32, align: 32, offset: 3904)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "expected_server_ca_names", scope: !205, file: !4, line: 206, baseType: !86, size: 64, align: 64, offset: 3968)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "expected_client_cert_type", scope: !205, file: !4, line: 208, baseType: !93, size: 32, align: 32, offset: 4032)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "expected_client_sign_hash", scope: !205, file: !4, line: 210, baseType: !93, size: 32, align: 32, offset: 4064)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "expected_client_sign_type", scope: !205, file: !4, line: 212, baseType: !93, size: 32, align: 32, offset: 4096)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "expected_client_ca_names", scope: !205, file: !4, line: 214, baseType: !86, size: 64, align: 64, offset: 4160)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "use_sctp", scope: !205, file: !4, line: 216, baseType: !93, size: 32, align: 32, offset: 4224)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "enable_client_sctp_label_bug", scope: !205, file: !4, line: 218, baseType: !93, size: 32, align: 32, offset: 4256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "enable_server_sctp_label_bug", scope: !205, file: !4, line: 220, baseType: !93, size: 32, align: 32, offset: 4288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "session_id_expected", scope: !205, file: !4, line: 222, baseType: !247, size: 32, align: 32, offset: 4320)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_session_id_t", file: !4, line: 63, baseType: !36)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "expected_cipher", scope: !205, file: !4, line: 223, baseType: !82, size: 64, align: 64, offset: 4352)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "expected_session_ticket_app_data", scope: !205, file: !4, line: 225, baseType: !82, size: 64, align: 64, offset: 4416)
!250 = !{!251}
!251 = !DISubrange(count: 30)
!252 = distinct !DIGlobalVariable(name: "ssl_key_update_types", scope: !0, file: !91, line: 404, type: !127, isLocal: true, isDefinition: true, variable: [2 x %struct.test_enum]* @ssl_key_update_types)
!253 = !{i32 2, !"Dwarf Version", i32 4}
!254 = !{i32 2, !"Debug Info Version", i32 3}
!255 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!256 = distinct !DISubprogram(name: "ssl_test_result_name", scope: !91, file: !91, line: 116, type: !257, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!257 = !DISubroutineType(types: !258)
!258 = !{!102, !223}
!259 = !{}
!260 = !DILocalVariable(name: "result", arg: 1, scope: !256, file: !91, line: 116, type: !223)
!261 = !DIExpression()
!262 = !DILocation(line: 116, column: 52, scope: !256)
!263 = !DILocation(line: 118, column: 98, scope: !256)
!264 = !DILocation(line: 118, column: 12, scope: !256)
!265 = !DILocation(line: 118, column: 5, scope: !256)
!266 = distinct !DISubprogram(name: "enum_name", scope: !91, file: !91, line: 82, type: !267, isLocal: true, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!267 = !DISubroutineType(types: !268)
!268 = !{!102, !269, !270, !93}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !271, line: 216, baseType: !272)
!271 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!272 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!273 = !DILocalVariable(name: "enums", arg: 1, scope: !266, file: !91, line: 82, type: !269)
!274 = !DILocation(line: 82, column: 47, scope: !266)
!275 = !DILocalVariable(name: "num_enums", arg: 2, scope: !266, file: !91, line: 82, type: !270)
!276 = !DILocation(line: 82, column: 61, scope: !266)
!277 = !DILocalVariable(name: "value", arg: 3, scope: !266, file: !91, line: 83, type: !93)
!278 = !DILocation(line: 83, column: 34, scope: !266)
!279 = !DILocalVariable(name: "i", scope: !266, file: !91, line: 85, type: !270)
!280 = !DILocation(line: 85, column: 12, scope: !266)
!281 = !DILocation(line: 86, column: 12, scope: !282)
!282 = distinct !DILexicalBlock(scope: !266, file: !91, line: 86, column: 5)
!283 = !DILocation(line: 86, column: 10, scope: !282)
!284 = !DILocation(line: 86, column: 17, scope: !285)
!285 = !DILexicalBlockFile(scope: !286, file: !91, discriminator: 1)
!286 = distinct !DILexicalBlock(scope: !282, file: !91, line: 86, column: 5)
!287 = !DILocation(line: 86, column: 21, scope: !285)
!288 = !DILocation(line: 86, column: 19, scope: !285)
!289 = !DILocation(line: 86, column: 5, scope: !285)
!290 = !DILocation(line: 87, column: 19, scope: !291)
!291 = distinct !DILexicalBlock(scope: !292, file: !91, line: 87, column: 13)
!292 = distinct !DILexicalBlock(scope: !286, file: !91, line: 86, column: 37)
!293 = !DILocation(line: 87, column: 13, scope: !291)
!294 = !DILocation(line: 87, column: 22, scope: !291)
!295 = !DILocation(line: 87, column: 31, scope: !291)
!296 = !DILocation(line: 87, column: 28, scope: !291)
!297 = !DILocation(line: 87, column: 13, scope: !292)
!298 = !DILocation(line: 88, column: 26, scope: !299)
!299 = distinct !DILexicalBlock(scope: !291, file: !91, line: 87, column: 38)
!300 = !DILocation(line: 88, column: 20, scope: !299)
!301 = !DILocation(line: 88, column: 29, scope: !299)
!302 = !DILocation(line: 88, column: 13, scope: !299)
!303 = !DILocation(line: 90, column: 5, scope: !292)
!304 = !DILocation(line: 86, column: 33, scope: !305)
!305 = !DILexicalBlockFile(scope: !286, file: !91, discriminator: 2)
!306 = !DILocation(line: 86, column: 5, scope: !305)
!307 = distinct !{!307, !308}
!308 = !DILocation(line: 86, column: 5, scope: !266)
!309 = !DILocation(line: 91, column: 5, scope: !266)
!310 = !DILocation(line: 92, column: 1, scope: !266)
!311 = distinct !DISubprogram(name: "ssl_alert_name", scope: !91, file: !91, line: 147, type: !312, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!312 = !DISubroutineType(types: !313)
!313 = !{!102, !93}
!314 = !DILocalVariable(name: "alert", arg: 1, scope: !311, file: !91, line: 147, type: !93)
!315 = !DILocation(line: 147, column: 32, scope: !311)
!316 = !DILocation(line: 149, column: 80, scope: !311)
!317 = !DILocation(line: 149, column: 12, scope: !311)
!318 = !DILocation(line: 149, column: 5, scope: !311)
!319 = distinct !DISubprogram(name: "ssl_protocol_name", scope: !91, file: !91, line: 170, type: !312, isLocal: false, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!320 = !DILocalVariable(name: "protocol", arg: 1, scope: !319, file: !91, line: 170, type: !93)
!321 = !DILocation(line: 170, column: 35, scope: !319)
!322 = !DILocation(line: 172, column: 89, scope: !319)
!323 = !DILocation(line: 172, column: 12, scope: !319)
!324 = !DILocation(line: 172, column: 5, scope: !319)
!325 = distinct !DISubprogram(name: "ssl_verify_callback_name", scope: !91, file: !91, line: 195, type: !326, isLocal: false, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!326 = !DISubroutineType(types: !327)
!327 = !{!102, !150}
!328 = !DILocalVariable(name: "callback", arg: 1, scope: !325, file: !91, line: 195, type: !150)
!329 = !DILocation(line: 195, column: 60, scope: !325)
!330 = !DILocation(line: 198, column: 22, scope: !325)
!331 = !DILocation(line: 197, column: 12, scope: !325)
!332 = !DILocation(line: 197, column: 5, scope: !325)
!333 = distinct !DISubprogram(name: "ssl_servername_name", scope: !91, file: !91, line: 234, type: !334, isLocal: false, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!334 = !DISubroutineType(types: !335)
!335 = !{!102, !152}
!336 = !DILocalVariable(name: "server", arg: 1, scope: !333, file: !91, line: 234, type: !152)
!337 = !DILocation(line: 234, column: 50, scope: !333)
!338 = !DILocation(line: 237, column: 22, scope: !333)
!339 = !DILocation(line: 236, column: 12, scope: !333)
!340 = !DILocation(line: 236, column: 5, scope: !333)
!341 = distinct !DISubprogram(name: "ssl_servername_callback_name", scope: !91, file: !91, line: 265, type: !342, isLocal: false, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!342 = !DISubroutineType(types: !343)
!343 = !{!102, !180}
!344 = !DILocalVariable(name: "callback", arg: 1, scope: !341, file: !91, line: 265, type: !180)
!345 = !DILocation(line: 265, column: 68, scope: !341)
!346 = !DILocation(line: 268, column: 96, scope: !341)
!347 = !DILocation(line: 267, column: 12, scope: !341)
!348 = !DILocation(line: 267, column: 5, scope: !341)
!349 = distinct !DISubprogram(name: "ssl_session_ticket_name", scope: !91, file: !91, line: 290, type: !350, isLocal: false, isDefinition: true, scopeLine: 291, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!350 = !DISubroutineType(types: !351)
!351 = !{!102, !229}
!352 = !DILocalVariable(name: "server", arg: 1, scope: !349, file: !91, line: 290, type: !229)
!353 = !DILocation(line: 290, column: 58, scope: !349)
!354 = !DILocation(line: 294, column: 22, scope: !349)
!355 = !DILocation(line: 292, column: 12, scope: !349)
!356 = !DILocation(line: 292, column: 5, scope: !349)
!357 = distinct !DISubprogram(name: "ssl_session_id_name", scope: !91, file: !91, line: 320, type: !358, isLocal: false, isDefinition: true, scopeLine: 321, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!358 = !DISubroutineType(types: !359)
!359 = !{!102, !247}
!360 = !DILocalVariable(name: "server", arg: 1, scope: !357, file: !91, line: 320, type: !247)
!361 = !DILocation(line: 320, column: 50, scope: !357)
!362 = !DILocation(line: 324, column: 22, scope: !357)
!363 = !DILocation(line: 322, column: 12, scope: !357)
!364 = !DILocation(line: 322, column: 5, scope: !357)
!365 = distinct !DISubprogram(name: "ssl_test_method_name", scope: !91, file: !91, line: 345, type: !366, isLocal: false, isDefinition: true, scopeLine: 346, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!366 = !DISubroutineType(types: !367)
!367 = !{!102, !208}
!368 = !DILocalVariable(name: "method", arg: 1, scope: !365, file: !91, line: 345, type: !208)
!369 = !DILocation(line: 345, column: 52, scope: !365)
!370 = !DILocation(line: 347, column: 98, scope: !365)
!371 = !DILocation(line: 347, column: 12, scope: !365)
!372 = !DILocation(line: 347, column: 5, scope: !365)
!373 = distinct !DISubprogram(name: "ssl_handshake_mode_name", scope: !91, file: !91, line: 392, type: !374, isLocal: false, isDefinition: true, scopeLine: 393, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!374 = !DISubroutineType(types: !375)
!375 = !{!102, !210}
!376 = !DILocalVariable(name: "mode", arg: 1, scope: !373, file: !91, line: 392, type: !210)
!377 = !DILocation(line: 392, column: 58, scope: !373)
!378 = !DILocation(line: 395, column: 22, scope: !373)
!379 = !DILocation(line: 394, column: 12, scope: !373)
!380 = !DILocation(line: 394, column: 5, scope: !373)
!381 = distinct !DISubprogram(name: "ssl_ct_validation_name", scope: !91, file: !91, line: 440, type: !382, isLocal: false, isDefinition: true, scopeLine: 441, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!382 = !DISubroutineType(types: !383)
!383 = !{!102, !157}
!384 = !DILocalVariable(name: "mode", arg: 1, scope: !381, file: !91, line: 440, type: !157)
!385 = !DILocation(line: 440, column: 56, scope: !381)
!386 = !DILocation(line: 443, column: 22, scope: !381)
!387 = !DILocation(line: 442, column: 12, scope: !381)
!388 = !DILocation(line: 442, column: 5, scope: !381)
!389 = distinct !DISubprogram(name: "ssl_certstatus_name", scope: !91, file: !91, line: 472, type: !390, isLocal: false, isDefinition: true, scopeLine: 473, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!390 = !DISubroutineType(types: !391)
!391 = !{!102, !185}
!392 = !DILocalVariable(name: "cert_status", arg: 1, scope: !389, file: !91, line: 472, type: !185)
!393 = !DILocation(line: 472, column: 51, scope: !389)
!394 = !DILocation(line: 475, column: 76, scope: !389)
!395 = !DILocation(line: 474, column: 12, scope: !389)
!396 = !DILocation(line: 474, column: 5, scope: !389)
!397 = distinct !DISubprogram(name: "ssl_max_fragment_len_name", scope: !91, file: !91, line: 509, type: !312, isLocal: false, isDefinition: true, scopeLine: 510, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!398 = !DILocalVariable(name: "MFL_mode", arg: 1, scope: !397, file: !91, line: 509, type: !93)
!399 = !DILocation(line: 509, column: 43, scope: !397)
!400 = !DILocation(line: 512, column: 98, scope: !397)
!401 = !DILocation(line: 511, column: 12, scope: !397)
!402 = !DILocation(line: 511, column: 5, scope: !397)
!403 = distinct !DISubprogram(name: "SSL_TEST_CTX_new", scope: !91, file: !91, line: 717, type: !404, isLocal: false, isDefinition: true, scopeLine: 718, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!404 = !DISubroutineType(types: !405)
!405 = !{!203}
!406 = !DILocalVariable(name: "ret", scope: !403, file: !91, line: 719, type: !203)
!407 = !DILocation(line: 719, column: 19, scope: !403)
!408 = !DILocation(line: 722, column: 16, scope: !409)
!409 = distinct !DILexicalBlock(scope: !403, file: !91, line: 722, column: 9)
!410 = !DILocation(line: 722, column: 14, scope: !409)
!411 = !DILocation(line: 722, column: 73, scope: !409)
!412 = !DILocation(line: 722, column: 9, scope: !403)
!413 = !DILocation(line: 723, column: 9, scope: !414)
!414 = distinct !DILexicalBlock(scope: !409, file: !91, line: 722, column: 54)
!415 = !DILocation(line: 723, column: 14, scope: !414)
!416 = !DILocation(line: 723, column: 28, scope: !414)
!417 = !DILocation(line: 724, column: 9, scope: !414)
!418 = !DILocation(line: 724, column: 14, scope: !414)
!419 = !DILocation(line: 724, column: 32, scope: !414)
!420 = !DILocation(line: 725, column: 5, scope: !414)
!421 = !DILocation(line: 726, column: 12, scope: !403)
!422 = !DILocation(line: 726, column: 5, scope: !403)
!423 = distinct !DISubprogram(name: "SSL_TEST_CTX_free", scope: !91, file: !91, line: 754, type: !424, isLocal: false, isDefinition: true, scopeLine: 755, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !203}
!426 = !DILocalVariable(name: "ctx", arg: 1, scope: !423, file: !91, line: 754, type: !203)
!427 = !DILocation(line: 754, column: 38, scope: !423)
!428 = !DILocation(line: 756, column: 34, scope: !423)
!429 = !DILocation(line: 756, column: 5, scope: !423)
!430 = !DILocation(line: 757, column: 17, scope: !423)
!431 = !DILocation(line: 757, column: 22, scope: !423)
!432 = !DILocation(line: 757, column: 5, scope: !423)
!433 = !DILocation(line: 758, column: 17, scope: !423)
!434 = !DILocation(line: 758, column: 22, scope: !423)
!435 = !DILocation(line: 758, column: 5, scope: !423)
!436 = !DILocation(line: 759, column: 17, scope: !423)
!437 = !DILocation(line: 759, column: 22, scope: !423)
!438 = !DILocation(line: 759, column: 5, scope: !423)
!439 = !DILocation(line: 760, column: 27, scope: !423)
!440 = !DILocation(line: 760, column: 32, scope: !423)
!441 = !DILocation(line: 760, column: 5, scope: !423)
!442 = !DILocation(line: 761, column: 27, scope: !423)
!443 = !DILocation(line: 761, column: 32, scope: !423)
!444 = !DILocation(line: 761, column: 5, scope: !423)
!445 = !DILocation(line: 762, column: 17, scope: !423)
!446 = !DILocation(line: 762, column: 22, scope: !423)
!447 = !DILocation(line: 762, column: 5, scope: !423)
!448 = !DILocation(line: 763, column: 17, scope: !423)
!449 = !DILocation(line: 763, column: 5, scope: !423)
!450 = !DILocation(line: 764, column: 1, scope: !423)
!451 = distinct !DISubprogram(name: "ssl_test_ctx_free_extra_data", scope: !91, file: !91, line: 748, type: !424, isLocal: true, isDefinition: true, scopeLine: 749, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!452 = !DILocalVariable(name: "ctx", arg: 1, scope: !451, file: !91, line: 748, type: !203)
!453 = !DILocation(line: 748, column: 56, scope: !451)
!454 = !DILocation(line: 750, column: 36, scope: !451)
!455 = !DILocation(line: 750, column: 41, scope: !451)
!456 = !DILocation(line: 750, column: 5, scope: !451)
!457 = !DILocation(line: 751, column: 36, scope: !451)
!458 = !DILocation(line: 751, column: 41, scope: !451)
!459 = !DILocation(line: 751, column: 5, scope: !451)
!460 = !DILocation(line: 752, column: 1, scope: !451)
!461 = distinct !DISubprogram(name: "sk_X509_NAME_pop_free", scope: !88, file: !88, line: 77, type: !462, isLocal: true, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !86, !464}
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_X509_NAME_freefunc", file: !88, line: 77, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{null, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !470, line: 129, baseType: !471)
!470 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !470, line: 129, flags: DIFlagFwdDecl)
!472 = !DILocalVariable(name: "sk", arg: 1, scope: !461, file: !88, line: 77, type: !86)
!473 = !DILocation(line: 77, column: 2731, scope: !461)
!474 = !DILocalVariable(name: "freefunc", arg: 2, scope: !461, file: !88, line: 77, type: !464)
!475 = !DILocation(line: 77, column: 2757, scope: !461)
!476 = !DILocation(line: 77, column: 2806, scope: !461)
!477 = !DILocation(line: 77, column: 2789, scope: !461)
!478 = !DILocation(line: 77, column: 2831, scope: !461)
!479 = !DILocation(line: 77, column: 2810, scope: !461)
!480 = !DILocation(line: 77, column: 2769, scope: !461)
!481 = !DILocation(line: 77, column: 2842, scope: !461)
!482 = distinct !DISubprogram(name: "SSL_TEST_CTX_create", scope: !91, file: !91, line: 832, type: !483, isLocal: false, isDefinition: true, scopeLine: 833, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !259)
!483 = !DISubroutineType(types: !484)
!484 = !{!203, !485, !102}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF", file: !470, line: 144, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_st", file: !78, line: 103, size: 192, align: 64, elements: !489)
!489 = !{!490, !529, !530}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !488, file: !78, line: 104, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_METHOD", file: !78, line: 35, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_method_st", file: !78, line: 37, size: 640, align: 64, elements: !494)
!494 = !{!495, !496, !501, !505, !506, !507, !516, !520, !524, !525}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !493, file: !78, line: 38, baseType: !102, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !493, file: !78, line: 39, baseType: !497, size: 64, align: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!500, !491}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !493, file: !78, line: 40, baseType: !502, size: 64, align: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64, align: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!93, !500}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !493, file: !78, line: 41, baseType: !502, size: 64, align: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_data", scope: !493, file: !78, line: 42, baseType: !502, size: 64, align: 64, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "load_bio", scope: !493, file: !78, line: 43, baseType: !508, size: 64, align: 64, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!93, !500, !511, !514}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !470, line: 79, baseType: !513)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !470, line: 79, flags: DIFlagFwdDecl)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64, align: 64)
!515 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !493, file: !78, line: 44, baseType: !517, size: 64, align: 64, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!93, !485, !511}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "is_number", scope: !493, file: !78, line: 45, baseType: !521, size: 64, align: 64, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!93, !485, !83}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "to_int", scope: !493, file: !78, line: 46, baseType: !521, size: 64, align: 64, offset: 512)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !493, file: !78, line: 47, baseType: !526, size: 64, align: 64, offset: 576)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!93, !500, !102, !514}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "meth_data", scope: !488, file: !78, line: 105, baseType: !65, size: 64, align: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !488, file: !78, line: 106, baseType: !531, size: 64, align: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st_CONF_VALUE", file: !78, line: 31, size: 64, align: 64, elements: !533)
!533 = !{!534}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !532, file: !78, line: 31, baseType: !535, size: 64, align: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "lh_CONF_VALUE_dummy", file: !78, line: 31, size: 64, align: 64, elements: !536)
!536 = !{!537, !538, !539}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !535, file: !78, line: 31, baseType: !65, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !535, file: !78, line: 31, baseType: !272, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !535, file: !78, line: 31, baseType: !93, size: 32, align: 32)
!540 = !DILocalVariable(name: "conf", arg: 1, scope: !482, file: !91, line: 832, type: !485)
!541 = !DILocation(line: 832, column: 47, scope: !482)
!542 = !DILocalVariable(name: "test_section", arg: 2, scope: !482, file: !91, line: 832, type: !102)
!543 = !DILocation(line: 832, column: 65, scope: !482)
!544 = !DILocalVariable(name: "sk_conf", scope: !482, file: !91, line: 834, type: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !78, line: 30, flags: DIFlagFwdDecl)
!547 = !DILocation(line: 834, column: 33, scope: !482)
!548 = !DILocalVariable(name: "ctx", scope: !482, file: !91, line: 835, type: !203)
!549 = !DILocation(line: 835, column: 19, scope: !482)
!550 = !DILocalVariable(name: "i", scope: !482, file: !91, line: 836, type: !93)
!551 = !DILocation(line: 836, column: 9, scope: !482)
!552 = !DILocalVariable(name: "j", scope: !482, file: !91, line: 837, type: !270)
!553 = !DILocation(line: 837, column: 12, scope: !482)
!554 = !DILocation(line: 839, column: 126, scope: !555)
!555 = distinct !DILexicalBlock(scope: !482, file: !91, line: 839, column: 9)
!556 = !DILocation(line: 839, column: 132, scope: !555)
!557 = !DILocation(line: 839, column: 108, scope: !555)
!558 = !DILocation(line: 839, column: 106, scope: !555)
!559 = !DILocation(line: 839, column: 98, scope: !555)
!560 = !DILocation(line: 839, column: 10, scope: !561)
!561 = !DILexicalBlockFile(scope: !555, file: !91, discriminator: 2)
!562 = !DILocation(line: 839, column: 10, scope: !555)
!563 = !DILocation(line: 840, column: 13, scope: !555)
!564 = !DILocation(line: 840, column: 88, scope: !565)
!565 = !DILexicalBlockFile(scope: !555, file: !91, discriminator: 1)
!566 = !DILocation(line: 840, column: 86, scope: !565)
!567 = !DILocation(line: 840, column: 82, scope: !565)
!568 = !DILocation(line: 840, column: 17, scope: !569)
!569 = !DILexicalBlockFile(scope: !565, file: !91, discriminator: 2)
!570 = !DILocation(line: 840, column: 17, scope: !565)
!571 = !DILocation(line: 839, column: 9, scope: !572)
!572 = !DILexicalBlockFile(scope: !482, file: !91, discriminator: 1)
!573 = !DILocation(line: 841, column: 9, scope: !555)
!574 = !DILocation(line: 843, column: 12, scope: !575)
!575 = distinct !DILexicalBlock(scope: !482, file: !91, line: 843, column: 5)
!576 = !DILocation(line: 843, column: 10, scope: !575)
!577 = !DILocation(line: 843, column: 17, scope: !578)
!578 = !DILexicalBlockFile(scope: !579, file: !91, discriminator: 1)
!579 = distinct !DILexicalBlock(scope: !575, file: !91, line: 843, column: 5)
!580 = !DILocation(line: 843, column: 39, scope: !578)
!581 = !DILocation(line: 843, column: 21, scope: !578)
!582 = !DILocation(line: 843, column: 19, scope: !578)
!583 = !DILocation(line: 843, column: 5, scope: !578)
!584 = !DILocalVariable(name: "found", scope: !585, file: !91, line: 844, type: !93)
