; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--async--libcrypto-lib-async_wait.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--async--libcrypto-lib-async_wait.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.async_wait_ctx_st = type { %struct.fd_lookup_st*, i64, i64, i32 (i8*)*, i8*, i32 }
%struct.fd_lookup_st = type { i8*, i32, i8*, void (%struct.async_wait_ctx_st*, i8*, i32, i8*)*, i32, i32, %struct.fd_lookup_st* }

@.str = private unnamed_addr constant [26 x i8] c"crypto/async/async_wait.c\00", align 1

; Function Attrs: nounwind uwtable
define %struct.async_wait_ctx_st* @ASYNC_WAIT_CTX_new() #0 !dbg !8 {
entry:
  %call = call i8* @CRYPTO_zalloc(i64 48, i8* getelementptr inbounds ([26 x i8], [26 x i8]* @.str, i32 0, i32 0), i32 17), !dbg !47
  %0 = bitcast i8* %call to %struct.async_wait_ctx_st*, !dbg !47
  ret %struct.async_wait_ctx_st* %0, !dbg !48
}

declare i8* @CRYPTO_zalloc(i64, i8*, i32) #1

; Function Attrs: nounwind uwtable
define void @ASYNC_WAIT_CTX_free(%struct.async_wait_ctx_st* %ctx) #0 !dbg !49 {
entry:
  %ctx.addr = alloca %struct.async_wait_ctx_st*, align 8
  %curr = alloca %struct.fd_lookup_st*, align 8
  %next = alloca %struct.fd_lookup_st*, align 8
  store %struct.async_wait_ctx_st* %ctx, %struct.async_wait_ctx_st** %ctx.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--async--libcrypto-lib-async_wait.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{i32 2, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!8 = distinct !DISubprogram(name: "ASYNC_WAIT_CTX_new", scope: !9, file: !9, line: 15, type: !10, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!9 = !DIFile(filename: "crypto/async/async_wait.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!10 = !DISubroutineType(types: !11)
!11 = !{!12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASYNC_WAIT_CTX", file: !14, line: 33, baseType: !15)
!14 = !DIFile(filename: "include/openssl/async.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "async_wait_ctx_st", file: !16, line: 58, size: 384, align: 64, elements: !17)
!16 = !DIFile(filename: "crypto/async/async_locl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!17 = !{!18, !35, !39, !40, !45, !46}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !15, file: !16, line: 59, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fd_lookup_st", file: !16, line: 48, size: 384, align: 64, elements: !21)
!21 = !{!22, !25, !27, !28, !32, !33, !34}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !20, file: !16, line: 49, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !20, file: !16, line: 50, baseType: !26, size: 32, align: 32, offset: 64)
!26 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "custom_data", scope: !20, file: !16, line: 51, baseType: !4, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !20, file: !16, line: 52, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DISubroutineType(types: !31)
!31 = !{null, !12, !23, !26, !4}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !20, file: !16, line: 53, baseType: !26, size: 32, align: 32, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "del", scope: !20, file: !16, line: 54, baseType: !26, size: 32, align: 32, offset: 288)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !20, file: !16, line: 55, baseType: !19, size: 64, align: 64, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "numadd", scope: !15, file: !16, line: 60, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !37, line: 216, baseType: !38)
!37 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!38 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "numdel", scope: !15, file: !16, line: 61, baseType: !36, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !15, file: !16, line: 62, baseType: !41, size: 64, align: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASYNC_callback_fn", file: !14, line: 34, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!26, !4}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "callback_arg", scope: !15, file: !16, line: 63, baseType: !4, size: 64, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !15, file: !16, line: 64, baseType: !26, size: 32, align: 32, offset: 320)
!47 = !DILocation(line: 17, column: 12, scope: !8)
!48 = !DILocation(line: 17, column: 5, scope: !8)
!49 = distinct !DISubprogram(name: "ASYNC_WAIT_CTX_free", scope: !9, file: !9, line: 20, type: !50, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !12}
!52 = !DILocalVariable(name: "ctx", arg: 1, scope: !49, file: !9, line: 20, type: !12)
!53 = !DIExpression()
!54 = !DILocation(line: 20, column: 42, scope: !49)
!55 = !DILocalVariable(name: "curr", scope: !49, file: !9, line: 22, type: !19)
!56 = !DILocation(line: 22, column: 26, scope: !49)
!57 = !DILocalVariable(name: "next", scope: !49, file: !9, line: 23, type: !19)
!58 = !DILocation(line: 23, column: 26, scope: !49)
!59 = !DILocation(line: 25, column: 9, scope: !60)
!60 = distinct !DILexicalBlock(scope: !49, file: !9, line: 25, column: 9)
!61 = !DILocation(line: 25, column: 13, scope: !60)
!62 = !DILocation(line: 25, column: 9, scope: !49)
!63 = !DILocation(line: 26, column: 9, scope: !60)
!64 = !DILocation(line: 28, column: 12, scope: !49)
!65 = !DILocation(line: 28, column: 17, scope: !49)
!66 = !DILocation(line: 28, column: 10, scope: !49)
!67 = !DILocation(line: 29, column: 5, scope: !49)
!68 = !DILocation(line: 29, column: 12, scope: !69)
!69 = !DILexicalBlockFile(scope: !49, file: !9, discriminator: 1)
!70 = !DILocation(line: 29, column: 17, scope: !69)
!71 = !DILocation(line: 29, column: 5, scope: !69)
!72 = !DILocation(line: 30, column: 14, scope: !73)
!73 = distinct !DILexicalBlock(scope: !74, file: !9, line: 30, column: 13)
!74 = distinct !DILexicalBlock(scope: !49, file: !9, line: 29, column: 25)
!75 = !DILocation(line: 30, column: 20, scope: !73)
!76 = !DILocation(line: 30, column: 13, scope: !74)
!77 = !DILocation(line: 32, column: 17, scope: !78)
!78 = distinct !DILexicalBlock(scope: !79, file: !9, line: 32, column: 17)
!79 = distinct !DILexicalBlock(scope: !73, file: !9, line: 30, column: 25)
!80 = !DILocation(line: 32, column: 23, scope: !78)
!81 = !DILocation(line: 32, column: 31, scope: !78)
!82 = !DILocation(line: 32, column: 17, scope: !79)
!83 = !DILocation(line: 33, column: 17, scope: !78)
!84 = !DILocation(line: 33, column: 23, scope: !78)
!85 = !DILocation(line: 33, column: 31, scope: !78)
!86 = !DILocation(line: 33, column: 36, scope: !78)
!87 = !DILocation(line: 33, column: 42, scope: !78)
!88 = !DILocation(line: 33, column: 47, scope: !78)
!89 = !DILocation(line: 33, column: 53, scope: !78)
!90 = !DILocation(line: 33, column: 57, scope: !78)
!91 = !DILocation(line: 33, column: 63, scope: !78)
!92 = !DILocation(line: 34, column: 9, scope: !79)
!93 = !DILocation(line: 36, column: 16, scope: !74)
!94 = !DILocation(line: 36, column: 22, scope: !74)
!95 = !DILocation(line: 36, column: 14, scope: !74)
!96 = !DILocation(line: 37, column: 21, scope: !74)
!97 = !DILocation(line: 37, column: 9, scope: !74)
!98 = !DILocation(line: 38, column: 16, scope: !74)
!99 = !DILocation(line: 38, column: 14, scope: !74)
!100 = !DILocation(line: 29, column: 5, scope: !101)
!101 = !DILexicalBlockFile(scope: !49, file: !9, discriminator: 2)
!102 = distinct !{!102, !67}
!103 = !DILocation(line: 41, column: 17, scope: !49)
!104 = !DILocation(line: 41, column: 5, scope: !49)
!105 = !DILocation(line: 42, column: 1, scope: !49)
!106 = !DILocation(line: 42, column: 1, scope: !69)
!107 = distinct !DISubprogram(name: "ASYNC_WAIT_CTX_set_wait_fd", scope: !9, file: !9, line: 43, type: !108, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!108 = !DISubroutineType(types: !109)
!109 = !{!26, !12, !23, !26, !4, !29}
!110 = !DILocalVariable(name: "ctx", arg: 1, scope: !107, file: !9, line: 43, type: !12)
!111 = !DILocation(line: 43, column: 48, scope: !107)
