; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--blake2--libcrypto-shlib-blake2s.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--blake2--libcrypto-shlib-blake2s.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.anon = type { i64 }
%union.anon.0 = type { i64 }
%struct.blake2s_param_st = type { i8, i8, i8, i8, [4 x i8], [6 x i8], i8, i8, [8 x i8], [8 x i8] }
%struct.blake2s_ctx_st = type { [8 x i32], [2 x i32], [2 x i32], [64 x i8], i64, i64 }

@store32.is_endian = internal constant %union.anon { i64 1 }, align 8
@blake2s_IV = internal constant [8 x i32] [i32 1779033703, i32 -1150833019, i32 1013904242, i32 -1521486534, i32 1359893119, i32 -1694144372, i32 528734635, i32 1541459225], align 16
@load32.is_endian = internal constant %union.anon.0 { i64 1 }, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !12)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--blake2--libcrypto-shlib-blake2s.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !8, !10}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !6, line: 48, baseType: !7)
!6 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!7 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !6, line: 51, baseType: !11)
!11 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!12 = !{!13, !25, !31, !40}
!13 = distinct !DIGlobalVariable(name: "is_endian", scope: !14, file: !15, line: 68, type: !18, isLocal: true, isDefinition: true, variable: %union.anon* @store32.is_endian)
!14 = distinct !DISubprogram(name: "store32", scope: !15, file: !15, line: 63, type: !16, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!15 = !DIFile(filename: "crypto/blake2/blake2_impl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!16 = !DISubroutineType(types: !17)
!17 = !{null, !4, !10}
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !15, line: 65, size: 64, align: 64, elements: !20)
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "one", scope: !19, file: !15, line: 66, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "little", scope: !19, file: !15, line: 67, baseType: !24, size: 8, align: 8)
!24 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!25 = distinct !DIGlobalVariable(name: "blake2s_IV", scope: !0, file: !26, line: 24, type: !27, isLocal: true, isDefinition: true, variable: [8 x i32]* @blake2s_IV)
!26 = !DIFile(filename: "crypto/blake2/blake2s.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 256, align: 32, elements: !29)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!29 = !{!30}
!30 = !DISubrange(count: 8)
!31 = distinct !DIGlobalVariable(name: "is_endian", scope: !32, file: !15, line: 24, type: !35, isLocal: true, isDefinition: true, variable: %union.anon.0* @load32.is_endian)
!32 = distinct !DISubprogram(name: "load32", scope: !15, file: !15, line: 19, type: !33, isLocal: true, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!33 = !DISubroutineType(types: !34)
!34 = !{!10, !8}
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !32, file: !15, line: 21, size: 64, align: 64, elements: !37)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "one", scope: !36, file: !15, line: 22, baseType: !22, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "little", scope: !36, file: !15, line: 23, baseType: !24, size: 8, align: 8)
!40 = distinct !DIGlobalVariable(name: "blake2s_sigma", scope: !0, file: !26, line: 30, type: !41, isLocal: true, isDefinition: true, variable: [10 x [16 x i8]]* @blake2s_sigma)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1280, align: 8, elements: !42)
!42 = !{!43, !44}
!43 = !DISubrange(count: 10)
!44 = !DISubrange(count: 16)
!45 = !{i32 2, !"Dwarf Version", i32 4}
!46 = !{i32 2, !"Debug Info Version", i32 3}
!47 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!48 = distinct !DISubprogram(name: "blake2s_param_init", scope: !26, file: !26, line: 79, type: !49, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !51}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLAKE2S_PARAM", file: !53, line: 44, baseType: !54)
!53 = !DIFile(filename: "crypto/blake2/blake2_locl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blake2s_param_st", file: !53, line: 31, size: 256, align: 8, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !64, !68, !69, !70, !72}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "digest_length", scope: !54, file: !53, line: 32, baseType: !5, size: 8, align: 8)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "key_length", scope: !54, file: !53, line: 33, baseType: !5, size: 8, align: 8, offset: 8)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "fanout", scope: !54, file: !53, line: 34, baseType: !5, size: 8, align: 8, offset: 16)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !54, file: !53, line: 35, baseType: !5, size: 8, align: 8, offset: 24)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "leaf_length", scope: !54, file: !53, line: 36, baseType: !61, size: 32, align: 8, offset: 32)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 32, align: 8, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 4)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "node_offset", scope: !54, file: !53, line: 37, baseType: !65, size: 48, align: 8, offset: 64)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 48, align: 8, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 6)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "node_depth", scope: !54, file: !53, line: 38, baseType: !5, size: 8, align: 8, offset: 112)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "inner_length", scope: !54, file: !53, line: 39, baseType: !5, size: 8, align: 8, offset: 120)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "salt", scope: !54, file: !53, line: 40, baseType: !71, size: 64, align: 8, offset: 128)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, align: 8, elements: !29)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "personal", scope: !54, file: !53, line: 41, baseType: !71, size: 64, align: 8, offset: 192)
!73 = !DILocalVariable(name: "P", arg: 1, scope: !48, file: !26, line: 79, type: !51)
!74 = !DIExpression()
!75 = !DILocation(line: 79, column: 40, scope: !48)
!76 = !DILocation(line: 81, column: 5, scope: !48)
!77 = !DILocation(line: 81, column: 8, scope: !48)
!78 = !DILocation(line: 81, column: 22, scope: !48)
!79 = !DILocation(line: 82, column: 5, scope: !48)
!80 = !DILocation(line: 82, column: 8, scope: !48)
!81 = !DILocation(line: 82, column: 19, scope: !48)
!82 = !DILocation(line: 83, column: 5, scope: !48)
!83 = !DILocation(line: 83, column: 8, scope: !48)
!84 = !DILocation(line: 83, column: 15, scope: !48)
!85 = !DILocation(line: 84, column: 5, scope: !48)
!86 = !DILocation(line: 84, column: 8, scope: !48)
!87 = !DILocation(line: 84, column: 14, scope: !48)
!88 = !DILocation(line: 85, column: 13, scope: !48)
!89 = !DILocation(line: 85, column: 16, scope: !48)
!90 = !DILocation(line: 85, column: 5, scope: !48)
!91 = !DILocation(line: 86, column: 13, scope: !48)
!92 = !DILocation(line: 86, column: 16, scope: !48)
!93 = !DILocation(line: 86, column: 5, scope: !48)
!94 = !DILocation(line: 87, column: 5, scope: !48)
!95 = !DILocation(line: 87, column: 8, scope: !48)
!96 = !DILocation(line: 87, column: 19, scope: !48)
!97 = !DILocation(line: 88, column: 5, scope: !48)
!98 = !DILocation(line: 88, column: 8, scope: !48)
!99 = !DILocation(line: 88, column: 21, scope: !48)
!100 = !DILocation(line: 89, column: 12, scope: !48)
!101 = !DILocation(line: 89, column: 15, scope: !48)
!102 = !DILocation(line: 89, column: 5, scope: !48)
!103 = !DILocation(line: 90, column: 12, scope: !48)
!104 = !DILocation(line: 90, column: 15, scope: !48)
!105 = !DILocation(line: 90, column: 5, scope: !48)
!106 = !DILocation(line: 91, column: 1, scope: !48)
!107 = !DILocalVariable(name: "dst", arg: 1, scope: !14, file: !15, line: 63, type: !4)
!108 = !DILocation(line: 63, column: 37, scope: !14)
!109 = !DILocalVariable(name: "w", arg: 2, scope: !14, file: !15, line: 63, type: !10)
!110 = !DILocation(line: 63, column: 51, scope: !14)
!111 = !DILocation(line: 70, column: 19, scope: !112)
!112 = distinct !DILexicalBlock(scope: !14, file: !15, line: 70, column: 9)
!113 = !DILocation(line: 70, column: 9, scope: !112)
!114 = !DILocation(line: 70, column: 9, scope: !14)
!115 = !DILocation(line: 71, column: 16, scope: !116)
!116 = distinct !DILexicalBlock(scope: !112, file: !15, line: 70, column: 27)
!117 = !DILocation(line: 71, column: 9, scope: !116)
!118 = !DILocation(line: 72, column: 5, scope: !116)
!119 = !DILocalVariable(name: "p", scope: !120, file: !15, line: 73, type: !4)
!120 = distinct !DILexicalBlock(scope: !112, file: !15, line: 72, column: 12)
!121 = !DILocation(line: 73, column: 18, scope: !120)
!122 = !DILocation(line: 73, column: 33, scope: !120)
!123 = !DILocalVariable(name: "i", scope: !120, file: !15, line: 74, type: !124)
!124 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!125 = !DILocation(line: 74, column: 13, scope: !120)
!126 = !DILocation(line: 76, column: 16, scope: !127)
!127 = distinct !DILexicalBlock(scope: !120, file: !15, line: 76, column: 9)
!128 = !DILocation(line: 76, column: 14, scope: !127)
!129 = !DILocation(line: 76, column: 21, scope: !130)
!130 = !DILexicalBlockFile(scope: !131, file: !15, discriminator: 1)
!131 = distinct !DILexicalBlock(scope: !127, file: !15, line: 76, column: 9)
!132 = !DILocation(line: 76, column: 23, scope: !130)
!133 = !DILocation(line: 76, column: 9, scope: !130)
!134 = !DILocation(line: 77, column: 30, scope: !131)
!135 = !DILocation(line: 77, column: 40, scope: !131)
!136 = !DILocation(line: 77, column: 38, scope: !131)
!137 = !DILocation(line: 77, column: 32, scope: !131)
!138 = !DILocation(line: 77, column: 20, scope: !131)
!139 = !DILocation(line: 77, column: 15, scope: !131)
!140 = !DILocation(line: 77, column: 13, scope: !131)
!141 = !DILocation(line: 77, column: 18, scope: !131)
!142 = !DILocation(line: 76, column: 29, scope: !143)
!143 = !DILexicalBlockFile(scope: !131, file: !15, discriminator: 2)
!144 = !DILocation(line: 76, column: 9, scope: !143)
!145 = distinct !{!145, !146}
!146 = !DILocation(line: 76, column: 9, scope: !120)
!147 = !DILocation(line: 79, column: 1, scope: !14)
!148 = distinct !DISubprogram(name: "store48", scope: !15, file: !15, line: 110, type: !149, isLocal: true, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !4, !151}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !6, line: 55, baseType: !152)
!152 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!153 = !DILocalVariable(name: "dst", arg: 1, scope: !148, file: !15, line: 110, type: !4)
!154 = !DILocation(line: 110, column: 37, scope: !148)
!155 = !DILocalVariable(name: "w", arg: 2, scope: !148, file: !15, line: 110, type: !151)
!156 = !DILocation(line: 110, column: 51, scope: !148)
!157 = !DILocalVariable(name: "p", scope: !148, file: !15, line: 112, type: !4)
!158 = !DILocation(line: 112, column: 14, scope: !148)
!159 = !DILocation(line: 112, column: 29, scope: !148)
!160 = !DILocation(line: 113, column: 21, scope: !148)
!161 = !DILocation(line: 113, column: 12, scope: !148)
!162 = !DILocation(line: 113, column: 5, scope: !148)
!163 = !DILocation(line: 113, column: 10, scope: !148)
!164 = !DILocation(line: 114, column: 22, scope: !148)
!165 = !DILocation(line: 114, column: 23, scope: !148)
!166 = !DILocation(line: 114, column: 12, scope: !148)
!167 = !DILocation(line: 114, column: 5, scope: !148)
!168 = !DILocation(line: 114, column: 10, scope: !148)
!169 = !DILocation(line: 115, column: 22, scope: !148)
!170 = !DILocation(line: 115, column: 23, scope: !148)
!171 = !DILocation(line: 115, column: 12, scope: !148)
!172 = !DILocation(line: 115, column: 5, scope: !148)
!173 = !DILocation(line: 115, column: 10, scope: !148)
!174 = !DILocation(line: 116, column: 22, scope: !148)
!175 = !DILocation(line: 116, column: 23, scope: !148)
!176 = !DILocation(line: 116, column: 12, scope: !148)
!177 = !DILocation(line: 116, column: 5, scope: !148)
!178 = !DILocation(line: 116, column: 10, scope: !148)
!179 = !DILocation(line: 117, column: 22, scope: !148)
!180 = !DILocation(line: 117, column: 23, scope: !148)
!181 = !DILocation(line: 117, column: 12, scope: !148)
!182 = !DILocation(line: 117, column: 5, scope: !148)
!183 = !DILocation(line: 117, column: 10, scope: !148)
!184 = !DILocation(line: 118, column: 22, scope: !148)
!185 = !DILocation(line: 118, column: 23, scope: !148)
!186 = !DILocation(line: 118, column: 12, scope: !148)
!187 = !DILocation(line: 118, column: 5, scope: !148)
!188 = !DILocation(line: 118, column: 10, scope: !148)
!189 = !DILocation(line: 119, column: 1, scope: !148)
!190 = distinct !DISubprogram(name: "blake2s_param_set_digest_length", scope: !26, file: !26, line: 93, type: !191, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !51, !5}
!193 = !DILocalVariable(name: "P", arg: 1, scope: !190, file: !26, line: 93, type: !51)
!194 = !DILocation(line: 93, column: 53, scope: !190)
!195 = !DILocalVariable(name: "outlen", arg: 2, scope: !190, file: !26, line: 93, type: !5)
!196 = !DILocation(line: 93, column: 64, scope: !190)
!197 = !DILocation(line: 95, column: 24, scope: !190)
!198 = !DILocation(line: 95, column: 5, scope: !190)
!199 = !DILocation(line: 95, column: 8, scope: !190)
!200 = !DILocation(line: 95, column: 22, scope: !190)
!201 = !DILocation(line: 96, column: 1, scope: !190)
!202 = distinct !DISubprogram(name: "blake2s_param_set_key_length", scope: !26, file: !26, line: 98, type: !191, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!203 = !DILocalVariable(name: "P", arg: 1, scope: !202, file: !26, line: 98, type: !51)
!204 = !DILocation(line: 98, column: 50, scope: !202)
!205 = !DILocalVariable(name: "keylen", arg: 2, scope: !202, file: !26, line: 98, type: !5)
!206 = !DILocation(line: 98, column: 61, scope: !202)
!207 = !DILocation(line: 100, column: 21, scope: !202)
!208 = !DILocation(line: 100, column: 5, scope: !202)
!209 = !DILocation(line: 100, column: 8, scope: !202)
!210 = !DILocation(line: 100, column: 19, scope: !202)
!211 = !DILocation(line: 101, column: 1, scope: !202)
!212 = distinct !DISubprogram(name: "blake2s_param_set_personal", scope: !26, file: !26, line: 103, type: !213, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !51, !8, !215}
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !216, line: 216, baseType: !152)
!216 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!217 = !DILocalVariable(name: "P", arg: 1, scope: !212, file: !26, line: 103, type: !51)
!218 = !DILocation(line: 103, column: 48, scope: !212)
!219 = !DILocalVariable(name: "personal", arg: 2, scope: !212, file: !26, line: 103, type: !8)
!220 = !DILocation(line: 103, column: 66, scope: !212)
!221 = !DILocalVariable(name: "len", arg: 3, scope: !212, file: !26, line: 103, type: !215)
!222 = !DILocation(line: 103, column: 83, scope: !212)
!223 = !DILocation(line: 105, column: 12, scope: !212)
!224 = !DILocation(line: 105, column: 15, scope: !212)
!225 = !DILocation(line: 105, column: 5, scope: !212)
!226 = !DILocation(line: 105, column: 25, scope: !212)
!227 = !DILocation(line: 105, column: 35, scope: !212)
!228 = !DILocation(line: 106, column: 12, scope: !212)
!229 = !DILocation(line: 106, column: 15, scope: !212)
!230 = !DILocation(line: 106, column: 26, scope: !212)
!231 = !DILocation(line: 106, column: 24, scope: !212)
!232 = !DILocation(line: 106, column: 38, scope: !212)
!233 = !DILocation(line: 106, column: 36, scope: !212)
!234 = !DILocation(line: 106, column: 5, scope: !212)
!235 = !DILocation(line: 107, column: 1, scope: !212)
!236 = distinct !DISubprogram(name: "blake2s_param_set_salt", scope: !26, file: !26, line: 109, type: !213, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!237 = !DILocalVariable(name: "P", arg: 1, scope: !236, file: !26, line: 109, type: !51)
!238 = !DILocation(line: 109, column: 44, scope: !236)
!239 = !DILocalVariable(name: "salt", arg: 2, scope: !236, file: !26, line: 109, type: !8)
!240 = !DILocation(line: 109, column: 62, scope: !236)
!241 = !DILocalVariable(name: "len", arg: 3, scope: !236, file: !26, line: 109, type: !215)
!242 = !DILocation(line: 109, column: 75, scope: !236)
!243 = !DILocation(line: 111, column: 12, scope: !236)
!244 = !DILocation(line: 111, column: 15, scope: !236)
!245 = !DILocation(line: 111, column: 5, scope: !236)
!246 = !DILocation(line: 111, column: 21, scope: !236)
!247 = !DILocation(line: 111, column: 27, scope: !236)
!248 = !DILocation(line: 112, column: 12, scope: !236)
!249 = !DILocation(line: 112, column: 15, scope: !236)
!250 = !DILocation(line: 112, column: 22, scope: !236)
!251 = !DILocation(line: 112, column: 20, scope: !236)
!252 = !DILocation(line: 112, column: 34, scope: !236)
!253 = !DILocation(line: 112, column: 32, scope: !236)
!254 = !DILocation(line: 112, column: 5, scope: !236)
!255 = !DILocation(line: 112, column: 39, scope: !236)
!256 = distinct !DISubprogram(name: "BLAKE2s_Init", scope: !26, file: !26, line: 118, type: !257, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!257 = !DISubroutineType(types: !258)
!258 = !{!124, !259, !276}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLAKE2S_CTX", file: !53, line: 83, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blake2s_ctx_st", file: !53, line: 46, size: 1024, align: 64, elements: !262)
!262 = !{!263, !265, !269, !270, !274, !275}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !261, file: !53, line: 47, baseType: !264, size: 256, align: 32)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 256, align: 32, elements: !29)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !261, file: !53, line: 48, baseType: !266, size: 64, align: 32, offset: 256)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, align: 32, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 2)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !261, file: !53, line: 49, baseType: !266, size: 64, align: 32, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !261, file: !53, line: 50, baseType: !271, size: 512, align: 8, offset: 384)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 512, align: 8, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !261, file: !53, line: 51, baseType: !215, size: 64, align: 64, offset: 896)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "outlen", scope: !261, file: !53, line: 52, baseType: !215, size: 64, align: 64, offset: 960)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!278 = !DILocalVariable(name: "c", arg: 1, scope: !256, file: !26, line: 118, type: !259)
!279 = !DILocation(line: 118, column: 31, scope: !256)
!280 = !DILocalVariable(name: "P", arg: 2, scope: !256, file: !26, line: 118, type: !276)
!281 = !DILocation(line: 118, column: 55, scope: !256)
!282 = !DILocation(line: 120, column: 24, scope: !256)
!283 = !DILocation(line: 120, column: 27, scope: !256)
!284 = !DILocation(line: 120, column: 5, scope: !256)
!285 = !DILocation(line: 121, column: 5, scope: !256)
!286 = distinct !DISubprogram(name: "blake2s_init_param", scope: !26, file: !26, line: 62, type: !287, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !259, !276}
!289 = !DILocalVariable(name: "S", arg: 1, scope: !286, file: !26, line: 62, type: !259)
!290 = !DILocation(line: 62, column: 45, scope: !286)
!291 = !DILocalVariable(name: "P", arg: 2, scope: !286, file: !26, line: 62, type: !276)
!292 = !DILocation(line: 62, column: 69, scope: !286)
!293 = !DILocalVariable(name: "i", scope: !286, file: !26, line: 64, type: !215)
!294 = !DILocation(line: 64, column: 12, scope: !286)
!295 = !DILocalVariable(name: "p", scope: !286, file: !26, line: 65, type: !8)
!296 = !DILocation(line: 65, column: 20, scope: !286)
!297 = !DILocation(line: 65, column: 42, scope: !286)
!298 = !DILocation(line: 65, column: 24, scope: !286)
!299 = !DILocation(line: 67, column: 19, scope: !286)
!300 = !DILocation(line: 67, column: 5, scope: !286)
!301 = !DILocation(line: 68, column: 17, scope: !286)
!302 = !DILocation(line: 68, column: 20, scope: !286)
!303 = !DILocation(line: 68, column: 5, scope: !286)
!304 = !DILocation(line: 68, column: 8, scope: !286)
!305 = !DILocation(line: 68, column: 15, scope: !286)
!306 = !DILocation(line: 74, column: 12, scope: !307)
!307 = distinct !DILexicalBlock(scope: !286, file: !26, line: 74, column: 5)
!308 = !DILocation(line: 74, column: 10, scope: !307)
!309 = !DILocation(line: 74, column: 17, scope: !310)
!310 = !DILexicalBlockFile(scope: !311, file: !26, discriminator: 1)
!311 = distinct !DILexicalBlock(scope: !307, file: !26, line: 74, column: 5)
!312 = !DILocation(line: 74, column: 19, scope: !310)
!313 = !DILocation(line: 74, column: 5, scope: !310)
!314 = !DILocation(line: 75, column: 30, scope: !315)
!315 = distinct !DILexicalBlock(scope: !311, file: !26, line: 74, column: 29)
!316 = !DILocation(line: 75, column: 31, scope: !315)
!317 = !DILocation(line: 75, column: 28, scope: !315)
!318 = !DILocation(line: 75, column: 20, scope: !315)
!319 = !DILocation(line: 75, column: 14, scope: !315)
!320 = !DILocation(line: 75, column: 9, scope: !315)
!321 = !DILocation(line: 75, column: 12, scope: !315)
!322 = !DILocation(line: 75, column: 17, scope: !315)
!323 = !DILocation(line: 76, column: 5, scope: !315)
!324 = !DILocation(line: 74, column: 24, scope: !325)
!325 = !DILexicalBlockFile(scope: !311, file: !26, discriminator: 2)
!326 = !DILocation(line: 74, column: 5, scope: !325)
!327 = distinct !{!327, !328}
!328 = !DILocation(line: 74, column: 5, scope: !286)
!329 = !DILocation(line: 77, column: 1, scope: !286)
!330 = distinct !DISubprogram(name: "BLAKE2s_Init_key", scope: !26, file: !26, line: 128, type: !331, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!331 = !DISubroutineType(types: !332)
!332 = !{!124, !259, !276, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!335 = !DILocalVariable(name: "c", arg: 1, scope: !330, file: !26, line: 128, type: !259)
