; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--asn1_encode_test-bin-asn1_encode_test.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--asn1_encode_test-bin-asn1_encode_test.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TEST_PACKAGE = type { %struct.ASN1_ITEM_st*, i8*, i32, i8*, i64, i64, i8*, i64, i64, i32 (i8*, i8**)*, i8* (i8**, i8**, i64)*, void (i8*)* }
%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.TEST_CUSTOM_DATA = type { i8*, i64, i8*, i64 }
%struct.bio_st = type opaque
%struct.ASN1_LONG_DATA = type { i32, i64, i64 }
%struct.ASN1_INT32_DATA = type { i32, i32, i32 }
%struct.ASN1_UINT32_DATA = type { i32, i32, i32 }
%struct.ASN1_INT64_DATA = type { i32, i64, i64 }
%struct.ASN1_UINT64_DATA = type { i32, i64, i64 }
%struct.EXPECTED = type { i32, [1 x i8] }
%struct.ASN1_VALUE_st = type opaque
%struct.asn1_pctx_st = type opaque

@.str = private unnamed_addr constant [16 x i8] c"test_long_32bit\00", align 1
@.str.1 = private unnamed_addr constant [16 x i8] c"test_long_64bit\00", align 1
@.str.2 = private unnamed_addr constant [11 x i8] c"test_int32\00", align 1
@.str.3 = private unnamed_addr constant [12 x i8] c"test_uint32\00", align 1
@.str.4 = private unnamed_addr constant [11 x i8] c"test_int64\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !71)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--asn1_encode_test-bin-asn1_encode_test.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !18, !19, !20, !15, !12, !23, !27, !35, !36, !45, !55, !63}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXPECTED", file: !6, line: 475, baseType: !7)
!6 = !DIFile(filename: "test/asn1_encode_test.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 472, size: 64, align: 32, elements: !8)
!8 = !{!9, !13}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "success", scope: !7, file: !6, line: 473, baseType: !10, size: 32, align: 32)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !11, line: 56, baseType: !12)
!11 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !7, file: !6, line: 474, baseType: !14, size: 8, align: 8, offset: 32)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, align: 8, elements: !16)
!15 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!16 = !{!17}
!17 = !DISubrange(count: 1)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !21, line: 216, baseType: !22)
!21 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!22 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !25, line: 213, baseType: !26)
!25 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !25, line: 213, flags: DIFlagFwdDecl)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_LONG_DATA", file: !6, line: 190, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 185, size: 192, align: 64, elements: !30)
!30 = !{!31, !32, !34}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "success", scope: !29, file: !6, line: 187, baseType: !10, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "test_long", scope: !29, file: !6, line: 188, baseType: !33, size: 64, align: 64, offset: 64)
!33 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "test_zlong", scope: !29, file: !6, line: 189, baseType: !33, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INT32_DATA", file: !6, line: 280, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 276, size: 96, align: 32, elements: !39)
!39 = !{!40, !41, !44}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "success", scope: !38, file: !6, line: 277, baseType: !10, size: 32, align: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "test_int32", scope: !38, file: !6, line: 278, baseType: !42, size: 32, align: 32, offset: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !43, line: 196, baseType: !12)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!44 = !DIDerivedType(tag: DW_TAG_member, name: "test_zint32", scope: !38, file: !6, line: 279, baseType: !42, size: 32, align: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UINT32_DATA", file: !6, line: 328, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 324, size: 96, align: 32, elements: !48)
!48 = !{!49, !50, !54}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "success", scope: !47, file: !6, line: 325, baseType: !10, size: 32, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "test_uint32", scope: !47, file: !6, line: 326, baseType: !51, size: 32, align: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !52, line: 51, baseType: !53)
!52 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!53 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "test_zuint32", scope: !47, file: !6, line: 327, baseType: !51, size: 32, align: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INT64_DATA", file: !6, line: 376, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 372, size: 192, align: 64, elements: !58)
!58 = !{!59, !60, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "success", scope: !57, file: !6, line: 373, baseType: !10, size: 32, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "test_int64", scope: !57, file: !6, line: 374, baseType: !61, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !43, line: 197, baseType: !33)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "test_zint64", scope: !57, file: !6, line: 375, baseType: !61, size: 64, align: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UINT64_DATA", file: !6, line: 425, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 421, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "success", scope: !65, file: !6, line: 422, baseType: !10, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "test_uint64", scope: !65, file: !6, line: 423, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !52, line: 55, baseType: !22)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "test_zuint64", scope: !65, file: !6, line: 424, baseType: !69, size: 64, align: 64, offset: 128)
!71 = !{!72, !90, !94, !95, !96, !100, !101, !105, !109, !110, !114, !115, !116, !117, !121, !122, !123, !124, !125, !126, !184, !185, !187, !189, !193, !194, !195, !196, !197, !198, !199, !201, !205, !206, !207, !208, !210, !212, !213, !214, !215, !217, !221, !222, !223, !224, !226}
!72 = distinct !DIGlobalVariable(name: "t_true", scope: !73, file: !6, line: 598, type: !86, isLocal: true, isDefinition: true, variable: [3 x i8]* @make_custom_der.t_true)
!73 = distinct !DISubprogram(name: "make_custom_der", scope: !6, file: !6, line: 594, type: !74, isLocal: true, isDefinition: true, scopeLine: 596, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!74 = !DISubroutineType(types: !75)
!75 = !{!20, !76, !85, !12}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEST_CUSTOM_DATA", file: !6, line: 95, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 90, size: 256, align: 64, elements: !80)
!80 = !{!81, !82, !83, !84}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "bytes1", scope: !79, file: !6, line: 91, baseType: !18, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes1", scope: !79, file: !6, line: 92, baseType: !20, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "bytes2", scope: !79, file: !6, line: 93, baseType: !18, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes2", scope: !79, file: !6, line: 94, baseType: !20, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 24, align: 8, elements: !88)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!88 = !{!89}
!89 = !DISubrange(count: 3)
!90 = distinct !DIGlobalVariable(name: "test_custom_data", scope: !0, file: !6, line: 100, type: !91, isLocal: true, isDefinition: true, variable: [34 x %struct.TEST_CUSTOM_DATA]* @test_custom_data)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 8704, align: 64, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 34)
!94 = distinct !DIGlobalVariable(name: "t_zero", scope: !0, file: !6, line: 35, type: !14, isLocal: true, isDefinition: true, variable: [1 x i8]* @t_zero)
!95 = distinct !DIGlobalVariable(name: "t_one", scope: !0, file: !6, line: 38, type: !14, isLocal: true, isDefinition: true, variable: [1 x i8]* @t_one)
!96 = distinct !DIGlobalVariable(name: "t_longundef", scope: !0, file: !6, line: 47, type: !97, isLocal: true, isDefinition: true, variable: [4 x i8]* @t_longundef)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 32, align: 8, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 4)
!100 = distinct !DIGlobalVariable(name: "t_one_neg", scope: !0, file: !6, line: 41, type: !14, isLocal: true, isDefinition: true, variable: [1 x i8]* @t_one_neg)
!101 = distinct !DIGlobalVariable(name: "t_minus_256", scope: !0, file: !6, line: 44, type: !102, isLocal: true, isDefinition: true, variable: [2 x i8]* @t_minus_256)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 16, align: 8, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 2)
!105 = distinct !DIGlobalVariable(name: "t_9bytes_1", scope: !0, file: !6, line: 50, type: !106, isLocal: true, isDefinition: true, variable: [9 x i8]* @t_9bytes_1)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 72, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 9)
!109 = distinct !DIGlobalVariable(name: "t_8bytes_1", scope: !0, file: !6, line: 53, type: !106, isLocal: true, isDefinition: true, variable: [9 x i8]* @t_8bytes_1)
!110 = distinct !DIGlobalVariable(name: "t_8bytes_2", scope: !0, file: !6, line: 56, type: !111, isLocal: true, isDefinition: true, variable: [8 x i8]* @t_8bytes_2)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, align: 8, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 8)
!114 = distinct !DIGlobalVariable(name: "t_8bytes_3_pad", scope: !0, file: !6, line: 59, type: !106, isLocal: true, isDefinition: true, variable: [9 x i8]* @t_8bytes_3_pad)
!115 = distinct !DIGlobalVariable(name: "t_8bytes_4_neg", scope: !0, file: !6, line: 62, type: !111, isLocal: true, isDefinition: true, variable: [8 x i8]* @t_8bytes_4_neg)
!116 = distinct !DIGlobalVariable(name: "t_8bytes_5_negpad", scope: !0, file: !6, line: 65, type: !106, isLocal: true, isDefinition: true, variable: [9 x i8]* @t_8bytes_5_negpad)
!117 = distinct !DIGlobalVariable(name: "t_5bytes_1", scope: !0, file: !6, line: 70, type: !118, isLocal: true, isDefinition: true, variable: [5 x i8]* @t_5bytes_1)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 40, align: 8, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 5)
!121 = distinct !DIGlobalVariable(name: "t_4bytes_1", scope: !0, file: !6, line: 73, type: !118, isLocal: true, isDefinition: true, variable: [5 x i8]* @t_4bytes_1)
!122 = distinct !DIGlobalVariable(name: "t_4bytes_2", scope: !0, file: !6, line: 77, type: !97, isLocal: true, isDefinition: true, variable: [4 x i8]* @t_4bytes_2)
!123 = distinct !DIGlobalVariable(name: "t_4bytes_3_pad", scope: !0, file: !6, line: 80, type: !118, isLocal: true, isDefinition: true, variable: [5 x i8]* @t_4bytes_3_pad)
!124 = distinct !DIGlobalVariable(name: "t_4bytes_4_neg", scope: !0, file: !6, line: 83, type: !97, isLocal: true, isDefinition: true, variable: [4 x i8]* @t_4bytes_4_neg)
!125 = distinct !DIGlobalVariable(name: "t_4bytes_5_negpad", scope: !0, file: !6, line: 86, type: !118, isLocal: true, isDefinition: true, variable: [5 x i8]* @t_4bytes_5_negpad)
!126 = distinct !DIGlobalVariable(name: "long_test_package_32bit", scope: !0, file: !6, line: 227, type: !127, isLocal: true, isDefinition: true, variable: %struct.TEST_PACKAGE* @long_test_package_32bit)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEST_PACKAGE", file: !6, line: 170, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 146, size: 768, align: 64, elements: !129)
!129 = !{!130, !160, !161, !162, !163, !164, !165, !166, !167, !168, !173, !179}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_type", scope: !128, file: !6, line: 147, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !25, line: 318, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !11, line: 62, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !136, line: 580, size: 448, align: 64, elements: !137)
!136 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!137 = !{!138, !140, !141, !154, !155, !158, !159}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !135, file: !136, line: 581, baseType: !139, size: 8, align: 8)
!139 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !135, file: !136, line: 583, baseType: !33, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !135, file: !136, line: 584, baseType: !142, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !25, line: 210, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !136, line: 468, size: 320, align: 64, elements: !146)
!146 = !{!147, !148, !149, !150, !153}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !145, file: !136, line: 469, baseType: !22, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !145, file: !136, line: 470, baseType: !33, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !145, file: !136, line: 471, baseType: !22, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !145, file: !136, line: 472, baseType: !151, size: 64, align: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !145, file: !136, line: 473, baseType: !131, size: 64, align: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !135, file: !136, line: 586, baseType: !33, size: 64, align: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !135, file: !136, line: 587, baseType: !156, size: 64, align: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !135, file: !136, line: 588, baseType: !33, size: 64, align: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !135, file: !136, line: 589, baseType: !151, size: 64, align: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !6, line: 148, baseType: !151, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !128, file: !6, line: 149, baseType: !12, size: 32, align: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "encode_expectations", scope: !128, file: !6, line: 152, baseType: !19, size: 64, align: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "encode_expectations_size", scope: !128, file: !6, line: 153, baseType: !20, size: 64, align: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "encode_expectations_elem_size", scope: !128, file: !6, line: 154, baseType: !20, size: 64, align: 64, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "encdec_data", scope: !128, file: !6, line: 160, baseType: !19, size: 64, align: 64, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "encdec_data_size", scope: !128, file: !6, line: 161, baseType: !20, size: 64, align: 64, offset: 448)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "encdec_data_elem_size", scope: !128, file: !6, line: 162, baseType: !20, size: 64, align: 64, offset: 512)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i2d", scope: !128, file: !6, line: 165, baseType: !169, size: 64, align: 64, offset: 576)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2d_fn", file: !6, line: 143, baseType: !171)
!171 = !DISubroutineType(types: !172)
!172 = !{!12, !19, !85}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "d2i", scope: !128, file: !6, line: 167, baseType: !174, size: 64, align: 64, offset: 640)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "d2i_fn", file: !6, line: 144, baseType: !176)
!176 = !DISubroutineType(types: !177)
!177 = !{!19, !178, !85, !33}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ifree", scope: !128, file: !6, line: 169, baseType: !180, size: 64, align: 64, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifree_fn", file: !6, line: 145, baseType: !182)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !19}
!184 = distinct !DIGlobalVariable(name: "ASN1_LONG_DATA_it", scope: !0, file: !6, line: 196, type: !133, isLocal: true, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_LONG_DATA_it)
!185 = distinct !DIGlobalVariable(name: "ASN1_LONG_DATA_seq_tt", scope: !0, file: !6, line: 192, type: !186, isLocal: true, isDefinition: true, variable: [3 x %struct.ASN1_TEMPLATE_st]* @ASN1_LONG_DATA_seq_tt)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 960, align: 64, elements: !88)
!187 = distinct !DIGlobalVariable(name: "long_expected_32bit", scope: !0, file: !6, line: 201, type: !188, isLocal: true, isDefinition: true, variable: [34 x %struct.ASN1_LONG_DATA]* @long_expected_32bit)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6528, align: 64, elements: !92)
!189 = distinct !DIGlobalVariable(name: "long_encdec_data_32bit", scope: !0, file: !6, line: 221, type: !190, isLocal: true, isDefinition: true, variable: [12 x %struct.ASN1_LONG_DATA]* @long_encdec_data_32bit)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 2304, align: 64, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 12)
!193 = distinct !DIGlobalVariable(name: "long_test_package_64bit", scope: !0, file: !6, line: 263, type: !127, isLocal: true, isDefinition: true, variable: %struct.TEST_PACKAGE* @long_test_package_64bit)
!194 = distinct !DIGlobalVariable(name: "long_expected_64bit", scope: !0, file: !6, line: 237, type: !188, isLocal: true, isDefinition: true, variable: [34 x %struct.ASN1_LONG_DATA]* @long_expected_64bit)
!195 = distinct !DIGlobalVariable(name: "long_encdec_data_64bit", scope: !0, file: !6, line: 257, type: !190, isLocal: true, isDefinition: true, variable: [12 x %struct.ASN1_LONG_DATA]* @long_encdec_data_64bit)
!196 = distinct !DIGlobalVariable(name: "int32_test_package", scope: !0, file: !6, line: 314, type: !127, isLocal: true, isDefinition: true, variable: %struct.TEST_PACKAGE* @int32_test_package)
!197 = distinct !DIGlobalVariable(name: "ASN1_INT32_DATA_it", scope: !0, file: !6, line: 286, type: !133, isLocal: true, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_INT32_DATA_it)
!198 = distinct !DIGlobalVariable(name: "ASN1_INT32_DATA_seq_tt", scope: !0, file: !6, line: 282, type: !186, isLocal: true, isDefinition: true, variable: [3 x %struct.ASN1_TEMPLATE_st]* @ASN1_INT32_DATA_seq_tt)
!199 = distinct !DIGlobalVariable(name: "int32_expected", scope: !0, file: !6, line: 291, type: !200, isLocal: true, isDefinition: true, variable: [34 x %struct.ASN1_INT32_DATA]* @int32_expected)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 3264, align: 32, elements: !92)
!201 = distinct !DIGlobalVariable(name: "int32_encdec_data", scope: !0, file: !6, line: 310, type: !202, isLocal: true, isDefinition: true, variable: [10 x %struct.ASN1_INT32_DATA]* @int32_encdec_data)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 960, align: 32, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 10)
!205 = distinct !DIGlobalVariable(name: "uint32_test_package", scope: !0, file: !6, line: 362, type: !127, isLocal: true, isDefinition: true, variable: %struct.TEST_PACKAGE* @uint32_test_package)
!206 = distinct !DIGlobalVariable(name: "ASN1_UINT32_DATA_it", scope: !0, file: !6, line: 334, type: !133, isLocal: true, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_UINT32_DATA_it)
!207 = distinct !DIGlobalVariable(name: "ASN1_UINT32_DATA_seq_tt", scope: !0, file: !6, line: 330, type: !186, isLocal: true, isDefinition: true, variable: [3 x %struct.ASN1_TEMPLATE_st]* @ASN1_UINT32_DATA_seq_tt)
