; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--ui--libcrypto-shlib-ui_lib.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--ui--libcrypto-shlib-ui_lib.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ui_st = type { %struct.ui_method_st*, %struct.stack_st_UI_STRING*, i8*, %struct.crypto_ex_data_st, i32, i8* }
%struct.ui_method_st = type { i8*, i32 (%struct.ui_st*)*, i32 (%struct.ui_st*, %struct.ui_string_st*)*, i32 (%struct.ui_st*)*, i32 (%struct.ui_st*, %struct.ui_string_st*)*, i32 (%struct.ui_st*)*, i8* (%struct.ui_st*, i8*)*, void (%struct.ui_st*, i8*)*, i8* (%struct.ui_st*, i8*, i8*)*, %struct.crypto_ex_data_st }
%struct.ui_string_st = type { i32, i8*, i32, i8*, i64, %union.anon, i32 }
%union.anon = type { %struct.anon.0 }
%struct.anon.0 = type { i8*, i8*, i8* }
%struct.stack_st_UI_STRING = type opaque
%struct.crypto_ex_data_st = type { %struct.stack_st_void* }
%struct.stack_st_void = type opaque
%struct.stack_st = type opaque
%struct.anon = type { i32, i32, i8* }

@.str = private unnamed_addr constant [19 x i8] c"crypto/ui/ui_lib.c\00", align 1
@UI_construct_prompt.prompt1 = private unnamed_addr constant [7 x i8] c"Enter \00", align 1
@UI_construct_prompt.prompt2 = private unnamed_addr constant [6 x i8] c" for \00", align 1
@UI_construct_prompt.prompt3 = private unnamed_addr constant [2 x i8] c":\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !12)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--ui--libcrypto-shlib-ui_lib.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "UI_string_types", file: !4, line: 286, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "include/openssl/ui.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11}
!6 = !DIEnumerator(name: "UIT_NONE", value: 0)
!7 = !DIEnumerator(name: "UIT_PROMPT", value: 1)
!8 = !DIEnumerator(name: "UIT_VERIFY", value: 2)
!9 = !DIEnumerator(name: "UIT_BOOLEAN", value: 3)
!10 = !DIEnumerator(name: "UIT_INFO", value: 4)
!11 = !DIEnumerator(name: "UIT_ERROR", value: 5)
!12 = !{!13, !14, !24, !28, !32, !33, !35, !37, !39}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !18, !21, !13}
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !22, line: 216, baseType: !23)
!22 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!23 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !26, line: 17, baseType: !27)
!26 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !26, line: 17, flags: DIFlagFwdDecl)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !26, line: 20, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DISubroutineType(types: !31)
!31 = !{null, !13}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_UI_STRING", file: !4, line: 280, flags: DIFlagFwdDecl)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "UI_STRING", file: !4, line: 279, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ui_string_st", file: !42, line: 61, size: 576, align: 64, elements: !43)
!42 = !DIFile(filename: "crypto/ui/ui_locl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!43 = !{!44, !45, !46, !47, !48, !49, !64}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !41, file: !42, line: 62, baseType: !3, size: 32, align: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "out_string", scope: !41, file: !42, line: 63, baseType: !18, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "input_flags", scope: !41, file: !42, line: 64, baseType: !17, size: 32, align: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "result_buf", scope: !41, file: !42, line: 69, baseType: !32, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "result_len", scope: !41, file: !42, line: 74, baseType: !21, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_", scope: !41, file: !42, line: 88, baseType: !50, size: 192, align: 64, offset: 320)
!50 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !41, file: !42, line: 75, size: 192, align: 64, elements: !51)
!51 = !{!52, !58}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "string_data", scope: !50, file: !42, line: 82, baseType: !53, size: 128, align: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !42, line: 76, size: 128, align: 64, elements: !54)
!54 = !{!55, !56, !57}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "result_minsize", scope: !53, file: !42, line: 77, baseType: !17, size: 32, align: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "result_maxsize", scope: !53, file: !42, line: 79, baseType: !17, size: 32, align: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "test_buf", scope: !53, file: !42, line: 81, baseType: !18, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "boolean_data", scope: !50, file: !42, line: 87, baseType: !59, size: 192, align: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !42, line: 83, size: 192, align: 64, elements: !60)
!60 = !{!61, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "action_desc", scope: !59, file: !42, line: 84, baseType: !18, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ok_chars", scope: !59, file: !42, line: 85, baseType: !18, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "cancel_chars", scope: !59, file: !42, line: 86, baseType: !18, size: 64, align: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !41, file: !42, line: 91, baseType: !17, size: 32, align: 32, offset: 512)
!65 = !{i32 2, !"Dwarf Version", i32 4}
!66 = !{i32 2, !"Debug Info Version", i32 3}
!67 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!68 = distinct !DISubprogram(name: "UI_new", scope: !69, file: !69, line: 18, type: !70, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !122)
!69 = !DIFile(filename: "crypto/ui/ui_lib.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!70 = !DISubroutineType(types: !71)
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "UI", file: !74, line: 147, baseType: !75)
!74 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ui_st", file: !42, line: 94, size: 384, align: 64, elements: !76)
!76 = !{!77, !115, !116, !117, !118, !119}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !75, file: !42, line: 95, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "UI_METHOD", file: !74, line: 148, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ui_method_st", file: !42, line: 20, size: 640, align: 64, elements: !82)
!82 = !{!83, !84, !88, !92, !93, !94, !95, !99, !103, !107}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !81, file: !42, line: 21, baseType: !32, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ui_open_session", scope: !81, file: !42, line: 31, baseType: !85, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!17, !72}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ui_write_string", scope: !81, file: !42, line: 32, baseType: !89, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!17, !72, !39}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ui_flush", scope: !81, file: !42, line: 37, baseType: !85, size: 64, align: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ui_read_string", scope: !81, file: !42, line: 38, baseType: !89, size: 64, align: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ui_close_session", scope: !81, file: !42, line: 39, baseType: !85, size: 64, align: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ui_duplicate_data", scope: !81, file: !42, line: 44, baseType: !96, size: 64, align: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!13, !72, !13}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ui_destroy_data", scope: !81, file: !42, line: 45, baseType: !100, size: 64, align: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !72, !13}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ui_construct_prompt", scope: !81, file: !42, line: 53, baseType: !104, size: 64, align: 64, offset: 512)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!32, !72, !18, !18}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !81, file: !42, line: 58, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_EX_DATA", file: !74, line: 167, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_ex_data_st", file: !110, line: 86, size: 64, align: 64, elements: !111)
!110 = !DIFile(filename: "include/openssl/crypto.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !109, file: !110, line: 87, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_void", file: !110, line: 87, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "strings", scope: !75, file: !42, line: 96, baseType: !33, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !75, file: !42, line: 99, baseType: !13, size: 64, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !75, file: !42, line: 100, baseType: !108, size: 64, align: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !75, file: !42, line: 104, baseType: !17, size: 32, align: 32, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !75, file: !42, line: 106, baseType: !120, size: 64, align: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_RWLOCK", file: !110, line: 67, baseType: null)
!122 = !{}
!123 = !DILocation(line: 20, column: 12, scope: !68)
!124 = !DILocation(line: 20, column: 5, scope: !68)
!125 = distinct !DISubprogram(name: "UI_new_method", scope: !69, file: !69, line: 23, type: !126, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !122)
!126 = !DISubroutineType(types: !127)
!127 = !{!72, !78}
!128 = !DILocalVariable(name: "method", arg: 1, scope: !125, file: !69, line: 23, type: !78)
!129 = !DIExpression()
!130 = !DILocation(line: 23, column: 36, scope: !125)
!131 = !DILocalVariable(name: "ret", scope: !125, file: !69, line: 25, type: !72)
!132 = !DILocation(line: 25, column: 9, scope: !125)
!133 = !DILocation(line: 25, column: 15, scope: !125)
!134 = !DILocation(line: 27, column: 9, scope: !135)
!135 = distinct !DILexicalBlock(scope: !125, file: !69, line: 27, column: 9)
!136 = !DILocation(line: 27, column: 13, scope: !135)
!137 = !DILocation(line: 27, column: 9, scope: !125)
!138 = !DILocation(line: 28, column: 9, scope: !139)
!139 = distinct !DILexicalBlock(scope: !135, file: !69, line: 27, column: 21)
!140 = !DILocation(line: 29, column: 9, scope: !139)
!141 = !DILocation(line: 32, column: 17, scope: !125)
!142 = !DILocation(line: 32, column: 5, scope: !125)
!143 = !DILocation(line: 32, column: 10, scope: !125)
!144 = !DILocation(line: 32, column: 15, scope: !125)
!145 = !DILocation(line: 33, column: 9, scope: !146)
!146 = distinct !DILexicalBlock(scope: !125, file: !69, line: 33, column: 9)
!147 = !DILocation(line: 33, column: 14, scope: !146)
!148 = !DILocation(line: 33, column: 19, scope: !146)
!149 = !DILocation(line: 33, column: 9, scope: !125)
!150 = !DILocation(line: 34, column: 9, scope: !151)
!151 = distinct !DILexicalBlock(scope: !146, file: !69, line: 33, column: 27)
!152 = !DILocation(line: 35, column: 21, scope: !151)
!153 = !DILocation(line: 35, column: 9, scope: !151)
!154 = !DILocation(line: 36, column: 9, scope: !151)
!155 = !DILocation(line: 39, column: 9, scope: !156)
!156 = distinct !DILexicalBlock(scope: !125, file: !69, line: 39, column: 9)
!157 = !DILocation(line: 39, column: 16, scope: !156)
!158 = !DILocation(line: 39, column: 9, scope: !125)
!159 = !DILocation(line: 40, column: 18, scope: !156)
!160 = !DILocation(line: 40, column: 16, scope: !156)
!161 = !DILocation(line: 40, column: 9, scope: !156)
!162 = !DILocation(line: 41, column: 9, scope: !163)
!163 = distinct !DILexicalBlock(scope: !125, file: !69, line: 41, column: 9)
!164 = !DILocation(line: 41, column: 16, scope: !163)
!165 = !DILocation(line: 41, column: 9, scope: !125)
!166 = !DILocation(line: 42, column: 18, scope: !163)
!167 = !DILocation(line: 42, column: 16, scope: !163)
!168 = !DILocation(line: 42, column: 9, scope: !163)
!169 = !DILocation(line: 43, column: 17, scope: !125)
!170 = !DILocation(line: 43, column: 5, scope: !125)
!171 = !DILocation(line: 43, column: 10, scope: !125)
!172 = !DILocation(line: 43, column: 15, scope: !125)
!173 = !DILocation(line: 45, column: 33, scope: !174)
!174 = distinct !DILexicalBlock(scope: !125, file: !69, line: 45, column: 9)
!175 = !DILocation(line: 45, column: 39, scope: !174)
!176 = !DILocation(line: 45, column: 44, scope: !174)
!177 = !DILocation(line: 45, column: 10, scope: !174)
!178 = !DILocation(line: 45, column: 9, scope: !125)
!179 = !DILocation(line: 46, column: 21, scope: !180)
!180 = distinct !DILexicalBlock(scope: !174, file: !69, line: 45, column: 54)
!181 = !DILocation(line: 46, column: 9, scope: !180)
!182 = !DILocation(line: 47, column: 9, scope: !180)
!183 = !DILocation(line: 49, column: 12, scope: !125)
!184 = !DILocation(line: 49, column: 5, scope: !125)
