; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-bio_ndef.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-bio_ndef.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bio_st = type opaque
%struct.ASN1_VALUE_st = type opaque
%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.ndef_aux_st = type { %struct.ASN1_VALUE_st*, %struct.ASN1_ITEM_st*, %struct.bio_st*, %struct.bio_st*, i8**, i8* }
%struct.ASN1_AUX_st = type { i8*, i32, i32, i32, i32 (i32, %struct.ASN1_VALUE_st**, %struct.ASN1_ITEM_st*, i8*)*, i32 }
%struct.ASN1_STREAM_ARG_st = type { %struct.bio_st*, %struct.bio_st*, i8** }
%struct.bio_method_st = type opaque

@.str = private unnamed_addr constant [23 x i8] c"crypto/asn1/bio_ndef.c\00", align 1

; Function Attrs: nounwind uwtable
define %struct.bio_st* @BIO_new_NDEF(%struct.bio_st* %out, %struct.ASN1_VALUE_st* %val, %struct.ASN1_ITEM_st* %it) #0 !dbg !63 {
entry:
  %retval = alloca %struct.bio_st*, align 8
  %out.addr = alloca %struct.bio_st*, align 8
  %val.addr = alloca %struct.ASN1_VALUE_st*, align 8
  %it.addr = alloca %struct.ASN1_ITEM_st*, align 8
  %ndef_aux = alloca %struct.ndef_aux_st*, align 8
  %asn_bio = alloca %struct.bio_st*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-bio_ndef.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "NDEF_SUPPORT", file: !8, line: 43, baseType: !9)
!8 = !DIFile(filename: "crypto/asn1/bio_ndef.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndef_aux_st", file: !8, line: 31, size: 384, align: 64, elements: !10)
!10 = !{!11, !16, !50, !54, !55, !59}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !9, file: !8, line: 33, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !14, line: 213, baseType: !15)
!14 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !14, line: 213, flags: DIFlagFwdDecl)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !9, file: !8, line: 34, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !20, line: 62, baseType: !21)
!20 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !22, line: 580, size: 448, align: 64, elements: !23)
!22 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!23 = !{!24, !26, !28, !44, !45, !48, !49}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !21, file: !22, line: 581, baseType: !25, size: 8, align: 8)
!25 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !21, file: !22, line: 583, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !21, file: !22, line: 584, baseType: !29, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !14, line: 210, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !22, line: 468, size: 320, align: 64, elements: !33)
!33 = !{!34, !36, !37, !38, !41}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !32, file: !22, line: 469, baseType: !35, size: 64, align: 64)
!35 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !32, file: !22, line: 470, baseType: !27, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !32, file: !22, line: 471, baseType: !35, size: 64, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !32, file: !22, line: 472, baseType: !39, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !32, file: !22, line: 473, baseType: !42, size: 64, align: 64, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !14, line: 318, baseType: !18)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !21, file: !22, line: 586, baseType: !27, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !21, file: !22, line: 587, baseType: !46, size: 64, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !21, file: !22, line: 588, baseType: !27, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !21, file: !22, line: 589, baseType: !39, size: 64, align: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ndef_bio", scope: !9, file: !8, line: 36, baseType: !51, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !20, line: 79, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !20, line: 79, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !9, file: !8, line: 38, baseType: !51, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !9, file: !8, line: 40, baseType: !56, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "derbuf", scope: !9, file: !8, line: 42, baseType: !57, size: 64, align: 64, offset: 320)
!60 = !{i32 2, !"Dwarf Version", i32 4}
!61 = !{i32 2, !"Debug Info Version", i32 3}
!62 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!63 = distinct !DISubprogram(name: "BIO_new_NDEF", scope: !8, file: !8, line: 52, type: !64, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!64 = !DISubroutineType(types: !65)
!65 = !{!51, !51, !12, !17}
!66 = !DILocalVariable(name: "out", arg: 1, scope: !63, file: !8, line: 52, type: !51)
!67 = !DIExpression()
!68 = !DILocation(line: 52, column: 24, scope: !63)
!69 = !DILocalVariable(name: "val", arg: 2, scope: !63, file: !8, line: 52, type: !12)
!70 = !DILocation(line: 52, column: 41, scope: !63)
!71 = !DILocalVariable(name: "it", arg: 3, scope: !63, file: !8, line: 52, type: !17)
!72 = !DILocation(line: 52, column: 63, scope: !63)
!73 = !DILocalVariable(name: "ndef_aux", scope: !63, file: !8, line: 54, type: !6)
!74 = !DILocation(line: 54, column: 19, scope: !63)
!75 = !DILocalVariable(name: "asn_bio", scope: !63, file: !8, line: 55, type: !51)
!76 = !DILocation(line: 55, column: 10, scope: !63)
!77 = !DILocalVariable(name: "aux", scope: !63, file: !8, line: 56, type: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_AUX", file: !22, line: 726, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_AUX_st", file: !22, line: 719, size: 320, align: 64, elements: !82)
!82 = !{!83, !84, !86, !87, !88, !94}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !81, file: !22, line: 720, baseType: !4, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !81, file: !22, line: 721, baseType: !85, size: 32, align: 32, offset: 64)
!85 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !81, file: !22, line: 722, baseType: !85, size: 32, align: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ref_lock", scope: !81, file: !22, line: 723, baseType: !85, size: 32, align: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_cb", scope: !81, file: !22, line: 724, baseType: !89, size: 64, align: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_aux_cb", file: !22, line: 716, baseType: !91)
!91 = !DISubroutineType(types: !92)
!92 = !{!85, !85, !93, !17, !4}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "enc_offset", scope: !81, file: !22, line: 725, baseType: !85, size: 32, align: 32, offset: 256)
!95 = !DILocation(line: 56, column: 21, scope: !63)
!96 = !DILocation(line: 56, column: 27, scope: !63)
!97 = !DILocation(line: 56, column: 31, scope: !63)
!98 = !DILocalVariable(name: "sarg", scope: !63, file: !8, line: 57, type: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STREAM_ARG", file: !22, line: 743, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_STREAM_ARG_st", file: !22, line: 736, size: 192, align: 64, elements: !101)
!101 = !{!102, !103, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !100, file: !22, line: 738, baseType: !51, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ndef_bio", scope: !100, file: !22, line: 740, baseType: !51, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !100, file: !22, line: 742, baseType: !56, size: 64, align: 64, offset: 128)
!105 = !DILocation(line: 57, column: 21, scope: !63)
!106 = !DILocation(line: 59, column: 10, scope: !107)
!107 = distinct !DILexicalBlock(scope: !63, file: !8, line: 59, column: 9)
!108 = !DILocation(line: 59, column: 14, scope: !107)
!109 = !DILocation(line: 59, column: 18, scope: !110)
!110 = !DILexicalBlockFile(scope: !107, file: !8, discriminator: 1)
!111 = !DILocation(line: 59, column: 23, scope: !110)
!112 = !DILocation(line: 59, column: 9, scope: !110)
!113 = !DILocation(line: 60, column: 9, scope: !114)
!114 = distinct !DILexicalBlock(scope: !107, file: !8, line: 59, column: 32)
!115 = !DILocation(line: 61, column: 9, scope: !114)
!116 = !DILocation(line: 63, column: 16, scope: !63)
!117 = !DILocation(line: 63, column: 14, scope: !63)
!118 = !DILocation(line: 64, column: 23, scope: !63)
!119 = !DILocation(line: 64, column: 15, scope: !120)
!120 = !DILexicalBlockFile(scope: !63, file: !8, discriminator: 1)
!121 = !DILocation(line: 64, column: 13, scope: !63)
!122 = !DILocation(line: 65, column: 9, scope: !123)
!123 = distinct !DILexicalBlock(scope: !63, file: !8, line: 65, column: 9)
!124 = !DILocation(line: 65, column: 18, scope: !123)
!125 = !DILocation(line: 65, column: 25, scope: !123)
!126 = !DILocation(line: 65, column: 28, scope: !127)
!127 = !DILexicalBlockFile(scope: !123, file: !8, discriminator: 1)
!128 = !DILocation(line: 65, column: 36, scope: !127)
!129 = !DILocation(line: 65, column: 9, scope: !127)
!130 = !DILocation(line: 66, column: 9, scope: !123)
!131 = !DILocation(line: 69, column: 20, scope: !63)
!132 = !DILocation(line: 69, column: 29, scope: !63)
!133 = !DILocation(line: 69, column: 11, scope: !63)
!134 = !DILocation(line: 69, column: 9, scope: !63)
!135 = !DILocation(line: 70, column: 9, scope: !136)
!136 = distinct !DILexicalBlock(scope: !63, file: !8, line: 70, column: 9)
!137 = !DILocation(line: 70, column: 13, scope: !136)
!138 = !DILocation(line: 70, column: 9, scope: !63)
!139 = !DILocation(line: 71, column: 9, scope: !136)
!140 = !DILocation(line: 73, column: 25, scope: !63)
!141 = !DILocation(line: 73, column: 5, scope: !63)
!142 = !DILocation(line: 74, column: 25, scope: !63)
!143 = !DILocation(line: 74, column: 5, scope: !63)
!144 = !DILocation(line: 81, column: 16, scope: !63)
!145 = !DILocation(line: 81, column: 10, scope: !63)
!146 = !DILocation(line: 81, column: 14, scope: !63)
!147 = !DILocation(line: 82, column: 10, scope: !63)
!148 = !DILocation(line: 82, column: 19, scope: !63)
!149 = !DILocation(line: 83, column: 10, scope: !63)
!150 = !DILocation(line: 83, column: 19, scope: !63)
!151 = !DILocation(line: 85, column: 9, scope: !152)
!152 = distinct !DILexicalBlock(scope: !63, file: !8, line: 85, column: 9)
!153 = !DILocation(line: 85, column: 14, scope: !152)
!154 = !DILocation(line: 85, column: 32, scope: !152)
!155 = !DILocation(line: 85, column: 36, scope: !152)
!156 = !DILocation(line: 85, column: 43, scope: !152)
!157 = !DILocation(line: 85, column: 9, scope: !63)
!158 = !DILocation(line: 86, column: 9, scope: !152)
!159 = !DILocation(line: 88, column: 21, scope: !63)
!160 = !DILocation(line: 88, column: 5, scope: !63)
!161 = !DILocation(line: 88, column: 15, scope: !63)
!162 = !DILocation(line: 88, column: 19, scope: !63)
!163 = !DILocation(line: 89, column: 20, scope: !63)
!164 = !DILocation(line: 89, column: 5, scope: !63)
!165 = !DILocation(line: 89, column: 15, scope: !63)
!166 = !DILocation(line: 89, column: 18, scope: !63)
!167 = !DILocation(line: 90, column: 31, scope: !63)
!168 = !DILocation(line: 90, column: 5, scope: !63)
!169 = !DILocation(line: 90, column: 15, scope: !63)
!170 = !DILocation(line: 90, column: 24, scope: !63)
!171 = !DILocation(line: 91, column: 31, scope: !63)
!172 = !DILocation(line: 91, column: 5, scope: !63)
!173 = !DILocation(line: 91, column: 15, scope: !63)
!174 = !DILocation(line: 91, column: 24, scope: !63)
