; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--pkcs12--libcrypto-shlib-p12_mutl.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--pkcs12--libcrypto-shlib-p12_mutl.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PKCS12_st = type { %struct.asn1_string_st*, %struct.PKCS12_MAC_DATA_st*, %struct.pkcs7_st* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.PKCS12_MAC_DATA_st = type { %struct.X509_sig_st*, %struct.asn1_string_st*, %struct.asn1_string_st* }
%struct.X509_sig_st = type opaque
%struct.pkcs7_st = type { i8*, i64, i32, i32, %struct.asn1_object_st*, %union.anon }
%struct.asn1_object_st = type opaque
%union.anon = type { i8* }
%struct.X509_algor_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_type_st = type { i32, %union.anon.0 }
%union.anon.0 = type { i8* }
%struct.evp_md_st = type opaque
%struct.hmac_ctx_st = type opaque
%struct.engine_st = type opaque

@.str = private unnamed_addr constant [25 x i8] c"crypto/pkcs12/p12_mutl.c\00", align 1
@.str.1 = private unnamed_addr constant [19 x i8] c"LEGACY_GOST_PKCS12\00", align 1

; Function Attrs: nounwind uwtable
define i32 @PKCS12_mac_present(%struct.PKCS12_st* %p12) #0 !dbg !9 {
entry:
  %p12.addr = alloca %struct.PKCS12_st*, align 8
  store %struct.PKCS12_st* %p12, %struct.PKCS12_st** %p12.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--pkcs12--libcrypto-shlib-p12_mutl.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!6 = !{i32 2, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!9 = distinct !DISubprogram(name: "PKCS12_mac_present", scope: !10, file: !10, line: 18, type: !11, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!10 = !DIFile(filename: "crypto/pkcs12/p12_mutl.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14}
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS12", file: !17, line: 45, baseType: !18)
!17 = !DIFile(filename: "include/openssl/pkcs12.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PKCS12_st", file: !19, line: 16, size: 192, align: 64, elements: !20)
!19 = !DIFile(filename: "crypto/pkcs12/p12_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!20 = !{!21, !35, !49}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !18, file: !19, line: 17, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !24, line: 40, baseType: !25)
!24 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !26, line: 146, size: 192, align: 64, elements: !27)
!26 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!27 = !{!28, !29, !30, !33}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !25, file: !26, line: 147, baseType: !13, size: 32, align: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !25, file: !26, line: 148, baseType: !13, size: 32, align: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !25, file: !26, line: 149, baseType: !31, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !25, file: !26, line: 155, baseType: !34, size: 64, align: 64, offset: 128)
!34 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !18, file: !19, line: 18, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS12_MAC_DATA", file: !17, line: 43, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PKCS12_MAC_DATA_st", file: !19, line: 10, size: 192, align: 64, elements: !39)
!39 = !{!40, !45, !48}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "dinfo", scope: !38, file: !19, line: 11, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_SIG", file: !43, line: 71, baseType: !44)
!43 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_sig_st", file: !43, line: 71, flags: DIFlagFwdDecl)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "salt", scope: !38, file: !19, line: 12, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !24, line: 43, baseType: !25)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !38, file: !19, line: 13, baseType: !22, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "authsafes", scope: !18, file: !19, line: 19, baseType: !50, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7", file: !52, line: 144, baseType: !53)
!52 = !DIFile(filename: "include/openssl/pkcs7.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_st", file: !52, line: 109, size: 320, align: 64, elements: !54)
!54 = !{!55, !56, !57, !58, !59, !63}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "asn1", scope: !53, file: !52, line: 114, baseType: !31, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !53, file: !52, line: 115, baseType: !34, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !53, file: !52, line: 119, baseType: !13, size: 32, align: 32, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !53, file: !52, line: 120, baseType: !13, size: 32, align: 32, offset: 160)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !53, file: !52, line: 121, baseType: !60, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !24, line: 60, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !24, line: 60, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !53, file: !52, line: 143, baseType: !64, size: 64, align: 64, offset: 256)
!64 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !53, file: !52, line: 127, size: 64, align: 64, elements: !65)
!65 = !{!66, !69, !70, !90, !177, !189, !198, !205}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !64, file: !52, line: 128, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !64, file: !52, line: 130, baseType: !46, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !64, file: !52, line: 132, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGNED", file: !52, line: 68, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signed_st", file: !52, line: 61, size: 384, align: 64, elements: !74)
!74 = !{!75, !76, !79, !82, !85, !88}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !73, file: !52, line: 62, baseType: !22, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !73, file: !52, line: 63, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ALGOR", file: !26, line: 119, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !73, file: !52, line: 64, baseType: !80, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !43, line: 99, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !73, file: !52, line: 65, baseType: !83, size: 64, align: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_CRL", file: !43, line: 228, flags: DIFlagFwdDecl)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !73, file: !52, line: 66, baseType: !86, size: 64, align: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_SIGNER_INFO", file: !52, line: 49, flags: DIFlagFwdDecl)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !73, file: !52, line: 67, baseType: !89, size: 64, align: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "enveloped", scope: !64, file: !52, line: 134, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENVELOPE", file: !52, line: 85, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enveloped_st", file: !52, line: 81, size: 192, align: 64, elements: !94)
!94 = !{!95, !96, !99}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !93, file: !52, line: 82, baseType: !22, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !93, file: !52, line: 83, baseType: !97, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_RECIP_INFO", file: !52, line: 59, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !93, file: !52, line: 84, baseType: !100, size: 64, align: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENC_CONTENT", file: !52, line: 79, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enc_content_st", file: !52, line: 74, size: 256, align: 64, elements: !103)
!103 = !{!104, !105, !171, !172}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !102, file: !52, line: 75, baseType: !60, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !102, file: !52, line: 76, baseType: !106, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !24, line: 125, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !43, line: 59, size: 128, align: 64, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !108, file: !43, line: 60, baseType: !60, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !108, file: !43, line: 61, baseType: !112, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !26, line: 473, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !26, line: 444, size: 128, align: 64, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !114, file: !26, line: 445, baseType: !13, size: 32, align: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !114, file: !26, line: 472, baseType: !118, size: 64, align: 64, offset: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !114, file: !26, line: 446, size: 64, align: 64, elements: !119)
!119 = !{!120, !121, !123, !126, !127, !128, !131, !134, !135, !138, !141, !144, !147, !150, !153, !156, !159, !162, !165, !166, !167}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !118, file: !26, line: 447, baseType: !67, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !118, file: !26, line: 448, baseType: !122, size: 32, align: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !24, line: 56, baseType: !13)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !118, file: !26, line: 449, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !24, line: 55, baseType: !25)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !118, file: !26, line: 450, baseType: !60, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !118, file: !26, line: 451, baseType: !22, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !118, file: !26, line: 452, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !24, line: 41, baseType: !25)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !118, file: !26, line: 453, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !24, line: 42, baseType: !25)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !118, file: !26, line: 454, baseType: !46, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !118, file: !26, line: 455, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !24, line: 44, baseType: !25)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !118, file: !26, line: 456, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !24, line: 45, baseType: !25)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !118, file: !26, line: 457, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !24, line: 46, baseType: !25)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !118, file: !26, line: 458, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !24, line: 47, baseType: !25)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !118, file: !26, line: 459, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !24, line: 49, baseType: !25)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !118, file: !26, line: 460, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !24, line: 48, baseType: !25)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !118, file: !26, line: 461, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !24, line: 50, baseType: !25)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !118, file: !26, line: 462, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !24, line: 52, baseType: !25)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !118, file: !26, line: 463, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !24, line: 53, baseType: !25)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !118, file: !26, line: 464, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !24, line: 54, baseType: !25)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !118, file: !26, line: 469, baseType: !124, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !118, file: !26, line: 470, baseType: !124, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !118, file: !26, line: 471, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !26, line: 213, baseType: !170)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !26, line: 213, flags: DIFlagFwdDecl)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !102, file: !52, line: 77, baseType: !46, size: 64, align: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !102, file: !52, line: 78, baseType: !173, size: 64, align: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !24, line: 89, baseType: !176)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !24, line: 89, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "signed_and_enveloped", scope: !64, file: !52, line: 136, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGN_ENVELOPE", file: !52, line: 95, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signedandenveloped_st", file: !52, line: 87, size: 448, align: 64, elements: !181)
!181 = !{!182, !183, !184, !185, !186, !187, !188}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !180, file: !52, line: 88, baseType: !22, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !180, file: !52, line: 89, baseType: !77, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !180, file: !52, line: 90, baseType: !80, size: 64, align: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !180, file: !52, line: 91, baseType: !83, size: 64, align: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !180, file: !52, line: 92, baseType: !86, size: 64, align: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !180, file: !52, line: 93, baseType: !100, size: 64, align: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !180, file: !52, line: 94, baseType: !97, size: 64, align: 64, offset: 384)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !64, file: !52, line: 138, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_DIGEST", file: !52, line: 102, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_digest_st", file: !52, line: 97, size: 256, align: 64, elements: !193)
!193 = !{!194, !195, !196, !197}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !192, file: !52, line: 98, baseType: !22, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !192, file: !52, line: 99, baseType: !106, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !192, file: !52, line: 100, baseType: !89, size: 64, align: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !192, file: !52, line: 101, baseType: !46, size: 64, align: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "encrypted", scope: !64, file: !52, line: 140, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENCRYPT", file: !52, line: 107, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_encrypted_st", file: !52, line: 104, size: 128, align: 64, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !201, file: !52, line: 105, baseType: !22, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !201, file: !52, line: 106, baseType: !100, size: 64, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !64, file: !52, line: 142, baseType: !112, size: 64, align: 64)
!206 = !DILocalVariable(name: "p12", arg: 1, scope: !9, file: !10, line: 18, type: !14)
!207 = !DIExpression()
!208 = !DILocation(line: 18, column: 38, scope: !9)
!209 = !DILocation(line: 20, column: 12, scope: !9)
!210 = !DILocation(line: 20, column: 17, scope: !9)
!211 = !DILocation(line: 20, column: 5, scope: !9)
!212 = distinct !DISubprogram(name: "PKCS12_get0_mac", scope: !10, file: !10, line: 23, type: !213, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !215, !218, !215, !221, !14}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!224 = !DILocalVariable(name: "pmac", arg: 1, scope: !212, file: !10, line: 23, type: !215)
!225 = !DILocation(line: 23, column: 48, scope: !212)
!226 = !DILocalVariable(name: "pmacalg", arg: 2, scope: !212, file: !10, line: 24, type: !218)
!227 = !DILocation(line: 24, column: 41, scope: !212)
!228 = !DILocalVariable(name: "psalt", arg: 3, scope: !212, file: !10, line: 25, type: !215)
!229 = !DILocation(line: 25, column: 48, scope: !212)
!230 = !DILocalVariable(name: "piter", arg: 4, scope: !212, file: !10, line: 26, type: !221)
!231 = !DILocation(line: 26, column: 43, scope: !212)
!232 = !DILocalVariable(name: "p12", arg: 5, scope: !212, file: !10, line: 27, type: !14)
!233 = !DILocation(line: 27, column: 36, scope: !212)
!234 = !DILocation(line: 29, column: 9, scope: !235)
!235 = distinct !DILexicalBlock(scope: !212, file: !10, line: 29, column: 9)
!236 = !DILocation(line: 29, column: 14, scope: !235)
!237 = !DILocation(line: 29, column: 9, scope: !212)
!238 = !DILocation(line: 30, column: 23, scope: !239)
!239 = distinct !DILexicalBlock(scope: !235, file: !10, line: 29, column: 19)
!240 = !DILocation(line: 30, column: 28, scope: !239)
!241 = !DILocation(line: 30, column: 33, scope: !239)
!242 = !DILocation(line: 30, column: 40, scope: !239)
!243 = !DILocation(line: 30, column: 49, scope: !239)
!244 = !DILocation(line: 30, column: 9, scope: !239)
!245 = !DILocation(line: 31, column: 13, scope: !246)
!246 = distinct !DILexicalBlock(scope: !239, file: !10, line: 31, column: 13)
!247 = !DILocation(line: 31, column: 13, scope: !239)
!248 = !DILocation(line: 32, column: 22, scope: !246)
!249 = !DILocation(line: 32, column: 27, scope: !246)
!250 = !DILocation(line: 32, column: 32, scope: !246)
!251 = !DILocation(line: 32, column: 14, scope: !246)
!252 = !DILocation(line: 32, column: 20, scope: !246)
!253 = !DILocation(line: 32, column: 13, scope: !246)
!254 = !DILocation(line: 33, column: 13, scope: !255)
!255 = distinct !DILexicalBlock(scope: !239, file: !10, line: 33, column: 13)
!256 = !DILocation(line: 33, column: 13, scope: !239)
!257 = !DILocation(line: 34, column: 22, scope: !255)
!258 = !DILocation(line: 34, column: 27, scope: !255)
!259 = !DILocation(line: 34, column: 32, scope: !255)
!260 = !DILocation(line: 34, column: 14, scope: !255)
!261 = !DILocation(line: 34, column: 20, scope: !255)
!262 = !DILocation(line: 34, column: 13, scope: !255)
