; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-lib-v3_alt.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-lib-v3_alt.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type opaque
%struct.v3_ext_method = type { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, i8* (%struct.v3_ext_method*, i8*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }
%struct.stack_st_CONF_VALUE = type opaque
%struct.v3_ext_ctx = type { i32, %struct.x509_st*, %struct.x509_st*, %struct.X509_req_st*, %struct.X509_crl_st*, %struct.X509V3_CONF_METHOD_st*, i8* }
%struct.x509_st = type opaque
%struct.X509_req_st = type opaque
%struct.X509_crl_st = type opaque
%struct.X509V3_CONF_METHOD_st = type { i8* (i8*, i8*, i8*)*, %struct.stack_st_CONF_VALUE* (i8*, i8*)*, void (i8*, i8*)*, void (i8*, %struct.stack_st_CONF_VALUE*)* }
%struct.bio_st = type opaque
%struct.stack_st_GENERAL_NAME = type opaque
%struct.GENERAL_NAME_st = type { i32, %union.anon }
%union.anon = type { i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !152)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-lib-v3_alt.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !7, !12, !129, !132, !133, !135, !141, !139, !148}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !10, line: 17, baseType: !11)
!10 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !10, line: 17, flags: DIFlagFwdDecl)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "GENERAL_NAME", file: !14, line: 153, baseType: !15)
!14 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GENERAL_NAME_st", file: !14, line: 123, size: 128, align: 64, elements: !16)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !15, file: !14, line: 133, baseType: !18, size: 32, align: 32)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !15, file: !14, line: 152, baseType: !20, size: 64, align: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !15, file: !14, line: 134, size: 64, align: 64, elements: !21)
!21 = !{!22, !25, !107, !108, !109, !110, !114, !121, !122, !123, !124, !125, !126, !127, !128}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !20, file: !14, line: 135, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "otherName", scope: !20, file: !14, line: 136, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "OTHERNAME", file: !14, line: 116, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "otherName_st", file: !14, line: 113, size: 128, align: 64, elements: !29)
!29 = !{!30, !35}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "type_id", scope: !28, file: !14, line: 114, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !33, line: 60, baseType: !34)
!33 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !33, line: 60, flags: DIFlagFwdDecl)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !28, file: !14, line: 115, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !38, line: 473, baseType: !39)
!38 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !38, line: 444, size: 128, align: 64, elements: !40)
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !39, file: !38, line: 445, baseType: !18, size: 32, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !39, file: !38, line: 472, baseType: !43, size: 64, align: 64, offset: 64)
!43 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !39, file: !38, line: 446, size: 64, align: 64, elements: !44)
!44 = !{!45, !46, !48, !58, !59, !62, !65, !68, !71, !74, !77, !80, !83, !86, !89, !92, !95, !98, !101, !102, !103}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !43, file: !38, line: 447, baseType: !23, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !43, file: !38, line: 448, baseType: !47, size: 32, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !33, line: 56, baseType: !18)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !43, file: !38, line: 449, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !33, line: 55, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !38, line: 146, size: 192, align: 64, elements: !52)
!52 = !{!53, !54, !55, !56}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !51, file: !38, line: 147, baseType: !18, size: 32, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !51, file: !38, line: 148, baseType: !18, size: 32, align: 32, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !51, file: !38, line: 149, baseType: !5, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !51, file: !38, line: 155, baseType: !57, size: 64, align: 64, offset: 128)
!57 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !43, file: !38, line: 450, baseType: !31, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !43, file: !38, line: 451, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !33, line: 40, baseType: !51)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !43, file: !38, line: 452, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !33, line: 41, baseType: !51)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !43, file: !38, line: 453, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !33, line: 42, baseType: !51)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !43, file: !38, line: 454, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !33, line: 43, baseType: !51)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !43, file: !38, line: 455, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !33, line: 44, baseType: !51)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !43, file: !38, line: 456, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !33, line: 45, baseType: !51)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !43, file: !38, line: 457, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !33, line: 46, baseType: !51)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !43, file: !38, line: 458, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !33, line: 47, baseType: !51)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !43, file: !38, line: 459, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !33, line: 49, baseType: !51)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !43, file: !38, line: 460, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !33, line: 48, baseType: !51)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !43, file: !38, line: 461, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !33, line: 50, baseType: !51)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !43, file: !38, line: 462, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !33, line: 52, baseType: !51)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !43, file: !38, line: 463, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !33, line: 53, baseType: !51)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !43, file: !38, line: 464, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !33, line: 54, baseType: !51)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !43, file: !38, line: 469, baseType: !49, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !43, file: !38, line: 470, baseType: !49, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !43, file: !38, line: 471, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !38, line: 213, baseType: !106)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !38, line: 213, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "rfc822Name", scope: !20, file: !14, line: 137, baseType: !78, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "dNSName", scope: !20, file: !14, line: 138, baseType: !78, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "x400Address", scope: !20, file: !14, line: 139, baseType: !36, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "directoryName", scope: !20, file: !14, line: 140, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !33, line: 129, baseType: !113)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !33, line: 129, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ediPartyName", scope: !20, file: !14, line: 141, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDIPARTYNAME", file: !14, line: 121, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EDIPartyName_st", file: !14, line: 118, size: 128, align: 64, elements: !118)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "nameAssigner", scope: !117, file: !14, line: 119, baseType: !49, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "partyName", scope: !117, file: !14, line: 120, baseType: !49, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "uniformResourceIdentifier", scope: !20, file: !14, line: 142, baseType: !78, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "iPAddress", scope: !20, file: !14, line: 143, baseType: !69, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "registeredID", scope: !20, file: !14, line: 144, baseType: !31, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !20, file: !14, line: 146, baseType: !69, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "dirn", scope: !20, file: !14, line: 147, baseType: !111, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ia5", scope: !20, file: !14, line: 148, baseType: !78, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "rid", scope: !20, file: !14, line: 150, baseType: !31, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !20, file: !14, line: 151, baseType: !36, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !131, line: 30, flags: DIFlagFwdDecl)
!131 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_GENERAL_NAME", file: !14, line: 166, flags: DIFlagFwdDecl)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_compfunc", file: !10, line: 19, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!18, !139, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_VALUE", file: !131, line: 28, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 24, size: 192, align: 64, elements: !144)
!144 = !{!145, !146, !147}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !143, file: !131, line: 25, baseType: !23, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !131, line: 26, baseType: !23, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !143, file: !131, line: 27, baseType: !23, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !10, line: 20, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !4}
!152 = !{!153}
!153 = distinct !DIGlobalVariable(name: "v3_alt", scope: !0, file: !154, line: 27, type: !155, isLocal: false, isDefinition: true, variable: [3 x %struct.v3_ext_method]* @v3_alt)
!154 = !DIFile(filename: "crypto/x509v3/v3_alt.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 2496, align: 64, elements: !264)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_METHOD", file: !14, line: 92, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_method", file: !14, line: 49, size: 832, align: 64, elements: !159)
!159 = !{!160, !161, !162, !168, !173, !175, !183, !189, !196, !243, !248, !253, !261, !263}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ext_nid", scope: !158, file: !14, line: 50, baseType: !18, size: 32, align: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !158, file: !14, line: 51, baseType: !18, size: 32, align: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !158, file: !14, line: 53, baseType: !163, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !38, line: 318, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !33, line: 62, baseType: !167)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !33, line: 62, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ext_new", scope: !158, file: !14, line: 55, baseType: !169, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_NEW", file: !14, line: 28, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!4}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ext_free", scope: !158, file: !14, line: 56, baseType: !174, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_FREE", file: !14, line: 29, baseType: !149)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "d2i", scope: !158, file: !14, line: 57, baseType: !176, size: 64, align: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_D2I", file: !14, line: 30, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!4, !4, !180, !57}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i2d", scope: !158, file: !14, line: 58, baseType: !184, size: 64, align: 64, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2D", file: !14, line: 31, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!18, !4, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "i2s", scope: !158, file: !14, line: 60, baseType: !190, size: 64, align: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2S", file: !14, line: 38, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!23, !194, !4}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "s2i", scope: !158, file: !14, line: 61, baseType: !197, size: 64, align: 64, offset: 448)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_S2I", file: !14, line: 40, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!4, !194, !201, !228}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_ctx", file: !14, line: 79, size: 448, align: 64, elements: !203)
!203 = !{!204, !205, !209, !210, !215, !219, !242}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !202, file: !14, line: 82, baseType: !18, size: 32, align: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_cert", scope: !202, file: !14, line: 83, baseType: !206, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !33, line: 124, baseType: !208)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !33, line: 124, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "subject_cert", scope: !202, file: !14, line: 84, baseType: !206, size: 64, align: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "subject_req", scope: !202, file: !14, line: 85, baseType: !211, size: 64, align: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_REQ", file: !213, line: 93, baseType: !214)
!213 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_req_st", file: !213, line: 93, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !202, file: !14, line: 86, baseType: !216, size: 64, align: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !33, line: 126, baseType: !218)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !33, line: 126, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "db_meth", scope: !202, file: !14, line: 87, baseType: !220, size: 64, align: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CONF_METHOD", file: !14, line: 76, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509V3_CONF_METHOD_st", file: !14, line: 71, size: 256, align: 64, elements: !223)
!223 = !{!224, !230, !234, !238}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "get_string", scope: !222, file: !14, line: 72, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!23, !4, !228, !228}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "get_section", scope: !222, file: !14, line: 73, baseType: !231, size: 64, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!129, !4, !228}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "free_string", scope: !222, file: !14, line: 74, baseType: !235, size: 64, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !4, !23}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "free_section", scope: !222, file: !14, line: 75, baseType: !239, size: 64, align: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !4, !129}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !202, file: !14, line: 88, baseType: !4, size: 64, align: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i2v", scope: !158, file: !14, line: 63, baseType: !244, size: 64, align: 64, offset: 512)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2V", file: !14, line: 33, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!129, !194, !4, !129}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "v2i", scope: !158, file: !14, line: 64, baseType: !249, size: 64, align: 64, offset: 576)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_V2I", file: !14, line: 35, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!4, !194, !201, !129}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i2r", scope: !158, file: !14, line: 66, baseType: !254, size: 64, align: 64, offset: 640)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2R", file: !14, line: 42, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!18, !194, !4, !258, !18}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !33, line: 79, baseType: !260)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !33, line: 79, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "r2i", scope: !158, file: !14, line: 67, baseType: !262, size: 64, align: 64, offset: 704)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_R2I", file: !14, line: 44, baseType: !198)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "usr_data", scope: !158, file: !14, line: 68, baseType: !4, size: 64, align: 64, offset: 768)
!264 = !{!265}
!265 = !DISubrange(count: 3)
!266 = !{i32 2, !"Dwarf Version", i32 4}
!267 = !{i32 2, !"Debug Info Version", i32 3}
!268 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!269 = distinct !DISubprogram(name: "i2v_GENERAL_NAMES", scope: !154, file: !154, line: 49, type: !270, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!270 = !DISubroutineType(types: !271)
!271 = !{!129, !272, !273, !129}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "GENERAL_NAMES", file: !14, line: 167, baseType: !134)
!275 = !DILocalVariable(name: "method", arg: 1, scope: !269, file: !154, line: 49, type: !272)
!276 = !DIExpression()
!277 = !DILocation(line: 49, column: 66, scope: !269)
!278 = !DILocalVariable(name: "gens", arg: 2, scope: !269, file: !154, line: 50, type: !273)
!279 = !DILocation(line: 50, column: 56, scope: !269)
!280 = !DILocalVariable(name: "ret", arg: 3, scope: !269, file: !154, line: 51, type: !129)
!281 = !DILocation(line: 51, column: 69, scope: !269)
!282 = !DILocalVariable(name: "i", scope: !269, file: !154, line: 53, type: !18)
!283 = !DILocation(line: 53, column: 9, scope: !269)
!284 = !DILocalVariable(name: "gen", scope: !269, file: !154, line: 54, type: !12)
!285 = !DILocation(line: 54, column: 19, scope: !269)
!286 = !DILocation(line: 55, column: 12, scope: !287)
!287 = distinct !DILexicalBlock(scope: !269, file: !154, line: 55, column: 5)
!288 = !DILocation(line: 55, column: 10, scope: !287)
!289 = !DILocation(line: 55, column: 17, scope: !290)
!290 = !DILexicalBlockFile(scope: !291, file: !154, discriminator: 1)
!291 = distinct !DILexicalBlock(scope: !287, file: !154, line: 55, column: 5)
!292 = !DILocation(line: 55, column: 41, scope: !290)
!293 = !DILocation(line: 55, column: 21, scope: !290)
!294 = !DILocation(line: 55, column: 19, scope: !290)
!295 = !DILocation(line: 55, column: 5, scope: !290)
!296 = !DILocation(line: 56, column: 37, scope: !297)
!297 = distinct !DILexicalBlock(scope: !291, file: !154, line: 55, column: 53)
!298 = !DILocation(line: 56, column: 43, scope: !297)
!299 = !DILocation(line: 56, column: 15, scope: !297)
!300 = !DILocation(line: 56, column: 13, scope: !297)
!301 = !DILocation(line: 57, column: 32, scope: !297)
!302 = !DILocation(line: 57, column: 40, scope: !297)
!303 = !DILocation(line: 57, column: 45, scope: !297)
!304 = !DILocation(line: 57, column: 15, scope: !297)
!305 = !DILocation(line: 57, column: 13, scope: !297)
!306 = !DILocation(line: 58, column: 5, scope: !297)
!307 = !DILocation(line: 55, column: 49, scope: !308)
!308 = !DILexicalBlockFile(scope: !291, file: !154, discriminator: 2)
!309 = !DILocation(line: 55, column: 5, scope: !308)
!310 = distinct !{!310, !311}
!311 = !DILocation(line: 55, column: 5, scope: !269)
!312 = !DILocation(line: 59, column: 10, scope: !313)
!313 = distinct !DILexicalBlock(scope: !269, file: !154, line: 59, column: 9)
!314 = !DILocation(line: 59, column: 9, scope: !269)
!315 = !DILocation(line: 60, column: 16, scope: !313)
!316 = !DILocation(line: 60, column: 9, scope: !313)
!317 = !DILocation(line: 61, column: 12, scope: !269)
!318 = !DILocation(line: 61, column: 5, scope: !269)
!319 = !DILocation(line: 62, column: 1, scope: !269)
!320 = distinct !DISubprogram(name: "v2i_subject_alt", scope: !154, file: !154, line: 278, type: !321, isLocal: true, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!321 = !DISubroutineType(types: !322)
!322 = !{!273, !272, !323, !129}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
