; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--rand--libcrypto-shlib-randfile.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--rand--libcrypto-shlib-randfile.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"crypto/rand/randfile.c\00", align 1
@.str.2 = private unnamed_addr constant [10 x i8] c"Filename=\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"wb\00", align 1
@.str.4 = private unnamed_addr constant [9 x i8] c"RANDFILE\00", align 1
@.str.5 = private unnamed_addr constant [5 x i8] c"HOME\00", align 1
@.str.6 = private unnamed_addr constant [2 x i8] c"/\00", align 1
@.str.7 = private unnamed_addr constant [5 x i8] c".rnd\00", align 1

; Function Attrs: nounwind uwtable
define i32 @RAND_load_file(i8* %file, i64 %bytes) #0 !dbg !10 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--rand--libcrypto-shlib-randfile.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!7 = !{i32 2, !"Dwarf Version", i32 4}
!8 = !{i32 2, !"Debug Info Version", i32 3}
!9 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!10 = distinct !DISubprogram(name: "RAND_load_file", scope: !11, file: !11, line: 76, type: !12, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!11 = !DIFile(filename: "crypto/rand/randfile.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!12 = !DISubroutineType(types: !13)
!13 = !{!5, !14, !17}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!16 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DILocalVariable(name: "file", arg: 1, scope: !10, file: !11, line: 76, type: !14)
!19 = !DIExpression()
!20 = !DILocation(line: 76, column: 32, scope: !10)
!21 = !DILocalVariable(name: "bytes", arg: 2, scope: !10, file: !11, line: 76, type: !17)
!22 = !DILocation(line: 76, column: 43, scope: !10)
!23 = !DILocalVariable(name: "buf", scope: !10, file: !11, line: 86, type: !24)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 10240, align: 8, elements: !26)
!25 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!27}
!27 = !DISubrange(count: 1280)
!28 = !DILocation(line: 86, column: 19, scope: !10)
!29 = !DILocalVariable(name: "sb", scope: !10, file: !11, line: 89, type: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !31, line: 46, size: 1152, align: 64, elements: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!32 = !{!33, !37, !39, !41, !44, !46, !48, !49, !50, !52, !54, !56, !64, !65, !66}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !30, file: !31, line: 48, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !35, line: 124, baseType: !36)
!35 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!36 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !30, file: !31, line: 53, baseType: !38, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !35, line: 127, baseType: !36)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !30, file: !31, line: 61, baseType: !40, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !35, line: 130, baseType: !36)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !30, file: !31, line: 62, baseType: !42, size: 32, align: 32, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !35, line: 129, baseType: !43)
!43 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !30, file: !31, line: 64, baseType: !45, size: 32, align: 32, offset: 224)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !35, line: 125, baseType: !43)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !30, file: !31, line: 65, baseType: !47, size: 32, align: 32, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !35, line: 126, baseType: !43)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !30, file: !31, line: 67, baseType: !5, size: 32, align: 32, offset: 288)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !30, file: !31, line: 69, baseType: !34, size: 64, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !30, file: !31, line: 74, baseType: !51, size: 64, align: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !35, line: 131, baseType: !17)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !30, file: !31, line: 78, baseType: !53, size: 64, align: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !35, line: 153, baseType: !17)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !30, file: !31, line: 80, baseType: !55, size: 64, align: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !35, line: 158, baseType: !17)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !30, file: !31, line: 91, baseType: !57, size: 128, align: 64, offset: 576)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !58, line: 120, size: 128, align: 64, elements: !59)
!58 = !DIFile(filename: "/usr/include/time.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!59 = !{!60, !62}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !57, file: !58, line: 122, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !35, line: 139, baseType: !17)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !57, file: !58, line: 123, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !35, line: 175, baseType: !17)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !30, file: !31, line: 92, baseType: !57, size: 128, align: 64, offset: 704)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !30, file: !31, line: 93, baseType: !57, size: 128, align: 64, offset: 832)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !30, file: !31, line: 106, baseType: !67, size: 192, align: 64, offset: 960)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 192, align: 64, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 3)
!70 = !DILocation(line: 89, column: 17, scope: !10)
!71 = !DILocalVariable(name: "i", scope: !10, file: !11, line: 91, type: !5)
!72 = !DILocation(line: 91, column: 9, scope: !10)
!73 = !DILocalVariable(name: "n", scope: !10, file: !11, line: 91, type: !5)
!74 = !DILocation(line: 91, column: 12, scope: !10)
!75 = !DILocalVariable(name: "ret", scope: !10, file: !11, line: 91, type: !5)
!76 = !DILocation(line: 91, column: 15, scope: !10)
!77 = !DILocalVariable(name: "in", scope: !10, file: !11, line: 92, type: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !80, line: 48, baseType: !81)
!80 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !82, line: 241, size: 1728, align: 64, elements: !83)
!82 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!83 = !{!84, !85, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !105, !106, !107, !108, !109, !111, !113, !117, !120, !122, !123, !124, !125, !126, !129, !130}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !81, file: !82, line: 242, baseType: !5, size: 32, align: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !81, file: !82, line: 247, baseType: !86, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !81, file: !82, line: 248, baseType: !86, size: 64, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !81, file: !82, line: 249, baseType: !86, size: 64, align: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !81, file: !82, line: 250, baseType: !86, size: 64, align: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !81, file: !82, line: 251, baseType: !86, size: 64, align: 64, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !81, file: !82, line: 252, baseType: !86, size: 64, align: 64, offset: 384)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !81, file: !82, line: 253, baseType: !86, size: 64, align: 64, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !81, file: !82, line: 254, baseType: !86, size: 64, align: 64, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !81, file: !82, line: 256, baseType: !86, size: 64, align: 64, offset: 576)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !81, file: !82, line: 257, baseType: !86, size: 64, align: 64, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !81, file: !82, line: 258, baseType: !86, size: 64, align: 64, offset: 704)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !81, file: !82, line: 260, baseType: !98, size: 64, align: 64, offset: 768)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !82, line: 156, size: 192, align: 64, elements: !100)
!100 = !{!101, !102, !104}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !99, file: !82, line: 157, baseType: !98, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !99, file: !82, line: 158, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !99, file: !82, line: 162, baseType: !5, size: 32, align: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !81, file: !82, line: 262, baseType: !103, size: 64, align: 64, offset: 832)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !81, file: !82, line: 264, baseType: !5, size: 32, align: 32, offset: 896)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !81, file: !82, line: 268, baseType: !5, size: 32, align: 32, offset: 928)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !81, file: !82, line: 270, baseType: !51, size: 64, align: 64, offset: 960)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !81, file: !82, line: 274, baseType: !110, size: 16, align: 16, offset: 1024)
!110 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !81, file: !82, line: 275, baseType: !112, size: 8, align: 8, offset: 1040)
!112 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !81, file: !82, line: 276, baseType: !114, size: 8, align: 8, offset: 1048)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8, align: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 1)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !81, file: !82, line: 280, baseType: !118, size: 64, align: 64, offset: 1088)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !82, line: 150, baseType: null)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !81, file: !82, line: 289, baseType: !121, size: 64, align: 64, offset: 1152)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !35, line: 132, baseType: !17)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !81, file: !82, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !81, file: !82, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !81, file: !82, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !81, file: !82, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !81, file: !82, line: 302, baseType: !127, size: 64, align: 64, offset: 1472)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !128, line: 216, baseType: !36)
!128 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !81, file: !82, line: 303, baseType: !5, size: 32, align: 32, offset: 1536)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !81, file: !82, line: 305, baseType: !131, size: 160, align: 8, offset: 1568)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 160, align: 8, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 20)
!134 = !DILocation(line: 92, column: 11, scope: !10)
!135 = !DILocation(line: 94, column: 9, scope: !136)
!136 = distinct !DILexicalBlock(scope: !10, file: !11, line: 94, column: 9)
!137 = !DILocation(line: 94, column: 15, scope: !136)
!138 = !DILocation(line: 94, column: 9, scope: !10)
!139 = !DILocation(line: 95, column: 9, scope: !136)
!140 = !DILocation(line: 97, column: 29, scope: !141)
!141 = distinct !DILexicalBlock(scope: !10, file: !11, line: 97, column: 9)
!142 = !DILocation(line: 97, column: 15, scope: !141)
!143 = !DILocation(line: 97, column: 13, scope: !141)
!144 = !DILocation(line: 97, column: 42, scope: !141)
!145 = !DILocation(line: 97, column: 9, scope: !10)
!146 = !DILocation(line: 98, column: 9, scope: !147)
!147 = distinct !DILexicalBlock(scope: !141, file: !11, line: 97, column: 50)
!148 = !DILocation(line: 99, column: 44, scope: !147)
!149 = !DILocation(line: 99, column: 9, scope: !147)
!150 = !DILocation(line: 100, column: 9, scope: !147)
!151 = !DILocation(line: 104, column: 22, scope: !152)
!152 = distinct !DILexicalBlock(scope: !10, file: !11, line: 104, column: 9)
!153 = !DILocation(line: 104, column: 15, scope: !152)
!154 = !DILocation(line: 104, column: 9, scope: !155)
!155 = !DILexicalBlockFile(scope: !152, file: !11, discriminator: 1)
!156 = !DILocation(line: 104, column: 32, scope: !152)
!157 = !DILocation(line: 104, column: 9, scope: !10)
!158 = !DILocation(line: 105, column: 9, scope: !159)
!159 = distinct !DILexicalBlock(scope: !152, file: !11, line: 104, column: 37)
!160 = !DILocation(line: 106, column: 44, scope: !159)
!161 = !DILocation(line: 106, column: 9, scope: !159)
!162 = !DILocation(line: 107, column: 16, scope: !159)
!163 = !DILocation(line: 107, column: 9, scope: !159)
!164 = !DILocation(line: 108, column: 9, scope: !159)
!165 = !DILocation(line: 111, column: 9, scope: !166)
!166 = distinct !DILexicalBlock(scope: !10, file: !11, line: 111, column: 9)
!167 = !DILocation(line: 111, column: 15, scope: !166)
!168 = !DILocation(line: 111, column: 9, scope: !10)
!169 = !DILocation(line: 112, column: 15, scope: !170)
!170 = distinct !DILexicalBlock(scope: !171, file: !11, line: 112, column: 12)
!171 = distinct !DILexicalBlock(scope: !166, file: !11, line: 111, column: 20)
!172 = !DILocation(line: 112, column: 26, scope: !170)
!173 = !DILocation(line: 112, column: 12, scope: !171)
!174 = !DILocation(line: 113, column: 24, scope: !170)
!175 = !DILocation(line: 113, column: 19, scope: !170)
!176 = !DILocation(line: 113, column: 13, scope: !170)
!177 = !DILocation(line: 115, column: 19, scope: !170)
!178 = !DILocation(line: 116, column: 5, scope: !171)
!179 = !DILocation(line: 134, column: 12, scope: !10)
!180 = !DILocation(line: 134, column: 5, scope: !10)
!181 = !DILocation(line: 139, column: 5, scope: !10)
!182 = !DILocation(line: 140, column: 13, scope: !183)
!183 = distinct !DILexicalBlock(scope: !184, file: !11, line: 140, column: 13)
!184 = distinct !DILexicalBlock(scope: !185, file: !11, line: 139, column: 17)
!185 = distinct !DILexicalBlock(scope: !186, file: !11, line: 139, column: 5)
!186 = distinct !DILexicalBlock(scope: !10, file: !11, line: 139, column: 5)
!187 = !DILocation(line: 140, column: 19, scope: !183)
!188 = !DILocation(line: 140, column: 13, scope: !184)
!189 = !DILocation(line: 141, column: 18, scope: !183)
!190 = !DILocation(line: 141, column: 24, scope: !183)
!191 = !DILocation(line: 141, column: 17, scope: !183)
!192 = !DILocation(line: 141, column: 48, scope: !193)
!193 = !DILexicalBlockFile(scope: !183, file: !11, discriminator: 1)
!194 = !DILocation(line: 141, column: 43, scope: !193)
!195 = !DILocation(line: 141, column: 17, scope: !193)
!196 = !DILocation(line: 141, column: 17, scope: !197)
