; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-asn_mstbl.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-asn_mstbl.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.conf_imodule_st = type opaque
%struct.conf_st = type { %struct.conf_method_st*, i8*, %struct.lhash_st_CONF_VALUE* }
%struct.conf_method_st = type { i8*, %struct.conf_st* (%struct.conf_method_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*, %struct.bio_st*, i64*)*, i32 (%struct.conf_st*, %struct.bio_st*)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8*, i64*)* }
%struct.bio_st = type opaque
%struct.lhash_st_CONF_VALUE = type { %union.lh_CONF_VALUE_dummy }
%union.lh_CONF_VALUE_dummy = type { i8* }
%struct.stack_st_CONF_VALUE = type opaque
%struct.CONF_VALUE = type { i8*, i8*, i8* }
%struct.stack_st = type opaque

@.str = private unnamed_addr constant [13 x i8] c"stbl_section\00", align 1
@.str.1 = private unnamed_addr constant [24 x i8] c"crypto/asn1/asn_mstbl.c\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"min\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"max\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"mask\00", align 1
@.str.5 = private unnamed_addr constant [6 x i8] c"flags\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-asn_mstbl.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !10, !20, !21}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !8, line: 17, baseType: !9)
!8 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !8, line: 17, flags: DIFlagFwdDecl)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_VALUE", file: !12, line: 28, baseType: !13)
!12 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 24, size: 192, align: 64, elements: !14)
!14 = !{!15, !18, !19}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !13, file: !12, line: 25, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !13, file: !12, line: 26, baseType: !16, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !13, file: !12, line: 27, baseType: !16, size: 64, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !8, line: 20, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DISubroutineType(types: !24)
!24 = !{null, !4}
!25 = !{i32 2, !"Dwarf Version", i32 4}
!26 = !{i32 2, !"Debug Info Version", i32 3}
!27 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!28 = distinct !DISubprogram(name: "ASN1_add_stable_module", scope: !29, file: !29, line: 47, type: !30, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!29 = !DIFile(filename: "crypto/asn1/asn_mstbl.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!30 = !DISubroutineType(types: !31)
!31 = !{null}
!32 = !DILocation(line: 49, column: 5, scope: !28)
!33 = !DILocation(line: 50, column: 1, scope: !28)
!34 = distinct !DISubprogram(name: "stbl_module_init", scope: !29, file: !29, line: 20, type: !35, isLocal: true, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !38, !41}
!37 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_IMODULE", file: !12, line: 52, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "conf_imodule_st", file: !12, line: 52, flags: DIFlagFwdDecl)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF", file: !44, line: 144, baseType: !45)
!44 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_st", file: !12, line: 103, size: 192, align: 64, elements: !46)
!46 = !{!47, !88, !89}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !45, file: !12, line: 104, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_METHOD", file: !12, line: 35, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_method_st", file: !12, line: 37, size: 640, align: 64, elements: !51)
!51 = !{!52, !55, !60, !64, !65, !66, !75, !79, !83, !84}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !50, file: !12, line: 38, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !50, file: !12, line: 39, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !48}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !50, file: !12, line: 40, baseType: !61, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!37, !59}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !50, file: !12, line: 41, baseType: !61, size: 64, align: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_data", scope: !50, file: !12, line: 42, baseType: !61, size: 64, align: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "load_bio", scope: !50, file: !12, line: 43, baseType: !67, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!37, !59, !70, !73}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !44, line: 79, baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !44, line: 79, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !50, file: !12, line: 44, baseType: !76, size: 64, align: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!37, !41, !70}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "is_number", scope: !50, file: !12, line: 45, baseType: !80, size: 64, align: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!37, !41, !17}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "to_int", scope: !50, file: !12, line: 46, baseType: !80, size: 64, align: 64, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !50, file: !12, line: 47, baseType: !85, size: 64, align: 64, offset: 576)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!37, !59, !53, !73}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "meth_data", scope: !45, file: !12, line: 105, baseType: !4, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !45, file: !12, line: 106, baseType: !90, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st_CONF_VALUE", file: !12, line: 31, size: 64, align: 64, elements: !92)
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !91, file: !12, line: 31, baseType: !94, size: 64, align: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "lh_CONF_VALUE_dummy", file: !12, line: 31, size: 64, align: 64, elements: !95)
!95 = !{!96, !97, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !94, file: !12, line: 31, baseType: !4, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !94, file: !12, line: 31, baseType: !98, size: 64, align: 64)
!98 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !94, file: !12, line: 31, baseType: !37, size: 32, align: 32)
!100 = !DILocalVariable(name: "md", arg: 1, scope: !34, file: !29, line: 20, type: !38)
!101 = !DIExpression()
!102 = !DILocation(line: 20, column: 43, scope: !34)
!103 = !DILocalVariable(name: "cnf", arg: 2, scope: !34, file: !29, line: 20, type: !41)
!104 = !DILocation(line: 20, column: 59, scope: !34)
!105 = !DILocalVariable(name: "i", scope: !34, file: !29, line: 22, type: !37)
!106 = !DILocation(line: 22, column: 9, scope: !34)
!107 = !DILocalVariable(name: "stbl_section", scope: !34, file: !29, line: 23, type: !53)
!108 = !DILocation(line: 23, column: 17, scope: !34)
!109 = !DILocalVariable(name: "sktmp", scope: !34, file: !29, line: 24, type: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !12, line: 30, flags: DIFlagFwdDecl)
!112 = !DILocation(line: 24, column: 33, scope: !34)
!113 = !DILocalVariable(name: "mval", scope: !34, file: !29, line: 25, type: !10)
!114 = !DILocation(line: 25, column: 17, scope: !34)
!115 = !DILocation(line: 27, column: 43, scope: !34)
!116 = !DILocation(line: 27, column: 20, scope: !34)
!117 = !DILocation(line: 27, column: 18, scope: !34)
!118 = !DILocation(line: 28, column: 36, scope: !119)
!119 = distinct !DILexicalBlock(scope: !34, file: !29, line: 28, column: 9)
!120 = !DILocation(line: 28, column: 41, scope: !119)
!121 = !DILocation(line: 28, column: 18, scope: !119)
!122 = !DILocation(line: 28, column: 16, scope: !119)
!123 = !DILocation(line: 28, column: 56, scope: !119)
!124 = !DILocation(line: 28, column: 9, scope: !34)
!125 = !DILocation(line: 29, column: 9, scope: !126)
!126 = distinct !DILexicalBlock(scope: !119, file: !29, line: 28, column: 64)
!127 = !DILocation(line: 30, column: 9, scope: !126)
!128 = !DILocation(line: 32, column: 12, scope: !129)
!129 = distinct !DILexicalBlock(scope: !34, file: !29, line: 32, column: 5)
!130 = !DILocation(line: 32, column: 10, scope: !129)
!131 = !DILocation(line: 32, column: 17, scope: !132)
!132 = !DILexicalBlockFile(scope: !133, file: !29, discriminator: 1)
!133 = distinct !DILexicalBlock(scope: !129, file: !29, line: 32, column: 5)
!134 = !DILocation(line: 32, column: 39, scope: !132)
!135 = !DILocation(line: 32, column: 21, scope: !132)
!136 = !DILocation(line: 32, column: 19, scope: !132)
!137 = !DILocation(line: 32, column: 5, scope: !132)
!138 = !DILocation(line: 33, column: 36, scope: !139)
!139 = distinct !DILexicalBlock(scope: !133, file: !29, line: 32, column: 52)
!140 = !DILocation(line: 33, column: 43, scope: !139)
!141 = !DILocation(line: 33, column: 16, scope: !139)
!142 = !DILocation(line: 33, column: 14, scope: !139)
!143 = !DILocation(line: 34, column: 25, scope: !144)
!144 = distinct !DILexicalBlock(scope: !139, file: !29, line: 34, column: 13)
!145 = !DILocation(line: 34, column: 31, scope: !144)
