; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-shlib-asn_moid.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-shlib-asn_moid.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.conf_imodule_st = type opaque
%struct.conf_st = type { %struct.conf_method_st*, i8*, %struct.lhash_st_CONF_VALUE* }
%struct.conf_method_st = type { i8*, %struct.conf_st* (%struct.conf_method_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*, %struct.bio_st*, i64*)*, i32 (%struct.conf_st*, %struct.bio_st*)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8*, i64*)* }
%struct.bio_st = type opaque
%struct.lhash_st_CONF_VALUE = type { %union.lh_CONF_VALUE_dummy }
%union.lh_CONF_VALUE_dummy = type { i8* }
%struct.stack_st_CONF_VALUE = type opaque
%struct.CONF_VALUE = type { i8*, i8*, i8* }
%struct.stack_st = type opaque

@.str = private unnamed_addr constant [12 x i8] c"oid_section\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"crypto/asn1/asn_moid.c\00", align 1

; Function Attrs: nounwind uwtable
define void @ASN1_add_oid_module() #0 !dbg !23 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-shlib-asn_moid.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !10}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !8, line: 17, baseType: !9)
!8 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !8, line: 17, flags: DIFlagFwdDecl)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_VALUE", file: !12, line: 28, baseType: !13)
!12 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 24, size: 192, align: 64, elements: !14)
!14 = !{!15, !18, !19}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !13, file: !12, line: 25, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !13, file: !12, line: 26, baseType: !16, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !13, file: !12, line: 27, baseType: !16, size: 64, align: 64, offset: 128)
!20 = !{i32 2, !"Dwarf Version", i32 4}
!21 = !{i32 2, !"Debug Info Version", i32 3}
!22 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!23 = distinct !DISubprogram(name: "ASN1_add_oid_module", scope: !24, file: !24, line: 49, type: !25, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!24 = !DIFile(filename: "crypto/asn1/asn_moid.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!25 = !DISubroutineType(types: !26)
!26 = !{null}
!27 = !DILocation(line: 51, column: 5, scope: !23)
!28 = !DILocation(line: 52, column: 1, scope: !23)
!29 = distinct !DISubprogram(name: "oid_module_init", scope: !24, file: !24, line: 23, type: !30, isLocal: true, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !33, !36}
!32 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_IMODULE", file: !12, line: 52, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "conf_imodule_st", file: !12, line: 52, flags: DIFlagFwdDecl)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF", file: !39, line: 144, baseType: !40)
!39 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_st", file: !12, line: 103, size: 192, align: 64, elements: !41)
!41 = !{!42, !83, !84}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !40, file: !12, line: 104, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_METHOD", file: !12, line: 35, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_method_st", file: !12, line: 37, size: 640, align: 64, elements: !46)
!46 = !{!47, !50, !55, !59, !60, !61, !70, !74, !78, !79}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !45, file: !12, line: 38, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !45, file: !12, line: 39, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !43}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !45, file: !12, line: 40, baseType: !56, size: 64, align: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!32, !54}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !45, file: !12, line: 41, baseType: !56, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_data", scope: !45, file: !12, line: 42, baseType: !56, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "load_bio", scope: !45, file: !12, line: 43, baseType: !62, size: 64, align: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!32, !54, !65, !68}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !39, line: 79, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !39, line: 79, flags: DIFlagFwdDecl)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !45, file: !12, line: 44, baseType: !71, size: 64, align: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!32, !36, !65}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "is_number", scope: !45, file: !12, line: 45, baseType: !75, size: 64, align: 64, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!32, !36, !17}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "to_int", scope: !45, file: !12, line: 46, baseType: !75, size: 64, align: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !45, file: !12, line: 47, baseType: !80, size: 64, align: 64, offset: 576)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!32, !54, !48, !68}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "meth_data", scope: !40, file: !12, line: 105, baseType: !4, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !12, line: 106, baseType: !85, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st_CONF_VALUE", file: !12, line: 31, size: 64, align: 64, elements: !87)
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !86, file: !12, line: 31, baseType: !89, size: 64, align: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "lh_CONF_VALUE_dummy", file: !12, line: 31, size: 64, align: 64, elements: !90)
!90 = !{!91, !92, !94}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !89, file: !12, line: 31, baseType: !4, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !89, file: !12, line: 31, baseType: !93, size: 64, align: 64)
!93 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !89, file: !12, line: 31, baseType: !32, size: 32, align: 32)
!95 = !DILocalVariable(name: "md", arg: 1, scope: !29, file: !24, line: 23, type: !33)
!96 = !DIExpression()
!97 = !DILocation(line: 23, column: 42, scope: !29)
!98 = !DILocalVariable(name: "cnf", arg: 2, scope: !29, file: !24, line: 23, type: !36)
!99 = !DILocation(line: 23, column: 58, scope: !29)
!100 = !DILocalVariable(name: "i", scope: !29, file: !24, line: 25, type: !32)
!101 = !DILocation(line: 25, column: 9, scope: !29)
!102 = !DILocalVariable(name: "oid_section", scope: !29, file: !24, line: 26, type: !48)
!103 = !DILocation(line: 26, column: 17, scope: !29)
!104 = !DILocalVariable(name: "sktmp", scope: !29, file: !24, line: 27, type: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !12, line: 30, flags: DIFlagFwdDecl)
!107 = !DILocation(line: 27, column: 33, scope: !29)
!108 = !DILocalVariable(name: "oval", scope: !29, file: !24, line: 28, type: !10)
!109 = !DILocation(line: 28, column: 17, scope: !29)
!110 = !DILocation(line: 30, column: 42, scope: !29)
!111 = !DILocation(line: 30, column: 19, scope: !29)
!112 = !DILocation(line: 30, column: 17, scope: !29)
!113 = !DILocation(line: 31, column: 36, scope: !114)
!114 = distinct !DILexicalBlock(scope: !29, file: !24, line: 31, column: 9)
!115 = !DILocation(line: 31, column: 41, scope: !114)
!116 = !DILocation(line: 31, column: 18, scope: !114)
!117 = !DILocation(line: 31, column: 16, scope: !114)
!118 = !DILocation(line: 31, column: 55, scope: !114)
!119 = !DILocation(line: 31, column: 9, scope: !29)
!120 = !DILocation(line: 32, column: 9, scope: !121)
!121 = distinct !DILexicalBlock(scope: !114, file: !24, line: 31, column: 63)
!122 = !DILocation(line: 33, column: 9, scope: !121)
!123 = !DILocation(line: 35, column: 12, scope: !124)
!124 = distinct !DILexicalBlock(scope: !29, file: !24, line: 35, column: 5)
!125 = !DILocation(line: 35, column: 10, scope: !124)
!126 = !DILocation(line: 35, column: 17, scope: !127)
!127 = !DILexicalBlockFile(scope: !128, file: !24, discriminator: 1)
!128 = distinct !DILexicalBlock(scope: !124, file: !24, line: 35, column: 5)
!129 = !DILocation(line: 35, column: 39, scope: !127)
!130 = !DILocation(line: 35, column: 21, scope: !127)
!131 = !DILocation(line: 35, column: 19, scope: !127)
!132 = !DILocation(line: 35, column: 5, scope: !127)
!133 = !DILocation(line: 36, column: 36, scope: !134)
!134 = distinct !DILexicalBlock(scope: !128, file: !24, line: 35, column: 52)
!135 = !DILocation(line: 36, column: 43, scope: !134)
!136 = !DILocation(line: 36, column: 16, scope: !134)
!137 = !DILocation(line: 36, column: 14, scope: !134)
!138 = !DILocation(line: 37, column: 24, scope: !139)
!139 = distinct !DILexicalBlock(scope: !134, file: !24, line: 37, column: 13)
!140 = !DILocation(line: 37, column: 30, scope: !139)
