; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-shlib-pcy_tree.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-shlib-pcy_tree.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.X509_POLICY_TREE_st = type { %struct.X509_POLICY_LEVEL_st*, i32, %struct.stack_st_X509_POLICY_DATA*, %struct.stack_st_X509_POLICY_NODE*, %struct.stack_st_X509_POLICY_NODE*, i32 }
%struct.X509_POLICY_LEVEL_st = type { %struct.x509_st*, %struct.stack_st_X509_POLICY_NODE*, %struct.X509_POLICY_NODE_st*, i32 }
%struct.x509_st = type opaque
%struct.X509_POLICY_NODE_st = type { %struct.X509_POLICY_DATA_st*, %struct.X509_POLICY_NODE_st*, i32 }
%struct.X509_POLICY_DATA_st = type { i32, %struct.asn1_object_st*, %struct.stack_st_POLICYQUALINFO*, %struct.stack_st_ASN1_OBJECT* }
%struct.asn1_object_st = type opaque
%struct.stack_st_POLICYQUALINFO = type opaque
%struct.stack_st_ASN1_OBJECT = type opaque
%struct.stack_st_X509_POLICY_DATA = type opaque
%struct.stack_st_X509_POLICY_NODE = type opaque
%struct.stack_st = type opaque
%struct.stack_st_X509 = type opaque
%struct.X509_POLICY_CACHE_st = type { %struct.X509_POLICY_DATA_st*, %struct.stack_st_X509_POLICY_DATA*, i64, i64, i64 }
%struct.POLICYINFO_st = type { %struct.asn1_object_st*, %struct.stack_st_POLICYQUALINFO* }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-shlib-pcy_tree.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !8, !12, !13, !15, !19, !38, !27, !48, !50}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !6, line: 17, baseType: !7)
!6 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !6, line: 17, flags: DIFlagFwdDecl)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !6, line: 20, baseType: !9)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DISubroutineType(types: !11)
!11 = !{null, !12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !17, line: 124, baseType: !18)
!17 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !17, line: 124, flags: DIFlagFwdDecl)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_DATA", file: !21, line: 10, baseType: !22)
!21 = !DIFile(filename: "crypto/x509v3/pcy_int.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_DATA_st", file: !21, line: 23, size: 256, align: 64, elements: !23)
!23 = !{!24, !26, !30, !34}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !22, file: !21, line: 24, baseType: !25, size: 32, align: 32)
!25 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "valid_policy", scope: !22, file: !21, line: 26, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !17, line: 60, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !17, line: 60, flags: DIFlagFwdDecl)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier_set", scope: !22, file: !21, line: 27, baseType: !31, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_POLICYQUALINFO", file: !33, line: 623, flags: DIFlagFwdDecl)
!33 = !DIFile(filename: "include/openssl/x509_vfy.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!34 = !DIDerivedType(tag: DW_TAG_member, name: "expected_policy_set", scope: !22, file: !21, line: 28, baseType: !35, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ASN1_OBJECT", file: !37, line: 536, flags: DIFlagFwdDecl)
!37 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_NODE", file: !17, line: 157, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_NODE_st", file: !21, line: 90, size: 192, align: 64, elements: !41)
!41 = !{!42, !45, !46}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !21, line: 92, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !40, file: !21, line: 94, baseType: !38, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "nchild", scope: !40, file: !21, line: 96, baseType: !47, size: 32, align: 32, offset: 128)
!47 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_POLICY_NODE", file: !33, line: 608, flags: DIFlagFwdDecl)
!52 = !{i32 2, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!55 = distinct !DISubprogram(name: "X509_policy_tree_free", scope: !56, file: !56, line: 607, type: !57, isLocal: false, isDefinition: true, scopeLine: 608, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!56 = !DIFile(filename: "crypto/x509v3/pcy_tree.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!57 = !DISubroutineType(types: !58)
!58 = !{null, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_TREE", file: !17, line: 159, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_TREE_st", file: !21, line: 113, size: 384, align: 64, elements: !62)
!62 = !{!63, !72, !73, !76, !77, !78}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !61, file: !21, line: 115, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_LEVEL", file: !17, line: 158, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_LEVEL_st", file: !21, line: 99, size: 256, align: 64, elements: !67)
!67 = !{!68, !69, !70, !71}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !66, file: !21, line: 101, baseType: !15, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !66, file: !21, line: 103, baseType: !50, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "anyPolicy", scope: !66, file: !21, line: 105, baseType: !38, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !66, file: !21, line: 110, baseType: !25, size: 32, align: 32, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "nlevel", scope: !61, file: !21, line: 116, baseType: !47, size: 32, align: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "extra_data", scope: !61, file: !21, line: 121, baseType: !74, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_POLICY_DATA", file: !21, line: 12, flags: DIFlagFwdDecl)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "auth_policies", scope: !61, file: !21, line: 123, baseType: !50, size: 64, align: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "user_policies", scope: !61, file: !21, line: 124, baseType: !50, size: 64, align: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !61, file: !21, line: 125, baseType: !25, size: 32, align: 32, offset: 320)
!79 = !DILocalVariable(name: "tree", arg: 1, scope: !55, file: !56, line: 607, type: !59)
!80 = !DIExpression()
!81 = !DILocation(line: 607, column: 46, scope: !55)
!82 = !DILocalVariable(name: "curr", scope: !55, file: !56, line: 609, type: !64)
!83 = !DILocation(line: 609, column: 24, scope: !55)
!84 = !DILocalVariable(name: "i", scope: !55, file: !56, line: 610, type: !47)
!85 = !DILocation(line: 610, column: 9, scope: !55)
!86 = !DILocation(line: 612, column: 10, scope: !87)
!87 = distinct !DILexicalBlock(scope: !55, file: !56, line: 612, column: 9)
!88 = !DILocation(line: 612, column: 9, scope: !55)
!89 = !DILocation(line: 613, column: 9, scope: !87)
!90 = !DILocation(line: 615, column: 30, scope: !55)
!91 = !DILocation(line: 615, column: 36, scope: !55)
!92 = !DILocation(line: 615, column: 5, scope: !55)
!93 = !DILocation(line: 616, column: 34, scope: !55)
!94 = !DILocation(line: 616, column: 40, scope: !55)
!95 = !DILocation(line: 616, column: 5, scope: !55)
!96 = !DILocation(line: 618, column: 12, scope: !97)
!97 = distinct !DILexicalBlock(scope: !55, file: !56, line: 618, column: 5)
!98 = !DILocation(line: 618, column: 24, scope: !97)
!99 = !DILocation(line: 618, column: 30, scope: !97)
!100 = !DILocation(line: 618, column: 22, scope: !97)
!101 = !DILocation(line: 618, column: 10, scope: !97)
!102 = !DILocation(line: 618, column: 38, scope: !103)
!103 = !DILexicalBlockFile(scope: !104, file: !56, discriminator: 1)
!104 = distinct !DILexicalBlock(scope: !97, file: !56, line: 618, column: 5)
!105 = !DILocation(line: 618, column: 42, scope: !103)
!106 = !DILocation(line: 618, column: 48, scope: !103)
!107 = !DILocation(line: 618, column: 40, scope: !103)
!108 = !DILocation(line: 618, column: 5, scope: !103)
!109 = !DILocation(line: 619, column: 19, scope: !110)
!110 = distinct !DILexicalBlock(scope: !104, file: !56, line: 618, column: 69)
!111 = !DILocation(line: 619, column: 25, scope: !110)
!112 = !DILocation(line: 619, column: 9, scope: !110)
!113 = !DILocation(line: 620, column: 38, scope: !110)
!114 = !DILocation(line: 620, column: 44, scope: !110)
!115 = !DILocation(line: 620, column: 9, scope: !110)
!116 = !DILocation(line: 621, column: 26, scope: !110)
!117 = !DILocation(line: 621, column: 32, scope: !110)
!118 = !DILocation(line: 621, column: 9, scope: !110)
!119 = !DILocation(line: 622, column: 5, scope: !110)
!120 = !DILocation(line: 618, column: 57, scope: !121)
!121 = !DILexicalBlockFile(scope: !104, file: !56, discriminator: 2)
!122 = !DILocation(line: 618, column: 65, scope: !121)
!123 = !DILocation(line: 618, column: 5, scope: !121)
!124 = distinct !{!124, !125}
!125 = !DILocation(line: 618, column: 5, scope: !55)
!126 = !DILocation(line: 624, column: 34, scope: !55)
!127 = !DILocation(line: 624, column: 40, scope: !55)
!128 = !DILocation(line: 624, column: 5, scope: !55)
!129 = !DILocation(line: 625, column: 17, scope: !55)
!130 = !DILocation(line: 625, column: 23, scope: !55)
!131 = !DILocation(line: 625, column: 5, scope: !55)
!132 = !DILocation(line: 626, column: 17, scope: !55)
!133 = !DILocation(line: 626, column: 5, scope: !55)
!134 = !DILocation(line: 628, column: 1, scope: !55)
!135 = !DILocation(line: 628, column: 1, scope: !136)
!136 = !DILexicalBlockFile(scope: !55, file: !56, discriminator: 1)
!137 = distinct !DISubprogram(name: "sk_X509_POLICY_NODE_free", scope: !138, file: !138, line: 719, type: !139, isLocal: true, isDefinition: true, scopeLine: 719, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!138 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!139 = !DISubroutineType(types: !140)
!140 = !{null, !50}
!141 = !DILocalVariable(name: "sk", arg: 1, scope: !137, file: !138, line: 719, type: !50)
!142 = !DILocation(line: 719, column: 1612, scope: !137)
!143 = !DILocation(line: 719, column: 1651, scope: !137)
!144 = !DILocation(line: 719, column: 1634, scope: !137)
!145 = !DILocation(line: 719, column: 1618, scope: !137)
!146 = !DILocation(line: 719, column: 1656, scope: !137)
!147 = distinct !DISubprogram(name: "sk_X509_POLICY_NODE_pop_free", scope: !138, file: !138, line: 719, type: !148, isLocal: true, isDefinition: true, scopeLine: 719, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !50, !150}
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_X509_POLICY_NODE_freefunc", file: !138, line: 719, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !38}
!154 = !DILocalVariable(name: "sk", arg: 1, scope: !147, file: !138, line: 719, type: !50)
!155 = !DILocation(line: 719, column: 3130, scope: !147)
!156 = !DILocalVariable(name: "freefunc", arg: 2, scope: !147, file: !138, line: 719, type: !150)
!157 = !DILocation(line: 719, column: 3163, scope: !147)
!158 = !DILocation(line: 719, column: 3212, scope: !147)
!159 = !DILocation(line: 719, column: 3195, scope: !147)
!160 = !DILocation(line: 719, column: 3237, scope: !147)
!161 = !DILocation(line: 719, column: 3216, scope: !147)
!162 = !DILocation(line: 719, column: 3175, scope: !147)
!163 = !DILocation(line: 719, column: 3248, scope: !147)
!164 = distinct !DISubprogram(name: "exnode_free", scope: !56, file: !56, line: 601, type: !152, isLocal: true, isDefinition: true, scopeLine: 602, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!165 = !DILocalVariable(name: "node", arg: 1, scope: !164, file: !56, line: 601, type: !38)
!166 = !DILocation(line: 601, column: 43, scope: !164)
!167 = !DILocation(line: 603, column: 9, scope: !168)
!168 = distinct !DILexicalBlock(scope: !164, file: !56, line: 603, column: 9)
!169 = !DILocation(line: 603, column: 15, scope: !168)
!170 = !DILocation(line: 603, column: 20, scope: !168)
!171 = !DILocation(line: 603, column: 24, scope: !172)
!172 = !DILexicalBlockFile(scope: !168, file: !56, discriminator: 1)
!173 = !DILocation(line: 603, column: 30, scope: !172)
!174 = !DILocation(line: 603, column: 36, scope: !172)
!175 = !DILocation(line: 603, column: 42, scope: !172)
!176 = !DILocation(line: 603, column: 9, scope: !172)
!177 = !DILocation(line: 604, column: 21, scope: !168)
!178 = !DILocation(line: 604, column: 9, scope: !168)
!179 = !DILocation(line: 605, column: 1, scope: !164)
!180 = distinct !DISubprogram(name: "sk_X509_POLICY_DATA_pop_free", scope: !21, file: !21, line: 12, type: !181, isLocal: true, isDefinition: true, scopeLine: 12, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !74, !183}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_X509_POLICY_DATA_freefunc", file: !21, line: 12, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !19}
!187 = !DILocalVariable(name: "sk", arg: 1, scope: !180, file: !21, line: 12, type: !74)
!188 = !DILocation(line: 12, column: 3130, scope: !180)
!189 = !DILocalVariable(name: "freefunc", arg: 2, scope: !180, file: !21, line: 12, type: !183)
!190 = !DILocation(line: 12, column: 3163, scope: !180)
!191 = !DILocation(line: 12, column: 3212, scope: !180)
!192 = !DILocation(line: 12, column: 3195, scope: !180)
!193 = !DILocation(line: 12, column: 3237, scope: !180)
!194 = !DILocation(line: 12, column: 3216, scope: !180)
!195 = !DILocation(line: 12, column: 3175, scope: !180)
!196 = !DILocation(line: 12, column: 3248, scope: !180)
!197 = distinct !DISubprogram(name: "X509_policy_check", scope: !56, file: !56, line: 638, type: !198, isLocal: false, isDefinition: true, scopeLine: 641, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!198 = !DISubroutineType(types: !199)
!199 = !{!47, !200, !201, !202, !35, !25}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !204, line: 99, flags: DIFlagFwdDecl)
!204 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!205 = !DILocalVariable(name: "ptree", arg: 1, scope: !197, file: !56, line: 638, type: !200)
!206 = !DILocation(line: 638, column: 42, scope: !197)
!207 = !DILocalVariable(name: "pexplicit_policy", arg: 2, scope: !197, file: !56, line: 638, type: !201)
!208 = !DILocation(line: 638, column: 54, scope: !197)
!209 = !DILocalVariable(name: "certs", arg: 3, scope: !197, file: !56, line: 639, type: !202)
!210 = !DILocation(line: 639, column: 45, scope: !197)
!211 = !DILocalVariable(name: "policy_oids", arg: 4, scope: !197, file: !56, line: 640, type: !35)
!212 = !DILocation(line: 640, column: 52, scope: !197)
!213 = !DILocalVariable(name: "flags", arg: 5, scope: !197, file: !56, line: 640, type: !25)
!214 = !DILocation(line: 640, column: 78, scope: !197)
!215 = !DILocalVariable(name: "init_ret", scope: !197, file: !56, line: 642, type: !47)
!216 = !DILocation(line: 642, column: 9, scope: !197)
!217 = !DILocalVariable(name: "ret", scope: !197, file: !56, line: 643, type: !47)
!218 = !DILocation(line: 643, column: 9, scope: !197)
!219 = !DILocalVariable(name: "calc_ret", scope: !197, file: !56, line: 644, type: !47)
!220 = !DILocation(line: 644, column: 9, scope: !197)
!221 = !DILocalVariable(name: "tree", scope: !197, file: !56, line: 645, type: !59)
!222 = !DILocation(line: 645, column: 23, scope: !197)
!223 = !DILocalVariable(name: "nodes", scope: !197, file: !56, line: 646, type: !50)
!224 = !DILocation(line: 646, column: 39, scope: !197)
!225 = !DILocalVariable(name: "auth_nodes", scope: !197, file: !56, line: 646, type: !50)
!226 = !DILocation(line: 646, column: 47, scope: !197)
!227 = !DILocation(line: 648, column: 6, scope: !197)
!228 = !DILocation(line: 648, column: 12, scope: !197)
!229 = !DILocation(line: 649, column: 6, scope: !197)
!230 = !DILocation(line: 649, column: 23, scope: !197)
!231 = !DILocation(line: 650, column: 33, scope: !197)
!232 = !DILocation(line: 650, column: 40, scope: !197)
!233 = !DILocation(line: 650, column: 16, scope: !197)
!234 = !DILocation(line: 650, column: 14, scope: !197)
!235 = !DILocation(line: 652, column: 9, scope: !236)
!236 = distinct !DILexicalBlock(scope: !197, file: !56, line: 652, column: 9)
!237 = !DILocation(line: 652, column: 18, scope: !236)
!238 = !DILocation(line: 652, column: 9, scope: !197)
!239 = !DILocation(line: 653, column: 16, scope: !236)
!240 = !DILocation(line: 653, column: 9, scope: !236)
!241 = !DILocation(line: 655, column: 10, scope: !242)
!242 = distinct !DILexicalBlock(scope: !197, file: !56, line: 655, column: 9)
!243 = !DILocation(line: 655, column: 19, scope: !242)
!244 = !DILocation(line: 655, column: 24, scope: !242)
!245 = !DILocation(line: 655, column: 9, scope: !197)
!246 = !DILocation(line: 656, column: 13, scope: !247)
!247 = distinct !DILexicalBlock(scope: !248, file: !56, line: 656, column: 13)
!248 = distinct !DILexicalBlock(scope: !242, file: !56, line: 655, column: 30)
!249 = !DILocation(line: 656, column: 22, scope: !247)
!250 = !DILocation(line: 656, column: 13, scope: !248)
!251 = !DILocation(line: 657, column: 35, scope: !252)
!252 = distinct !DILexicalBlock(scope: !247, file: !56, line: 656, column: 27)
!253 = !DILocation(line: 657, column: 13, scope: !252)
!254 = !DILocation(line: 658, column: 13, scope: !252)
!255 = !DILocation(line: 660, column: 5, scope: !248)
!256 = !DILocation(line: 661, column: 10, scope: !257)
!257 = distinct !DILexicalBlock(scope: !242, file: !56, line: 660, column: 12)
!258 = !DILocation(line: 661, column: 27, scope: !257)
!259 = !DILocation(line: 663, column: 13, scope: !260)
!260 = distinct !DILexicalBlock(scope: !257, file: !56, line: 663, column: 13)
!261 = !DILocation(line: 663, column: 22, scope: !260)
!262 = !DILocation(line: 663, column: 13, scope: !257)
!263 = !DILocation(line: 664, column: 13, scope: !260)
!264 = !DILocation(line: 667, column: 25, scope: !197)
!265 = !DILocation(line: 667, column: 11, scope: !197)
!266 = !DILocation(line: 667, column: 9, scope: !197)
!267 = !DILocation(line: 671, column: 9, scope: !268)
!268 = distinct !DILexicalBlock(scope: !197, file: !56, line: 671, column: 9)
!269 = !DILocation(line: 671, column: 13, scope: !268)
!270 = !DILocation(line: 671, column: 9, scope: !197)
!271 = !DILocation(line: 672, column: 9, scope: !268)
!272 = !DILocation(line: 674, column: 9, scope: !273)
!273 = distinct !DILexicalBlock(scope: !197, file: !56, line: 674, column: 9)
!274 = !DILocation(line: 674, column: 13, scope: !273)
!275 = !DILocation(line: 674, column: 9, scope: !197)
!276 = !DILocation(line: 675, column: 31, scope: !277)
!277 = distinct !DILexicalBlock(scope: !273, file: !56, line: 674, column: 19)
!278 = !DILocation(line: 675, column: 9, scope: !277)
!279 = !DILocation(line: 676, column: 13, scope: !280)
!280 = distinct !DILexicalBlock(scope: !277, file: !56, line: 676, column: 13)
!281 = !DILocation(line: 676, column: 22, scope: !280)
!282 = !DILocation(line: 676, column: 13, scope: !277)
!283 = !DILocation(line: 677, column: 13, scope: !280)
!284 = !DILocation(line: 678, column: 9, scope: !277)
!285 = !DILocation(line: 683, column: 50, scope: !286)
!286 = distinct !DILexicalBlock(scope: !197, file: !56, line: 683, column: 9)
!287 = !DILocation(line: 683, column: 21, scope: !286)
!288 = !DILocation(line: 683, column: 19, scope: !286)
!289 = !DILocation(line: 683, column: 70, scope: !286)
!290 = !DILocation(line: 683, column: 9, scope: !197)
!291 = !DILocation(line: 684, column: 9, scope: !286)
!292 = !DILocation(line: 685, column: 35, scope: !197)
!293 = !DILocation(line: 685, column: 41, scope: !197)
!294 = !DILocation(line: 685, column: 54, scope: !197)
!295 = !DILocation(line: 685, column: 11, scope: !197)
!296 = !DILocation(line: 685, column: 9, scope: !197)
!297 = !DILocation(line: 686, column: 9, scope: !298)
!298 = distinct !DILexicalBlock(scope: !197, file: !56, line: 686, column: 9)
!299 = !DILocation(line: 686, column: 18, scope: !298)
!300 = !DILocation(line: 686, column: 9, scope: !197)
!301 = !DILocation(line: 687, column: 34, scope: !298)
!302 = !DILocation(line: 687, column: 9, scope: !298)
!303 = !DILocation(line: 688, column: 10, scope: !304)
!304 = distinct !DILexicalBlock(scope: !197, file: !56, line: 688, column: 9)
!305 = !DILocation(line: 688, column: 9, scope: !197)
!306 = !DILocation(line: 689, column: 9, scope: !304)
!307 = !DILocation(line: 691, column: 14, scope: !197)
!308 = !DILocation(line: 691, column: 6, scope: !197)
!309 = !DILocation(line: 691, column: 12, scope: !197)
!310 = !DILocation(line: 693, column: 9, scope: !311)
!311 = distinct !DILexicalBlock(scope: !197, file: !56, line: 693, column: 9)
!312 = !DILocation(line: 693, column: 18, scope: !311)
!313 = !DILocation(line: 693, column: 9, scope: !197)
!314 = !DILocation(line: 694, column: 53, scope: !315)
!315 = distinct !DILexicalBlock(scope: !311, file: !56, line: 693, column: 23)
!316 = !DILocation(line: 694, column: 17, scope: !315)
!317 = !DILocation(line: 694, column: 15, scope: !315)
!318 = !DILocation(line: 695, column: 37, scope: !319)
!319 = distinct !DILexicalBlock(scope: !315, file: !56, line: 695, column: 13)
!320 = !DILocation(line: 695, column: 13, scope: !319)
!321 = !DILocation(line: 695, column: 44, scope: !319)
!322 = !DILocation(line: 695, column: 13, scope: !315)
!323 = !DILocation(line: 696, column: 13, scope: !319)
!324 = !DILocation(line: 697, column: 5, scope: !315)
!325 = !DILocation(line: 698, column: 5, scope: !197)
!326 = !DILocation(line: 701, column: 27, scope: !197)
!327 = !DILocation(line: 701, column: 5, scope: !197)
!328 = !DILocation(line: 702, column: 5, scope: !197)
!329 = !DILocation(line: 703, column: 1, scope: !197)
!330 = distinct !DISubprogram(name: "tree_init", scope: !56, file: !56, line: 89, type: !331, isLocal: true, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!331 = !DISubroutineType(types: !332)
!332 = !{!47, !200, !202, !25}
!333 = !DILocalVariable(name: "ptree", arg: 1, scope: !330, file: !56, line: 89, type: !200)
!334 = !DILocation(line: 89, column: 41, scope: !330)
!335 = !DILocalVariable(name: "certs", arg: 2, scope: !330, file: !56, line: 89, type: !202)
!336 = !DILocation(line: 89, column: 70, scope: !330)
!337 = !DILocalVariable(name: "flags", arg: 3, scope: !330, file: !56, line: 90, type: !25)
!338 = !DILocation(line: 90, column: 35, scope: !330)
!339 = !DILocalVariable(name: "tree", scope: !330, file: !56, line: 92, type: !59)
!340 = !DILocation(line: 92, column: 23, scope: !330)
!341 = !DILocalVariable(name: "level", scope: !330, file: !56, line: 93, type: !64)
!342 = !DILocation(line: 93, column: 24, scope: !330)
!343 = !DILocalVariable(name: "cache", scope: !330, file: !56, line: 94, type: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_CACHE", file: !17, line: 160, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_CACHE_st", file: !21, line: 65, size: 320, align: 64, elements: !348)
!348 = !{!349, !350, !351, !353, !354}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "anyPolicy", scope: !347, file: !21, line: 67, baseType: !19, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !347, file: !21, line: 69, baseType: !74, size: 64, align: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "any_skip", scope: !347, file: !21, line: 71, baseType: !352, size: 64, align: 64, offset: 128)
!352 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_skip", scope: !347, file: !21, line: 76, baseType: !352, size: 64, align: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "map_skip", scope: !347, file: !21, line: 81, baseType: !352, size: 64, align: 64, offset: 256)
!355 = !DILocation(line: 94, column: 30, scope: !330)
!356 = !DILocalVariable(name: "data", scope: !330, file: !56, line: 95, type: !19)
!357 = !DILocation(line: 95, column: 23, scope: !330)
!358 = !DILocalVariable(name: "ret", scope: !330, file: !56, line: 96, type: !47)
!359 = !DILocation(line: 96, column: 9, scope: !330)
!360 = !DILocalVariable(name: "n", scope: !330, file: !56, line: 97, type: !47)
!361 = !DILocation(line: 97, column: 9, scope: !330)
!362 = !DILocation(line: 97, column: 25, scope: !330)
!363 = !DILocation(line: 97, column: 13, scope: !330)
!364 = !DILocation(line: 97, column: 32, scope: !330)
!365 = !DILocalVariable(name: "explicit_policy", scope: !330, file: !56, line: 98, type: !47)
!366 = !DILocation(line: 98, column: 9, scope: !330)
!367 = !DILocation(line: 98, column: 28, scope: !330)
!368 = !DILocation(line: 98, column: 34, scope: !330)
!369 = !DILocation(line: 98, column: 27, scope: !330)
!370 = !DILocation(line: 98, column: 27, scope: !371)
!371 = !DILexicalBlockFile(scope: !330, file: !56, discriminator: 1)
!372 = !DILocation(line: 98, column: 49, scope: !373)
!373 = !DILexicalBlockFile(scope: !330, file: !56, discriminator: 2)
!374 = !DILocation(line: 98, column: 50, scope: !373)
!375 = !DILocation(line: 98, column: 27, scope: !373)
!376 = !DILocation(line: 98, column: 27, scope: !377)
!377 = !DILexicalBlockFile(scope: !330, file: !56, discriminator: 3)
!378 = !DILocation(line: 98, column: 9, scope: !377)
!379 = !DILocalVariable(name: "any_skip", scope: !330, file: !56, line: 99, type: !47)
!380 = !DILocation(line: 99, column: 9, scope: !330)
!381 = !DILocation(line: 99, column: 21, scope: !330)
!382 = !DILocation(line: 99, column: 27, scope: !330)
!383 = !DILocation(line: 99, column: 20, scope: !330)
!384 = !DILocation(line: 99, column: 20, scope: !371)
!385 = !DILocation(line: 99, column: 42, scope: !373)
!386 = !DILocation(line: 99, column: 43, scope: !373)
!387 = !DILocation(line: 99, column: 20, scope: !373)
!388 = !DILocation(line: 99, column: 20, scope: !377)
!389 = !DILocation(line: 99, column: 9, scope: !377)
!390 = !DILocalVariable(name: "map_skip", scope: !330, file: !56, line: 100, type: !47)
!391 = !DILocation(line: 100, column: 9, scope: !330)
!392 = !DILocation(line: 100, column: 21, scope: !330)
!393 = !DILocation(line: 100, column: 27, scope: !330)
!394 = !DILocation(line: 100, column: 20, scope: !330)
!395 = !DILocation(line: 100, column: 20, scope: !371)
!396 = !DILocation(line: 100, column: 42, scope: !373)
!397 = !DILocation(line: 100, column: 43, scope: !373)
!398 = !DILocation(line: 100, column: 20, scope: !373)
!399 = !DILocation(line: 100, column: 20, scope: !377)
!400 = !DILocation(line: 100, column: 9, scope: !377)
!401 = !DILocalVariable(name: "i", scope: !330, file: !56, line: 101, type: !47)
!402 = !DILocation(line: 101, column: 9, scope: !330)
!403 = !DILocation(line: 103, column: 6, scope: !330)
!404 = !DILocation(line: 103, column: 12, scope: !330)
!405 = !DILocation(line: 106, column: 9, scope: !406)
!406 = distinct !DILexicalBlock(scope: !330, file: !56, line: 106, column: 9)
!407 = !DILocation(line: 106, column: 11, scope: !406)
!408 = !DILocation(line: 106, column: 9, scope: !330)
!409 = !DILocation(line: 107, column: 9, scope: !406)
!410 = !DILocation(line: 114, column: 14, scope: !411)
!411 = distinct !DILexicalBlock(scope: !330, file: !56, line: 114, column: 5)
!412 = !DILocation(line: 114, column: 16, scope: !411)
!413 = !DILocation(line: 114, column: 12, scope: !411)
!414 = !DILocation(line: 114, column: 10, scope: !411)
!415 = !DILocation(line: 114, column: 21, scope: !416)
!416 = !DILexicalBlockFile(scope: !417, file: !56, discriminator: 1)
!417 = distinct !DILexicalBlock(scope: !411, file: !56, line: 114, column: 5)
!418 = !DILocation(line: 114, column: 23, scope: !416)
!419 = !DILocation(line: 114, column: 5, scope: !416)
