; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--evp--libcrypto-shlib-bio_b64.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--evp--libcrypto-shlib-bio_b64.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bio_method_st = type { i32, i8*, i32 (%struct.bio_st*, i8*, i64, i64*)*, i32 (%struct.bio_st*, i8*, i32)*, i32 (%struct.bio_st*, i8*, i64, i64*)*, i32 (%struct.bio_st*, i8*, i32)*, i32 (%struct.bio_st*, i8*)*, i32 (%struct.bio_st*, i8*, i32)*, i64 (%struct.bio_st*, i32, i64, i8*)*, i32 (%struct.bio_st*)*, i32 (%struct.bio_st*)*, i64 (%struct.bio_st*, i32, i32 (%struct.bio_st*, i32, i32)*)* }
%struct.bio_st = type opaque
%struct.b64_struct = type { i32, i32, i32, i32, i32, i32, i32, %struct.evp_Encode_Ctx_st*, [1502 x i8], [1024 x i8] }
%struct.evp_Encode_Ctx_st = type opaque


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !36)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--evp--libcrypto-shlib-bio_b64.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !31, !10, !32, !34}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO_B64_CTX", file: !6, line: 44, baseType: !7)
!6 = !DIFile(filename: "crypto/evp/bio_b64.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "b64_struct", file: !6, line: 30, size: 20544, align: 64, elements: !8)
!8 = !{!9, !11, !12, !13, !14, !15, !16, !17, !22, !27}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !7, file: !6, line: 34, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "buf_off", scope: !7, file: !6, line: 35, baseType: !10, size: 32, align: 32, offset: 32)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_len", scope: !7, file: !6, line: 36, baseType: !10, size: 32, align: 32, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_nl", scope: !7, file: !6, line: 37, baseType: !10, size: 32, align: 32, offset: 96)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "encode", scope: !7, file: !6, line: 38, baseType: !10, size: 32, align: 32, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !7, file: !6, line: 39, baseType: !10, size: 32, align: 32, offset: 160)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !7, file: !6, line: 40, baseType: !10, size: 32, align: 32, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "base64", scope: !7, file: !6, line: 41, baseType: !18, size: 64, align: 64, offset: 256)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_ENCODE_CTX", file: !20, line: 104, baseType: !21)
!20 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_Encode_Ctx_st", file: !20, line: 104, flags: DIFlagFwdDecl)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !7, file: !6, line: 42, baseType: !23, size: 12016, align: 8, offset: 320)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 12016, align: 8, elements: !25)
!24 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!25 = !{!26}
!26 = !DISubrange(count: 1502)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !7, file: !6, line: 43, baseType: !28, size: 8192, align: 8, offset: 12336)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8192, align: 8, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 1024)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!36 = !{!37}
!37 = distinct !DIGlobalVariable(name: "methods_b64", scope: !0, file: !6, line: 46, type: !38, isLocal: true, isDefinition: true, variable: %struct.bio_method_st* @methods_b64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO_METHOD", file: !40, line: 263, baseType: !41)
!40 = !DIFile(filename: "include/openssl/bio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bio_method_st", file: !42, line: 15, size: 768, align: 64, elements: !43)
!42 = !DIFile(filename: "include/internal/bio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!43 = !{!44, !45, !47, !60, !64, !68, !72, !76, !77, !82, !86, !87}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !41, file: !42, line: 16, baseType: !10, size: 32, align: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !41, file: !42, line: 17, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "bwrite", scope: !41, file: !42, line: 18, baseType: !48, size: 64, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!10, !51, !54, !56, !59}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !20, line: 79, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !20, line: 79, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !57, line: 216, baseType: !58)
!57 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!58 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "bwrite_old", scope: !41, file: !42, line: 19, baseType: !61, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!10, !51, !54, !10}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "bread", scope: !41, file: !42, line: 20, baseType: !65, size: 64, align: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!10, !51, !46, !56, !59}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "bread_old", scope: !41, file: !42, line: 21, baseType: !69, size: 64, align: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!10, !51, !46, !10}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "bputs", scope: !41, file: !42, line: 22, baseType: !73, size: 64, align: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!10, !51, !54}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "bgets", scope: !41, file: !42, line: 23, baseType: !69, size: 64, align: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !41, file: !42, line: 24, baseType: !78, size: 64, align: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !51, !10, !81, !31}
!81 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !41, file: !42, line: 25, baseType: !83, size: 64, align: 64, offset: 576)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!10, !51}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !41, file: !42, line: 26, baseType: !83, size: 64, align: 64, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "callback_ctrl", scope: !41, file: !42, line: 27, baseType: !88, size: 64, align: 64, offset: 704)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!81, !51, !10, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO_info_cb", file: !40, line: 268, baseType: !93)
!93 = !DISubroutineType(types: !94)
!94 = !{!10, !51, !10, !10}
!95 = !{i32 2, !"Dwarf Version", i32 4}
!96 = !{i32 2, !"Debug Info Version", i32 3}
!97 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!98 = distinct !DISubprogram(name: "BIO_f_base64", scope: !6, file: !6, line: 64, type: !99, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!99 = !DISubroutineType(types: !100)
!100 = !{!101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!102 = !DILocation(line: 66, column: 5, scope: !98)
!103 = distinct !DISubprogram(name: "b64_write", scope: !6, file: !6, line: 328, type: !62, isLocal: true, isDefinition: true, scopeLine: 329, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!104 = !DILocalVariable(name: "b", arg: 1, scope: !103, file: !6, line: 328, type: !51)
!105 = !DIExpression()
!106 = !DILocation(line: 328, column: 27, scope: !103)
!107 = !DILocalVariable(name: "in", arg: 2, scope: !103, file: !6, line: 328, type: !54)
!108 = !DILocation(line: 328, column: 42, scope: !103)
!109 = !DILocalVariable(name: "inl", arg: 3, scope: !103, file: !6, line: 328, type: !10)
!110 = !DILocation(line: 328, column: 50, scope: !103)
!111 = !DILocalVariable(name: "ret", scope: !103, file: !6, line: 330, type: !10)
!112 = !DILocation(line: 330, column: 9, scope: !103)
!113 = !DILocalVariable(name: "n", scope: !103, file: !6, line: 331, type: !10)
!114 = !DILocation(line: 331, column: 9, scope: !103)
!115 = !DILocalVariable(name: "i", scope: !103, file: !6, line: 332, type: !10)
!116 = !DILocation(line: 332, column: 9, scope: !103)
!117 = !DILocalVariable(name: "ctx", scope: !103, file: !6, line: 333, type: !4)
!118 = !DILocation(line: 333, column: 18, scope: !103)
!119 = !DILocalVariable(name: "next", scope: !103, file: !6, line: 334, type: !51)
!120 = !DILocation(line: 334, column: 10, scope: !103)
!121 = !DILocation(line: 336, column: 39, scope: !103)
!122 = !DILocation(line: 336, column: 26, scope: !103)
!123 = !DILocation(line: 336, column: 11, scope: !103)
!124 = !DILocation(line: 336, column: 9, scope: !103)
!125 = !DILocation(line: 337, column: 21, scope: !103)
!126 = !DILocation(line: 337, column: 12, scope: !103)
!127 = !DILocation(line: 337, column: 10, scope: !103)
!128 = !DILocation(line: 338, column: 10, scope: !129)
!129 = distinct !DILexicalBlock(scope: !103, file: !6, line: 338, column: 9)
!130 = !DILocation(line: 338, column: 14, scope: !129)
!131 = !DILocation(line: 338, column: 22, scope: !129)
!132 = !DILocation(line: 338, column: 26, scope: !133)
!133 = !DILexicalBlockFile(scope: !129, file: !6, discriminator: 1)
!134 = !DILocation(line: 338, column: 31, scope: !133)
!135 = !DILocation(line: 338, column: 9, scope: !133)
!136 = !DILocation(line: 339, column: 9, scope: !129)
!137 = !DILocation(line: 341, column: 21, scope: !103)
!138 = !DILocation(line: 341, column: 5, scope: !103)
!139 = !DILocation(line: 343, column: 9, scope: !140)
!140 = distinct !DILexicalBlock(scope: !103, file: !6, line: 343, column: 9)
!141 = !DILocation(line: 343, column: 14, scope: !140)
!142 = !DILocation(line: 343, column: 21, scope: !140)
!143 = !DILocation(line: 343, column: 9, scope: !103)
!144 = !DILocation(line: 344, column: 9, scope: !145)
!145 = distinct !DILexicalBlock(scope: !140, file: !6, line: 343, column: 27)
!146 = !DILocation(line: 344, column: 14, scope: !145)
!147 = !DILocation(line: 344, column: 21, scope: !145)
