; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--ts--libcrypto-lib-ts_rsp_verify.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--ts--libcrypto-lib-ts_rsp_verify.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon = type { i32, i8* }
%struct.pkcs7_st = type { i8*, i64, i32, i32, %struct.asn1_object_st*, %union.anon }
%struct.asn1_object_st = type opaque
%union.anon = type { i8* }
%struct.stack_st_X509 = type opaque
%struct.x509_store_st = type opaque
%struct.x509_st = type opaque
%struct.stack_st_PKCS7_SIGNER_INFO = type opaque
%struct.pkcs7_signer_info_st = type { %struct.asn1_string_st*, %struct.pkcs7_issuer_and_serial_st*, %struct.X509_algor_st*, %struct.stack_st_X509_ATTRIBUTE*, %struct.X509_algor_st*, %struct.asn1_string_st*, %struct.stack_st_X509_ATTRIBUTE*, %struct.evp_pkey_st* }
%struct.pkcs7_issuer_and_serial_st = type { %struct.X509_name_st*, %struct.asn1_string_st* }
%struct.X509_name_st = type opaque
%struct.X509_algor_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_type_st = type { i32, %union.anon.0 }
%union.anon.0 = type { i8* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.stack_st_X509_ATTRIBUTE = type opaque
%struct.evp_pkey_st = type opaque
%struct.bio_st = type opaque
%struct.stack_st = type opaque
%struct.x509_store_ctx_st = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !194)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--ts--libcrypto-lib-ts_rsp_verify.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !9, !123, !126, !127, !131, !132, !149, !22, !184, !191, !28, !192, !105}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !7, line: 17, baseType: !8)
!7 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !7, line: 17, flags: DIFlagFwdDecl)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGNER_INFO", file: !11, line: 47, baseType: !12)
!11 = !DIFile(filename: "include/openssl/pkcs7.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signer_info_st", file: !11, line: 37, size: 512, align: 64, elements: !13)
!13 = !{!14, !29, !39, !113, !116, !117, !118, !119}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !12, file: !11, line: 38, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !17, line: 40, baseType: !18)
!17 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !19, line: 146, size: 192, align: 64, elements: !20)
!19 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!20 = !{!21, !23, !24, !27}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !18, file: !19, line: 147, baseType: !22, size: 32, align: 32)
!22 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !18, file: !19, line: 148, baseType: !22, size: 32, align: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !18, file: !19, line: 149, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !18, file: !19, line: 155, baseType: !28, size: 64, align: 64, offset: 128)
!28 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_and_serial", scope: !12, file: !11, line: 39, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ISSUER_AND_SERIAL", file: !11, line: 35, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_issuer_and_serial_st", file: !11, line: 32, size: 128, align: 64, elements: !33)
!33 = !{!34, !38}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !32, file: !11, line: 33, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !17, line: 129, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !17, line: 129, flags: DIFlagFwdDecl)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !32, file: !11, line: 34, baseType: !15, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "digest_alg", scope: !12, file: !11, line: 40, baseType: !40, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !17, line: 125, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !43, line: 59, size: 128, align: 64, elements: !44)
!43 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!44 = !{!45, !49}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !42, file: !43, line: 60, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !17, line: 60, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !17, line: 60, flags: DIFlagFwdDecl)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !42, file: !43, line: 61, baseType: !50, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !19, line: 473, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !19, line: 444, size: 128, align: 64, elements: !53)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !52, file: !19, line: 445, baseType: !22, size: 32, align: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !52, file: !19, line: 472, baseType: !56, size: 64, align: 64, offset: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !52, file: !19, line: 446, size: 64, align: 64, elements: !57)
!57 = !{!58, !61, !63, !66, !67, !68, !71, !74, !77, !80, !83, !86, !89, !92, !95, !98, !101, !104, !107, !108, !109}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !56, file: !19, line: 447, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !56, file: !19, line: 448, baseType: !62, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !17, line: 56, baseType: !22)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !56, file: !19, line: 449, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !17, line: 55, baseType: !18)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !56, file: !19, line: 450, baseType: !46, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !56, file: !19, line: 451, baseType: !15, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !56, file: !19, line: 452, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !17, line: 41, baseType: !18)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !56, file: !19, line: 453, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !17, line: 42, baseType: !18)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !56, file: !19, line: 454, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !17, line: 43, baseType: !18)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !56, file: !19, line: 455, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !17, line: 44, baseType: !18)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !56, file: !19, line: 456, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !17, line: 45, baseType: !18)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !56, file: !19, line: 457, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !17, line: 46, baseType: !18)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !56, file: !19, line: 458, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !17, line: 47, baseType: !18)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !56, file: !19, line: 459, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !17, line: 49, baseType: !18)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !56, file: !19, line: 460, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !17, line: 48, baseType: !18)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !56, file: !19, line: 461, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !17, line: 50, baseType: !18)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !56, file: !19, line: 462, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !17, line: 52, baseType: !18)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !56, file: !19, line: 463, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !17, line: 53, baseType: !18)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !56, file: !19, line: 464, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !17, line: 54, baseType: !18)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !56, file: !19, line: 469, baseType: !64, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !56, file: !19, line: 470, baseType: !64, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !56, file: !19, line: 471, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !19, line: 213, baseType: !112)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !19, line: 213, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "auth_attr", scope: !12, file: !11, line: 41, baseType: !114, size: 64, align: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ATTRIBUTE", file: !43, line: 89, flags: DIFlagFwdDecl)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "digest_enc_alg", scope: !12, file: !11, line: 42, baseType: !40, size: 64, align: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "enc_digest", scope: !12, file: !11, line: 43, baseType: !75, size: 64, align: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "unauth_attr", scope: !12, file: !11, line: 44, baseType: !114, size: 64, align: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !12, file: !11, line: 46, baseType: !120, size: 64, align: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !17, line: 95, baseType: !122)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !17, line: 95, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !17, line: 124, baseType: !125)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !17, line: 124, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !7, line: 20, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ESS_CERT_ID", file: !134, line: 23, baseType: !135)
!134 = !DIFile(filename: "include/openssl/ess.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ESS_cert_id", file: !136, line: 37, size: 128, align: 64, elements: !137)
!136 = !DIFile(filename: "crypto/include/internal/ess_int.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !135, file: !136, line: 38, baseType: !75, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_serial", scope: !135, file: !136, line: 39, baseType: !140, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ESS_ISSUER_SERIAL", file: !134, line: 22, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ESS_issuer_serial", file: !136, line: 25, size: 128, align: 64, elements: !143)
!143 = !{!144, !148}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !142, file: !136, line: 26, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_GENERAL_NAME", file: !147, line: 166, flags: DIFlagFwdDecl)
!147 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!148 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !142, file: !136, line: 27, baseType: !15, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "GENERAL_NAME", file: !147, line: 153, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GENERAL_NAME_st", file: !147, line: 123, size: 128, align: 64, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !151, file: !147, line: 133, baseType: !22, size: 32, align: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !151, file: !147, line: 152, baseType: !155, size: 64, align: 64, offset: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !151, file: !147, line: 134, size: 64, align: 64, elements: !156)
!156 = !{!157, !158, !165, !166, !167, !168, !169, !176, !177, !178, !179, !180, !181, !182, !183}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !155, file: !147, line: 135, baseType: !59, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "otherName", scope: !155, file: !147, line: 136, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "OTHERNAME", file: !147, line: 116, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "otherName_st", file: !147, line: 113, size: 128, align: 64, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "type_id", scope: !161, file: !147, line: 114, baseType: !46, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !161, file: !147, line: 115, baseType: !50, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "rfc822Name", scope: !155, file: !147, line: 137, baseType: !84, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "dNSName", scope: !155, file: !147, line: 138, baseType: !84, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "x400Address", scope: !155, file: !147, line: 139, baseType: !50, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "directoryName", scope: !155, file: !147, line: 140, baseType: !35, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ediPartyName", scope: !155, file: !147, line: 141, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDIPARTYNAME", file: !147, line: 121, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EDIPartyName_st", file: !147, line: 118, size: 128, align: 64, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nameAssigner", scope: !172, file: !147, line: 119, baseType: !64, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "partyName", scope: !172, file: !147, line: 120, baseType: !64, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "uniformResourceIdentifier", scope: !155, file: !147, line: 142, baseType: !84, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "iPAddress", scope: !155, file: !147, line: 143, baseType: !75, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "registeredID", scope: !155, file: !147, line: 144, baseType: !46, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !155, file: !147, line: 146, baseType: !75, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "dirn", scope: !155, file: !147, line: 147, baseType: !35, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ia5", scope: !155, file: !147, line: 148, baseType: !84, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "rid", scope: !155, file: !147, line: 150, baseType: !46, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !155, file: !147, line: 151, baseType: !50, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ESS_CERT_ID_V2", file: !134, line: 29, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ESS_cert_id_v2_st", file: !136, line: 62, size: 192, align: 64, elements: !187)
!187 = !{!188, !189, !190}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "hash_alg", scope: !186, file: !136, line: 63, baseType: !40, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !186, file: !136, line: 64, baseType: !75, size: 64, align: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_serial", scope: !186, file: !136, line: 65, baseType: !140, size: 64, align: 64, offset: 128)
!191 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!194 = !{!195, !200}
!195 = distinct !DIGlobalVariable(name: "ts_status_text", scope: !0, file: !196, line: 51, type: !197, isLocal: true, isDefinition: true, variable: [6 x i8*]* @ts_status_text)
!196 = !DIFile(filename: "crypto/ts/ts_rsp_verify.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 384, align: 64, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 6)
!200 = distinct !DIGlobalVariable(name: "ts_failure_info", scope: !0, file: !196, line: 65, type: !201, isLocal: true, isDefinition: true, variable: [8 x %struct.anon]* @ts_failure_info)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 1024, align: 64, elements: !206)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 62, size: 128, align: 64, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !202, file: !196, line: 63, baseType: !22, size: 32, align: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !202, file: !196, line: 64, baseType: !192, size: 64, align: 64, offset: 64)
!206 = !{!207}
!207 = !DISubrange(count: 8)
!208 = !{i32 2, !"Dwarf Version", i32 4}
!209 = !{i32 2, !"Debug Info Version", i32 3}
!210 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!211 = distinct !DISubprogram(name: "TS_RESP_verify_signature", scope: !196, file: !196, line: 89, type: !212, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!212 = !DISubroutineType(types: !213)
!213 = !{!22, !214, !238, !299, !302}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7", file: !11, line: 144, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_st", file: !11, line: 109, size: 320, align: 64, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "asn1", scope: !216, file: !11, line: 114, baseType: !25, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !216, file: !11, line: 115, baseType: !28, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !216, file: !11, line: 119, baseType: !22, size: 32, align: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !216, file: !11, line: 120, baseType: !22, size: 32, align: 32, offset: 160)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !216, file: !11, line: 121, baseType: !46, size: 64, align: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !216, file: !11, line: 143, baseType: !224, size: 64, align: 64, offset: 256)
!224 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !216, file: !11, line: 127, size: 64, align: 64, elements: !225)
!225 = !{!226, !227, !228, !248, !270, !282, !291, !298}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !224, file: !11, line: 128, baseType: !59, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !224, file: !11, line: 130, baseType: !75, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !224, file: !11, line: 132, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGNED", file: !11, line: 68, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signed_st", file: !11, line: 61, size: 384, align: 64, elements: !232)
!232 = !{!233, !234, !237, !240, !243, !246}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !231, file: !11, line: 62, baseType: !15, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !231, file: !11, line: 63, baseType: !235, size: 64, align: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ALGOR", file: !19, line: 119, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !231, file: !11, line: 64, baseType: !238, size: 64, align: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !43, line: 99, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !231, file: !11, line: 65, baseType: !241, size: 64, align: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_CRL", file: !43, line: 228, flags: DIFlagFwdDecl)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !231, file: !11, line: 66, baseType: !244, size: 64, align: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_SIGNER_INFO", file: !11, line: 49, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !231, file: !11, line: 67, baseType: !247, size: 64, align: 64, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "enveloped", scope: !224, file: !11, line: 134, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENVELOPE", file: !11, line: 85, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enveloped_st", file: !11, line: 81, size: 192, align: 64, elements: !252)
!252 = !{!253, !254, !257}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !251, file: !11, line: 82, baseType: !15, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !251, file: !11, line: 83, baseType: !255, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_RECIP_INFO", file: !11, line: 59, flags: DIFlagFwdDecl)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !251, file: !11, line: 84, baseType: !258, size: 64, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENC_CONTENT", file: !11, line: 79, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enc_content_st", file: !11, line: 74, size: 256, align: 64, elements: !261)
!261 = !{!262, !263, !264, !265}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !260, file: !11, line: 75, baseType: !46, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !260, file: !11, line: 76, baseType: !40, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !260, file: !11, line: 77, baseType: !75, size: 64, align: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !260, file: !11, line: 78, baseType: !266, size: 64, align: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !17, line: 89, baseType: !269)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !17, line: 89, flags: DIFlagFwdDecl)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "signed_and_enveloped", scope: !224, file: !11, line: 136, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGN_ENVELOPE", file: !11, line: 95, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signedandenveloped_st", file: !11, line: 87, size: 448, align: 64, elements: !274)
!274 = !{!275, !276, !277, !278, !279, !280, !281}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !273, file: !11, line: 88, baseType: !15, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !273, file: !11, line: 89, baseType: !235, size: 64, align: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !273, file: !11, line: 90, baseType: !238, size: 64, align: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !273, file: !11, line: 91, baseType: !241, size: 64, align: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !273, file: !11, line: 92, baseType: !244, size: 64, align: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !273, file: !11, line: 93, baseType: !258, size: 64, align: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !273, file: !11, line: 94, baseType: !255, size: 64, align: 64, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !224, file: !11, line: 138, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_DIGEST", file: !11, line: 102, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_digest_st", file: !11, line: 97, size: 256, align: 64, elements: !286)
!286 = !{!287, !288, !289, !290}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !285, file: !11, line: 98, baseType: !15, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !285, file: !11, line: 99, baseType: !40, size: 64, align: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !285, file: !11, line: 100, baseType: !247, size: 64, align: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !285, file: !11, line: 101, baseType: !75, size: 64, align: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "encrypted", scope: !224, file: !11, line: 140, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENCRYPT", file: !11, line: 107, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_encrypted_st", file: !11, line: 104, size: 128, align: 64, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !294, file: !11, line: 105, baseType: !15, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !294, file: !11, line: 106, baseType: !258, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !224, file: !11, line: 142, baseType: !50, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_STORE", file: !17, line: 131, baseType: !301)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_store_st", file: !17, line: 131, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!303 = !DILocalVariable(name: "token", arg: 1, scope: !211, file: !196, line: 89, type: !214)
!304 = !DIExpression()
!305 = !DILocation(line: 89, column: 37, scope: !211)
!306 = !DILocalVariable(name: "certs", arg: 2, scope: !211, file: !196, line: 89, type: !238)
!307 = !DILocation(line: 89, column: 66, scope: !211)
!308 = !DILocalVariable(name: "store", arg: 3, scope: !211, file: !196, line: 90, type: !299)
!309 = !DILocation(line: 90, column: 42, scope: !211)
!310 = !DILocalVariable(name: "signer_out", arg: 4, scope: !211, file: !196, line: 90, type: !302)
!311 = !DILocation(line: 90, column: 56, scope: !211)
!312 = !DILocalVariable(name: "sinfos", scope: !211, file: !196, line: 92, type: !244)
!313 = !DILocation(line: 92, column: 40, scope: !211)
!314 = !DILocalVariable(name: "si", scope: !211, file: !196, line: 93, type: !9)
!315 = !DILocation(line: 93, column: 24, scope: !211)
!316 = !DILocalVariable(name: "signers", scope: !211, file: !196, line: 94, type: !238)
!317 = !DILocation(line: 94, column: 27, scope: !211)
!318 = !DILocalVariable(name: "signer", scope: !211, file: !196, line: 95, type: !123)
!319 = !DILocation(line: 95, column: 11, scope: !211)
!320 = !DILocalVariable(name: "chain", scope: !211, file: !196, line: 96, type: !238)
!321 = !DILocation(line: 96, column: 27, scope: !211)
!322 = !DILocalVariable(name: "buf", scope: !211, file: !196, line: 97, type: !323)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 32768, align: 8, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 4096)
!326 = !DILocation(line: 97, column: 10, scope: !211)
!327 = !DILocalVariable(name: "i", scope: !211, file: !196, line: 98, type: !22)
!328 = !DILocation(line: 98, column: 9, scope: !211)
!329 = !DILocalVariable(name: "j", scope: !211, file: !196, line: 98, type: !22)
!330 = !DILocation(line: 98, column: 12, scope: !211)
!331 = !DILocalVariable(name: "ret", scope: !211, file: !196, line: 98, type: !22)
!332 = !DILocation(line: 98, column: 19, scope: !211)
!333 = !DILocalVariable(name: "p7bio", scope: !211, file: !196, line: 99, type: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !17, line: 79, baseType: !336)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !17, line: 79, flags: DIFlagFwdDecl)
!337 = !DILocation(line: 99, column: 10, scope: !211)
!338 = !DILocation(line: 102, column: 10, scope: !339)
!339 = distinct !DILexicalBlock(scope: !211, file: !196, line: 102, column: 9)
!340 = !DILocation(line: 102, column: 9, scope: !211)
!341 = !DILocation(line: 103, column: 9, scope: !342)
!342 = distinct !DILexicalBlock(scope: !339, file: !196, line: 102, column: 17)
!343 = !DILocation(line: 104, column: 9, scope: !342)
!344 = !DILocation(line: 106, column: 24, scope: !345)
!345 = distinct !DILexicalBlock(scope: !211, file: !196, line: 106, column: 9)
!346 = !DILocation(line: 106, column: 32, scope: !345)
!347 = !DILocation(line: 106, column: 11, scope: !345)
!348 = !DILocation(line: 106, column: 38, scope: !345)
!349 = !DILocation(line: 106, column: 9, scope: !211)
!350 = !DILocation(line: 107, column: 9, scope: !351)
!351 = distinct !DILexicalBlock(scope: !345, file: !196, line: 106, column: 46)
!352 = !DILocation(line: 108, column: 9, scope: !351)
!353 = !DILocation(line: 110, column: 36, scope: !211)
!354 = !DILocation(line: 110, column: 14, scope: !211)
!355 = !DILocation(line: 110, column: 12, scope: !211)
!356 = !DILocation(line: 111, column: 10, scope: !357)
!357 = distinct !DILexicalBlock(scope: !211, file: !196, line: 111, column: 9)
!358 = !DILocation(line: 111, column: 17, scope: !357)
!359 = !DILocation(line: 111, column: 45, scope: !360)
!360 = !DILexicalBlockFile(scope: !357, file: !196, discriminator: 1)
!361 = !DILocation(line: 111, column: 20, scope: !360)
!362 = !DILocation(line: 111, column: 53, scope: !360)
!363 = !DILocation(line: 111, column: 9, scope: !360)
!364 = !DILocation(line: 112, column: 9, scope: !365)
!365 = distinct !DILexicalBlock(scope: !357, file: !196, line: 111, column: 59)
!366 = !DILocation(line: 113, column: 9, scope: !365)
!367 = !DILocation(line: 115, column: 37, scope: !211)
!368 = !DILocation(line: 115, column: 10, scope: !211)
!369 = !DILocation(line: 115, column: 8, scope: !211)
!370 = !DILocation(line: 116, column: 20, scope: !371)
!371 = distinct !DILexicalBlock(scope: !211, file: !196, line: 116, column: 9)
!372 = !DILocation(line: 116, column: 9, scope: !371)
!373 = !DILocation(line: 116, column: 9, scope: !211)
!374 = !DILocation(line: 117, column: 9, scope: !375)
!375 = distinct !DILexicalBlock(scope: !371, file: !196, line: 116, column: 11)
!376 = !DILocation(line: 118, column: 9, scope: !375)
!377 = !DILocation(line: 125, column: 34, scope: !211)
!378 = !DILocation(line: 125, column: 41, scope: !211)
!379 = !DILocation(line: 125, column: 15, scope: !211)
!380 = !DILocation(line: 125, column: 13, scope: !211)
!381 = !DILocation(line: 126, column: 10, scope: !382)
!382 = distinct !DILexicalBlock(scope: !211, file: !196, line: 126, column: 9)
!383 = !DILocation(line: 126, column: 18, scope: !382)
!384 = !DILocation(line: 126, column: 33, scope: !385)
!385 = !DILexicalBlockFile(scope: !382, file: !196, discriminator: 1)
!386 = !DILocation(line: 126, column: 21, scope: !385)
!387 = !DILocation(line: 126, column: 42, scope: !385)
!388 = !DILocation(line: 126, column: 9, scope: !385)
!389 = !DILocation(line: 127, column: 9, scope: !382)
!390 = !DILocation(line: 128, column: 28, scope: !211)
!391 = !DILocation(line: 128, column: 14, scope: !211)
!392 = !DILocation(line: 128, column: 12, scope: !211)
!393 = !DILocation(line: 130, column: 25, scope: !394)
!394 = distinct !DILexicalBlock(scope: !211, file: !196, line: 130, column: 9)
!395 = !DILocation(line: 130, column: 32, scope: !394)
!396 = !DILocation(line: 130, column: 39, scope: !394)
!397 = !DILocation(line: 130, column: 10, scope: !394)
!398 = !DILocation(line: 130, column: 9, scope: !211)
!399 = !DILocation(line: 131, column: 9, scope: !394)
!400 = !DILocation(line: 132, column: 33, scope: !401)
!401 = distinct !DILexicalBlock(scope: !211, file: !196, line: 132, column: 9)
!402 = !DILocation(line: 132, column: 37, scope: !401)
!403 = !DILocation(line: 132, column: 10, scope: !401)
!404 = !DILocation(line: 132, column: 9, scope: !211)
!405 = !DILocation(line: 133, column: 9, scope: !401)
!406 = !DILocation(line: 134, column: 28, scope: !211)
!407 = !DILocation(line: 134, column: 13, scope: !211)
!408 = !DILocation(line: 134, column: 11, scope: !211)
!409 = !DILocation(line: 137, column: 5, scope: !211)
!410 = !DILocation(line: 137, column: 26, scope: !411)
!411 = !DILexicalBlockFile(scope: !211, file: !196, discriminator: 1)
!412 = !DILocation(line: 137, column: 33, scope: !411)
!413 = !DILocation(line: 137, column: 17, scope: !411)
!414 = !DILocation(line: 137, column: 15, scope: !411)
!415 = !DILocation(line: 137, column: 52, scope: !411)
!416 = !DILocation(line: 137, column: 5, scope: !411)
!417 = !DILocation(line: 138, column: 9, scope: !211)
!418 = distinct !{!418, !409}
!419 = !DILocation(line: 140, column: 31, scope: !211)
!420 = !DILocation(line: 140, column: 38, scope: !211)
!421 = !DILocation(line: 140, column: 45, scope: !211)
!422 = !DILocation(line: 140, column: 49, scope: !211)
!423 = !DILocation(line: 140, column: 9, scope: !211)
!424 = !DILocation(line: 140, column: 7, scope: !211)
!425 = !DILocation(line: 141, column: 9, scope: !426)
!426 = distinct !DILexicalBlock(scope: !211, file: !196, line: 141, column: 9)
!427 = !DILocation(line: 141, column: 11, scope: !426)
!428 = !DILocation(line: 141, column: 9, scope: !211)
!429 = !DILocation(line: 142, column: 9, scope: !430)
!430 = distinct !DILexicalBlock(scope: !426, file: !196, line: 141, column: 17)
!431 = !DILocation(line: 143, column: 9, scope: !430)
!432 = !DILocation(line: 146, column: 9, scope: !433)
!433 = distinct !DILexicalBlock(scope: !211, file: !196, line: 146, column: 9)
!434 = !DILocation(line: 146, column: 9, scope: !211)
!435 = !DILocation(line: 147, column: 23, scope: !436)
!436 = distinct !DILexicalBlock(scope: !433, file: !196, line: 146, column: 21)
!437 = !DILocation(line: 147, column: 10, scope: !436)
!438 = !DILocation(line: 147, column: 21, scope: !436)
!439 = !DILocation(line: 148, column: 21, scope: !436)
!440 = !DILocation(line: 148, column: 9, scope: !436)
!441 = !DILocation(line: 149, column: 5, scope: !436)
!442 = !DILocation(line: 150, column: 9, scope: !211)
!443 = !DILocation(line: 150, column: 5, scope: !211)
!444 = !DILocation(line: 153, column: 18, scope: !211)
!445 = !DILocation(line: 153, column: 5, scope: !211)
!446 = !DILocation(line: 154, column: 22, scope: !211)
!447 = !DILocation(line: 154, column: 5, scope: !211)
!448 = !DILocation(line: 155, column: 18, scope: !211)
!449 = !DILocation(line: 155, column: 5, scope: !211)
!450 = !DILocation(line: 157, column: 12, scope: !211)
!451 = !DILocation(line: 157, column: 5, scope: !211)
!452 = distinct !DISubprogram(name: "sk_PKCS7_SIGNER_INFO_num", scope: !11, file: !11, line: 49, type: !453, isLocal: true, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!453 = !DISubroutineType(types: !454)
!454 = !{!22, !455}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !245)
!457 = !DILocalVariable(name: "sk", arg: 1, scope: !452, file: !11, line: 49, type: !455)
!458 = !DILocation(line: 49, column: 420, scope: !452)
!459 = !DILocation(line: 49, column: 471, scope: !452)
!460 = !DILocation(line: 49, column: 448, scope: !452)
!461 = !DILocation(line: 49, column: 433, scope: !452)
!462 = !DILocation(line: 49, column: 426, scope: !452)
!463 = distinct !DISubprogram(name: "sk_PKCS7_SIGNER_INFO_value", scope: !11, file: !11, line: 49, type: !464, isLocal: true, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!464 = !DISubroutineType(types: !465)
!465 = !{!9, !455, !22}
!466 = !DILocalVariable(name: "sk", arg: 1, scope: !463, file: !11, line: 49, type: !455)
!467 = !DILocation(line: 49, column: 603, scope: !463)
!468 = !DILocalVariable(name: "idx", arg: 2, scope: !463, file: !11, line: 49, type: !22)
!469 = !DILocation(line: 49, column: 611, scope: !463)
!470 = !DILocation(line: 49, column: 686, scope: !463)
!471 = !DILocation(line: 49, column: 663, scope: !463)
!472 = !DILocation(line: 49, column: 690, scope: !463)
!473 = !DILocation(line: 49, column: 646, scope: !463)
!474 = !DILocation(line: 49, column: 625, scope: !463)
!475 = !DILocation(line: 49, column: 618, scope: !463)
!476 = distinct !DISubprogram(name: "sk_X509_num", scope: !43, file: !43, line: 99, type: !477, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!477 = !DISubroutineType(types: !478)
!478 = !{!22, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!481 = !DILocalVariable(name: "sk", arg: 1, scope: !476, file: !43, line: 99, type: !479)
!482 = !DILocation(line: 99, column: 277, scope: !476)
!483 = !DILocation(line: 99, column: 328, scope: !476)
!484 = !DILocation(line: 99, column: 305, scope: !476)
!485 = !DILocation(line: 99, column: 290, scope: !476)
!486 = !DILocation(line: 99, column: 283, scope: !476)
!487 = distinct !DISubprogram(name: "sk_X509_value", scope: !43, file: !43, line: 99, type: !488, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!488 = !DISubroutineType(types: !489)
!489 = !{!123, !479, !22}
!490 = !DILocalVariable(name: "sk", arg: 1, scope: !487, file: !43, line: 99, type: !479)
!491 = !DILocation(line: 99, column: 421, scope: !487)
!492 = !DILocalVariable(name: "idx", arg: 2, scope: !487, file: !43, line: 99, type: !22)
!493 = !DILocation(line: 99, column: 429, scope: !487)
!494 = !DILocation(line: 99, column: 491, scope: !487)
!495 = !DILocation(line: 99, column: 468, scope: !487)
!496 = !DILocation(line: 99, column: 495, scope: !487)
!497 = !DILocation(line: 99, column: 451, scope: !487)
!498 = !DILocation(line: 99, column: 443, scope: !487)
!499 = !DILocation(line: 99, column: 436, scope: !487)
!500 = distinct !DISubprogram(name: "ts_verify_cert", scope: !196, file: !196, line: 164, type: !501, isLocal: true, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!501 = !DISubroutineType(types: !502)
!502 = !{!22, !299, !238, !123, !503}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!504 = !DILocalVariable(name: "store", arg: 1, scope: !500, file: !196, line: 164, type: !299)
!505 = !DILocation(line: 164, column: 39, scope: !500)
!506 = !DILocalVariable(name: "untrusted", arg: 2, scope: !500, file: !196, line: 164, type: !238)
!507 = !DILocation(line: 164, column: 68, scope: !500)
!508 = !DILocalVariable(name: "signer", arg: 3, scope: !500, file: !196, line: 165, type: !123)
!509 = !DILocation(line: 165, column: 33, scope: !500)
!510 = !DILocalVariable(name: "chain", arg: 4, scope: !500, file: !196, line: 165, type: !503)
!511 = !DILocation(line: 165, column: 64, scope: !500)
!512 = !DILocalVariable(name: "cert_ctx", scope: !500, file: !196, line: 167, type: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_STORE_CTX", file: !17, line: 132, baseType: !515)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_store_ctx_st", file: !17, line: 132, flags: DIFlagFwdDecl)
!516 = !DILocation(line: 167, column: 21, scope: !500)
!517 = !DILocalVariable(name: "i", scope: !500, file: !196, line: 168, type: !22)
!518 = !DILocation(line: 168, column: 9, scope: !500)
!519 = !DILocalVariable(name: "ret", scope: !500, file: !196, line: 169, type: !22)
!520 = !DILocation(line: 169, column: 9, scope: !500)
!521 = !DILocation(line: 171, column: 6, scope: !500)
!522 = !DILocation(line: 171, column: 12, scope: !500)
!523 = !DILocation(line: 172, column: 16, scope: !500)
!524 = !DILocation(line: 172, column: 14, scope: !500)
!525 = !DILocation(line: 173, column: 9, scope: !526)
!526 = distinct !DILexicalBlock(scope: !500, file: !196, line: 173, column: 9)
!527 = !DILocation(line: 173, column: 18, scope: !526)
!528 = !DILocation(line: 173, column: 9, scope: !500)
!529 = !DILocation(line: 174, column: 9, scope: !530)
!530 = distinct !DILexicalBlock(scope: !526, file: !196, line: 173, column: 26)
!531 = !DILocation(line: 175, column: 9, scope: !530)
!532 = !DILocation(line: 177, column: 30, scope: !533)
!533 = distinct !DILexicalBlock(scope: !500, file: !196, line: 177, column: 9)
!534 = !DILocation(line: 177, column: 40, scope: !533)
!535 = !DILocation(line: 177, column: 47, scope: !533)
!536 = !DILocation(line: 177, column: 55, scope: !533)
!537 = !DILocation(line: 177, column: 10, scope: !533)
!538 = !DILocation(line: 177, column: 9, scope: !500)
!539 = !DILocation(line: 178, column: 9, scope: !533)
!540 = !DILocation(line: 179, column: 32, scope: !500)
!541 = !DILocation(line: 179, column: 5, scope: !500)
!542 = !DILocation(line: 180, column: 26, scope: !500)
!543 = !DILocation(line: 180, column: 9, scope: !500)
!544 = !DILocation(line: 180, column: 7, scope: !500)
!545 = !DILocation(line: 181, column: 9, scope: !546)
!546 = distinct !DILexicalBlock(scope: !500, file: !196, line: 181, column: 9)
!547 = !DILocation(line: 181, column: 11, scope: !546)
!548 = !DILocation(line: 181, column: 9, scope: !500)
!549 = !DILocalVariable(name: "j", scope: !550, file: !196, line: 182, type: !22)
!550 = distinct !DILexicalBlock(scope: !546, file: !196, line: 181, column: 17)
!551 = !DILocation(line: 182, column: 13, scope: !550)
!552 = !DILocation(line: 182, column: 42, scope: !550)
!553 = !DILocation(line: 182, column: 17, scope: !550)
!554 = !DILocation(line: 183, column: 9, scope: !550)
!555 = !DILocation(line: 185, column: 58, scope: !550)
!556 = !DILocation(line: 185, column: 28, scope: !550)
!557 = !DILocation(line: 184, column: 9, scope: !550)
!558 = !DILocation(line: 186, column: 9, scope: !550)
!559 = !DILocation(line: 188, column: 40, scope: !500)
!560 = !DILocation(line: 188, column: 14, scope: !500)
!561 = !DILocation(line: 188, column: 6, scope: !500)
!562 = !DILocation(line: 188, column: 12, scope: !500)
!563 = !DILocation(line: 189, column: 9, scope: !500)
!564 = !DILocation(line: 190, column: 5, scope: !500)
!565 = !DILocation(line: 193, column: 9, scope: !500)
!566 = !DILocation(line: 193, column: 5, scope: !500)
!567 = !DILocation(line: 196, column: 25, scope: !500)
!568 = !DILocation(line: 196, column: 5, scope: !500)
!569 = !DILocation(line: 197, column: 12, scope: !500)
!570 = !DILocation(line: 197, column: 5, scope: !500)
!571 = distinct !DISubprogram(name: "ts_check_signing_certs", scope: !196, file: !196, line: 200, type: !572, isLocal: true, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!572 = !DISubroutineType(types: !573)
!573 = !{!22, !9, !238}
!574 = !DILocalVariable(name: "si", arg: 1, scope: !571, file: !196, line: 200, type: !9)
!575 = !DILocation(line: 200, column: 54, scope: !571)
!576 = !DILocalVariable(name: "chain", arg: 2, scope: !571, file: !196, line: 201, type: !238)
!577 = !DILocation(line: 201, column: 57, scope: !571)
!578 = !DILocalVariable(name: "ss", scope: !571, file: !196, line: 203, type: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "ESS_SIGNING_CERT", file: !134, line: 24, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ESS_signing_cert", file: !136, line: 49, size: 128, align: 64, elements: !582)
!582 = !{!583, !586}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "cert_ids", scope: !581, file: !136, line: 50, baseType: !584, size: 64, align: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ESS_CERT_ID", file: !134, line: 26, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "policy_info", scope: !581, file: !136, line: 51, baseType: !587, size: 64, align: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_POLICYINFO", file: !147, line: 253, flags: DIFlagFwdDecl)
!589 = !DILocation(line: 203, column: 23, scope: !571)
!590 = !DILocation(line: 203, column: 49, scope: !571)
!591 = !DILocation(line: 203, column: 28, scope: !571)
!592 = !DILocalVariable(name: "cert_ids", scope: !571, file: !196, line: 204, type: !584)
!593 = !DILocation(line: 204, column: 34, scope: !571)
!594 = !DILocalVariable(name: "ssv2", scope: !571, file: !196, line: 205, type: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "ESS_SIGNING_CERT_V2", file: !134, line: 28, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ESS_signing_cert_v2_st", file: !136, line: 75, size: 128, align: 64, elements: !598)
!598 = !{!599, !602}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cert_ids", scope: !597, file: !136, line: 76, baseType: !600, size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ESS_CERT_ID_V2", file: !134, line: 31, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "policy_info", scope: !597, file: !136, line: 77, baseType: !587, size: 64, align: 64, offset: 64)
!603 = !DILocation(line: 205, column: 26, scope: !571)
!604 = !DILocation(line: 205, column: 57, scope: !571)
!605 = !DILocation(line: 205, column: 33, scope: !571)
!606 = !DILocalVariable(name: "cert_ids_v2", scope: !571, file: !196, line: 206, type: !600)
!607 = !DILocation(line: 206, column: 37, scope: !571)
!608 = !DILocalVariable(name: "cert", scope: !571, file: !196, line: 207, type: !123)
!609 = !DILocation(line: 207, column: 11, scope: !571)
!610 = !DILocalVariable(name: "i", scope: !571, file: !196, line: 208, type: !22)
!611 = !DILocation(line: 208, column: 9, scope: !571)
!612 = !DILocalVariable(name: "ret", scope: !571, file: !196, line: 209, type: !22)
!613 = !DILocation(line: 209, column: 9, scope: !571)
!614 = !DILocation(line: 211, column: 9, scope: !615)
!615 = distinct !DILexicalBlock(scope: !571, file: !196, line: 211, column: 9)
!616 = !DILocation(line: 211, column: 12, scope: !615)
!617 = !DILocation(line: 211, column: 9, scope: !571)
!618 = !DILocation(line: 212, column: 20, scope: !619)
!619 = distinct !DILexicalBlock(scope: !615, file: !196, line: 211, column: 20)
!620 = !DILocation(line: 212, column: 24, scope: !619)
!621 = !DILocation(line: 212, column: 18, scope: !619)
!622 = !DILocation(line: 213, column: 30, scope: !619)
!623 = !DILocation(line: 213, column: 16, scope: !619)
!624 = !DILocation(line: 213, column: 14, scope: !619)
!625 = !DILocation(line: 214, column: 26, scope: !626)
!626 = distinct !DILexicalBlock(scope: !619, file: !196, line: 214, column: 13)
!627 = !DILocation(line: 214, column: 36, scope: !626)
!628 = !DILocation(line: 214, column: 13, scope: !626)
!629 = !DILocation(line: 214, column: 42, scope: !626)
!630 = !DILocation(line: 214, column: 13, scope: !619)
!631 = !DILocation(line: 215, column: 13, scope: !626)
!632 = !DILocation(line: 221, column: 32, scope: !633)
!633 = distinct !DILexicalBlock(scope: !619, file: !196, line: 221, column: 13)
!634 = !DILocation(line: 221, column: 13, scope: !633)
!635 = !DILocation(line: 221, column: 42, scope: !633)
!636 = !DILocation(line: 221, column: 13, scope: !619)
!637 = !DILocation(line: 222, column: 20, scope: !638)
!638 = distinct !DILexicalBlock(scope: !639, file: !196, line: 222, column: 13)
!639 = distinct !DILexicalBlock(scope: !633, file: !196, line: 221, column: 47)
!640 = !DILocation(line: 222, column: 18, scope: !638)
!641 = !DILocation(line: 222, column: 25, scope: !642)
!642 = !DILexicalBlockFile(scope: !643, file: !196, discriminator: 1)
!643 = distinct !DILexicalBlock(scope: !638, file: !196, line: 222, column: 13)
!644 = !DILocation(line: 222, column: 41, scope: !642)
!645 = !DILocation(line: 222, column: 29, scope: !642)
!646 = !DILocation(line: 222, column: 27, scope: !642)
!647 = !DILocation(line: 222, column: 13, scope: !642)
!648 = !DILocation(line: 223, column: 38, scope: !649)
!649 = distinct !DILexicalBlock(scope: !643, file: !196, line: 222, column: 54)
!650 = !DILocation(line: 223, column: 45, scope: !649)
!651 = !DILocation(line: 223, column: 24, scope: !649)
!652 = !DILocation(line: 223, column: 22, scope: !649)
!653 = !DILocation(line: 224, column: 34, scope: !654)
!654 = distinct !DILexicalBlock(scope: !649, file: !196, line: 224, column: 21)
!655 = !DILocation(line: 224, column: 44, scope: !654)
!656 = !DILocation(line: 224, column: 21, scope: !654)
!657 = !DILocation(line: 224, column: 50, scope: !654)
!658 = !DILocation(line: 224, column: 21, scope: !649)
!659 = !DILocation(line: 225, column: 21, scope: !654)
!660 = !DILocation(line: 226, column: 13, scope: !649)
!661 = !DILocation(line: 222, column: 49, scope: !662)
!662 = !DILexicalBlockFile(scope: !643, file: !196, discriminator: 2)
!663 = !DILocation(line: 222, column: 13, scope: !662)
!664 = distinct !{!664, !665}
!665 = !DILocation(line: 222, column: 13, scope: !639)
!666 = !DILocation(line: 227, column: 9, scope: !639)
!667 = !DILocation(line: 228, column: 5, scope: !619)
!668 = !DILocation(line: 228, column: 16, scope: !669)
!669 = !DILexicalBlockFile(scope: !670, file: !196, discriminator: 1)
!670 = distinct !DILexicalBlock(scope: !615, file: !196, line: 228, column: 16)
!671 = !DILocation(line: 228, column: 21, scope: !669)
!672 = !DILocation(line: 229, column: 23, scope: !673)
!673 = distinct !DILexicalBlock(scope: !670, file: !196, line: 228, column: 29)
!674 = !DILocation(line: 229, column: 29, scope: !673)
!675 = !DILocation(line: 229, column: 21, scope: !673)
!676 = !DILocation(line: 230, column: 30, scope: !673)
!677 = !DILocation(line: 230, column: 16, scope: !673)
!678 = !DILocation(line: 230, column: 14, scope: !673)
!679 = !DILocation(line: 231, column: 29, scope: !680)
!680 = distinct !DILexicalBlock(scope: !673, file: !196, line: 231, column: 13)
!681 = !DILocation(line: 231, column: 42, scope: !680)
!682 = !DILocation(line: 231, column: 13, scope: !680)
!683 = !DILocation(line: 231, column: 48, scope: !680)
!684 = !DILocation(line: 231, column: 13, scope: !673)
!685 = !DILocation(line: 232, column: 13, scope: !680)
!686 = !DILocation(line: 238, column: 35, scope: !687)
!687 = distinct !DILexicalBlock(scope: !673, file: !196, line: 238, column: 13)
!688 = !DILocation(line: 238, column: 13, scope: !687)
!689 = !DILocation(line: 238, column: 48, scope: !687)
!690 = !DILocation(line: 238, column: 13, scope: !673)
!691 = !DILocation(line: 239, column: 20, scope: !692)
!692 = distinct !DILexicalBlock(scope: !693, file: !196, line: 239, column: 13)
!693 = distinct !DILexicalBlock(scope: !687, file: !196, line: 238, column: 53)
!694 = !DILocation(line: 239, column: 18, scope: !692)
!695 = !DILocation(line: 239, column: 25, scope: !696)
!696 = !DILexicalBlockFile(scope: !697, file: !196, discriminator: 1)
!697 = distinct !DILexicalBlock(scope: !692, file: !196, line: 239, column: 13)
!698 = !DILocation(line: 239, column: 41, scope: !696)
!699 = !DILocation(line: 239, column: 29, scope: !696)
!700 = !DILocation(line: 239, column: 27, scope: !696)
!701 = !DILocation(line: 239, column: 13, scope: !696)
!702 = !DILocation(line: 240, column: 38, scope: !703)
!703 = distinct !DILexicalBlock(scope: !697, file: !196, line: 239, column: 54)
!704 = !DILocation(line: 240, column: 45, scope: !703)
!705 = !DILocation(line: 240, column: 24, scope: !703)
!706 = !DILocation(line: 240, column: 22, scope: !703)
!707 = !DILocation(line: 241, column: 37, scope: !708)
!708 = distinct !DILexicalBlock(scope: !703, file: !196, line: 241, column: 21)
!709 = !DILocation(line: 241, column: 50, scope: !708)
!710 = !DILocation(line: 241, column: 21, scope: !708)
!711 = !DILocation(line: 241, column: 56, scope: !708)
!712 = !DILocation(line: 241, column: 21, scope: !703)
!713 = !DILocation(line: 242, column: 21, scope: !708)
!714 = !DILocation(line: 243, column: 13, scope: !703)
!715 = !DILocation(line: 239, column: 49, scope: !716)
!716 = !DILexicalBlockFile(scope: !697, file: !196, discriminator: 2)
!717 = !DILocation(line: 239, column: 13, scope: !716)
!718 = distinct !{!718, !719}
!719 = !DILocation(line: 239, column: 13, scope: !693)
!720 = !DILocation(line: 244, column: 9, scope: !693)
!721 = !DILocation(line: 245, column: 5, scope: !673)
!722 = !DILocation(line: 246, column: 9, scope: !723)
!723 = distinct !DILexicalBlock(scope: !670, file: !196, line: 245, column: 12)
!724 = !DILocation(line: 249, column: 9, scope: !571)
!725 = !DILocation(line: 249, column: 5, scope: !571)
!726 = !DILocation(line: 251, column: 10, scope: !727)
!727 = distinct !DILexicalBlock(scope: !571, file: !196, line: 251, column: 9)
!728 = !DILocation(line: 251, column: 9, scope: !571)
!729 = !DILocation(line: 252, column: 9, scope: !727)
!730 = !DILocation(line: 254, column: 27, scope: !571)
!731 = !DILocation(line: 254, column: 5, scope: !571)
!732 = !DILocation(line: 255, column: 30, scope: !571)
!733 = !DILocation(line: 255, column: 5, scope: !571)
!734 = !DILocation(line: 256, column: 12, scope: !571)
!735 = !DILocation(line: 256, column: 5, scope: !571)
!736 = distinct !DISubprogram(name: "sk_X509_pop_free", scope: !43, file: !43, line: 99, type: !737, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!737 = !DISubroutineType(types: !738)
!738 = !{null, !238, !739}
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_X509_freefunc", file: !43, line: 99, baseType: !740)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64, align: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{null, !123}
!743 = !DILocalVariable(name: "sk", arg: 1, scope: !736, file: !43, line: 99, type: !238)
!744 = !DILocation(line: 99, column: 2446, scope: !736)
!745 = !DILocalVariable(name: "freefunc", arg: 2, scope: !736, file: !43, line: 99, type: !739)
!746 = !DILocation(line: 99, column: 2467, scope: !736)
!747 = !DILocation(line: 99, column: 2516, scope: !736)
!748 = !DILocation(line: 99, column: 2499, scope: !736)
!749 = !DILocation(line: 99, column: 2541, scope: !736)
!750 = !DILocation(line: 99, column: 2520, scope: !736)
!751 = !DILocation(line: 99, column: 2479, scope: !736)
!752 = !DILocation(line: 99, column: 2552, scope: !736)
!753 = distinct !DISubprogram(name: "sk_X509_free", scope: !43, file: !43, line: 99, type: !754, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !238}
!756 = !DILocalVariable(name: "sk", arg: 1, scope: !753, file: !43, line: 99, type: !238)
!757 = !DILocation(line: 99, column: 1252, scope: !753)
!758 = !DILocation(line: 99, column: 1291, scope: !753)
!759 = !DILocation(line: 99, column: 1274, scope: !753)
!760 = !DILocation(line: 99, column: 1258, scope: !753)
!761 = !DILocation(line: 99, column: 1296, scope: !753)
!762 = distinct !DISubprogram(name: "TS_RESP_verify_response", scope: !196, file: !196, line: 344, type: !763, isLocal: false, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!763 = !DISubroutineType(types: !764)
!764 = !{!22, !765, !781}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64, align: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_VERIFY_CTX", file: !767, line: 418, baseType: !768)
!767 = !DIFile(filename: "include/openssl/ts.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TS_verify_ctx", file: !769, line: 129, size: 640, align: 64, elements: !770)
!769 = !DIFile(filename: "crypto/ts/ts_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !768, file: !769, line: 131, baseType: !191, size: 32, align: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !768, file: !769, line: 133, baseType: !299, size: 64, align: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "certs", scope: !768, file: !769, line: 134, baseType: !238, size: 64, align: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !768, file: !769, line: 136, baseType: !46, size: 64, align: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "md_alg", scope: !768, file: !769, line: 141, baseType: !40, size: 64, align: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "imprint", scope: !768, file: !769, line: 142, baseType: !25, size: 64, align: 64, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "imprint_len", scope: !768, file: !769, line: 143, baseType: !191, size: 32, align: 32, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !768, file: !769, line: 145, baseType: !334, size: 64, align: 64, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !768, file: !769, line: 147, baseType: !15, size: 64, align: 64, offset: 512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tsa_name", scope: !768, file: !769, line: 149, baseType: !149, size: 64, align: 64, offset: 576)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64, align: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_RESP", file: !767, line: 60, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TS_resp_st", file: !769, line: 25, size: 192, align: 64, elements: !784)
!784 = !{!785, !795, !796}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "status_info", scope: !783, file: !769, line: 26, baseType: !786, size: 64, align: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64, align: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_STATUS_INFO", file: !767, line: 58, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TS_status_info_st", file: !769, line: 95, size: 192, align: 64, elements: !789)
!789 = !{!790, !791, !794}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !788, file: !769, line: 96, baseType: !15, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !788, file: !769, line: 97, baseType: !792, size: 64, align: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64, align: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ASN1_UTF8STRING", file: !19, line: 442, flags: DIFlagFwdDecl)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "failure_info", scope: !788, file: !769, line: 98, baseType: !72, size: 64, align: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !783, file: !769, line: 27, baseType: !214, size: 64, align: 64, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "tst_info", scope: !783, file: !769, line: 28, baseType: !797, size: 64, align: 64, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64, align: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_TST_INFO", file: !767, line: 37, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TS_tst_info_st", file: !769, line: 82, size: 640, align: 64, elements: !800)
!800 = !{!801, !802, !803, !810, !811, !812, !820, !821, !822, !823}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !799, file: !769, line: 83, baseType: !15, size: 64, align: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "policy_id", scope: !799, file: !769, line: 84, baseType: !46, size: 64, align: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "msg_imprint", scope: !799, file: !769, line: 85, baseType: !804, size: 64, align: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64, align: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_MSG_IMPRINT", file: !767, line: 34, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TS_msg_imprint_st", file: !769, line: 15, size: 128, align: 64, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "hash_algo", scope: !806, file: !769, line: 16, baseType: !40, size: 64, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "hashed_msg", scope: !806, file: !769, line: 17, baseType: !75, size: 64, align: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !799, file: !769, line: 86, baseType: !15, size: 64, align: 64, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !799, file: !769, line: 87, baseType: !99, size: 64, align: 64, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "accuracy", scope: !799, file: !769, line: 88, baseType: !813, size: 64, align: 64, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64, align: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_ACCURACY", file: !767, line: 36, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TS_accuracy_st", file: !769, line: 57, size: 192, align: 64, elements: !816)
!816 = !{!817, !818, !819}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !815, file: !769, line: 58, baseType: !15, size: 64, align: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "millis", scope: !815, file: !769, line: 59, baseType: !15, size: 64, align: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "micros", scope: !815, file: !769, line: 60, baseType: !15, size: 64, align: 64, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !799, file: !769, line: 89, baseType: !62, size: 32, align: 32, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !799, file: !769, line: 90, baseType: !15, size: 64, align: 64, offset: 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "tsa", scope: !799, file: !769, line: 91, baseType: !149, size: 64, align: 64, offset: 512)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !799, file: !769, line: 92, baseType: !824, size: 64, align: 64, offset: 576)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64, align: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_EXTENSION", file: !43, line: 83, flags: DIFlagFwdDecl)
!826 = !DILocalVariable(name: "ctx", arg: 1, scope: !762, file: !196, line: 344, type: !765)
!827 = !DILocation(line: 344, column: 44, scope: !762)
!828 = !DILocalVariable(name: "response", arg: 2, scope: !762, file: !196, line: 344, type: !781)
!829 = !DILocation(line: 344, column: 58, scope: !762)
!830 = !DILocalVariable(name: "token", scope: !762, file: !196, line: 346, type: !214)
!831 = !DILocation(line: 346, column: 12, scope: !762)
!832 = !DILocation(line: 346, column: 20, scope: !762)
!833 = !DILocation(line: 346, column: 30, scope: !762)
!834 = !DILocalVariable(name: "tst_info", scope: !762, file: !196, line: 347, type: !797)
!835 = !DILocation(line: 347, column: 18, scope: !762)
!836 = !DILocation(line: 347, column: 29, scope: !762)
!837 = !DILocation(line: 347, column: 39, scope: !762)
!838 = !DILocalVariable(name: "ret", scope: !762, file: !196, line: 348, type: !22)
!839 = !DILocation(line: 348, column: 9, scope: !762)
!840 = !DILocation(line: 350, column: 31, scope: !841)
!841 = distinct !DILexicalBlock(scope: !762, file: !196, line: 350, column: 9)
!842 = !DILocation(line: 350, column: 10, scope: !841)
!843 = !DILocation(line: 350, column: 9, scope: !762)
!844 = !DILocation(line: 351, column: 9, scope: !841)
!845 = !DILocation(line: 352, column: 35, scope: !846)
!846 = distinct !DILexicalBlock(scope: !762, file: !196, line: 352, column: 9)
!847 = !DILocation(line: 352, column: 40, scope: !846)
!848 = !DILocation(line: 352, column: 47, scope: !846)
!849 = !DILocation(line: 352, column: 10, scope: !846)
!850 = !DILocation(line: 352, column: 9, scope: !762)
!851 = !DILocation(line: 353, column: 9, scope: !846)
!852 = !DILocation(line: 354, column: 9, scope: !762)
!853 = !DILocation(line: 354, column: 5, scope: !762)
!854 = !DILocation(line: 357, column: 12, scope: !762)
!855 = !DILocation(line: 357, column: 5, scope: !762)
!856 = distinct !DISubprogram(name: "ts_check_status_info", scope: !196, file: !196, line: 446, type: !857, isLocal: true, isDefinition: true, scopeLine: 447, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!857 = !DISubroutineType(types: !858)
!858 = !{!22, !781}
!859 = !DILocalVariable(name: "response", arg: 1, scope: !856, file: !196, line: 446, type: !781)
!860 = !DILocation(line: 446, column: 42, scope: !856)
!861 = !DILocalVariable(name: "info", scope: !856, file: !196, line: 448, type: !786)
!862 = !DILocation(line: 448, column: 21, scope: !856)
!863 = !DILocation(line: 448, column: 28, scope: !856)
!864 = !DILocation(line: 448, column: 38, scope: !856)
!865 = !DILocalVariable(name: "status", scope: !856, file: !196, line: 449, type: !28)
!866 = !DILocation(line: 449, column: 10, scope: !856)
!867 = !DILocation(line: 449, column: 36, scope: !856)
!868 = !DILocation(line: 449, column: 42, scope: !856)
!869 = !DILocation(line: 449, column: 19, scope: !856)
!870 = !DILocalVariable(name: "status_text", scope: !856, file: !196, line: 450, type: !192)
!871 = !DILocation(line: 450, column: 17, scope: !856)
!872 = !DILocalVariable(name: "embedded_status_text", scope: !856, file: !196, line: 451, type: !59)
!873 = !DILocation(line: 451, column: 11, scope: !856)
!874 = !DILocalVariable(name: "failure_text", scope: !856, file: !196, line: 452, type: !875)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2048, align: 8, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 256)
!878 = !DILocation(line: 452, column: 10, scope: !856)
!879 = !DILocation(line: 454, column: 9, scope: !880)
!880 = distinct !DILexicalBlock(scope: !856, file: !196, line: 454, column: 9)
!881 = !DILocation(line: 454, column: 16, scope: !880)
