; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--evp--libcrypto-lib-bio_enc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--evp--libcrypto-lib-bio_enc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bio_method_st = type { i32, i8*, i32 (%struct.bio_st*, i8*, i64, i64*)*, i32 (%struct.bio_st*, i8*, i32)*, i32 (%struct.bio_st*, i8*, i64, i64*)*, i32 (%struct.bio_st*, i8*, i32)*, i32 (%struct.bio_st*, i8*)*, i32 (%struct.bio_st*, i8*, i32)*, i64 (%struct.bio_st*, i32, i64, i8*)*, i32 (%struct.bio_st*)*, i32 (%struct.bio_st*)*, i64 (%struct.bio_st*, i32, i32 (%struct.bio_st*, i32, i32)*)* }
%struct.bio_st = type opaque
%struct.evp_cipher_st = type opaque
%struct.enc_struct = type { i32, i32, i32, i32, i32, %struct.evp_cipher_ctx_st*, i8*, i8*, [4384 x i8] }
%struct.evp_cipher_ctx_st = type opaque
%struct.engine_st = type opaque


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !22)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--evp--libcrypto-lib-bio_enc.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !8, !11, !12, !13, !14, !19}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!7 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!10 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER_CTX", file: !17, line: 90, baseType: !18)
!17 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_ctx_st", file: !17, line: 90, flags: DIFlagFwdDecl)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !17, line: 79, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !17, line: 79, flags: DIFlagFwdDecl)
!22 = !{!23}
!23 = distinct !DIGlobalVariable(name: "methods_enc", scope: !0, file: !24, line: 42, type: !25, isLocal: true, isDefinition: true, variable: %struct.bio_method_st* @methods_enc)
!24 = !DIFile(filename: "crypto/evp/bio_enc.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO_METHOD", file: !27, line: 263, baseType: !28)
!27 = !DIFile(filename: "include/openssl/bio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bio_method_st", file: !29, line: 15, size: 768, align: 64, elements: !30)
!29 = !DIFile(filename: "include/internal/bio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!30 = !{!31, !32, !34, !42, !46, !50, !54, !58, !59, !63, !67, !68}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !28, file: !29, line: 16, baseType: !12, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !28, file: !29, line: 17, baseType: !33, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "bwrite", scope: !28, file: !29, line: 18, baseType: !35, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{!12, !19, !5, !38, !41}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !39, line: 216, baseType: !40)
!39 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!40 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "bwrite_old", scope: !28, file: !29, line: 19, baseType: !43, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!12, !19, !5, !12}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "bread", scope: !28, file: !29, line: 20, baseType: !47, size: 64, align: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!12, !19, !33, !38, !41}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "bread_old", scope: !28, file: !29, line: 21, baseType: !51, size: 64, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!12, !19, !33, !12}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "bputs", scope: !28, file: !29, line: 22, baseType: !55, size: 64, align: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!12, !19, !5}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "bgets", scope: !28, file: !29, line: 23, baseType: !51, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !28, file: !29, line: 24, baseType: !60, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!13, !19, !12, !13, !4}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !28, file: !29, line: 25, baseType: !64, size: 64, align: 64, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!12, !19}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !28, file: !29, line: 26, baseType: !64, size: 64, align: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "callback_ctrl", scope: !28, file: !29, line: 27, baseType: !69, size: 64, align: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!13, !19, !12, !72}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO_info_cb", file: !27, line: 268, baseType: !74)
!74 = !DISubroutineType(types: !75)
!75 = !{!12, !19, !12, !12}
!76 = !{i32 2, !"Dwarf Version", i32 4}
!77 = !{i32 2, !"Debug Info Version", i32 3}
!78 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!79 = distinct !DISubprogram(name: "BIO_f_cipher", scope: !24, file: !24, line: 59, type: !80, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!80 = !DISubroutineType(types: !81)
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!83 = !DILocation(line: 61, column: 5, scope: !79)
!84 = distinct !DISubprogram(name: "BIO_set_cipher", scope: !24, file: !24, line: 404, type: !85, isLocal: false, isDefinition: true, scopeLine: 406, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!85 = !DISubroutineType(types: !86)
!86 = !{!12, !19, !87, !8, !8, !12}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !17, line: 89, baseType: !90)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !17, line: 89, flags: DIFlagFwdDecl)
!91 = !DILocalVariable(name: "b", arg: 1, scope: !84, file: !24, line: 404, type: !19)
!92 = !DIExpression()
!93 = !DILocation(line: 404, column: 25, scope: !84)
!94 = !DILocalVariable(name: "c", arg: 2, scope: !84, file: !24, line: 404, type: !87)
!95 = !DILocation(line: 404, column: 46, scope: !84)
!96 = !DILocalVariable(name: "k", arg: 3, scope: !84, file: !24, line: 404, type: !8)
!97 = !DILocation(line: 404, column: 70, scope: !84)
!98 = !DILocalVariable(name: "i", arg: 4, scope: !84, file: !24, line: 405, type: !8)
!99 = !DILocation(line: 405, column: 41, scope: !84)
!100 = !DILocalVariable(name: "e", arg: 5, scope: !84, file: !24, line: 405, type: !12)
!101 = !DILocation(line: 405, column: 48, scope: !84)
!102 = !DILocalVariable(name: "ctx", scope: !84, file: !24, line: 407, type: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO_ENC_CTX", file: !24, line: 40, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "enc_struct", file: !24, line: 27, size: 35456, align: 64, elements: !106)
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114, !115}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !105, file: !24, line: 28, baseType: !12, size: 32, align: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "buf_off", scope: !105, file: !24, line: 29, baseType: !12, size: 32, align: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !105, file: !24, line: 30, baseType: !12, size: 32, align: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "finished", scope: !105, file: !24, line: 31, baseType: !12, size: 32, align: 32, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !105, file: !24, line: 32, baseType: !12, size: 32, align: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !105, file: !24, line: 33, baseType: !15, size: 64, align: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "read_start", scope: !105, file: !24, line: 34, baseType: !11, size: 64, align: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "read_end", scope: !105, file: !24, line: 34, baseType: !11, size: 64, align: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !105, file: !24, line: 39, baseType: !116, size: 35072, align: 8, offset: 384)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 35072, align: 8, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 4384)
!119 = !DILocation(line: 407, column: 18, scope: !84)
!120 = !DILocalVariable(name: "callback", scope: !84, file: !24, line: 408, type: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!13, !124, !12, !5, !12, !13, !13}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!125 = !DILocation(line: 408, column: 12, scope: !84)
!126 = !DILocation(line: 410, column: 24, scope: !84)
!127 = !DILocation(line: 410, column: 11, scope: !84)
!128 = !DILocation(line: 410, column: 9, scope: !84)
!129 = !DILocation(line: 411, column: 9, scope: !130)
!130 = distinct !DILexicalBlock(scope: !84, file: !24, line: 411, column: 9)
!131 = !DILocation(line: 411, column: 13, scope: !130)
!132 = !DILocation(line: 411, column: 9, scope: !84)
!133 = !DILocation(line: 412, column: 9, scope: !130)
!134 = !DILocation(line: 414, column: 33, scope: !84)
!135 = !DILocation(line: 414, column: 16, scope: !84)
!136 = !DILocation(line: 414, column: 14, scope: !84)
!137 = !DILocation(line: 416, column: 10, scope: !138)
!138 = distinct !DILexicalBlock(scope: !84, file: !24, line: 416, column: 9)
!139 = !DILocation(line: 416, column: 19, scope: !138)
!140 = !DILocation(line: 416, column: 27, scope: !138)
!141 = !DILocation(line: 417, column: 14, scope: !138)
!142 = !DILocation(line: 417, column: 23, scope: !138)
!143 = !DILocation(line: 417, column: 46, scope: !138)
!144 = !DILocation(line: 417, column: 32, scope: !138)
!145 = !DILocation(line: 417, column: 52, scope: !138)
!146 = !DILocation(line: 418, column: 27, scope: !138)
!147 = !DILocation(line: 416, column: 9, scope: !148)
!148 = !DILexicalBlockFile(scope: !84, file: !24, discriminator: 1)
!149 = !DILocation(line: 419, column: 9, scope: !138)
!150 = !DILocation(line: 421, column: 18, scope: !84)
!151 = !DILocation(line: 421, column: 5, scope: !84)
!152 = !DILocation(line: 423, column: 28, scope: !153)
!153 = distinct !DILexicalBlock(scope: !84, file: !24, line: 423, column: 9)
!154 = !DILocation(line: 423, column: 33, scope: !153)
!155 = !DILocation(line: 423, column: 41, scope: !153)
!156 = !DILocation(line: 423, column: 49, scope: !153)
!157 = !DILocation(line: 423, column: 52, scope: !153)
!158 = !DILocation(line: 423, column: 55, scope: !153)
!159 = !DILocation(line: 423, column: 10, scope: !153)
!160 = !DILocation(line: 423, column: 9, scope: !84)
!161 = !DILocation(line: 424, column: 9, scope: !153)
!162 = !DILocation(line: 426, column: 9, scope: !163)
!163 = distinct !DILexicalBlock(scope: !84, file: !24, line: 426, column: 9)
!164 = !DILocation(line: 426, column: 18, scope: !163)
!165 = !DILocation(line: 426, column: 9, scope: !84)
!166 = !DILocation(line: 427, column: 16, scope: !163)
!167 = !DILocation(line: 427, column: 25, scope: !163)
!168 = !DILocation(line: 427, column: 48, scope: !163)
!169 = !DILocation(line: 427, column: 34, scope: !163)
!170 = !DILocation(line: 427, column: 54, scope: !163)
!171 = !DILocation(line: 427, column: 9, scope: !163)
!172 = !DILocation(line: 428, column: 5, scope: !84)
!173 = !DILocation(line: 429, column: 1, scope: !84)
!174 = distinct !DISubprogram(name: "enc_write", scope: !24, file: !24, line: 234, type: !44, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!175 = !DILocalVariable(name: "b", arg: 1, scope: !174, file: !24, line: 234, type: !19)
!176 = !DILocation(line: 234, column: 27, scope: !174)
!177 = !DILocalVariable(name: "in", arg: 2, scope: !174, file: !24, line: 234, type: !5)
!178 = !DILocation(line: 234, column: 42, scope: !174)
