; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--pkcs12--libcrypto-lib-p12_crt.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--pkcs12--libcrypto-lib-p12_crt.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PKCS12_st = type { %struct.asn1_string_st*, %struct.PKCS12_MAC_DATA_st*, %struct.pkcs7_st* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.PKCS12_MAC_DATA_st = type { %struct.X509_sig_st*, %struct.asn1_string_st*, %struct.asn1_string_st* }
%struct.X509_sig_st = type opaque
%struct.pkcs7_st = type { i8*, i64, i32, i32, %struct.asn1_object_st*, %union.anon }
%struct.asn1_object_st = type opaque
%union.anon = type { i8* }
%struct.evp_pkey_st = type opaque
%struct.x509_st = type opaque
%struct.stack_st_X509 = type opaque
%struct.stack_st_PKCS7 = type opaque
%struct.stack_st_PKCS12_SAFEBAG = type opaque
%struct.PKCS12_SAFEBAG_st = type { %struct.asn1_object_st*, %union.anon.1, %struct.stack_st_X509_ATTRIBUTE* }
%union.anon.1 = type { %struct.pkcs12_bag_st* }
%struct.pkcs12_bag_st = type { %struct.asn1_object_st*, %union.anon.2 }
%union.anon.2 = type { %struct.asn1_string_st* }
%struct.stack_st_X509_ATTRIBUTE = type opaque
%struct.evp_md_st = type opaque
%struct.stack_st = type opaque
%struct.pkcs8_priv_key_info_st = type opaque
%struct.x509_attributes_st = type opaque


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--pkcs12--libcrypto-lib-p12_crt.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !7, !12, !16, !17, !21, !24, !26}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !10, line: 17, baseType: !11)
!10 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !10, line: 17, flags: DIFlagFwdDecl)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !14, line: 124, baseType: !15)
!14 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !14, line: 124, flags: DIFlagFwdDecl)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !10, line: 20, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DISubroutineType(types: !20)
!20 = !{null, !4}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7", file: !23, line: 146, flags: DIFlagFwdDecl)
!23 = !DIFile(filename: "include/openssl/pkcs7.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS12_SAFEBAG", file: !28, line: 49, flags: DIFlagFwdDecl)
!28 = !DIFile(filename: "include/openssl/pkcs12.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!29 = !{i32 2, !"Dwarf Version", i32 4}
!30 = !{i32 2, !"Debug Info Version", i32 3}
!31 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!32 = distinct !DISubprogram(name: "PKCS12_create", scope: !33, file: !33, line: 31, type: !34, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!33 = !DIFile(filename: "crypto/pkcs12/p12_crt.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !223, !223, !225, !12, !97, !48, !48, !48, !48, !48}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS12", file: !28, line: 45, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PKCS12_st", file: !39, line: 16, size: 192, align: 64, elements: !40)
!39 = !DIFile(filename: "crypto/pkcs12/p12_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!40 = !{!41, !55, !69}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !38, file: !39, line: 17, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !14, line: 40, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !45, line: 146, size: 192, align: 64, elements: !46)
!45 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!46 = !{!47, !49, !50, !53}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !44, file: !45, line: 147, baseType: !48, size: 32, align: 32)
!48 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !44, file: !45, line: 148, baseType: !48, size: 32, align: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !44, file: !45, line: 149, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !44, file: !45, line: 155, baseType: !54, size: 64, align: 64, offset: 128)
!54 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !38, file: !39, line: 18, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS12_MAC_DATA", file: !28, line: 43, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PKCS12_MAC_DATA_st", file: !39, line: 10, size: 192, align: 64, elements: !59)
!59 = !{!60, !65, !68}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "dinfo", scope: !58, file: !39, line: 11, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_SIG", file: !63, line: 71, baseType: !64)
!63 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_sig_st", file: !63, line: 71, flags: DIFlagFwdDecl)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "salt", scope: !58, file: !39, line: 12, baseType: !66, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !14, line: 43, baseType: !44)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !58, file: !39, line: 13, baseType: !42, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "authsafes", scope: !38, file: !39, line: 19, baseType: !70, size: 64, align: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7", file: !23, line: 144, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_st", file: !23, line: 109, size: 320, align: 64, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !82}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "asn1", scope: !72, file: !23, line: 114, baseType: !51, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !72, file: !23, line: 115, baseType: !54, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !72, file: !23, line: 119, baseType: !48, size: 32, align: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !72, file: !23, line: 120, baseType: !48, size: 32, align: 32, offset: 160)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !72, file: !23, line: 121, baseType: !79, size: 64, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !14, line: 60, baseType: !81)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !14, line: 60, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !72, file: !23, line: 143, baseType: !83, size: 64, align: 64, offset: 256)
!83 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !72, file: !23, line: 127, size: 64, align: 64, elements: !84)
!84 = !{!85, !86, !87, !107, !194, !206, !215, !222}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !83, file: !23, line: 128, baseType: !5, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !83, file: !23, line: 130, baseType: !66, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !83, file: !23, line: 132, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGNED", file: !23, line: 68, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signed_st", file: !23, line: 61, size: 384, align: 64, elements: !91)
!91 = !{!92, !93, !96, !99, !102, !105}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !90, file: !23, line: 62, baseType: !42, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !90, file: !23, line: 63, baseType: !94, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ALGOR", file: !45, line: 119, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !90, file: !23, line: 64, baseType: !97, size: 64, align: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !63, line: 99, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !90, file: !23, line: 65, baseType: !100, size: 64, align: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_CRL", file: !63, line: 228, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !90, file: !23, line: 66, baseType: !103, size: 64, align: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_SIGNER_INFO", file: !23, line: 49, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !90, file: !23, line: 67, baseType: !106, size: 64, align: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "enveloped", scope: !83, file: !23, line: 134, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENVELOPE", file: !23, line: 85, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enveloped_st", file: !23, line: 81, size: 192, align: 64, elements: !111)
!111 = !{!112, !113, !116}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !110, file: !23, line: 82, baseType: !42, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !110, file: !23, line: 83, baseType: !114, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_RECIP_INFO", file: !23, line: 59, flags: DIFlagFwdDecl)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !110, file: !23, line: 84, baseType: !117, size: 64, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENC_CONTENT", file: !23, line: 79, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enc_content_st", file: !23, line: 74, size: 256, align: 64, elements: !120)
!120 = !{!121, !122, !188, !189}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !119, file: !23, line: 75, baseType: !79, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !119, file: !23, line: 76, baseType: !123, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !14, line: 125, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !63, line: 59, size: 128, align: 64, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !125, file: !63, line: 60, baseType: !79, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !125, file: !63, line: 61, baseType: !129, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !45, line: 473, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !45, line: 444, size: 128, align: 64, elements: !132)
!132 = !{!133, !134}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !131, file: !45, line: 445, baseType: !48, size: 32, align: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !131, file: !45, line: 472, baseType: !135, size: 64, align: 64, offset: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !131, file: !45, line: 446, size: 64, align: 64, elements: !136)
!136 = !{!137, !138, !140, !143, !144, !145, !148, !151, !152, !155, !158, !161, !164, !167, !170, !173, !176, !179, !182, !183, !184}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !135, file: !45, line: 447, baseType: !5, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !135, file: !45, line: 448, baseType: !139, size: 32, align: 32)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !14, line: 56, baseType: !48)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !135, file: !45, line: 449, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !14, line: 55, baseType: !44)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !135, file: !45, line: 450, baseType: !79, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !135, file: !45, line: 451, baseType: !42, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !135, file: !45, line: 452, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !14, line: 41, baseType: !44)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !135, file: !45, line: 453, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !14, line: 42, baseType: !44)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !135, file: !45, line: 454, baseType: !66, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !135, file: !45, line: 455, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !14, line: 44, baseType: !44)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !135, file: !45, line: 456, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !14, line: 45, baseType: !44)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !135, file: !45, line: 457, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !14, line: 46, baseType: !44)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !135, file: !45, line: 458, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !14, line: 47, baseType: !44)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !135, file: !45, line: 459, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !14, line: 49, baseType: !44)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !135, file: !45, line: 460, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !14, line: 48, baseType: !44)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !135, file: !45, line: 461, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !14, line: 50, baseType: !44)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !135, file: !45, line: 462, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !14, line: 52, baseType: !44)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !135, file: !45, line: 463, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !14, line: 53, baseType: !44)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !135, file: !45, line: 464, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !14, line: 54, baseType: !44)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !135, file: !45, line: 469, baseType: !141, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !135, file: !45, line: 470, baseType: !141, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !135, file: !45, line: 471, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !45, line: 213, baseType: !187)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !45, line: 213, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !119, file: !23, line: 77, baseType: !66, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !119, file: !23, line: 78, baseType: !190, size: 64, align: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !14, line: 89, baseType: !193)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !14, line: 89, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "signed_and_enveloped", scope: !83, file: !23, line: 136, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGN_ENVELOPE", file: !23, line: 95, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signedandenveloped_st", file: !23, line: 87, size: 448, align: 64, elements: !198)
!198 = !{!199, !200, !201, !202, !203, !204, !205}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !197, file: !23, line: 88, baseType: !42, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !197, file: !23, line: 89, baseType: !94, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !197, file: !23, line: 90, baseType: !97, size: 64, align: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !197, file: !23, line: 91, baseType: !100, size: 64, align: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !197, file: !23, line: 92, baseType: !103, size: 64, align: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !197, file: !23, line: 93, baseType: !117, size: 64, align: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !197, file: !23, line: 94, baseType: !114, size: 64, align: 64, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !83, file: !23, line: 138, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_DIGEST", file: !23, line: 102, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_digest_st", file: !23, line: 97, size: 256, align: 64, elements: !210)
!210 = !{!211, !212, !213, !214}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !209, file: !23, line: 98, baseType: !42, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !209, file: !23, line: 99, baseType: !123, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !209, file: !23, line: 100, baseType: !106, size: 64, align: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !209, file: !23, line: 101, baseType: !66, size: 64, align: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "encrypted", scope: !83, file: !23, line: 140, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENCRYPT", file: !23, line: 107, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_encrypted_st", file: !23, line: 104, size: 128, align: 64, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !218, file: !23, line: 105, baseType: !42, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !218, file: !23, line: 106, baseType: !117, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !83, file: !23, line: 142, baseType: !129, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !14, line: 95, baseType: !227)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !14, line: 95, flags: DIFlagFwdDecl)
!228 = !DILocalVariable(name: "pass", arg: 1, scope: !32, file: !33, line: 31, type: !223)
!229 = !DIExpression()
!230 = !DILocation(line: 31, column: 35, scope: !32)
!231 = !DILocalVariable(name: "name", arg: 2, scope: !32, file: !33, line: 31, type: !223)
!232 = !DILocation(line: 31, column: 53, scope: !32)
!233 = !DILocalVariable(name: "pkey", arg: 3, scope: !32, file: !33, line: 31, type: !225)
!234 = !DILocation(line: 31, column: 69, scope: !32)
!235 = !DILocalVariable(name: "cert", arg: 4, scope: !32, file: !33, line: 31, type: !12)
!236 = !DILocation(line: 31, column: 81, scope: !32)
!237 = !DILocalVariable(name: "ca", arg: 5, scope: !32, file: !33, line: 32, type: !97)
!238 = !DILocation(line: 32, column: 45, scope: !32)
!239 = !DILocalVariable(name: "nid_key", arg: 6, scope: !32, file: !33, line: 32, type: !48)
!240 = !DILocation(line: 32, column: 53, scope: !32)
!241 = !DILocalVariable(name: "nid_cert", arg: 7, scope: !32, file: !33, line: 32, type: !48)
!242 = !DILocation(line: 32, column: 66, scope: !32)
!243 = !DILocalVariable(name: "iter", arg: 8, scope: !32, file: !33, line: 32, type: !48)
!244 = !DILocation(line: 32, column: 80, scope: !32)
!245 = !DILocalVariable(name: "mac_iter", arg: 9, scope: !32, file: !33, line: 33, type: !48)
!246 = !DILocation(line: 33, column: 27, scope: !32)
!247 = !DILocalVariable(name: "keytype", arg: 10, scope: !32, file: !33, line: 33, type: !48)
!248 = !DILocation(line: 33, column: 41, scope: !32)
!249 = !DILocalVariable(name: "p12", scope: !32, file: !33, line: 35, type: !36)
!250 = !DILocation(line: 35, column: 13, scope: !32)
!251 = !DILocalVariable(name: "safes", scope: !32, file: !33, line: 36, type: !21)
!252 = !DILocation(line: 36, column: 28, scope: !32)
!253 = !DILocalVariable(name: "bags", scope: !32, file: !33, line: 37, type: !26)
!254 = !DILocation(line: 37, column: 37, scope: !32)
!255 = !DILocalVariable(name: "bag", scope: !32, file: !33, line: 38, type: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS12_SAFEBAG", file: !28, line: 47, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PKCS12_SAFEBAG_st", file: !39, line: 22, size: 192, align: 64, elements: !259)
!259 = !{!260, !261, !283}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !258, file: !39, line: 23, baseType: !79, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !258, file: !39, line: 30, baseType: !262, size: 64, align: 64, offset: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !258, file: !39, line: 24, size: 64, align: 64, elements: !263)
!263 = !{!264, !277, !280, !281, !282}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "bag", scope: !262, file: !39, line: 25, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs12_bag_st", file: !39, line: 34, size: 128, align: 64, elements: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !266, file: !39, line: 35, baseType: !79, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !266, file: !39, line: 42, baseType: !270, size: 64, align: 64, offset: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !39, line: 36, size: 64, align: 64, elements: !271)
!271 = !{!272, !273, !274, !275, !276}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "x509cert", scope: !270, file: !39, line: 37, baseType: !66, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "x509crl", scope: !270, file: !39, line: 38, baseType: !66, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "octet", scope: !270, file: !39, line: 39, baseType: !66, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "sdsicert", scope: !270, file: !39, line: 40, baseType: !159, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !270, file: !39, line: 41, baseType: !129, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "keybag", scope: !262, file: !39, line: 26, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs8_priv_key_info_st", file: !14, line: 141, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "shkeybag", scope: !262, file: !39, line: 27, baseType: !61, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "safes", scope: !262, file: !39, line: 28, baseType: !26, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !262, file: !39, line: 29, baseType: !129, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "attrib", scope: !258, file: !39, line: 31, baseType: !284, size: 64, align: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ATTRIBUTE", file: !63, line: 89, flags: DIFlagFwdDecl)
!286 = !DILocation(line: 38, column: 21, scope: !32)
!287 = !DILocalVariable(name: "i", scope: !32, file: !33, line: 39, type: !48)
!288 = !DILocation(line: 39, column: 9, scope: !32)
!289 = !DILocalVariable(name: "keyid", scope: !32, file: !33, line: 40, type: !290)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 512, align: 8, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 64)
!293 = !DILocation(line: 40, column: 19, scope: !32)
!294 = !DILocalVariable(name: "keyidlen", scope: !32, file: !33, line: 41, type: !295)
!295 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!296 = !DILocation(line: 41, column: 18, scope: !32)
!297 = !DILocation(line: 44, column: 10, scope: !298)
!298 = distinct !DILexicalBlock(scope: !32, file: !33, line: 44, column: 9)
!299 = !DILocation(line: 44, column: 9, scope: !32)
!300 = !DILocation(line: 48, column: 18, scope: !298)
!301 = !DILocation(line: 48, column: 9, scope: !298)
!302 = !DILocation(line: 50, column: 10, scope: !303)
!303 = distinct !DILexicalBlock(scope: !32, file: !33, line: 50, column: 9)
!304 = !DILocation(line: 50, column: 9, scope: !32)
!305 = !DILocation(line: 51, column: 17, scope: !303)
!306 = !DILocation(line: 51, column: 9, scope: !303)
!307 = !DILocation(line: 52, column: 10, scope: !308)
!308 = distinct !DILexicalBlock(scope: !32, file: !33, line: 52, column: 9)
!309 = !DILocation(line: 52, column: 9, scope: !32)
!310 = !DILocation(line: 53, column: 14, scope: !308)
!311 = !DILocation(line: 53, column: 9, scope: !308)
!312 = !DILocation(line: 54, column: 10, scope: !313)
!313 = distinct !DILexicalBlock(scope: !32, file: !33, line: 54, column: 9)
!314 = !DILocation(line: 54, column: 9, scope: !32)
!315 = !DILocation(line: 55, column: 18, scope: !313)
!316 = !DILocation(line: 55, column: 9, scope: !313)
!317 = !DILocation(line: 57, column: 10, scope: !318)
!318 = distinct !DILexicalBlock(scope: !32, file: !33, line: 57, column: 9)
!319 = !DILocation(line: 57, column: 15, scope: !318)
!320 = !DILocation(line: 57, column: 19, scope: !321)
!321 = !DILexicalBlockFile(scope: !318, file: !33, discriminator: 1)
!322 = !DILocation(line: 57, column: 24, scope: !321)
!323 = !DILocation(line: 57, column: 28, scope: !324)
!324 = !DILexicalBlockFile(scope: !318, file: !33, discriminator: 2)
!325 = !DILocation(line: 57, column: 9, scope: !324)
!326 = !DILocation(line: 58, column: 9, scope: !327)
!327 = distinct !DILexicalBlock(scope: !318, file: !33, line: 57, column: 32)
!328 = !DILocation(line: 59, column: 9, scope: !327)
!329 = !DILocation(line: 62, column: 9, scope: !330)
!330 = distinct !DILexicalBlock(scope: !32, file: !33, line: 62, column: 9)
!331 = !DILocation(line: 62, column: 14, scope: !330)
!332 = !DILocation(line: 62, column: 17, scope: !333)
!333 = !DILexicalBlockFile(scope: !330, file: !33, discriminator: 1)
!334 = !DILocation(line: 62, column: 9, scope: !333)
!335 = !DILocation(line: 63, column: 37, scope: !336)
!336 = distinct !DILexicalBlock(scope: !337, file: !33, line: 63, column: 13)
!337 = distinct !DILexicalBlock(scope: !330, file: !33, line: 62, column: 23)
!338 = !DILocation(line: 63, column: 43, scope: !336)
!339 = !DILocation(line: 63, column: 14, scope: !336)
!340 = !DILocation(line: 63, column: 13, scope: !337)
!341 = !DILocation(line: 64, column: 13, scope: !336)
!342 = !DILocation(line: 65, column: 21, scope: !337)
!343 = !DILocation(line: 65, column: 27, scope: !337)
!344 = !DILocation(line: 65, column: 39, scope: !337)
!345 = !DILocation(line: 65, column: 9, scope: !346)
!346 = !DILexicalBlockFile(scope: !337, file: !33, discriminator: 1)
