; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--igetest-bin-igetest.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--igetest-bin-igetest.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ige_test = type { [16 x i8], [32 x i8], [64 x i8], [64 x i8], i64, i32 }
%struct.bi_ige_test = type { [32 x i8], [32 x i8], [64 x i8], [64 x i8], [64 x i8], i64, i64, i32 }
%struct.aes_key_st = type { [60 x i32], i32 }

@rkey = internal global [16 x i8] zeroinitializer, align 16
@rkey2 = internal global [16 x i8] zeroinitializer, align 16
@plaintext = internal global [10240 x i8] zeroinitializer, align 16
@saved_iv = internal global [64 x i8] zeroinitializer, align 16
@.str = private unnamed_addr constant [17 x i8] c"test_ige_enc_dec\00", align 1
@.str.1 = private unnamed_addr constant [22 x i8] c"test_ige_enc_chaining\00", align 1
@.str.2 = private unnamed_addr constant [22 x i8] c"test_ige_dec_chaining\00", align 1
@.str.3 = private unnamed_addr constant [25 x i8] c"test_ige_garble_forwards\00", align 1
@.str.4 = private unnamed_addr constant [20 x i8] c"test_bi_ige_enc_dec\00", align 1
@.str.5 = private unnamed_addr constant [20 x i8] c"test_bi_ige_garble1\00", align 1
@.str.6 = private unnamed_addr constant [20 x i8] c"test_bi_ige_garble2\00", align 1
@.str.7 = private unnamed_addr constant [20 x i8] c"test_bi_ige_garble3\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--igetest-bin-igetest.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !10, !11, !15, !19, !44}
!4 = distinct !DIGlobalVariable(name: "rkey", scope: !0, file: !5, line: 25, type: !6, isLocal: true, isDefinition: true, variable: [16 x i8]* @rkey)
!5 = !DIFile(filename: "test/igetest.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!6 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, align: 8, elements: !8)
!7 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!8 = !{!9}
!9 = !DISubrange(count: 16)
!10 = distinct !DIGlobalVariable(name: "rkey2", scope: !0, file: !5, line: 26, type: !6, isLocal: true, isDefinition: true, variable: [16 x i8]* @rkey2)
!11 = distinct !DIGlobalVariable(name: "plaintext", scope: !0, file: !5, line: 27, type: !12, isLocal: true, isDefinition: true, variable: [10240 x i8]* @plaintext)
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 81920, align: 8, elements: !13)
!13 = !{!14}
!14 = !DISubrange(count: 10240)
!15 = distinct !DIGlobalVariable(name: "saved_iv", scope: !0, file: !5, line: 28, type: !16, isLocal: true, isDefinition: true, variable: [64 x i8]* @saved_iv)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, align: 8, elements: !17)
!17 = !{!18}
!18 = !DISubrange(count: 64)
!19 = distinct !DIGlobalVariable(name: "ige_test_vectors", scope: !0, file: !5, line: 41, type: !20, isLocal: true, isDefinition: true, variable: [2 x %struct.ige_test]* @ige_test_vectors)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 3072, align: 64, elements: !42)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ige_test", file: !5, line: 32, size: 1536, align: 64, elements: !23)
!23 = !{!24, !27, !31, !33, !34, !39}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !22, file: !5, line: 33, baseType: !25, size: 128, align: 8)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 128, align: 8, elements: !8)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "iv", scope: !22, file: !5, line: 34, baseType: !28, size: 256, align: 8, offset: 128)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 256, align: 8, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !22, file: !5, line: 35, baseType: !32, size: 512, align: 8, offset: 384)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 512, align: 8, elements: !17)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !22, file: !5, line: 36, baseType: !32, size: 512, align: 8, offset: 896)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !22, file: !5, line: 37, baseType: !35, size: 64, align: 64, offset: 1408)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !37, line: 216, baseType: !38)
!37 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!38 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "encrypt", scope: !22, file: !5, line: 38, baseType: !40, size: 32, align: 32, offset: 1472)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!42 = !{!43}
!43 = !DISubrange(count: 2)
!44 = distinct !DIGlobalVariable(name: "bi_ige_test_vectors", scope: !0, file: !5, line: 86, type: !45, isLocal: true, isDefinition: true, variable: [2 x %struct.bi_ige_test]* @bi_ige_test_vectors)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 4480, align: 64, elements: !42)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bi_ige_test", file: !5, line: 75, size: 2240, align: 64, elements: !48)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "key1", scope: !47, file: !5, line: 76, baseType: !28, size: 256, align: 8)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "key2", scope: !47, file: !5, line: 77, baseType: !28, size: 256, align: 8, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "iv", scope: !47, file: !5, line: 78, baseType: !32, size: 512, align: 8, offset: 512)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !47, file: !5, line: 79, baseType: !32, size: 512, align: 8, offset: 1024)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !47, file: !5, line: 80, baseType: !32, size: 512, align: 8, offset: 1536)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "keysize", scope: !47, file: !5, line: 81, baseType: !35, size: 64, align: 64, offset: 2048)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !47, file: !5, line: 82, baseType: !35, size: 64, align: 64, offset: 2112)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "encrypt", scope: !47, file: !5, line: 83, baseType: !40, size: 32, align: 32, offset: 2176)
!57 = !{i32 2, !"Dwarf Version", i32 4}
!58 = !{i32 2, !"Debug Info Version", i32 3}
!59 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!60 = distinct !DISubprogram(name: "setup_tests", scope: !5, file: !5, line: 436, type: !61, isLocal: false, isDefinition: true, scopeLine: 437, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!61 = !DISubroutineType(types: !62)
!62 = !{!41}
!63 = !DILocation(line: 438, column: 5, scope: !60)
!64 = !DILocation(line: 439, column: 5, scope: !60)
!65 = !DILocation(line: 440, column: 5, scope: !60)
!66 = !DILocation(line: 441, column: 5, scope: !60)
!67 = !DILocation(line: 443, column: 5, scope: !60)
!68 = !DILocation(line: 444, column: 5, scope: !60)
!69 = !DILocation(line: 445, column: 5, scope: !60)
!70 = !DILocation(line: 446, column: 5, scope: !60)
!71 = !DILocation(line: 447, column: 5, scope: !60)
!72 = !DILocation(line: 448, column: 5, scope: !60)
!73 = !DILocation(line: 449, column: 5, scope: !60)
!74 = !DILocation(line: 450, column: 5, scope: !60)
!75 = !DILocation(line: 451, column: 5, scope: !60)
!76 = !DILocation(line: 452, column: 5, scope: !60)
!77 = !DILocation(line: 453, column: 5, scope: !60)
!78 = distinct !DISubprogram(name: "test_ige_enc_dec", scope: !5, file: !5, line: 218, type: !61, isLocal: true, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!79 = !DILocalVariable(name: "key", scope: !78, file: !5, line: 220, type: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "AES_KEY", file: !81, line: 39, baseType: !82)
!81 = !DIFile(filename: "include/openssl/aes.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aes_key_st", file: !81, line: 31, size: 1952, align: 32, elements: !83)
!83 = !{!84, !89}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "rd_key", scope: !82, file: !81, line: 35, baseType: !85, size: 1920, align: 32)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 1920, align: 32, elements: !87)
!86 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!87 = !{!88}
!88 = !DISubrange(count: 60)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "rounds", scope: !82, file: !81, line: 37, baseType: !41, size: 32, align: 32, offset: 1920)
!90 = !DIExpression()
!91 = !DILocation(line: 220, column: 13, scope: !78)
!92 = !DILocalVariable(name: "iv", scope: !78, file: !5, line: 221, type: !16)
!93 = !DILocation(line: 221, column: 19, scope: !78)
!94 = !DILocalVariable(name: "ciphertext", scope: !78, file: !5, line: 222, type: !12)
!95 = !DILocation(line: 222, column: 19, scope: !78)
!96 = !DILocalVariable(name: "checktext", scope: !78, file: !5, line: 223, type: !12)
!97 = !DILocation(line: 223, column: 19, scope: !78)
!98 = !DILocation(line: 225, column: 5, scope: !78)
!99 = !DILocation(line: 226, column: 5, scope: !78)
!100 = !DILocation(line: 227, column: 32, scope: !78)
!101 = !DILocation(line: 227, column: 55, scope: !78)
!102 = !DILocation(line: 227, column: 5, scope: !78)
!103 = !DILocation(line: 229, column: 5, scope: !78)
!104 = !DILocation(line: 230, column: 5, scope: !78)
!105 = !DILocation(line: 231, column: 21, scope: !78)
!106 = !DILocation(line: 231, column: 33, scope: !78)
!107 = !DILocation(line: 231, column: 55, scope: !78)
!108 = !DILocation(line: 231, column: 5, scope: !78)
!109 = !DILocation(line: 233, column: 73, scope: !78)
!110 = !DILocation(line: 233, column: 12, scope: !78)
!111 = !DILocation(line: 233, column: 5, scope: !78)
!112 = distinct !DISubprogram(name: "test_ige_enc_chaining", scope: !5, file: !5, line: 236, type: !61, isLocal: true, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!113 = !DILocalVariable(name: "key", scope: !112, file: !5, line: 238, type: !80)
!114 = !DILocation(line: 238, column: 13, scope: !112)
!115 = !DILocalVariable(name: "iv", scope: !112, file: !5, line: 239, type: !16)
!116 = !DILocation(line: 239, column: 19, scope: !112)
!117 = !DILocalVariable(name: "ciphertext", scope: !112, file: !5, line: 240, type: !12)
!118 = !DILocation(line: 240, column: 19, scope: !112)
!119 = !DILocalVariable(name: "checktext", scope: !112, file: !5, line: 241, type: !12)
!120 = !DILocation(line: 241, column: 19, scope: !112)
!121 = !DILocation(line: 243, column: 5, scope: !112)
!122 = !DILocation(line: 244, column: 5, scope: !112)
!123 = !DILocation(line: 245, column: 32, scope: !112)
!124 = !DILocation(line: 245, column: 59, scope: !112)
!125 = !DILocation(line: 245, column: 5, scope: !112)
!126 = !DILocation(line: 248, column: 21, scope: !112)
!127 = !DILocation(line: 248, column: 32, scope: !112)
!128 = !DILocation(line: 249, column: 27, scope: !112)
!129 = !DILocation(line: 247, column: 5, scope: !112)
!130 = !DILocation(line: 251, column: 5, scope: !112)
!131 = !DILocation(line: 252, column: 5, scope: !112)
!132 = !DILocation(line: 253, column: 21, scope: !112)
!133 = !DILocation(line: 253, column: 33, scope: !112)
!134 = !DILocation(line: 253, column: 55, scope: !112)
!135 = !DILocation(line: 253, column: 5, scope: !112)
!136 = !DILocation(line: 255, column: 73, scope: !112)
!137 = !DILocation(line: 255, column: 12, scope: !112)
!138 = !DILocation(line: 255, column: 5, scope: !112)
!139 = distinct !DISubprogram(name: "test_ige_dec_chaining", scope: !5, file: !5, line: 258, type: !61, isLocal: true, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!140 = !DILocalVariable(name: "key", scope: !139, file: !5, line: 260, type: !80)
!141 = !DILocation(line: 260, column: 13, scope: !139)
!142 = !DILocalVariable(name: "iv", scope: !139, file: !5, line: 261, type: !16)
!143 = !DILocation(line: 261, column: 19, scope: !139)
!144 = !DILocalVariable(name: "ciphertext", scope: !139, file: !5, line: 262, type: !12)
!145 = !DILocation(line: 262, column: 19, scope: !139)
!146 = !DILocalVariable(name: "checktext", scope: !139, file: !5, line: 263, type: !12)
!147 = !DILocation(line: 263, column: 19, scope: !139)
!148 = !DILocation(line: 265, column: 5, scope: !139)
