; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-asn1_gen.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-asn1_gen.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.tag_name_st = type { i8*, i32, i32 }
%struct.asn1_type_st = type { i32, %union.anon }
%union.anon = type { i8* }
%struct.conf_st = type { %struct.conf_method_st*, i8*, %struct.lhash_st_CONF_VALUE* }
%struct.conf_method_st = type { i8*, %struct.conf_st* (%struct.conf_method_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*, %struct.bio_st*, i64*)*, i32 (%struct.conf_st*, %struct.bio_st*)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8*, i64*)* }
%struct.bio_st = type opaque
%struct.lhash_st_CONF_VALUE = type { %union.lh_CONF_VALUE_dummy }
%union.lh_CONF_VALUE_dummy = type { i8* }
%struct.v3_ext_ctx = type { i32, %struct.x509_st*, %struct.x509_st*, %struct.X509_req_st*, %struct.X509_crl_st*, %struct.X509V3_CONF_METHOD_st*, i8* }
%struct.x509_st = type opaque
%struct.X509_req_st = type opaque
%struct.X509_crl_st = type opaque
%struct.X509V3_CONF_METHOD_st = type { i8* (i8*, i8*, i8*)*, %struct.stack_st_CONF_VALUE* (i8*, i8*)*, void (i8*, i8*)*, void (i8*, %struct.stack_st_CONF_VALUE*)* }
%struct.stack_st_CONF_VALUE = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !32)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-asn1_gen.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !7, !10, !15, !23, !24, !26, !30}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ASN1_TYPE", file: !9, line: 475, flags: DIFlagFwdDecl)
!9 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !13, line: 17, baseType: !14)
!13 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !13, line: 17, flags: DIFlagFwdDecl)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_VALUE", file: !17, line: 28, baseType: !18)
!17 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 24, size: 192, align: 64, elements: !19)
!19 = !{!20, !21, !22}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !18, file: !17, line: 25, baseType: !5, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !18, file: !17, line: 26, baseType: !5, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !18, file: !17, line: 27, baseType: !5, size: 64, align: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !13, line: 20, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{null, !4}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!32 = !{!33, !48}
!33 = distinct !DIGlobalVariable(name: "tntmp", scope: !34, file: !35, line: 505, type: !41, isLocal: true, isDefinition: true, variable: %struct.tag_name_st** @asn1_str2tag.tntmp)
!34 = distinct !DISubprogram(name: "asn1_str2tag", scope: !35, file: !35, line: 502, type: !36, isLocal: true, isDefinition: true, scopeLine: 503, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!35 = !DIFile(filename: "crypto/asn1/asn1_gen.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !39, !38}
!38 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tag_name_st", file: !35, line: 41, size: 128, align: 64, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "strnam", scope: !43, file: !35, line: 42, baseType: !39, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !43, file: !35, line: 43, baseType: !38, size: 32, align: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !43, file: !35, line: 44, baseType: !38, size: 32, align: 32, offset: 96)
!48 = distinct !DIGlobalVariable(name: "tnst", scope: !34, file: !35, line: 505, type: !49, isLocal: true, isDefinition: true, variable: [49 x %struct.tag_name_st]* @asn1_str2tag.tnst)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 6272, align: 64, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 49)
!52 = !{i32 2, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!55 = distinct !DISubprogram(name: "ASN1_generate_nconf", scope: !35, file: !35, line: 78, type: !56, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !39, !132}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !9, line: 473, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !9, line: 444, size: 128, align: 64, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !60, file: !9, line: 445, baseType: !38, size: 32, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !60, file: !9, line: 472, baseType: !64, size: 64, align: 64, offset: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !60, file: !9, line: 446, size: 64, align: 64, elements: !65)
!65 = !{!66, !67, !70, !80, !84, !87, !90, !93, !96, !99, !102, !105, !108, !111, !114, !117, !120, !123, !126, !127, !128}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !64, file: !9, line: 447, baseType: !5, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !64, file: !9, line: 448, baseType: !68, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !69, line: 56, baseType: !38)
!69 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!70 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !64, file: !9, line: 449, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !69, line: 55, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !9, line: 146, size: 192, align: 64, elements: !74)
!74 = !{!75, !76, !77, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !73, file: !9, line: 147, baseType: !38, size: 32, align: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !73, file: !9, line: 148, baseType: !38, size: 32, align: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !73, file: !9, line: 149, baseType: !30, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !73, file: !9, line: 155, baseType: !79, size: 64, align: 64, offset: 128)
!79 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !64, file: !9, line: 450, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !69, line: 60, baseType: !83)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !69, line: 60, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !64, file: !9, line: 451, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !69, line: 40, baseType: !73)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !64, file: !9, line: 452, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !69, line: 41, baseType: !73)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !64, file: !9, line: 453, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !69, line: 42, baseType: !73)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !64, file: !9, line: 454, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !69, line: 43, baseType: !73)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !64, file: !9, line: 455, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !69, line: 44, baseType: !73)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !64, file: !9, line: 456, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !69, line: 45, baseType: !73)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !64, file: !9, line: 457, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !69, line: 46, baseType: !73)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !64, file: !9, line: 458, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !69, line: 47, baseType: !73)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !64, file: !9, line: 459, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !69, line: 49, baseType: !73)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !64, file: !9, line: 460, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !69, line: 48, baseType: !73)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !64, file: !9, line: 461, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !69, line: 50, baseType: !73)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !64, file: !9, line: 462, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !69, line: 52, baseType: !73)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !64, file: !9, line: 463, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !69, line: 53, baseType: !73)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !64, file: !9, line: 464, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !69, line: 54, baseType: !73)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !64, file: !9, line: 469, baseType: !71, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !64, file: !9, line: 470, baseType: !71, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !64, file: !9, line: 471, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !9, line: 213, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !9, line: 213, flags: DIFlagFwdDecl)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF", file: !69, line: 144, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_st", file: !17, line: 103, size: 192, align: 64, elements: !135)
!135 = !{!136, !175, !176}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !134, file: !17, line: 104, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_METHOD", file: !17, line: 35, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_method_st", file: !17, line: 37, size: 640, align: 64, elements: !140)
!140 = !{!141, !142, !146, !150, !151, !152, !160, !166, !170, !171}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !139, file: !17, line: 38, baseType: !39, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !139, file: !17, line: 39, baseType: !143, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!132, !137}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !139, file: !17, line: 40, baseType: !147, size: 64, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!38, !132}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !139, file: !17, line: 41, baseType: !147, size: 64, align: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_data", scope: !139, file: !17, line: 42, baseType: !147, size: 64, align: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "load_bio", scope: !139, file: !17, line: 43, baseType: !153, size: 64, align: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!38, !132, !156, !159}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !69, line: 79, baseType: !158)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !69, line: 79, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !139, file: !17, line: 44, baseType: !161, size: 64, align: 64, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!38, !164, !156}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "is_number", scope: !139, file: !17, line: 45, baseType: !167, size: 64, align: 64, offset: 448)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!38, !164, !6}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "to_int", scope: !139, file: !17, line: 46, baseType: !167, size: 64, align: 64, offset: 512)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !139, file: !17, line: 47, baseType: !172, size: 64, align: 64, offset: 576)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!38, !132, !39, !159}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "meth_data", scope: !134, file: !17, line: 105, baseType: !4, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !134, file: !17, line: 106, baseType: !177, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st_CONF_VALUE", file: !17, line: 31, size: 64, align: 64, elements: !179)
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !178, file: !17, line: 31, baseType: !181, size: 64, align: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "lh_CONF_VALUE_dummy", file: !17, line: 31, size: 64, align: 64, elements: !182)
!182 = !{!183, !184, !186}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !181, file: !17, line: 31, baseType: !4, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !181, file: !17, line: 31, baseType: !185, size: 64, align: 64)
!185 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !181, file: !17, line: 31, baseType: !38, size: 32, align: 32)
!187 = !DILocalVariable(name: "str", arg: 1, scope: !55, file: !35, line: 78, type: !39)
!188 = !DIExpression()
!189 = !DILocation(line: 78, column: 44, scope: !55)
!190 = !DILocalVariable(name: "nconf", arg: 2, scope: !55, file: !35, line: 78, type: !132)
!191 = !DILocation(line: 78, column: 55, scope: !55)
!192 = !DILocalVariable(name: "cnf", scope: !55, file: !35, line: 80, type: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CTX", file: !69, line: 143, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_ctx", file: !195, line: 79, size: 448, align: 64, elements: !196)
!195 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!196 = !{!197, !198, !202, !203, !208, !212, !235}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !194, file: !195, line: 82, baseType: !38, size: 32, align: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_cert", scope: !194, file: !195, line: 83, baseType: !199, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !69, line: 124, baseType: !201)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !69, line: 124, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "subject_cert", scope: !194, file: !195, line: 84, baseType: !199, size: 64, align: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "subject_req", scope: !194, file: !195, line: 85, baseType: !204, size: 64, align: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_REQ", file: !206, line: 93, baseType: !207)
!206 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_req_st", file: !206, line: 93, flags: DIFlagFwdDecl)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !194, file: !195, line: 86, baseType: !209, size: 64, align: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !69, line: 126, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !69, line: 126, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "db_meth", scope: !194, file: !195, line: 87, baseType: !213, size: 64, align: 64, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CONF_METHOD", file: !195, line: 76, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509V3_CONF_METHOD_st", file: !195, line: 71, size: 256, align: 64, elements: !216)
!216 = !{!217, !221, !227, !231}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "get_string", scope: !215, file: !195, line: 72, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!5, !4, !39, !39}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "get_section", scope: !215, file: !195, line: 73, baseType: !222, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !4, !39}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !17, line: 30, flags: DIFlagFwdDecl)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "free_string", scope: !215, file: !195, line: 74, baseType: !228, size: 64, align: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !4, !5}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "free_section", scope: !215, file: !195, line: 75, baseType: !232, size: 64, align: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !4, !225}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !194, file: !195, line: 88, baseType: !4, size: 64, align: 64, offset: 384)
!236 = !DILocation(line: 80, column: 16, scope: !55)
!237 = !DILocation(line: 82, column: 10, scope: !238)
!238 = distinct !DILexicalBlock(scope: !55, file: !35, line: 82, column: 9)
!239 = !DILocation(line: 82, column: 9, scope: !55)
!240 = !DILocation(line: 83, column: 33, scope: !238)
!241 = !DILocation(line: 83, column: 16, scope: !238)
!242 = !DILocation(line: 83, column: 9, scope: !238)
!243 = !DILocation(line: 85, column: 28, scope: !55)
!244 = !DILocation(line: 85, column: 5, scope: !55)
!245 = !DILocation(line: 86, column: 29, scope: !55)
!246 = !DILocation(line: 86, column: 12, scope: !55)
!247 = !DILocation(line: 86, column: 5, scope: !55)
!248 = !DILocation(line: 87, column: 1, scope: !55)
!249 = distinct !DISubprogram(name: "ASN1_generate_v3", scope: !35, file: !35, line: 89, type: !250, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!250 = !DISubroutineType(types: !251)
!251 = !{!58, !39, !252}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!253 = !DILocalVariable(name: "str", arg: 1, scope: !249, file: !35, line: 89, type: !39)
!254 = !DILocation(line: 89, column: 41, scope: !249)
!255 = !DILocalVariable(name: "cnf", arg: 2, scope: !249, file: !35, line: 89, type: !252)
!256 = !DILocation(line: 89, column: 58, scope: !249)
!257 = !DILocalVariable(name: "err", scope: !249, file: !35, line: 91, type: !38)
!258 = !DILocation(line: 91, column: 9, scope: !249)
!259 = !DILocalVariable(name: "ret", scope: !249, file: !35, line: 92, type: !58)
!260 = !DILocation(line: 92, column: 16, scope: !249)
!261 = !DILocation(line: 92, column: 34, scope: !249)
!262 = !DILocation(line: 92, column: 39, scope: !249)
!263 = !DILocation(line: 92, column: 22, scope: !249)
!264 = !DILocation(line: 93, column: 9, scope: !265)
!265 = distinct !DILexicalBlock(scope: !249, file: !35, line: 93, column: 9)
!266 = !DILocation(line: 93, column: 9, scope: !249)
!267 = !DILocation(line: 94, column: 33, scope: !265)
!268 = !DILocation(line: 94, column: 9, scope: !265)
!269 = !DILocation(line: 95, column: 12, scope: !249)
!270 = !DILocation(line: 95, column: 5, scope: !249)
!271 = distinct !DISubprogram(name: "generate_v3", scope: !35, file: !35, line: 98, type: !272, isLocal: true, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!272 = !DISubroutineType(types: !273)
!273 = !{!58, !39, !252, !38, !274}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!275 = !DILocalVariable(name: "str", arg: 1, scope: !271, file: !35, line: 98, type: !39)
!276 = !DILocation(line: 98, column: 43, scope: !271)
!277 = !DILocalVariable(name: "cnf", arg: 2, scope: !271, file: !35, line: 98, type: !252)
!278 = !DILocation(line: 98, column: 60, scope: !271)
!279 = !DILocalVariable(name: "depth", arg: 3, scope: !271, file: !35, line: 98, type: !38)
!280 = !DILocation(line: 98, column: 69, scope: !271)
!281 = !DILocalVariable(name: "perr", arg: 4, scope: !271, file: !35, line: 99, type: !274)
!282 = !DILocation(line: 99, column: 36, scope: !271)
!283 = !DILocalVariable(name: "ret", scope: !271, file: !35, line: 101, type: !58)
!284 = !DILocation(line: 101, column: 16, scope: !271)
!285 = !DILocalVariable(name: "asn1_tags", scope: !271, file: !35, line: 102, type: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "tag_exp_arg", file: !35, line: 63, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 55, size: 4096, align: 64, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !306}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "imp_tag", scope: !287, file: !35, line: 56, baseType: !38, size: 32, align: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "imp_class", scope: !287, file: !35, line: 57, baseType: !38, size: 32, align: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !287, file: !35, line: 58, baseType: !38, size: 32, align: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !287, file: !35, line: 59, baseType: !38, size: 32, align: 32, offset: 96)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !287, file: !35, line: 60, baseType: !39, size: 64, align: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "exp_list", scope: !287, file: !35, line: 61, baseType: !295, size: 3840, align: 64, offset: 192)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 3840, align: 64, elements: !304)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "tag_exp_type", file: !35, line: 53, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 47, size: 192, align: 64, elements: !298)
!298 = !{!299, !300, !301, !302, !303}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "exp_tag", scope: !297, file: !35, line: 48, baseType: !38, size: 32, align: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "exp_class", scope: !297, file: !35, line: 49, baseType: !38, size: 32, align: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "exp_constructed", scope: !297, file: !35, line: 50, baseType: !38, size: 32, align: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "exp_pad", scope: !297, file: !35, line: 51, baseType: !38, size: 32, align: 32, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "exp_len", scope: !297, file: !35, line: 52, baseType: !79, size: 64, align: 64, offset: 128)
!304 = !{!305}
!305 = !DISubrange(count: 20)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "exp_count", scope: !287, file: !35, line: 62, baseType: !38, size: 32, align: 32, offset: 4032)
!307 = !DILocation(line: 102, column: 17, scope: !271)
!308 = !DILocalVariable(name: "etmp", scope: !271, file: !35, line: 103, type: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!310 = !DILocation(line: 103, column: 19, scope: !271)
!311 = !DILocalVariable(name: "i", scope: !271, file: !35, line: 105, type: !38)
!312 = !DILocation(line: 105, column: 9, scope: !271)
!313 = !DILocalVariable(name: "len", scope: !271, file: !35, line: 105, type: !38)
!314 = !DILocation(line: 105, column: 12, scope: !271)
!315 = !DILocalVariable(name: "orig_der", scope: !271, file: !35, line: 107, type: !30)
!316 = !DILocation(line: 107, column: 20, scope: !271)
!317 = !DILocalVariable(name: "new_der", scope: !271, file: !35, line: 107, type: !30)
!318 = !DILocation(line: 107, column: 37, scope: !271)
!319 = !DILocalVariable(name: "cpy_start", scope: !271, file: !35, line: 108, type: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!322 = !DILocation(line: 108, column: 26, scope: !271)
!323 = !DILocalVariable(name: "p", scope: !271, file: !35, line: 109, type: !30)
!324 = !DILocation(line: 109, column: 20, scope: !271)
!325 = !DILocalVariable(name: "cp", scope: !271, file: !35, line: 110, type: !320)
!326 = !DILocation(line: 110, column: 26, scope: !271)
!327 = !DILocalVariable(name: "cpy_len", scope: !271, file: !35, line: 111, type: !38)
!328 = !DILocation(line: 111, column: 9, scope: !271)
!329 = !DILocalVariable(name: "hdr_len", scope: !271, file: !35, line: 112, type: !79)
!330 = !DILocation(line: 112, column: 10, scope: !271)
!331 = !DILocalVariable(name: "hdr_constructed", scope: !271, file: !35, line: 113, type: !38)
!332 = !DILocation(line: 113, column: 9, scope: !271)
!333 = !DILocalVariable(name: "hdr_tag", scope: !271, file: !35, line: 113, type: !38)
!334 = !DILocation(line: 113, column: 30, scope: !271)
!335 = !DILocalVariable(name: "hdr_class", scope: !271, file: !35, line: 113, type: !38)
!336 = !DILocation(line: 113, column: 39, scope: !271)
!337 = !DILocalVariable(name: "r", scope: !271, file: !35, line: 114, type: !38)
!338 = !DILocation(line: 114, column: 9, scope: !271)
!339 = !DILocation(line: 116, column: 15, scope: !271)
!340 = !DILocation(line: 116, column: 23, scope: !271)
!341 = !DILocation(line: 117, column: 15, scope: !271)
!342 = !DILocation(line: 117, column: 25, scope: !271)
!343 = !DILocation(line: 118, column: 15, scope: !271)
!344 = !DILocation(line: 118, column: 22, scope: !271)
!345 = !DILocation(line: 119, column: 15, scope: !271)
!346 = !DILocation(line: 119, column: 25, scope: !271)
!347 = !DILocation(line: 120, column: 25, scope: !348)
!348 = distinct !DILexicalBlock(scope: !271, file: !35, line: 120, column: 9)
!349 = !DILocation(line: 120, column: 47, scope: !348)
!350 = !DILocation(line: 120, column: 9, scope: !348)
!351 = !DILocation(line: 120, column: 59, scope: !348)
!352 = !DILocation(line: 120, column: 9, scope: !271)
!353 = !DILocation(line: 121, column: 10, scope: !354)
!354 = distinct !DILexicalBlock(scope: !348, file: !35, line: 120, column: 65)
!355 = !DILocation(line: 121, column: 15, scope: !354)
!356 = !DILocation(line: 122, column: 9, scope: !354)
!357 = !DILocation(line: 125, column: 20, scope: !358)
!358 = distinct !DILexicalBlock(scope: !271, file: !35, line: 125, column: 9)
!359 = !DILocation(line: 125, column: 26, scope: !358)
!360 = !DILocation(line: 126, column: 9, scope: !358)
!361 = !DILocation(line: 126, column: 23, scope: !362)
!362 = !DILexicalBlockFile(scope: !358, file: !35, discriminator: 1)
!363 = !DILocation(line: 126, column: 29, scope: !362)
!364 = !DILocation(line: 125, column: 9, scope: !365)
!365 = !DILexicalBlockFile(scope: !271, file: !35, discriminator: 1)
