; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--pkcs12--libcrypto-shlib-p12_npas.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--pkcs12--libcrypto-shlib-p12_npas.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type opaque
%struct.PKCS12_st = type { %struct.asn1_string_st*, %struct.PKCS12_MAC_DATA_st*, %struct.pkcs7_st* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.PKCS12_MAC_DATA_st = type { %struct.X509_sig_st*, %struct.asn1_string_st*, %struct.asn1_string_st* }
%struct.X509_sig_st = type opaque
%struct.pkcs7_st = type { i8*, i64, i32, i32, %struct.asn1_object_st*, %union.anon }
%struct.asn1_object_st = type opaque
%union.anon = type { i8* }
%struct.stack_st_PKCS7 = type opaque
%struct.stack_st_PKCS12_SAFEBAG = type opaque
%struct.pkcs7_encrypted_st = type { %struct.asn1_string_st*, %struct.pkcs7_enc_content_st* }
%struct.pkcs7_enc_content_st = type { %struct.asn1_object_st*, %struct.X509_algor_st*, %struct.asn1_string_st*, %struct.evp_cipher_st* }
%struct.X509_algor_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_type_st = type { i32, %union.anon.0 }
%union.anon.0 = type { i8* }
%struct.evp_cipher_st = type opaque
%struct.stack_st = type opaque
%struct.PBEPARAM_st = type { %struct.asn1_string_st*, %struct.asn1_string_st* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--pkcs12--libcrypto-shlib-p12_npas.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !8, !13, !185, !222, !223, !225}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7", file: !7, line: 146, flags: DIFlagFwdDecl)
!7 = !DIFile(filename: "include/openssl/pkcs7.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !11, line: 17, baseType: !12)
!11 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !11, line: 17, flags: DIFlagFwdDecl)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7", file: !7, line: 144, baseType: !15)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_st", file: !7, line: 109, size: 320, align: 64, elements: !16)
!16 = !{!17, !20, !22, !24, !25, !30}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "asn1", scope: !15, file: !7, line: 114, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !15, file: !7, line: 115, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !15, file: !7, line: 119, baseType: !23, size: 32, align: 32, offset: 128)
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !15, file: !7, line: 120, baseType: !23, size: 32, align: 32, offset: 160)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !15, file: !7, line: 121, baseType: !26, size: 64, align: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !28, line: 60, baseType: !29)
!28 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !28, line: 60, flags: DIFlagFwdDecl)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !15, file: !7, line: 143, baseType: !31, size: 64, align: 64, offset: 256)
!31 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !15, file: !7, line: 127, size: 64, align: 64, elements: !32)
!32 = !{!33, !36, !46, !69, !156, !168, !177, !184}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !31, file: !7, line: 128, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !31, file: !7, line: 130, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !28, line: 43, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !40, line: 146, size: 192, align: 64, elements: !41)
!40 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!41 = !{!42, !43, !44, !45}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !39, file: !40, line: 147, baseType: !23, size: 32, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !39, file: !40, line: 148, baseType: !23, size: 32, align: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !39, file: !40, line: 149, baseType: !18, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !39, file: !40, line: 155, baseType: !21, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !31, file: !7, line: 132, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGNED", file: !7, line: 68, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signed_st", file: !7, line: 61, size: 384, align: 64, elements: !50)
!50 = !{!51, !54, !57, !61, !64, !67}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !49, file: !7, line: 62, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !28, line: 40, baseType: !39)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !49, file: !7, line: 63, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ALGOR", file: !40, line: 119, flags: DIFlagFwdDecl)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !49, file: !7, line: 64, baseType: !58, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !60, line: 99, flags: DIFlagFwdDecl)
!60 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!61 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !49, file: !7, line: 65, baseType: !62, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_CRL", file: !60, line: 228, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !49, file: !7, line: 66, baseType: !65, size: 64, align: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_SIGNER_INFO", file: !7, line: 49, flags: DIFlagFwdDecl)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !49, file: !7, line: 67, baseType: !68, size: 64, align: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "enveloped", scope: !31, file: !7, line: 134, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENVELOPE", file: !7, line: 85, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enveloped_st", file: !7, line: 81, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !78}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !72, file: !7, line: 82, baseType: !52, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !72, file: !7, line: 83, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_RECIP_INFO", file: !7, line: 59, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !72, file: !7, line: 84, baseType: !79, size: 64, align: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENC_CONTENT", file: !7, line: 79, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enc_content_st", file: !7, line: 74, size: 256, align: 64, elements: !82)
!82 = !{!83, !84, !150, !151}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !81, file: !7, line: 75, baseType: !26, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !81, file: !7, line: 76, baseType: !85, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !28, line: 125, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !60, line: 59, size: 128, align: 64, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !87, file: !60, line: 60, baseType: !26, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !87, file: !60, line: 61, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !40, line: 473, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !40, line: 444, size: 128, align: 64, elements: !94)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !93, file: !40, line: 445, baseType: !23, size: 32, align: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !93, file: !40, line: 472, baseType: !97, size: 64, align: 64, offset: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !93, file: !40, line: 446, size: 64, align: 64, elements: !98)
!98 = !{!99, !100, !102, !105, !106, !107, !110, !113, !114, !117, !120, !123, !126, !129, !132, !135, !138, !141, !144, !145, !146}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !97, file: !40, line: 447, baseType: !34, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !97, file: !40, line: 448, baseType: !101, size: 32, align: 32)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !28, line: 56, baseType: !23)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !97, file: !40, line: 449, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !28, line: 55, baseType: !39)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !97, file: !40, line: 450, baseType: !26, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !97, file: !40, line: 451, baseType: !52, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !97, file: !40, line: 452, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !28, line: 41, baseType: !39)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !97, file: !40, line: 453, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !28, line: 42, baseType: !39)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !97, file: !40, line: 454, baseType: !37, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !97, file: !40, line: 455, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !28, line: 44, baseType: !39)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !97, file: !40, line: 456, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !28, line: 45, baseType: !39)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !97, file: !40, line: 457, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !28, line: 46, baseType: !39)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !97, file: !40, line: 458, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !28, line: 47, baseType: !39)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !97, file: !40, line: 459, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !28, line: 49, baseType: !39)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !97, file: !40, line: 460, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !28, line: 48, baseType: !39)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !97, file: !40, line: 461, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !28, line: 50, baseType: !39)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !97, file: !40, line: 462, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !28, line: 52, baseType: !39)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !97, file: !40, line: 463, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !28, line: 53, baseType: !39)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !97, file: !40, line: 464, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !28, line: 54, baseType: !39)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !97, file: !40, line: 469, baseType: !103, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !97, file: !40, line: 470, baseType: !103, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !97, file: !40, line: 471, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !40, line: 213, baseType: !149)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !40, line: 213, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !81, file: !7, line: 77, baseType: !37, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !81, file: !7, line: 78, baseType: !152, size: 64, align: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !28, line: 89, baseType: !155)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !28, line: 89, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "signed_and_enveloped", scope: !31, file: !7, line: 136, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGN_ENVELOPE", file: !7, line: 95, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signedandenveloped_st", file: !7, line: 87, size: 448, align: 64, elements: !160)
!160 = !{!161, !162, !163, !164, !165, !166, !167}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !159, file: !7, line: 88, baseType: !52, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !159, file: !7, line: 89, baseType: !55, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !159, file: !7, line: 90, baseType: !58, size: 64, align: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !159, file: !7, line: 91, baseType: !62, size: 64, align: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !159, file: !7, line: 92, baseType: !65, size: 64, align: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !159, file: !7, line: 93, baseType: !79, size: 64, align: 64, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !159, file: !7, line: 94, baseType: !76, size: 64, align: 64, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !31, file: !7, line: 138, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_DIGEST", file: !7, line: 102, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_digest_st", file: !7, line: 97, size: 256, align: 64, elements: !172)
!172 = !{!173, !174, !175, !176}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !171, file: !7, line: 98, baseType: !52, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !171, file: !7, line: 99, baseType: !85, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !171, file: !7, line: 100, baseType: !68, size: 64, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !171, file: !7, line: 101, baseType: !37, size: 64, align: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "encrypted", scope: !31, file: !7, line: 140, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENCRYPT", file: !7, line: 107, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_encrypted_st", file: !7, line: 104, size: 128, align: 64, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !180, file: !7, line: 105, baseType: !52, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !180, file: !7, line: 106, baseType: !79, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !31, file: !7, line: 142, baseType: !91, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS12_SAFEBAG", file: !187, line: 47, baseType: !188)
!187 = !DIFile(filename: "include/openssl/pkcs12.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PKCS12_SAFEBAG_st", file: !189, line: 22, size: 192, align: 64, elements: !190)
!189 = !DIFile(filename: "crypto/pkcs12/p12_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!190 = !{!191, !192, !219}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !188, file: !189, line: 23, baseType: !26, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !188, file: !189, line: 30, baseType: !193, size: 64, align: 64, offset: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !188, file: !189, line: 24, size: 64, align: 64, elements: !194)
!194 = !{!195, !208, !211, !215, !218}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "bag", scope: !193, file: !189, line: 25, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs12_bag_st", file: !189, line: 34, size: 128, align: 64, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !197, file: !189, line: 35, baseType: !26, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !197, file: !189, line: 42, baseType: !201, size: 64, align: 64, offset: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !197, file: !189, line: 36, size: 64, align: 64, elements: !202)
!202 = !{!203, !204, !205, !206, !207}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "x509cert", scope: !201, file: !189, line: 37, baseType: !37, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "x509crl", scope: !201, file: !189, line: 38, baseType: !37, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "octet", scope: !201, file: !189, line: 39, baseType: !37, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sdsicert", scope: !201, file: !189, line: 40, baseType: !121, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !201, file: !189, line: 41, baseType: !91, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "keybag", scope: !193, file: !189, line: 26, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs8_priv_key_info_st", file: !28, line: 141, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "shkeybag", scope: !193, file: !189, line: 27, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_SIG", file: !60, line: 71, baseType: !214)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_sig_st", file: !60, line: 71, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "safes", scope: !193, file: !189, line: 28, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS12_SAFEBAG", file: !187, line: 49, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !193, file: !189, line: 29, baseType: !91, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "attrib", scope: !188, file: !189, line: 31, baseType: !220, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ATTRIBUTE", file: !60, line: 89, flags: DIFlagFwdDecl)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !11, line: 20, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !4}
!229 = !{i32 2, !"Dwarf Version", i32 4}
!230 = !{i32 2, !"Debug Info Version", i32 3}
!231 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!232 = distinct !DISubprogram(name: "PKCS12_newpass", scope: !233, file: !233, line: 32, type: !234, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!233 = !DIFile(filename: "crypto/pkcs12/p12_npas.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!234 = !DISubroutineType(types: !235)
!235 = !{!23, !236, !250, !250}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS12", file: !187, line: 45, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PKCS12_st", file: !189, line: 16, size: 192, align: 64, elements: !239)
!239 = !{!240, !241, !249}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !238, file: !189, line: 17, baseType: !52, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !238, file: !189, line: 18, baseType: !242, size: 64, align: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS12_MAC_DATA", file: !187, line: 43, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PKCS12_MAC_DATA_st", file: !189, line: 10, size: 192, align: 64, elements: !245)
!245 = !{!246, !247, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "dinfo", scope: !244, file: !189, line: 11, baseType: !212, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "salt", scope: !244, file: !189, line: 12, baseType: !37, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !244, file: !189, line: 13, baseType: !52, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "authsafes", scope: !238, file: !189, line: 19, baseType: !13, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!252 = !DILocalVariable(name: "p12", arg: 1, scope: !232, file: !233, line: 32, type: !236)
!253 = !DIExpression()
!254 = !DILocation(line: 32, column: 28, scope: !232)
!255 = !DILocalVariable(name: "oldpass", arg: 2, scope: !232, file: !233, line: 32, type: !250)
!256 = !DILocation(line: 32, column: 45, scope: !232)
!257 = !DILocalVariable(name: "newpass", arg: 3, scope: !232, file: !233, line: 32, type: !250)
!258 = !DILocation(line: 32, column: 66, scope: !232)
!259 = !DILocation(line: 36, column: 10, scope: !260)
!260 = distinct !DILexicalBlock(scope: !232, file: !233, line: 36, column: 9)
!261 = !DILocation(line: 36, column: 9, scope: !232)
!262 = !DILocation(line: 37, column: 9, scope: !263)
!263 = distinct !DILexicalBlock(scope: !260, file: !233, line: 36, column: 15)
!264 = !DILocation(line: 39, column: 9, scope: !263)
!265 = !DILocation(line: 44, column: 28, scope: !266)
!266 = distinct !DILexicalBlock(scope: !232, file: !233, line: 44, column: 9)
!267 = !DILocation(line: 44, column: 33, scope: !266)
!268 = !DILocation(line: 44, column: 10, scope: !266)
!269 = !DILocation(line: 44, column: 9, scope: !232)
!270 = !DILocation(line: 45, column: 9, scope: !271)
!271 = distinct !DILexicalBlock(scope: !266, file: !233, line: 44, column: 47)
!272 = !DILocation(line: 46, column: 9, scope: !271)
!273 = !DILocation(line: 49, column: 22, scope: !274)
!274 = distinct !DILexicalBlock(scope: !232, file: !233, line: 49, column: 9)
!275 = !DILocation(line: 49, column: 27, scope: !274)
!276 = !DILocation(line: 49, column: 36, scope: !274)
!277 = !DILocation(line: 49, column: 10, scope: !274)
!278 = !DILocation(line: 49, column: 9, scope: !232)
!279 = !DILocation(line: 50, column: 9, scope: !280)
!280 = distinct !DILexicalBlock(scope: !274, file: !233, line: 49, column: 46)
!281 = !DILocation(line: 51, column: 9, scope: !280)
!282 = !DILocation(line: 54, column: 5, scope: !232)
!283 = !DILocation(line: 55, column: 1, scope: !232)
!284 = distinct !DISubprogram(name: "newpass_p12", scope: !233, file: !233, line: 59, type: !234, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!285 = !DILocalVariable(name: "p12", arg: 1, scope: !284, file: !233, line: 59, type: !236)
!286 = !DILocation(line: 59, column: 32, scope: !284)
!287 = !DILocalVariable(name: "oldpass", arg: 2, scope: !284, file: !233, line: 59, type: !250)
!288 = !DILocation(line: 59, column: 49, scope: !284)
!289 = !DILocalVariable(name: "newpass", arg: 3, scope: !284, file: !233, line: 59, type: !250)
!290 = !DILocation(line: 59, column: 70, scope: !284)
!291 = !DILocalVariable(name: "asafes", scope: !284, file: !233, line: 61, type: !5)
!292 = !DILocation(line: 61, column: 28, scope: !284)
!293 = !DILocalVariable(name: "newsafes", scope: !284, file: !233, line: 61, type: !5)
!294 = !DILocation(line: 61, column: 37, scope: !284)
!295 = !DILocalVariable(name: "bags", scope: !284, file: !233, line: 62, type: !216)
!296 = !DILocation(line: 62, column: 37, scope: !284)
!297 = !DILocalVariable(name: "i", scope: !284, file: !233, line: 63, type: !23)
!298 = !DILocation(line: 63, column: 9, scope: !284)
!299 = !DILocalVariable(name: "bagnid", scope: !284, file: !233, line: 63, type: !23)
!300 = !DILocation(line: 63, column: 12, scope: !284)
!301 = !DILocalVariable(name: "pbe_nid", scope: !284, file: !233, line: 63, type: !23)
!302 = !DILocation(line: 63, column: 20, scope: !284)
!303 = !DILocalVariable(name: "pbe_iter", scope: !284, file: !233, line: 63, type: !23)
!304 = !DILocation(line: 63, column: 33, scope: !284)
!305 = !DILocalVariable(name: "pbe_saltlen", scope: !284, file: !233, line: 63, type: !23)
!306 = !DILocation(line: 63, column: 47, scope: !284)
!307 = !DILocalVariable(name: "p7", scope: !284, file: !233, line: 64, type: !13)
!308 = !DILocation(line: 64, column: 12, scope: !284)
!309 = !DILocalVariable(name: "p7new", scope: !284, file: !233, line: 64, type: !13)
!310 = !DILocation(line: 64, column: 17, scope: !284)
!311 = !DILocalVariable(name: "p12_data_tmp", scope: !284, file: !233, line: 65, type: !37)
!312 = !DILocation(line: 65, column: 24, scope: !284)
!313 = !DILocalVariable(name: "macoct", scope: !284, file: !233, line: 65, type: !37)
!314 = !DILocation(line: 65, column: 45, scope: !284)
!315 = !DILocalVariable(name: "mac", scope: !284, file: !233, line: 66, type: !316)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 512, align: 8, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 64)
!319 = !DILocation(line: 66, column: 19, scope: !284)
!320 = !DILocalVariable(name: "maclen", scope: !284, file: !233, line: 67, type: !321)
!321 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!322 = !DILocation(line: 67, column: 18, scope: !284)
!323 = !DILocalVariable(name: "rv", scope: !284, file: !233, line: 68, type: !23)
!324 = !DILocation(line: 68, column: 9, scope: !284)
!325 = !DILocation(line: 70, column: 43, scope: !326)
!326 = distinct !DILexicalBlock(scope: !284, file: !233, line: 70, column: 9)
!327 = !DILocation(line: 70, column: 19, scope: !326)
!328 = !DILocation(line: 70, column: 17, scope: !326)
!329 = !DILocation(line: 70, column: 49, scope: !326)
!330 = !DILocation(line: 70, column: 9, scope: !284)
!331 = !DILocation(line: 71, column: 9, scope: !326)
!332 = !DILocation(line: 72, column: 21, scope: !333)
!333 = distinct !DILexicalBlock(scope: !284, file: !233, line: 72, column: 9)
!334 = !DILocation(line: 72, column: 19, scope: !333)
!335 = !DILocation(line: 72, column: 42, scope: !333)
!336 = !DILocation(line: 72, column: 9, scope: !284)
!337 = !DILocation(line: 73, column: 9, scope: !333)
!338 = !DILocation(line: 74, column: 12, scope: !339)
!339 = distinct !DILexicalBlock(scope: !284, file: !233, line: 74, column: 5)
!340 = !DILocation(line: 74, column: 10, scope: !339)
!341 = !DILocation(line: 74, column: 17, scope: !342)
!342 = !DILexicalBlockFile(scope: !343, file: !233, discriminator: 1)
!343 = distinct !DILexicalBlock(scope: !339, file: !233, line: 74, column: 5)
!344 = !DILocation(line: 74, column: 34, scope: !342)
!345 = !DILocation(line: 74, column: 21, scope: !342)
!346 = !DILocation(line: 74, column: 19, scope: !342)
!347 = !DILocation(line: 74, column: 5, scope: !342)
!348 = !DILocation(line: 75, column: 29, scope: !349)
!349 = distinct !DILexicalBlock(scope: !343, file: !233, line: 74, column: 48)
!350 = !DILocation(line: 75, column: 37, scope: !349)
!351 = !DILocation(line: 75, column: 14, scope: !349)
!352 = !DILocation(line: 75, column: 12, scope: !349)
!353 = !DILocation(line: 76, column: 30, scope: !349)
!354 = !DILocation(line: 76, column: 34, scope: !349)
!355 = !DILocation(line: 76, column: 18, scope: !349)
!356 = !DILocation(line: 76, column: 16, scope: !349)
!357 = !DILocation(line: 77, column: 13, scope: !358)
!358 = distinct !DILexicalBlock(scope: !349, file: !233, line: 77, column: 13)
!359 = !DILocation(line: 77, column: 20, scope: !358)
!360 = !DILocation(line: 77, column: 13, scope: !349)
!361 = !DILocation(line: 78, column: 41, scope: !362)
!362 = distinct !DILexicalBlock(scope: !358, file: !233, line: 77, column: 27)
!363 = !DILocation(line: 78, column: 20, scope: !362)
!364 = !DILocation(line: 78, column: 18, scope: !362)
!365 = !DILocation(line: 79, column: 9, scope: !362)
!366 = !DILocation(line: 79, column: 20, scope: !367)
!367 = !DILexicalBlockFile(scope: !368, file: !233, discriminator: 1)
!368 = distinct !DILexicalBlock(scope: !358, file: !233, line: 79, column: 20)
!369 = !DILocation(line: 79, column: 27, scope: !367)
!370 = !DILocation(line: 80, column: 44, scope: !371)
!371 = distinct !DILexicalBlock(scope: !368, file: !233, line: 79, column: 34)
!372 = !DILocation(line: 80, column: 48, scope: !371)
!373 = !DILocation(line: 80, column: 20, scope: !371)
!374 = !DILocation(line: 80, column: 18, scope: !371)
!375 = !DILocation(line: 81, column: 26, scope: !376)
!376 = distinct !DILexicalBlock(scope: !371, file: !233, line: 81, column: 17)
!377 = !DILocation(line: 81, column: 30, scope: !376)
!378 = !DILocation(line: 81, column: 32, scope: !376)
!379 = !DILocation(line: 81, column: 43, scope: !376)
!380 = !DILocation(line: 81, column: 53, scope: !376)
!381 = !DILocation(line: 81, column: 18, scope: !376)
!382 = !DILocation(line: 81, column: 17, scope: !371)
!383 = !DILocation(line: 83, column: 17, scope: !376)
!384 = !DILocation(line: 84, column: 9, scope: !371)
!385 = !DILocation(line: 85, column: 13, scope: !386)
!386 = distinct !DILexicalBlock(scope: !368, file: !233, line: 84, column: 16)
!387 = !DILocation(line: 87, column: 13, scope: !388)
!388 = distinct !DILexicalBlock(scope: !349, file: !233, line: 87, column: 13)
!389 = !DILocation(line: 87, column: 18, scope: !388)
!390 = !DILocation(line: 87, column: 13, scope: !349)
!391 = !DILocation(line: 88, column: 13, scope: !388)
!392 = !DILocation(line: 89, column: 27, scope: !393)
!393 = distinct !DILexicalBlock(scope: !349, file: !233, line: 89, column: 13)
!394 = !DILocation(line: 89, column: 33, scope: !393)
!395 = !DILocation(line: 89, column: 42, scope: !393)
!396 = !DILocation(line: 89, column: 14, scope: !393)
!397 = !DILocation(line: 89, column: 13, scope: !349)
!398 = !DILocation(line: 90, column: 13, scope: !393)
!399 = !DILocation(line: 92, column: 13, scope: !400)
!400 = distinct !DILexicalBlock(scope: !349, file: !233, line: 92, column: 13)
!401 = !DILocation(line: 92, column: 20, scope: !400)
!402 = !DILocation(line: 92, column: 13, scope: !349)
!403 = !DILocation(line: 93, column: 40, scope: !400)
!404 = !DILocation(line: 93, column: 21, scope: !400)
!405 = !DILocation(line: 93, column: 19, scope: !400)
!406 = !DILocation(line: 93, column: 13, scope: !400)
!407 = !DILocation(line: 95, column: 43, scope: !400)
!408 = !DILocation(line: 95, column: 52, scope: !400)
!409 = !DILocation(line: 96, column: 43, scope: !400)
!410 = !DILocation(line: 96, column: 56, scope: !400)
!411 = !DILocation(line: 96, column: 66, scope: !400)
!412 = !DILocation(line: 95, column: 21, scope: !400)
!413 = !DILocation(line: 95, column: 19, scope: !400)
!414 = !DILocation(line: 97, column: 14, scope: !415)
!415 = distinct !DILexicalBlock(scope: !349, file: !233, line: 97, column: 13)
!416 = !DILocation(line: 97, column: 20, scope: !415)
!417 = !DILocation(line: 97, column: 38, scope: !418)
!418 = !DILexicalBlockFile(scope: !415, file: !233, discriminator: 1)
!419 = !DILocation(line: 97, column: 48, scope: !418)
!420 = !DILocation(line: 97, column: 24, scope: !418)
!421 = !DILocation(line: 97, column: 13, scope: !418)
!422 = !DILocation(line: 98, column: 13, scope: !415)
!423 = !DILocation(line: 99, column: 36, scope: !349)
!424 = !DILocation(line: 99, column: 9, scope: !349)
!425 = !DILocation(line: 100, column: 14, scope: !349)
!426 = !DILocation(line: 101, column: 5, scope: !349)
!427 = !DILocation(line: 74, column: 44, scope: !428)
!428 = !DILexicalBlockFile(scope: !343, file: !233, discriminator: 2)
!429 = !DILocation(line: 74, column: 5, scope: !428)
!430 = distinct !{!430, !431}
!431 = !DILocation(line: 74, column: 5, scope: !284)
!432 = !DILocation(line: 105, column: 20, scope: !284)
!433 = !DILocation(line: 105, column: 25, scope: !284)
!434 = !DILocation(line: 105, column: 36, scope: !284)
!435 = !DILocation(line: 105, column: 38, scope: !284)
!436 = !DILocation(line: 105, column: 18, scope: !284)
!437 = !DILocation(line: 106, column: 35, scope: !438)
!438 = distinct !DILexicalBlock(scope: !284, file: !233, line: 106, column: 9)
!439 = !DILocation(line: 106, column: 10, scope: !438)
!440 = !DILocation(line: 106, column: 15, scope: !438)
!441 = !DILocation(line: 106, column: 26, scope: !438)
!442 = !DILocation(line: 106, column: 28, scope: !438)
!443 = !DILocation(line: 106, column: 33, scope: !438)
!444 = !DILocation(line: 106, column: 60, scope: !438)
!445 = !DILocation(line: 106, column: 9, scope: !284)
!446 = !DILocation(line: 107, column: 9, scope: !438)
!447 = !DILocation(line: 108, column: 32, scope: !448)
!448 = distinct !DILexicalBlock(scope: !284, file: !233, line: 108, column: 9)
!449 = !DILocation(line: 108, column: 37, scope: !448)
!450 = !DILocation(line: 108, column: 10, scope: !448)
!451 = !DILocation(line: 108, column: 9, scope: !284)
!452 = !DILocation(line: 109, column: 9, scope: !448)
!453 = !DILocation(line: 111, column: 25, scope: !454)
!454 = distinct !DILexicalBlock(scope: !284, file: !233, line: 111, column: 9)
!455 = !DILocation(line: 111, column: 30, scope: !454)
!456 = !DILocation(line: 111, column: 43, scope: !454)
!457 = !DILocation(line: 111, column: 10, scope: !454)
!458 = !DILocation(line: 111, column: 9, scope: !284)
!459 = !DILocation(line: 112, column: 9, scope: !454)
!460 = !DILocation(line: 113, column: 19, scope: !284)
!461 = !DILocation(line: 113, column: 24, scope: !284)
!462 = !DILocation(line: 113, column: 29, scope: !284)
!463 = !DILocation(line: 113, column: 5, scope: !284)
!464 = !DILocation(line: 114, column: 32, scope: !465)
!465 = distinct !DILexicalBlock(scope: !284, file: !233, line: 114, column: 9)
!466 = !DILocation(line: 114, column: 40, scope: !465)
!467 = !DILocation(line: 114, column: 45, scope: !465)
!468 = !DILocation(line: 114, column: 10, scope: !465)
!469 = !DILocation(line: 114, column: 9, scope: !284)
!470 = !DILocation(line: 115, column: 9, scope: !465)
!471 = !DILocation(line: 117, column: 8, scope: !284)
!472 = !DILocation(line: 117, column: 5, scope: !284)
!473 = !DILocation(line: 121, column: 9, scope: !474)
!474 = distinct !DILexicalBlock(scope: !284, file: !233, line: 121, column: 9)
!475 = !DILocation(line: 121, column: 12, scope: !474)
!476 = !DILocation(line: 121, column: 9, scope: !284)
!477 = !DILocation(line: 122, column: 32, scope: !478)
!478 = distinct !DILexicalBlock(scope: !474, file: !233, line: 121, column: 18)
!479 = !DILocation(line: 122, column: 9, scope: !478)
!480 = !DILocation(line: 123, column: 5, scope: !478)
!481 = !DILocation(line: 123, column: 16, scope: !482)
!482 = !DILexicalBlockFile(scope: !483, file: !233, discriminator: 1)
!483 = distinct !DILexicalBlock(scope: !474, file: !233, line: 123, column: 16)
!484 = !DILocation(line: 123, column: 29, scope: !482)
!485 = !DILocation(line: 124, column: 32, scope: !486)
!486 = distinct !DILexicalBlock(scope: !483, file: !233, line: 123, column: 37)
!487 = !DILocation(line: 124, column: 37, scope: !486)
!488 = !DILocation(line: 124, column: 48, scope: !486)
!489 = !DILocation(line: 124, column: 50, scope: !486)
!490 = !DILocation(line: 124, column: 9, scope: !486)
!491 = !DILocation(line: 125, column: 34, scope: !486)
!492 = !DILocation(line: 125, column: 9, scope: !486)
!493 = !DILocation(line: 125, column: 14, scope: !486)
!494 = !DILocation(line: 125, column: 25, scope: !486)
!495 = !DILocation(line: 125, column: 27, scope: !486)
!496 = !DILocation(line: 125, column: 32, scope: !486)
!497 = !DILocation(line: 126, column: 5, scope: !486)
!498 = !DILocation(line: 127, column: 32, scope: !284)
!499 = !DILocation(line: 127, column: 5, scope: !284)
!500 = !DILocation(line: 128, column: 23, scope: !284)
!501 = !DILocation(line: 128, column: 5, scope: !284)
!502 = !DILocation(line: 129, column: 23, scope: !284)
!503 = !DILocation(line: 129, column: 5, scope: !284)
!504 = !DILocation(line: 130, column: 12, scope: !284)
!505 = !DILocation(line: 130, column: 5, scope: !284)
!506 = distinct !DISubprogram(name: "sk_PKCS7_new_null", scope: !7, file: !7, line: 146, type: !507, isLocal: true, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!507 = !DISubroutineType(types: !508)
!508 = !{!5}
!509 = !DILocation(line: 146, column: 820, scope: !506)
!510 = !DILocation(line: 146, column: 795, scope: !506)
!511 = !DILocation(line: 146, column: 788, scope: !506)
!512 = distinct !DISubprogram(name: "sk_PKCS7_num", scope: !7, file: !7, line: 146, type: !513, isLocal: true, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!513 = !DISubroutineType(types: !514)
!514 = !{!23, !515}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!517 = !DILocalVariable(name: "sk", arg: 1, scope: !512, file: !7, line: 146, type: !515)
!518 = !DILocation(line: 146, column: 288, scope: !512)
!519 = !DILocation(line: 146, column: 339, scope: !512)
!520 = !DILocation(line: 146, column: 316, scope: !512)
!521 = !DILocation(line: 146, column: 301, scope: !512)
!522 = !DILocation(line: 146, column: 294, scope: !512)
!523 = distinct !DISubprogram(name: "sk_PKCS7_value", scope: !7, file: !7, line: 146, type: !524, isLocal: true, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!524 = !DISubroutineType(types: !525)
!525 = !{!13, !515, !23}
!526 = !DILocalVariable(name: "sk", arg: 1, scope: !523, file: !7, line: 146, type: !515)
!527 = !DILocation(line: 146, column: 435, scope: !523)
!528 = !DILocalVariable(name: "idx", arg: 2, scope: !523, file: !7, line: 146, type: !23)
!529 = !DILocation(line: 146, column: 443, scope: !523)
!530 = !DILocation(line: 146, column: 506, scope: !523)
!531 = !DILocation(line: 146, column: 483, scope: !523)
!532 = !DILocation(line: 146, column: 510, scope: !523)
!533 = !DILocation(line: 146, column: 466, scope: !523)
!534 = !DILocation(line: 146, column: 457, scope: !523)
!535 = !DILocation(line: 146, column: 450, scope: !523)
!536 = distinct !DISubprogram(name: "alg_get", scope: !233, file: !233, line: 172, type: !537, isLocal: true, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!537 = !DISubroutineType(types: !538)
!538 = !{!23, !539, !541, !541, !541}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!542 = !DILocalVariable(name: "alg", arg: 1, scope: !536, file: !233, line: 172, type: !539)
!543 = !DILocation(line: 172, column: 38, scope: !536)
!544 = !DILocalVariable(name: "pnid", arg: 2, scope: !536, file: !233, line: 172, type: !541)
!545 = !DILocation(line: 172, column: 48, scope: !536)
!546 = !DILocalVariable(name: "piter", arg: 3, scope: !536, file: !233, line: 172, type: !541)
!547 = !DILocation(line: 172, column: 59, scope: !536)
!548 = !DILocalVariable(name: "psaltlen", arg: 4, scope: !536, file: !233, line: 173, type: !541)
!549 = !DILocation(line: 173, column: 25, scope: !536)
!550 = !DILocalVariable(name: "pbe", scope: !536, file: !233, line: 175, type: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "PBEPARAM", file: !60, line: 289, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PBEPARAM_st", file: !60, line: 286, size: 128, align: 64, elements: !554)
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "salt", scope: !553, file: !60, line: 287, baseType: !37, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !553, file: !60, line: 288, baseType: !52, size: 64, align: 64, offset: 64)
!557 = !DILocation(line: 175, column: 15, scope: !536)
!558 = !DILocation(line: 176, column: 55, scope: !536)
!559 = !DILocation(line: 176, column: 60, scope: !536)
!560 = !DILocation(line: 176, column: 11, scope: !536)
!561 = !DILocation(line: 176, column: 9, scope: !536)
!562 = !DILocation(line: 177, column: 10, scope: !563)
!563 = distinct !DILexicalBlock(scope: !536, file: !233, line: 177, column: 9)
!564 = !DILocation(line: 177, column: 9, scope: !536)
!565 = !DILocation(line: 178, column: 9, scope: !563)
!566 = !DILocation(line: 179, column: 25, scope: !536)
!567 = !DILocation(line: 179, column: 30, scope: !536)
!568 = !DILocation(line: 179, column: 13, scope: !536)
!569 = !DILocation(line: 179, column: 6, scope: !536)
!570 = !DILocation(line: 179, column: 11, scope: !536)
!571 = !DILocation(line: 180, column: 31, scope: !536)
!572 = !DILocation(line: 180, column: 36, scope: !536)
!573 = !DILocation(line: 180, column: 14, scope: !536)
!574 = !DILocation(line: 180, column: 6, scope: !536)
!575 = !DILocation(line: 180, column: 12, scope: !536)
!576 = !DILocation(line: 181, column: 17, scope: !536)
!577 = !DILocation(line: 181, column: 22, scope: !536)
!578 = !DILocation(line: 181, column: 28, scope: !536)
!579 = !DILocation(line: 181, column: 6, scope: !536)
!580 = !DILocation(line: 181, column: 15, scope: !536)
!581 = !DILocation(line: 182, column: 19, scope: !536)
!582 = !DILocation(line: 182, column: 5, scope: !536)
!583 = !DILocation(line: 183, column: 5, scope: !536)
!584 = !DILocation(line: 184, column: 1, scope: !536)
!585 = distinct !DISubprogram(name: "newpass_bags", scope: !233, file: !233, line: 133, type: !586, isLocal: true, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!586 = !DISubroutineType(types: !587)
!587 = !{!23, !216, !250, !250}
!588 = !DILocalVariable(name: "bags", arg: 1, scope: !585, file: !233, line: 133, type: !216)
!589 = !DILocation(line: 133, column: 57, scope: !585)
!590 = !DILocalVariable(name: "oldpass", arg: 2, scope: !585, file: !233, line: 133, type: !250)
!591 = !DILocation(line: 133, column: 75, scope: !585)
!592 = !DILocalVariable(name: "newpass", arg: 3, scope: !585, file: !233, line: 134, type: !250)
!593 = !DILocation(line: 134, column: 37, scope: !585)
!594 = !DILocalVariable(name: "i", scope: !585, file: !233, line: 136, type: !23)
!595 = !DILocation(line: 136, column: 9, scope: !585)
!596 = !DILocation(line: 137, column: 12, scope: !597)
!597 = distinct !DILexicalBlock(scope: !585, file: !233, line: 137, column: 5)
!598 = !DILocation(line: 137, column: 10, scope: !597)
!599 = !DILocation(line: 137, column: 17, scope: !600)
!600 = !DILexicalBlockFile(scope: !601, file: !233, discriminator: 1)
!601 = distinct !DILexicalBlock(scope: !597, file: !233, line: 137, column: 5)
!602 = !DILocation(line: 137, column: 43, scope: !600)
!603 = !DILocation(line: 137, column: 21, scope: !600)
!604 = !DILocation(line: 137, column: 19, scope: !600)
!605 = !DILocation(line: 137, column: 5, scope: !600)
!606 = !DILocation(line: 138, column: 50, scope: !607)
!607 = distinct !DILexicalBlock(scope: !608, file: !233, line: 138, column: 13)
!608 = distinct !DILexicalBlock(scope: !601, file: !233, line: 137, column: 55)
!609 = !DILocation(line: 138, column: 56, scope: !607)
!610 = !DILocation(line: 138, column: 26, scope: !607)
!611 = !DILocation(line: 138, column: 60, scope: !607)
!612 = !DILocation(line: 138, column: 69, scope: !607)
!613 = !DILocation(line: 138, column: 14, scope: !614)
!614 = !DILexicalBlockFile(scope: !607, file: !233, discriminator: 1)
!615 = !DILocation(line: 138, column: 14, scope: !607)
!616 = !DILocation(line: 138, column: 13, scope: !608)
!617 = !DILocation(line: 139, column: 13, scope: !607)
!618 = !DILocation(line: 140, column: 5, scope: !608)
!619 = !DILocation(line: 137, column: 51, scope: !620)
