; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--sparse_array_test-bin-sparse_array_test.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--sparse_array_test-bin-sparse_array_test.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon = type { i64, i8* }
%struct.anon.0 = type { i64, i64, i8* }
%struct.index_cases_st = type { i64, i8*, i32 }
%struct.sparse_array_st_char = type opaque
%struct.doall_st = type { %struct.sparse_array_st_char*, i64, %struct.index_cases_st*, i32, i32 }
%struct.sparse_array_st = type opaque

@.str = private unnamed_addr constant [18 x i8] c"test_sparse_array\00", align 1
@.str.1 = private unnamed_addr constant [22 x i8] c"test_sparse_array_num\00", align 1
@.str.2 = private unnamed_addr constant [24 x i8] c"test_sparse_array_doall\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !36)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--sparse_array_test-bin-sparse_array_test.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !7, !9, !13, !14, !20}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "sparse_array_st_char", file: !6, line: 28, flags: DIFlagFwdDecl)
!6 = !DIFile(filename: "test/sparse_array_test.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_SA", file: !11, line: 66, baseType: !12)
!11 = !DIFile(filename: "crypto/include/internal/sparse_array.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "sparse_array_st", file: !11, line: 66, flags: DIFlagFwdDecl)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DISubroutineType(types: !16)
!16 = !{null, !17, !13, !13}
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !18, line: 216, baseType: !19)
!18 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!19 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "doall_st", file: !6, line: 104, size: 256, align: 64, elements: !22)
!22 = !{!23, !24, !25, !34, !35}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !21, file: !6, line: 105, baseType: !4, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "num_cases", scope: !21, file: !6, line: 106, baseType: !17, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "cases", scope: !21, file: !6, line: 107, baseType: !26, size: 64, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "index_cases_st", file: !6, line: 98, size: 192, align: 64, elements: !29)
!29 = !{!30, !31, !32}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !28, file: !6, line: 99, baseType: !17, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !28, file: !6, line: 100, baseType: !7, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "del", scope: !28, file: !6, line: 101, baseType: !33, size: 32, align: 32, offset: 128)
!33 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "res", scope: !21, file: !6, line: 108, baseType: !33, size: 32, align: 32, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "all", scope: !21, file: !6, line: 109, baseType: !33, size: 32, align: 32, offset: 224)
!36 = !{!37, !49, !60}
!37 = distinct !DIGlobalVariable(name: "cases", scope: !38, file: !6, line: 35, type: !41, isLocal: true, isDefinition: true, variable: [8 x %struct.anon]* @test_sparse_array.cases)
!38 = distinct !DISubprogram(name: "test_sparse_array", scope: !6, file: !6, line: 30, type: !39, isLocal: true, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!39 = !DISubroutineType(types: !40)
!40 = !{!33}
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 1024, align: 64, elements: !47)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !38, file: !6, line: 32, size: 128, align: 64, elements: !44)
!44 = !{!45, !46}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !43, file: !6, line: 33, baseType: !17, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !43, file: !6, line: 34, baseType: !7, size: 64, align: 64, offset: 64)
!47 = !{!48}
!48 = !DISubrange(count: 8)
!49 = distinct !DIGlobalVariable(name: "cases", scope: !50, file: !6, line: 74, type: !51, isLocal: true, isDefinition: true, variable: [16 x %struct.anon.0]* @test_sparse_array_num.cases)
!50 = distinct !DISubprogram(name: "test_sparse_array_num", scope: !6, file: !6, line: 68, type: !39, isLocal: true, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 3072, align: 64, elements: !58)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !6, line: 70, size: 192, align: 64, elements: !54)
!54 = !{!55, !56, !57}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !53, file: !6, line: 71, baseType: !17, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !53, file: !6, line: 72, baseType: !17, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !53, file: !6, line: 73, baseType: !7, size: 64, align: 64, offset: 128)
!58 = !{!59}
!59 = !DISubrange(count: 16)
!60 = distinct !DIGlobalVariable(name: "cases", scope: !61, file: !6, line: 146, type: !62, isLocal: true, isDefinition: true, variable: [8 x %struct.index_cases_st]* @test_sparse_array_doall.cases)
!61 = distinct !DISubprogram(name: "test_sparse_array_doall", scope: !6, file: !6, line: 144, type: !39, isLocal: true, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1536, align: 64, elements: !47)
!63 = !{i32 2, !"Dwarf Version", i32 4}
!64 = !{i32 2, !"Debug Info Version", i32 3}
!65 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!66 = distinct !DISubprogram(name: "setup_tests", scope: !6, file: !6, line: 192, type: !39, isLocal: false, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!67 = !DILocation(line: 194, column: 5, scope: !66)
!68 = !DILocation(line: 195, column: 5, scope: !66)
!69 = !DILocation(line: 196, column: 5, scope: !66)
!70 = !DILocation(line: 197, column: 5, scope: !66)
!71 = !DILocalVariable(name: "sa", scope: !38, file: !6, line: 40, type: !4)
!72 = !DIExpression()
!73 = !DILocation(line: 40, column: 34, scope: !38)
!74 = !DILocalVariable(name: "i", scope: !38, file: !6, line: 41, type: !17)
!75 = !DILocation(line: 41, column: 12, scope: !38)
!76 = !DILocalVariable(name: "j", scope: !38, file: !6, line: 41, type: !17)
!77 = !DILocation(line: 41, column: 15, scope: !38)
!78 = !DILocalVariable(name: "res", scope: !38, file: !6, line: 42, type: !33)
!79 = !DILocation(line: 42, column: 9, scope: !38)
!80 = !DILocation(line: 44, column: 83, scope: !81)
!81 = distinct !DILexicalBlock(scope: !38, file: !6, line: 44, column: 9)
!82 = !DILocation(line: 44, column: 81, scope: !81)
!83 = !DILocation(line: 44, column: 78, scope: !81)
!84 = !DILocation(line: 44, column: 10, scope: !85)
!85 = !DILexicalBlockFile(scope: !81, file: !6, discriminator: 2)
!86 = !DILocation(line: 44, column: 10, scope: !81)
!87 = !DILocation(line: 45, column: 13, scope: !81)
!88 = !DILocation(line: 45, column: 107, scope: !89)
!89 = !DILexicalBlockFile(scope: !81, file: !6, discriminator: 1)
!90 = !DILocation(line: 45, column: 90, scope: !89)
!91 = !DILocation(line: 45, column: 17, scope: !92)
!92 = !DILexicalBlockFile(scope: !89, file: !6, discriminator: 2)
!93 = !DILocation(line: 45, column: 17, scope: !89)
!94 = !DILocation(line: 46, column: 13, scope: !81)
!95 = !DILocation(line: 46, column: 107, scope: !89)
!96 = !DILocation(line: 46, column: 90, scope: !89)
!97 = !DILocation(line: 46, column: 17, scope: !92)
!98 = !DILocation(line: 46, column: 17, scope: !89)
!99 = !DILocation(line: 47, column: 13, scope: !81)
!100 = !DILocation(line: 47, column: 114, scope: !89)
!101 = !DILocation(line: 47, column: 97, scope: !89)
!102 = !DILocation(line: 47, column: 17, scope: !92)
!103 = !DILocation(line: 47, column: 17, scope: !89)
!104 = !DILocation(line: 44, column: 9, scope: !105)
!105 = !DILexicalBlockFile(scope: !38, file: !6, discriminator: 1)
!106 = !DILocation(line: 48, column: 9, scope: !81)
!107 = !DILocation(line: 50, column: 12, scope: !108)
!108 = distinct !DILexicalBlock(scope: !38, file: !6, line: 50, column: 5)
!109 = !DILocation(line: 50, column: 10, scope: !108)
!110 = !DILocation(line: 50, column: 17, scope: !111)
!111 = !DILexicalBlockFile(scope: !112, file: !6, discriminator: 1)
!112 = distinct !DILexicalBlock(scope: !108, file: !6, line: 50, column: 5)
!113 = !DILocation(line: 50, column: 19, scope: !111)
!114 = !DILocation(line: 50, column: 5, scope: !111)
!115 = !DILocation(line: 51, column: 122, scope: !116)
!116 = distinct !DILexicalBlock(scope: !117, file: !6, line: 51, column: 13)
!117 = distinct !DILexicalBlock(scope: !112, file: !6, line: 50, column: 62)
