; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--libcrypto-lib-mem_sec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--libcrypto-lib-mem_sec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sh_st = type { i8*, i64, i8*, i64, i8**, i64, i64, i8*, i8*, i64 }
%struct.sh_list_st = type { %struct.sh_list_st*, %struct.sh_list_st** }

@secure_mem_initialized = internal global i32 0, align 4
@sec_malloc_lock = internal global i8* null, align 8
@secure_mem_used = internal global i64 0, align 8
@sh = internal global %struct.sh_st zeroinitializer, align 8
@.str = private unnamed_addr constant [27 x i8] c"assertion failed: size > 0\00", align 1
@.str.1 = private unnamed_addr constant [17 x i8] c"crypto/mem_sec.c\00", align 1
@.str.2 = private unnamed_addr constant [43 x i8] c"assertion failed: (size & (size - 1)) == 0\00", align 1
@.str.3 = private unnamed_addr constant [30 x i8] c"assertion failed: minsize > 0\00", align 1
@.str.4 = private unnamed_addr constant [49 x i8] c"assertion failed: (minsize & (minsize - 1)) == 0\00", align 1
@.str.5 = private unnamed_addr constant [38 x i8] c"assertion failed: sh.freelist != NULL\00", align 1
@.str.6 = private unnamed_addr constant [38 x i8] c"assertion failed: sh.bittable != NULL\00", align 1
@.str.7 = private unnamed_addr constant [39 x i8] c"assertion failed: sh.bitmalloc != NULL\00", align 1

!145 = !DIEnumerator(name: "_SC_CPUTIME", value: 138)
!146 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139)
!147 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140)
!148 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!149 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!150 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!151 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!152 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!153 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!154 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!155 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!156 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!157 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!158 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!159 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!160 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!161 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!162 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!163 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!164 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!165 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!166 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!167 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!168 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!169 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!170 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!171 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!172 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!173 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!174 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!175 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!176 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!177 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!178 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!179 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!180 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!181 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!182 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!183 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!184 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!185 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!186 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!187 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!188 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!189 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!190 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!191 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!192 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!193 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!194 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!195 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!196 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!197 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!198 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!199 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!200 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!201 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!202 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!203 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!204 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!205 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!206 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!207 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!208 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!209 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!210 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!211 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!212 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!213 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!214 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!215 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!216 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!217 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!218 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!219 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!220 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!221 = !{!222, !223, !224, !227, !229, !238, !239}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!223 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !225, line: 216, baseType: !226)
!225 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!226 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "SH_LIST", file: !231, line: 272, baseType: !232)
!231 = !DIFile(filename: "crypto/mem_sec.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sh_list_st", file: !231, line: 268, size: 128, align: 64, elements: !233)
!233 = !{!234, !236}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !232, file: !231, line: 270, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "p_next", scope: !232, file: !231, line: 271, baseType: !237, size: 64, align: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!240 = !{!241, !242, !243, !247}
!241 = distinct !DIGlobalVariable(name: "secure_mem_used", scope: !0, file: !231, line: 51, type: !224, isLocal: true, isDefinition: true, variable: i64* @secure_mem_used)
!242 = distinct !DIGlobalVariable(name: "secure_mem_initialized", scope: !0, file: !231, line: 53, type: !223, isLocal: true, isDefinition: true, variable: i32* @secure_mem_initialized)
!243 = distinct !DIGlobalVariable(name: "sec_malloc_lock", scope: !0, file: !231, line: 55, type: !244, isLocal: true, isDefinition: true, variable: i8** @sec_malloc_lock)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_RWLOCK", file: !246, line: 67, baseType: null)
!246 = !DIFile(filename: "include/openssl/crypto.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!247 = distinct !DIGlobalVariable(name: "sh", scope: !0, file: !231, line: 288, type: !248, isLocal: true, isDefinition: true, variable: %struct.sh_st* @sh)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "SH", file: !231, line: 286, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sh_st", file: !231, line: 274, size: 640, align: 64, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !262, !263, !266, !267}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "map_result", scope: !249, file: !231, line: 276, baseType: !227, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "map_size", scope: !249, file: !231, line: 277, baseType: !224, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !249, file: !231, line: 278, baseType: !227, size: 64, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "arena_size", scope: !249, file: !231, line: 279, baseType: !224, size: 64, align: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "freelist", scope: !249, file: !231, line: 280, baseType: !239, size: 64, align: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "freelist_size", scope: !249, file: !231, line: 281, baseType: !257, size: 64, align: 64, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !258, line: 109, baseType: !259)
!258 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !260, line: 172, baseType: !261)
!260 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!261 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "minsize", scope: !249, file: !231, line: 282, baseType: !224, size: 64, align: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "bittable", scope: !249, file: !231, line: 283, baseType: !264, size: 64, align: 64, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "bitmalloc", scope: !249, file: !231, line: 284, baseType: !264, size: 64, align: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "bittable_size", scope: !249, file: !231, line: 285, baseType: !224, size: 64, align: 64, offset: 576)
!268 = !{i32 2, !"Dwarf Version", i32 4}
!269 = !{i32 2, !"Debug Info Version", i32 3}
!270 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!271 = distinct !DISubprogram(name: "CRYPTO_secure_malloc_init", scope: !231, file: !231, line: 68, type: !272, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !274)
!272 = !DISubroutineType(types: !273)
!273 = !{!223, !224, !223}
!274 = !{}
!275 = !DILocalVariable(name: "size", arg: 1, scope: !271, file: !231, line: 68, type: !224)
!276 = !DIExpression()
!277 = !DILocation(line: 68, column: 38, scope: !271)
!278 = !DILocalVariable(name: "minsize", arg: 2, scope: !271, file: !231, line: 68, type: !223)
!279 = !DILocation(line: 68, column: 48, scope: !271)
!280 = !DILocalVariable(name: "ret", scope: !271, file: !231, line: 71, type: !223)
!281 = !DILocation(line: 71, column: 9, scope: !271)
!282 = !DILocation(line: 73, column: 10, scope: !283)
!283 = distinct !DILexicalBlock(scope: !271, file: !231, line: 73, column: 9)
!284 = !DILocation(line: 73, column: 9, scope: !271)
!285 = !DILocation(line: 74, column: 27, scope: !286)
!286 = distinct !DILexicalBlock(scope: !283, file: !231, line: 73, column: 34)
!287 = !DILocation(line: 74, column: 25, scope: !286)
!288 = !DILocation(line: 75, column: 13, scope: !289)
!289 = distinct !DILexicalBlock(scope: !286, file: !231, line: 75, column: 13)
!290 = !DILocation(line: 75, column: 29, scope: !289)
!291 = !DILocation(line: 75, column: 13, scope: !286)
!292 = !DILocation(line: 76, column: 13, scope: !289)
!293 = !DILocation(line: 77, column: 28, scope: !294)
!294 = distinct !DILexicalBlock(scope: !286, file: !231, line: 77, column: 13)
!295 = !DILocation(line: 77, column: 34, scope: !294)
!296 = !DILocation(line: 77, column: 20, scope: !294)
!297 = !DILocation(line: 77, column: 18, scope: !294)
!298 = !DILocation(line: 77, column: 44, scope: !294)
!299 = !DILocation(line: 77, column: 13, scope: !286)
!300 = !DILocation(line: 78, column: 36, scope: !301)
!301 = distinct !DILexicalBlock(scope: !294, file: !231, line: 77, column: 50)
!302 = !DILocation(line: 79, column: 9, scope: !301)
!303 = !DILocation(line: 80, column: 37, scope: !304)
!304 = distinct !DILexicalBlock(scope: !294, file: !231, line: 79, column: 16)
!305 = !DILocation(line: 80, column: 13, scope: !304)
!306 = !DILocation(line: 81, column: 29, scope: !304)
!307 = !DILocation(line: 83, column: 5, scope: !286)
!308 = !DILocation(line: 85, column: 12, scope: !271)
!309 = !DILocation(line: 85, column: 5, scope: !271)
!310 = !DILocation(line: 89, column: 1, scope: !271)
!311 = distinct !DISubprogram(name: "sh_init", scope: !231, file: !231, line: 376, type: !272, isLocal: true, isDefinition: true, scopeLine: 377, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !274)
!312 = !DILocalVariable(name: "size", arg: 1, scope: !311, file: !231, line: 376, type: !224)
!313 = !DILocation(line: 376, column: 27, scope: !311)
!314 = !DILocalVariable(name: "minsize", arg: 2, scope: !311, file: !231, line: 376, type: !223)
!315 = !DILocation(line: 376, column: 37, scope: !311)
!316 = !DILocalVariable(name: "ret", scope: !311, file: !231, line: 378, type: !223)
!317 = !DILocation(line: 378, column: 9, scope: !311)
!318 = !DILocalVariable(name: "i", scope: !311, file: !231, line: 379, type: !224)
!319 = !DILocation(line: 379, column: 12, scope: !311)
!320 = !DILocalVariable(name: "pgsize", scope: !311, file: !231, line: 380, type: !224)
!321 = !DILocation(line: 380, column: 12, scope: !311)
!322 = !DILocalVariable(name: "aligned", scope: !311, file: !231, line: 381, type: !224)
!323 = !DILocation(line: 381, column: 12, scope: !311)
!324 = !DILocation(line: 383, column: 5, scope: !311)
!325 = !DILocation(line: 386, column: 13, scope: !311)
!326 = !DILocation(line: 386, column: 18, scope: !311)
