; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]apps--openssl-bin-smime.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]apps--openssl-bin-smime.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.options_st = type { i8*, i32, i32, i8* }
%struct.bio_st = type opaque
%struct.evp_pkey_st = type opaque
%struct.pkcs7_st = type { i8*, i64, i32, i32, %struct.asn1_object_st*, %union.anon }
%struct.asn1_object_st = type opaque
%union.anon = type { i8* }
%struct.stack_st_OPENSSL_STRING = type opaque
%struct.stack_st_X509 = type opaque
%struct.x509_st = type opaque
%struct.x509_store_st = type opaque
%struct.X509_VERIFY_PARAM_st = type opaque
%struct.evp_cipher_st = type opaque
%struct.evp_md_st = type opaque
%struct.engine_st = type opaque
%struct.pkcs7_signer_info_st = type { %struct.asn1_string_st*, %struct.pkcs7_issuer_and_serial_st*, %struct.X509_algor_st*, %struct.stack_st_X509_ATTRIBUTE*, %struct.X509_algor_st*, %struct.asn1_string_st*, %struct.stack_st_X509_ATTRIBUTE*, %struct.evp_pkey_st* }
%struct.pkcs7_issuer_and_serial_st = type { %struct.X509_name_st*, %struct.asn1_string_st* }
%struct.X509_name_st = type opaque
%struct.X509_algor_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_type_st = type { i32, %union.anon.0 }
%union.anon.0 = type { i8* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }

!41 = !DIEnumerator(name: "OPT_CAFILE", value: 34)
!42 = !DIEnumerator(name: "OPT_R__FIRST", value: 1500)
!43 = !DIEnumerator(name: "OPT_R_RAND", value: 1501)
!44 = !DIEnumerator(name: "OPT_R_WRITERAND", value: 1502)
!45 = !DIEnumerator(name: "OPT_R__LAST", value: 1503)
!46 = !DIEnumerator(name: "OPT_V__FIRST", value: 2000)
!47 = !DIEnumerator(name: "OPT_V_POLICY", value: 2001)
!48 = !DIEnumerator(name: "OPT_V_PURPOSE", value: 2002)
!49 = !DIEnumerator(name: "OPT_V_VERIFY_NAME", value: 2003)
!50 = !DIEnumerator(name: "OPT_V_VERIFY_DEPTH", value: 2004)
!51 = !DIEnumerator(name: "OPT_V_ATTIME", value: 2005)
!52 = !DIEnumerator(name: "OPT_V_VERIFY_HOSTNAME", value: 2006)
!53 = !DIEnumerator(name: "OPT_V_VERIFY_EMAIL", value: 2007)
!54 = !DIEnumerator(name: "OPT_V_VERIFY_IP", value: 2008)
!55 = !DIEnumerator(name: "OPT_V_IGNORE_CRITICAL", value: 2009)
!56 = !DIEnumerator(name: "OPT_V_ISSUER_CHECKS", value: 2010)
!57 = !DIEnumerator(name: "OPT_V_CRL_CHECK", value: 2011)
!58 = !DIEnumerator(name: "OPT_V_CRL_CHECK_ALL", value: 2012)
!59 = !DIEnumerator(name: "OPT_V_POLICY_CHECK", value: 2013)
!60 = !DIEnumerator(name: "OPT_V_EXPLICIT_POLICY", value: 2014)
!61 = !DIEnumerator(name: "OPT_V_INHIBIT_ANY", value: 2015)
!62 = !DIEnumerator(name: "OPT_V_INHIBIT_MAP", value: 2016)
!63 = !DIEnumerator(name: "OPT_V_X509_STRICT", value: 2017)
!64 = !DIEnumerator(name: "OPT_V_EXTENDED_CRL", value: 2018)
!65 = !DIEnumerator(name: "OPT_V_USE_DELTAS", value: 2019)
!66 = !DIEnumerator(name: "OPT_V_POLICY_PRINT", value: 2020)
!67 = !DIEnumerator(name: "OPT_V_CHECK_SS_SIG", value: 2021)
!68 = !DIEnumerator(name: "OPT_V_TRUSTED_FIRST", value: 2022)
!69 = !DIEnumerator(name: "OPT_V_SUITEB_128_ONLY", value: 2023)
!70 = !DIEnumerator(name: "OPT_V_SUITEB_128", value: 2024)
!71 = !DIEnumerator(name: "OPT_V_SUITEB_192", value: 2025)
!72 = !DIEnumerator(name: "OPT_V_PARTIAL_CHAIN", value: 2026)
!73 = !DIEnumerator(name: "OPT_V_NO_ALT_CHAINS", value: 2027)
!74 = !DIEnumerator(name: "OPT_V_NO_CHECK_TIME", value: 2028)
!75 = !DIEnumerator(name: "OPT_V_VERIFY_AUTH_LEVEL", value: 2029)
!76 = !DIEnumerator(name: "OPT_V_ALLOW_PROXY_CERTS", value: 2030)
!77 = !DIEnumerator(name: "OPT_V__LAST", value: 2031)
!78 = !DIEnumerator(name: "OPT_CAPATH", value: 2032)
!79 = !DIEnumerator(name: "OPT_NOCAFILE", value: 2033)
!80 = !DIEnumerator(name: "OPT_NOCAPATH", value: 2034)
!81 = !DIEnumerator(name: "OPT_IN", value: 2035)
!82 = !DIEnumerator(name: "OPT_INFORM", value: 2036)
!83 = !DIEnumerator(name: "OPT_OUT", value: 2037)
!84 = !DIEnumerator(name: "OPT_OUTFORM", value: 2038)
!85 = !DIEnumerator(name: "OPT_CONTENT", value: 2039)
!86 = !{!87, !88, !91, !95, !97, !100, !102, !106, !108}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_OPENSSL_STRING", file: !90, line: 159, flags: DIFlagFwdDecl)
!90 = !DIFile(filename: "include/openssl/safestack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !93, line: 17, baseType: !94)
!93 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !93, line: 17, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !99, line: 99, flags: DIFlagFwdDecl)
!99 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !104, line: 124, baseType: !105)
!104 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !104, line: 124, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !93, line: 20, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !87}
!112 = !{!113}
!113 = distinct !DIGlobalVariable(name: "smime_options", scope: !0, file: !4, line: 50, type: !114, isLocal: false, isDefinition: true, variable: [78 x %struct.options_st]* @smime_options)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 14976, align: 64, elements: !127)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPTIONS", file: !117, line: 280, baseType: !118)
!117 = !DIFile(filename: "apps/include/opt.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "options_st", file: !117, line: 269, size: 192, align: 64, elements: !119)
!119 = !{!120, !123, !125, !126}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !118, file: !117, line: 270, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !118, file: !117, line: 271, baseType: !124, size: 32, align: 32, offset: 64)
!124 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "valtype", scope: !118, file: !117, line: 278, baseType: !124, size: 32, align: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "helpstr", scope: !118, file: !117, line: 279, baseType: !121, size: 64, align: 64, offset: 128)
!127 = !{!128}
!128 = !DISubrange(count: 78)
!129 = !{i32 2, !"Dwarf Version", i32 4}
!130 = !{i32 2, !"Debug Info Version", i32 3}
!131 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!132 = distinct !DISubprogram(name: "smime_main", scope: !4, file: !4, line: 112, type: !133, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !136)
!133 = !DISubroutineType(types: !134)
!134 = !{!124, !124, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!136 = !{}
!137 = !DILocalVariable(name: "argc", arg: 1, scope: !132, file: !4, line: 112, type: !124)
!138 = !DIExpression()
!139 = !DILocation(line: 112, column: 20, scope: !132)
!140 = !DILocalVariable(name: "argv", arg: 2, scope: !132, file: !4, line: 112, type: !135)
!141 = !DILocation(line: 112, column: 33, scope: !132)
!142 = !DILocalVariable(name: "in", scope: !132, file: !4, line: 114, type: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !104, line: 79, baseType: !145)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !104, line: 79, flags: DIFlagFwdDecl)
!146 = !DILocation(line: 114, column: 10, scope: !132)
!147 = !DILocalVariable(name: "out", scope: !132, file: !4, line: 114, type: !143)
!148 = !DILocation(line: 114, column: 21, scope: !132)
!149 = !DILocalVariable(name: "indata", scope: !132, file: !4, line: 114, type: !143)
!150 = !DILocation(line: 114, column: 34, scope: !132)
!151 = !DILocalVariable(name: "key", scope: !132, file: !4, line: 115, type: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !104, line: 95, baseType: !154)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !104, line: 95, flags: DIFlagFwdDecl)
!155 = !DILocation(line: 115, column: 15, scope: !132)
!156 = !DILocalVariable(name: "p7", scope: !132, file: !4, line: 116, type: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7", file: !159, line: 144, baseType: !160)
!159 = !DIFile(filename: "include/openssl/pkcs7.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_st", file: !159, line: 109, size: 320, align: 64, elements: !161)
!161 = !{!162, !165, !167, !168, !169, !173}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "asn1", scope: !160, file: !159, line: 114, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !160, file: !159, line: 115, baseType: !166, size: 64, align: 64, offset: 64)
!166 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !160, file: !159, line: 119, baseType: !124, size: 32, align: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !160, file: !159, line: 120, baseType: !124, size: 32, align: 32, offset: 160)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !160, file: !159, line: 121, baseType: !170, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !104, line: 60, baseType: !172)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !104, line: 60, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !160, file: !159, line: 143, baseType: !174, size: 64, align: 64, offset: 256)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !160, file: !159, line: 127, size: 64, align: 64, elements: !175)
!175 = !{!176, !177, !187, !207, !294, !306, !315, !322}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !174, file: !159, line: 128, baseType: !106, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !174, file: !159, line: 130, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !104, line: 43, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !181, line: 146, size: 192, align: 64, elements: !182)
!181 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!182 = !{!183, !184, !185, !186}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !180, file: !181, line: 147, baseType: !124, size: 32, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !180, file: !181, line: 148, baseType: !124, size: 32, align: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !180, file: !181, line: 149, baseType: !163, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !180, file: !181, line: 155, baseType: !166, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !174, file: !159, line: 132, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGNED", file: !159, line: 68, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signed_st", file: !159, line: 61, size: 384, align: 64, elements: !191)
!191 = !{!192, !195, !198, !199, !202, !205}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !190, file: !159, line: 62, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !104, line: 40, baseType: !180)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !190, file: !159, line: 63, baseType: !196, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ALGOR", file: !181, line: 119, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !190, file: !159, line: 64, baseType: !97, size: 64, align: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !190, file: !159, line: 65, baseType: !200, size: 64, align: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_CRL", file: !99, line: 228, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !190, file: !159, line: 66, baseType: !203, size: 64, align: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_SIGNER_INFO", file: !159, line: 49, flags: DIFlagFwdDecl)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !190, file: !159, line: 67, baseType: !206, size: 64, align: 64, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "enveloped", scope: !174, file: !159, line: 134, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENVELOPE", file: !159, line: 85, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enveloped_st", file: !159, line: 81, size: 192, align: 64, elements: !211)
!211 = !{!212, !213, !216}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !210, file: !159, line: 82, baseType: !193, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !210, file: !159, line: 83, baseType: !214, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_RECIP_INFO", file: !159, line: 59, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !210, file: !159, line: 84, baseType: !217, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENC_CONTENT", file: !159, line: 79, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enc_content_st", file: !159, line: 74, size: 256, align: 64, elements: !220)
!220 = !{!221, !222, !288, !289}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !219, file: !159, line: 75, baseType: !170, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !219, file: !159, line: 76, baseType: !223, size: 64, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !104, line: 125, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !99, line: 59, size: 128, align: 64, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !225, file: !99, line: 60, baseType: !170, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !225, file: !99, line: 61, baseType: !229, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !181, line: 473, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !181, line: 444, size: 128, align: 64, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !231, file: !181, line: 445, baseType: !124, size: 32, align: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !231, file: !181, line: 472, baseType: !235, size: 64, align: 64, offset: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !231, file: !181, line: 446, size: 64, align: 64, elements: !236)
!236 = !{!237, !238, !240, !243, !244, !245, !248, !251, !252, !255, !258, !261, !264, !267, !270, !273, !276, !279, !282, !283, !284}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !235, file: !181, line: 447, baseType: !106, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !235, file: !181, line: 448, baseType: !239, size: 32, align: 32)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !104, line: 56, baseType: !124)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !235, file: !181, line: 449, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !104, line: 55, baseType: !180)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !235, file: !181, line: 450, baseType: !170, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !235, file: !181, line: 451, baseType: !193, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !235, file: !181, line: 452, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !104, line: 41, baseType: !180)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !235, file: !181, line: 453, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !104, line: 42, baseType: !180)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !235, file: !181, line: 454, baseType: !178, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !235, file: !181, line: 455, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !104, line: 44, baseType: !180)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !235, file: !181, line: 456, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !104, line: 45, baseType: !180)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !235, file: !181, line: 457, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !104, line: 46, baseType: !180)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !235, file: !181, line: 458, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !104, line: 47, baseType: !180)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !235, file: !181, line: 459, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !104, line: 49, baseType: !180)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !235, file: !181, line: 460, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !104, line: 48, baseType: !180)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !235, file: !181, line: 461, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !104, line: 50, baseType: !180)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !235, file: !181, line: 462, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !104, line: 52, baseType: !180)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !235, file: !181, line: 463, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !104, line: 53, baseType: !180)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !235, file: !181, line: 464, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !104, line: 54, baseType: !180)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !235, file: !181, line: 469, baseType: !241, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !235, file: !181, line: 470, baseType: !241, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !235, file: !181, line: 471, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !181, line: 213, baseType: !287)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !181, line: 213, flags: DIFlagFwdDecl)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !219, file: !159, line: 77, baseType: !178, size: 64, align: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !219, file: !159, line: 78, baseType: !290, size: 64, align: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !104, line: 89, baseType: !293)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !104, line: 89, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "signed_and_enveloped", scope: !174, file: !159, line: 136, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGN_ENVELOPE", file: !159, line: 95, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signedandenveloped_st", file: !159, line: 87, size: 448, align: 64, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !304, !305}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !297, file: !159, line: 88, baseType: !193, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !297, file: !159, line: 89, baseType: !196, size: 64, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !297, file: !159, line: 90, baseType: !97, size: 64, align: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !297, file: !159, line: 91, baseType: !200, size: 64, align: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !297, file: !159, line: 92, baseType: !203, size: 64, align: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !297, file: !159, line: 93, baseType: !217, size: 64, align: 64, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !297, file: !159, line: 94, baseType: !214, size: 64, align: 64, offset: 384)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !174, file: !159, line: 138, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_DIGEST", file: !159, line: 102, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_digest_st", file: !159, line: 97, size: 256, align: 64, elements: !310)
!310 = !{!311, !312, !313, !314}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !309, file: !159, line: 98, baseType: !193, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !309, file: !159, line: 99, baseType: !223, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !309, file: !159, line: 100, baseType: !206, size: 64, align: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !309, file: !159, line: 101, baseType: !178, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "encrypted", scope: !174, file: !159, line: 140, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENCRYPT", file: !159, line: 107, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_encrypted_st", file: !159, line: 104, size: 128, align: 64, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !318, file: !159, line: 105, baseType: !193, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !318, file: !159, line: 106, baseType: !217, size: 64, align: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !174, file: !159, line: 142, baseType: !229, size: 64, align: 64)
!323 = !DILocation(line: 116, column: 12, scope: !132)
!324 = !DILocalVariable(name: "sksigners", scope: !132, file: !4, line: 117, type: !88)
!325 = !DILocation(line: 117, column: 37, scope: !132)
!326 = !DILocalVariable(name: "skkeys", scope: !132, file: !4, line: 117, type: !88)
!327 = !DILocation(line: 117, column: 49, scope: !132)
!328 = !DILocalVariable(name: "encerts", scope: !132, file: !4, line: 118, type: !97)
!329 = !DILocation(line: 118, column: 27, scope: !132)
!330 = !DILocalVariable(name: "other", scope: !132, file: !4, line: 118, type: !97)
!331 = !DILocation(line: 118, column: 37, scope: !132)
!332 = !DILocalVariable(name: "cert", scope: !132, file: !4, line: 119, type: !102)
!333 = !DILocation(line: 119, column: 11, scope: !132)
!334 = !DILocalVariable(name: "recip", scope: !132, file: !4, line: 119, type: !102)
!335 = !DILocation(line: 119, column: 24, scope: !132)
!336 = !DILocalVariable(name: "signer", scope: !132, file: !4, line: 119, type: !102)
!337 = !DILocation(line: 119, column: 39, scope: !132)
!338 = !DILocalVariable(name: "store", scope: !132, file: !4, line: 120, type: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_STORE", file: !104, line: 131, baseType: !341)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_store_st", file: !104, line: 131, flags: DIFlagFwdDecl)
!342 = !DILocation(line: 120, column: 17, scope: !132)
!343 = !DILocalVariable(name: "vpm", scope: !132, file: !4, line: 121, type: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_VERIFY_PARAM", file: !104, line: 137, baseType: !346)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_VERIFY_PARAM_st", file: !104, line: 137, flags: DIFlagFwdDecl)
!347 = !DILocation(line: 121, column: 24, scope: !132)
!348 = !DILocalVariable(name: "cipher", scope: !132, file: !4, line: 122, type: !290)
!349 = !DILocation(line: 122, column: 23, scope: !132)
!350 = !DILocalVariable(name: "sign_md", scope: !132, file: !4, line: 123, type: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD", file: !104, line: 91, baseType: !354)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_md_st", file: !104, line: 91, flags: DIFlagFwdDecl)
!355 = !DILocation(line: 123, column: 19, scope: !132)
!356 = !DILocalVariable(name: "CAfile", scope: !132, file: !4, line: 124, type: !121)
!357 = !DILocation(line: 124, column: 17, scope: !132)
!358 = !DILocalVariable(name: "CApath", scope: !132, file: !4, line: 124, type: !121)
!359 = !DILocation(line: 124, column: 32, scope: !132)
!360 = !DILocalVariable(name: "prog", scope: !132, file: !4, line: 124, type: !121)
!361 = !DILocation(line: 124, column: 48, scope: !132)
!362 = !DILocalVariable(name: "certfile", scope: !132, file: !4, line: 125, type: !106)
!363 = !DILocation(line: 125, column: 11, scope: !132)
!364 = !DILocalVariable(name: "keyfile", scope: !132, file: !4, line: 125, type: !106)
!365 = !DILocation(line: 125, column: 28, scope: !132)
!366 = !DILocalVariable(name: "contfile", scope: !132, file: !4, line: 125, type: !106)
!367 = !DILocation(line: 125, column: 45, scope: !132)
!368 = !DILocalVariable(name: "infile", scope: !132, file: !4, line: 126, type: !106)
!369 = !DILocation(line: 126, column: 11, scope: !132)
!370 = !DILocalVariable(name: "outfile", scope: !132, file: !4, line: 126, type: !106)
!371 = !DILocation(line: 126, column: 26, scope: !132)
