; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--ssl_test-bin-ssl_test.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--ssl_test-bin-ssl_test.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.options_st = type { i8*, i32, i32, i8* }
%struct.conf_st = type { %struct.conf_method_st*, i8*, %struct.lhash_st_CONF_VALUE* }
%struct.conf_method_st = type { i8*, {}*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*, %struct.bio_st*, i64*)*, i32 (%struct.conf_st*, %struct.bio_st*)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8*, i64*)* }
%struct.bio_st = type opaque
%struct.lhash_st_CONF_VALUE = type { %union.lh_CONF_VALUE_dummy }
%union.lh_CONF_VALUE_dummy = type { i8* }
%struct.ssl_ctx_st = type opaque
%struct.SSL_TEST_CTX = type { i32, i32, i32, i32, i32, %struct.SSL_TEST_EXTRA_CONF, %struct.SSL_TEST_EXTRA_CONF, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, i32, i32, i32, %struct.stack_st_X509_NAME*, i32, i32, i32, %struct.stack_st_X509_NAME*, i32, i32, i32, i32, i8*, i8* }
%struct.SSL_TEST_EXTRA_CONF = type { %struct.SSL_TEST_CLIENT_CONF, %struct.SSL_TEST_SERVER_CONF, %struct.SSL_TEST_SERVER_CONF }
%struct.SSL_TEST_CLIENT_CONF = type { i32, i32, i32, i8*, i8*, i32, i8*, i8*, i8*, i32 }

!14 = !DIEnumerator(name: "SSL_TEST_HANDSHAKE_KEY_UPDATE_SERVER", value: 4)
!15 = !DIEnumerator(name: "SSL_TEST_HANDSHAKE_KEY_UPDATE_CLIENT", value: 5)
!16 = !DIEnumerator(name: "SSL_TEST_HANDSHAKE_POST_HANDSHAKE_AUTH", value: 6)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 25, size: 32, align: 32, elements: !18)
!18 = !{!19, !20, !21}
!19 = !DIEnumerator(name: "SSL_TEST_VERIFY_NONE", value: 0)
!20 = !DIEnumerator(name: "SSL_TEST_VERIFY_ACCEPT_ALL", value: 1)
!21 = !DIEnumerator(name: "SSL_TEST_VERIFY_REJECT_ALL", value: 2)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 31, size: 32, align: 32, elements: !23)
!23 = !{!24, !25, !26, !27}
!24 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_NONE", value: 0)
!25 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_SERVER1", value: 1)
!26 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_SERVER2", value: 2)
!27 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_INVALID", value: 3)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 80, size: 32, align: 32, elements: !29)
!29 = !{!30, !31, !32}
!30 = !DIEnumerator(name: "SSL_TEST_CT_VALIDATION_NONE", value: 0)
!31 = !DIEnumerator(name: "SSL_TEST_CT_VALIDATION_PERMISSIVE", value: 1)
!32 = !DIEnumerator(name: "SSL_TEST_CT_VALIDATION_STRICT", value: 2)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 38, size: 32, align: 32, elements: !34)
!34 = !{!35, !36, !37, !38, !39, !40}
!35 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_CB_NONE", value: 0)
!36 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_IGNORE_MISMATCH", value: 1)
!37 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_REJECT_MISMATCH", value: 2)
!38 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_CLIENT_HELLO_IGNORE_MISMATCH", value: 3)
!39 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_CLIENT_HELLO_REJECT_MISMATCH", value: 4)
!40 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_CLIENT_HELLO_NO_V12", value: 5)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 86, size: 32, align: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "SSL_TEST_CERT_STATUS_NONE", value: 0)
!44 = !DIEnumerator(name: "SSL_TEST_CERT_STATUS_GOOD_RESPONSE", value: 1)
!45 = !DIEnumerator(name: "SSL_TEST_CERT_STATUS_BAD_RESPONSE", value: 2)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 16, size: 32, align: 32, elements: !47)
!47 = !{!48, !49, !50, !51, !52}
!48 = !DIEnumerator(name: "SSL_TEST_SUCCESS", value: 0)
!49 = !DIEnumerator(name: "SSL_TEST_SERVER_FAIL", value: 1)
!50 = !DIEnumerator(name: "SSL_TEST_CLIENT_FAIL", value: 2)
!51 = !DIEnumerator(name: "SSL_TEST_INTERNAL_ERROR", value: 3)
!52 = !DIEnumerator(name: "SSL_TEST_FIRST_HANDSHAKE_FAILED", value: 4)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 47, size: 32, align: 32, elements: !54)
!54 = !{!55, !56, !57, !58}
!55 = !DIEnumerator(name: "SSL_TEST_SESSION_TICKET_IGNORE", value: 0)
!56 = !DIEnumerator(name: "SSL_TEST_SESSION_TICKET_YES", value: 1)
!57 = !DIEnumerator(name: "SSL_TEST_SESSION_TICKET_NO", value: 2)
!58 = !DIEnumerator(name: "SSL_TEST_SESSION_TICKET_BROKEN", value: 3)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 59, size: 32, align: 32, elements: !60)
!60 = !{!61, !62, !63}
!61 = !DIEnumerator(name: "SSL_TEST_SESSION_ID_IGNORE", value: 0)
!62 = !DIEnumerator(name: "SSL_TEST_SESSION_ID_YES", value: 1)
!63 = !DIEnumerator(name: "SSL_TEST_SESSION_ID_NO", value: 2)
!64 = !{!65, !66, !67, !72}
!65 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !70, line: 17, baseType: !71)
!70 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !70, line: 17, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !74, line: 129, baseType: !75)
!74 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !74, line: 129, flags: DIFlagFwdDecl)
!76 = !{!77, !99}
!77 = distinct !DIGlobalVariable(name: "options", scope: !78, file: !79, line: 503, type: !96, isLocal: true, isDefinition: true, variable: [9 x %struct.options_st]* @test_get_options.options)
!78 = distinct !DISubprogram(name: "test_get_options", scope: !79, file: !79, line: 503, type: !80, isLocal: false, isDefinition: true, scopeLine: 503, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !95)
!79 = !DIFile(filename: "test/ssl_test.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!80 = !DISubroutineType(types: !81)
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPTIONS", file: !85, line: 280, baseType: !86)
!85 = !DIFile(filename: "apps/include/opt.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "options_st", file: !85, line: 269, size: 192, align: 64, elements: !87)
!87 = !{!88, !92, !93, !94}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !86, file: !85, line: 270, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !86, file: !85, line: 271, baseType: !65, size: 32, align: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "valtype", scope: !86, file: !85, line: 278, baseType: !65, size: 32, align: 32, offset: 96)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "helpstr", scope: !86, file: !85, line: 279, baseType: !89, size: 64, align: 64, offset: 128)
!95 = !{}
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 1728, align: 64, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 9)
!99 = distinct !DIGlobalVariable(name: "conf", scope: !0, file: !79, line: 21, type: !100, isLocal: true, isDefinition: true, variable: %struct.conf_st** @conf)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF", file: !74, line: 144, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_st", file: !103, line: 103, size: 192, align: 64, elements: !104)
!103 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!104 = !{!105, !145, !146}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !102, file: !103, line: 104, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_METHOD", file: !103, line: 35, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_method_st", file: !103, line: 37, size: 640, align: 64, elements: !109)
!109 = !{!110, !111, !115, !119, !120, !121, !130, !136, !140, !141}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !108, file: !103, line: 38, baseType: !89, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !108, file: !103, line: 39, baseType: !112, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!100, !106}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !108, file: !103, line: 40, baseType: !116, size: 64, align: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!65, !100}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !108, file: !103, line: 41, baseType: !116, size: 64, align: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_data", scope: !108, file: !103, line: 42, baseType: !116, size: 64, align: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "load_bio", scope: !108, file: !103, line: 43, baseType: !122, size: 64, align: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!65, !100, !125, !128}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !74, line: 79, baseType: !127)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !74, line: 79, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !108, file: !103, line: 44, baseType: !131, size: 64, align: 64, offset: 384)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!65, !134, !125}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "is_number", scope: !108, file: !103, line: 45, baseType: !137, size: 64, align: 64, offset: 448)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!65, !134, !91}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "to_int", scope: !108, file: !103, line: 46, baseType: !137, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !108, file: !103, line: 47, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!65, !100, !89, !128}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "meth_data", scope: !102, file: !103, line: 105, baseType: !66, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !102, file: !103, line: 106, baseType: !147, size: 64, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st_CONF_VALUE", file: !103, line: 31, size: 64, align: 64, elements: !149)
!149 = !{!150}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !148, file: !103, line: 31, baseType: !151, size: 64, align: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "lh_CONF_VALUE_dummy", file: !103, line: 31, size: 64, align: 64, elements: !152)
!152 = !{!153, !154, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !151, file: !103, line: 31, baseType: !66, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !151, file: !103, line: 31, baseType: !155, size: 64, align: 64)
!155 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !151, file: !103, line: 31, baseType: !65, size: 32, align: 32)
!157 = !{i32 2, !"Dwarf Version", i32 4}
!158 = !{i32 2, !"Debug Info Version", i32 3}
!159 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!160 = !DILocation(line: 503, column: 6, scope: !78)
!161 = distinct !DISubprogram(name: "setup_tests", scope: !79, file: !79, line: 505, type: !162, isLocal: false, isDefinition: true, scopeLine: 506, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !95)
!162 = !DISubroutineType(types: !163)
!163 = !{!65}
!164 = !DILocalVariable(name: "num_tests", scope: !161, file: !79, line: 507, type: !129)
!165 = !DIExpression()
!166 = !DILocation(line: 507, column: 10, scope: !161)
!167 = !DILocation(line: 509, column: 76, scope: !168)
!168 = distinct !DILexicalBlock(scope: !161, file: !79, line: 509, column: 9)
!169 = !DILocation(line: 509, column: 74, scope: !168)
!170 = !DILocation(line: 509, column: 69, scope: !168)
!171 = !DILocation(line: 509, column: 10, scope: !172)
!172 = !DILexicalBlockFile(scope: !168, file: !79, discriminator: 2)
!173 = !DILocation(line: 509, column: 10, scope: !168)
!174 = !DILocation(line: 511, column: 13, scope: !168)
!175 = !DILocation(line: 511, column: 117, scope: !176)
!176 = !DILexicalBlockFile(scope: !168, file: !79, discriminator: 1)
!177 = !DILocation(line: 511, column: 123, scope: !176)
!178 = !DILocation(line: 511, column: 106, scope: !179)
!179 = !DILexicalBlockFile(scope: !176, file: !79, discriminator: 2)
!180 = !DILocation(line: 511, column: 17, scope: !181)
!181 = !DILexicalBlockFile(scope: !176, file: !79, discriminator: 3)
!182 = !DILocation(line: 511, column: 17, scope: !176)
!183 = !DILocation(line: 512, column: 13, scope: !168)
!184 = !DILocation(line: 512, column: 104, scope: !176)
!185 = !DILocation(line: 512, column: 85, scope: !176)
!186 = !DILocation(line: 512, column: 17, scope: !179)
!187 = !DILocation(line: 512, column: 17, scope: !176)
!188 = !DILocation(line: 509, column: 9, scope: !189)
!189 = !DILexicalBlockFile(scope: !161, file: !79, discriminator: 1)
!190 = !DILocation(line: 514, column: 9, scope: !168)
!191 = !DILocation(line: 516, column: 58, scope: !161)
!192 = !DILocation(line: 516, column: 53, scope: !161)
!193 = !DILocation(line: 516, column: 5, scope: !161)
!194 = !DILocation(line: 517, column: 5, scope: !161)
!195 = !DILocation(line: 518, column: 1, scope: !161)
!196 = distinct !DISubprogram(name: "test_handshake", scope: !79, file: !79, line: 391, type: !197, isLocal: true, isDefinition: true, scopeLine: 392, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !95)
!197 = !DISubroutineType(types: !198)
!198 = !{!65, !65}
!199 = !DILocalVariable(name: "idx", arg: 1, scope: !196, file: !79, line: 391, type: !65)
!200 = !DILocation(line: 391, column: 31, scope: !196)
!201 = !DILocalVariable(name: "ret", scope: !196, file: !79, line: 393, type: !65)
!202 = !DILocation(line: 393, column: 9, scope: !196)
!203 = !DILocalVariable(name: "server_ctx", scope: !196, file: !79, line: 394, type: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !74, line: 152, baseType: !206)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !74, line: 152, flags: DIFlagFwdDecl)
!207 = !DILocation(line: 394, column: 14, scope: !196)
!208 = !DILocalVariable(name: "server2_ctx", scope: !196, file: !79, line: 394, type: !204)
!209 = !DILocation(line: 394, column: 33, scope: !196)
!210 = !DILocalVariable(name: "client_ctx", scope: !196, file: !79, line: 394, type: !204)
!211 = !DILocation(line: 394, column: 54, scope: !196)
!212 = !DILocalVariable(name: "resume_server_ctx", scope: !196, file: !79, line: 395, type: !204)
!213 = !DILocation(line: 395, column: 10, scope: !196)
!214 = !DILocalVariable(name: "resume_client_ctx", scope: !196, file: !79, line: 395, type: !204)
!215 = !DILocation(line: 395, column: 36, scope: !196)
!216 = !DILocalVariable(name: "test_ctx", scope: !196, file: !79, line: 396, type: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_TEST_CTX", file: !4, line: 226, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 139, size: 4480, align: 64, elements: !220)
!220 = !{!221, !223, !225, !226, !227, !228, !266, !267, !269, !270, !271, !272, !273, !275, !276, !277, !278, !279, !280, !281, !282, !283, !287, !288, !289, !290, !291, !292, !293, !294, !296, !297}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !219, file: !4, line: 144, baseType: !222, size: 32, align: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_test_method_t", file: !4, line: 68, baseType: !3)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_mode", scope: !219, file: !4, line: 146, baseType: !224, size: 32, align: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_handshake_mode_t", file: !4, line: 78, baseType: !8)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "app_data_size", scope: !219, file: !4, line: 151, baseType: !65, size: 32, align: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "max_fragment_size", scope: !219, file: !4, line: 153, baseType: !65, size: 32, align: 32, offset: 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "key_update_type", scope: !219, file: !4, line: 155, baseType: !65, size: 32, align: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !219, file: !4, line: 161, baseType: !229, size: 1600, align: 64, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_TEST_EXTRA_CONF", file: !4, line: 137, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 133, size: 1600, align: 64, elements: !231)
!231 = !{!232, !250, !265}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !230, file: !4, line: 134, baseType: !233, size: 576, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_TEST_CLIENT_CONF", file: !4, line: 113, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 96, size: 576, align: 64, elements: !235)
!235 = !{!236, !238, !240, !241, !243, !244, !246, !247, !248, !249}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "verify_callback", scope: !234, file: !4, line: 98, baseType: !237, size: 32, align: 32)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_verify_callback_t", file: !4, line: 29, baseType: !17)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "servername", scope: !234, file: !4, line: 100, baseType: !239, size: 32, align: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_servername_t", file: !4, line: 36, baseType: !22)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "max_fragment_len_mode", scope: !234, file: !4, line: 102, baseType: !65, size: 32, align: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "npn_protocols", scope: !234, file: !4, line: 104, baseType: !242, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "alpn_protocols", scope: !234, file: !4, line: 105, baseType: !242, size: 64, align: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ct_validation", scope: !234, file: !4, line: 106, baseType: !245, size: 32, align: 32, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_ct_validation_t", file: !4, line: 84, baseType: !28)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "reneg_ciphers", scope: !234, file: !4, line: 108, baseType: !242, size: 64, align: 64, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "srp_user", scope: !234, file: !4, line: 109, baseType: !242, size: 64, align: 64, offset: 384)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "srp_password", scope: !234, file: !4, line: 110, baseType: !242, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "enable_pha", scope: !234, file: !4, line: 112, baseType: !65, size: 32, align: 32, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !230, file: !4, line: 135, baseType: !251, size: 512, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_TEST_SERVER_CONF", file: !4, line: 131, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 115, size: 512, align: 64, elements: !253)
!253 = !{!254, !256, !257, !258, !259, !261, !262, !263, !264}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "servername_callback", scope: !252, file: !4, line: 117, baseType: !255, size: 32, align: 32)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_servername_callback_t", file: !4, line: 45, baseType: !33)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "npn_protocols", scope: !252, file: !4, line: 119, baseType: !242, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "alpn_protocols", scope: !252, file: !4, line: 120, baseType: !242, size: 64, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "broken_session_ticket", scope: !252, file: !4, line: 122, baseType: !65, size: 32, align: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "cert_status", scope: !252, file: !4, line: 124, baseType: !260, size: 32, align: 32, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_cert_status_t", file: !4, line: 90, baseType: !41)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "srp_user", scope: !252, file: !4, line: 126, baseType: !242, size: 64, align: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "srp_password", scope: !252, file: !4, line: 127, baseType: !242, size: 64, align: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "force_pha", scope: !252, file: !4, line: 129, baseType: !65, size: 32, align: 32, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "session_ticket_app_data", scope: !252, file: !4, line: 130, baseType: !242, size: 64, align: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "server2", scope: !230, file: !4, line: 136, baseType: !251, size: 512, align: 64, offset: 1088)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "resume_extra", scope: !219, file: !4, line: 163, baseType: !229, size: 1600, align: 64, offset: 1792)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "expected_result", scope: !219, file: !4, line: 169, baseType: !268, size: 32, align: 32, offset: 3392)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_test_result_t", file: !4, line: 23, baseType: !46)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "expected_client_alert", scope: !219, file: !4, line: 173, baseType: !65, size: 32, align: 32, offset: 3424)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "expected_server_alert", scope: !219, file: !4, line: 175, baseType: !65, size: 32, align: 32, offset: 3456)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "expected_protocol", scope: !219, file: !4, line: 178, baseType: !65, size: 32, align: 32, offset: 3488)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "expected_servername", scope: !219, file: !4, line: 189, baseType: !239, size: 32, align: 32, offset: 3520)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "session_ticket_expected", scope: !219, file: !4, line: 190, baseType: !274, size: 32, align: 32, offset: 3552)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_session_ticket_t", file: !4, line: 52, baseType: !53)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "compression_expected", scope: !219, file: !4, line: 191, baseType: !65, size: 32, align: 32, offset: 3584)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "expected_npn_protocol", scope: !219, file: !4, line: 193, baseType: !242, size: 64, align: 64, offset: 3648)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "expected_alpn_protocol", scope: !219, file: !4, line: 194, baseType: !242, size: 64, align: 64, offset: 3712)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "resumption_expected", scope: !219, file: !4, line: 196, baseType: !65, size: 32, align: 32, offset: 3776)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "expected_tmp_key_type", scope: !219, file: !4, line: 198, baseType: !65, size: 32, align: 32, offset: 3808)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "expected_server_cert_type", scope: !219, file: !4, line: 200, baseType: !65, size: 32, align: 32, offset: 3840)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "expected_server_sign_hash", scope: !219, file: !4, line: 202, baseType: !65, size: 32, align: 32, offset: 3872)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "expected_server_sign_type", scope: !219, file: !4, line: 204, baseType: !65, size: 32, align: 32, offset: 3904)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "expected_server_ca_names", scope: !219, file: !4, line: 206, baseType: !284, size: 64, align: 64, offset: 3968)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_NAME", file: !286, line: 77, flags: DIFlagFwdDecl)
!286 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!287 = !DIDerivedType(tag: DW_TAG_member, name: "expected_client_cert_type", scope: !219, file: !4, line: 208, baseType: !65, size: 32, align: 32, offset: 4032)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "expected_client_sign_hash", scope: !219, file: !4, line: 210, baseType: !65, size: 32, align: 32, offset: 4064)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "expected_client_sign_type", scope: !219, file: !4, line: 212, baseType: !65, size: 32, align: 32, offset: 4096)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "expected_client_ca_names", scope: !219, file: !4, line: 214, baseType: !284, size: 64, align: 64, offset: 4160)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "use_sctp", scope: !219, file: !4, line: 216, baseType: !65, size: 32, align: 32, offset: 4224)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "enable_client_sctp_label_bug", scope: !219, file: !4, line: 218, baseType: !65, size: 32, align: 32, offset: 4256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "enable_server_sctp_label_bug", scope: !219, file: !4, line: 220, baseType: !65, size: 32, align: 32, offset: 4288)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "session_id_expected", scope: !219, file: !4, line: 222, baseType: !295, size: 32, align: 32, offset: 4320)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_session_id_t", file: !4, line: 63, baseType: !59)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "expected_cipher", scope: !219, file: !4, line: 223, baseType: !242, size: 64, align: 64, offset: 4352)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "expected_session_ticket_app_data", scope: !219, file: !4, line: 225, baseType: !242, size: 64, align: 64, offset: 4416)
!298 = !DILocation(line: 396, column: 19, scope: !196)
!299 = !DILocalVariable(name: "result", scope: !196, file: !79, line: 397, type: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "HANDSHAKE_RESULT", file: !302, line: 70, baseType: !303)
!302 = !DIFile(filename: "test/handshake_helper.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "handshake_result", file: !302, line: 15, size: 1344, align: 64, elements: !304)
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !303, file: !302, line: 16, baseType: !268, size: 32, align: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "client_alert_sent", scope: !303, file: !302, line: 19, baseType: !65, size: 32, align: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "client_num_fatal_alerts_sent", scope: !303, file: !302, line: 21, baseType: !65, size: 32, align: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "client_alert_received", scope: !303, file: !302, line: 23, baseType: !65, size: 32, align: 32, offset: 96)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "server_alert_sent", scope: !303, file: !302, line: 25, baseType: !65, size: 32, align: 32, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "server_num_fatal_alerts_sent", scope: !303, file: !302, line: 27, baseType: !65, size: 32, align: 32, offset: 160)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "server_alert_received", scope: !303, file: !302, line: 29, baseType: !65, size: 32, align: 32, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "server_protocol", scope: !303, file: !302, line: 31, baseType: !65, size: 32, align: 32, offset: 224)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "client_protocol", scope: !303, file: !302, line: 32, baseType: !65, size: 32, align: 32, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "servername", scope: !303, file: !302, line: 34, baseType: !239, size: 32, align: 32, offset: 288)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "session_ticket", scope: !303, file: !302, line: 36, baseType: !274, size: 32, align: 32, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !303, file: !302, line: 37, baseType: !65, size: 32, align: 32, offset: 352)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "session_ticket_do_not_call", scope: !303, file: !302, line: 39, baseType: !65, size: 32, align: 32, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "client_npn_negotiated", scope: !303, file: !302, line: 40, baseType: !242, size: 64, align: 64, offset: 448)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "server_npn_negotiated", scope: !303, file: !302, line: 41, baseType: !242, size: 64, align: 64, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "client_alpn_negotiated", scope: !303, file: !302, line: 42, baseType: !242, size: 64, align: 64, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "server_alpn_negotiated", scope: !303, file: !302, line: 43, baseType: !242, size: 64, align: 64, offset: 640)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "client_resumed", scope: !303, file: !302, line: 45, baseType: !65, size: 32, align: 32, offset: 704)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "server_resumed", scope: !303, file: !302, line: 46, baseType: !65, size: 32, align: 32, offset: 736)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_key_type", scope: !303, file: !302, line: 48, baseType: !65, size: 32, align: 32, offset: 768)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "server_cert_type", scope: !303, file: !302, line: 50, baseType: !65, size: 32, align: 32, offset: 800)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "server_sign_hash", scope: !303, file: !302, line: 52, baseType: !65, size: 32, align: 32, offset: 832)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "server_sign_type", scope: !303, file: !302, line: 54, baseType: !65, size: 32, align: 32, offset: 864)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "server_ca_names", scope: !303, file: !302, line: 56, baseType: !284, size: 64, align: 64, offset: 896)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "client_cert_type", scope: !303, file: !302, line: 58, baseType: !65, size: 32, align: 32, offset: 960)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "client_sign_hash", scope: !303, file: !302, line: 60, baseType: !65, size: 32, align: 32, offset: 992)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "client_sign_type", scope: !303, file: !302, line: 62, baseType: !65, size: 32, align: 32, offset: 1024)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "client_ca_names", scope: !303, file: !302, line: 64, baseType: !284, size: 64, align: 64, offset: 1088)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "session_id", scope: !303, file: !302, line: 66, baseType: !295, size: 32, align: 32, offset: 1152)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !303, file: !302, line: 67, baseType: !242, size: 64, align: 64, offset: 1216)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "result_session_ticket_app_data", scope: !303, file: !302, line: 69, baseType: !242, size: 64, align: 64, offset: 1280)
!336 = !DILocation(line: 397, column: 23, scope: !196)
!337 = !DILocalVariable(name: "test_app", scope: !196, file: !79, line: 398, type: !338)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 800, align: 8, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 100)
!341 = !DILocation(line: 398, column: 10, scope: !196)
!342 = !DILocation(line: 400, column: 18, scope: !196)
!343 = !DILocation(line: 400, column: 57, scope: !196)
!344 = !DILocation(line: 400, column: 5, scope: !196)
!345 = !DILocation(line: 402, column: 36, scope: !196)
!346 = !DILocation(line: 402, column: 42, scope: !196)
!347 = !DILocation(line: 402, column: 16, scope: !196)
!348 = !DILocation(line: 402, column: 14, scope: !196)
!349 = !DILocation(line: 403, column: 55, scope: !350)
!350 = distinct !DILexicalBlock(scope: !196, file: !79, line: 403, column: 9)
!351 = !DILocation(line: 403, column: 10, scope: !350)
!352 = !DILocation(line: 403, column: 9, scope: !196)
!353 = !DILocation(line: 404, column: 9, scope: !350)
!354 = !DILocation(line: 407, column: 9, scope: !355)
!355 = distinct !DILexicalBlock(scope: !196, file: !79, line: 407, column: 9)
!356 = !DILocation(line: 407, column: 19, scope: !355)
!357 = !DILocation(line: 407, column: 26, scope: !355)
!358 = !DILocation(line: 407, column: 9, scope: !196)
!359 = !DILocation(line: 408, column: 34, scope: !360)
!360 = distinct !DILexicalBlock(scope: !355, file: !79, line: 407, column: 51)
!361 = !DILocation(line: 408, column: 22, scope: !362)
!362 = !DILexicalBlockFile(scope: !360, file: !79, discriminator: 1)
!363 = !DILocation(line: 408, column: 20, scope: !360)
!364 = !DILocation(line: 409, column: 110, scope: !365)
!365 = distinct !DILexicalBlock(scope: !360, file: !79, line: 409, column: 13)
!366 = !DILocation(line: 409, column: 97, scope: !365)
!367 = !DILocation(line: 409, column: 16, scope: !365)
!368 = !DILocation(line: 409, column: 14, scope: !369)
!369 = !DILexicalBlockFile(scope: !365, file: !79, discriminator: 1)
!370 = !DILocation(line: 409, column: 14, scope: !365)
!371 = !DILocation(line: 409, column: 13, scope: !360)
!372 = !DILocation(line: 410, column: 13, scope: !365)
!373 = !DILocation(line: 411, column: 13, scope: !374)
!374 = distinct !DILexicalBlock(scope: !360, file: !79, line: 411, column: 13)
!375 = !DILocation(line: 411, column: 23, scope: !374)
!376 = !DILocation(line: 411, column: 29, scope: !374)
!377 = !DILocation(line: 411, column: 36, scope: !374)
!378 = !DILocation(line: 411, column: 56, scope: !374)
!379 = !DILocation(line: 411, column: 13, scope: !360)
!380 = !DILocation(line: 413, column: 128, scope: !381)
!381 = distinct !DILexicalBlock(scope: !382, file: !79, line: 413, column: 17)
!382 = distinct !DILexicalBlock(scope: !374, file: !79, line: 412, column: 42)
!383 = !DILocation(line: 413, column: 116, scope: !384)
!384 = !DILexicalBlockFile(scope: !381, file: !79, discriminator: 1)
!385 = !DILocation(line: 413, column: 114, scope: !381)
!386 = !DILocation(line: 413, column: 102, scope: !381)
!387 = !DILocation(line: 413, column: 18, scope: !388)
!388 = !DILexicalBlockFile(scope: !381, file: !79, discriminator: 2)
!389 = !DILocation(line: 413, column: 18, scope: !381)
!390 = !DILocation(line: 413, column: 17, scope: !382)
!391 = !DILocation(line: 414, column: 17, scope: !381)
!392 = !DILocation(line: 415, column: 9, scope: !382)
!393 = !DILocation(line: 416, column: 34, scope: !360)
!394 = !DILocation(line: 416, column: 22, scope: !362)
!395 = !DILocation(line: 416, column: 20, scope: !360)
!396 = !DILocation(line: 417, column: 110, scope: !397)
!397 = distinct !DILexicalBlock(scope: !360, file: !79, line: 417, column: 13)
!398 = !DILocation(line: 417, column: 97, scope: !397)
!399 = !DILocation(line: 417, column: 16, scope: !397)
!400 = !DILocation(line: 417, column: 14, scope: !401)
