; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--sm3--libcrypto-lib-sm3.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--sm3--libcrypto-lib-sm3.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SM3state_st = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [16 x i32], i32 }

; Function Attrs: nounwind uwtable
define i32 @sm3_update(%struct.SM3state_st* %c, i8* %data_, i64 %len) #0 !dbg !11 {
entry:
  %retval = alloca i32, align 4
  %c.addr = alloca %struct.SM3state_st*, align 8
  %data_.addr = alloca i8*, align 8
  %len.addr = alloca i64, align 8
  %data = alloca i8*, align 8
  %p = alloca i8*, align 8
  %l = alloca i32, align 4
  %n = alloca i64, align 8
  store %struct.SM3state_st* %c, %struct.SM3state_st** %c.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.SM3state_st** %c.addr, metadata !40, metadata !41), !dbg !42
  store i8* %data_, i8** %data_.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %data_.addr, metadata !43, metadata !41), !dbg !44
  store i64 %len, i64* %len.addr, align 8
  call void @llvm.dbg.declare(metadata i64* %len.addr, metadata !45, metadata !41), !dbg !46
  call void @llvm.dbg.declare(metadata i8** %data, metadata !47, metadata !41), !dbg !50
  %0 = load i8*, i8** %data_.addr, align 8, !dbg !51
  store i8* %0, i8** %data, align 8, !dbg !50

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--sm3--libcrypto-lib-sm3.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !6, !7}
!4 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!7 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!8 = !{i32 2, !"Dwarf Version", i32 4}
!9 = !{i32 2, !"Debug Info Version", i32 3}
!10 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!11 = distinct !DISubprogram(name: "sm3_update", scope: !12, file: !12, line: 128, type: !13, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!12 = !DIFile(filename: "crypto/include/internal/md32_common.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !16, !36, !38}
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "SM3_CTX", file: !18, line: 31, baseType: !19)
!18 = !DIFile(filename: "crypto/include/internal/sm3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SM3state_st", file: !18, line: 26, size: 864, align: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !35}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !19, file: !18, line: 27, baseType: !4, size: 32, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !19, file: !18, line: 27, baseType: !4, size: 32, align: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !19, file: !18, line: 27, baseType: !4, size: 32, align: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !19, file: !18, line: 27, baseType: !4, size: 32, align: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !19, file: !18, line: 27, baseType: !4, size: 32, align: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "F", scope: !19, file: !18, line: 27, baseType: !4, size: 32, align: 32, offset: 160)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "G", scope: !19, file: !18, line: 27, baseType: !4, size: 32, align: 32, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "H", scope: !19, file: !18, line: 27, baseType: !4, size: 32, align: 32, offset: 224)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Nl", scope: !19, file: !18, line: 28, baseType: !4, size: 32, align: 32, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Nh", scope: !19, file: !18, line: 28, baseType: !4, size: 32, align: 32, offset: 288)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !19, file: !18, line: 29, baseType: !32, size: 512, align: 32, offset: 320)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, align: 32, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 16)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !19, file: !18, line: 30, baseType: !4, size: 32, align: 32, offset: 832)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !39, line: 216, baseType: !7)
!39 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!40 = !DILocalVariable(name: "c", arg: 1, scope: !11, file: !12, line: 128, type: !16)
!41 = !DIExpression()
!42 = !DILocation(line: 128, column: 25, scope: !11)
!43 = !DILocalVariable(name: "data_", arg: 2, scope: !11, file: !12, line: 128, type: !36)
!44 = !DILocation(line: 128, column: 40, scope: !11)
!45 = !DILocalVariable(name: "len", arg: 3, scope: !11, file: !12, line: 128, type: !38)
!46 = !DILocation(line: 128, column: 54, scope: !11)
!47 = !DILocalVariable(name: "data", scope: !11, file: !12, line: 130, type: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!50 = !DILocation(line: 130, column: 26, scope: !11)
!51 = !DILocation(line: 130, column: 33, scope: !11)
!52 = !DILocalVariable(name: "p", scope: !11, file: !12, line: 131, type: !5)
!53 = !DILocation(line: 131, column: 20, scope: !11)
!54 = !DILocalVariable(name: "l", scope: !11, file: !12, line: 132, type: !4)
!55 = !DILocation(line: 132, column: 18, scope: !11)
!56 = !DILocalVariable(name: "n", scope: !11, file: !12, line: 133, type: !38)
!57 = !DILocation(line: 133, column: 12, scope: !11)
!58 = !DILocation(line: 135, column: 9, scope: !59)
!59 = distinct !DILexicalBlock(scope: !11, file: !12, line: 135, column: 9)
!60 = !DILocation(line: 135, column: 13, scope: !59)
!61 = !DILocation(line: 135, column: 9, scope: !11)
!62 = !DILocation(line: 136, column: 9, scope: !59)
!63 = !DILocation(line: 138, column: 10, scope: !11)
!64 = !DILocation(line: 138, column: 13, scope: !11)
!65 = !DILocation(line: 138, column: 35, scope: !11)
!66 = !DILocation(line: 138, column: 20, scope: !11)
!67 = !DILocation(line: 138, column: 40, scope: !11)
!68 = !DILocation(line: 138, column: 16, scope: !11)
!69 = !DILocation(line: 138, column: 9, scope: !11)
!70 = !DILocation(line: 138, column: 47, scope: !11)
!71 = !DILocation(line: 138, column: 7, scope: !11)
!72 = !DILocation(line: 139, column: 9, scope: !73)
!73 = distinct !DILexicalBlock(scope: !11, file: !12, line: 139, column: 9)
!74 = !DILocation(line: 139, column: 13, scope: !73)
!75 = !DILocation(line: 139, column: 16, scope: !73)
!76 = !DILocation(line: 139, column: 11, scope: !73)
!77 = !DILocation(line: 139, column: 9, scope: !11)
!78 = !DILocation(line: 140, column: 9, scope: !73)
!79 = !DILocation(line: 140, column: 12, scope: !73)
!80 = !DILocation(line: 140, column: 14, scope: !73)
!81 = !DILocation(line: 141, column: 30, scope: !11)
!82 = !DILocation(line: 141, column: 34, scope: !11)
!83 = !DILocation(line: 141, column: 14, scope: !11)
!84 = !DILocation(line: 141, column: 5, scope: !11)
!85 = !DILocation(line: 141, column: 8, scope: !11)
!86 = !DILocation(line: 141, column: 11, scope: !11)
!87 = !DILocation(line: 143, column: 13, scope: !11)
!88 = !DILocation(line: 143, column: 5, scope: !11)
!89 = !DILocation(line: 143, column: 8, scope: !11)
!90 = !DILocation(line: 143, column: 11, scope: !11)
!91 = !DILocation(line: 145, column: 9, scope: !11)
!92 = !DILocation(line: 145, column: 12, scope: !11)
!93 = !DILocation(line: 145, column: 7, scope: !11)
!94 = !DILocation(line: 146, column: 9, scope: !95)
!95 = distinct !DILexicalBlock(scope: !11, file: !12, line: 146, column: 9)
!96 = !DILocation(line: 146, column: 11, scope: !95)
!97 = !DILocation(line: 146, column: 9, scope: !11)
!98 = !DILocation(line: 147, column: 30, scope: !99)
!99 = distinct !DILexicalBlock(scope: !95, file: !12, line: 146, column: 17)
