; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--cms--libcrypto-shlib-cms_pwri.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--cms--libcrypto-shlib-cms_pwri.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.CMS_RecipientInfo_st = type { i32, %union.anon }
%union.anon = type { %struct.CMS_KeyTransRecipientInfo_st* }
%struct.CMS_KeyTransRecipientInfo_st = type { i32, %struct.CMS_SignerIdentifier_st*, %struct.X509_algor_st*, %struct.asn1_string_st*, %struct.x509_st*, %struct.evp_pkey_st*, %struct.evp_pkey_ctx_st* }
%struct.CMS_SignerIdentifier_st = type { i32, %union.anon.0 }
%union.anon.0 = type { %struct.CMS_IssuerAndSerialNumber_st* }
%struct.CMS_IssuerAndSerialNumber_st = type { %struct.X509_name_st*, %struct.asn1_string_st* }
%struct.X509_name_st = type opaque
%struct.X509_algor_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_object_st = type { i8*, i8*, i32, i32, i8*, i32 }
%struct.asn1_type_st = type { i32, %union.anon.1 }
%union.anon.1 = type { i8* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.x509_st = type opaque
%struct.evp_pkey_st = type opaque
%struct.evp_pkey_ctx_st = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--cms--libcrypto-shlib-cms_pwri.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !6, !7, !219, !236, !240, !56, !215}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_RecipientInfo", file: !9, line: 28, baseType: !10)
!9 = !DIFile(filename: "include/openssl/cms.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_RecipientInfo_st", file: !11, line: 130, size: 128, align: 64, elements: !12)
!11 = !DIFile(filename: "crypto/cms/cms_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!12 = !{!13, !15}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !10, file: !11, line: 131, baseType: !14, size: 32, align: 32)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !10, file: !11, line: 138, baseType: !16, size: 64, align: 64, offset: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !10, file: !11, line: 132, size: 64, align: 64, elements: !17)
!17 = !{!18, !157, !191, !218, !229}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ktri", scope: !16, file: !11, line: 133, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_KeyTransRecipientInfo", file: !11, line: 34, baseType: !21)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_KeyTransRecipientInfo_st", file: !11, line: 143, size: 448, align: 64, elements: !22)
!22 = !{!23, !26, !62, !144, !145, !149, !153}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !21, file: !11, line: 144, baseType: !24, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !25, line: 196, baseType: !14)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "rid", scope: !21, file: !11, line: 145, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_RecipientIdentifier", file: !11, line: 141, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_SignerIdentifier", file: !11, line: 23, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_SignerIdentifier_st", file: !11, line: 97, size: 128, align: 64, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !30, file: !11, line: 98, baseType: !14, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !30, file: !11, line: 102, baseType: !34, size: 64, align: 64, offset: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !30, file: !11, line: 99, size: 64, align: 64, elements: !35)
!35 = !{!36, !59}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "issuerAndSerialNumber", scope: !34, file: !11, line: 100, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_IssuerAndSerialNumber", file: !11, line: 21, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_IssuerAndSerialNumber_st", file: !11, line: 308, size: 128, align: 64, elements: !40)
!40 = !{!41, !46}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !39, file: !11, line: 309, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !44, line: 129, baseType: !45)
!44 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !44, line: 129, flags: DIFlagFwdDecl)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "serialNumber", scope: !39, file: !11, line: 310, baseType: !47, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !44, line: 40, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !50, line: 146, size: 192, align: 64, elements: !51)
!50 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!51 = !{!52, !53, !54, !57}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !49, file: !50, line: 147, baseType: !14, size: 32, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !49, file: !50, line: 148, baseType: !14, size: 32, align: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !49, file: !50, line: 149, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !49, file: !50, line: 155, baseType: !58, size: 64, align: 64, offset: 128)
!58 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "subjectKeyIdentifier", scope: !34, file: !11, line: 101, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !44, line: 43, baseType: !49)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "keyEncryptionAlgorithm", scope: !21, file: !11, line: 146, baseType: !63, size: 64, align: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !44, line: 125, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !66, line: 59, size: 128, align: 64, elements: !67)
!66 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!67 = !{!68, !84}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !65, file: !66, line: 60, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !44, line: 60, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !72, line: 95, size: 320, align: 64, elements: !73)
!72 = !DIFile(filename: "crypto/include/internal/asn1_int.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!73 = !{!74, !77, !78, !79, !80, !83}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "sn", scope: !71, file: !72, line: 96, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ln", scope: !71, file: !72, line: 96, baseType: !75, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "nid", scope: !71, file: !72, line: 97, baseType: !14, size: 32, align: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !71, file: !72, line: 98, baseType: !14, size: 32, align: 32, offset: 160)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !71, file: !72, line: 99, baseType: !81, size: 64, align: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !71, file: !72, line: 100, baseType: !14, size: 32, align: 32, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !65, file: !66, line: 61, baseType: !85, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !50, line: 473, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !50, line: 444, size: 128, align: 64, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !50, line: 445, baseType: !14, size: 32, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !87, file: !50, line: 472, baseType: !91, size: 64, align: 64, offset: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !87, file: !50, line: 446, size: 64, align: 64, elements: !92)
!92 = !{!93, !94, !96, !99, !100, !101, !104, !107, !108, !111, !114, !117, !120, !123, !126, !129, !132, !135, !138, !139, !140}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !91, file: !50, line: 447, baseType: !4, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !91, file: !50, line: 448, baseType: !95, size: 32, align: 32)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !44, line: 56, baseType: !14)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !91, file: !50, line: 449, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !44, line: 55, baseType: !49)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !91, file: !50, line: 450, baseType: !69, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !91, file: !50, line: 451, baseType: !47, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !91, file: !50, line: 452, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !44, line: 41, baseType: !49)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !91, file: !50, line: 453, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !44, line: 42, baseType: !49)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !91, file: !50, line: 454, baseType: !60, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !91, file: !50, line: 455, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !44, line: 44, baseType: !49)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !91, file: !50, line: 456, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !44, line: 45, baseType: !49)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !91, file: !50, line: 457, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !44, line: 46, baseType: !49)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !91, file: !50, line: 458, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !44, line: 47, baseType: !49)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !91, file: !50, line: 459, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !44, line: 49, baseType: !49)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !91, file: !50, line: 460, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !44, line: 48, baseType: !49)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !91, file: !50, line: 461, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !44, line: 50, baseType: !49)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !91, file: !50, line: 462, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !44, line: 52, baseType: !49)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !91, file: !50, line: 463, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !44, line: 53, baseType: !49)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !91, file: !50, line: 464, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !44, line: 54, baseType: !49)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !91, file: !50, line: 469, baseType: !97, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !91, file: !50, line: 470, baseType: !97, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !91, file: !50, line: 471, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !50, line: 213, baseType: !143)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !50, line: 213, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedKey", scope: !21, file: !11, line: 147, baseType: !60, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "recip", scope: !21, file: !11, line: 149, baseType: !146, size: 64, align: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !44, line: 124, baseType: !148)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !44, line: 124, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !21, file: !11, line: 150, baseType: !150, size: 64, align: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !44, line: 95, baseType: !152)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !44, line: 95, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pctx", scope: !21, file: !11, line: 152, baseType: !154, size: 64, align: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY_CTX", file: !44, line: 100, baseType: !156)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_ctx_st", file: !44, line: 100, flags: DIFlagFwdDecl)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "kari", scope: !16, file: !11, line: 134, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_KeyAgreeRecipientInfo", file: !11, line: 37, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_KeyAgreeRecipientInfo_st", file: !11, line: 155, size: 448, align: 64, elements: !161)
!161 = !{!162, !163, !181, !182, !183, !186, !187}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !160, file: !11, line: 156, baseType: !24, size: 32, align: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "originator", scope: !160, file: !11, line: 157, baseType: !164, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_OriginatorIdentifierOrKey", file: !11, line: 36, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_OriginatorIdentifierOrKey_st", file: !11, line: 167, size: 128, align: 64, elements: !167)
!167 = !{!168, !169}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !166, file: !11, line: 168, baseType: !14, size: 32, align: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !166, file: !11, line: 173, baseType: !170, size: 64, align: 64, offset: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !11, line: 169, size: 64, align: 64, elements: !171)
!171 = !{!172, !173, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "issuerAndSerialNumber", scope: !170, file: !11, line: 170, baseType: !37, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "subjectKeyIdentifier", scope: !170, file: !11, line: 171, baseType: !60, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "originatorKey", scope: !170, file: !11, line: 172, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_OriginatorPublicKey", file: !11, line: 35, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_OriginatorPublicKey_st", file: !11, line: 176, size: 128, align: 64, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !177, file: !11, line: 177, baseType: !63, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "publicKey", scope: !177, file: !11, line: 178, baseType: !105, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ukm", scope: !160, file: !11, line: 158, baseType: !60, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "keyEncryptionAlgorithm", scope: !160, file: !11, line: 159, baseType: !63, size: 64, align: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "recipientEncryptedKeys", scope: !160, file: !11, line: 160, baseType: !184, size: 64, align: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CMS_RecipientEncryptedKey", file: !9, line: 35, flags: DIFlagFwdDecl)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pctx", scope: !160, file: !11, line: 162, baseType: !154, size: 64, align: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !160, file: !11, line: 164, baseType: !188, size: 64, align: 64, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER_CTX", file: !44, line: 90, baseType: !190)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_ctx_st", file: !44, line: 90, flags: DIFlagFwdDecl)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "kekri", scope: !16, file: !11, line: 135, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_KEKRecipientInfo", file: !11, line: 42, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_KEKRecipientInfo_st", file: !11, line: 202, size: 384, align: 64, elements: !195)
!195 = !{!196, !197, !211, !212, !213, !214}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !194, file: !11, line: 203, baseType: !24, size: 32, align: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "kekid", scope: !194, file: !11, line: 204, baseType: !198, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_KEKIdentifier", file: !11, line: 41, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_KEKIdentifier_st", file: !11, line: 212, size: 192, align: 64, elements: !201)
!201 = !{!202, !203, !204}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "keyIdentifier", scope: !200, file: !11, line: 213, baseType: !60, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !200, file: !11, line: 214, baseType: !130, size: 64, align: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !200, file: !11, line: 215, baseType: !205, size: 64, align: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_OtherKeyAttribute", file: !9, line: 32, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_OtherKeyAttribute_st", file: !11, line: 313, size: 128, align: 64, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "keyAttrId", scope: !207, file: !11, line: 314, baseType: !69, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "keyAttr", scope: !207, file: !11, line: 315, baseType: !85, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "keyEncryptionAlgorithm", scope: !194, file: !11, line: 205, baseType: !63, size: 64, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedKey", scope: !194, file: !11, line: 206, baseType: !60, size: 64, align: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !194, file: !11, line: 208, baseType: !55, size: 64, align: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !194, file: !11, line: 209, baseType: !215, size: 64, align: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !216, line: 216, baseType: !217)
!216 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!217 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pwri", scope: !16, file: !11, line: 136, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_PasswordRecipientInfo", file: !11, line: 43, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_PasswordRecipientInfo_st", file: !11, line: 218, size: 384, align: 64, elements: !222)
!222 = !{!223, !224, !225, !226, !227, !228}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !221, file: !11, line: 219, baseType: !24, size: 32, align: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "keyDerivationAlgorithm", scope: !221, file: !11, line: 220, baseType: !63, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "keyEncryptionAlgorithm", scope: !221, file: !11, line: 221, baseType: !63, size: 64, align: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedKey", scope: !221, file: !11, line: 222, baseType: !60, size: 64, align: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !221, file: !11, line: 224, baseType: !55, size: 64, align: 64, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "passlen", scope: !221, file: !11, line: 225, baseType: !215, size: 64, align: 64, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ori", scope: !16, file: !11, line: 137, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_OtherRecipientInfo", file: !11, line: 44, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_OtherRecipientInfo_st", file: !11, line: 228, size: 128, align: 64, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "oriType", scope: !232, file: !11, line: 229, baseType: !69, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "oriValue", scope: !232, file: !11, line: 230, baseType: !85, size: 64, align: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !238, line: 17, baseType: !239)
!238 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !238, line: 17, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!242 = !{i32 2, !"Dwarf Version", i32 4}
!243 = !{i32 2, !"Debug Info Version", i32 3}
!244 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!245 = distinct !DISubprogram(name: "CMS_RecipientInfo_set0_password", scope: !246, file: !246, line: 21, type: !247, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!246 = !DIFile(filename: "crypto/cms/cms_pwri.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!247 = !DISubroutineType(types: !248)
!248 = !{!14, !7, !55, !249}
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !25, line: 109, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !251, line: 172, baseType: !58)
!251 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!252 = !DILocalVariable(name: "ri", arg: 1, scope: !245, file: !246, line: 21, type: !7)
!253 = !DIExpression()
!254 = !DILocation(line: 21, column: 56, scope: !245)
!255 = !DILocalVariable(name: "pass", arg: 2, scope: !245, file: !246, line: 22, type: !55)
!256 = !DILocation(line: 22, column: 52, scope: !245)
!257 = !DILocalVariable(name: "passlen", arg: 3, scope: !245, file: !246, line: 22, type: !249)
!258 = !DILocation(line: 22, column: 66, scope: !245)
!259 = !DILocalVariable(name: "pwri", scope: !245, file: !246, line: 24, type: !219)
!260 = !DILocation(line: 24, column: 32, scope: !245)
!261 = !DILocation(line: 25, column: 9, scope: !262)
!262 = distinct !DILexicalBlock(scope: !245, file: !246, line: 25, column: 9)
!263 = !DILocation(line: 25, column: 13, scope: !262)
!264 = !DILocation(line: 25, column: 18, scope: !262)
!265 = !DILocation(line: 25, column: 9, scope: !245)
!266 = !DILocation(line: 26, column: 9, scope: !267)
!267 = distinct !DILexicalBlock(scope: !262, file: !246, line: 25, column: 24)
!268 = !DILocation(line: 27, column: 9, scope: !267)
!269 = !DILocation(line: 30, column: 12, scope: !245)
!270 = !DILocation(line: 30, column: 16, scope: !245)
!271 = !DILocation(line: 30, column: 18, scope: !245)
!272 = !DILocation(line: 30, column: 10, scope: !245)
!273 = !DILocation(line: 31, column: 18, scope: !245)
!274 = !DILocation(line: 31, column: 5, scope: !245)
!275 = !DILocation(line: 31, column: 11, scope: !245)
!276 = !DILocation(line: 31, column: 16, scope: !245)
!277 = !DILocation(line: 32, column: 9, scope: !278)
!278 = distinct !DILexicalBlock(scope: !245, file: !246, line: 32, column: 9)
!279 = !DILocation(line: 32, column: 14, scope: !278)
!280 = !DILocation(line: 32, column: 17, scope: !281)
!281 = !DILexicalBlockFile(scope: !278, file: !246, discriminator: 1)
!282 = !DILocation(line: 32, column: 25, scope: !281)
!283 = !DILocation(line: 32, column: 9, scope: !281)
!284 = !DILocation(line: 33, column: 34, scope: !278)
!285 = !DILocation(line: 33, column: 19, scope: !278)
!286 = !DILocation(line: 33, column: 17, scope: !278)
!287 = !DILocation(line: 33, column: 9, scope: !278)
!288 = !DILocation(line: 34, column: 21, scope: !245)
!289 = !DILocation(line: 34, column: 5, scope: !245)
!290 = !DILocation(line: 34, column: 11, scope: !245)
!291 = !DILocation(line: 34, column: 19, scope: !245)
!292 = !DILocation(line: 35, column: 5, scope: !245)
!293 = !DILocation(line: 36, column: 1, scope: !245)
!294 = distinct !DISubprogram(name: "CMS_add0_recipient_password", scope: !246, file: !246, line: 38, type: !295, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!295 = !DISubroutineType(types: !296)
!296 = !{!7, !297, !14, !14, !14, !55, !249, !357}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_ContentInfo", file: !9, line: 24, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_ContentInfo_st", file: !11, line: 47, size: 128, align: 64, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "contentType", scope: !299, file: !11, line: 48, baseType: !69, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !299, file: !11, line: 60, baseType: !303, size: 64, align: 64, offset: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !299, file: !11, line: 49, size: 64, align: 64, elements: !304)
!304 = !{!305, !306, !332, !367, !376, !384, !398, !407, !408}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !303, file: !11, line: 50, baseType: !60, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "signedData", scope: !303, file: !11, line: 51, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_SignedData", file: !11, line: 24, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_SignedData_st", file: !11, line: 65, size: 384, align: 64, elements: !310)
!310 = !{!311, !312, !315, !323, !326, !329}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !309, file: !11, line: 66, baseType: !24, size: 32, align: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "digestAlgorithms", scope: !309, file: !11, line: 67, baseType: !313, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ALGOR", file: !50, line: 119, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "encapContentInfo", scope: !309, file: !11, line: 68, baseType: !316, size: 64, align: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_EncapsulatedContentInfo", file: !11, line: 22, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_EncapsulatedContentInfo_st", file: !11, line: 74, size: 192, align: 64, elements: !319)
!319 = !{!320, !321, !322}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "eContentType", scope: !318, file: !11, line: 75, baseType: !69, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "eContent", scope: !318, file: !11, line: 76, baseType: !60, size: 64, align: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "partial", scope: !318, file: !11, line: 78, baseType: !14, size: 32, align: 32, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "certificates", scope: !309, file: !11, line: 69, baseType: !324, size: 64, align: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CMS_CertificateChoices", file: !11, line: 63, flags: DIFlagFwdDecl)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "crls", scope: !309, file: !11, line: 70, baseType: !327, size: 64, align: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CMS_RevocationInfoChoice", file: !9, line: 37, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "signerInfos", scope: !309, file: !11, line: 71, baseType: !330, size: 64, align: 64, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CMS_SignerInfo", file: !9, line: 34, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "envelopedData", scope: !303, file: !11, line: 52, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_EnvelopedData", file: !11, line: 28, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_EnvelopedData_st", file: !11, line: 105, size: 320, align: 64, elements: !336)
!336 = !{!337, !338, !345, !348, !364}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !335, file: !11, line: 106, baseType: !24, size: 32, align: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "originatorInfo", scope: !335, file: !11, line: 107, baseType: !339, size: 64, align: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_OriginatorInfo", file: !11, line: 26, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_OriginatorInfo_st", file: !11, line: 113, size: 128, align: 64, elements: !342)
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "certificates", scope: !341, file: !11, line: 114, baseType: !324, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "crls", scope: !341, file: !11, line: 115, baseType: !327, size: 64, align: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "recipientInfos", scope: !335, file: !11, line: 108, baseType: !346, size: 64, align: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CMS_RecipientInfo", file: !9, line: 36, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedContentInfo", scope: !335, file: !11, line: 109, baseType: !349, size: 64, align: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_EncryptedContentInfo", file: !11, line: 27, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_EncryptedContentInfo_st", file: !11, line: 118, size: 448, align: 64, elements: !352)
!352 = !{!353, !354, !355, !356, !361, !362, !363}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "contentType", scope: !351, file: !11, line: 119, baseType: !69, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "contentEncryptionAlgorithm", scope: !351, file: !11, line: 120, baseType: !63, size: 64, align: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedContent", scope: !351, file: !11, line: 121, baseType: !60, size: 64, align: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !351, file: !11, line: 123, baseType: !357, size: 64, align: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !44, line: 89, baseType: !360)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !44, line: 89, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !351, file: !11, line: 124, baseType: !55, size: 64, align: 64, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !351, file: !11, line: 125, baseType: !215, size: 64, align: 64, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !351, file: !11, line: 127, baseType: !14, size: 32, align: 32, offset: 384)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "unprotectedAttrs", scope: !335, file: !11, line: 110, baseType: !365, size: 64, align: 64, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ATTRIBUTE", file: !66, line: 89, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "digestedData", scope: !303, file: !11, line: 53, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_DigestedData", file: !11, line: 29, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_DigestedData_st", file: !11, line: 233, size: 256, align: 64, elements: !371)
!371 = !{!372, !373, !374, !375}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !370, file: !11, line: 234, baseType: !24, size: 32, align: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "digestAlgorithm", scope: !370, file: !11, line: 235, baseType: !63, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "encapContentInfo", scope: !370, file: !11, line: 236, baseType: !316, size: 64, align: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !370, file: !11, line: 237, baseType: !60, size: 64, align: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedData", scope: !303, file: !11, line: 54, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_EncryptedData", file: !11, line: 30, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_EncryptedData_st", file: !11, line: 240, size: 192, align: 64, elements: !380)
!380 = !{!381, !382, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !379, file: !11, line: 241, baseType: !24, size: 32, align: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedContentInfo", scope: !379, file: !11, line: 242, baseType: !349, size: 64, align: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "unprotectedAttrs", scope: !379, file: !11, line: 243, baseType: !365, size: 64, align: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "authenticatedData", scope: !303, file: !11, line: 55, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_AuthenticatedData", file: !11, line: 31, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_AuthenticatedData_st", file: !11, line: 246, size: 576, align: 64, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396, !397}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !387, file: !11, line: 247, baseType: !24, size: 32, align: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "originatorInfo", scope: !387, file: !11, line: 248, baseType: !339, size: 64, align: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "recipientInfos", scope: !387, file: !11, line: 249, baseType: !346, size: 64, align: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "macAlgorithm", scope: !387, file: !11, line: 250, baseType: !63, size: 64, align: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "digestAlgorithm", scope: !387, file: !11, line: 251, baseType: !63, size: 64, align: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "encapContentInfo", scope: !387, file: !11, line: 252, baseType: !316, size: 64, align: 64, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "authAttrs", scope: !387, file: !11, line: 253, baseType: !365, size: 64, align: 64, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !387, file: !11, line: 254, baseType: !60, size: 64, align: 64, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "unauthAttrs", scope: !387, file: !11, line: 255, baseType: !365, size: 64, align: 64, offset: 512)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "compressedData", scope: !303, file: !11, line: 56, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_CompressedData", file: !11, line: 32, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_CompressedData_st", file: !11, line: 258, size: 256, align: 64, elements: !402)
!402 = !{!403, !404, !405, !406}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !401, file: !11, line: 259, baseType: !24, size: 32, align: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "compressionAlgorithm", scope: !401, file: !11, line: 260, baseType: !63, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "recipientInfos", scope: !401, file: !11, line: 261, baseType: !346, size: 64, align: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "encapContentInfo", scope: !401, file: !11, line: 262, baseType: !316, size: 64, align: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !303, file: !11, line: 57, baseType: !85, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "otherData", scope: !303, file: !11, line: 59, baseType: !6, size: 64, align: 64)
!409 = !DILocalVariable(name: "cms", arg: 1, scope: !294, file: !246, line: 38, type: !297)
!410 = !DILocation(line: 38, column: 65, scope: !294)
!411 = !DILocalVariable(name: "iter", arg: 2, scope: !294, file: !246, line: 39, type: !14)
!412 = !DILocation(line: 39, column: 52, scope: !294)
!413 = !DILocalVariable(name: "wrap_nid", arg: 3, scope: !294, file: !246, line: 39, type: !14)
!414 = !DILocation(line: 39, column: 62, scope: !294)
!415 = !DILocalVariable(name: "pbe_nid", arg: 4, scope: !294, file: !246, line: 40, type: !14)
!416 = !DILocation(line: 40, column: 52, scope: !294)
!417 = !DILocalVariable(name: "pass", arg: 5, scope: !294, file: !246, line: 41, type: !55)
!418 = !DILocation(line: 41, column: 63, scope: !294)
!419 = !DILocalVariable(name: "passlen", arg: 6, scope: !294, file: !246, line: 42, type: !249)
!420 = !DILocation(line: 42, column: 56, scope: !294)
!421 = !DILocalVariable(name: "kekciph", arg: 7, scope: !294, file: !246, line: 43, type: !357)
!422 = !DILocation(line: 43, column: 66, scope: !294)
!423 = !DILocalVariable(name: "ri", scope: !294, file: !246, line: 45, type: !7)
!424 = !DILocation(line: 45, column: 24, scope: !294)
!425 = !DILocalVariable(name: "env", scope: !294, file: !246, line: 46, type: !333)
!426 = !DILocation(line: 46, column: 24, scope: !294)
!427 = !DILocalVariable(name: "pwri", scope: !294, file: !246, line: 47, type: !219)
!428 = !DILocation(line: 47, column: 32, scope: !294)
!429 = !DILocalVariable(name: "ctx", scope: !294, file: !246, line: 48, type: !188)
!430 = !DILocation(line: 48, column: 21, scope: !294)
!431 = !DILocalVariable(name: "encalg", scope: !294, file: !246, line: 49, type: !63)
!432 = !DILocation(line: 49, column: 17, scope: !294)
!433 = !DILocalVariable(name: "iv", scope: !294, file: !246, line: 50, type: !434)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 128, align: 8, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 16)
!437 = !DILocation(line: 50, column: 19, scope: !294)
!438 = !DILocalVariable(name: "ivlen", scope: !294, file: !246, line: 51, type: !14)
!439 = !DILocation(line: 51, column: 9, scope: !294)
!440 = !DILocation(line: 53, column: 30, scope: !294)
!441 = !DILocation(line: 53, column: 11, scope: !294)
!442 = !DILocation(line: 53, column: 9, scope: !294)
!443 = !DILocation(line: 54, column: 10, scope: !444)
!444 = distinct !DILexicalBlock(scope: !294, file: !246, line: 54, column: 9)
!445 = !DILocation(line: 54, column: 9, scope: !294)
!446 = !DILocation(line: 55, column: 9, scope: !444)
!447 = !DILocation(line: 57, column: 9, scope: !448)
!448 = distinct !DILexicalBlock(scope: !294, file: !246, line: 57, column: 9)
!449 = !DILocation(line: 57, column: 18, scope: !448)
!450 = !DILocation(line: 57, column: 9, scope: !294)
!451 = !DILocation(line: 58, column: 18, scope: !448)
!452 = !DILocation(line: 58, column: 9, scope: !448)
!453 = !DILocation(line: 60, column: 9, scope: !454)
!454 = distinct !DILexicalBlock(scope: !294, file: !246, line: 60, column: 9)
!455 = !DILocation(line: 60, column: 17, scope: !454)
!456 = !DILocation(line: 60, column: 9, scope: !294)
!457 = !DILocation(line: 61, column: 17, scope: !454)
!458 = !DILocation(line: 61, column: 9, scope: !454)
!459 = !DILocation(line: 64, column: 9, scope: !460)
!460 = distinct !DILexicalBlock(scope: !294, file: !246, line: 64, column: 9)
!461 = !DILocation(line: 64, column: 17, scope: !460)
!462 = !DILocation(line: 64, column: 9, scope: !294)
!463 = !DILocation(line: 65, column: 19, scope: !460)
!464 = !DILocation(line: 65, column: 24, scope: !460)
