; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--siphash--libcrypto-lib-siphash.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--siphash--libcrypto-lib-siphash.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.siphash_st = type { i64, i64, i64, i64, i64, i32, i32, i32, i32, [8 x i8] }

; Function Attrs: nounwind uwtable
define i64 @SipHash_ctx_size() #0 !dbg !16 {
entry:
  ret i64 64, !dbg !20
}

; Function Attrs: nounwind uwtable
define i64 @SipHash_hash_size(%struct.siphash_st* %ctx) #0 !dbg !21 {
entry:
  %ctx.addr = alloca %struct.siphash_st*, align 8
  store %struct.siphash_st* %ctx, %struct.siphash_st** %ctx.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.siphash_st** %ctx.addr, metadata !44, metadata !45), !dbg !46
  %0 = load %struct.siphash_st*, %struct.siphash_st** %ctx.addr, align 8, !dbg !47
  %hash_size = getelementptr inbounds %struct.siphash_st, %struct.siphash_st* %0, i32 0, i32 6, !dbg !48
  %1 = load i32, i32* %hash_size, align 4, !dbg !48
  %conv = sext i32 %1 to i64, !dbg !47
  ret i64 %conv, !dbg !49
}

; Function Attrs: nounwind readnone
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

; Function Attrs: nounwind uwtable
define i32 @SipHash_set_hash_size(%struct.siphash_st* %ctx, i64 %hash_size) #0 !dbg !50 {
entry:
  %retval = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--siphash--libcrypto-lib-siphash.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !7, !9, !11}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !5, line: 216, baseType: !6)
!5 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!6 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !8, line: 55, baseType: !6)
!8 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !8, line: 48, baseType: !10)
!10 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 51, baseType: !12)
!12 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!13 = !{i32 2, !"Dwarf Version", i32 4}
!14 = !{i32 2, !"Debug Info Version", i32 3}
!15 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!16 = distinct !DISubprogram(name: "SipHash_ctx_size", scope: !17, file: !17, line: 73, type: !18, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!17 = !DIFile(filename: "crypto/siphash/siphash.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!18 = !DISubroutineType(types: !19)
!19 = !{!4}
!20 = !DILocation(line: 75, column: 5, scope: !16)
!21 = distinct !DISubprogram(name: "SipHash_hash_size", scope: !17, file: !17, line: 78, type: !22, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!22 = !DISubroutineType(types: !23)
!23 = !{!4, !24}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIPHASH", file: !26, line: 17, baseType: !27)
!26 = !DIFile(filename: "crypto/include/internal/siphash.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "siphash_st", file: !28, line: 12, size: 512, align: 64, elements: !29)
!28 = !DIFile(filename: "crypto/siphash/siphash_local.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!29 = !{!30, !31, !32, !33, !34, !35, !36, !38, !39, !40}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "total_inlen", scope: !27, file: !28, line: 13, baseType: !7, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "v0", scope: !27, file: !28, line: 14, baseType: !7, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !27, file: !28, line: 15, baseType: !7, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !27, file: !28, line: 16, baseType: !7, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !27, file: !28, line: 17, baseType: !7, size: 64, align: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !27, file: !28, line: 18, baseType: !12, size: 32, align: 32, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size", scope: !27, file: !28, line: 19, baseType: !37, size: 32, align: 32, offset: 352)
!37 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "crounds", scope: !27, file: !28, line: 20, baseType: !37, size: 32, align: 32, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "drounds", scope: !27, file: !28, line: 21, baseType: !37, size: 32, align: 32, offset: 416)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "leavings", scope: !27, file: !28, line: 22, baseType: !41, size: 64, align: 8, offset: 448)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, align: 8, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 8)
!44 = !DILocalVariable(name: "ctx", arg: 1, scope: !21, file: !17, line: 78, type: !24)
!45 = !DIExpression()
!46 = !DILocation(line: 78, column: 35, scope: !21)
!47 = !DILocation(line: 80, column: 12, scope: !21)
!48 = !DILocation(line: 80, column: 17, scope: !21)
!49 = !DILocation(line: 80, column: 5, scope: !21)
!50 = distinct !DISubprogram(name: "SipHash_set_hash_size", scope: !17, file: !17, line: 90, type: !51, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!51 = !DISubroutineType(types: !52)
!52 = !{!37, !24, !4}
!53 = !DILocalVariable(name: "ctx", arg: 1, scope: !50, file: !17, line: 90, type: !24)
!54 = !DILocation(line: 90, column: 36, scope: !50)
!55 = !DILocalVariable(name: "hash_size", arg: 2, scope: !50, file: !17, line: 90, type: !4)
!56 = !DILocation(line: 90, column: 48, scope: !50)
!57 = !DILocation(line: 92, column: 42, scope: !50)
!58 = !DILocation(line: 92, column: 17, scope: !50)
!59 = !DILocation(line: 92, column: 15, scope: !50)
!60 = !DILocation(line: 93, column: 9, scope: !61)
!61 = distinct !DILexicalBlock(scope: !50, file: !17, line: 93, column: 9)
!62 = !DILocation(line: 93, column: 19, scope: !61)
!63 = !DILocation(line: 94, column: 9, scope: !61)
!64 = !DILocation(line: 94, column: 12, scope: !65)
!65 = !DILexicalBlockFile(scope: !61, file: !17, discriminator: 1)
!66 = !DILocation(line: 94, column: 22, scope: !65)
!67 = !DILocation(line: 93, column: 9, scope: !68)
!68 = !DILexicalBlockFile(scope: !50, file: !17, discriminator: 1)
!69 = !DILocation(line: 95, column: 9, scope: !61)
!70 = !DILocation(line: 103, column: 47, scope: !50)
!71 = !DILocation(line: 103, column: 52, scope: !50)
!72 = !DILocation(line: 103, column: 22, scope: !50)
!73 = !DILocation(line: 103, column: 5, scope: !50)
!74 = !DILocation(line: 103, column: 10, scope: !50)
!75 = !DILocation(line: 103, column: 20, scope: !50)
!76 = !DILocation(line: 106, column: 17, scope: !77)
!77 = distinct !DILexicalBlock(scope: !50, file: !17, line: 106, column: 9)
!78 = !DILocation(line: 106, column: 22, scope: !77)
!79 = !DILocation(line: 106, column: 9, scope: !77)
!80 = !DILocation(line: 106, column: 35, scope: !77)
!81 = !DILocation(line: 106, column: 32, scope: !77)
!82 = !DILocation(line: 106, column: 9, scope: !50)
!83 = !DILocation(line: 107, column: 9, scope: !84)
!84 = distinct !DILexicalBlock(scope: !77, file: !17, line: 106, column: 46)
!85 = !DILocation(line: 107, column: 14, scope: !84)
!86 = !DILocation(line: 107, column: 17, scope: !84)
!87 = !DILocation(line: 108, column: 26, scope: !84)
!88 = !DILocation(line: 108, column: 9, scope: !84)
!89 = !DILocation(line: 108, column: 14, scope: !84)
!90 = !DILocation(line: 108, column: 24, scope: !84)
!91 = !DILocation(line: 109, column: 5, scope: !84)
!92 = !DILocation(line: 110, column: 5, scope: !50)
!93 = !DILocation(line: 111, column: 1, scope: !50)
!94 = distinct !DISubprogram(name: "siphash_adjust_hash_size", scope: !17, file: !17, line: 83, type: !95, isLocal: true, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!95 = !DISubroutineType(types: !96)
!96 = !{!4, !4}
!97 = !DILocalVariable(name: "hash_size", arg: 1, scope: !94, file: !17, line: 83, type: !4)
!98 = !DILocation(line: 83, column: 47, scope: !94)
!99 = !DILocation(line: 85, column: 9, scope: !100)
!100 = distinct !DILexicalBlock(scope: !94, file: !17, line: 85, column: 9)
!101 = !DILocation(line: 85, column: 19, scope: !100)
!102 = !DILocation(line: 85, column: 9, scope: !94)
!103 = !DILocation(line: 86, column: 19, scope: !100)
!104 = !DILocation(line: 86, column: 9, scope: !100)
!105 = !DILocation(line: 87, column: 12, scope: !94)
