; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--store--libcrypto-shlib-store_register.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--store--libcrypto-shlib-store_register.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lhash_st_OSSL_STORE_LOADER = type { %union.lh_OSSL_STORE_LOADER_dummy }
%union.lh_OSSL_STORE_LOADER_dummy = type { i8* }
%struct.ossl_store_loader_st = type { i8*, %struct.engine_st*, %struct.ossl_store_loader_ctx_st* (%struct.ossl_store_loader_st*, i8*, %struct.ui_method_st*, i8*)*, i32 (%struct.ossl_store_loader_ctx_st*, i32, %struct.__va_list_tag*)*, i32 (%struct.ossl_store_loader_ctx_st*, i32)*, i32 (%struct.ossl_store_loader_ctx_st*, %struct.ossl_store_search_st*)*, %struct.ossl_store_info_st* (%struct.ossl_store_loader_ctx_st*, %struct.ui_method_st*, i8*)*, i32 (%struct.ossl_store_loader_ctx_st*)*, i32 (%struct.ossl_store_loader_ctx_st*)*, i32 (%struct.ossl_store_loader_ctx_st*)* }
%struct.ossl_store_loader_ctx_st = type opaque
%struct.ui_method_st = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.ossl_store_search_st = type { i32, %struct.X509_name_st*, %struct.asn1_string_st*, %struct.evp_md_st*, i8*, i64 }
%struct.X509_name_st = type opaque
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.evp_md_st = type opaque
%struct.ossl_store_info_st = type { i32, %union.anon }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !176)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--store--libcrypto-shlib-store_register.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !17, !24, !28, !169, !172}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st_OSSL_STORE_LOADER", file: !7, line: 113, size: 64, align: 64, elements: !8)
!7 = !DIFile(filename: "crypto/store/store_locl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !6, file: !7, line: 113, baseType: !10, size: 64, align: 64)
!10 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "lh_OSSL_STORE_LOADER_dummy", file: !7, line: 113, size: 64, align: 64, elements: !11)
!11 = !{!12, !13, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !10, file: !7, line: 113, baseType: !4, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !10, file: !7, line: 113, baseType: !14, size: 64, align: 64)
!14 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !10, file: !7, line: 113, baseType: !16, size: 32, align: 32)
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_LH_HASHFUNC", file: !18, line: 26, baseType: !19)
!18 = !DIFile(filename: "include/openssl/lhash.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!14, !22}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_LH_COMPFUNC", file: !18, line: 25, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{!16, !22, !22}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSSL_STORE_LOADER", file: !30, line: 212, baseType: !31)
!30 = !DIFile(filename: "include/openssl/store.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ossl_store_loader_st", file: !7, line: 101, size: 640, align: 64, elements: !32)
!32 = !{!33, !37, !42, !56, !69, !74, !113, !160, !165, !167}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "scheme", scope: !31, file: !7, line: 102, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !31, file: !7, line: 103, baseType: !38, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENGINE", file: !40, line: 150, baseType: !41)
!40 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "engine_st", file: !40, line: 150, flags: DIFlagFwdDecl)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !31, file: !7, line: 104, baseType: !43, size: 64, align: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSSL_STORE_open_fn", file: !30, line: 218, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !50, !34, !52, !4}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSSL_STORE_LOADER_CTX", file: !30, line: 217, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "ossl_store_loader_ctx_st", file: !30, line: 217, flags: DIFlagFwdDecl)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "UI_METHOD", file: !40, line: 148, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "ui_method_st", file: !40, line: 148, flags: DIFlagFwdDecl)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !31, file: !7, line: 105, baseType: !57, size: 64, align: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSSL_STORE_ctrl_fn", file: !30, line: 225, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!16, !47, !16, !61}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !63)
!63 = !{!64, !66, !67, !68}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !62, file: !1, baseType: !65, size: 32, align: 32)
!65 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !62, file: !1, baseType: !65, size: 32, align: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !62, file: !1, baseType: !4, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !62, file: !1, baseType: !4, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "expect", scope: !31, file: !7, line: 106, baseType: !70, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSSL_STORE_expect_fn", file: !30, line: 229, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!16, !47, !16}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !31, file: !7, line: 107, baseType: !75, size: 64, align: 64, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSSL_STORE_find_fn", file: !30, line: 232, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!16, !47, !79}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSSL_STORE_SEARCH", file: !40, line: 180, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ossl_store_search_st", file: !7, line: 69, size: 384, align: 64, elements: !82)
!82 = !{!83, !84, !88, !102, !107, !110}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "search_type", scope: !81, file: !7, line: 70, baseType: !16, size: 32, align: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !81, file: !7, line: 76, baseType: !85, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !40, line: 129, baseType: !87)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !40, line: 129, flags: DIFlagFwdDecl)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !81, file: !7, line: 79, baseType: !89, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !40, line: 40, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !93, line: 146, size: 192, align: 64, elements: !94)
!93 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!94 = !{!95, !96, !97, !100}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !92, file: !93, line: 147, baseType: !16, size: 32, align: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !92, file: !93, line: 148, baseType: !16, size: 32, align: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !92, file: !93, line: 149, baseType: !98, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !92, file: !93, line: 155, baseType: !101, size: 64, align: 64, offset: 128)
!101 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !81, file: !7, line: 82, baseType: !103, size: 64, align: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD", file: !40, line: 91, baseType: !106)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_md_st", file: !40, line: 91, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !81, file: !7, line: 88, baseType: !108, size: 64, align: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "stringlength", scope: !81, file: !7, line: 89, baseType: !111, size: 64, align: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !112, line: 216, baseType: !14)
!112 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!113 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !31, file: !7, line: 108, baseType: !114, size: 64, align: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSSL_STORE_load_fn", file: !30, line: 236, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !47, !52, !4}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSSL_STORE_INFO", file: !40, line: 179, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ossl_store_info_st", file: !7, line: 23, size: 192, align: 64, elements: !121)
!121 = !{!122, !123}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !120, file: !7, line: 24, baseType: !16, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_", scope: !120, file: !7, line: 42, baseType: !124, size: 128, align: 64, offset: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !120, file: !7, line: 25, size: 128, align: 64, elements: !125)
!125 = !{!126, !127, !142, !147, !151, !152, !156}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !124, file: !7, line: 26, baseType: !4, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "embedded", scope: !124, file: !7, line: 31, baseType: !128, size: 128, align: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !124, file: !7, line: 28, size: 128, align: 64, elements: !129)
!129 = !{!130, !141}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !128, file: !7, line: 29, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUF_MEM", file: !40, line: 87, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_mem_st", file: !134, line: 38, size: 256, align: 64, elements: !135)
!134 = !DIFile(filename: "include/openssl/buffer.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!135 = !{!136, !137, !139, !140}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !133, file: !134, line: 39, baseType: !111, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !133, file: !134, line: 40, baseType: !138, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !133, file: !134, line: 41, baseType: !111, size: 64, align: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !133, file: !134, line: 42, baseType: !14, size: 64, align: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pem_name", scope: !128, file: !7, line: 30, baseType: !138, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !124, file: !7, line: 36, baseType: !143, size: 128, align: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !124, file: !7, line: 33, size: 128, align: 64, elements: !144)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !7, line: 34, baseType: !138, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !143, file: !7, line: 35, baseType: !138, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !124, file: !7, line: 38, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !40, line: 95, baseType: !150)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !40, line: 95, flags: DIFlagFwdDecl)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !124, file: !7, line: 39, baseType: !148, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "x509", scope: !124, file: !7, line: 40, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !40, line: 124, baseType: !155)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !40, line: 124, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !124, file: !7, line: 41, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !40, line: 126, baseType: !159)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !40, line: 126, flags: DIFlagFwdDecl)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !31, file: !7, line: 109, baseType: !161, size: 64, align: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSSL_STORE_eof_fn", file: !30, line: 241, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!16, !47}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !31, file: !7, line: 110, baseType: !166, size: 64, align: 64, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSSL_STORE_error_fn", file: !30, line: 244, baseType: !162)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !31, file: !7, line: 111, baseType: !168, size: 64, align: 64, offset: 576)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSSL_STORE_close_fn", file: !30, line: 247, baseType: !162)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_LHASH", file: !18, line: 29, baseType: !171)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st", file: !18, line: 29, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_LH_DOALL_FUNCARG", file: !18, line: 28, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !4, !4}
!176 = !{!177, !182, !186, !187}
!177 = distinct !DIGlobalVariable(name: "registry_lock", scope: !0, file: !178, line: 18, type: !179, isLocal: true, isDefinition: true, variable: i8** @registry_lock)
!178 = !DIFile(filename: "crypto/store/store_register.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_RWLOCK", file: !181, line: 67, baseType: null)
!181 = !DIFile(filename: "include/openssl/crypto.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!182 = distinct !DIGlobalVariable(name: "registry_init", scope: !0, file: !178, line: 19, type: !183, isLocal: true, isDefinition: true, variable: i32* @registry_init)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_ONCE", file: !181, line: 429, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_once_t", file: !185, line: 168, baseType: !16)
!185 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!186 = distinct !DIGlobalVariable(name: "do_registry_init_ossl_ret_", scope: !0, file: !178, line: 21, type: !16, isLocal: true, isDefinition: true, variable: i32* @do_registry_init_ossl_ret_)
!187 = distinct !DIGlobalVariable(name: "loader_register", scope: !0, file: !178, line: 144, type: !5, isLocal: true, isDefinition: true, variable: %struct.lhash_st_OSSL_STORE_LOADER** @loader_register)
!188 = !{i32 2, !"Dwarf Version", i32 4}
!189 = !{i32 2, !"Debug Info Version", i32 3}
!190 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!191 = distinct !DISubprogram(name: "OSSL_STORE_LOADER_new", scope: !178, file: !178, line: 31, type: !192, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!192 = !DISubroutineType(types: !193)
!193 = !{!28, !38, !34}
!194 = !DILocalVariable(name: "e", arg: 1, scope: !191, file: !178, line: 31, type: !38)
!195 = !DIExpression()
!196 = !DILocation(line: 31, column: 50, scope: !191)
!197 = !DILocalVariable(name: "scheme", arg: 2, scope: !191, file: !178, line: 31, type: !34)
!198 = !DILocation(line: 31, column: 65, scope: !191)
!199 = !DILocalVariable(name: "res", scope: !191, file: !178, line: 33, type: !28)
!200 = !DILocation(line: 33, column: 24, scope: !191)
!201 = !DILocation(line: 41, column: 9, scope: !202)
!202 = distinct !DILexicalBlock(scope: !191, file: !178, line: 41, column: 9)
!203 = !DILocation(line: 41, column: 16, scope: !202)
!204 = !DILocation(line: 41, column: 9, scope: !191)
!205 = !DILocation(line: 42, column: 9, scope: !206)
!206 = distinct !DILexicalBlock(scope: !202, file: !178, line: 41, column: 24)
!207 = !DILocation(line: 44, column: 9, scope: !206)
!208 = !DILocation(line: 47, column: 16, scope: !209)
!209 = distinct !DILexicalBlock(scope: !191, file: !178, line: 47, column: 9)
!210 = !DILocation(line: 47, column: 14, scope: !209)
!211 = !DILocation(line: 47, column: 82, scope: !209)
!212 = !DILocation(line: 47, column: 9, scope: !191)
!213 = !DILocation(line: 48, column: 9, scope: !214)
