; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-shlib-v3_extku.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-shlib-v3_extku.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.v3_ext_method = type { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, {}*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }
%struct.stack_st_CONF_VALUE = type opaque
%struct.v3_ext_ctx = type { i32, %struct.x509_st*, %struct.x509_st*, %struct.X509_req_st*, %struct.X509_crl_st*, %struct.X509V3_CONF_METHOD_st*, i8* }
%struct.x509_st = type opaque
%struct.X509_req_st = type opaque
%struct.X509_crl_st = type opaque
%struct.X509V3_CONF_METHOD_st = type { i8* (i8*, i8*, i8*)*, %struct.stack_st_CONF_VALUE* (i8*, i8*)*, void (i8*, i8*)*, void (i8*, %struct.stack_st_CONF_VALUE*)* }
%struct.bio_st = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !46)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-shlib-v3_extku.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !9, !10, !13, !18, !22, !23, !24, !31, !32, !42, !29}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTENDED_KEY_USAGE", file: !6, line: 162, baseType: !7)
!6 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ASN1_OBJECT", file: !8, line: 536, flags: DIFlagFwdDecl)
!8 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !8, line: 213, baseType: !12)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !8, line: 213, flags: DIFlagFwdDecl)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !16, line: 17, baseType: !17)
!16 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !16, line: 17, flags: DIFlagFwdDecl)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !20, line: 60, baseType: !21)
!20 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !20, line: 60, flags: DIFlagFwdDecl)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_compfunc", file: !16, line: 19, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !29, !29}
!28 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_VALUE", file: !34, line: 28, baseType: !35)
!34 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 24, size: 192, align: 64, elements: !36)
!36 = !{!37, !40, !41}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !35, file: !34, line: 25, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !35, file: !34, line: 26, baseType: !38, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !35, file: !34, line: 27, baseType: !38, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !16, line: 20, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !22}
!46 = !{!47, !182, !183, !184}
!47 = distinct !DIGlobalVariable(name: "v3_ext_ku", scope: !0, file: !48, line: 24, type: !49, isLocal: false, isDefinition: true, variable: { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, i8* (%struct.v3_ext_method*, i8*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }* @v3_ext_ku)
!48 = !DIFile(filename: "crypto/x509v3/v3_extku.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_METHOD", file: !6, line: 92, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_method", file: !6, line: 49, size: 832, align: 64, elements: !52)
!52 = !{!53, !54, !55, !84, !89, !91, !100, !107, !114, !161, !166, !171, !179, !181}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ext_nid", scope: !51, file: !6, line: 50, baseType: !28, size: 32, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !51, file: !6, line: 51, baseType: !28, size: 32, align: 32, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !51, file: !6, line: 53, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !8, line: 318, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !20, line: 62, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !61, line: 580, size: 448, align: 64, elements: !62)
!61 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!62 = !{!63, !64, !66, !80, !81, !82, !83}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !60, file: !61, line: 581, baseType: !39, size: 8, align: 8)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !60, file: !61, line: 583, baseType: !65, size: 64, align: 64, offset: 64)
!65 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !60, file: !61, line: 584, baseType: !67, size: 64, align: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !8, line: 210, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !61, line: 468, size: 320, align: 64, elements: !71)
!71 = !{!72, !74, !75, !76, !79}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !70, file: !61, line: 469, baseType: !73, size: 64, align: 64)
!73 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !70, file: !61, line: 470, baseType: !65, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !70, file: !61, line: 471, baseType: !73, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !70, file: !61, line: 472, baseType: !77, size: 64, align: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !70, file: !61, line: 473, baseType: !56, size: 64, align: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !60, file: !61, line: 586, baseType: !65, size: 64, align: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !60, file: !61, line: 587, baseType: !29, size: 64, align: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !60, file: !61, line: 588, baseType: !65, size: 64, align: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !60, file: !61, line: 589, baseType: !77, size: 64, align: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ext_new", scope: !51, file: !6, line: 55, baseType: !85, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_NEW", file: !6, line: 28, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!22}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ext_free", scope: !51, file: !6, line: 56, baseType: !90, size: 64, align: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_FREE", file: !6, line: 29, baseType: !43)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "d2i", scope: !51, file: !6, line: 57, baseType: !92, size: 64, align: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_D2I", file: !6, line: 30, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!22, !22, !96, !65}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!99 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i2d", scope: !51, file: !6, line: 58, baseType: !101, size: 64, align: 64, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2D", file: !6, line: 31, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!28, !22, !105}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i2s", scope: !51, file: !6, line: 60, baseType: !108, size: 64, align: 64, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2S", file: !6, line: 38, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!38, !112, !22}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "s2i", scope: !51, file: !6, line: 61, baseType: !115, size: 64, align: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_S2I", file: !6, line: 40, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!22, !112, !119, !77}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_ctx", file: !6, line: 79, size: 448, align: 64, elements: !121)
!121 = !{!122, !123, !127, !128, !133, !137, !160}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !120, file: !6, line: 82, baseType: !28, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_cert", scope: !120, file: !6, line: 83, baseType: !124, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !20, line: 124, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !20, line: 124, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "subject_cert", scope: !120, file: !6, line: 84, baseType: !124, size: 64, align: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "subject_req", scope: !120, file: !6, line: 85, baseType: !129, size: 64, align: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_REQ", file: !131, line: 93, baseType: !132)
!131 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_req_st", file: !131, line: 93, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !120, file: !6, line: 86, baseType: !134, size: 64, align: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !20, line: 126, baseType: !136)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !20, line: 126, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "db_meth", scope: !120, file: !6, line: 87, baseType: !138, size: 64, align: 64, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CONF_METHOD", file: !6, line: 76, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509V3_CONF_METHOD_st", file: !6, line: 71, size: 256, align: 64, elements: !141)
!141 = !{!142, !146, !152, !156}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "get_string", scope: !140, file: !6, line: 72, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!38, !22, !77, !77}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "get_section", scope: !140, file: !6, line: 73, baseType: !147, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!150, !22, !77}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !34, line: 30, flags: DIFlagFwdDecl)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "free_string", scope: !140, file: !6, line: 74, baseType: !153, size: 64, align: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !22, !38}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "free_section", scope: !140, file: !6, line: 75, baseType: !157, size: 64, align: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !22, !150}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !120, file: !6, line: 88, baseType: !22, size: 64, align: 64, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i2v", scope: !51, file: !6, line: 63, baseType: !162, size: 64, align: 64, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2V", file: !6, line: 33, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!150, !112, !22, !150}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "v2i", scope: !51, file: !6, line: 64, baseType: !167, size: 64, align: 64, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_V2I", file: !6, line: 35, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!22, !112, !119, !150}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i2r", scope: !51, file: !6, line: 66, baseType: !172, size: 64, align: 64, offset: 640)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2R", file: !6, line: 42, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!28, !112, !22, !176, !28}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !20, line: 79, baseType: !178)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !20, line: 79, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "r2i", scope: !51, file: !6, line: 67, baseType: !180, size: 64, align: 64, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_R2I", file: !6, line: 44, baseType: !116)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "usr_data", scope: !51, file: !6, line: 68, baseType: !22, size: 64, align: 64, offset: 768)
!182 = distinct !DIGlobalVariable(name: "v3_ocsp_accresp", scope: !0, file: !48, line: 36, type: !49, isLocal: false, isDefinition: true, variable: { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, i8* (%struct.v3_ext_method*, i8*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }* @v3_ocsp_accresp)
!183 = distinct !DIGlobalVariable(name: "EXTENDED_KEY_USAGE_it", scope: !0, file: !48, line: 49, type: !58, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @EXTENDED_KEY_USAGE_it)
!184 = distinct !DIGlobalVariable(name: "EXTENDED_KEY_USAGE_item_tt", scope: !0, file: !48, line: 47, type: !68, isLocal: true, isDefinition: true, variable: %struct.ASN1_TEMPLATE_st* @EXTENDED_KEY_USAGE_item_tt)
!185 = !{i32 2, !"Dwarf Version", i32 4}
!186 = !{i32 2, !"Debug Info Version", i32 3}
!187 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!188 = distinct !DISubprogram(name: "i2v_EXTENDED_KEY_USAGE", scope: !48, file: !48, line: 53, type: !189, isLocal: true, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!189 = !DISubroutineType(types: !190)
!190 = !{!150, !191, !22, !150}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!192 = !DILocalVariable(name: "method", arg: 1, scope: !188, file: !48, line: 54, type: !191)
!193 = !DIExpression()
!194 = !DILocation(line: 54, column: 54, scope: !188)
!195 = !DILocalVariable(name: "a", arg: 2, scope: !188, file: !48, line: 54, type: !22)
!196 = !DILocation(line: 54, column: 68, scope: !188)
!197 = !DILocalVariable(name: "ext_list", arg: 3, scope: !188, file: !48, line: 55, type: !150)
!198 = !DILocation(line: 55, column: 54, scope: !188)
!199 = !DILocalVariable(name: "eku", scope: !188, file: !48, line: 57, type: !4)
!200 = !DILocation(line: 57, column: 25, scope: !188)
!201 = !DILocation(line: 57, column: 31, scope: !188)
!202 = !DILocalVariable(name: "i", scope: !188, file: !48, line: 58, type: !28)
!203 = !DILocation(line: 58, column: 9, scope: !188)
!204 = !DILocalVariable(name: "obj", scope: !188, file: !48, line: 59, type: !18)
!205 = !DILocation(line: 59, column: 18, scope: !188)
!206 = !DILocalVariable(name: "obj_tmp", scope: !188, file: !48, line: 60, type: !207)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 640, align: 8, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 80)
!210 = !DILocation(line: 60, column: 10, scope: !188)
!211 = !DILocation(line: 61, column: 12, scope: !212)
!212 = distinct !DILexicalBlock(scope: !188, file: !48, line: 61, column: 5)
!213 = !DILocation(line: 61, column: 10, scope: !212)
!214 = !DILocation(line: 61, column: 17, scope: !215)
!215 = !DILexicalBlockFile(scope: !216, file: !48, discriminator: 1)
!216 = distinct !DILexicalBlock(scope: !212, file: !48, line: 61, column: 5)
!217 = !DILocation(line: 61, column: 40, scope: !215)
!218 = !DILocation(line: 61, column: 21, scope: !215)
!219 = !DILocation(line: 61, column: 19, scope: !215)
!220 = !DILocation(line: 61, column: 5, scope: !215)
!221 = !DILocation(line: 62, column: 36, scope: !222)
!222 = distinct !DILexicalBlock(scope: !216, file: !48, line: 61, column: 51)
!223 = !DILocation(line: 62, column: 41, scope: !222)
!224 = !DILocation(line: 62, column: 15, scope: !222)
!225 = !DILocation(line: 62, column: 13, scope: !222)
!226 = !DILocation(line: 63, column: 25, scope: !222)
!227 = !DILocation(line: 63, column: 38, scope: !222)
!228 = !DILocation(line: 63, column: 9, scope: !222)
