; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--conf_include_test-bin-conf_include_test.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--conf_include_test-bin-conf_include_test.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.options_st = type { i8*, i32, i32, i8* }
%struct.conf_st = type { %struct.conf_method_st*, i8*, %struct.lhash_st_CONF_VALUE* }
%struct.conf_method_st = type { i8*, {}*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*, %struct.bio_st*, i64*)*, i32 (%struct.conf_st*, %struct.bio_st*)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8*, i64*)* }
%struct.bio_st = type opaque
%struct.lhash_st_CONF_VALUE = type { %union.lh_CONF_VALUE_dummy }
%union.lh_CONF_VALUE_dummy = type { i8* }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15, globals: !17)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]test--conf_include_test-bin-conf_include_test.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OPTION_choice", file: !4, line: 181, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "test/conf_include_test.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "OPT_ERR", value: -1)
!7 = !DIEnumerator(name: "OPT_EOF", value: 0)
!8 = !DIEnumerator(name: "OPT_FAIL", value: 1)
!9 = !DIEnumerator(name: "OPT_TEST_HELP", value: 500)
!10 = !DIEnumerator(name: "OPT_TEST_LIST", value: 501)
!11 = !DIEnumerator(name: "OPT_TEST_SINGLE", value: 502)
!12 = !DIEnumerator(name: "OPT_TEST_ITERATION", value: 503)
!13 = !DIEnumerator(name: "OPT_TEST_INDENT", value: 504)
!14 = !DIEnumerator(name: "OPT_TEST_SEED", value: 505)
!15 = !{!16}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !{!18, !40, !99, !100}
!18 = distinct !DIGlobalVariable(name: "test_options", scope: !19, file: !4, line: 190, type: !37, isLocal: true, isDefinition: true, variable: [10 x %struct.options_st]* @test_get_options.test_options)
!19 = distinct !DISubprogram(name: "test_get_options", scope: !4, file: !4, line: 188, type: !20, isLocal: false, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !36)
!20 = !DISubroutineType(types: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPTIONS", file: !25, line: 280, baseType: !26)
!25 = !DIFile(filename: "apps/include/opt.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "options_st", file: !25, line: 269, size: 192, align: 64, elements: !27)
!27 = !{!28, !32, !34, !35}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !26, file: !25, line: 270, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !26, file: !25, line: 271, baseType: !33, size: 32, align: 32, offset: 64)
!33 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "valtype", scope: !26, file: !25, line: 278, baseType: !33, size: 32, align: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "helpstr", scope: !26, file: !25, line: 279, baseType: !29, size: 64, align: 64, offset: 128)
!36 = !{}
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1920, align: 64, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 10)
!40 = distinct !DIGlobalVariable(name: "conf", scope: !0, file: !4, line: 65, type: !41, isLocal: true, isDefinition: true, variable: %struct.conf_st** @conf)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF", file: !43, line: 144, baseType: !44)
!43 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_st", file: !45, line: 103, size: 192, align: 64, elements: !46)
!45 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!46 = !{!47, !87, !88}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !44, file: !45, line: 104, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_METHOD", file: !45, line: 35, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_method_st", file: !45, line: 37, size: 640, align: 64, elements: !51)
!51 = !{!52, !53, !57, !61, !62, !63, !72, !78, !82, !83}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !50, file: !45, line: 38, baseType: !29, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !50, file: !45, line: 39, baseType: !54, size: 64, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!41, !48}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !50, file: !45, line: 40, baseType: !58, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!33, !41}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !50, file: !45, line: 41, baseType: !58, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_data", scope: !50, file: !45, line: 42, baseType: !58, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "load_bio", scope: !50, file: !45, line: 43, baseType: !64, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!33, !41, !67, !70}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !43, line: 79, baseType: !69)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !43, line: 79, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !50, file: !45, line: 44, baseType: !73, size: 64, align: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!33, !76, !67}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "is_number", scope: !50, file: !45, line: 45, baseType: !79, size: 64, align: 64, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!33, !76, !31}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "to_int", scope: !50, file: !45, line: 46, baseType: !79, size: 64, align: 64, offset: 512)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !50, file: !45, line: 47, baseType: !84, size: 64, align: 64, offset: 576)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!33, !41, !29, !70}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "meth_data", scope: !44, file: !45, line: 105, baseType: !16, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !44, file: !45, line: 106, baseType: !89, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st_CONF_VALUE", file: !45, line: 31, size: 64, align: 64, elements: !91)
!91 = !{!92}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !90, file: !45, line: 31, baseType: !93, size: 64, align: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "lh_CONF_VALUE_dummy", file: !45, line: 31, size: 64, align: 64, elements: !94)
!94 = !{!95, !96, !98}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !93, file: !45, line: 31, baseType: !16, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !93, file: !45, line: 31, baseType: !97, size: 64, align: 64)
!97 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !93, file: !45, line: 31, baseType: !33, size: 32, align: 32)
!99 = distinct !DIGlobalVariable(name: "in", scope: !0, file: !4, line: 66, type: !67, isLocal: true, isDefinition: true, variable: %struct.bio_st** @in)
!100 = distinct !DIGlobalVariable(name: "expect_failure", scope: !0, file: !4, line: 67, type: !33, isLocal: true, isDefinition: true, variable: i32* @expect_failure)
!101 = !{i32 2, !"Dwarf Version", i32 4}
!102 = !{i32 2, !"Debug Info Version", i32 3}
!103 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!104 = !DILocation(line: 195, column: 5, scope: !19)
!105 = distinct !DISubprogram(name: "setup_tests", scope: !4, file: !4, line: 198, type: !106, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !36)
!106 = !DISubroutineType(types: !107)
!107 = !{!33}
!108 = !DILocalVariable(name: "conf_file", scope: !105, file: !4, line: 200, type: !29)
!109 = !DIExpression()
!110 = !DILocation(line: 200, column: 17, scope: !105)
!111 = !DILocalVariable(name: "o", scope: !105, file: !4, line: 201, type: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPTION_CHOICE", file: !4, line: 186, baseType: !3)
!113 = !DILocation(line: 201, column: 19, scope: !105)
!114 = !DILocation(line: 203, column: 85, scope: !115)
!115 = distinct !DILexicalBlock(scope: !105, file: !4, line: 203, column: 9)
!116 = !DILocation(line: 203, column: 83, scope: !115)
!117 = !DILocation(line: 203, column: 78, scope: !115)
!118 = !DILocation(line: 203, column: 10, scope: !119)
!119 = !DILexicalBlockFile(scope: !115, file: !4, discriminator: 1)
!120 = !DILocation(line: 203, column: 10, scope: !115)
!121 = !DILocation(line: 203, column: 9, scope: !105)
!122 = !DILocation(line: 204, column: 9, scope: !115)
!123 = !DILocation(line: 206, column: 5, scope: !105)
!124 = !DILocation(line: 206, column: 17, scope: !125)
!125 = !DILexicalBlockFile(scope: !105, file: !4, discriminator: 1)
!126 = !DILocation(line: 206, column: 15, scope: !125)
!127 = !DILocation(line: 206, column: 29, scope: !125)
!128 = !DILocation(line: 206, column: 5, scope: !125)
!129 = !DILocation(line: 207, column: 17, scope: !130)
!130 = distinct !DILexicalBlock(scope: !105, file: !4, line: 206, column: 41)
!131 = !DILocation(line: 207, column: 9, scope: !130)
!132 = !DILocation(line: 209, column: 28, scope: !133)
!133 = distinct !DILexicalBlock(scope: !130, file: !4, line: 207, column: 20)
!134 = !DILocation(line: 210, column: 13, scope: !133)
!135 = !DILocation(line: 212, column: 13, scope: !133)
!136 = !DILocation(line: 214, column: 13, scope: !133)
!137 = !DILocation(line: 206, column: 5, scope: !138)
!138 = !DILexicalBlockFile(scope: !105, file: !4, discriminator: 2)
!139 = distinct !{!139, !123}
!140 = !DILocation(line: 218, column: 17, scope: !105)
!141 = !DILocation(line: 218, column: 15, scope: !105)
!142 = !DILocation(line: 219, column: 65, scope: !143)
