; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--ct--libcrypto-lib-ct_vfy.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--ct--libcrypto-lib-ct_vfy.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sct_ctx_st = type { %struct.evp_pkey_st*, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i64 }
%struct.evp_pkey_st = type opaque
%struct.sct_st = type { i32, i8*, i64, i8*, i64, i64, i8*, i64, i8, i8, i8*, i64, i32, i32, i32 }
%struct.evp_md_ctx_st = type opaque
%struct.evp_md_st = type opaque
%struct.evp_pkey_ctx_st = type opaque
%struct.engine_st = type opaque

@.str = private unnamed_addr constant [19 x i8] c"crypto/ct/ct_vfy.c\00", align 1

; Function Attrs: nounwind uwtable
define i32 @SCT_CTX_verify(%struct.sct_ctx_st* %sctx, %struct.sct_st* %sct) #0 !dbg !39 {
entry:
  %retval = alloca i32, align 4
  %sctx.addr = alloca %struct.sct_ctx_st*, align 8
  %sct.addr = alloca %struct.sct_st*, align 8
  %ctx = alloca %struct.evp_md_ctx_st*, align 8
  %ret = alloca i32, align 4
  store %struct.sct_ctx_st* %sctx, %struct.sct_ctx_st** %sctx.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.sct_ctx_st** %sctx.addr, metadata !94, metadata !95), !dbg !96
  store %struct.sct_st* %sct, %struct.sct_st** %sct.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.sct_st** %sct.addr, metadata !97, metadata !95), !dbg !98

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !33)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--ct--libcrypto-lib-ct_vfy.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{!3, !8, !13, !19, !27}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 37, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "include/openssl/ct.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "SCT_VERSION_NOT_SET", value: -1)
!7 = !DIEnumerator(name: "SCT_VERSION_V1", value: 0)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 31, size: 32, align: 32, elements: !9)
!9 = !{!10, !11, !12}
!10 = !DIEnumerator(name: "CT_LOG_ENTRY_TYPE_NOT_SET", value: -1)
!11 = !DIEnumerator(name: "CT_LOG_ENTRY_TYPE_X509", value: 0)
!12 = !DIEnumerator(name: "CT_LOG_ENTRY_TYPE_PRECERT", value: 1)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 42, size: 32, align: 32, elements: !14)
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "SCT_SOURCE_UNKNOWN", value: 0)
!16 = !DIEnumerator(name: "SCT_SOURCE_TLS_EXTENSION", value: 1)
!17 = !DIEnumerator(name: "SCT_SOURCE_X509V3_EXTENSION", value: 2)
!18 = !DIEnumerator(name: "SCT_SOURCE_OCSP_STAPLED_RESPONSE", value: 3)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 49, size: 32, align: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26}
!21 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_NOT_SET", value: 0)
!22 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_UNKNOWN_LOG", value: 1)
!23 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_VALID", value: 2)
!24 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_INVALID", value: 3)
!25 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_UNVERIFIED", value: 4)
!26 = !DIEnumerator(name: "SCT_VALIDATION_STATUS_UNKNOWN_VERSION", value: 5)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sct_signature_type_t", file: !28, line: 19, size: 32, align: 32, elements: !29)
!28 = !DIFile(filename: "crypto/ct/ct_vfy.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!29 = !{!30, !31, !32}
!30 = !DIEnumerator(name: "SIGNATURE_TYPE_NOT_SET", value: -1)
!31 = !DIEnumerator(name: "SIGNATURE_TYPE_CERT_TIMESTAMP", value: 0)
!32 = !DIEnumerator(name: "SIGNATURE_TYPE_TREE_HASH", value: 1)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!35 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!36 = !{i32 2, !"Dwarf Version", i32 4}
!37 = !{i32 2, !"Debug Info Version", i32 3}
!38 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!39 = distinct !DISubprogram(name: "SCT_CTX_verify", scope: !28, file: !28, line: 96, type: !40, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !93)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !43, !69}
!42 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCT_CTX", file: !46, line: 174, baseType: !47)
!46 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sct_ctx_st", file: !48, line: 86, size: 640, align: 64, elements: !49)
!48 = !DIFile(filename: "crypto/ct/ct_locl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!49 = !{!50, !54, !56, !60, !61, !62, !63, !64, !65, !66}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !47, file: !48, line: 88, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !46, line: 95, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !46, line: 95, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "pkeyhash", scope: !47, file: !48, line: 90, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pkeyhashlen", scope: !47, file: !48, line: 91, baseType: !57, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !58, line: 216, baseType: !59)
!58 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!59 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ihash", scope: !47, file: !48, line: 93, baseType: !55, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ihashlen", scope: !47, file: !48, line: 94, baseType: !57, size: 64, align: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "certder", scope: !47, file: !48, line: 96, baseType: !55, size: 64, align: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "certderlen", scope: !47, file: !48, line: 97, baseType: !57, size: 64, align: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "preder", scope: !47, file: !48, line: 99, baseType: !55, size: 64, align: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "prederlen", scope: !47, file: !48, line: 100, baseType: !57, size: 64, align: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "epoch_time_in_ms", scope: !47, file: !48, line: 102, baseType: !67, size: 64, align: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !68, line: 55, baseType: !59)
!68 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCT", file: !46, line: 173, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sct_st", file: !48, line: 57, size: 832, align: 64, elements: !73)
!73 = !{!74, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !89, !91}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !72, file: !48, line: 58, baseType: !75, size: 32, align: 32)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "sct_version_t", file: !4, line: 40, baseType: !3)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "sct", scope: !72, file: !48, line: 60, baseType: !55, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "sct_len", scope: !72, file: !48, line: 61, baseType: !57, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "log_id", scope: !72, file: !48, line: 63, baseType: !55, size: 64, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "log_id_len", scope: !72, file: !48, line: 64, baseType: !57, size: 64, align: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !72, file: !48, line: 70, baseType: !67, size: 64, align: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !72, file: !48, line: 71, baseType: !55, size: 64, align: 64, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ext_len", scope: !72, file: !48, line: 72, baseType: !57, size: 64, align: 64, offset: 448)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "hash_alg", scope: !72, file: !48, line: 73, baseType: !35, size: 8, align: 8, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "sig_alg", scope: !72, file: !48, line: 74, baseType: !35, size: 8, align: 8, offset: 520)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !72, file: !48, line: 75, baseType: !55, size: 64, align: 64, offset: 576)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "sig_len", scope: !72, file: !48, line: 76, baseType: !57, size: 64, align: 64, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "entry_type", scope: !72, file: !48, line: 78, baseType: !88, size: 32, align: 32, offset: 704)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ct_log_entry_type_t", file: !4, line: 35, baseType: !8)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !72, file: !48, line: 80, baseType: !90, size: 32, align: 32, offset: 736)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "sct_source_t", file: !4, line: 47, baseType: !13)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "validation_status", scope: !72, file: !48, line: 82, baseType: !92, size: 32, align: 32, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "sct_validation_status_t", file: !4, line: 56, baseType: !19)
!93 = !{}
!94 = !DILocalVariable(name: "sctx", arg: 1, scope: !39, file: !28, line: 96, type: !43)
!95 = !DIExpression()
!96 = !DILocation(line: 96, column: 35, scope: !39)
!97 = !DILocalVariable(name: "sct", arg: 2, scope: !39, file: !28, line: 96, type: !69)
!98 = !DILocation(line: 96, column: 52, scope: !39)
!99 = !DILocalVariable(name: "ctx", scope: !39, file: !28, line: 98, type: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD_CTX", file: !46, line: 92, baseType: !102)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_md_ctx_st", file: !46, line: 92, flags: DIFlagFwdDecl)
!103 = !DILocation(line: 98, column: 17, scope: !39)
!104 = !DILocalVariable(name: "ret", scope: !39, file: !28, line: 99, type: !42)
!105 = !DILocation(line: 99, column: 9, scope: !39)
!106 = !DILocation(line: 101, column: 26, scope: !107)
!107 = distinct !DILexicalBlock(scope: !39, file: !28, line: 101, column: 9)
!108 = !DILocation(line: 101, column: 10, scope: !107)
!109 = !DILocation(line: 101, column: 31, scope: !107)
!110 = !DILocation(line: 101, column: 34, scope: !111)
!111 = !DILexicalBlockFile(scope: !107, file: !28, discriminator: 1)
!112 = !DILocation(line: 101, column: 40, scope: !111)
!113 = !DILocation(line: 101, column: 45, scope: !111)
!114 = !DILocation(line: 101, column: 52, scope: !111)
!115 = !DILocation(line: 102, column: 9, scope: !107)
!116 = !DILocation(line: 102, column: 14, scope: !107)
!117 = !DILocation(line: 102, column: 25, scope: !107)
!118 = !DILocation(line: 102, column: 54, scope: !107)
!119 = !DILocation(line: 103, column: 10, scope: !107)
!120 = !DILocation(line: 103, column: 15, scope: !107)
!121 = !DILocation(line: 103, column: 26, scope: !107)
!122 = !DILocation(line: 103, column: 55, scope: !107)
!123 = !DILocation(line: 103, column: 58, scope: !111)
!124 = !DILocation(line: 103, column: 64, scope: !111)
!125 = !DILocation(line: 103, column: 70, scope: !111)
!126 = !DILocation(line: 101, column: 9, scope: !127)
!127 = !DILexicalBlockFile(scope: !39, file: !28, discriminator: 2)
!128 = !DILocation(line: 104, column: 9, scope: !129)
!129 = distinct !DILexicalBlock(scope: !107, file: !28, line: 103, column: 79)
!130 = !DILocation(line: 105, column: 9, scope: !129)
!131 = !DILocation(line: 107, column: 9, scope: !132)
!132 = distinct !DILexicalBlock(scope: !39, file: !28, line: 107, column: 9)
!133 = !DILocation(line: 107, column: 14, scope: !132)
!134 = !DILocation(line: 107, column: 22, scope: !132)
!135 = !DILocation(line: 107, column: 9, scope: !39)
!136 = !DILocation(line: 108, column: 9, scope: !137)
!137 = distinct !DILexicalBlock(scope: !132, file: !28, line: 107, column: 41)
!138 = !DILocation(line: 109, column: 9, scope: !137)
!139 = !DILocation(line: 111, column: 9, scope: !140)
!140 = distinct !DILexicalBlock(scope: !39, file: !28, line: 111, column: 9)
!141 = !DILocation(line: 111, column: 14, scope: !140)
!142 = !DILocation(line: 111, column: 28, scope: !140)
!143 = !DILocation(line: 111, column: 34, scope: !140)
!144 = !DILocation(line: 111, column: 25, scope: !140)
!145 = !DILocation(line: 111, column: 46, scope: !140)
!146 = !DILocation(line: 112, column: 16, scope: !140)
!147 = !DILocation(line: 112, column: 21, scope: !140)
!148 = !DILocation(line: 112, column: 29, scope: !140)
!149 = !DILocation(line: 112, column: 35, scope: !140)
!150 = !DILocation(line: 112, column: 45, scope: !140)
!151 = !DILocation(line: 112, column: 51, scope: !140)
!152 = !DILocation(line: 112, column: 9, scope: !140)
!153 = !DILocation(line: 112, column: 64, scope: !140)
!154 = !DILocation(line: 111, column: 9, scope: !155)
