; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--ts--libcrypto-shlib-ts_verify_ctx.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--ts--libcrypto-shlib-ts_verify_ctx.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TS_verify_ctx = type { i32, %struct.x509_store_st*, %struct.stack_st_X509*, %struct.asn1_object_st*, %struct.X509_algor_st*, i8*, i32, %struct.bio_st*, %struct.asn1_string_st*, %struct.GENERAL_NAME_st* }
%struct.x509_store_st = type opaque
%struct.stack_st_X509 = type opaque
%struct.asn1_object_st = type opaque
%struct.X509_algor_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_type_st = type { i32, %union.anon }
%union.anon = type { i8* }
%struct.bio_st = type opaque
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.GENERAL_NAME_st = type { i32, %union.anon.0 }
%union.anon.0 = type { i8* }
%struct.x509_st = type opaque
%struct.stack_st = type opaque
%struct.TS_req_st = type { %struct.asn1_string_st*, %struct.TS_msg_imprint_st*, %struct.asn1_object_st*, %struct.asn1_string_st*, i32, %struct.stack_st_X509_EXTENSION* }
%struct.TS_msg_imprint_st = type { %struct.X509_algor_st*, %struct.asn1_string_st* }
%struct.stack_st_X509_EXTENSION = type opaque

@.str = private unnamed_addr constant [26 x i8] c"crypto/ts/ts_verify_ctx.c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--ts--libcrypto-shlib-ts_verify_ctx.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !9}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !7, line: 17, baseType: !8)
!7 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !7, line: 17, flags: DIFlagFwdDecl)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !7, line: 20, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{null, !4}
!13 = !{i32 2, !"Dwarf Version", i32 4}
!14 = !{i32 2, !"Debug Info Version", i32 3}
!15 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!16 = distinct !DISubprogram(name: "TS_VERIFY_CTX_new", scope: !17, file: !17, line: 15, type: !18, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!17 = !DIFile(filename: "crypto/ts/ts_verify_ctx.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!18 = !DISubroutineType(types: !19)
!19 = !{!20}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_VERIFY_CTX", file: !22, line: 418, baseType: !23)
!22 = !DIFile(filename: "include/openssl/ts.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TS_verify_ctx", file: !24, line: 129, size: 640, align: 64, elements: !25)
!24 = !DIFile(filename: "crypto/ts/ts_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!25 = !{!26, !28, !33, !37, !41, !124, !125, !126, !130, !131}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !23, file: !24, line: 131, baseType: !27, size: 32, align: 32)
!27 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !23, file: !24, line: 133, baseType: !29, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_STORE", file: !31, line: 131, baseType: !32)
!31 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_store_st", file: !31, line: 131, flags: DIFlagFwdDecl)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "certs", scope: !23, file: !24, line: 134, baseType: !34, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !36, line: 99, flags: DIFlagFwdDecl)
!36 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !23, file: !24, line: 136, baseType: !38, size: 64, align: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !31, line: 60, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !31, line: 60, flags: DIFlagFwdDecl)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "md_alg", scope: !23, file: !24, line: 141, baseType: !42, size: 64, align: 64, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !31, line: 125, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !36, line: 59, size: 128, align: 64, elements: !45)
!45 = !{!46, !47}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !44, file: !36, line: 60, baseType: !38, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !44, file: !36, line: 61, baseType: !48, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !50, line: 473, baseType: !51)
!50 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !50, line: 444, size: 128, align: 64, elements: !52)
!52 = !{!53, !55}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !51, file: !50, line: 445, baseType: !54, size: 32, align: 32)
!54 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !51, file: !50, line: 472, baseType: !56, size: 64, align: 64, offset: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !51, file: !50, line: 446, size: 64, align: 64, elements: !57)
!57 = !{!58, !61, !63, !75, !76, !79, !82, !85, !88, !91, !94, !97, !100, !103, !106, !109, !112, !115, !118, !119, !120}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !56, file: !50, line: 447, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !56, file: !50, line: 448, baseType: !62, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !31, line: 56, baseType: !54)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !56, file: !50, line: 449, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !31, line: 55, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !50, line: 146, size: 192, align: 64, elements: !67)
!67 = !{!68, !69, !70, !73}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !66, file: !50, line: 147, baseType: !54, size: 32, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !66, file: !50, line: 148, baseType: !54, size: 32, align: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !66, file: !50, line: 149, baseType: !71, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !66, file: !50, line: 155, baseType: !74, size: 64, align: 64, offset: 128)
!74 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !56, file: !50, line: 450, baseType: !38, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !56, file: !50, line: 451, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !31, line: 40, baseType: !66)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !56, file: !50, line: 452, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !31, line: 41, baseType: !66)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !56, file: !50, line: 453, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !31, line: 42, baseType: !66)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !56, file: !50, line: 454, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !31, line: 43, baseType: !66)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !56, file: !50, line: 455, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !31, line: 44, baseType: !66)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !56, file: !50, line: 456, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !31, line: 45, baseType: !66)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !56, file: !50, line: 457, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !31, line: 46, baseType: !66)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !56, file: !50, line: 458, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !31, line: 47, baseType: !66)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !56, file: !50, line: 459, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !31, line: 49, baseType: !66)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !56, file: !50, line: 460, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !31, line: 48, baseType: !66)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !56, file: !50, line: 461, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !31, line: 50, baseType: !66)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !56, file: !50, line: 462, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !31, line: 52, baseType: !66)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !56, file: !50, line: 463, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !31, line: 53, baseType: !66)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !56, file: !50, line: 464, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !31, line: 54, baseType: !66)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !56, file: !50, line: 469, baseType: !64, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !56, file: !50, line: 470, baseType: !64, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !56, file: !50, line: 471, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !50, line: 213, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !50, line: 213, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "imprint", scope: !23, file: !24, line: 142, baseType: !71, size: 64, align: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "imprint_len", scope: !23, file: !24, line: 143, baseType: !27, size: 32, align: 32, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !23, file: !24, line: 145, baseType: !127, size: 64, align: 64, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !31, line: 79, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !31, line: 79, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !23, file: !24, line: 147, baseType: !77, size: 64, align: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tsa_name", scope: !23, file: !24, line: 149, baseType: !132, size: 64, align: 64, offset: 576)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "GENERAL_NAME", file: !134, line: 153, baseType: !135)
!134 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GENERAL_NAME_st", file: !134, line: 123, size: 128, align: 64, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !135, file: !134, line: 133, baseType: !54, size: 32, align: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !135, file: !134, line: 152, baseType: !139, size: 64, align: 64, offset: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !135, file: !134, line: 134, size: 64, align: 64, elements: !140)
!140 = !{!141, !142, !149, !150, !151, !152, !156, !163, !164, !165, !166, !167, !168, !169, !170}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !139, file: !134, line: 135, baseType: !59, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "otherName", scope: !139, file: !134, line: 136, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "OTHERNAME", file: !134, line: 116, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "otherName_st", file: !134, line: 113, size: 128, align: 64, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type_id", scope: !145, file: !134, line: 114, baseType: !38, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !145, file: !134, line: 115, baseType: !48, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "rfc822Name", scope: !139, file: !134, line: 137, baseType: !95, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "dNSName", scope: !139, file: !134, line: 138, baseType: !95, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "x400Address", scope: !139, file: !134, line: 139, baseType: !48, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "directoryName", scope: !139, file: !134, line: 140, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !31, line: 129, baseType: !155)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !31, line: 129, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ediPartyName", scope: !139, file: !134, line: 141, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDIPARTYNAME", file: !134, line: 121, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EDIPartyName_st", file: !134, line: 118, size: 128, align: 64, elements: !160)
!160 = !{!161, !162}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nameAssigner", scope: !159, file: !134, line: 119, baseType: !64, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "partyName", scope: !159, file: !134, line: 120, baseType: !64, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "uniformResourceIdentifier", scope: !139, file: !134, line: 142, baseType: !95, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "iPAddress", scope: !139, file: !134, line: 143, baseType: !86, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "registeredID", scope: !139, file: !134, line: 144, baseType: !38, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !139, file: !134, line: 146, baseType: !86, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "dirn", scope: !139, file: !134, line: 147, baseType: !153, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ia5", scope: !139, file: !134, line: 148, baseType: !95, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "rid", scope: !139, file: !134, line: 150, baseType: !38, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !139, file: !134, line: 151, baseType: !48, size: 64, align: 64)
!171 = !DILocalVariable(name: "ctx", scope: !16, file: !17, line: 17, type: !20)
!172 = !DIExpression()
!173 = !DILocation(line: 17, column: 20, scope: !16)
!174 = !DILocation(line: 17, column: 26, scope: !16)
!175 = !DILocation(line: 19, column: 9, scope: !176)
!176 = distinct !DILexicalBlock(scope: !16, file: !17, line: 19, column: 9)
!177 = !DILocation(line: 19, column: 13, scope: !176)
!178 = !DILocation(line: 19, column: 9, scope: !16)
!179 = !DILocation(line: 20, column: 9, scope: !176)
!180 = !DILocation(line: 21, column: 12, scope: !16)
!181 = !DILocation(line: 21, column: 5, scope: !16)
!182 = distinct !DISubprogram(name: "TS_VERIFY_CTX_init", scope: !17, file: !17, line: 24, type: !183, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !20}
!185 = !DILocalVariable(name: "ctx", arg: 1, scope: !182, file: !17, line: 24, type: !20)
!186 = !DILocation(line: 24, column: 40, scope: !182)
!187 = !DILocation(line: 26, column: 13, scope: !182)
!188 = !DILocation(line: 26, column: 17, scope: !182)
!189 = !DILocation(line: 26, column: 12, scope: !182)
!190 = !DILocation(line: 26, column: 12, scope: !191)
!191 = !DILexicalBlockFile(scope: !182, file: !17, discriminator: 1)
!192 = !DILocation(line: 26, column: 13, scope: !193)
!193 = !DILexicalBlockFile(scope: !182, file: !17, discriminator: 2)
!194 = !DILocation(line: 26, column: 12, scope: !195)
!195 = !DILexicalBlockFile(scope: !182, file: !17, discriminator: 3)
!196 = !DILocation(line: 26, column: 12, scope: !197)
!197 = !DILexicalBlockFile(scope: !182, file: !17, discriminator: 4)
!198 = !DILocation(line: 27, column: 12, scope: !182)
!199 = !DILocation(line: 27, column: 5, scope: !182)
!200 = !DILocation(line: 28, column: 1, scope: !182)
!201 = distinct !DISubprogram(name: "TS_VERIFY_CTX_free", scope: !17, file: !17, line: 30, type: !183, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!202 = !DILocalVariable(name: "ctx", arg: 1, scope: !201, file: !17, line: 30, type: !20)
!203 = !DILocation(line: 30, column: 40, scope: !201)
!204 = !DILocation(line: 32, column: 10, scope: !205)
!205 = distinct !DILexicalBlock(scope: !201, file: !17, line: 32, column: 9)
!206 = !DILocation(line: 32, column: 9, scope: !201)
!207 = !DILocation(line: 33, column: 9, scope: !205)
!208 = !DILocation(line: 35, column: 27, scope: !201)
!209 = !DILocation(line: 35, column: 5, scope: !201)
!210 = !DILocation(line: 36, column: 17, scope: !201)
!211 = !DILocation(line: 36, column: 5, scope: !201)
!212 = !DILocation(line: 37, column: 1, scope: !201)
!213 = !DILocation(line: 37, column: 1, scope: !214)
!214 = !DILexicalBlockFile(scope: !201, file: !17, discriminator: 1)
!215 = distinct !DISubprogram(name: "TS_VERIFY_CTX_cleanup", scope: !17, file: !17, line: 78, type: !183, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!216 = !DILocalVariable(name: "ctx", arg: 1, scope: !215, file: !17, line: 78, type: !20)
!217 = !DILocation(line: 78, column: 43, scope: !215)
!218 = !DILocation(line: 80, column: 10, scope: !219)
!219 = distinct !DILexicalBlock(scope: !215, file: !17, line: 80, column: 9)
!220 = !DILocation(line: 80, column: 9, scope: !215)
!221 = !DILocation(line: 81, column: 9, scope: !219)
!222 = !DILocation(line: 83, column: 21, scope: !215)
!223 = !DILocation(line: 83, column: 26, scope: !215)
!224 = !DILocation(line: 83, column: 5, scope: !215)
!225 = !DILocation(line: 84, column: 22, scope: !215)
!226 = !DILocation(line: 84, column: 27, scope: !215)
!227 = !DILocation(line: 84, column: 5, scope: !215)
!228 = !DILocation(line: 86, column: 22, scope: !215)
!229 = !DILocation(line: 86, column: 27, scope: !215)
!230 = !DILocation(line: 86, column: 5, scope: !215)
!231 = !DILocation(line: 88, column: 21, scope: !215)
!232 = !DILocation(line: 88, column: 26, scope: !215)
!233 = !DILocation(line: 88, column: 5, scope: !215)
!234 = !DILocation(line: 89, column: 17, scope: !215)
!235 = !DILocation(line: 89, column: 22, scope: !215)
!236 = !DILocation(line: 89, column: 5, scope: !215)
!237 = !DILocation(line: 91, column: 18, scope: !215)
!238 = !DILocation(line: 91, column: 23, scope: !215)
!239 = !DILocation(line: 91, column: 5, scope: !215)
!240 = !DILocation(line: 93, column: 23, scope: !215)
!241 = !DILocation(line: 93, column: 28, scope: !215)
!242 = !DILocation(line: 93, column: 5, scope: !215)
!243 = !DILocation(line: 95, column: 23, scope: !215)
!244 = !DILocation(line: 95, column: 28, scope: !215)
!245 = !DILocation(line: 95, column: 5, scope: !215)
!246 = !DILocation(line: 97, column: 24, scope: !215)
!247 = !DILocation(line: 97, column: 5, scope: !215)
!248 = !DILocation(line: 98, column: 1, scope: !215)
!249 = !DILocation(line: 98, column: 1, scope: !250)
!250 = !DILexicalBlockFile(scope: !215, file: !17, discriminator: 1)
!251 = distinct !DISubprogram(name: "TS_VERIFY_CTX_add_flags", scope: !17, file: !17, line: 39, type: !252, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!252 = !DISubroutineType(types: !253)
!253 = !{!54, !20, !54}
!254 = !DILocalVariable(name: "ctx", arg: 1, scope: !251, file: !17, line: 39, type: !20)
!255 = !DILocation(line: 39, column: 44, scope: !251)
!256 = !DILocalVariable(name: "f", arg: 2, scope: !251, file: !17, line: 39, type: !54)
!257 = !DILocation(line: 39, column: 53, scope: !251)
!258 = !DILocation(line: 41, column: 19, scope: !251)
!259 = !DILocation(line: 41, column: 5, scope: !251)
!260 = !DILocation(line: 41, column: 10, scope: !251)
!261 = !DILocation(line: 41, column: 16, scope: !251)
!262 = !DILocation(line: 42, column: 12, scope: !251)
!263 = !DILocation(line: 42, column: 17, scope: !251)
!264 = !DILocation(line: 42, column: 5, scope: !251)
!265 = distinct !DISubprogram(name: "TS_VERIFY_CTX_set_flags", scope: !17, file: !17, line: 45, type: !252, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!266 = !DILocalVariable(name: "ctx", arg: 1, scope: !265, file: !17, line: 45, type: !20)
!267 = !DILocation(line: 45, column: 44, scope: !265)
!268 = !DILocalVariable(name: "f", arg: 2, scope: !265, file: !17, line: 45, type: !54)
!269 = !DILocation(line: 45, column: 53, scope: !265)
!270 = !DILocation(line: 47, column: 18, scope: !265)
!271 = !DILocation(line: 47, column: 5, scope: !265)
!272 = !DILocation(line: 47, column: 10, scope: !265)
!273 = !DILocation(line: 47, column: 16, scope: !265)
!274 = !DILocation(line: 48, column: 12, scope: !265)
!275 = !DILocation(line: 48, column: 17, scope: !265)
!276 = !DILocation(line: 48, column: 5, scope: !265)
!277 = distinct !DISubprogram(name: "TS_VERIFY_CTX_set_data", scope: !17, file: !17, line: 51, type: !278, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!278 = !DISubroutineType(types: !279)
!279 = !{!127, !20, !127}
!280 = !DILocalVariable(name: "ctx", arg: 1, scope: !277, file: !17, line: 51, type: !20)
!281 = !DILocation(line: 51, column: 44, scope: !277)
!282 = !DILocalVariable(name: "b", arg: 2, scope: !277, file: !17, line: 51, type: !127)
!283 = !DILocation(line: 51, column: 54, scope: !277)
!284 = !DILocation(line: 53, column: 17, scope: !277)
!285 = !DILocation(line: 53, column: 5, scope: !277)
!286 = !DILocation(line: 53, column: 10, scope: !277)
!287 = !DILocation(line: 53, column: 15, scope: !277)
!288 = !DILocation(line: 54, column: 12, scope: !277)
!289 = !DILocation(line: 54, column: 17, scope: !277)
!290 = !DILocation(line: 54, column: 5, scope: !277)
!291 = distinct !DISubprogram(name: "TS_VERIFY_CTX_set_store", scope: !17, file: !17, line: 57, type: !292, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!292 = !DISubroutineType(types: !293)
!293 = !{!29, !20, !29}
!294 = !DILocalVariable(name: "ctx", arg: 1, scope: !291, file: !17, line: 57, type: !20)
!295 = !DILocation(line: 57, column: 52, scope: !291)
!296 = !DILocalVariable(name: "s", arg: 2, scope: !291, file: !17, line: 57, type: !29)
!297 = !DILocation(line: 57, column: 69, scope: !291)
!298 = !DILocation(line: 59, column: 18, scope: !291)
!299 = !DILocation(line: 59, column: 5, scope: !291)
!300 = !DILocation(line: 59, column: 10, scope: !291)
!301 = !DILocation(line: 59, column: 16, scope: !291)
!302 = !DILocation(line: 60, column: 12, scope: !291)
!303 = !DILocation(line: 60, column: 17, scope: !291)
!304 = !DILocation(line: 60, column: 5, scope: !291)
!305 = distinct !DISubprogram(name: "TS_VERIFY_CTS_set_certs", scope: !17, file: !17, line: 63, type: !306, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!306 = !DISubroutineType(types: !307)
!307 = !{!34, !20, !34}
!308 = !DILocalVariable(name: "ctx", arg: 1, scope: !305, file: !17, line: 63, type: !20)
!309 = !DILocation(line: 63, column: 62, scope: !305)
!310 = !DILocalVariable(name: "certs", arg: 2, scope: !305, file: !17, line: 64, type: !34)
!311 = !DILocation(line: 64, column: 63, scope: !305)
!312 = !DILocation(line: 66, column: 18, scope: !305)
!313 = !DILocation(line: 66, column: 5, scope: !305)
!314 = !DILocation(line: 66, column: 10, scope: !305)
!315 = !DILocation(line: 66, column: 16, scope: !305)
!316 = !DILocation(line: 67, column: 12, scope: !305)
!317 = !DILocation(line: 67, column: 17, scope: !305)
!318 = !DILocation(line: 67, column: 5, scope: !305)
!319 = distinct !DISubprogram(name: "TS_VERIFY_CTX_set_imprint", scope: !17, file: !17, line: 70, type: !320, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!320 = !DISubroutineType(types: !321)
!321 = !{!71, !20, !71, !74}
!322 = !DILocalVariable(name: "ctx", arg: 1, scope: !319, file: !17, line: 70, type: !20)
!323 = !DILocation(line: 70, column: 57, scope: !319)
!324 = !DILocalVariable(name: "hexstr", arg: 2, scope: !319, file: !17, line: 71, type: !71)
!325 = !DILocation(line: 71, column: 57, scope: !319)
!326 = !DILocalVariable(name: "len", arg: 3, scope: !319, file: !17, line: 71, type: !74)
!327 = !DILocation(line: 71, column: 70, scope: !319)
!328 = !DILocation(line: 73, column: 20, scope: !319)
!329 = !DILocation(line: 73, column: 5, scope: !319)
!330 = !DILocation(line: 73, column: 10, scope: !319)
!331 = !DILocation(line: 73, column: 18, scope: !319)
!332 = !DILocation(line: 74, column: 24, scope: !319)
!333 = !DILocation(line: 74, column: 5, scope: !319)
!334 = !DILocation(line: 74, column: 10, scope: !319)
!335 = !DILocation(line: 74, column: 22, scope: !319)
!336 = !DILocation(line: 75, column: 12, scope: !319)
!337 = !DILocation(line: 75, column: 17, scope: !319)
!338 = !DILocation(line: 75, column: 5, scope: !319)
!339 = distinct !DISubprogram(name: "sk_X509_pop_free", scope: !36, file: !36, line: 99, type: !340, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !34, !342}
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_X509_freefunc", file: !36, line: 99, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !31, line: 124, baseType: !348)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !31, line: 124, flags: DIFlagFwdDecl)
!349 = !DILocalVariable(name: "sk", arg: 1, scope: !339, file: !36, line: 99, type: !34)
!350 = !DILocation(line: 99, column: 2446, scope: !339)
!351 = !DILocalVariable(name: "freefunc", arg: 2, scope: !339, file: !36, line: 99, type: !342)
!352 = !DILocation(line: 99, column: 2467, scope: !339)
!353 = !DILocation(line: 99, column: 2516, scope: !339)
!354 = !DILocation(line: 99, column: 2499, scope: !339)
!355 = !DILocation(line: 99, column: 2541, scope: !339)
!356 = !DILocation(line: 99, column: 2520, scope: !339)
!357 = !DILocation(line: 99, column: 2479, scope: !339)
!358 = !DILocation(line: 99, column: 2552, scope: !339)
!359 = distinct !DISubprogram(name: "TS_REQ_to_TS_VERIFY_CTX", scope: !17, file: !17, line: 100, type: !360, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!360 = !DISubroutineType(types: !361)
!361 = !{!20, !362, !20}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_REQ", file: !22, line: 35, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TS_req_st", file: !24, line: 42, size: 384, align: 64, elements: !365)
!365 = !{!366, !367, !374, !375, !376, !377}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !364, file: !24, line: 43, baseType: !77, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "msg_imprint", scope: !364, file: !24, line: 44, baseType: !368, size: 64, align: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_MSG_IMPRINT", file: !22, line: 34, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TS_msg_imprint_st", file: !24, line: 15, size: 128, align: 64, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "hash_algo", scope: !370, file: !24, line: 16, baseType: !42, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "hashed_msg", scope: !370, file: !24, line: 17, baseType: !86, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "policy_id", scope: !364, file: !24, line: 45, baseType: !38, size: 64, align: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !364, file: !24, line: 46, baseType: !77, size: 64, align: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "cert_req", scope: !364, file: !24, line: 47, baseType: !62, size: 32, align: 32, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !364, file: !24, line: 48, baseType: !378, size: 64, align: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_EXTENSION", file: !36, line: 83, flags: DIFlagFwdDecl)
!380 = !DILocalVariable(name: "req", arg: 1, scope: !359, file: !17, line: 100, type: !362)
!381 = !DILocation(line: 100, column: 48, scope: !359)
!382 = !DILocalVariable(name: "ctx", arg: 2, scope: !359, file: !17, line: 100, type: !20)
!383 = !DILocation(line: 100, column: 68, scope: !359)
!384 = !DILocalVariable(name: "ret", scope: !359, file: !17, line: 102, type: !20)
!385 = !DILocation(line: 102, column: 20, scope: !359)
!386 = !DILocation(line: 102, column: 26, scope: !359)
!387 = !DILocalVariable(name: "policy", scope: !359, file: !17, line: 103, type: !38)
!388 = !DILocation(line: 103, column: 18, scope: !359)
!389 = !DILocalVariable(name: "imprint", scope: !359, file: !17, line: 104, type: !368)
!390 = !DILocation(line: 104, column: 21, scope: !359)
!391 = !DILocalVariable(name: "md_alg", scope: !359, file: !17, line: 105, type: !42)
!392 = !DILocation(line: 105, column: 17, scope: !359)
!393 = !DILocalVariable(name: "msg", scope: !359, file: !17, line: 106, type: !86)
!394 = !DILocation(line: 106, column: 24, scope: !359)
!395 = !DILocalVariable(name: "nonce", scope: !359, file: !17, line: 107, type: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!398 = !DILocation(line: 107, column: 25, scope: !359)
!399 = !DILocation(line: 109, column: 13, scope: !359)
!400 = !DILocation(line: 109, column: 17, scope: !359)
!401 = !DILocation(line: 109, column: 12, scope: !359)
!402 = !DILocation(line: 109, column: 12, scope: !403)
!403 = !DILexicalBlockFile(scope: !359, file: !17, discriminator: 1)
!404 = !DILocation(line: 109, column: 13, scope: !405)
!405 = !DILexicalBlockFile(scope: !359, file: !17, discriminator: 2)
!406 = !DILocation(line: 109, column: 12, scope: !407)
!407 = !DILexicalBlockFile(scope: !359, file: !17, discriminator: 3)
!408 = !DILocation(line: 109, column: 12, scope: !409)
!409 = !DILexicalBlockFile(scope: !359, file: !17, discriminator: 4)
!410 = !DILocation(line: 110, column: 9, scope: !411)
!411 = distinct !DILexicalBlock(scope: !359, file: !17, line: 110, column: 9)
!412 = !DILocation(line: 110, column: 9, scope: !359)
!413 = !DILocation(line: 111, column: 31, scope: !411)
!414 = !DILocation(line: 111, column: 9, scope: !411)
!415 = !DILocation(line: 112, column: 21, scope: !416)
!416 = distinct !DILexicalBlock(scope: !411, file: !17, line: 112, column: 14)
!417 = !DILocation(line: 112, column: 19, scope: !416)
!418 = !DILocation(line: 112, column: 42, scope: !416)
!419 = !DILocation(line: 112, column: 14, scope: !411)
!420 = !DILocation(line: 113, column: 9, scope: !416)
!421 = !DILocation(line: 115, column: 5, scope: !359)
!422 = !DILocation(line: 115, column: 10, scope: !359)
!423 = !DILocation(line: 115, column: 16, scope: !359)
!424 = !DILocation(line: 117, column: 19, scope: !425)
!425 = distinct !DILexicalBlock(scope: !359, file: !17, line: 117, column: 9)
!426 = !DILocation(line: 117, column: 24, scope: !425)
!427 = !DILocation(line: 117, column: 17, scope: !425)
!428 = !DILocation(line: 117, column: 35, scope: !425)
!429 = !DILocation(line: 117, column: 9, scope: !359)
!430 = !DILocation(line: 118, column: 36, scope: !431)
!431 = distinct !DILexicalBlock(scope: !432, file: !17, line: 118, column: 13)
!432 = distinct !DILexicalBlock(scope: !425, file: !17, line: 117, column: 43)
!433 = !DILocation(line: 118, column: 28, scope: !431)
!434 = !DILocation(line: 118, column: 14, scope: !431)
!435 = !DILocation(line: 118, column: 19, scope: !431)
!436 = !DILocation(line: 118, column: 26, scope: !431)
!437 = !DILocation(line: 118, column: 45, scope: !431)
