; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--bn--libcrypto-lib-bn_blind.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--bn--libcrypto-lib-bn_blind.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bn_blinding_st = type { %struct.bignum_st*, %struct.bignum_st*, %struct.bignum_st*, %struct.bignum_st*, i64, i32, i64, %struct.bn_mont_ctx_st*, i32 (%struct.bignum_st*, %struct.bignum_st*, %struct.bignum_st*, %struct.bignum_st*, %struct.bignum_ctx*, %struct.bn_mont_ctx_st*)*, i8* }
%struct.bn_mont_ctx_st = type { i32, %struct.bignum_st, %struct.bignum_st, %struct.bignum_st, [2 x i64], i32 }
%struct.bignum_st = type { i64*, i32, i32, i32, i32 }
%struct.bignum_ctx = type opaque

@.str = private unnamed_addr constant [21 x i8] c"crypto/bn/bn_blind.c\00", align 1

; Function Attrs: nounwind uwtable
define %struct.bn_blinding_st* @BN_BLINDING_new(%struct.bignum_st* %A, %struct.bignum_st* %Ai, %struct.bignum_st* %mod) #0 !dbg !10 {
entry:
  %retval = alloca %struct.bn_blinding_st*, align 8
  %A.addr = alloca %struct.bignum_st*, align 8
  %Ai.addr = alloca %struct.bignum_st*, align 8
  %mod.addr = alloca %struct.bignum_st*, align 8
  %ret = alloca %struct.bn_blinding_st*, align 8
  store %struct.bignum_st* %A, %struct.bignum_st** %A.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.bignum_st** %A.addr, metadata !67, metadata !68), !dbg !69

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--bn--libcrypto-lib-bn_blind.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !{i32 2, !"Dwarf Version", i32 4}
!8 = !{i32 2, !"Debug Info Version", i32 3}
!9 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!10 = distinct !DISubprogram(name: "BN_BLINDING_new", scope: !11, file: !11, line: 30, type: !12, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!11 = !DIFile(filename: "crypto/bn/bn_blind.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!12 = !DISubroutineType(types: !13)
!13 = !{!14, !59, !59, !20}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_BLINDING", file: !16, line: 82, baseType: !17)
!16 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bn_blinding_st", file: !11, line: 16, size: 640, align: 64, elements: !18)
!18 = !{!19, !31, !32, !33, !34, !39, !40, !41, !55, !64}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !17, file: !11, line: 17, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIGNUM", file: !16, line: 80, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_st", file: !23, line: 218, size: 192, align: 64, elements: !24)
!23 = !DIFile(filename: "crypto/bn/bn_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!24 = !{!25, !27, !28, !29, !30}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !22, file: !23, line: 219, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !22, file: !23, line: 221, baseType: !6, size: 32, align: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "dmax", scope: !22, file: !23, line: 223, baseType: !6, size: 32, align: 32, offset: 96)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "neg", scope: !22, file: !23, line: 224, baseType: !6, size: 32, align: 32, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !22, file: !23, line: 225, baseType: !6, size: 32, align: 32, offset: 160)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Ai", scope: !17, file: !11, line: 18, baseType: !20, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !17, file: !11, line: 19, baseType: !20, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !17, file: !11, line: 20, baseType: !20, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !17, file: !11, line: 21, baseType: !35, size: 64, align: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_THREAD_ID", file: !36, line: 431, baseType: !37)
!36 = !DIFile(filename: "include/openssl/crypto.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !38, line: 60, baseType: !5)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!39 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !17, file: !11, line: 22, baseType: !6, size: 32, align: 32, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !17, file: !11, line: 23, baseType: !5, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "m_ctx", scope: !17, file: !11, line: 24, baseType: !42, size: 64, align: 64, offset: 448)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_MONT_CTX", file: !16, line: 83, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bn_mont_ctx_st", file: !23, line: 229, size: 832, align: 64, elements: !45)
!45 = !{!46, !47, !48, !49, !50, !54}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !44, file: !23, line: 230, baseType: !6, size: 32, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "RR", scope: !44, file: !23, line: 231, baseType: !21, size: 192, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !44, file: !23, line: 233, baseType: !21, size: 192, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Ni", scope: !44, file: !23, line: 234, baseType: !21, size: 192, align: 64, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "n0", scope: !44, file: !23, line: 236, baseType: !51, size: 128, align: 64, offset: 640)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, align: 64, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 2)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !44, file: !23, line: 239, baseType: !6, size: 32, align: 32, offset: 768)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "bn_mod_exp", scope: !17, file: !11, line: 25, baseType: !56, size: 64, align: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!6, !20, !59, !59, !59, !61, !42}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_CTX", file: !16, line: 81, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_ctx", file: !16, line: 81, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !17, file: !11, line: 27, baseType: !65, size: 64, align: 64, offset: 576)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_RWLOCK", file: !36, line: 67, baseType: null)
!67 = !DILocalVariable(name: "A", arg: 1, scope: !10, file: !11, line: 30, type: !59)
!68 = !DIExpression()
!69 = !DILocation(line: 30, column: 44, scope: !10)
!70 = !DILocalVariable(name: "Ai", arg: 2, scope: !10, file: !11, line: 30, type: !59)
!71 = !DILocation(line: 30, column: 61, scope: !10)
!72 = !DILocalVariable(name: "mod", arg: 3, scope: !10, file: !11, line: 30, type: !20)
!73 = !DILocation(line: 30, column: 73, scope: !10)
!74 = !DILocalVariable(name: "ret", scope: !10, file: !11, line: 32, type: !14)
!75 = !DILocation(line: 32, column: 18, scope: !10)
!76 = !DILocation(line: 36, column: 16, scope: !77)
!77 = distinct !DILexicalBlock(scope: !10, file: !11, line: 36, column: 9)
!78 = !DILocation(line: 36, column: 14, scope: !77)
!79 = !DILocation(line: 36, column: 73, scope: !77)
!80 = !DILocation(line: 36, column: 9, scope: !10)
!81 = !DILocation(line: 37, column: 9, scope: !82)
!82 = distinct !DILexicalBlock(scope: !77, file: !11, line: 36, column: 54)
!83 = !DILocation(line: 38, column: 9, scope: !82)
!84 = !DILocation(line: 41, column: 17, scope: !10)
!85 = !DILocation(line: 41, column: 5, scope: !10)
!86 = !DILocation(line: 41, column: 10, scope: !10)
!87 = !DILocation(line: 41, column: 15, scope: !10)
!88 = !DILocation(line: 42, column: 9, scope: !89)
!89 = distinct !DILexicalBlock(scope: !10, file: !11, line: 42, column: 9)
!90 = !DILocation(line: 42, column: 14, scope: !89)
!91 = !DILocation(line: 42, column: 19, scope: !89)
!92 = !DILocation(line: 42, column: 9, scope: !10)
!93 = !DILocation(line: 43, column: 9, scope: !94)
!94 = distinct !DILexicalBlock(scope: !89, file: !11, line: 42, column: 27)
!95 = !DILocation(line: 44, column: 21, scope: !94)
!96 = !DILocation(line: 44, column: 9, scope: !94)
!97 = !DILocation(line: 45, column: 9, scope: !94)
!98 = !DILocation(line: 48, column: 36, scope: !10)
!99 = !DILocation(line: 48, column: 5, scope: !10)
!100 = !DILocation(line: 50, column: 9, scope: !101)
!101 = distinct !DILexicalBlock(scope: !10, file: !11, line: 50, column: 9)
!102 = !DILocation(line: 50, column: 11, scope: !101)
!103 = !DILocation(line: 50, column: 9, scope: !10)
!104 = !DILocation(line: 51, column: 30, scope: !105)
!105 = distinct !DILexicalBlock(scope: !106, file: !11, line: 51, column: 13)
!106 = distinct !DILexicalBlock(scope: !101, file: !11, line: 50, column: 19)
!107 = !DILocation(line: 51, column: 23, scope: !105)
!108 = !DILocation(line: 51, column: 14, scope: !105)
!109 = !DILocation(line: 51, column: 19, scope: !105)
!110 = !DILocation(line: 51, column: 21, scope: !105)
!111 = !DILocation(line: 51, column: 34, scope: !105)
!112 = !DILocation(line: 51, column: 13, scope: !106)
!113 = !DILocation(line: 52, column: 13, scope: !105)
!114 = !DILocation(line: 53, column: 5, scope: !106)
!115 = !DILocation(line: 55, column: 9, scope: !116)
!116 = distinct !DILexicalBlock(scope: !10, file: !11, line: 55, column: 9)
!117 = !DILocation(line: 55, column: 12, scope: !116)
!118 = !DILocation(line: 55, column: 9, scope: !10)
!119 = !DILocation(line: 56, column: 31, scope: !120)
!120 = distinct !DILexicalBlock(scope: !121, file: !11, line: 56, column: 13)
!121 = distinct !DILexicalBlock(scope: !116, file: !11, line: 55, column: 20)
!122 = !DILocation(line: 56, column: 24, scope: !120)
!123 = !DILocation(line: 56, column: 14, scope: !120)
!124 = !DILocation(line: 56, column: 19, scope: !120)
!125 = !DILocation(line: 56, column: 22, scope: !120)
!126 = !DILocation(line: 56, column: 36, scope: !120)
!127 = !DILocation(line: 56, column: 13, scope: !121)
!128 = !DILocation(line: 57, column: 13, scope: !120)
!129 = !DILocation(line: 58, column: 5, scope: !121)
