; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--bn--libcrypto-shlib-bn_recp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--bn--libcrypto-shlib-bn_recp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bn_recp_ctx_st = type { %struct.bignum_st, %struct.bignum_st, i32, i32, i32 }
%struct.bignum_st = type { i64*, i32, i32, i32, i32 }
%struct.bignum_ctx = type opaque

@.str = private unnamed_addr constant [20 x i8] c"crypto/bn/bn_recp.c\00", align 1

; Function Attrs: nounwind uwtable
define void @BN_RECP_CTX_init(%struct.bn_recp_ctx_st* %recp) #0 !dbg !8 {
entry:
  %recp.addr = alloca %struct.bn_recp_ctx_st*, align 8
  store %struct.bn_recp_ctx_st* %recp, %struct.bn_recp_ctx_st** %recp.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.bn_recp_ctx_st** %recp.addr, metadata !34, metadata !35), !dbg !36
  %0 = load %struct.bn_recp_ctx_st*, %struct.bn_recp_ctx_st** %recp.addr, align 8, !dbg !37
  %1 = bitcast %struct.bn_recp_ctx_st* %0 to i8*, !dbg !38
  call void @llvm.memset.p0i8.i64(i8* %1, i8 0, i64 64, i32 8, i1 false), !dbg !38
  %2 = load %struct.bn_recp_ctx_st*, %struct.bn_recp_ctx_st** %recp.addr, align 8, !dbg !39
  %N = getelementptr inbounds %struct.bn_recp_ctx_st, %struct.bn_recp_ctx_st* %2, i32 0, i32 0, !dbg !40
  call void @bn_init(%struct.bignum_st* %N), !dbg !41

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--bn--libcrypto-shlib-bn_recp.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{i32 2, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!8 = distinct !DISubprogram(name: "BN_RECP_CTX_init", scope: !9, file: !9, line: 13, type: !10, isLocal: false, isDefinition: true, scopeLine: 14, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!9 = !DIFile(filename: "crypto/bn/bn_recp.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!10 = !DISubroutineType(types: !11)
!11 = !{null, !12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_RECP_CTX", file: !14, line: 84, baseType: !15)
!14 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bn_recp_ctx_st", file: !16, line: 246, size: 512, align: 64, elements: !17)
!16 = !DIFile(filename: "crypto/bn/bn_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!17 = !{!18, !30, !31, !32, !33}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !15, file: !16, line: 247, baseType: !19, size: 192, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIGNUM", file: !14, line: 80, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_st", file: !16, line: 218, size: 192, align: 64, elements: !21)
!21 = !{!22, !25, !27, !28, !29}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !20, file: !16, line: 219, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !20, file: !16, line: 221, baseType: !26, size: 32, align: 32, offset: 64)
!26 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "dmax", scope: !20, file: !16, line: 223, baseType: !26, size: 32, align: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "neg", scope: !20, file: !16, line: 224, baseType: !26, size: 32, align: 32, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !20, file: !16, line: 225, baseType: !26, size: 32, align: 32, offset: 160)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Nr", scope: !15, file: !16, line: 248, baseType: !19, size: 192, align: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "num_bits", scope: !15, file: !16, line: 249, baseType: !26, size: 32, align: 32, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !15, file: !16, line: 250, baseType: !26, size: 32, align: 32, offset: 416)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !15, file: !16, line: 251, baseType: !26, size: 32, align: 32, offset: 448)
!34 = !DILocalVariable(name: "recp", arg: 1, scope: !8, file: !9, line: 13, type: !12)
!35 = !DIExpression()
!36 = !DILocation(line: 13, column: 36, scope: !8)
!37 = !DILocation(line: 15, column: 12, scope: !8)
!38 = !DILocation(line: 15, column: 5, scope: !8)
!39 = !DILocation(line: 16, column: 15, scope: !8)
!40 = !DILocation(line: 16, column: 21, scope: !8)
!41 = !DILocation(line: 16, column: 5, scope: !8)
!42 = !DILocation(line: 17, column: 15, scope: !8)
!43 = !DILocation(line: 17, column: 21, scope: !8)
!44 = !DILocation(line: 17, column: 5, scope: !8)
!45 = !DILocation(line: 18, column: 1, scope: !8)
!46 = distinct !DISubprogram(name: "BN_RECP_CTX_new", scope: !9, file: !9, line: 20, type: !47, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!47 = !DISubroutineType(types: !48)
!48 = !{!12}
!49 = !DILocalVariable(name: "ret", scope: !46, file: !9, line: 22, type: !12)
!50 = !DILocation(line: 22, column: 18, scope: !46)
!51 = !DILocation(line: 24, column: 16, scope: !52)
!52 = distinct !DILexicalBlock(scope: !46, file: !9, line: 24, column: 9)
!53 = !DILocation(line: 24, column: 14, scope: !52)
!54 = !DILocation(line: 24, column: 72, scope: !52)
!55 = !DILocation(line: 24, column: 9, scope: !46)
!56 = !DILocation(line: 25, column: 9, scope: !57)
!57 = distinct !DILexicalBlock(scope: !52, file: !9, line: 24, column: 54)
!58 = !DILocation(line: 26, column: 9, scope: !57)
!59 = !DILocation(line: 29, column: 15, scope: !46)
!60 = !DILocation(line: 29, column: 20, scope: !46)
!61 = !DILocation(line: 29, column: 5, scope: !46)
!62 = !DILocation(line: 30, column: 15, scope: !46)
!63 = !DILocation(line: 30, column: 20, scope: !46)
!64 = !DILocation(line: 30, column: 5, scope: !46)
!65 = !DILocation(line: 31, column: 5, scope: !46)
!66 = !DILocation(line: 31, column: 10, scope: !46)
!67 = !DILocation(line: 31, column: 16, scope: !46)
!68 = !DILocation(line: 32, column: 12, scope: !46)
!69 = !DILocation(line: 32, column: 5, scope: !46)
!70 = !DILocation(line: 33, column: 1, scope: !46)
!71 = distinct !DISubprogram(name: "BN_RECP_CTX_free", scope: !9, file: !9, line: 35, type: !10, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!72 = !DILocalVariable(name: "recp", arg: 1, scope: !71, file: !9, line: 35, type: !12)
!73 = !DILocation(line: 35, column: 36, scope: !71)
!74 = !DILocation(line: 37, column: 9, scope: !75)
!75 = distinct !DILexicalBlock(scope: !71, file: !9, line: 37, column: 9)
!76 = !DILocation(line: 37, column: 14, scope: !75)
!77 = !DILocation(line: 37, column: 9, scope: !71)
!78 = !DILocation(line: 38, column: 9, scope: !75)
!79 = !DILocation(line: 39, column: 14, scope: !71)
!80 = !DILocation(line: 39, column: 20, scope: !71)
!81 = !DILocation(line: 39, column: 5, scope: !71)
!82 = !DILocation(line: 40, column: 14, scope: !71)
!83 = !DILocation(line: 40, column: 20, scope: !71)
!84 = !DILocation(line: 40, column: 5, scope: !71)
!85 = !DILocation(line: 41, column: 9, scope: !86)
!86 = distinct !DILexicalBlock(scope: !71, file: !9, line: 41, column: 9)
!87 = !DILocation(line: 41, column: 15, scope: !86)
!88 = !DILocation(line: 41, column: 21, scope: !86)
!89 = !DILocation(line: 41, column: 9, scope: !71)
!90 = !DILocation(line: 42, column: 21, scope: !86)
!91 = !DILocation(line: 42, column: 9, scope: !86)
!92 = !DILocation(line: 43, column: 1, scope: !71)
!93 = distinct !DISubprogram(name: "BN_RECP_CTX_set", scope: !9, file: !9, line: 45, type: !94, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!94 = !DISubroutineType(types: !95)
!95 = !{!26, !12, !96, !98}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
