; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--pkcs7--libcrypto-shlib-pk7_smime.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--pkcs7--libcrypto-shlib-pk7_smime.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.pkcs7_st = type { i8*, i64, i32, i32, %struct.asn1_object_st*, %union.anon }
%struct.asn1_object_st = type opaque
%union.anon = type { i8* }
%struct.x509_st = type opaque
%struct.evp_pkey_st = type opaque
%struct.stack_st_X509 = type opaque
%struct.bio_st = type opaque
%struct.pkcs7_signer_info_st = type { %struct.asn1_string_st*, %struct.pkcs7_issuer_and_serial_st*, %struct.X509_algor_st*, %struct.stack_st_X509_ATTRIBUTE*, %struct.X509_algor_st*, %struct.asn1_string_st*, %struct.stack_st_X509_ATTRIBUTE*, %struct.evp_pkey_st* }
%struct.pkcs7_issuer_and_serial_st = type { %struct.X509_name_st*, %struct.asn1_string_st* }
%struct.X509_name_st = type opaque
%struct.X509_algor_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_type_st = type { i32, %union.anon.0 }
%union.anon.0 = type { i8* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.stack_st_X509_ATTRIBUTE = type opaque
%struct.evp_md_st = type opaque
%struct.stack_st_X509_ALGOR = type opaque
%struct.stack_st = type opaque
%struct.evp_cipher_st = type opaque
%struct.stack_st_PKCS7_SIGNER_INFO = type opaque
%struct.x509_store_st = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--pkcs7--libcrypto-shlib-pk7_smime.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5, !6, !8, !13, !17, !20, !21, !25, !134, !136}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !11, line: 17, baseType: !12)
!11 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !11, line: 17, flags: DIFlagFwdDecl)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !15, line: 124, baseType: !16)
!15 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !15, line: 124, flags: DIFlagFwdDecl)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ALGOR", file: !19, line: 119, flags: DIFlagFwdDecl)
!19 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !11, line: 20, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DISubroutineType(types: !24)
!24 = !{null, !4}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGNER_INFO", file: !27, line: 47, baseType: !28)
!27 = !DIFile(filename: "include/openssl/pkcs7.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signer_info_st", file: !27, line: 37, size: 512, align: 64, elements: !29)
!29 = !{!30, !42, !52, !124, !127, !128, !129, !130}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !28, file: !27, line: 38, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !15, line: 40, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !19, line: 146, size: 192, align: 64, elements: !34)
!34 = !{!35, !36, !37, !40}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !33, file: !19, line: 147, baseType: !5, size: 32, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !33, file: !19, line: 148, baseType: !5, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !33, file: !19, line: 149, baseType: !38, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !33, file: !19, line: 155, baseType: !41, size: 64, align: 64, offset: 128)
!41 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_and_serial", scope: !28, file: !27, line: 39, baseType: !43, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ISSUER_AND_SERIAL", file: !27, line: 35, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_issuer_and_serial_st", file: !27, line: 32, size: 128, align: 64, elements: !46)
!46 = !{!47, !51}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !45, file: !27, line: 33, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !15, line: 129, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !15, line: 129, flags: DIFlagFwdDecl)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !45, file: !27, line: 34, baseType: !31, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "digest_alg", scope: !28, file: !27, line: 40, baseType: !53, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !15, line: 125, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !56, line: 59, size: 128, align: 64, elements: !57)
!56 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!57 = !{!58, !62}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !55, file: !56, line: 60, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !15, line: 60, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !15, line: 60, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !55, file: !56, line: 61, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !19, line: 473, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !19, line: 444, size: 128, align: 64, elements: !66)
!66 = !{!67, !68}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !65, file: !19, line: 445, baseType: !5, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !65, file: !19, line: 472, baseType: !69, size: 64, align: 64, offset: 64)
!69 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !65, file: !19, line: 446, size: 64, align: 64, elements: !70)
!70 = !{!71, !72, !74, !77, !78, !79, !82, !85, !88, !91, !94, !97, !100, !103, !106, !109, !112, !115, !118, !119, !120}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !69, file: !19, line: 447, baseType: !6, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !69, file: !19, line: 448, baseType: !73, size: 32, align: 32)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !15, line: 56, baseType: !5)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !69, file: !19, line: 449, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !15, line: 55, baseType: !33)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !69, file: !19, line: 450, baseType: !59, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !69, file: !19, line: 451, baseType: !31, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !69, file: !19, line: 452, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !15, line: 41, baseType: !33)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !69, file: !19, line: 453, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !15, line: 42, baseType: !33)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !69, file: !19, line: 454, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !15, line: 43, baseType: !33)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !69, file: !19, line: 455, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !15, line: 44, baseType: !33)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !69, file: !19, line: 456, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !15, line: 45, baseType: !33)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !69, file: !19, line: 457, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !15, line: 46, baseType: !33)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !69, file: !19, line: 458, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !15, line: 47, baseType: !33)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !69, file: !19, line: 459, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !15, line: 49, baseType: !33)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !69, file: !19, line: 460, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !15, line: 48, baseType: !33)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !69, file: !19, line: 461, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !15, line: 50, baseType: !33)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !69, file: !19, line: 462, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !15, line: 52, baseType: !33)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !69, file: !19, line: 463, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !15, line: 53, baseType: !33)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !69, file: !19, line: 464, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !15, line: 54, baseType: !33)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !69, file: !19, line: 469, baseType: !75, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !69, file: !19, line: 470, baseType: !75, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !69, file: !19, line: 471, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !19, line: 213, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !19, line: 213, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "auth_attr", scope: !28, file: !27, line: 41, baseType: !125, size: 64, align: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ATTRIBUTE", file: !56, line: 89, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "digest_enc_alg", scope: !28, file: !27, line: 42, baseType: !53, size: 64, align: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "enc_digest", scope: !28, file: !27, line: 43, baseType: !86, size: 64, align: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "unauth_attr", scope: !28, file: !27, line: 44, baseType: !125, size: 64, align: 64, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !28, file: !27, line: 46, baseType: !131, size: 64, align: 64, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !15, line: 95, baseType: !133)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !15, line: 95, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !56, line: 99, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!138 = !{i32 2, !"Dwarf Version", i32 4}
!139 = !{i32 2, !"Debug Info Version", i32 3}
!140 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!141 = distinct !DISubprogram(name: "PKCS7_sign", scope: !142, file: !142, line: 22, type: !143, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!142 = !DIFile(filename: "crypto/pkcs7/pk7_smime.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !13, !131, !134, !226, !5}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7", file: !27, line: 144, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_st", file: !27, line: 109, size: 320, align: 64, elements: !148)
!148 = !{!149, !150, !151, !152, !153, !154}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "asn1", scope: !147, file: !27, line: 114, baseType: !38, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !147, file: !27, line: 115, baseType: !41, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !147, file: !27, line: 119, baseType: !5, size: 32, align: 32, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !147, file: !27, line: 120, baseType: !5, size: 32, align: 32, offset: 160)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !27, line: 121, baseType: !59, size: 64, align: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !147, file: !27, line: 143, baseType: !155, size: 64, align: 64, offset: 256)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !27, line: 127, size: 64, align: 64, elements: !156)
!156 = !{!157, !158, !159, !175, !197, !209, !218, !225}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !155, file: !27, line: 128, baseType: !6, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !155, file: !27, line: 130, baseType: !86, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !155, file: !27, line: 132, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGNED", file: !27, line: 68, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signed_st", file: !27, line: 61, size: 384, align: 64, elements: !163)
!163 = !{!164, !165, !166, !167, !170, !173}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !162, file: !27, line: 62, baseType: !31, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !162, file: !27, line: 63, baseType: !17, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !162, file: !27, line: 64, baseType: !134, size: 64, align: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !162, file: !27, line: 65, baseType: !168, size: 64, align: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_CRL", file: !56, line: 228, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !162, file: !27, line: 66, baseType: !171, size: 64, align: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_SIGNER_INFO", file: !27, line: 49, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !162, file: !27, line: 67, baseType: !174, size: 64, align: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "enveloped", scope: !155, file: !27, line: 134, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENVELOPE", file: !27, line: 85, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enveloped_st", file: !27, line: 81, size: 192, align: 64, elements: !179)
!179 = !{!180, !181, !184}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !178, file: !27, line: 82, baseType: !31, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !178, file: !27, line: 83, baseType: !182, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_RECIP_INFO", file: !27, line: 59, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !178, file: !27, line: 84, baseType: !185, size: 64, align: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENC_CONTENT", file: !27, line: 79, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enc_content_st", file: !27, line: 74, size: 256, align: 64, elements: !188)
!188 = !{!189, !190, !191, !192}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !187, file: !27, line: 75, baseType: !59, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !187, file: !27, line: 76, baseType: !53, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !187, file: !27, line: 77, baseType: !86, size: 64, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !187, file: !27, line: 78, baseType: !193, size: 64, align: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !15, line: 89, baseType: !196)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !15, line: 89, flags: DIFlagFwdDecl)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "signed_and_enveloped", scope: !155, file: !27, line: 136, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGN_ENVELOPE", file: !27, line: 95, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signedandenveloped_st", file: !27, line: 87, size: 448, align: 64, elements: !201)
!201 = !{!202, !203, !204, !205, !206, !207, !208}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !200, file: !27, line: 88, baseType: !31, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !200, file: !27, line: 89, baseType: !17, size: 64, align: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !200, file: !27, line: 90, baseType: !134, size: 64, align: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !200, file: !27, line: 91, baseType: !168, size: 64, align: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !200, file: !27, line: 92, baseType: !171, size: 64, align: 64, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !200, file: !27, line: 93, baseType: !185, size: 64, align: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !200, file: !27, line: 94, baseType: !182, size: 64, align: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !155, file: !27, line: 138, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_DIGEST", file: !27, line: 102, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_digest_st", file: !27, line: 97, size: 256, align: 64, elements: !213)
!213 = !{!214, !215, !216, !217}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !212, file: !27, line: 98, baseType: !31, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !212, file: !27, line: 99, baseType: !53, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !212, file: !27, line: 100, baseType: !174, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !212, file: !27, line: 101, baseType: !86, size: 64, align: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "encrypted", scope: !155, file: !27, line: 140, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENCRYPT", file: !27, line: 107, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_encrypted_st", file: !27, line: 104, size: 128, align: 64, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !221, file: !27, line: 105, baseType: !31, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !221, file: !27, line: 106, baseType: !185, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !155, file: !27, line: 142, baseType: !63, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !15, line: 79, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !15, line: 79, flags: DIFlagFwdDecl)
!229 = !DILocalVariable(name: "signcert", arg: 1, scope: !141, file: !142, line: 22, type: !13)
!230 = !DIExpression()
!231 = !DILocation(line: 22, column: 25, scope: !141)
!232 = !DILocalVariable(name: "pkey", arg: 2, scope: !141, file: !142, line: 22, type: !131)
!233 = !DILocation(line: 22, column: 45, scope: !141)
!234 = !DILocalVariable(name: "certs", arg: 3, scope: !141, file: !142, line: 22, type: !134)
!235 = !DILocation(line: 22, column: 73, scope: !141)
!236 = !DILocalVariable(name: "data", arg: 4, scope: !141, file: !142, line: 23, type: !226)
!237 = !DILocation(line: 23, column: 24, scope: !141)
!238 = !DILocalVariable(name: "flags", arg: 5, scope: !141, file: !142, line: 23, type: !5)
!239 = !DILocation(line: 23, column: 34, scope: !141)
!240 = !DILocalVariable(name: "p7", scope: !141, file: !142, line: 25, type: !145)
!241 = !DILocation(line: 25, column: 12, scope: !141)
!242 = !DILocalVariable(name: "i", scope: !141, file: !142, line: 26, type: !5)
!243 = !DILocation(line: 26, column: 9, scope: !141)
!244 = !DILocation(line: 28, column: 15, scope: !245)
!245 = distinct !DILexicalBlock(scope: !141, file: !142, line: 28, column: 9)
!246 = !DILocation(line: 28, column: 13, scope: !245)
!247 = !DILocation(line: 28, column: 28, scope: !245)
!248 = !DILocation(line: 28, column: 9, scope: !141)
!249 = !DILocation(line: 29, column: 9, scope: !250)
!250 = distinct !DILexicalBlock(scope: !245, file: !142, line: 28, column: 36)
!251 = !DILocation(line: 30, column: 9, scope: !250)
!252 = !DILocation(line: 33, column: 25, scope: !253)
!253 = distinct !DILexicalBlock(scope: !141, file: !142, line: 33, column: 9)
!254 = !DILocation(line: 33, column: 10, scope: !253)
!255 = !DILocation(line: 33, column: 9, scope: !141)
!256 = !DILocation(line: 34, column: 9, scope: !253)
!257 = !DILocation(line: 36, column: 28, scope: !258)
!258 = distinct !DILexicalBlock(scope: !141, file: !142, line: 36, column: 9)
!259 = !DILocation(line: 36, column: 10, scope: !258)
!260 = !DILocation(line: 36, column: 9, scope: !141)
!261 = !DILocation(line: 37, column: 9, scope: !258)
!262 = !DILocation(line: 39, column: 9, scope: !263)
!263 = distinct !DILexicalBlock(scope: !141, file: !142, line: 39, column: 9)
!264 = !DILocation(line: 39, column: 14, scope: !263)
!265 = !DILocation(line: 39, column: 40, scope: !266)
!266 = !DILexicalBlockFile(scope: !263, file: !142, discriminator: 1)
!267 = !DILocation(line: 39, column: 44, scope: !266)
!268 = !DILocation(line: 39, column: 54, scope: !266)
!269 = !DILocation(line: 39, column: 65, scope: !266)
!270 = !DILocation(line: 39, column: 18, scope: !266)
!271 = !DILocation(line: 39, column: 9, scope: !266)
!272 = !DILocation(line: 40, column: 9, scope: !273)
!273 = distinct !DILexicalBlock(scope: !263, file: !142, line: 39, column: 73)
!274 = !DILocation(line: 41, column: 9, scope: !273)
!275 = !DILocation(line: 44, column: 11, scope: !276)
!276 = distinct !DILexicalBlock(scope: !141, file: !142, line: 44, column: 9)
!277 = !DILocation(line: 44, column: 17, scope: !276)
!278 = !DILocation(line: 44, column: 9, scope: !141)
!279 = !DILocation(line: 45, column: 16, scope: !280)
!280 = distinct !DILexicalBlock(scope: !281, file: !142, line: 45, column: 9)
!281 = distinct !DILexicalBlock(scope: !276, file: !142, line: 44, column: 25)
!282 = !DILocation(line: 45, column: 14, scope: !280)
!283 = !DILocation(line: 45, column: 21, scope: !284)
