; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--sm2--libcrypto-lib-sm2_crypt.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--sm2--libcrypto-lib-sm2_crypt.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.SM2_Ciphertext_st = type { %struct.bignum_st*, %struct.bignum_st*, %struct.asn1_string_st*, %struct.asn1_string_st* }
%struct.bignum_st = type opaque
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.ASN1_VALUE_st = type opaque
%struct.ec_key_st = type opaque
%struct.evp_md_st = type opaque
%struct.ec_group_st = type opaque
%struct.bignum_ctx = type opaque
%struct.evp_md_ctx_st = type opaque
%struct.ec_point_st = type opaque


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !38)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--sm2--libcrypto-lib-sm2_crypt.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !30, !31, !34, !37}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "SM2_Ciphertext", file: !6, line: 22, baseType: !7)
!6 = !DIFile(filename: "crypto/sm2/sm2_crypt.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SM2_Ciphertext_st", file: !6, line: 25, size: 256, align: 64, elements: !8)
!8 = !{!9, !14, !15, !29}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "C1x", scope: !7, file: !6, line: 26, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIGNUM", file: !12, line: 80, baseType: !13)
!12 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_st", file: !12, line: 80, flags: DIFlagFwdDecl)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "C1y", scope: !7, file: !6, line: 27, baseType: !10, size: 64, align: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "C3", scope: !7, file: !6, line: 28, baseType: !16, size: 64, align: 64, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !12, line: 43, baseType: !18)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !19, line: 146, size: 192, align: 64, elements: !20)
!19 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!20 = !{!21, !23, !24, !27}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !18, file: !19, line: 147, baseType: !22, size: 32, align: 32)
!22 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !18, file: !19, line: 148, baseType: !22, size: 32, align: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !18, file: !19, line: 149, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !18, file: !19, line: 155, baseType: !28, size: 64, align: 64, offset: 128)
!28 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "C2", scope: !7, file: !6, line: 29, baseType: !16, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !19, line: 213, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !19, line: 213, flags: DIFlagFwdDecl)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !35, line: 216, baseType: !36)
!35 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!36 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!38 = !{!39, !69}
!39 = distinct !DIGlobalVariable(name: "SM2_Ciphertext_it", scope: !0, file: !6, line: 37, type: !40, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @SM2_Ciphertext_it)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !12, line: 62, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !43, line: 580, size: 448, align: 64, elements: !44)
!43 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!44 = !{!45, !47, !48, !63, !64, !67, !68}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !42, file: !43, line: 581, baseType: !46, size: 8, align: 8)
!46 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !42, file: !43, line: 583, baseType: !28, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !42, file: !43, line: 584, baseType: !49, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !19, line: 210, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !43, line: 468, size: 320, align: 64, elements: !53)
!53 = !{!54, !55, !56, !57, !60}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !52, file: !43, line: 469, baseType: !36, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !52, file: !43, line: 470, baseType: !28, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !52, file: !43, line: 471, baseType: !36, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !52, file: !43, line: 472, baseType: !58, size: 64, align: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !52, file: !43, line: 473, baseType: !61, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !19, line: 318, baseType: !40)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !42, file: !43, line: 586, baseType: !28, size: 64, align: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !42, file: !43, line: 587, baseType: !65, size: 64, align: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !42, file: !43, line: 588, baseType: !28, size: 64, align: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !42, file: !43, line: 589, baseType: !58, size: 64, align: 64, offset: 384)
!69 = distinct !DIGlobalVariable(name: "SM2_Ciphertext_seq_tt", scope: !0, file: !6, line: 32, type: !70, isLocal: true, isDefinition: true, variable: [4 x %struct.ASN1_TEMPLATE_st]* @SM2_Ciphertext_seq_tt)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 1280, align: 64, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 4)
!73 = !{i32 2, !"Dwarf Version", i32 4}
!74 = !{i32 2, !"Debug Info Version", i32 3}
!75 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!76 = distinct !DISubprogram(name: "d2i_SM2_Ciphertext", scope: !6, file: !6, line: 39, type: !77, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!77 = !DISubroutineType(types: !78)
!78 = !{!4, !79, !80, !28}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!83 = !DILocalVariable(name: "a", arg: 1, scope: !76, file: !6, line: 39, type: !79)
!84 = !DIExpression()
!85 = !DILocation(line: 39, column: 53, scope: !76)
!86 = !DILocalVariable(name: "in", arg: 2, scope: !76, file: !6, line: 39, type: !80)
!87 = !DILocation(line: 39, column: 78, scope: !76)
!88 = !DILocalVariable(name: "len", arg: 3, scope: !76, file: !6, line: 39, type: !28)
!89 = !DILocation(line: 39, column: 87, scope: !76)
!90 = !DILocation(line: 39, column: 148, scope: !76)
!91 = !DILocation(line: 39, column: 133, scope: !76)
!92 = !DILocation(line: 39, column: 151, scope: !76)
!93 = !DILocation(line: 39, column: 155, scope: !76)
!94 = !DILocation(line: 39, column: 119, scope: !76)
!95 = !DILocation(line: 39, column: 101, scope: !76)
!96 = !DILocation(line: 39, column: 94, scope: !76)
!97 = distinct !DISubprogram(name: "i2d_SM2_Ciphertext", scope: !6, file: !6, line: 39, type: !98, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!98 = !DISubroutineType(types: !99)
!99 = !{!22, !4, !100}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!101 = !DILocalVariable(name: "a", arg: 1, scope: !97, file: !6, line: 39, type: !4)
!102 = !DILocation(line: 39, column: 226, scope: !97)
!103 = !DILocalVariable(name: "out", arg: 2, scope: !97, file: !6, line: 39, type: !100)
!104 = !DILocation(line: 39, column: 245, scope: !97)
!105 = !DILocation(line: 39, column: 287, scope: !97)
!106 = !DILocation(line: 39, column: 273, scope: !97)
!107 = !DILocation(line: 39, column: 290, scope: !97)
!108 = !DILocation(line: 39, column: 259, scope: !97)
!109 = !DILocation(line: 39, column: 252, scope: !97)
!110 = distinct !DISubprogram(name: "SM2_Ciphertext_new", scope: !6, file: !6, line: 39, type: !111, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!111 = !DISubroutineType(types: !112)
!112 = !{!4}
!113 = !DILocation(line: 39, column: 390, scope: !110)
!114 = !DILocation(line: 39, column: 372, scope: !110)
!115 = !DILocation(line: 39, column: 365, scope: !110)
!116 = distinct !DISubprogram(name: "SM2_Ciphertext_free", scope: !6, file: !6, line: 39, type: !117, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !4}
!119 = !DILocalVariable(name: "a", arg: 1, scope: !116, file: !6, line: 39, type: !4)
!120 = !DILocation(line: 39, column: 472, scope: !116)
!121 = !DILocation(line: 39, column: 506, scope: !116)
!122 = !DILocation(line: 39, column: 492, scope: !116)
!123 = !DILocation(line: 39, column: 477, scope: !116)
!124 = !DILocation(line: 39, column: 534, scope: !116)
