; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-lib-v3_pmaps.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-lib-v3_pmaps.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.v3_ext_method = type { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, {}*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }
%struct.stack_st_CONF_VALUE = type opaque
%struct.v3_ext_ctx = type { i32, %struct.x509_st*, %struct.x509_st*, %struct.X509_req_st*, %struct.X509_crl_st*, %struct.X509V3_CONF_METHOD_st*, i8* }
%struct.x509_st = type opaque
%struct.X509_req_st = type opaque
%struct.X509_crl_st = type opaque
%struct.X509V3_CONF_METHOD_st = type { i8* (i8*, i8*, i8*)*, %struct.stack_st_CONF_VALUE* (i8*, i8*)*, void (i8*, i8*)*, void (i8*, %struct.stack_st_CONF_VALUE*)* }
%struct.bio_st = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !49)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--x509v3--libcrypto-lib-v3_pmaps.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !15, !19, !24, !25, !27, !34, !44, !32, !45}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "POLICY_MAPPING", file: !6, line: 260, baseType: !7)
!6 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "POLICY_MAPPING_st", file: !6, line: 257, size: 128, align: 64, elements: !8)
!8 = !{!9, !14}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "issuerDomainPolicy", scope: !7, file: !6, line: 258, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !12, line: 60, baseType: !13)
!12 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !12, line: 60, flags: DIFlagFwdDecl)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "subjectDomainPolicy", scope: !7, file: !6, line: 259, baseType: !10, size: 64, align: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !17, line: 213, baseType: !18)
!17 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !17, line: 213, flags: DIFlagFwdDecl)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !22, line: 17, baseType: !23)
!22 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !22, line: 17, flags: DIFlagFwdDecl)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_POLICY_MAPPING", file: !6, line: 262, flags: DIFlagFwdDecl)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_compfunc", file: !22, line: 19, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!31, !32, !32}
!31 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_VALUE", file: !36, line: 28, baseType: !37)
!36 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 24, size: 192, align: 64, elements: !38)
!38 = !{!39, !42, !43}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !37, file: !36, line: 25, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !37, file: !36, line: 26, baseType: !40, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !37, file: !36, line: 27, baseType: !40, size: 64, align: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !22, line: 20, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !24}
!49 = !{!50, !185, !186, !187, !191}
!50 = distinct !DIGlobalVariable(name: "v3_policy_mappings", scope: !0, file: !51, line: 23, type: !52, isLocal: false, isDefinition: true, variable: { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, i8* (%struct.v3_ext_method*, i8*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }* @v3_policy_mappings)
!51 = !DIFile(filename: "crypto/x509v3/v3_pmaps.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_METHOD", file: !6, line: 92, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_method", file: !6, line: 49, size: 832, align: 64, elements: !55)
!55 = !{!56, !57, !58, !87, !92, !94, !103, !110, !117, !164, !169, !174, !182, !184}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ext_nid", scope: !54, file: !6, line: 50, baseType: !31, size: 32, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !54, file: !6, line: 51, baseType: !31, size: 32, align: 32, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !54, file: !6, line: 53, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !17, line: 318, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !12, line: 62, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !64, line: 580, size: 448, align: 64, elements: !65)
!64 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!65 = !{!66, !67, !69, !83, !84, !85, !86}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !63, file: !64, line: 581, baseType: !41, size: 8, align: 8)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !63, file: !64, line: 583, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !63, file: !64, line: 584, baseType: !70, size: 64, align: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !17, line: 210, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !64, line: 468, size: 320, align: 64, elements: !74)
!74 = !{!75, !77, !78, !79, !82}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !73, file: !64, line: 469, baseType: !76, size: 64, align: 64)
!76 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !73, file: !64, line: 470, baseType: !68, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !73, file: !64, line: 471, baseType: !76, size: 64, align: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !73, file: !64, line: 472, baseType: !80, size: 64, align: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !73, file: !64, line: 473, baseType: !59, size: 64, align: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !63, file: !64, line: 586, baseType: !68, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !63, file: !64, line: 587, baseType: !32, size: 64, align: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !63, file: !64, line: 588, baseType: !68, size: 64, align: 64, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !63, file: !64, line: 589, baseType: !80, size: 64, align: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ext_new", scope: !54, file: !6, line: 55, baseType: !88, size: 64, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_NEW", file: !6, line: 28, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!24}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ext_free", scope: !54, file: !6, line: 56, baseType: !93, size: 64, align: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_FREE", file: !6, line: 29, baseType: !46)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "d2i", scope: !54, file: !6, line: 57, baseType: !95, size: 64, align: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_D2I", file: !6, line: 30, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!24, !24, !99, !68}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!102 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i2d", scope: !54, file: !6, line: 58, baseType: !104, size: 64, align: 64, offset: 320)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2D", file: !6, line: 31, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!31, !24, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i2s", scope: !54, file: !6, line: 60, baseType: !111, size: 64, align: 64, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2S", file: !6, line: 38, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!40, !115, !24}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "s2i", scope: !54, file: !6, line: 61, baseType: !118, size: 64, align: 64, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_S2I", file: !6, line: 40, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!24, !115, !122, !80}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_ctx", file: !6, line: 79, size: 448, align: 64, elements: !124)
!124 = !{!125, !126, !130, !131, !136, !140, !163}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !123, file: !6, line: 82, baseType: !31, size: 32, align: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_cert", scope: !123, file: !6, line: 83, baseType: !127, size: 64, align: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !12, line: 124, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !12, line: 124, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "subject_cert", scope: !123, file: !6, line: 84, baseType: !127, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "subject_req", scope: !123, file: !6, line: 85, baseType: !132, size: 64, align: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_REQ", file: !134, line: 93, baseType: !135)
!134 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_req_st", file: !134, line: 93, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !123, file: !6, line: 86, baseType: !137, size: 64, align: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !12, line: 126, baseType: !139)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !12, line: 126, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "db_meth", scope: !123, file: !6, line: 87, baseType: !141, size: 64, align: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CONF_METHOD", file: !6, line: 76, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509V3_CONF_METHOD_st", file: !6, line: 71, size: 256, align: 64, elements: !144)
!144 = !{!145, !149, !155, !159}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "get_string", scope: !143, file: !6, line: 72, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!40, !24, !80, !80}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "get_section", scope: !143, file: !6, line: 73, baseType: !150, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !24, !80}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !36, line: 30, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "free_string", scope: !143, file: !6, line: 74, baseType: !156, size: 64, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !24, !40}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "free_section", scope: !143, file: !6, line: 75, baseType: !160, size: 64, align: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !24, !153}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !123, file: !6, line: 88, baseType: !24, size: 64, align: 64, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i2v", scope: !54, file: !6, line: 63, baseType: !165, size: 64, align: 64, offset: 512)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2V", file: !6, line: 33, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!153, !115, !24, !153}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "v2i", scope: !54, file: !6, line: 64, baseType: !170, size: 64, align: 64, offset: 576)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_V2I", file: !6, line: 35, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!24, !115, !122, !153}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "i2r", scope: !54, file: !6, line: 66, baseType: !175, size: 64, align: 64, offset: 640)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2R", file: !6, line: 42, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!31, !115, !24, !179, !31}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !12, line: 79, baseType: !181)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !12, line: 79, flags: DIFlagFwdDecl)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "r2i", scope: !54, file: !6, line: 67, baseType: !183, size: 64, align: 64, offset: 704)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_R2I", file: !6, line: 44, baseType: !119)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "usr_data", scope: !54, file: !6, line: 68, baseType: !24, size: 64, align: 64, offset: 768)
!185 = distinct !DIGlobalVariable(name: "POLICY_MAPPING_it", scope: !0, file: !51, line: 37, type: !61, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @POLICY_MAPPING_it)
!186 = distinct !DIGlobalVariable(name: "POLICY_MAPPINGS_it", scope: !0, file: !51, line: 42, type: !61, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @POLICY_MAPPINGS_it)
!187 = distinct !DIGlobalVariable(name: "POLICY_MAPPING_seq_tt", scope: !0, file: !51, line: 34, type: !188, isLocal: true, isDefinition: true, variable: [2 x %struct.ASN1_TEMPLATE_st]* @POLICY_MAPPING_seq_tt)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 640, align: 64, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 2)
!191 = distinct !DIGlobalVariable(name: "POLICY_MAPPINGS_item_tt", scope: !0, file: !51, line: 39, type: !71, isLocal: true, isDefinition: true, variable: %struct.ASN1_TEMPLATE_st* @POLICY_MAPPINGS_item_tt)
!192 = !{i32 2, !"Dwarf Version", i32 4}
!193 = !{i32 2, !"Debug Info Version", i32 3}
!194 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!195 = distinct !DISubprogram(name: "i2v_POLICY_MAPPINGS", scope: !51, file: !51, line: 46, type: !196, isLocal: true, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!196 = !DISubroutineType(types: !197)
!197 = !{!153, !198, !24, !153}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!199 = !DILocalVariable(name: "method", arg: 1, scope: !195, file: !51, line: 47, type: !198)
!200 = !DIExpression()
!201 = !DILocation(line: 47, column: 51, scope: !195)
!202 = !DILocalVariable(name: "a", arg: 2, scope: !195, file: !51, line: 47, type: !24)
!203 = !DILocation(line: 47, column: 65, scope: !195)
!204 = !DILocalVariable(name: "ext_list", arg: 3, scope: !195, file: !51, line: 48, type: !153)
!205 = !DILocation(line: 48, column: 51, scope: !195)
!206 = !DILocalVariable(name: "pmaps", scope: !195, file: !51, line: 50, type: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "POLICY_MAPPINGS", file: !6, line: 264, baseType: !26)
!209 = !DILocation(line: 50, column: 22, scope: !195)
!210 = !DILocation(line: 50, column: 30, scope: !195)
!211 = !DILocalVariable(name: "pmap", scope: !195, file: !51, line: 51, type: !4)
!212 = !DILocation(line: 51, column: 21, scope: !195)
!213 = !DILocalVariable(name: "i", scope: !195, file: !51, line: 52, type: !31)
!214 = !DILocation(line: 52, column: 9, scope: !195)
!215 = !DILocalVariable(name: "obj_tmp1", scope: !195, file: !51, line: 53, type: !216)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 640, align: 8, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 80)
!219 = !DILocation(line: 53, column: 10, scope: !195)
!220 = !DILocalVariable(name: "obj_tmp2", scope: !195, file: !51, line: 54, type: !216)
!221 = !DILocation(line: 54, column: 10, scope: !195)
!222 = !DILocation(line: 56, column: 12, scope: !223)
!223 = distinct !DILexicalBlock(scope: !195, file: !51, line: 56, column: 5)
!224 = !DILocation(line: 56, column: 10, scope: !223)
!225 = !DILocation(line: 56, column: 17, scope: !226)
!226 = !DILexicalBlockFile(scope: !227, file: !51, discriminator: 1)
!227 = distinct !DILexicalBlock(scope: !223, file: !51, line: 56, column: 5)
!228 = !DILocation(line: 56, column: 43, scope: !226)
!229 = !DILocation(line: 56, column: 21, scope: !226)
!230 = !DILocation(line: 56, column: 19, scope: !226)
!231 = !DILocation(line: 56, column: 5, scope: !226)
!232 = !DILocation(line: 57, column: 40, scope: !233)
!233 = distinct !DILexicalBlock(scope: !227, file: !51, line: 56, column: 56)
!234 = !DILocation(line: 57, column: 47, scope: !233)
!235 = !DILocation(line: 57, column: 16, scope: !233)
