; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-a_time.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-a_time.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.ASN1_VALUE_st = type opaque
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.bio_st = type opaque

@.str = private unnamed_addr constant [10 x i8] c"ASN1_TIME\00", align 1
@ASN1_TIME_it = constant %struct.ASN1_ITEM_st { i8 5, i64 49152, %struct.ASN1_TEMPLATE_st* null, i64 0, i8* null, i64 24, i8* getelementptr inbounds ([10 x i8], [10 x i8]* @.str, i32 0, i32 0) }, align 8
@asn1_time_to_tm.min = internal constant [9 x i32] [i32 0, i32 0, i32 1, i32 1, i32 0, i32 0, i32 0, i32 0, i32 0], align 16
@asn1_time_to_tm.max = internal constant [9 x i32] [i32 99, i32 99, i32 12, i32 31, i32 23, i32 59, i32 59, i32 12, i32 59], align 16
@asn1_time_to_tm.mdays = internal constant [12 x i32] [i32 31, i32 28, i32 31, i32 30, i32 31, i32 30, i32 31, i32 31, i32 30, i32 31, i32 30, i32 31], align 16
@.str.1 = private unnamed_addr constant [26 x i8] c"%04d%02d%02d%02d%02d%02dZ\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !27)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-a_time.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !18, !19, !22, !24, !14, !25}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TIME", file: !6, line: 51, baseType: !7)
!6 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !8, line: 146, size: 192, align: 64, elements: !9)
!8 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!9 = !{!10, !12, !13, !16}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !7, file: !8, line: 147, baseType: !11, size: 32, align: 32)
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !7, file: !8, line: 148, baseType: !11, size: 32, align: 32, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !7, file: !8, line: 149, baseType: !14, size: 64, align: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !7, file: !8, line: 155, baseType: !17, size: 64, align: 64, offset: 128)
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !8, line: 213, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !8, line: 213, flags: DIFlagFwdDecl)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !6, line: 55, baseType: !7)
!27 = !{!28, !59, !84, !85, !89, !93}
!28 = distinct !DIGlobalVariable(name: "ASN1_TIME_it", scope: !0, file: !29, line: 24, type: !30, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_TIME_it)
!29 = !DIFile(filename: "crypto/asn1/a_time.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !6, line: 62, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !33, line: 580, size: 448, align: 64, elements: !34)
!33 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!34 = !{!35, !36, !37, !53, !54, !57, !58}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !32, file: !33, line: 581, baseType: !23, size: 8, align: 8)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !32, file: !33, line: 583, baseType: !17, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !32, file: !33, line: 584, baseType: !38, size: 64, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !8, line: 210, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !33, line: 468, size: 320, align: 64, elements: !42)
!42 = !{!43, !45, !46, !47, !50}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !41, file: !33, line: 469, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !41, file: !33, line: 470, baseType: !17, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !41, file: !33, line: 471, baseType: !44, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !41, file: !33, line: 472, baseType: !48, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !41, file: !33, line: 473, baseType: !51, size: 64, align: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !8, line: 318, baseType: !30)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !32, file: !33, line: 586, baseType: !17, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !32, file: !33, line: 587, baseType: !55, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !32, file: !33, line: 588, baseType: !17, size: 64, align: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !32, file: !33, line: 589, baseType: !48, size: 64, align: 64, offset: 384)
!59 = distinct !DIGlobalVariable(name: "min", scope: !60, file: !29, line: 76, type: !80, isLocal: true, isDefinition: true, variable: [9 x i32]* @asn1_time_to_tm.min)
!60 = distinct !DISubprogram(name: "asn1_time_to_tm", scope: !29, file: !29, line: 74, type: !61, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!61 = !DISubroutineType(types: !62)
!62 = !{!11, !63, !78}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !65, line: 133, size: 448, align: 64, elements: !66)
!65 = !DIFile(filename: "/usr/include/time.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !64, file: !65, line: 135, baseType: !11, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !64, file: !65, line: 136, baseType: !11, size: 32, align: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !64, file: !65, line: 137, baseType: !11, size: 32, align: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !64, file: !65, line: 138, baseType: !11, size: 32, align: 32, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !64, file: !65, line: 139, baseType: !11, size: 32, align: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !64, file: !65, line: 140, baseType: !11, size: 32, align: 32, offset: 160)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !64, file: !65, line: 141, baseType: !11, size: 32, align: 32, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !64, file: !65, line: 142, baseType: !11, size: 32, align: 32, offset: 224)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !64, file: !65, line: 143, baseType: !11, size: 32, align: 32, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !64, file: !65, line: 146, baseType: !17, size: 64, align: 64, offset: 320)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !64, file: !65, line: 147, baseType: !48, size: 64, align: 64, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 288, align: 32, elements: !82)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!82 = !{!83}
!83 = !DISubrange(count: 9)
!84 = distinct !DIGlobalVariable(name: "max", scope: !60, file: !29, line: 77, type: !80, isLocal: true, isDefinition: true, variable: [9 x i32]* @asn1_time_to_tm.max)
!85 = distinct !DIGlobalVariable(name: "mdays", scope: !60, file: !29, line: 78, type: !86, isLocal: true, isDefinition: true, variable: [12 x i32]* @asn1_time_to_tm.mdays)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 384, align: 32, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 12)
!89 = distinct !DIGlobalVariable(name: "ydays", scope: !90, file: !29, line: 50, type: !86, isLocal: true, isDefinition: true, variable: [12 x i32]* @determine_days.ydays)
!90 = distinct !DISubprogram(name: "determine_days", scope: !29, file: !29, line: 48, type: !91, isLocal: true, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !63}
!93 = distinct !DIGlobalVariable(name: "_asn1_mon", scope: !0, file: !29, line: 460, type: !94, isLocal: true, isDefinition: true, variable: [12 x [4 x i8]]* @_asn1_mon)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 384, align: 8, elements: !95)
!95 = !{!88, !96}
!96 = !DISubrange(count: 4)
!97 = !{i32 2, !"Dwarf Version", i32 4}
!98 = !{i32 2, !"Debug Info Version", i32 3}
!99 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!100 = distinct !DISubprogram(name: "d2i_ASN1_TIME", scope: !29, file: !29, line: 26, type: !101, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!101 = !DISubroutineType(types: !102)
!102 = !{!4, !103, !104, !17}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!107 = !DILocalVariable(name: "a", arg: 1, scope: !100, file: !29, line: 26, type: !103)
!108 = !DIExpression()
!109 = !DILocation(line: 26, column: 38, scope: !100)
!110 = !DILocalVariable(name: "in", arg: 2, scope: !100, file: !29, line: 26, type: !104)
!111 = !DILocation(line: 26, column: 63, scope: !100)
!112 = !DILocalVariable(name: "len", arg: 3, scope: !100, file: !29, line: 26, type: !17)
!113 = !DILocation(line: 26, column: 72, scope: !100)
!114 = !DILocation(line: 26, column: 128, scope: !100)
!115 = !DILocation(line: 26, column: 113, scope: !100)
!116 = !DILocation(line: 26, column: 131, scope: !100)
!117 = !DILocation(line: 26, column: 135, scope: !100)
!118 = !DILocation(line: 26, column: 99, scope: !100)
!119 = !DILocation(line: 26, column: 86, scope: !100)
!120 = !DILocation(line: 26, column: 79, scope: !100)
!121 = distinct !DISubprogram(name: "i2d_ASN1_TIME", scope: !29, file: !29, line: 26, type: !122, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!122 = !DISubroutineType(types: !123)
!123 = !{!11, !4, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!125 = !DILocalVariable(name: "a", arg: 1, scope: !121, file: !29, line: 26, type: !4)
!126 = !DILocation(line: 26, column: 191, scope: !121)
!127 = !DILocalVariable(name: "out", arg: 2, scope: !121, file: !29, line: 26, type: !124)
!128 = !DILocation(line: 26, column: 210, scope: !121)
!129 = !DILocation(line: 26, column: 252, scope: !121)
