; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--bn--libcrypto-shlib-bn_mont.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--bn--libcrypto-shlib-bn_mont.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bignum_st = type { i64*, i32, i32, i32, i32 }
%struct.bn_mont_ctx_st = type { i32, %struct.bignum_st, %struct.bignum_st, %struct.bignum_st, [2 x i64], i32 }
%struct.bignum_ctx = type opaque

@.str = private unnamed_addr constant [20 x i8] c"crypto/bn/bn_mont.c\00", align 1

; Function Attrs: nounwind uwtable
define i32 @BN_mod_mul_montgomery(%struct.bignum_st* %r, %struct.bignum_st* %a, %struct.bignum_st* %b, %struct.bn_mont_ctx_st* %mont, %struct.bignum_ctx* %ctx) #0 !dbg !9 {
entry:
  %r.addr = alloca %struct.bignum_st*, align 8
  %a.addr = alloca %struct.bignum_st*, align 8
  %b.addr = alloca %struct.bignum_st*, align 8
  %mont.addr = alloca %struct.bn_mont_ctx_st*, align 8
  %ctx.addr = alloca %struct.bignum_ctx*, align 8
  %ret = alloca i32, align 4
  store %struct.bignum_st* %r, %struct.bignum_st** %r.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.bignum_st** %r.addr, metadata !44, metadata !45), !dbg !46
  store %struct.bignum_st* %a, %struct.bignum_st** %a.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.bignum_st** %a.addr, metadata !47, metadata !45), !dbg !48

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--bn--libcrypto-shlib-bn_mont.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!6 = !{i32 2, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!9 = distinct !DISubprogram(name: "BN_mod_mul_montgomery", scope: !10, file: !10, line: 26, type: !11, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!10 = !DIFile(filename: "crypto/bn/bn_mont.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !26, !26, !28, !41}
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIGNUM", file: !16, line: 80, baseType: !17)
!16 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_st", file: !18, line: 218, size: 192, align: 64, elements: !19)
!18 = !DIFile(filename: "crypto/bn/bn_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!19 = !{!20, !22, !23, !24, !25}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !17, file: !18, line: 219, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !17, file: !18, line: 221, baseType: !13, size: 32, align: 32, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "dmax", scope: !17, file: !18, line: 223, baseType: !13, size: 32, align: 32, offset: 96)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "neg", scope: !17, file: !18, line: 224, baseType: !13, size: 32, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !17, file: !18, line: 225, baseType: !13, size: 32, align: 32, offset: 160)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_MONT_CTX", file: !16, line: 83, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bn_mont_ctx_st", file: !18, line: 229, size: 832, align: 64, elements: !31)
!31 = !{!32, !33, !34, !35, !36, !40}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !30, file: !18, line: 230, baseType: !13, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "RR", scope: !30, file: !18, line: 231, baseType: !15, size: 192, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !30, file: !18, line: 233, baseType: !15, size: 192, align: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Ni", scope: !30, file: !18, line: 234, baseType: !15, size: 192, align: 64, offset: 448)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "n0", scope: !30, file: !18, line: 236, baseType: !37, size: 128, align: 64, offset: 640)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, align: 64, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 2)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !30, file: !18, line: 239, baseType: !13, size: 32, align: 32, offset: 768)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_CTX", file: !16, line: 81, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_ctx", file: !16, line: 81, flags: DIFlagFwdDecl)
!44 = !DILocalVariable(name: "r", arg: 1, scope: !9, file: !10, line: 26, type: !14)
!45 = !DIExpression()
!46 = !DILocation(line: 26, column: 35, scope: !9)
!47 = !DILocalVariable(name: "a", arg: 2, scope: !9, file: !10, line: 26, type: !26)
!48 = !DILocation(line: 26, column: 52, scope: !9)
!49 = !DILocalVariable(name: "b", arg: 3, scope: !9, file: !10, line: 26, type: !26)
!50 = !DILocation(line: 26, column: 69, scope: !9)
!51 = !DILocalVariable(name: "mont", arg: 4, scope: !9, file: !10, line: 27, type: !28)
!52 = !DILocation(line: 27, column: 40, scope: !9)
!53 = !DILocalVariable(name: "ctx", arg: 5, scope: !9, file: !10, line: 27, type: !41)
!54 = !DILocation(line: 27, column: 54, scope: !9)
!55 = !DILocalVariable(name: "ret", scope: !9, file: !10, line: 29, type: !13)
!56 = !DILocation(line: 29, column: 9, scope: !9)
!57 = !DILocation(line: 29, column: 37, scope: !9)
!58 = !DILocation(line: 29, column: 40, scope: !9)
!59 = !DILocation(line: 29, column: 43, scope: !9)
!60 = !DILocation(line: 29, column: 46, scope: !9)
!61 = !DILocation(line: 29, column: 52, scope: !9)
!62 = !DILocation(line: 29, column: 15, scope: !9)
!63 = !DILocation(line: 31, column: 20, scope: !9)
!64 = !DILocation(line: 31, column: 5, scope: !9)
!65 = !DILocation(line: 34, column: 12, scope: !9)
!66 = !DILocation(line: 34, column: 5, scope: !9)
!67 = distinct !DISubprogram(name: "bn_mul_mont_fixed_top", scope: !10, file: !10, line: 37, type: !11, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!68 = !DILocalVariable(name: "r", arg: 1, scope: !67, file: !10, line: 37, type: !14)
!69 = !DILocation(line: 37, column: 35, scope: !67)
!70 = !DILocalVariable(name: "a", arg: 2, scope: !67, file: !10, line: 37, type: !26)
!71 = !DILocation(line: 37, column: 52, scope: !67)
!72 = !DILocalVariable(name: "b", arg: 3, scope: !67, file: !10, line: 37, type: !26)
!73 = !DILocation(line: 37, column: 69, scope: !67)
!74 = !DILocalVariable(name: "mont", arg: 4, scope: !67, file: !10, line: 38, type: !28)
!75 = !DILocation(line: 38, column: 40, scope: !67)
!76 = !DILocalVariable(name: "ctx", arg: 5, scope: !67, file: !10, line: 38, type: !41)
!77 = !DILocation(line: 38, column: 54, scope: !67)
!78 = !DILocalVariable(name: "tmp", scope: !67, file: !10, line: 40, type: !14)
!79 = !DILocation(line: 40, column: 13, scope: !67)
!80 = !DILocalVariable(name: "ret", scope: !67, file: !10, line: 41, type: !13)
!81 = !DILocation(line: 41, column: 9, scope: !67)
!82 = !DILocalVariable(name: "num", scope: !67, file: !10, line: 42, type: !13)
!83 = !DILocation(line: 42, column: 9, scope: !67)
!84 = !DILocation(line: 42, column: 15, scope: !67)
!85 = !DILocation(line: 42, column: 21, scope: !67)
!86 = !DILocation(line: 42, column: 23, scope: !67)
!87 = !DILocation(line: 45, column: 9, scope: !88)
!88 = distinct !DILexicalBlock(scope: !67, file: !10, line: 45, column: 9)
!89 = !DILocation(line: 45, column: 13, scope: !88)
!90 = !DILocation(line: 45, column: 17, scope: !88)
!91 = !DILocation(line: 45, column: 20, scope: !92)
!92 = !DILexicalBlockFile(scope: !88, file: !10, discriminator: 1)
!93 = !DILocation(line: 45, column: 23, scope: !92)
!94 = !DILocation(line: 45, column: 30, scope: !92)
!95 = !DILocation(line: 45, column: 27, scope: !92)
!96 = !DILocation(line: 45, column: 34, scope: !92)
!97 = !DILocation(line: 45, column: 37, scope: !98)
!98 = !DILexicalBlockFile(scope: !88, file: !10, discriminator: 2)
!99 = !DILocation(line: 45, column: 40, scope: !98)
!100 = !DILocation(line: 45, column: 47, scope: !98)
