; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-x_bignum.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-x_bignum.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_PRIMITIVE_FUNCS_st = type { i8*, i64, i32 (%struct.ASN1_VALUE_st**, %struct.ASN1_ITEM_st*)*, void (%struct.ASN1_VALUE_st**, %struct.ASN1_ITEM_st*)*, void (%struct.ASN1_VALUE_st**, %struct.ASN1_ITEM_st*)*, i32 (%struct.ASN1_VALUE_st**, i8*, i32, i32, i8*, %struct.ASN1_ITEM_st*)*, i32 (%struct.ASN1_VALUE_st**, i8*, i32*, %struct.ASN1_ITEM_st*)*, i32 (%struct.bio_st*, %struct.ASN1_VALUE_st**, %struct.ASN1_ITEM_st*, i32, %struct.asn1_pctx_st*)* }
%struct.ASN1_VALUE_st = type opaque
%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.bio_st = type opaque
%struct.asn1_pctx_st = type opaque
%struct.bignum_st = type opaque


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !14)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--asn1--libcrypto-lib-x_bignum.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !8, !9, !13}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !6, line: 213, baseType: !7)
!6 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !6, line: 213, flags: DIFlagFwdDecl)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIGNUM", file: !11, line: 80, baseType: !12)
!11 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_st", file: !11, line: 80, flags: DIFlagFwdDecl)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!14 = !{!15, !48, !49, !97}
!15 = distinct !DIGlobalVariable(name: "BIGNUM_it", scope: !0, file: !16, line: 57, type: !17, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @BIGNUM_it)
!16 = !DIFile(filename: "crypto/asn1/x_bignum.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !11, line: 62, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !20, line: 580, size: 448, align: 64, elements: !21)
!20 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!21 = !{!22, !24, !26, !42, !43, !46, !47}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !19, file: !20, line: 581, baseType: !23, size: 8, align: 8)
!23 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !19, file: !20, line: 583, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !19, file: !20, line: 584, baseType: !27, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !6, line: 210, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !20, line: 468, size: 320, align: 64, elements: !31)
!31 = !{!32, !34, !35, !36, !39}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !30, file: !20, line: 469, baseType: !33, size: 64, align: 64)
!33 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !30, file: !20, line: 470, baseType: !25, size: 64, align: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !30, file: !20, line: 471, baseType: !33, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !30, file: !20, line: 472, baseType: !37, size: 64, align: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !30, file: !20, line: 473, baseType: !40, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !6, line: 318, baseType: !17)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !19, file: !20, line: 586, baseType: !25, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !19, file: !20, line: 587, baseType: !44, size: 64, align: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !19, file: !20, line: 588, baseType: !25, size: 64, align: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !19, file: !20, line: 589, baseType: !37, size: 64, align: 64, offset: 384)
!48 = distinct !DIGlobalVariable(name: "CBIGNUM_it", scope: !0, file: !16, line: 61, type: !17, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @CBIGNUM_it)
!49 = distinct !DIGlobalVariable(name: "bignum_pf", scope: !0, file: !16, line: 37, type: !50, isLocal: true, isDefinition: true, variable: %struct.ASN1_PRIMITIVE_FUNCS_st* @bignum_pf)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRIMITIVE_FUNCS", file: !20, line: 701, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_PRIMITIVE_FUNCS_st", file: !20, line: 692, size: 512, align: 64, elements: !52)
!52 = !{!53, !54, !55, !63, !68, !69, !78, !85}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !51, file: !20, line: 693, baseType: !8, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !51, file: !20, line: 694, baseType: !33, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "prim_new", scope: !51, file: !20, line: 695, baseType: !56, size: 64, align: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ex_new_func", file: !20, line: 666, baseType: !58)
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !61, !62}
!60 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "prim_free", scope: !51, file: !20, line: 696, baseType: !64, size: 64, align: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ex_free_func", file: !20, line: 667, baseType: !66)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !61, !62}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "prim_clear", scope: !51, file: !20, line: 697, baseType: !64, size: 64, align: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "prim_c2i", scope: !51, file: !20, line: 698, baseType: !70, size: 64, align: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_primitive_c2i", file: !20, line: 675, baseType: !72)
!72 = !DISubroutineType(types: !73)
!73 = !{!60, !61, !74, !60, !60, !77, !62}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!76 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "prim_i2c", scope: !51, file: !20, line: 699, baseType: !79, size: 64, align: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_primitive_i2c", file: !20, line: 673, baseType: !81)
!81 = !DISubroutineType(types: !82)
!82 = !{!60, !61, !83, !84, !62}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "prim_print", scope: !51, file: !20, line: 700, baseType: !86, size: 64, align: 64, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_primitive_print", file: !20, line: 678, baseType: !88)
!88 = !DISubroutineType(types: !89)
!89 = !{!60, !90, !61, !62, !60, !93}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !11, line: 79, baseType: !92)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !11, line: 79, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PCTX", file: !11, line: 63, baseType: !96)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_pctx_st", file: !11, line: 63, flags: DIFlagFwdDecl)
!97 = distinct !DIGlobalVariable(name: "cbignum_pf", scope: !0, file: !16, line: 47, type: !50, isLocal: true, isDefinition: true, variable: %struct.ASN1_PRIMITIVE_FUNCS_st* @cbignum_pf)
!98 = !{i32 2, !"Dwarf Version", i32 4}
!99 = !{i32 2, !"Debug Info Version", i32 3}
!100 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!101 = distinct !DISubprogram(name: "bn_new", scope: !16, file: !16, line: 65, type: !58, isLocal: true, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!102 = !DILocalVariable(name: "pval", arg: 1, scope: !101, file: !16, line: 65, type: !61)
!103 = !DIExpression()
!104 = !DILocation(line: 65, column: 32, scope: !101)
!105 = !DILocalVariable(name: "it", arg: 2, scope: !101, file: !16, line: 65, type: !62)
!106 = !DILocation(line: 65, column: 55, scope: !101)
!107 = !DILocation(line: 67, column: 27, scope: !101)
!108 = !DILocation(line: 67, column: 13, scope: !101)
!109 = !DILocation(line: 67, column: 6, scope: !101)
!110 = !DILocation(line: 67, column: 11, scope: !101)
!111 = !DILocation(line: 68, column: 10, scope: !112)
!112 = distinct !DILexicalBlock(scope: !101, file: !16, line: 68, column: 9)
!113 = !DILocation(line: 68, column: 9, scope: !112)
!114 = !DILocation(line: 68, column: 15, scope: !112)
!115 = !DILocation(line: 68, column: 9, scope: !101)
!116 = !DILocation(line: 69, column: 9, scope: !112)
!117 = !DILocation(line: 71, column: 9, scope: !112)
!118 = !DILocation(line: 72, column: 1, scope: !101)
!119 = distinct !DISubprogram(name: "bn_free", scope: !16, file: !16, line: 83, type: !66, isLocal: true, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!120 = !DILocalVariable(name: "pval", arg: 1, scope: !119, file: !16, line: 83, type: !61)
!121 = !DILocation(line: 83, column: 34, scope: !119)
!122 = !DILocalVariable(name: "it", arg: 2, scope: !119, file: !16, line: 83, type: !62)
!123 = !DILocation(line: 83, column: 57, scope: !119)
!124 = !DILocation(line: 85, column: 11, scope: !125)
!125 = distinct !DILexicalBlock(scope: !119, file: !16, line: 85, column: 9)
!126 = !DILocation(line: 85, column: 10, scope: !125)
!127 = !DILocation(line: 85, column: 9, scope: !119)
!128 = !DILocation(line: 86, column: 9, scope: !125)
!129 = !DILocation(line: 87, column: 9, scope: !130)
!130 = distinct !DILexicalBlock(scope: !119, file: !16, line: 87, column: 9)
!131 = !DILocation(line: 87, column: 13, scope: !130)
!132 = !DILocation(line: 87, column: 18, scope: !130)
!133 = !DILocation(line: 87, column: 9, scope: !119)
!134 = !DILocation(line: 88, column: 34, scope: !130)
!135 = !DILocation(line: 88, column: 33, scope: !130)
!136 = !DILocation(line: 88, column: 23, scope: !130)
!137 = !DILocation(line: 88, column: 9, scope: !130)
!138 = !DILocation(line: 90, column: 28, scope: !130)
!139 = !DILocation(line: 90, column: 27, scope: !130)
!140 = !DILocation(line: 90, column: 17, scope: !130)
