; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--ec--libcrypto-shlib-eck_prn.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--ec--libcrypto-shlib-eck_prn.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.ec_group_st = type opaque
%struct.bio_st = type opaque
%struct.bio_method_st = type opaque
%struct.bignum_ctx = type opaque
%struct.ec_point_st = type opaque
%struct.bignum_st = type opaque
%struct.ec_method_st = type opaque
%struct.ec_key_st = type opaque

@.str = private unnamed_addr constant [20 x i8] c"crypto/ec/eck_prn.c\00", align 1
@ECPKParameters_print.gen_compressed = internal global i8* getelementptr inbounds ([24 x i8], [24 x i8]* @.str.1, i32 0, i32 0), align 8
@.str.1 = private unnamed_addr constant [24 x i8] c"Generator (compressed):\00", align 1
@ECPKParameters_print.gen_uncompressed = internal global i8* getelementptr inbounds ([26 x i8], [26 x i8]* @.str.2, i32 0, i32 0), align 8
@.str.2 = private unnamed_addr constant [26 x i8] c"Generator (uncompressed):\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9, globals: !13)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--ec--libcrypto-shlib-eck_prn.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 33, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "include/openssl/ec.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "POINT_CONVERSION_COMPRESSED", value: 2)
!7 = !DIEnumerator(name: "POINT_CONVERSION_UNCOMPRESSED", value: 4)
!8 = !DIEnumerator(name: "POINT_CONVERSION_HYBRID", value: 6)
!9 = !{!10, !11}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!13 = !{!14, !31, !32}
!14 = distinct !DIGlobalVariable(name: "gen_compressed", scope: !15, file: !16, line: 77, type: !29, isLocal: true, isDefinition: true, variable: i8** @ECPKParameters_print.gen_compressed)
!15 = distinct !DISubprogram(name: "ECPKParameters_print", scope: !16, file: !16, line: 67, type: !17, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!16 = !DIFile(filename: "crypto/ec/eck_prn.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!17 = !DISubroutineType(types: !18)
!18 = !{!19, !20, !24, !19}
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !22, line: 79, baseType: !23)
!22 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !22, line: 79, flags: DIFlagFwdDecl)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "EC_GROUP", file: !4, line: 45, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "ec_group_st", file: !4, line: 45, flags: DIFlagFwdDecl)
!28 = !{}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!31 = distinct !DIGlobalVariable(name: "gen_uncompressed", scope: !15, file: !16, line: 78, type: !29, isLocal: true, isDefinition: true, variable: i8** @ECPKParameters_print.gen_uncompressed)
!32 = distinct !DIGlobalVariable(name: "gen_hybrid", scope: !15, file: !16, line: 79, type: !29, isLocal: true, isDefinition: true, variable: i8** @ECPKParameters_print.gen_hybrid)
!33 = !{i32 2, !"Dwarf Version", i32 4}
!34 = !{i32 2, !"Debug Info Version", i32 3}
!35 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!36 = distinct !DISubprogram(name: "ECPKParameters_print_fp", scope: !16, file: !16, line: 18, type: !37, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!37 = !DISubroutineType(types: !38)
!38 = !{!19, !39, !24, !19}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !41, line: 48, baseType: !42)
!41 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !43, line: 241, size: 1728, align: 64, elements: !44)
!43 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !65, !66, !67, !68, !72, !74, !76, !80, !83, !85, !86, !87, !88, !89, !93, !94}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !42, file: !43, line: 242, baseType: !19, size: 32, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !42, file: !43, line: 247, baseType: !11, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !42, file: !43, line: 248, baseType: !11, size: 64, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !42, file: !43, line: 249, baseType: !11, size: 64, align: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !42, file: !43, line: 250, baseType: !11, size: 64, align: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !42, file: !43, line: 251, baseType: !11, size: 64, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !42, file: !43, line: 252, baseType: !11, size: 64, align: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !42, file: !43, line: 253, baseType: !11, size: 64, align: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !42, file: !43, line: 254, baseType: !11, size: 64, align: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !42, file: !43, line: 256, baseType: !11, size: 64, align: 64, offset: 576)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !42, file: !43, line: 257, baseType: !11, size: 64, align: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !42, file: !43, line: 258, baseType: !11, size: 64, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !42, file: !43, line: 260, baseType: !58, size: 64, align: 64, offset: 768)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !43, line: 156, size: 192, align: 64, elements: !60)
!60 = !{!61, !62, !64}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !59, file: !43, line: 157, baseType: !58, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !59, file: !43, line: 158, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !59, file: !43, line: 162, baseType: !19, size: 32, align: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !42, file: !43, line: 262, baseType: !63, size: 64, align: 64, offset: 832)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !42, file: !43, line: 264, baseType: !19, size: 32, align: 32, offset: 896)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !42, file: !43, line: 268, baseType: !19, size: 32, align: 32, offset: 928)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !42, file: !43, line: 270, baseType: !69, size: 64, align: 64, offset: 960)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !70, line: 131, baseType: !71)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!71 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !42, file: !43, line: 274, baseType: !73, size: 16, align: 16, offset: 1024)
!73 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !42, file: !43, line: 275, baseType: !75, size: 8, align: 8, offset: 1040)
!75 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !42, file: !43, line: 276, baseType: !77, size: 8, align: 8, offset: 1048)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, align: 8, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 1)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !42, file: !43, line: 280, baseType: !81, size: 64, align: 64, offset: 1088)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !43, line: 150, baseType: null)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !42, file: !43, line: 289, baseType: !84, size: 64, align: 64, offset: 1152)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !70, line: 132, baseType: !71)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !42, file: !43, line: 297, baseType: !10, size: 64, align: 64, offset: 1216)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !42, file: !43, line: 298, baseType: !10, size: 64, align: 64, offset: 1280)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !42, file: !43, line: 299, baseType: !10, size: 64, align: 64, offset: 1344)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !42, file: !43, line: 300, baseType: !10, size: 64, align: 64, offset: 1408)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !42, file: !43, line: 302, baseType: !90, size: 64, align: 64, offset: 1472)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !91, line: 216, baseType: !92)
!91 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!92 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !42, file: !43, line: 303, baseType: !19, size: 32, align: 32, offset: 1536)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !42, file: !43, line: 305, baseType: !95, size: 160, align: 8, offset: 1568)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, align: 8, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 20)
!98 = !DILocalVariable(name: "fp", arg: 1, scope: !36, file: !16, line: 18, type: !39)
!99 = !DIExpression()
!100 = !DILocation(line: 18, column: 35, scope: !36)
!101 = !DILocalVariable(name: "x", arg: 2, scope: !36, file: !16, line: 18, type: !24)
!102 = !DILocation(line: 18, column: 55, scope: !36)
!103 = !DILocalVariable(name: "off", arg: 3, scope: !36, file: !16, line: 18, type: !19)
!104 = !DILocation(line: 18, column: 62, scope: !36)
!105 = !DILocalVariable(name: "b", scope: !36, file: !16, line: 20, type: !20)
!106 = !DILocation(line: 20, column: 10, scope: !36)
!107 = !DILocalVariable(name: "ret", scope: !36, file: !16, line: 21, type: !19)
!108 = !DILocation(line: 21, column: 9, scope: !36)
!109 = !DILocation(line: 23, column: 22, scope: !110)
!110 = distinct !DILexicalBlock(scope: !36, file: !16, line: 23, column: 9)
!111 = !DILocation(line: 23, column: 14, scope: !112)
!112 = !DILexicalBlockFile(scope: !110, file: !16, discriminator: 1)
!113 = !DILocation(line: 23, column: 12, scope: !110)
!114 = !DILocation(line: 23, column: 37, scope: !110)
!115 = !DILocation(line: 23, column: 9, scope: !36)
!116 = !DILocation(line: 24, column: 9, scope: !117)
!117 = distinct !DILexicalBlock(scope: !110, file: !16, line: 23, column: 45)
!118 = !DILocation(line: 25, column: 9, scope: !117)
!119 = !DILocation(line: 27, column: 14, scope: !36)
!120 = !DILocation(line: 27, column: 34, scope: !36)
!121 = !DILocation(line: 27, column: 25, scope: !36)
!122 = !DILocation(line: 27, column: 5, scope: !36)
!123 = !DILocation(line: 28, column: 32, scope: !36)
!124 = !DILocation(line: 28, column: 35, scope: !36)
!125 = !DILocation(line: 28, column: 38, scope: !36)
!126 = !DILocation(line: 28, column: 11, scope: !36)
!127 = !DILocation(line: 28, column: 9, scope: !36)
!128 = !DILocation(line: 29, column: 14, scope: !36)
!129 = !DILocation(line: 29, column: 5, scope: !36)
!130 = !DILocation(line: 30, column: 12, scope: !36)
!131 = !DILocation(line: 30, column: 5, scope: !36)
!132 = !DILocation(line: 31, column: 1, scope: !36)
!133 = !DILocalVariable(name: "bp", arg: 1, scope: !15, file: !16, line: 67, type: !20)
!134 = !DILocation(line: 67, column: 31, scope: !15)
!135 = !DILocalVariable(name: "x", arg: 2, scope: !15, file: !16, line: 67, type: !24)
!136 = !DILocation(line: 67, column: 51, scope: !15)
!137 = !DILocalVariable(name: "off", arg: 3, scope: !15, file: !16, line: 67, type: !19)
!138 = !DILocation(line: 67, column: 58, scope: !15)
!139 = !DILocalVariable(name: "ret", scope: !15, file: !16, line: 69, type: !19)
!140 = !DILocation(line: 69, column: 9, scope: !15)
!141 = !DILocalVariable(name: "reason", scope: !15, file: !16, line: 69, type: !19)
!142 = !DILocation(line: 69, column: 18, scope: !15)
!143 = !DILocalVariable(name: "ctx", scope: !15, file: !16, line: 70, type: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_CTX", file: !22, line: 81, baseType: !146)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_ctx", file: !22, line: 81, flags: DIFlagFwdDecl)
!147 = !DILocation(line: 70, column: 13, scope: !15)
!148 = !DILocalVariable(name: "point", scope: !15, file: !16, line: 71, type: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "EC_POINT", file: !4, line: 46, baseType: !152)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "ec_point_st", file: !4, line: 46, flags: DIFlagFwdDecl)
!153 = !DILocation(line: 71, column: 21, scope: !15)
!154 = !DILocalVariable(name: "p", scope: !15, file: !16, line: 72, type: !155)
