; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--comp--libcrypto-shlib-comp_lib.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--comp--libcrypto-shlib-comp_lib.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.comp_ctx_st = type { %struct.comp_method_st*, i64, i64, i64, i64, i8* }
%struct.comp_method_st = type { i32, i8*, i32 (%struct.comp_ctx_st*)*, void (%struct.comp_ctx_st*)*, i32 (%struct.comp_ctx_st*, i8*, i32, i8*, i32)*, i32 (%struct.comp_ctx_st*, i8*, i32, i8*, i32)* }

@.str = private unnamed_addr constant [23 x i8] c"crypto/comp/comp_lib.c\00", align 1

; Function Attrs: nounwind uwtable
define %struct.comp_ctx_st* @COMP_CTX_new(%struct.comp_method_st* %meth) #0 !dbg !8 {
entry:
  %retval = alloca %struct.comp_ctx_st*, align 8
  %meth.addr = alloca %struct.comp_method_st*, align 8
  %ret = alloca %struct.comp_ctx_st*, align 8
  store %struct.comp_method_st* %meth, %struct.comp_method_st** %meth.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.comp_method_st** %meth.addr, metadata !52, metadata !53), !dbg !54
  call void @llvm.dbg.declare(metadata %struct.comp_ctx_st** %ret, metadata !55, metadata !53), !dbg !56
  %call = call i8* @CRYPTO_zalloc(i64 48, i8* getelementptr inbounds ([23 x i8], [23 x i8]* @.str, i32 0, i32 0), i32 22), !dbg !57
  %0 = bitcast i8* %call to %struct.comp_ctx_st*, !dbg !57

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--comp--libcrypto-shlib-comp_lib.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{i32 2, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!8 = distinct !DISubprogram(name: "COMP_CTX_new", scope: !9, file: !9, line: 18, type: !10, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!9 = !DIFile(filename: "crypto/comp/comp_lib.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !50}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "COMP_CTX", file: !14, line: 154, baseType: !15)
!14 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "comp_ctx_st", file: !16, line: 23, size: 384, align: 64, elements: !17)
!16 = !DIFile(filename: "crypto/comp/comp_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!17 = !{!18, !44, !46, !47, !48, !49}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !15, file: !16, line: 24, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "comp_method_st", file: !16, line: 10, size: 384, align: 64, elements: !21)
!21 = !{!22, !24, !28, !32, !36, !43}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !20, file: !16, line: 11, baseType: !23, size: 32, align: 32)
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !20, file: !16, line: 12, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !20, file: !16, line: 13, baseType: !29, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DISubroutineType(types: !31)
!31 = !{!23, !12}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !20, file: !16, line: 14, baseType: !33, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{null, !12}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !20, file: !16, line: 15, baseType: !37, size: 64, align: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!23, !12, !40, !42, !40, !42}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!42 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "expand", scope: !20, file: !16, line: 18, baseType: !37, size: 64, align: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "compress_in", scope: !15, file: !16, line: 25, baseType: !45, size: 64, align: 64, offset: 64)
!45 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "compress_out", scope: !15, file: !16, line: 26, baseType: !45, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "expand_in", scope: !15, file: !16, line: 27, baseType: !45, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "expand_out", scope: !15, file: !16, line: 28, baseType: !45, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !15, file: !16, line: 29, baseType: !4, size: 64, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "COMP_METHOD", file: !14, line: 155, baseType: !20)
!52 = !DILocalVariable(name: "meth", arg: 1, scope: !8, file: !9, line: 18, type: !50)
!53 = !DIExpression()
!54 = !DILocation(line: 18, column: 37, scope: !8)
!55 = !DILocalVariable(name: "ret", scope: !8, file: !9, line: 20, type: !12)
!56 = !DILocation(line: 20, column: 15, scope: !8)
!57 = !DILocation(line: 22, column: 16, scope: !58)
!58 = distinct !DILexicalBlock(scope: !8, file: !9, line: 22, column: 9)
!59 = !DILocation(line: 22, column: 14, scope: !58)
!60 = !DILocation(line: 22, column: 75, scope: !58)
!61 = !DILocation(line: 22, column: 9, scope: !8)
!62 = !DILocation(line: 23, column: 9, scope: !63)
!63 = distinct !DILexicalBlock(scope: !58, file: !9, line: 22, column: 54)
!64 = !DILocation(line: 24, column: 9, scope: !63)
!65 = !DILocation(line: 26, column: 17, scope: !8)
!66 = !DILocation(line: 26, column: 5, scope: !8)
!67 = !DILocation(line: 26, column: 10, scope: !8)
!68 = !DILocation(line: 26, column: 15, scope: !8)
!69 = !DILocation(line: 27, column: 10, scope: !70)
!70 = distinct !DILexicalBlock(scope: !8, file: !9, line: 27, column: 9)
!71 = !DILocation(line: 27, column: 15, scope: !70)
!72 = !DILocation(line: 27, column: 21, scope: !70)
!73 = !DILocation(line: 27, column: 26, scope: !70)
!74 = !DILocation(line: 27, column: 34, scope: !70)
!75 = !DILocation(line: 27, column: 38, scope: !76)
!76 = !DILexicalBlockFile(scope: !70, file: !9, discriminator: 1)
!77 = !DILocation(line: 27, column: 43, scope: !76)
!78 = !DILocation(line: 27, column: 49, scope: !76)
!79 = !DILocation(line: 27, column: 54, scope: !76)
!80 = !DILocation(line: 27, column: 9, scope: !76)
!81 = !DILocation(line: 28, column: 21, scope: !82)
!82 = distinct !DILexicalBlock(scope: !70, file: !9, line: 27, column: 60)
!83 = !DILocation(line: 28, column: 9, scope: !82)
!84 = !DILocation(line: 29, column: 13, scope: !82)
!85 = !DILocation(line: 30, column: 5, scope: !82)
!86 = !DILocation(line: 31, column: 12, scope: !8)
!87 = !DILocation(line: 31, column: 5, scope: !8)
!88 = !DILocation(line: 32, column: 1, scope: !8)
!89 = distinct !DISubprogram(name: "COMP_CTX_get_method", scope: !9, file: !9, line: 34, type: !90, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!90 = !DISubroutineType(types: !91)
!91 = !{!92, !94}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!96 = !DILocalVariable(name: "ctx", arg: 1, scope: !89, file: !9, line: 34, type: !94)
!97 = !DILocation(line: 34, column: 56, scope: !89)
!98 = !DILocation(line: 36, column: 12, scope: !89)
!99 = !DILocation(line: 36, column: 17, scope: !89)
!100 = !DILocation(line: 36, column: 5, scope: !89)
!101 = distinct !DISubprogram(name: "COMP_get_type", scope: !9, file: !9, line: 39, type: !102, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!102 = !DISubroutineType(types: !103)
!103 = !{!23, !92}
!104 = !DILocalVariable(name: "meth", arg: 1, scope: !101, file: !9, line: 39, type: !92)
!105 = !DILocation(line: 39, column: 38, scope: !101)
!106 = !DILocation(line: 41, column: 12, scope: !101)
!107 = !DILocation(line: 41, column: 18, scope: !101)
!108 = !DILocation(line: 41, column: 5, scope: !101)
!109 = distinct !DISubprogram(name: "COMP_get_name", scope: !9, file: !9, line: 44, type: !110, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
