; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]apps--openssl-bin-crl2p7.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]apps--openssl-bin-crl2p7.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.options_st = type { i8*, i32, i32, i8* }
%struct.bio_st = type opaque
%struct.pkcs7_st = type { i8*, i64, i32, i32, %struct.asn1_object_st*, %union.anon }
%struct.asn1_object_st = type opaque
%union.anon = type { i8* }
%struct.pkcs7_signed_st = type { %struct.asn1_string_st*, %struct.stack_st_X509_ALGOR*, %struct.stack_st_X509*, %struct.stack_st_X509_CRL*, %struct.stack_st_PKCS7_SIGNER_INFO*, %struct.pkcs7_st* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.stack_st_X509_ALGOR = type opaque
%struct.stack_st_X509 = type opaque
%struct.stack_st_X509_CRL = type opaque
%struct.stack_st_PKCS7_SIGNER_INFO = type opaque
%struct.stack_st_OPENSSL_STRING = type opaque
%struct.X509_crl_st = type opaque
%struct.stack_st = type opaque
%struct.stack_st_X509_INFO = type opaque
%struct.X509_info_st = type { %struct.x509_st*, %struct.X509_crl_st*, %struct.private_key_st*, %struct.evp_cipher_info_st, i32, i8* }
%struct.x509_st = type opaque
%struct.private_key_st = type { i32, %struct.X509_algor_st*, %struct.asn1_string_st*, %struct.evp_pkey_st*, i32, i8*, i32, %struct.evp_cipher_info_st }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15, globals: !163)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]apps--openssl-bin-crl2p7.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OPTION_choice", file: !4, line: 24, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "apps/crl2p7.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "OPT_ERR", value: -1)
!7 = !DIEnumerator(name: "OPT_EOF", value: 0)
!8 = !DIEnumerator(name: "OPT_HELP", value: 1)
!9 = !DIEnumerator(name: "OPT_INFORM", value: 2)
!10 = !DIEnumerator(name: "OPT_OUTFORM", value: 3)
!11 = !DIEnumerator(name: "OPT_IN", value: 4)
!12 = !DIEnumerator(name: "OPT_OUT", value: 5)
!13 = !DIEnumerator(name: "OPT_NOCRL", value: 6)
!14 = !DIEnumerator(name: "OPT_CERTFILE", value: 7)
!15 = !{!16, !17, !20, !24, !26, !29, !31, !33, !35}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_OPENSSL_STRING", file: !19, line: 159, flags: DIFlagFwdDecl)
!19 = !DIFile(filename: "include/openssl/safestack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !22, line: 17, baseType: !23)
!22 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !22, line: 17, flags: DIFlagFwdDecl)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_CRL", file: !28, line: 228, flags: DIFlagFwdDecl)
!28 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !28, line: 99, flags: DIFlagFwdDecl)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_INFO", file: !28, line: 252, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_info_st", file: !28, line: 245, size: 512, align: 64, elements: !38)
!38 = !{!39, !44, !48, !160, !161, !162}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "x509", scope: !37, file: !28, line: 246, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !42, line: 124, baseType: !43)
!42 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !42, line: 124, flags: DIFlagFwdDecl)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !37, file: !28, line: 247, baseType: !45, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !42, line: 126, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !42, line: 126, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "x_pkey", scope: !37, file: !28, line: 248, baseType: !49, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_PKEY", file: !28, line: 243, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "private_key_st", file: !28, line: 230, size: 640, align: 64, elements: !52)
!52 = !{!53, !55, !138, !139, !143, !144, !145, !146}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !51, file: !28, line: 231, baseType: !54, size: 32, align: 32)
!54 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "enc_algor", scope: !51, file: !28, line: 233, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !42, line: 125, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !28, line: 59, size: 128, align: 64, elements: !59)
!59 = !{!60, !64}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !58, file: !28, line: 60, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !42, line: 60, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !42, line: 60, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !58, file: !28, line: 61, baseType: !65, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !67, line: 473, baseType: !68)
!67 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !67, line: 444, size: 128, align: 64, elements: !69)
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !68, file: !67, line: 445, baseType: !54, size: 32, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !68, file: !67, line: 472, baseType: !72, size: 64, align: 64, offset: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !68, file: !67, line: 446, size: 64, align: 64, elements: !73)
!73 = !{!74, !75, !77, !89, !90, !93, !96, !99, !102, !105, !108, !111, !114, !117, !120, !123, !126, !129, !132, !133, !134}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !72, file: !67, line: 447, baseType: !33, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !72, file: !67, line: 448, baseType: !76, size: 32, align: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !42, line: 56, baseType: !54)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !72, file: !67, line: 449, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !42, line: 55, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !67, line: 146, size: 192, align: 64, elements: !81)
!81 = !{!82, !83, !84, !87}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !80, file: !67, line: 147, baseType: !54, size: 32, align: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !67, line: 148, baseType: !54, size: 32, align: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !80, file: !67, line: 149, baseType: !85, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !80, file: !67, line: 155, baseType: !88, size: 64, align: 64, offset: 128)
!88 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !72, file: !67, line: 450, baseType: !61, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !72, file: !67, line: 451, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !42, line: 40, baseType: !80)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !72, file: !67, line: 452, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !42, line: 41, baseType: !80)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !72, file: !67, line: 453, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !42, line: 42, baseType: !80)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !72, file: !67, line: 454, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !42, line: 43, baseType: !80)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !72, file: !67, line: 455, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !42, line: 44, baseType: !80)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !72, file: !67, line: 456, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !42, line: 45, baseType: !80)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !72, file: !67, line: 457, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !42, line: 46, baseType: !80)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !72, file: !67, line: 458, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !42, line: 47, baseType: !80)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !72, file: !67, line: 459, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !42, line: 49, baseType: !80)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !72, file: !67, line: 460, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !42, line: 48, baseType: !80)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !72, file: !67, line: 461, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !42, line: 50, baseType: !80)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !72, file: !67, line: 462, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !42, line: 52, baseType: !80)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !72, file: !67, line: 463, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !42, line: 53, baseType: !80)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !72, file: !67, line: 464, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !42, line: 54, baseType: !80)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !72, file: !67, line: 469, baseType: !78, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !72, file: !67, line: 470, baseType: !78, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !72, file: !67, line: 471, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !67, line: 213, baseType: !137)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !67, line: 213, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "enc_pkey", scope: !51, file: !28, line: 234, baseType: !100, size: 64, align: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "dec_pkey", scope: !51, file: !28, line: 236, baseType: !140, size: 64, align: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !42, line: 95, baseType: !142)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !42, line: 95, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "key_length", scope: !51, file: !28, line: 238, baseType: !54, size: 32, align: 32, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "key_data", scope: !51, file: !28, line: 239, baseType: !33, size: 64, align: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "key_free", scope: !51, file: !28, line: 240, baseType: !54, size: 32, align: 32, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !51, file: !28, line: 242, baseType: !147, size: 192, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER_INFO", file: !148, line: 402, baseType: !149)
!148 = !DIFile(filename: "include/openssl/evp.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_info_st", file: !148, line: 399, size: 192, align: 64, elements: !150)
!150 = !{!151, !156}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !149, file: !148, line: 400, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !42, line: 89, baseType: !155)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !42, line: 89, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "iv", scope: !149, file: !148, line: 401, baseType: !157, size: 128, align: 8, offset: 64)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 128, align: 8, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 16)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "enc_cipher", scope: !37, file: !28, line: 249, baseType: !147, size: 192, align: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "enc_len", scope: !37, file: !28, line: 250, baseType: !54, size: 32, align: 32, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !37, file: !28, line: 251, baseType: !33, size: 64, align: 64, offset: 448)
!163 = !{!164}
!164 = distinct !DIGlobalVariable(name: "crl2pkcs7_options", scope: !0, file: !4, line: 29, type: !165, isLocal: false, isDefinition: true, variable: [8 x %struct.options_st]* @crl2pkcs7_options)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 1536, align: 64, elements: !177)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPTIONS", file: !168, line: 280, baseType: !169)
!168 = !DIFile(filename: "apps/include/opt.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "options_st", file: !168, line: 269, size: 192, align: 64, elements: !170)
!170 = !{!171, !174, !175, !176}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !169, file: !168, line: 270, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !169, file: !168, line: 271, baseType: !54, size: 32, align: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "valtype", scope: !169, file: !168, line: 278, baseType: !54, size: 32, align: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "helpstr", scope: !169, file: !168, line: 279, baseType: !172, size: 64, align: 64, offset: 128)
!177 = !{!178}
!178 = !DISubrange(count: 8)
!179 = !{i32 2, !"Dwarf Version", i32 4}
!180 = !{i32 2, !"Debug Info Version", i32 3}
!181 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!182 = distinct !DISubprogram(name: "crl2pkcs7_main", scope: !4, file: !4, line: 41, type: !183, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !186)
!183 = !DISubroutineType(types: !184)
!184 = !{!54, !54, !185}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!186 = !{}
!187 = !DILocalVariable(name: "argc", arg: 1, scope: !182, file: !4, line: 41, type: !54)
!188 = !DIExpression()
!189 = !DILocation(line: 41, column: 24, scope: !182)
!190 = !DILocalVariable(name: "argv", arg: 2, scope: !182, file: !4, line: 41, type: !185)
!191 = !DILocation(line: 41, column: 37, scope: !182)
!192 = !DILocalVariable(name: "in", scope: !182, file: !4, line: 43, type: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !42, line: 79, baseType: !195)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !42, line: 79, flags: DIFlagFwdDecl)
!196 = !DILocation(line: 43, column: 10, scope: !182)
!197 = !DILocalVariable(name: "out", scope: !182, file: !4, line: 43, type: !193)
!198 = !DILocation(line: 43, column: 21, scope: !182)
!199 = !DILocalVariable(name: "p7", scope: !182, file: !4, line: 44, type: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7", file: !202, line: 144, baseType: !203)
!202 = !DIFile(filename: "include/openssl/pkcs7.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_st", file: !202, line: 109, size: 320, align: 64, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !210}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "asn1", scope: !203, file: !202, line: 114, baseType: !85, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !203, file: !202, line: 115, baseType: !88, size: 64, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !203, file: !202, line: 119, baseType: !54, size: 32, align: 32, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !203, file: !202, line: 120, baseType: !54, size: 32, align: 32, offset: 160)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !203, file: !202, line: 121, baseType: !61, size: 64, align: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !203, file: !202, line: 143, baseType: !211, size: 64, align: 64, offset: 256)
!211 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !203, file: !202, line: 127, size: 64, align: 64, elements: !212)
!212 = !{!213, !214, !215, !231, !249, !261, !270, !277}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !211, file: !202, line: 128, baseType: !33, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !211, file: !202, line: 130, baseType: !100, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !211, file: !202, line: 132, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGNED", file: !202, line: 68, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signed_st", file: !202, line: 61, size: 384, align: 64, elements: !219)
!219 = !{!220, !221, !224, !225, !226, !229}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !218, file: !202, line: 62, baseType: !91, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !218, file: !202, line: 63, baseType: !222, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ALGOR", file: !67, line: 119, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !218, file: !202, line: 64, baseType: !29, size: 64, align: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !218, file: !202, line: 65, baseType: !26, size: 64, align: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !218, file: !202, line: 66, baseType: !227, size: 64, align: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_SIGNER_INFO", file: !202, line: 49, flags: DIFlagFwdDecl)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !218, file: !202, line: 67, baseType: !230, size: 64, align: 64, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "enveloped", scope: !211, file: !202, line: 134, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENVELOPE", file: !202, line: 85, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enveloped_st", file: !202, line: 81, size: 192, align: 64, elements: !235)
!235 = !{!236, !237, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !234, file: !202, line: 82, baseType: !91, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !234, file: !202, line: 83, baseType: !238, size: 64, align: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_RECIP_INFO", file: !202, line: 59, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !234, file: !202, line: 84, baseType: !241, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENC_CONTENT", file: !202, line: 79, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enc_content_st", file: !202, line: 74, size: 256, align: 64, elements: !244)
!244 = !{!245, !246, !247, !248}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !243, file: !202, line: 75, baseType: !61, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !243, file: !202, line: 76, baseType: !56, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !243, file: !202, line: 77, baseType: !100, size: 64, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !243, file: !202, line: 78, baseType: !152, size: 64, align: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "signed_and_enveloped", scope: !211, file: !202, line: 136, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGN_ENVELOPE", file: !202, line: 95, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signedandenveloped_st", file: !202, line: 87, size: 448, align: 64, elements: !253)
!253 = !{!254, !255, !256, !257, !258, !259, !260}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !252, file: !202, line: 88, baseType: !91, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !252, file: !202, line: 89, baseType: !222, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !252, file: !202, line: 90, baseType: !29, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !252, file: !202, line: 91, baseType: !26, size: 64, align: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !252, file: !202, line: 92, baseType: !227, size: 64, align: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !252, file: !202, line: 93, baseType: !241, size: 64, align: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !252, file: !202, line: 94, baseType: !238, size: 64, align: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !211, file: !202, line: 138, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_DIGEST", file: !202, line: 102, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_digest_st", file: !202, line: 97, size: 256, align: 64, elements: !265)
!265 = !{!266, !267, !268, !269}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !264, file: !202, line: 98, baseType: !91, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !264, file: !202, line: 99, baseType: !56, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !264, file: !202, line: 100, baseType: !230, size: 64, align: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !264, file: !202, line: 101, baseType: !100, size: 64, align: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "encrypted", scope: !211, file: !202, line: 140, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENCRYPT", file: !202, line: 107, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_encrypted_st", file: !202, line: 104, size: 128, align: 64, elements: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !273, file: !202, line: 105, baseType: !91, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !273, file: !202, line: 106, baseType: !241, size: 64, align: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !211, file: !202, line: 142, baseType: !65, size: 64, align: 64)
!278 = !DILocation(line: 44, column: 12, scope: !182)
!279 = !DILocalVariable(name: "p7s", scope: !182, file: !4, line: 45, type: !216)
!280 = !DILocation(line: 45, column: 19, scope: !182)
!281 = !DILocalVariable(name: "certflst", scope: !182, file: !4, line: 46, type: !17)
!282 = !DILocation(line: 46, column: 37, scope: !182)
!283 = !DILocalVariable(name: "cert_stack", scope: !182, file: !4, line: 47, type: !29)
!284 = !DILocation(line: 47, column: 27, scope: !182)
!285 = !DILocalVariable(name: "crl_stack", scope: !182, file: !4, line: 48, type: !26)
!286 = !DILocation(line: 48, column: 31, scope: !182)
!287 = !DILocalVariable(name: "crl", scope: !182, file: !4, line: 49, type: !45)
!288 = !DILocation(line: 49, column: 15, scope: !182)
!289 = !DILocalVariable(name: "infile", scope: !182, file: !4, line: 50, type: !33)
!290 = !DILocation(line: 50, column: 11, scope: !182)
!291 = !DILocalVariable(name: "outfile", scope: !182, file: !4, line: 50, type: !33)
!292 = !DILocation(line: 50, column: 26, scope: !182)
!293 = !DILocalVariable(name: "prog", scope: !182, file: !4, line: 50, type: !33)
!294 = !DILocation(line: 50, column: 43, scope: !182)
!295 = !DILocalVariable(name: "certfile", scope: !182, file: !4, line: 50, type: !33)
!296 = !DILocation(line: 50, column: 50, scope: !182)
!297 = !DILocalVariable(name: "i", scope: !182, file: !4, line: 51, type: !54)
!298 = !DILocation(line: 51, column: 9, scope: !182)
!299 = !DILocalVariable(name: "informat", scope: !182, file: !4, line: 51, type: !54)
!300 = !DILocation(line: 51, column: 16, scope: !182)
!301 = !DILocalVariable(name: "outformat", scope: !182, file: !4, line: 51, type: !54)
!302 = !DILocation(line: 51, column: 41, scope: !182)
!303 = !DILocalVariable(name: "ret", scope: !182, file: !4, line: 51, type: !54)
!304 = !DILocation(line: 51, column: 67, scope: !182)
!305 = !DILocalVariable(name: "nocrl", scope: !182, file: !4, line: 51, type: !54)
!306 = !DILocation(line: 51, column: 76, scope: !182)
!307 = !DILocalVariable(name: "o", scope: !182, file: !4, line: 53, type: !308)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPTION_CHOICE", file: !4, line: 27, baseType: !3)
!309 = !DILocation(line: 53, column: 19, scope: !182)
!310 = !DILocation(line: 55, column: 21, scope: !182)
!311 = !DILocation(line: 55, column: 27, scope: !182)
!312 = !DILocation(line: 55, column: 12, scope: !182)
!313 = !DILocation(line: 55, column: 10, scope: !182)
!314 = !DILocation(line: 56, column: 5, scope: !182)
!315 = !DILocation(line: 56, column: 17, scope: !316)
!316 = !DILexicalBlockFile(scope: !182, file: !4, discriminator: 1)
!317 = !DILocation(line: 56, column: 15, scope: !316)
!318 = !DILocation(line: 56, column: 29, scope: !316)
!319 = !DILocation(line: 56, column: 5, scope: !316)
!320 = !DILocation(line: 57, column: 17, scope: !321)
!321 = distinct !DILexicalBlock(scope: !182, file: !4, line: 56, column: 41)
!322 = !DILocation(line: 57, column: 9, scope: !321)
!323 = !DILocation(line: 57, column: 20, scope: !324)
!324 = !DILexicalBlockFile(scope: !321, file: !4, discriminator: 1)
!325 = !DILocation(line: 61, column: 24, scope: !326)
!326 = distinct !DILexicalBlock(scope: !321, file: !4, line: 57, column: 20)
!327 = !DILocation(line: 61, column: 65, scope: !326)
!328 = !DILocation(line: 61, column: 13, scope: !326)
!329 = !DILocation(line: 62, column: 13, scope: !326)
!330 = !DILocation(line: 64, column: 13, scope: !326)
!331 = !DILocation(line: 65, column: 17, scope: !326)
!332 = !DILocation(line: 66, column: 13, scope: !326)
!333 = !DILocation(line: 68, column: 29, scope: !334)
!334 = distinct !DILexicalBlock(scope: !326, file: !4, line: 68, column: 17)
!335 = !DILocation(line: 68, column: 18, scope: !336)
