; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--cms--libcrypto-shlib-cms_lib.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--cms--libcrypto-shlib-cms_lib.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.CMS_ContentInfo_st = type { %struct.asn1_object_st*, %union.anon }
%struct.asn1_object_st = type opaque
%union.anon = type { %struct.asn1_string_st* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.ASN1_VALUE_st = type opaque
%struct.bio_st = type opaque
%struct.asn1_pctx_st = type opaque
%struct.bio_method_st = type opaque
%struct.CMS_SignedData_st = type { i32, %struct.stack_st_X509_ALGOR*, %struct.CMS_EncapsulatedContentInfo_st*, %struct.stack_st_CMS_CertificateChoices*, %struct.stack_st_CMS_RevocationInfoChoice*, %struct.stack_st_CMS_SignerInfo* }
%struct.stack_st_X509_ALGOR = type opaque
%struct.CMS_EncapsulatedContentInfo_st = type { %struct.asn1_object_st*, %struct.asn1_string_st*, i32 }
%struct.stack_st_CMS_CertificateChoices = type opaque
%struct.stack_st_CMS_RevocationInfoChoice = type opaque
%struct.stack_st_CMS_SignerInfo = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[inter]crypto--cms--libcrypto-shlib-cms_lib.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!2 = !{}
!3 = !{!4, !211, !150, !210, !99, !212, !234, !253, !52, !262, !266, !268, !55, !270, !272, !276}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_ContentInfo", file: !6, line: 24, baseType: !7)
!6 = !DIFile(filename: "include/openssl/cms.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_ContentInfo_st", file: !8, line: 47, size: 128, align: 64, elements: !9)
!8 = !DIFile(filename: "crypto/cms/cms_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!9 = !{!10, !15}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "contentType", scope: !7, file: !8, line: 48, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !13, line: 60, baseType: !14)
!13 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !13, line: 60, flags: DIFlagFwdDecl)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !7, file: !8, line: 60, baseType: !16, size: 64, align: 64, offset: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !7, file: !8, line: 49, size: 64, align: 64, elements: !17)
!17 = !{!18, !32, !60, !168, !177, !185, !199, !208, !209}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !16, file: !8, line: 50, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !13, line: 43, baseType: !21)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !22, line: 146, size: 192, align: 64, elements: !23)
!22 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!23 = !{!24, !26, !27, !30}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !21, file: !22, line: 147, baseType: !25, size: 32, align: 32)
!25 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !21, file: !22, line: 148, baseType: !25, size: 32, align: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !21, file: !22, line: 149, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !21, file: !22, line: 155, baseType: !31, size: 64, align: 64, offset: 128)
!31 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "signedData", scope: !16, file: !8, line: 51, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_SignedData", file: !8, line: 24, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_SignedData_st", file: !8, line: 65, size: 384, align: 64, elements: !36)
!36 = !{!37, !40, !43, !51, !54, !57}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !35, file: !8, line: 66, baseType: !38, size: 32, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !39, line: 38, baseType: !25)
!39 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!40 = !DIDerivedType(tag: DW_TAG_member, name: "digestAlgorithms", scope: !35, file: !8, line: 67, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ALGOR", file: !22, line: 119, flags: DIFlagFwdDecl)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "encapContentInfo", scope: !35, file: !8, line: 68, baseType: !44, size: 64, align: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_EncapsulatedContentInfo", file: !8, line: 22, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_EncapsulatedContentInfo_st", file: !8, line: 74, size: 192, align: 64, elements: !47)
!47 = !{!48, !49, !50}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "eContentType", scope: !46, file: !8, line: 75, baseType: !11, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "eContent", scope: !46, file: !8, line: 76, baseType: !19, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "partial", scope: !46, file: !8, line: 78, baseType: !25, size: 32, align: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "certificates", scope: !35, file: !8, line: 69, baseType: !52, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CMS_CertificateChoices", file: !8, line: 63, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "crls", scope: !35, file: !8, line: 70, baseType: !55, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CMS_RevocationInfoChoice", file: !6, line: 37, flags: DIFlagFwdDecl)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "signerInfos", scope: !35, file: !8, line: 71, baseType: !58, size: 64, align: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CMS_SignerInfo", file: !6, line: 34, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "envelopedData", scope: !16, file: !8, line: 52, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_EnvelopedData", file: !8, line: 28, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_EnvelopedData_st", file: !8, line: 105, size: 320, align: 64, elements: !64)
!64 = !{!65, !66, !73, !76, !165}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !63, file: !8, line: 106, baseType: !38, size: 32, align: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "originatorInfo", scope: !63, file: !8, line: 107, baseType: !67, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_OriginatorInfo", file: !8, line: 26, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_OriginatorInfo_st", file: !8, line: 113, size: 128, align: 64, elements: !70)
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "certificates", scope: !69, file: !8, line: 114, baseType: !52, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "crls", scope: !69, file: !8, line: 115, baseType: !55, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "recipientInfos", scope: !63, file: !8, line: 108, baseType: !74, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CMS_RecipientInfo", file: !6, line: 36, flags: DIFlagFwdDecl)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedContentInfo", scope: !63, file: !8, line: 109, baseType: !77, size: 64, align: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_EncryptedContentInfo", file: !8, line: 27, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_EncryptedContentInfo_st", file: !8, line: 118, size: 448, align: 64, elements: !80)
!80 = !{!81, !82, !153, !154, !159, !160, !164}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "contentType", scope: !79, file: !8, line: 119, baseType: !11, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "contentEncryptionAlgorithm", scope: !79, file: !8, line: 120, baseType: !83, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !13, line: 125, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !86, line: 59, size: 128, align: 64, elements: !87)
!86 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!87 = !{!88, !89}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !85, file: !86, line: 60, baseType: !11, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !85, file: !86, line: 61, baseType: !90, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !22, line: 473, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !22, line: 444, size: 128, align: 64, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !92, file: !22, line: 445, baseType: !25, size: 32, align: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !92, file: !22, line: 472, baseType: !96, size: 64, align: 64, offset: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !92, file: !22, line: 446, size: 64, align: 64, elements: !97)
!97 = !{!98, !101, !103, !106, !107, !110, !113, !116, !117, !120, !123, !126, !129, !132, !135, !138, !141, !144, !147, !148, !149}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !96, file: !22, line: 447, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !96, file: !22, line: 448, baseType: !102, size: 32, align: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !13, line: 56, baseType: !25)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !96, file: !22, line: 449, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !13, line: 55, baseType: !21)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !96, file: !22, line: 450, baseType: !11, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !96, file: !22, line: 451, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !13, line: 40, baseType: !21)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !96, file: !22, line: 452, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !13, line: 41, baseType: !21)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !96, file: !22, line: 453, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !13, line: 42, baseType: !21)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !96, file: !22, line: 454, baseType: !19, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !96, file: !22, line: 455, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !13, line: 44, baseType: !21)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !96, file: !22, line: 456, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !13, line: 45, baseType: !21)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !96, file: !22, line: 457, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !13, line: 46, baseType: !21)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !96, file: !22, line: 458, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !13, line: 47, baseType: !21)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !96, file: !22, line: 459, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !13, line: 49, baseType: !21)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !96, file: !22, line: 460, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !13, line: 48, baseType: !21)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !96, file: !22, line: 461, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !13, line: 50, baseType: !21)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !96, file: !22, line: 462, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !13, line: 52, baseType: !21)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !96, file: !22, line: 463, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !13, line: 53, baseType: !21)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !96, file: !22, line: 464, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !13, line: 54, baseType: !21)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !96, file: !22, line: 469, baseType: !104, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !96, file: !22, line: 470, baseType: !104, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !96, file: !22, line: 471, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !22, line: 213, baseType: !152)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !22, line: 213, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedContent", scope: !79, file: !8, line: 121, baseType: !19, size: 64, align: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !79, file: !8, line: 123, baseType: !155, size: 64, align: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !13, line: 89, baseType: !158)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !13, line: 89, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !79, file: !8, line: 124, baseType: !28, size: 64, align: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !79, file: !8, line: 125, baseType: !161, size: 64, align: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !162, line: 216, baseType: !163)
!162 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!163 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !79, file: !8, line: 127, baseType: !25, size: 32, align: 32, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "unprotectedAttrs", scope: !63, file: !8, line: 110, baseType: !166, size: 64, align: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ATTRIBUTE", file: !86, line: 89, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "digestedData", scope: !16, file: !8, line: 53, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_DigestedData", file: !8, line: 29, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_DigestedData_st", file: !8, line: 233, size: 256, align: 64, elements: !172)
!172 = !{!173, !174, !175, !176}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !171, file: !8, line: 234, baseType: !38, size: 32, align: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "digestAlgorithm", scope: !171, file: !8, line: 235, baseType: !83, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "encapContentInfo", scope: !171, file: !8, line: 236, baseType: !44, size: 64, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !171, file: !8, line: 237, baseType: !19, size: 64, align: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedData", scope: !16, file: !8, line: 54, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_EncryptedData", file: !8, line: 30, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_EncryptedData_st", file: !8, line: 240, size: 192, align: 64, elements: !181)
!181 = !{!182, !183, !184}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !180, file: !8, line: 241, baseType: !38, size: 32, align: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "encryptedContentInfo", scope: !180, file: !8, line: 242, baseType: !77, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "unprotectedAttrs", scope: !180, file: !8, line: 243, baseType: !166, size: 64, align: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "authenticatedData", scope: !16, file: !8, line: 55, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_AuthenticatedData", file: !8, line: 31, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_AuthenticatedData_st", file: !8, line: 246, size: 576, align: 64, elements: !189)
!189 = !{!190, !191, !192, !193, !194, !195, !196, !197, !198}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !188, file: !8, line: 247, baseType: !38, size: 32, align: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "originatorInfo", scope: !188, file: !8, line: 248, baseType: !67, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "recipientInfos", scope: !188, file: !8, line: 249, baseType: !74, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "macAlgorithm", scope: !188, file: !8, line: 250, baseType: !83, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "digestAlgorithm", scope: !188, file: !8, line: 251, baseType: !83, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "encapContentInfo", scope: !188, file: !8, line: 252, baseType: !44, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "authAttrs", scope: !188, file: !8, line: 253, baseType: !166, size: 64, align: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !188, file: !8, line: 254, baseType: !19, size: 64, align: 64, offset: 448)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "unauthAttrs", scope: !188, file: !8, line: 255, baseType: !166, size: 64, align: 64, offset: 512)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "compressedData", scope: !16, file: !8, line: 56, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_CompressedData", file: !8, line: 32, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_CompressedData_st", file: !8, line: 258, size: 256, align: 64, elements: !203)
!203 = !{!204, !205, !206, !207}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !202, file: !8, line: 259, baseType: !38, size: 32, align: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "compressionAlgorithm", scope: !202, file: !8, line: 260, baseType: !83, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "recipientInfos", scope: !202, file: !8, line: 261, baseType: !74, size: 64, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "encapContentInfo", scope: !202, file: !8, line: 262, baseType: !44, size: 64, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !16, file: !8, line: 57, baseType: !90, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "otherData", scope: !16, file: !8, line: 59, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_CertificateChoices", file: !6, line: 26, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_CertificateChoices", file: !8, line: 281, size: 128, align: 64, elements: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !214, file: !8, line: 282, baseType: !25, size: 32, align: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !214, file: !8, line: 289, baseType: !218, size: 64, align: 64, offset: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !8, line: 283, size: 64, align: 64, elements: !219)
!219 = !{!220, !224, !225, !226, !227}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "certificate", scope: !218, file: !8, line: 284, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !13, line: 124, baseType: !223)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !13, line: 124, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "extendedCertificate", scope: !218, file: !8, line: 285, baseType: !104, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "v1AttrCert", scope: !218, file: !8, line: 286, baseType: !104, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v2AttrCert", scope: !218, file: !8, line: 287, baseType: !104, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !218, file: !8, line: 288, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_OtherCertificateFormat", file: !8, line: 33, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_OtherCertificateFormat_st", file: !8, line: 298, size: 128, align: 64, elements: !231)
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "otherCertFormat", scope: !230, file: !8, line: 299, baseType: !11, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "otherCert", scope: !230, file: !8, line: 300, baseType: !90, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_RevocationInfoChoice", file: !6, line: 27, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_RevocationInfoChoice_st", file: !8, line: 265, size: 128, align: 64, elements: !237)
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !236, file: !8, line: 266, baseType: !25, size: 32, align: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !236, file: !8, line: 270, baseType: !240, size: 64, align: 64, offset: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !236, file: !8, line: 267, size: 64, align: 64, elements: !241)
!241 = !{!242, !246}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !240, file: !8, line: 268, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !13, line: 126, baseType: !245)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !13, line: 126, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !240, file: !8, line: 269, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_OtherRevocationInfoFormat", file: !8, line: 25, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_OtherRevocationInfoFormat_st", file: !8, line: 276, size: 128, align: 64, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "otherRevInfoFormat", scope: !249, file: !8, line: 277, baseType: !11, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "otherRevInfo", scope: !249, file: !8, line: 278, baseType: !90, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMS_IssuerAndSerialNumber", file: !8, line: 21, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CMS_IssuerAndSerialNumber_st", file: !8, line: 308, size: 128, align: 64, elements: !256)
!256 = !{!257, !261}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !255, file: !8, line: 309, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !13, line: 129, baseType: !260)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !13, line: 129, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "serialNumber", scope: !255, file: !8, line: 310, baseType: !108, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !264, line: 17, baseType: !265)
!264 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !264, line: 17, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !86, line: 99, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !264, line: 20, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !210}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_CRL", file: !86, line: 228, flags: DIFlagFwdDecl)
!278 = !{i32 2, !"Dwarf Version", i32 4}
!279 = !{i32 2, !"Debug Info Version", i32 3}
!280 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!281 = distinct !DISubprogram(name: "d2i_CMS_ContentInfo", scope: !282, file: !282, line: 19, type: !283, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!282 = !DIFile(filename: "crypto/cms/cms_lib.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs")
!283 = !DISubroutineType(types: !284)
!284 = !{!4, !285, !286, !31}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!289 = !DILocalVariable(name: "a", arg: 1, scope: !281, file: !282, line: 19, type: !285)
!290 = !DIExpression()
!291 = !DILocation(line: 19, column: 56, scope: !281)
!292 = !DILocalVariable(name: "in", arg: 2, scope: !281, file: !282, line: 19, type: !286)
!293 = !DILocation(line: 19, column: 81, scope: !281)
!294 = !DILocalVariable(name: "len", arg: 3, scope: !281, file: !282, line: 19, type: !31)
!295 = !DILocation(line: 19, column: 90, scope: !281)
!296 = !DILocation(line: 19, column: 152, scope: !281)
!297 = !DILocation(line: 19, column: 137, scope: !281)
!298 = !DILocation(line: 19, column: 155, scope: !281)
!299 = !DILocation(line: 19, column: 159, scope: !281)
!300 = !DILocation(line: 19, column: 123, scope: !281)
!301 = !DILocation(line: 19, column: 104, scope: !281)
!302 = !DILocation(line: 19, column: 97, scope: !281)
!303 = distinct !DISubprogram(name: "i2d_CMS_ContentInfo", scope: !282, file: !282, line: 19, type: !304, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!304 = !DISubroutineType(types: !305)
!305 = !{!25, !4, !306}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!307 = !DILocalVariable(name: "a", arg: 1, scope: !303, file: !282, line: 19, type: !4)
!308 = !DILocation(line: 19, column: 233, scope: !303)
!309 = !DILocalVariable(name: "out", arg: 2, scope: !303, file: !282, line: 19, type: !306)
!310 = !DILocation(line: 19, column: 252, scope: !303)
!311 = !DILocation(line: 19, column: 294, scope: !303)
!312 = !DILocation(line: 19, column: 280, scope: !303)
