; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a/[inter]libavutil--avsscanf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a/[inter]libavutil--avsscanf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.FFFILE = type { i64, i8*, i8*, i8*, i8*, i64, i64, i8*, i64 (%struct.FFFILE*, i8*, i64)* }

@table = internal constant [257 x i8] c"\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\00\01\02\03\04\05\06\07\08\09\FF\FF\FF\FF\FF\FF\FF\0A\0B\0C\0D\0E\0F\10\11\12\13\14\15\16\17\18\19\1A\1B\1C\1D\1E\1F !\22#\FF\FF\FF\FF\FF\FF\0A\0B\0C\0D\0E\0F\10\11\12\13\14\15\16\17\18\19\1A\1B\1C\1D\1E\1F !\22#\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF", align 16
@.str = private unnamed_addr constant [9 x i8] c"\00\01\02\04\07\03\06\05\00", align 1
@.str.1 = private unnamed_addr constant [9 x i8] c"infinity\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !27)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a/[inter]libavutil--avsscanf.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!2 = !{}
!3 = !{!4, !5, !8, !11, !12, !14, !16, !18, !20, !22, !24, !15, !21, !26}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!7 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !9, line: 122, baseType: !10)
!9 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!10 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !9, line: 55, baseType: !10)
!27 = !{!28, !33, !64}
!28 = distinct !DIGlobalVariable(name: "table", scope: !0, file: !29, line: 119, type: !30, isLocal: true, isDefinition: true, variable: [257 x i8]* @table)
!29 = !DIFile(filename: "libavutil/avsscanf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 2056, align: 8, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 257)
!33 = distinct !DIGlobalVariable(name: "th", scope: !34, file: !29, line: 248, type: !58, isLocal: true, isDefinition: true, variable: [2 x i32]* @decfloat.th)
!34 = distinct !DISubprogram(name: "decfloat", scope: !29, file: !29, line: 245, type: !35, isLocal: true, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!35 = !DISubroutineType(types: !36)
!36 = !{!15, !37, !21, !21, !21, !21, !21}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFILE", file: !29, line: 45, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFILE", file: !29, line: 37, size: 576, align: 64, elements: !40)
!40 = !{!41, !44, !46, !47, !48, !49, !51, !52, !53}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !39, file: !29, line: 38, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !43, line: 216, baseType: !10)
!43 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!44 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !39, file: !29, line: 39, baseType: !45, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "rpos", scope: !39, file: !29, line: 40, baseType: !45, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !39, file: !29, line: 40, baseType: !45, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "shend", scope: !39, file: !29, line: 41, baseType: !45, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "shlim", scope: !39, file: !29, line: 42, baseType: !50, size: 64, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !43, line: 149, baseType: !23)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "shcnt", scope: !39, file: !29, line: 42, baseType: !50, size: 64, align: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !39, file: !29, line: 43, baseType: !4, size: 64, align: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !39, file: !29, line: 44, baseType: !54, size: 64, align: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!42, !57, !45, !42}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 64, align: 32, elements: !62)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !9, line: 51, baseType: !61)
!61 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!62 = !{!63}
!63 = !DISubrange(count: 2)
!64 = distinct !DIGlobalVariable(name: "p10s", scope: !34, file: !29, line: 261, type: !65, isLocal: true, isDefinition: true, variable: [8 x i32]* @decfloat.p10s)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 256, align: 32, elements: !67)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!67 = !{!68}
!68 = !DISubrange(count: 8)
!69 = !{i32 2, !"Dwarf Version", i32 4}
!70 = !{i32 2, !"Debug Info Version", i32 3}
!71 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!72 = distinct !DISubprogram(name: "av_sscanf", scope: !29, file: !29, line: 962, type: !73, isLocal: false, isDefinition: true, scopeLine: 963, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!73 = !DISubroutineType(types: !74)
!74 = !{!21, !75, !75, null}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!77 = !DILocalVariable(name: "string", arg: 1, scope: !72, file: !29, line: 962, type: !75)
!78 = !DIExpression()
!79 = !DILocation(line: 962, column: 27, scope: !72)
!80 = !DILocalVariable(name: "format", arg: 2, scope: !72, file: !29, line: 962, type: !75)
!81 = !DILocation(line: 962, column: 47, scope: !72)
!82 = !DILocalVariable(name: "ret", scope: !72, file: !29, line: 964, type: !21)
!83 = !DILocation(line: 964, column: 9, scope: !72)
!84 = !DILocalVariable(name: "ap", scope: !72, file: !29, line: 965, type: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !86, line: 98, baseType: !87)
!86 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !86, line: 40, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 965, baseType: !89)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 192, align: 64, elements: !96)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 965, size: 192, align: 64, elements: !91)
!91 = !{!92, !93, !94, !95}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !90, file: !1, line: 965, baseType: !61, size: 32, align: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !90, file: !1, line: 965, baseType: !61, size: 32, align: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !90, file: !1, line: 965, baseType: !4, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !90, file: !1, line: 965, baseType: !4, size: 64, align: 64, offset: 128)
!96 = !{!97}
!97 = !DISubrange(count: 1)
!98 = !DILocation(line: 965, column: 13, scope: !72)
!99 = !DILocation(line: 966, column: 4, scope: !72)
!100 = !DILocation(line: 967, column: 22, scope: !72)
!101 = !DILocation(line: 967, column: 30, scope: !72)
!102 = !DILocation(line: 967, column: 38, scope: !72)
!103 = !DILocation(line: 967, column: 11, scope: !72)
!104 = !DILocation(line: 967, column: 9, scope: !72)
!105 = !DILocation(line: 968, column: 4, scope: !72)
!106 = !DILocation(line: 969, column: 12, scope: !72)
!107 = !DILocation(line: 969, column: 5, scope: !72)
!108 = distinct !DISubprogram(name: "ff_vsscanf", scope: !29, file: !29, line: 952, type: !109, isLocal: true, isDefinition: true, scopeLine: 953, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!109 = !DISubroutineType(types: !110)
!110 = !{!21, !75, !75, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!112 = !DILocalVariable(name: "s", arg: 1, scope: !108, file: !29, line: 952, type: !75)
!113 = !DILocation(line: 952, column: 35, scope: !108)
!114 = !DILocalVariable(name: "fmt", arg: 2, scope: !108, file: !29, line: 952, type: !75)
!115 = !DILocation(line: 952, column: 50, scope: !108)
!116 = !DILocalVariable(name: "ap", arg: 3, scope: !108, file: !29, line: 952, type: !111)
!117 = !DILocation(line: 952, column: 63, scope: !108)
!118 = !DILocalVariable(name: "f", scope: !108, file: !29, line: 954, type: !38)
!119 = !DILocation(line: 954, column: 12, scope: !108)
!120 = !DILocation(line: 954, column: 16, scope: !108)
!121 = !DILocation(line: 955, column: 24, scope: !108)
!122 = !DILocation(line: 955, column: 45, scope: !108)
!123 = !DILocation(line: 959, column: 27, scope: !108)
!124 = !DILocation(line: 959, column: 32, scope: !108)
!125 = !DILocation(line: 959, column: 12, scope: !108)
!126 = !DILocation(line: 959, column: 5, scope: !108)
!127 = distinct !DISubprogram(name: "ffstring_read", scope: !29, file: !29, line: 62, type: !128, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!128 = !DISubroutineType(types: !129)
!129 = !{!42, !37, !45, !42}
!130 = !DILocalVariable(name: "f", arg: 1, scope: !127, file: !29, line: 62, type: !37)
!131 = !DILocation(line: 62, column: 37, scope: !127)
!132 = !DILocalVariable(name: "buf", arg: 2, scope: !127, file: !29, line: 62, type: !45)
!133 = !DILocation(line: 62, column: 55, scope: !127)
!134 = !DILocalVariable(name: "len", arg: 3, scope: !127, file: !29, line: 62, type: !42)
!135 = !DILocation(line: 62, column: 67, scope: !127)
!136 = !DILocalVariable(name: "src", scope: !127, file: !29, line: 64, type: !16)
!137 = !DILocation(line: 64, column: 11, scope: !127)
!138 = !DILocation(line: 64, column: 17, scope: !127)
!139 = !DILocation(line: 64, column: 20, scope: !127)
!140 = !DILocalVariable(name: "k", scope: !127, file: !29, line: 65, type: !42)
!141 = !DILocation(line: 65, column: 12, scope: !127)
!142 = !DILocation(line: 65, column: 16, scope: !127)
!143 = !DILocation(line: 65, column: 19, scope: !127)
!144 = !DILocalVariable(name: "end", scope: !127, file: !29, line: 66, type: !16)
!145 = !DILocation(line: 66, column: 11, scope: !127)
!146 = !DILocation(line: 66, column: 24, scope: !127)
!147 = !DILocation(line: 66, column: 32, scope: !127)
!148 = !DILocation(line: 66, column: 17, scope: !127)
!149 = !DILocation(line: 68, column: 9, scope: !150)
!150 = distinct !DILexicalBlock(scope: !127, file: !29, line: 68, column: 9)
!151 = !DILocation(line: 68, column: 9, scope: !127)
!152 = !DILocation(line: 68, column: 18, scope: !153)
!153 = !DILexicalBlockFile(scope: !150, file: !29, discriminator: 1)
!154 = !DILocation(line: 68, column: 22, scope: !153)
!155 = !DILocation(line: 68, column: 21, scope: !153)
!156 = !DILocation(line: 68, column: 16, scope: !153)
