; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a/[inter]libavutil--log.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a/[inter]libavutil--log.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVBPrint = type { i8*, i32, i32, i32, [1 x i8], [1000 x i8] }

@.str = private unnamed_addr constant [9 x i8] c"%s%s%s%s\00", align 1
@av_log_default_callback.print_prefix = internal global i32 1, align 4
@av_log_default_callback.count = internal global i32 0, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !24, globals: !76)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a/[inter]libavutil--log.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 29, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!6 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!7 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!8 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!9 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!10 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!11 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!12 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!13 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!14 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!15 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!16 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!17 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!18 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!19 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!20 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!21 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!22 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!23 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!24 = !{!25, !70, !71, !75}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !29)
!29 = !{!30, !34, !39, !43, !45, !46, !47, !51, !57, !59, !63}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !28, file: !4, line: 72, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !28, file: !4, line: 78, baseType: !35, size: 64, align: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{!31, !38}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !28, file: !4, line: 85, baseType: !40, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !28, file: !4, line: 93, baseType: !44, size: 32, align: 32, offset: 192)
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !28, file: !4, line: 99, baseType: !44, size: 32, align: 32, offset: 224)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !28, file: !4, line: 108, baseType: !44, size: 32, align: 32, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !28, file: !4, line: 113, baseType: !48, size: 64, align: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!38, !38, !38}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !28, file: !4, line: 123, baseType: !52, size: 64, align: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !28, file: !4, line: 130, baseType: !58, size: 32, align: 32, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !28, file: !4, line: 136, baseType: !60, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!58, !38}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !28, file: !4, line: 142, baseType: !64, size: 64, align: 64, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!44, !67, !38, !31, !44}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !73, line: 48, baseType: !74)
!73 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!74 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!76 = !{!77, !91, !92, !96, !97, !98, !99, !128, !129, !135}
!77 = distinct !DIGlobalVariable(name: "print_prefix", scope: !78, file: !79, line: 302, type: !44, isLocal: true, isDefinition: true, variable: i32* @av_log_default_callback.print_prefix)
!78 = distinct !DISubprogram(name: "av_log_default_callback", scope: !79, file: !79, line: 300, type: !80, isLocal: false, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!79 = !DIFile(filename: "libavutil/log.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!80 = !DISubroutineType(types: !81)
!81 = !{null, !38, !44, !31, !82}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 199, size: 192, align: 64, elements: !84)
!84 = !{!85, !87, !88, !89}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !83, file: !1, line: 199, baseType: !86, size: 32, align: 32)
!86 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !83, file: !1, line: 199, baseType: !86, size: 32, align: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !83, file: !1, line: 199, baseType: !38, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !83, file: !1, line: 199, baseType: !38, size: 64, align: 64, offset: 128)
!90 = !{}
!91 = distinct !DIGlobalVariable(name: "count", scope: !78, file: !79, line: 303, type: !44, isLocal: true, isDefinition: true, variable: i32* @av_log_default_callback.count)
!92 = distinct !DIGlobalVariable(name: "prev", scope: !78, file: !79, line: 304, type: !93, isLocal: true, isDefinition: true, variable: [1024 x i8]* @av_log_default_callback.prev)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8192, align: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 1024)
!96 = distinct !DIGlobalVariable(name: "is_atty", scope: !78, file: !79, line: 307, type: !44, isLocal: true, isDefinition: true, variable: i32* @av_log_default_callback.is_atty)
!97 = distinct !DIGlobalVariable(name: "flags", scope: !0, file: !79, line: 55, type: !44, isLocal: true, isDefinition: true, variable: i32* @flags)
!98 = distinct !DIGlobalVariable(name: "av_log_level", scope: !0, file: !79, line: 54, type: !44, isLocal: true, isDefinition: true, variable: i32* @av_log_level)
!99 = distinct !DIGlobalVariable(name: "mutex", scope: !0, file: !79, line: 44, type: !100, isLocal: true, isDefinition: true, variable: %union.pthread_mutex_t* @mutex)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !101, line: 128, baseType: !102)
!101 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!102 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !101, line: 90, size: 320, align: 64, elements: !103)
!103 = !{!104, !122, !126}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !102, file: !101, line: 125, baseType: !105, size: 320, align: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !101, line: 92, size: 320, align: 64, elements: !106)
!106 = !{!107, !108, !109, !110, !111, !112, !114, !115}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !105, file: !101, line: 94, baseType: !44, size: 32, align: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !105, file: !101, line: 95, baseType: !86, size: 32, align: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !105, file: !101, line: 96, baseType: !44, size: 32, align: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !105, file: !101, line: 98, baseType: !86, size: 32, align: 32, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !105, file: !101, line: 102, baseType: !44, size: 32, align: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !105, file: !101, line: 104, baseType: !113, size: 16, align: 16, offset: 160)
!113 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !105, file: !101, line: 105, baseType: !113, size: 16, align: 16, offset: 176)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !105, file: !101, line: 106, baseType: !116, size: 128, align: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !101, line: 79, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !101, line: 75, size: 128, align: 64, elements: !118)
!118 = !{!119, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !117, file: !101, line: 77, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !117, file: !101, line: 78, baseType: !120, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !102, file: !101, line: 126, baseType: !123, size: 320, align: 8)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 320, align: 8, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 40)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !102, file: !101, line: 127, baseType: !127, size: 64, align: 64)
!127 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!128 = distinct !DIGlobalVariable(name: "use_color", scope: !0, file: !79, line: 121, type: !44, isLocal: true, isDefinition: true, variable: i32* @use_color)
!129 = distinct !DIGlobalVariable(name: "color", scope: !0, file: !79, line: 92, type: !130, isLocal: true, isDefinition: true, variable: [62 x i32]* @color)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 1984, align: 32, elements: !133)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !73, line: 51, baseType: !86)
!133 = !{!134}
!134 = !DISubrange(count: 62)
!135 = distinct !DIGlobalVariable(name: "av_log_callback", scope: !0, file: !79, line: 358, type: !136, isLocal: true, isDefinition: true, variable: void (i8*, i32, i8*, %struct.__va_list_tag*)** @av_log_callback)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!137 = !{i32 2, !"Dwarf Version", i32 4}
!138 = !{i32 2, !"Debug Info Version", i32 3}
!139 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!140 = distinct !DISubprogram(name: "av_default_item_name", scope: !79, file: !79, line: 191, type: !36, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!141 = !DILocalVariable(name: "ptr", arg: 1, scope: !140, file: !79, line: 191, type: !38)
!142 = !DIExpression()
!143 = !DILocation(line: 191, column: 40, scope: !140)
!144 = !DILocation(line: 193, column: 27, scope: !140)
!145 = !DILocation(line: 193, column: 14, scope: !140)
!146 = !DILocation(line: 193, column: 13, scope: !140)
!147 = !DILocation(line: 193, column: 33, scope: !140)
!148 = !DILocation(line: 193, column: 5, scope: !140)
!149 = distinct !DISubprogram(name: "av_default_get_category", scope: !79, file: !79, line: 196, type: !61, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!150 = !DILocalVariable(name: "ptr", arg: 1, scope: !149, file: !79, line: 196, type: !38)
!151 = !DILocation(line: 196, column: 47, scope: !149)
!152 = !DILocation(line: 198, column: 27, scope: !149)
!153 = !DILocation(line: 198, column: 14, scope: !149)
!154 = !DILocation(line: 198, column: 13, scope: !149)
!155 = !DILocation(line: 198, column: 33, scope: !149)
!156 = !DILocation(line: 198, column: 5, scope: !149)
!157 = distinct !DISubprogram(name: "av_log_format_line", scope: !79, file: !79, line: 282, type: !158, isLocal: false, isDefinition: true, scopeLine: 284, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !38, !44, !31, !82, !160, !44, !70}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!161 = !DILocalVariable(name: "ptr", arg: 1, scope: !157, file: !79, line: 282, type: !38)
!162 = !DILocation(line: 282, column: 31, scope: !157)
!163 = !DILocalVariable(name: "level", arg: 2, scope: !157, file: !79, line: 282, type: !44)
!164 = !DILocation(line: 282, column: 40, scope: !157)
!165 = !DILocalVariable(name: "fmt", arg: 3, scope: !157, file: !79, line: 282, type: !31)
!166 = !DILocation(line: 282, column: 59, scope: !157)
!167 = !DILocalVariable(name: "vl", arg: 4, scope: !157, file: !79, line: 282, type: !82)
!168 = !DILocation(line: 282, column: 72, scope: !157)
!169 = !DILocalVariable(name: "line", arg: 5, scope: !157, file: !79, line: 283, type: !160)
!170 = !DILocation(line: 283, column: 31, scope: !157)
!171 = !DILocalVariable(name: "line_size", arg: 6, scope: !157, file: !79, line: 283, type: !44)
!172 = !DILocation(line: 283, column: 41, scope: !157)
!173 = !DILocalVariable(name: "print_prefix", arg: 7, scope: !157, file: !79, line: 283, type: !70)
!174 = !DILocation(line: 283, column: 57, scope: !157)
!175 = !DILocation(line: 285, column: 25, scope: !157)
!176 = !DILocation(line: 285, column: 30, scope: !157)
!177 = !DILocation(line: 285, column: 37, scope: !157)
!178 = !DILocation(line: 285, column: 42, scope: !157)
!179 = !DILocation(line: 285, column: 46, scope: !157)
!180 = !DILocation(line: 285, column: 52, scope: !157)
!181 = !DILocation(line: 285, column: 63, scope: !157)
!182 = !DILocation(line: 285, column: 5, scope: !157)
!183 = !DILocation(line: 286, column: 1, scope: !157)
!184 = distinct !DISubprogram(name: "av_log_format_line2", scope: !79, file: !79, line: 288, type: !185, isLocal: false, isDefinition: true, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!185 = !DISubroutineType(types: !186)
!186 = !{!44, !38, !44, !31, !82, !160, !44, !70}
!187 = !DILocalVariable(name: "ptr", arg: 1, scope: !184, file: !79, line: 288, type: !38)
!188 = !DILocation(line: 288, column: 31, scope: !184)
!189 = !DILocalVariable(name: "level", arg: 2, scope: !184, file: !79, line: 288, type: !44)
!190 = !DILocation(line: 288, column: 40, scope: !184)
!191 = !DILocalVariable(name: "fmt", arg: 3, scope: !184, file: !79, line: 288, type: !31)
!192 = !DILocation(line: 288, column: 59, scope: !184)
!193 = !DILocalVariable(name: "vl", arg: 4, scope: !184, file: !79, line: 288, type: !82)
!194 = !DILocation(line: 288, column: 72, scope: !184)
!195 = !DILocalVariable(name: "line", arg: 5, scope: !184, file: !79, line: 289, type: !160)
!196 = !DILocation(line: 289, column: 31, scope: !184)
!197 = !DILocalVariable(name: "line_size", arg: 6, scope: !184, file: !79, line: 289, type: !44)
!198 = !DILocation(line: 289, column: 41, scope: !184)
!199 = !DILocalVariable(name: "print_prefix", arg: 7, scope: !184, file: !79, line: 289, type: !70)
!200 = !DILocation(line: 289, column: 57, scope: !184)
!201 = !DILocalVariable(name: "part", scope: !184, file: !79, line: 291, type: !202)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 32768, align: 64, elements: !219)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBPrint", file: !204, line: 82, baseType: !205)
!204 = !DIFile(filename: "libavutil/bprint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBPrint", file: !204, line: 82, size: 8192, align: 64, elements: !206)
!206 = !{!207, !208, !209, !210, !211, !215}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !205, file: !204, line: 82, baseType: !160, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !205, file: !204, line: 82, baseType: !86, size: 32, align: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !205, file: !204, line: 82, baseType: !86, size: 32, align: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "size_max", scope: !205, file: !204, line: 82, baseType: !86, size: 32, align: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_internal_buffer", scope: !205, file: !204, line: 82, baseType: !212, size: 8, align: 8, offset: 160)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, align: 8, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 1)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_padding", scope: !205, file: !204, line: 82, baseType: !216, size: 8000, align: 8, offset: 168)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8000, align: 8, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 1000)
!219 = !{!220}
!220 = !DISubrange(count: 4)
!221 = !DILocation(line: 291, column: 14, scope: !184)
!222 = !DILocalVariable(name: "ret", scope: !184, file: !79, line: 292, type: !44)
!223 = !DILocation(line: 292, column: 9, scope: !184)
!224 = !DILocation(line: 294, column: 17, scope: !184)
!225 = !DILocation(line: 294, column: 22, scope: !184)
!226 = !DILocation(line: 294, column: 29, scope: !184)
!227 = !DILocation(line: 294, column: 34, scope: !184)
!228 = !DILocation(line: 294, column: 38, scope: !184)
!229 = !DILocation(line: 294, column: 44, scope: !184)
!230 = !DILocation(line: 294, column: 5, scope: !184)
!231 = !DILocation(line: 295, column: 20, scope: !184)
!232 = !DILocation(line: 295, column: 26, scope: !184)
!233 = !DILocation(line: 295, column: 49, scope: !184)
!234 = !DILocation(line: 295, column: 57, scope: !184)
!235 = !DILocation(line: 295, column: 62, scope: !184)
!236 = !DILocation(line: 295, column: 70, scope: !184)
!237 = !DILocation(line: 295, column: 75, scope: !184)
!238 = !DILocation(line: 295, column: 83, scope: !184)
!239 = !DILocation(line: 295, column: 88, scope: !184)
!240 = !DILocation(line: 295, column: 96, scope: !184)
!241 = !DILocation(line: 295, column: 11, scope: !184)
!242 = !DILocation(line: 295, column: 9, scope: !184)
!243 = !DILocation(line: 296, column: 24, scope: !184)
!244 = !DILocation(line: 296, column: 28, scope: !184)
!245 = !DILocation(line: 296, column: 5, scope: !184)
!246 = !DILocation(line: 297, column: 12, scope: !184)
!247 = !DILocation(line: 297, column: 5, scope: !184)
!248 = distinct !DISubprogram(name: "format_line", scope: !79, file: !79, line: 246, type: !249, isLocal: true, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !38, !44, !31, !82, !251, !70, !70}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!252 = !DILocalVariable(name: "avcl", arg: 1, scope: !248, file: !79, line: 246, type: !38)
!253 = !DILocation(line: 246, column: 31, scope: !248)
!254 = !DILocalVariable(name: "level", arg: 2, scope: !248, file: !79, line: 246, type: !44)
!255 = !DILocation(line: 246, column: 41, scope: !248)
!256 = !DILocalVariable(name: "fmt", arg: 3, scope: !248, file: !79, line: 246, type: !31)
!257 = !DILocation(line: 246, column: 60, scope: !248)
!258 = !DILocalVariable(name: "vl", arg: 4, scope: !248, file: !79, line: 246, type: !82)
!259 = !DILocation(line: 246, column: 73, scope: !248)
!260 = !DILocalVariable(name: "part", arg: 5, scope: !248, file: !79, line: 247, type: !251)
!261 = !DILocation(line: 247, column: 34, scope: !248)
!262 = !DILocalVariable(name: "print_prefix", arg: 6, scope: !248, file: !79, line: 247, type: !70)
!263 = !DILocation(line: 247, column: 48, scope: !248)
!264 = !DILocalVariable(name: "type", arg: 7, scope: !248, file: !79, line: 247, type: !70)
!265 = !DILocation(line: 247, column: 66, scope: !248)
!266 = !DILocalVariable(name: "avc", scope: !248, file: !79, line: 249, type: !26)
!267 = !DILocation(line: 249, column: 14, scope: !248)
!268 = !DILocation(line: 249, column: 20, scope: !248)
!269 = !DILocation(line: 249, column: 41, scope: !270)
!270 = !DILexicalBlockFile(scope: !248, file: !79, discriminator: 1)
!271 = !DILocation(line: 249, column: 28, scope: !270)
!272 = !DILocation(line: 249, column: 27, scope: !270)
!273 = !DILocation(line: 249, column: 20, scope: !270)
!274 = !DILocation(line: 249, column: 20, scope: !275)
!275 = !DILexicalBlockFile(scope: !248, file: !79, discriminator: 2)
!276 = !DILocation(line: 249, column: 20, scope: !277)
!277 = !DILexicalBlockFile(scope: !248, file: !79, discriminator: 3)
