; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a/[inter]libavutil--float_dsp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a/[inter]libavutil--float_dsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFloatDSPContext = type { void (float*, float*, float*, i32)*, void (float*, float*, float, i32)*, void (double*, double*, double, i32)*, void (float*, float*, float, i32)*, void (double*, double*, double, i32)*, void (float*, float*, float*, float*, i32)*, void (float*, float*, float*, float*, i32)*, void (float*, float*, float*, i32)*, void (float*, float*, i32)*, float (float*, float*, i32)*, void (double*, double*, double*, i32)* }

; Function Attrs: nounwind uwtable
define float @avpriv_scalarproduct_float_c(float* %v1, float* %v2, i32 %len) #0 !dbg !6 {
entry:
  %v1.addr = alloca float*, align 8
  %v2.addr = alloca float*, align 8
  %len.addr = alloca i32, align 4
  %p = alloca float, align 4
  %i = alloca i32, align 4
  store float* %v1, float** %v1.addr, align 8
  call void @llvm.dbg.declare(metadata float** %v1.addr, metadata !14, metadata !15), !dbg !16
  store float* %v2, float** %v2.addr, align 8
  call void @llvm.dbg.declare(metadata float** %v2.addr, metadata !17, metadata !15), !dbg !18
  store i32 %len, i32* %len.addr, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a/[inter]libavutil--float_dsp.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!6 = distinct !DISubprogram(name: "avpriv_scalarproduct_float_c", scope: !7, file: !7, line: 124, type: !8, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!7 = !DIFile(filename: "libavutil/float_dsp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11, !11, !13}
!10 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DILocalVariable(name: "v1", arg: 1, scope: !6, file: !7, line: 124, type: !11)
!15 = !DIExpression()
!16 = !DILocation(line: 124, column: 49, scope: !6)
!17 = !DILocalVariable(name: "v2", arg: 2, scope: !6, file: !7, line: 124, type: !11)
!18 = !DILocation(line: 124, column: 66, scope: !6)
!19 = !DILocalVariable(name: "len", arg: 3, scope: !6, file: !7, line: 124, type: !13)
!20 = !DILocation(line: 124, column: 74, scope: !6)
!21 = !DILocalVariable(name: "p", scope: !6, file: !7, line: 126, type: !10)
!22 = !DILocation(line: 126, column: 11, scope: !6)
!23 = !DILocalVariable(name: "i", scope: !6, file: !7, line: 127, type: !13)
!24 = !DILocation(line: 127, column: 9, scope: !6)
!25 = !DILocation(line: 129, column: 12, scope: !26)
!26 = distinct !DILexicalBlock(scope: !6, file: !7, line: 129, column: 5)
!27 = !DILocation(line: 129, column: 10, scope: !26)
!28 = !DILocation(line: 129, column: 17, scope: !29)
!29 = !DILexicalBlockFile(scope: !30, file: !7, discriminator: 1)
!30 = distinct !DILexicalBlock(scope: !26, file: !7, line: 129, column: 5)
!31 = !DILocation(line: 129, column: 21, scope: !29)
!32 = !DILocation(line: 129, column: 19, scope: !29)
!33 = !DILocation(line: 129, column: 5, scope: !29)
!34 = !DILocation(line: 130, column: 17, scope: !30)
!35 = !DILocation(line: 130, column: 14, scope: !30)
!36 = !DILocation(line: 130, column: 25, scope: !30)
!37 = !DILocation(line: 130, column: 22, scope: !30)
!38 = !DILocation(line: 130, column: 20, scope: !30)
!39 = !DILocation(line: 130, column: 11, scope: !30)
!40 = !DILocation(line: 130, column: 9, scope: !30)
!41 = !DILocation(line: 129, column: 27, scope: !42)
!42 = !DILexicalBlockFile(scope: !30, file: !7, discriminator: 2)
!43 = !DILocation(line: 129, column: 5, scope: !42)
!44 = distinct !{!44, !45}
!45 = !DILocation(line: 129, column: 5, scope: !6)
!46 = !DILocation(line: 132, column: 12, scope: !6)
!47 = !DILocation(line: 132, column: 5, scope: !6)
!48 = distinct !DISubprogram(name: "avpriv_float_dsp_alloc", scope: !7, file: !7, line: 135, type: !49, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !13}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFloatDSPContext", file: !53, line: 192, baseType: !54)
!53 = !DIFile(filename: "libavutil/float_dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFloatDSPContext", file: !53, line: 24, size: 704, align: 64, elements: !55)
!55 = !{!56, !61, !65, !73, !74, !75, !79, !80, !81, !86, !88}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul", scope: !54, file: !53, line: 38, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60, !11, !11, !13}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmac_scalar", scope: !54, file: !53, line: 54, baseType: !62, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !60, !11, !10, !13}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmac_scalar", scope: !54, file: !53, line: 70, baseType: !66, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !69, !71, !70, !13}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_scalar", scope: !54, file: !53, line: 85, baseType: !62, size: 64, align: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmul_scalar", scope: !54, file: !53, line: 100, baseType: !66, size: 64, align: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_window", scope: !54, file: !53, line: 119, baseType: !76, size: 64, align: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !60, !11, !11, !11, !13}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_add", scope: !54, file: !53, line: 137, baseType: !76, size: 64, align: 64, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_reverse", scope: !54, file: !53, line: 154, baseType: !57, size: 64, align: 64, offset: 448)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "butterflies_float", scope: !54, file: !53, line: 164, baseType: !82, size: 64, align: 64, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !85, !85, !13}
!85 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !60)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "scalarproduct_float", scope: !54, file: !53, line: 175, baseType: !87, size: 64, align: 64, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmul", scope: !54, file: !53, line: 190, baseType: !89, size: 64, align: 64, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !69, !71, !71, !13}
!92 = !DILocalVariable(name: "bit_exact", arg: 1, scope: !48, file: !7, line: 135, type: !13)
!93 = !DILocation(line: 135, column: 69, scope: !48)
!94 = !DILocalVariable(name: "fdsp", scope: !48, file: !7, line: 137, type: !51)
!95 = !DILocation(line: 137, column: 24, scope: !48)
!96 = !DILocation(line: 137, column: 31, scope: !48)
!97 = !DILocation(line: 138, column: 10, scope: !98)
!98 = distinct !DILexicalBlock(scope: !48, file: !7, line: 138, column: 9)
!99 = !DILocation(line: 138, column: 9, scope: !48)
!100 = !DILocation(line: 139, column: 9, scope: !98)
!101 = !DILocation(line: 141, column: 5, scope: !48)
!102 = !DILocation(line: 141, column: 11, scope: !48)
!103 = !DILocation(line: 141, column: 23, scope: !48)
!104 = !DILocation(line: 142, column: 5, scope: !48)
!105 = !DILocation(line: 142, column: 11, scope: !48)
!106 = !DILocation(line: 142, column: 23, scope: !48)
!107 = !DILocation(line: 143, column: 5, scope: !48)
!108 = !DILocation(line: 143, column: 11, scope: !48)
!109 = !DILocation(line: 143, column: 30, scope: !48)
!110 = !DILocation(line: 144, column: 5, scope: !48)
!111 = !DILocation(line: 144, column: 11, scope: !48)
!112 = !DILocation(line: 144, column: 30, scope: !48)
!113 = !DILocation(line: 145, column: 5, scope: !48)
!114 = !DILocation(line: 145, column: 11, scope: !48)
!115 = !DILocation(line: 145, column: 30, scope: !48)
!116 = !DILocation(line: 146, column: 5, scope: !48)
!117 = !DILocation(line: 146, column: 11, scope: !48)
!118 = !DILocation(line: 146, column: 30, scope: !48)
!119 = !DILocation(line: 147, column: 5, scope: !48)
!120 = !DILocation(line: 147, column: 11, scope: !48)
!121 = !DILocation(line: 147, column: 30, scope: !48)
!122 = !DILocation(line: 148, column: 5, scope: !48)
!123 = !DILocation(line: 148, column: 11, scope: !48)
!124 = !DILocation(line: 148, column: 27, scope: !48)
!125 = !DILocation(line: 149, column: 5, scope: !48)
!126 = !DILocation(line: 149, column: 11, scope: !48)
!127 = !DILocation(line: 149, column: 31, scope: !48)
!128 = !DILocation(line: 150, column: 5, scope: !48)
!129 = !DILocation(line: 150, column: 11, scope: !48)
!130 = !DILocation(line: 150, column: 29, scope: !48)
!131 = !DILocation(line: 151, column: 5, scope: !48)
!132 = !DILocation(line: 151, column: 11, scope: !48)
!133 = !DILocation(line: 151, column: 31, scope: !48)
!134 = !DILocation(line: 160, column: 31, scope: !135)
!135 = distinct !DILexicalBlock(scope: !48, file: !7, line: 159, column: 9)
!136 = !DILocation(line: 160, column: 9, scope: !135)
!137 = !DILocation(line: 163, column: 12, scope: !48)
!138 = !DILocation(line: 163, column: 5, scope: !48)
!139 = !DILocation(line: 164, column: 1, scope: !48)
!140 = distinct !DISubprogram(name: "vector_fmul_c", scope: !7, file: !7, line: 27, type: !58, isLocal: true, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!141 = !DILocalVariable(name: "dst", arg: 1, scope: !140, file: !7, line: 27, type: !60)
!142 = !DILocation(line: 27, column: 34, scope: !140)
!143 = !DILocalVariable(name: "src0", arg: 2, scope: !140, file: !7, line: 27, type: !11)
!144 = !DILocation(line: 27, column: 52, scope: !140)
!145 = !DILocalVariable(name: "src1", arg: 3, scope: !140, file: !7, line: 27, type: !11)
!146 = !DILocation(line: 27, column: 71, scope: !140)
!147 = !DILocalVariable(name: "len", arg: 4, scope: !140, file: !7, line: 28, type: !13)
!148 = !DILocation(line: 28, column: 31, scope: !140)
!149 = !DILocalVariable(name: "i", scope: !140, file: !7, line: 30, type: !13)
!150 = !DILocation(line: 30, column: 9, scope: !140)
!151 = !DILocation(line: 31, column: 12, scope: !152)
