; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a/[inter]libavutil--bprint.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a/[inter]libavutil--bprint.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVBPrint = type { i8*, i32, i32, i32, [1 x i8], [1000 x i8] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@.str = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@av_bprint_strftime.txt = internal constant [28 x i8] c"[truncated strftime output]\00", align 16
@.str.1 = private unnamed_addr constant [5 x i8] c"'\5C''\00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c" \0A\09\0D\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"'\5C\00", align 1

; Function Attrs: nounwind uwtable
define void @av_bprint_init(%struct.AVBPrint* %buf, i32 %size_init, i32 %size_max) #0 !dbg !63 {
entry:
  %buf.addr = alloca %struct.AVBPrint*, align 8
  %size_init.addr = alloca i32, align 4
  %size_max.addr = alloca i32, align 4
  %size_auto = alloca i32, align 4
  store %struct.AVBPrint* %buf, %struct.AVBPrint** %buf.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.AVBPrint** %buf.addr, metadata !66, metadata !67), !dbg !68
  store i32 %size_init, i32* %size_init.addr, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9, globals: !14)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a/[inter]libavutil--bprint.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVEscapeMode", file: !4, line: 313, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavutil/avstring.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "AV_ESCAPE_MODE_AUTO", value: 0)
!7 = !DIEnumerator(name: "AV_ESCAPE_MODE_BACKSLASH", value: 1)
!8 = !DIEnumerator(name: "AV_ESCAPE_MODE_QUOTE", value: 2)
!9 = !{!10, !12, !13}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!14 = !{!15}
!15 = distinct !DIGlobalVariable(name: "txt", scope: !16, file: !17, line: 207, type: !57, isLocal: true, isDefinition: true, variable: [28 x i8]* @av_bprint_strftime.txt)
!16 = distinct !DISubprogram(name: "av_bprint_strftime", scope: !17, file: !17, line: 176, type: !18, isLocal: false, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !56)
!17 = !DIFile(filename: "libavutil/bprint.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!18 = !DISubroutineType(types: !19)
!19 = !{null, !20, !37, !39}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBPrint", file: !22, line: 82, baseType: !23)
!22 = !DIFile(filename: "libavutil/bprint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBPrint", file: !22, line: 82, size: 8192, align: 64, elements: !24)
!24 = !{!25, !26, !27, !28, !29, !33}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !23, file: !22, line: 82, baseType: !10, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !23, file: !22, line: 82, baseType: !13, size: 32, align: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !23, file: !22, line: 82, baseType: !13, size: 32, align: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "size_max", scope: !23, file: !22, line: 82, baseType: !13, size: 32, align: 32, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_internal_buffer", scope: !23, file: !22, line: 82, baseType: !30, size: 8, align: 8, offset: 160)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, align: 8, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 1)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_padding", scope: !23, file: !22, line: 82, baseType: !34, size: 8000, align: 8, offset: 168)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8000, align: 8, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 1000)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !42, line: 133, size: 448, align: 64, elements: !43)
!42 = !DIFile(filename: "/usr/include/time.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !55}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !41, file: !42, line: 135, baseType: !12, size: 32, align: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !41, file: !42, line: 136, baseType: !12, size: 32, align: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !41, file: !42, line: 137, baseType: !12, size: 32, align: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !41, file: !42, line: 138, baseType: !12, size: 32, align: 32, offset: 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !41, file: !42, line: 139, baseType: !12, size: 32, align: 32, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !41, file: !42, line: 140, baseType: !12, size: 32, align: 32, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !41, file: !42, line: 141, baseType: !12, size: 32, align: 32, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !41, file: !42, line: 142, baseType: !12, size: 32, align: 32, offset: 224)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !41, file: !42, line: 143, baseType: !12, size: 32, align: 32, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_gmtoff", scope: !41, file: !42, line: 149, baseType: !54, size: 64, align: 64, offset: 320)
!54 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_zone", scope: !41, file: !42, line: 150, baseType: !37, size: 64, align: 64, offset: 384)
!56 = !{}
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 224, align: 8, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 28)
!60 = !{i32 2, !"Dwarf Version", i32 4}
!61 = !{i32 2, !"Debug Info Version", i32 3}
!62 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!63 = distinct !DISubprogram(name: "av_bprint_init", scope: !17, file: !17, line: 69, type: !64, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !56)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !20, !13, !13}
!66 = !DILocalVariable(name: "buf", arg: 1, scope: !63, file: !17, line: 69, type: !20)
!67 = !DIExpression()
!68 = !DILocation(line: 69, column: 31, scope: !63)
!69 = !DILocalVariable(name: "size_init", arg: 2, scope: !63, file: !17, line: 69, type: !13)
!70 = !DILocation(line: 69, column: 45, scope: !63)
!71 = !DILocalVariable(name: "size_max", arg: 3, scope: !63, file: !17, line: 69, type: !13)
!72 = !DILocation(line: 69, column: 65, scope: !63)
!73 = !DILocalVariable(name: "size_auto", scope: !63, file: !17, line: 71, type: !13)
!74 = !DILocation(line: 71, column: 14, scope: !63)
!75 = !DILocation(line: 71, column: 34, scope: !63)
!76 = !DILocation(line: 71, column: 26, scope: !63)
!77 = !DILocation(line: 71, column: 38, scope: !63)
!78 = !DILocation(line: 72, column: 26, scope: !63)
!79 = !DILocation(line: 72, column: 31, scope: !63)
!80 = !DILocation(line: 71, column: 53, scope: !63)
!81 = !DILocation(line: 74, column: 9, scope: !82)
!82 = distinct !DILexicalBlock(scope: !63, file: !17, line: 74, column: 9)
!83 = !DILocation(line: 74, column: 18, scope: !82)
!84 = !DILocation(line: 74, column: 9, scope: !63)
!85 = !DILocation(line: 75, column: 20, scope: !82)
!86 = !DILocation(line: 75, column: 18, scope: !82)
!87 = !DILocation(line: 75, column: 9, scope: !82)
!88 = !DILocation(line: 76, column: 16, scope: !63)
!89 = !DILocation(line: 76, column: 21, scope: !63)
!90 = !DILocation(line: 76, column: 5, scope: !63)
!91 = !DILocation(line: 76, column: 10, scope: !63)
!92 = !DILocation(line: 76, column: 14, scope: !63)
!93 = !DILocation(line: 77, column: 5, scope: !63)
!94 = !DILocation(line: 77, column: 10, scope: !63)
!95 = !DILocation(line: 77, column: 14, scope: !63)
!96 = !DILocation(line: 78, column: 19, scope: !63)
!97 = !DILocation(line: 78, column: 33, scope: !63)
!98 = !DILocation(line: 78, column: 30, scope: !63)
!99 = !DILocation(line: 78, column: 18, scope: !63)
!100 = !DILocation(line: 78, column: 46, scope: !101)
!101 = !DILexicalBlockFile(scope: !63, file: !17, discriminator: 1)
!102 = !DILocation(line: 78, column: 18, scope: !101)
!103 = !DILocation(line: 78, column: 59, scope: !104)
!104 = !DILexicalBlockFile(scope: !63, file: !17, discriminator: 2)
!105 = !DILocation(line: 78, column: 18, scope: !104)
!106 = !DILocation(line: 78, column: 18, scope: !107)
!107 = !DILexicalBlockFile(scope: !63, file: !17, discriminator: 3)
!108 = !DILocation(line: 78, column: 5, scope: !107)
!109 = !DILocation(line: 78, column: 10, scope: !107)
!110 = !DILocation(line: 78, column: 15, scope: !107)
!111 = !DILocation(line: 79, column: 21, scope: !63)
!112 = !DILocation(line: 79, column: 5, scope: !63)
!113 = !DILocation(line: 79, column: 10, scope: !63)
!114 = !DILocation(line: 79, column: 19, scope: !63)
!115 = !DILocation(line: 80, column: 6, scope: !63)
!116 = !DILocation(line: 80, column: 11, scope: !63)
!117 = !DILocation(line: 80, column: 15, scope: !63)
!118 = !DILocation(line: 81, column: 9, scope: !119)
!119 = distinct !DILexicalBlock(scope: !63, file: !17, line: 81, column: 9)
!120 = !DILocation(line: 81, column: 21, scope: !119)
!121 = !DILocation(line: 81, column: 26, scope: !119)
!122 = !DILocation(line: 81, column: 19, scope: !119)
!123 = !DILocation(line: 81, column: 9, scope: !63)
!124 = !DILocation(line: 82, column: 25, scope: !119)
!125 = !DILocation(line: 82, column: 30, scope: !119)
!126 = !DILocation(line: 82, column: 40, scope: !119)
!127 = !DILocation(line: 82, column: 9, scope: !119)
!128 = !DILocation(line: 83, column: 1, scope: !63)
!129 = distinct !DISubprogram(name: "av_bprint_alloc", scope: !17, file: !17, line: 36, type: !130, isLocal: true, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !56)
!130 = !DISubroutineType(types: !131)
!131 = !{!12, !20, !13}
!132 = !DILocalVariable(name: "buf", arg: 1, scope: !129, file: !17, line: 36, type: !20)
!133 = !DILocation(line: 36, column: 38, scope: !129)
!134 = !DILocalVariable(name: "room", arg: 2, scope: !129, file: !17, line: 36, type: !13)
!135 = !DILocation(line: 36, column: 52, scope: !129)
!136 = !DILocalVariable(name: "old_str", scope: !129, file: !17, line: 38, type: !10)
!137 = !DILocation(line: 38, column: 11, scope: !129)
!138 = !DILocalVariable(name: "new_str", scope: !129, file: !17, line: 38, type: !10)
!139 = !DILocation(line: 38, column: 21, scope: !129)
!140 = !DILocalVariable(name: "min_size", scope: !129, file: !17, line: 39, type: !13)
!141 = !DILocation(line: 39, column: 14, scope: !129)
!142 = !DILocalVariable(name: "new_size", scope: !129, file: !17, line: 39, type: !13)
!143 = !DILocation(line: 39, column: 24, scope: !129)
!144 = !DILocation(line: 41, column: 9, scope: !145)
!145 = distinct !DILexicalBlock(scope: !129, file: !17, line: 41, column: 9)
!146 = !DILocation(line: 41, column: 14, scope: !145)
!147 = !DILocation(line: 41, column: 22, scope: !145)
!148 = !DILocation(line: 41, column: 27, scope: !145)
!149 = !DILocation(line: 41, column: 19, scope: !145)
!150 = !DILocation(line: 41, column: 9, scope: !129)
!151 = !DILocation(line: 42, column: 9, scope: !145)
!152 = !DILocation(line: 43, column: 32, scope: !153)
!153 = distinct !DILexicalBlock(scope: !129, file: !17, line: 43, column: 9)
!154 = !DILocation(line: 43, column: 10, scope: !153)
!155 = !DILocation(line: 43, column: 9, scope: !129)
!156 = !DILocation(line: 44, column: 9, scope: !153)
!157 = !DILocation(line: 45, column: 16, scope: !129)
!158 = !DILocation(line: 45, column: 21, scope: !129)
!159 = !DILocation(line: 45, column: 25, scope: !129)
!160 = !DILocation(line: 45, column: 32, scope: !129)
!161 = !DILocation(line: 45, column: 37, scope: !129)
!162 = !DILocation(line: 45, column: 30, scope: !129)
!163 = !DILocation(line: 45, column: 41, scope: !129)
!164 = !DILocation(line: 45, column: 49, scope: !129)
!165 = !DILocation(line: 45, column: 46, scope: !129)
!166 = !DILocation(line: 45, column: 58, scope: !167)
!167 = !DILexicalBlockFile(scope: !129, file: !17, discriminator: 1)
!168 = !DILocation(line: 45, column: 32, scope: !167)
!169 = !DILocation(line: 45, column: 32, scope: !170)
!170 = !DILexicalBlockFile(scope: !129, file: !17, discriminator: 2)
!171 = !DILocation(line: 45, column: 37, scope: !170)
!172 = !DILocation(line: 45, column: 30, scope: !170)
!173 = !DILocation(line: 45, column: 41, scope: !170)
!174 = !DILocation(line: 45, column: 32, scope: !175)
!175 = !DILexicalBlockFile(scope: !129, file: !17, discriminator: 3)
!176 = !DILocation(line: 45, column: 29, scope: !175)
!177 = !DILocation(line: 45, column: 14, scope: !175)
!178 = !DILocation(line: 46, column: 16, scope: !129)
!179 = !DILocation(line: 46, column: 21, scope: !129)
!180 = !DILocation(line: 46, column: 28, scope: !129)
!181 = !DILocation(line: 46, column: 33, scope: !129)
!182 = !DILocation(line: 46, column: 42, scope: !129)
!183 = !DILocation(line: 46, column: 26, scope: !129)
!184 = !DILocation(line: 46, column: 48, scope: !167)
!185 = !DILocation(line: 46, column: 53, scope: !167)
!186 = !DILocation(line: 46, column: 16, scope: !167)
!187 = !DILocation(line: 46, column: 64, scope: !170)
!188 = !DILocation(line: 46, column: 69, scope: !170)
!189 = !DILocation(line: 46, column: 74, scope: !170)
!190 = !DILocation(line: 46, column: 16, scope: !170)
!191 = !DILocation(line: 46, column: 16, scope: !175)
!192 = !DILocation(line: 46, column: 14, scope: !175)
!193 = !DILocation(line: 47, column: 9, scope: !194)
!194 = distinct !DILexicalBlock(scope: !129, file: !17, line: 47, column: 9)
!195 = !DILocation(line: 47, column: 20, scope: !194)
!196 = !DILocation(line: 47, column: 18, scope: !194)
!197 = !DILocation(line: 47, column: 9, scope: !129)
!198 = !DILocation(line: 48, column: 22, scope: !194)
!199 = !DILocation(line: 48, column: 27, scope: !194)
!200 = !DILocation(line: 48, column: 40, scope: !194)
!201 = !DILocation(line: 48, column: 37, scope: !194)
!202 = !DILocation(line: 48, column: 21, scope: !194)
!203 = !DILocation(line: 48, column: 53, scope: !204)
!204 = !DILexicalBlockFile(scope: !194, file: !17, discriminator: 1)
!205 = !DILocation(line: 48, column: 21, scope: !204)
!206 = !DILocation(line: 48, column: 66, scope: !207)
!207 = !DILexicalBlockFile(scope: !194, file: !17, discriminator: 2)
!208 = !DILocation(line: 48, column: 71, scope: !207)
!209 = !DILocation(line: 48, column: 21, scope: !207)
!210 = !DILocation(line: 48, column: 21, scope: !211)
!211 = !DILexicalBlockFile(scope: !194, file: !17, discriminator: 3)
!212 = !DILocation(line: 48, column: 18, scope: !211)
!213 = !DILocation(line: 48, column: 9, scope: !211)
!214 = !DILocation(line: 49, column: 17, scope: !129)
!215 = !DILocation(line: 49, column: 23, scope: !129)
!216 = !DILocation(line: 49, column: 31, scope: !129)
!217 = !DILocation(line: 49, column: 37, scope: !129)
!218 = !DILocation(line: 49, column: 30, scope: !129)
!219 = !DILocation(line: 49, column: 27, scope: !129)
!220 = !DILocation(line: 49, column: 15, scope: !129)
!221 = !DILocation(line: 49, column: 65, scope: !167)
!222 = !DILocation(line: 49, column: 70, scope: !167)
!223 = !DILocation(line: 49, column: 15, scope: !167)
!224 = !DILocation(line: 49, column: 15, scope: !170)
!225 = !DILocation(line: 49, column: 15, scope: !175)
!226 = !DILocation(line: 49, column: 13, scope: !175)
!227 = !DILocation(line: 50, column: 26, scope: !129)
!228 = !DILocation(line: 50, column: 35, scope: !129)
!229 = !DILocation(line: 50, column: 15, scope: !129)
!230 = !DILocation(line: 50, column: 13, scope: !129)
!231 = !DILocation(line: 51, column: 10, scope: !232)
!232 = distinct !DILexicalBlock(scope: !129, file: !17, line: 51, column: 9)
!233 = !DILocation(line: 51, column: 9, scope: !129)
!234 = !DILocation(line: 52, column: 9, scope: !232)
!235 = !DILocation(line: 53, column: 10, scope: !236)
!236 = distinct !DILexicalBlock(scope: !129, file: !17, line: 53, column: 9)
!237 = !DILocation(line: 53, column: 9, scope: !129)
!238 = !DILocation(line: 54, column: 16, scope: !236)
!239 = !DILocation(line: 54, column: 25, scope: !236)
!240 = !DILocation(line: 54, column: 30, scope: !236)
!241 = !DILocation(line: 54, column: 35, scope: !236)
!242 = !DILocation(line: 54, column: 40, scope: !236)
!243 = !DILocation(line: 54, column: 44, scope: !236)
!244 = !DILocation(line: 54, column: 9, scope: !236)
!245 = !DILocation(line: 55, column: 16, scope: !129)
!246 = !DILocation(line: 55, column: 5, scope: !129)
!247 = !DILocation(line: 55, column: 10, scope: !129)
!248 = !DILocation(line: 55, column: 14, scope: !129)
!249 = !DILocation(line: 56, column: 17, scope: !129)
!250 = !DILocation(line: 56, column: 5, scope: !129)
!251 = !DILocation(line: 56, column: 10, scope: !129)
!252 = !DILocation(line: 56, column: 15, scope: !129)
!253 = !DILocation(line: 57, column: 5, scope: !129)
!254 = !DILocation(line: 58, column: 1, scope: !129)
!255 = distinct !DISubprogram(name: "av_bprint_init_for_buffer", scope: !17, file: !17, line: 85, type: !256, isLocal: false, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !56)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !20, !10, !13}
!258 = !DILocalVariable(name: "buf", arg: 1, scope: !255, file: !17, line: 85, type: !20)
!259 = !DILocation(line: 85, column: 42, scope: !255)
!260 = !DILocalVariable(name: "buffer", arg: 2, scope: !255, file: !17, line: 85, type: !10)
!261 = !DILocation(line: 85, column: 53, scope: !255)
!262 = !DILocalVariable(name: "size", arg: 3, scope: !255, file: !17, line: 85, type: !13)
!263 = !DILocation(line: 85, column: 70, scope: !255)
!264 = !DILocation(line: 87, column: 16, scope: !255)
!265 = !DILocation(line: 87, column: 5, scope: !255)
!266 = !DILocation(line: 87, column: 10, scope: !255)
!267 = !DILocation(line: 87, column: 14, scope: !255)
!268 = !DILocation(line: 88, column: 5, scope: !255)
!269 = !DILocation(line: 88, column: 10, scope: !255)
!270 = !DILocation(line: 88, column: 14, scope: !255)
!271 = !DILocation(line: 89, column: 17, scope: !255)
!272 = !DILocation(line: 89, column: 5, scope: !255)
!273 = !DILocation(line: 89, column: 10, scope: !255)
!274 = !DILocation(line: 89, column: 15, scope: !255)
!275 = !DILocation(line: 90, column: 21, scope: !255)
!276 = !DILocation(line: 90, column: 5, scope: !255)
!277 = !DILocation(line: 90, column: 10, scope: !255)
!278 = !DILocation(line: 90, column: 19, scope: !255)
!279 = !DILocation(line: 91, column: 6, scope: !255)
!280 = !DILocation(line: 91, column: 11, scope: !255)
!281 = !DILocation(line: 91, column: 15, scope: !255)
!282 = !DILocation(line: 92, column: 1, scope: !255)
!283 = distinct !DISubprogram(name: "av_bprintf", scope: !17, file: !17, line: 94, type: !284, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !56)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !20, !37, null}
!286 = !DILocalVariable(name: "buf", arg: 1, scope: !283, file: !17, line: 94, type: !20)
!287 = !DILocation(line: 94, column: 27, scope: !283)
!288 = !DILocalVariable(name: "fmt", arg: 2, scope: !283, file: !17, line: 94, type: !37)
!289 = !DILocation(line: 94, column: 44, scope: !283)
!290 = !DILocalVariable(name: "room", scope: !283, file: !17, line: 96, type: !13)
!291 = !DILocation(line: 96, column: 14, scope: !283)
!292 = !DILocalVariable(name: "dst", scope: !283, file: !17, line: 97, type: !10)
!293 = !DILocation(line: 97, column: 11, scope: !283)
!294 = !DILocalVariable(name: "vl", scope: !283, file: !17, line: 98, type: !295)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !296, line: 98, baseType: !297)
!296 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavutil--libavutil.a")
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !296, line: 40, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 98, baseType: !299)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 192, align: 64, elements: !31)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 98, size: 192, align: 64, elements: !301)
!301 = !{!302, !303, !304, !306}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !300, file: !1, line: 98, baseType: !13, size: 32, align: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !300, file: !1, line: 98, baseType: !13, size: 32, align: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !300, file: !1, line: 98, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !300, file: !1, line: 98, baseType: !305, size: 64, align: 64, offset: 128)
!307 = !DILocation(line: 98, column: 13, scope: !283)
!308 = !DILocalVariable(name: "extra_len", scope: !283, file: !17, line: 99, type: !12)
!309 = !DILocation(line: 99, column: 9, scope: !283)
!310 = !DILocation(line: 101, column: 5, scope: !283)
!311 = !DILocation(line: 102, column: 18, scope: !312)
!312 = distinct !DILexicalBlock(scope: !283, file: !17, line: 101, column: 15)
!313 = !DILocation(line: 102, column: 24, scope: !312)
!314 = !DILocation(line: 102, column: 34, scope: !312)
!315 = !DILocation(line: 102, column: 40, scope: !312)
!316 = !DILocation(line: 102, column: 49, scope: !312)
!317 = !DILocation(line: 102, column: 55, scope: !312)
!318 = !DILocation(line: 102, column: 45, scope: !312)
!319 = !DILocation(line: 102, column: 32, scope: !312)
!320 = !DILocation(line: 102, column: 65, scope: !321)
!321 = !DILexicalBlockFile(scope: !312, file: !17, discriminator: 1)
!322 = !DILocation(line: 102, column: 71, scope: !321)
!323 = !DILocation(line: 102, column: 32, scope: !321)
!324 = !DILocation(line: 102, column: 81, scope: !325)
!325 = !DILexicalBlockFile(scope: !312, file: !17, discriminator: 2)
!326 = !DILocation(line: 102, column: 87, scope: !325)
!327 = !DILocation(line: 102, column: 32, scope: !325)
!328 = !DILocation(line: 102, column: 32, scope: !329)
!329 = !DILexicalBlockFile(scope: !312, file: !17, discriminator: 3)
!330 = !DILocation(line: 102, column: 29, scope: !329)
!331 = !DILocation(line: 102, column: 14, scope: !329)
!332 = !DILocation(line: 103, column: 15, scope: !312)
!333 = !DILocation(line: 103, column: 22, scope: !321)
!334 = !DILocation(line: 103, column: 27, scope: !321)
!335 = !DILocation(line: 103, column: 33, scope: !321)
!336 = !DILocation(line: 103, column: 38, scope: !321)
!337 = !DILocation(line: 103, column: 31, scope: !321)
!338 = !DILocation(line: 103, column: 15, scope: !321)
!339 = !DILocation(line: 103, column: 15, scope: !325)
!340 = !DILocation(line: 103, column: 15, scope: !329)
!341 = !DILocation(line: 103, column: 13, scope: !329)
!342 = !DILocation(line: 104, column: 8, scope: !312)
!343 = !DILocation(line: 105, column: 31, scope: !312)
!344 = !DILocation(line: 105, column: 36, scope: !312)
!345 = !DILocation(line: 105, column: 42, scope: !312)
!346 = !DILocation(line: 105, column: 47, scope: !312)
!347 = !DILocation(line: 105, column: 21, scope: !312)
!348 = !DILocation(line: 105, column: 19, scope: !312)
!349 = !DILocation(line: 106, column: 8, scope: !312)
!350 = !DILocation(line: 107, column: 13, scope: !351)
!351 = distinct !DILexicalBlock(scope: !312, file: !17, line: 107, column: 13)
!352 = !DILocation(line: 107, column: 23, scope: !351)
!353 = !DILocation(line: 107, column: 13, scope: !312)
!354 = !DILocation(line: 108, column: 13, scope: !351)
!355 = !DILocation(line: 109, column: 13, scope: !356)
!356 = distinct !DILexicalBlock(scope: !312, file: !17, line: 109, column: 13)
!357 = !DILocation(line: 109, column: 25, scope: !356)
!358 = !DILocation(line: 109, column: 23, scope: !356)
!359 = !DILocation(line: 109, column: 13, scope: !312)
!360 = !DILocation(line: 110, column: 13, scope: !356)
!361 = !DILocation(line: 111, column: 29, scope: !362)
!362 = distinct !DILexicalBlock(scope: !312, file: !17, line: 111, column: 13)
!363 = !DILocation(line: 111, column: 34, scope: !362)
!364 = !DILocation(line: 111, column: 13, scope: !362)
!365 = !DILocation(line: 111, column: 13, scope: !312)
!366 = !DILocation(line: 112, column: 13, scope: !362)
!367 = !DILocation(line: 101, column: 5, scope: !368)
!368 = !DILexicalBlockFile(scope: !283, file: !17, discriminator: 1)
!369 = distinct !{!369, !310}
!370 = !DILocation(line: 114, column: 20, scope: !283)
!371 = !DILocation(line: 114, column: 25, scope: !283)
!372 = !DILocation(line: 114, column: 5, scope: !283)
!373 = !DILocation(line: 115, column: 1, scope: !283)
