; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]apps--openssl/[inter]apps--openssl-bin-pkcs7.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]apps--openssl/[inter]apps--openssl-bin-pkcs7.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.options_st = type { i8*, i32, i32, i8* }
%struct.bio_st = type opaque
%struct.engine_st = type opaque
%struct.pkcs7_st = type { i8*, i64, i32, i32, %struct.asn1_object_st*, %union.anon }
%struct.asn1_object_st = type opaque
%union.anon = type { i8* }
%struct.stack_st_X509 = type opaque
%struct.stack_st_X509_CRL = type opaque
%struct.x509_st = type opaque
%struct.X509_crl_st = type opaque
%struct.asn1_pctx_st = type opaque
%struct.pkcs7_signed_st = type { %struct.asn1_string_st*, %struct.stack_st_X509_ALGOR*, %struct.stack_st_X509*, %struct.stack_st_X509_CRL*, %struct.stack_st_PKCS7_SIGNER_INFO*, %struct.pkcs7_st* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.stack_st_X509_ALGOR = type opaque
%struct.stack_st_PKCS7_SIGNER_INFO = type opaque
%struct.pkcs7_signedandenveloped_st = type { %struct.asn1_string_st*, %struct.stack_st_X509_ALGOR*, %struct.stack_st_X509*, %struct.stack_st_X509_CRL*, %struct.stack_st_PKCS7_SIGNER_INFO*, %struct.pkcs7_enc_content_st*, %struct.stack_st_PKCS7_RECIP_INFO* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !18, globals: !32)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]apps--openssl/[inter]apps--openssl-bin-pkcs7.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]apps--openssl")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OPTION_choice", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "apps/pkcs7.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]apps--openssl")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "OPT_ERR", value: -1)
!7 = !DIEnumerator(name: "OPT_EOF", value: 0)
!8 = !DIEnumerator(name: "OPT_HELP", value: 1)
!9 = !DIEnumerator(name: "OPT_INFORM", value: 2)
!10 = !DIEnumerator(name: "OPT_OUTFORM", value: 3)
!11 = !DIEnumerator(name: "OPT_IN", value: 4)
!12 = !DIEnumerator(name: "OPT_OUT", value: 5)
!13 = !DIEnumerator(name: "OPT_NOOUT", value: 6)
!14 = !DIEnumerator(name: "OPT_TEXT", value: 7)
!15 = !DIEnumerator(name: "OPT_PRINT", value: 8)
!16 = !DIEnumerator(name: "OPT_PRINT_CERTS", value: 9)
!17 = !DIEnumerator(name: "OPT_ENGINE", value: 10)
!18 = !{!19, !20, !25, !29}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !23, line: 17, baseType: !24)
!23 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]apps--openssl")
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !23, line: 17, flags: DIFlagFwdDecl)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !27, line: 124, baseType: !28)
!27 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]apps--openssl")
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !27, line: 124, flags: DIFlagFwdDecl)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !27, line: 126, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !27, line: 126, flags: DIFlagFwdDecl)
!32 = !{!33}
!33 = distinct !DIGlobalVariable(name: "pkcs7_options", scope: !0, file: !4, line: 29, type: !34, isLocal: false, isDefinition: true, variable: [11 x %struct.options_st]* @pkcs7_options)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2112, align: 64, elements: !48)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPTIONS", file: !37, line: 280, baseType: !38)
!37 = !DIFile(filename: "apps/include/opt.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]apps--openssl")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "options_st", file: !37, line: 269, size: 192, align: 64, elements: !39)
!39 = !{!40, !44, !46, !47}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !38, file: !37, line: 270, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !38, file: !37, line: 271, baseType: !45, size: 32, align: 32, offset: 64)
!45 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "valtype", scope: !38, file: !37, line: 278, baseType: !45, size: 32, align: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "helpstr", scope: !38, file: !37, line: 279, baseType: !41, size: 64, align: 64, offset: 128)
!48 = !{!49}
!49 = !DISubrange(count: 11)
!50 = !{i32 2, !"Dwarf Version", i32 4}
!51 = !{i32 2, !"Debug Info Version", i32 3}
!52 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!53 = distinct !DISubprogram(name: "pkcs7_main", scope: !4, file: !4, line: 46, type: !54, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !58)
!54 = !DISubroutineType(types: !55)
!55 = !{!45, !45, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!58 = !{}
!59 = !DILocalVariable(name: "argc", arg: 1, scope: !53, file: !4, line: 46, type: !45)
!60 = !DIExpression()
!61 = !DILocation(line: 46, column: 20, scope: !53)
!62 = !DILocalVariable(name: "argv", arg: 2, scope: !53, file: !4, line: 46, type: !56)
!63 = !DILocation(line: 46, column: 33, scope: !53)
!64 = !DILocalVariable(name: "e", scope: !53, file: !4, line: 48, type: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENGINE", file: !27, line: 150, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "engine_st", file: !27, line: 150, flags: DIFlagFwdDecl)
!68 = !DILocation(line: 48, column: 13, scope: !53)
!69 = !DILocalVariable(name: "p7", scope: !53, file: !4, line: 49, type: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7", file: !72, line: 144, baseType: !73)
!72 = !DIFile(filename: "include/openssl/pkcs7.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]apps--openssl")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_st", file: !72, line: 109, size: 320, align: 64, elements: !74)
!74 = !{!75, !78, !80, !81, !82, !86}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "asn1", scope: !73, file: !72, line: 114, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !73, file: !72, line: 115, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !73, file: !72, line: 119, baseType: !45, size: 32, align: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !73, file: !72, line: 120, baseType: !45, size: 32, align: 32, offset: 160)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !73, file: !72, line: 121, baseType: !83, size: 64, align: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !27, line: 60, baseType: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !27, line: 60, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !73, file: !72, line: 143, baseType: !87, size: 64, align: 64, offset: 256)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !73, file: !72, line: 127, size: 64, align: 64, elements: !88)
!88 = !{!89, !90, !100, !123, !210, !222, !231, !238}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !87, file: !72, line: 128, baseType: !57, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !87, file: !72, line: 130, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !27, line: 43, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !94, line: 146, size: 192, align: 64, elements: !95)
!94 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]apps--openssl")
!95 = !{!96, !97, !98, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !93, file: !94, line: 147, baseType: !45, size: 32, align: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !93, file: !94, line: 148, baseType: !45, size: 32, align: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !93, file: !94, line: 149, baseType: !76, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !93, file: !94, line: 155, baseType: !79, size: 64, align: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !87, file: !72, line: 132, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGNED", file: !72, line: 68, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signed_st", file: !72, line: 61, size: 384, align: 64, elements: !104)
!104 = !{!105, !108, !111, !115, !118, !121}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !103, file: !72, line: 62, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !27, line: 40, baseType: !93)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !103, file: !72, line: 63, baseType: !109, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ALGOR", file: !94, line: 119, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !103, file: !72, line: 64, baseType: !112, size: 64, align: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !114, line: 99, flags: DIFlagFwdDecl)
!114 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]apps--openssl")
!115 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !103, file: !72, line: 65, baseType: !116, size: 64, align: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_CRL", file: !114, line: 228, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !103, file: !72, line: 66, baseType: !119, size: 64, align: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_SIGNER_INFO", file: !72, line: 49, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !103, file: !72, line: 67, baseType: !122, size: 64, align: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "enveloped", scope: !87, file: !72, line: 134, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENVELOPE", file: !72, line: 85, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enveloped_st", file: !72, line: 81, size: 192, align: 64, elements: !127)
!127 = !{!128, !129, !132}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !126, file: !72, line: 82, baseType: !106, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !126, file: !72, line: 83, baseType: !130, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_RECIP_INFO", file: !72, line: 59, flags: DIFlagFwdDecl)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !126, file: !72, line: 84, baseType: !133, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENC_CONTENT", file: !72, line: 79, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enc_content_st", file: !72, line: 74, size: 256, align: 64, elements: !136)
!136 = !{!137, !138, !204, !205}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !135, file: !72, line: 75, baseType: !83, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !135, file: !72, line: 76, baseType: !139, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !27, line: 125, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !114, line: 59, size: 128, align: 64, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !141, file: !114, line: 60, baseType: !83, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !141, file: !114, line: 61, baseType: !145, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !94, line: 473, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !94, line: 444, size: 128, align: 64, elements: !148)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !94, line: 445, baseType: !45, size: 32, align: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !147, file: !94, line: 472, baseType: !151, size: 64, align: 64, offset: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !94, line: 446, size: 64, align: 64, elements: !152)
!152 = !{!153, !154, !156, !159, !160, !161, !164, !167, !168, !171, !174, !177, !180, !183, !186, !189, !192, !195, !198, !199, !200}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !151, file: !94, line: 447, baseType: !57, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !151, file: !94, line: 448, baseType: !155, size: 32, align: 32)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !27, line: 56, baseType: !45)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !151, file: !94, line: 449, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !27, line: 55, baseType: !93)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !151, file: !94, line: 450, baseType: !83, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !151, file: !94, line: 451, baseType: !106, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !151, file: !94, line: 452, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !27, line: 41, baseType: !93)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !151, file: !94, line: 453, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !27, line: 42, baseType: !93)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !151, file: !94, line: 454, baseType: !91, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !151, file: !94, line: 455, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !27, line: 44, baseType: !93)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !151, file: !94, line: 456, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !27, line: 45, baseType: !93)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !151, file: !94, line: 457, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !27, line: 46, baseType: !93)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !151, file: !94, line: 458, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !27, line: 47, baseType: !93)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !151, file: !94, line: 459, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !27, line: 49, baseType: !93)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !151, file: !94, line: 460, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !27, line: 48, baseType: !93)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !151, file: !94, line: 461, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !27, line: 50, baseType: !93)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !151, file: !94, line: 462, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !27, line: 52, baseType: !93)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !151, file: !94, line: 463, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !27, line: 53, baseType: !93)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !151, file: !94, line: 464, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !27, line: 54, baseType: !93)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !151, file: !94, line: 469, baseType: !157, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !151, file: !94, line: 470, baseType: !157, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !151, file: !94, line: 471, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !94, line: 213, baseType: !203)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !94, line: 213, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !135, file: !72, line: 77, baseType: !91, size: 64, align: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !135, file: !72, line: 78, baseType: !206, size: 64, align: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !27, line: 89, baseType: !209)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !27, line: 89, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "signed_and_enveloped", scope: !87, file: !72, line: 136, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGN_ENVELOPE", file: !72, line: 95, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signedandenveloped_st", file: !72, line: 87, size: 448, align: 64, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !213, file: !72, line: 88, baseType: !106, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !213, file: !72, line: 89, baseType: !109, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !213, file: !72, line: 90, baseType: !112, size: 64, align: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !213, file: !72, line: 91, baseType: !116, size: 64, align: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !213, file: !72, line: 92, baseType: !119, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !213, file: !72, line: 93, baseType: !133, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !213, file: !72, line: 94, baseType: !130, size: 64, align: 64, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !87, file: !72, line: 138, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_DIGEST", file: !72, line: 102, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_digest_st", file: !72, line: 97, size: 256, align: 64, elements: !226)
!226 = !{!227, !228, !229, !230}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !225, file: !72, line: 98, baseType: !106, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !225, file: !72, line: 99, baseType: !139, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !225, file: !72, line: 100, baseType: !122, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !225, file: !72, line: 101, baseType: !91, size: 64, align: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "encrypted", scope: !87, file: !72, line: 140, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENCRYPT", file: !72, line: 107, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_encrypted_st", file: !72, line: 104, size: 128, align: 64, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !234, file: !72, line: 105, baseType: !106, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !234, file: !72, line: 106, baseType: !133, size: 64, align: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !87, file: !72, line: 142, baseType: !145, size: 64, align: 64)
!239 = !DILocation(line: 49, column: 12, scope: !53)
!240 = !DILocalVariable(name: "in", scope: !53, file: !4, line: 50, type: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !27, line: 79, baseType: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !27, line: 79, flags: DIFlagFwdDecl)
!244 = !DILocation(line: 50, column: 10, scope: !53)
!245 = !DILocalVariable(name: "out", scope: !53, file: !4, line: 50, type: !241)
!246 = !DILocation(line: 50, column: 21, scope: !53)
!247 = !DILocalVariable(name: "informat", scope: !53, file: !4, line: 51, type: !45)
!248 = !DILocation(line: 51, column: 9, scope: !53)
!249 = !DILocalVariable(name: "outformat", scope: !53, file: !4, line: 51, type: !45)
!250 = !DILocation(line: 51, column: 34, scope: !53)
!251 = !DILocalVariable(name: "infile", scope: !53, file: !4, line: 52, type: !57)
!252 = !DILocation(line: 52, column: 11, scope: !53)
!253 = !DILocalVariable(name: "outfile", scope: !53, file: !4, line: 52, type: !57)
!254 = !DILocation(line: 52, column: 26, scope: !53)
!255 = !DILocalVariable(name: "prog", scope: !53, file: !4, line: 52, type: !57)
!256 = !DILocation(line: 52, column: 43, scope: !53)
!257 = !DILocalVariable(name: "i", scope: !53, file: !4, line: 53, type: !45)
!258 = !DILocation(line: 53, column: 9, scope: !53)
!259 = !DILocalVariable(name: "print_certs", scope: !53, file: !4, line: 53, type: !45)
!260 = !DILocation(line: 53, column: 12, scope: !53)
!261 = !DILocalVariable(name: "text", scope: !53, file: !4, line: 53, type: !45)
!262 = !DILocation(line: 53, column: 29, scope: !53)
!263 = !DILocalVariable(name: "noout", scope: !53, file: !4, line: 53, type: !45)
!264 = !DILocation(line: 53, column: 39, scope: !53)
!265 = !DILocalVariable(name: "p7_print", scope: !53, file: !4, line: 53, type: !45)
!266 = !DILocation(line: 53, column: 50, scope: !53)
!267 = !DILocalVariable(name: "ret", scope: !53, file: !4, line: 53, type: !45)
!268 = !DILocation(line: 53, column: 64, scope: !53)
!269 = !DILocalVariable(name: "o", scope: !53, file: !4, line: 54, type: !270)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPTION_CHOICE", file: !4, line: 27, baseType: !3)
!271 = !DILocation(line: 54, column: 19, scope: !53)
!272 = !DILocation(line: 56, column: 21, scope: !53)
!273 = !DILocation(line: 56, column: 27, scope: !53)
!274 = !DILocation(line: 56, column: 12, scope: !53)
!275 = !DILocation(line: 56, column: 10, scope: !53)
!276 = !DILocation(line: 57, column: 5, scope: !53)
!277 = !DILocation(line: 57, column: 17, scope: !278)
!278 = !DILexicalBlockFile(scope: !53, file: !4, discriminator: 1)
!279 = !DILocation(line: 57, column: 15, scope: !278)
!280 = !DILocation(line: 57, column: 29, scope: !278)
!281 = !DILocation(line: 57, column: 5, scope: !278)
!282 = !DILocation(line: 58, column: 17, scope: !283)
!283 = distinct !DILexicalBlock(scope: !53, file: !4, line: 57, column: 41)
!284 = !DILocation(line: 58, column: 9, scope: !283)
!285 = !DILocation(line: 58, column: 20, scope: !286)
!286 = !DILexicalBlockFile(scope: !283, file: !4, discriminator: 1)
!287 = !DILocation(line: 62, column: 24, scope: !288)
!288 = distinct !DILexicalBlock(scope: !283, file: !4, line: 58, column: 20)
!289 = !DILocation(line: 62, column: 65, scope: !288)
!290 = !DILocation(line: 62, column: 13, scope: !288)
!291 = !DILocation(line: 63, column: 13, scope: !288)
!292 = !DILocation(line: 65, column: 13, scope: !288)
!293 = !DILocation(line: 66, column: 17, scope: !288)
!294 = !DILocation(line: 67, column: 13, scope: !288)
!295 = !DILocation(line: 69, column: 29, scope: !296)
