; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a/[inter]libswresample--x86--rematrix_init.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a/[inter]libswresample--x86--rematrix_init.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SwrContext = type { %struct.AVClass*, i32, i8*, i32, i32, i32, i64, i64, i32, i32, i32, float, float, float, float, float, i32, i32*, i32, i32, i32, i32, i32, i64, i64, i32, i32, %struct.DitherContext, i32, i32, i32, i32, double, i32, double, double, i32, float, float, float, float, float, i64, i32, i32, i32, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, i32, i32, i32, i32, i64, i64, i32, double, %struct.AudioConvert*, %struct.AudioConvert*, %struct.AudioConvert*, %struct.ResampleContext*, %struct.Resampler*, [64 x [64 x double]], [64 x [64 x float]], i8*, i8*, i8*, i8*, [64 x [64 x i32]], [64 x [65 x i8]], void (i8*, i8*, i8*, i64, i64)*, void (i8*, i8*, i8*, i64, i64)*, void (i8*, i8*, i8*, i8*, i64, i64, i64)*, void (i8*, i8*, i8*, i8*, i64, i64, i64)*, void (i8**, i8**, i8*, i64)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a/[inter]libswresample--x86--rematrix_init.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!2 = !{!3, !24, !41}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 29, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!6 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!7 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!8 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!9 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!10 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!11 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!12 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!13 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!14 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!15 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!16 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!17 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!18 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!19 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!20 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!21 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!22 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!23 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSampleFormat", file: !25, line: 58, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "./libavutil/samplefmt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40}
!27 = !DIEnumerator(name: "AV_SAMPLE_FMT_NONE", value: -1)
!28 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8", value: 0)
!29 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16", value: 1)
!30 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32", value: 2)
!31 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLT", value: 3)
!32 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBL", value: 4)
!33 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8P", value: 5)
!34 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16P", value: 6)
!35 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32P", value: 7)
!36 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLTP", value: 8)
!37 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBLP", value: 9)
!38 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64", value: 10)
!39 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!40 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwrFilterType", file: !42, line: 166, size: 32, align: 32, elements: !43)
!42 = !DIFile(filename: "./libswresample/swresample.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!43 = !{!44, !45, !46}
!44 = !DIEnumerator(name: "SWR_FILTER_TYPE_CUBIC", value: 0)
!45 = !DIEnumerator(name: "SWR_FILTER_TYPE_BLACKMAN_NUTTALL", value: 1)
!46 = !DIEnumerator(name: "SWR_FILTER_TYPE_KAISER", value: 2)
!47 = !{i32 2, !"Dwarf Version", i32 4}
!48 = !{i32 2, !"Debug Info Version", i32 3}
!49 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!50 = distinct !DISubprogram(name: "swri_rematrix_init_x86", scope: !51, file: !51, line: 33, type: !52, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !305)
!51 = !DIFile(filename: "libswresample/x86/rematrix_init.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !55}
!54 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwrContext", file: !57, line: 95, size: 687232, align: 64, elements: !58)
!57 = !DIFile(filename: "./libswresample/swresample_internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!58 = !{!59, !104, !105, !106, !107, !108, !109, !113, !114, !115, !116, !117, !119, !120, !121, !122, !123, !124, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !174, !175, !176, !177, !178, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !212, !213, !214, !217, !265, !268, !270, !271, !272, !273, !274, !277, !281, !289, !290, !295, !296}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !56, file: !57, line: 96, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !64)
!64 = !{!65, !69, !74, !78, !79, !80, !81, !85, !91, !93, !97}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !63, file: !4, line: 72, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !63, file: !4, line: 78, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!66, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !63, file: !4, line: 85, baseType: !75, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !63, file: !4, line: 93, baseType: !54, size: 32, align: 32, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !63, file: !4, line: 99, baseType: !54, size: 32, align: 32, offset: 224)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !63, file: !4, line: 108, baseType: !54, size: 32, align: 32, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !63, file: !4, line: 113, baseType: !82, size: 64, align: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!73, !73, !73}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !63, file: !4, line: 123, baseType: !86, size: 64, align: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!89, !89}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !63, file: !4, line: 130, baseType: !92, size: 32, align: 32, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !63, file: !4, line: 136, baseType: !94, size: 64, align: 64, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!92, !73}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !63, file: !4, line: 142, baseType: !98, size: 64, align: 64, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!54, !101, !73, !66, !54}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !56, file: !57, line: 97, baseType: !54, size: 32, align: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !56, file: !57, line: 98, baseType: !73, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "in_sample_fmt", scope: !56, file: !57, line: 99, baseType: !24, size: 32, align: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "int_sample_fmt", scope: !56, file: !57, line: 100, baseType: !24, size: 32, align: 32, offset: 224)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "out_sample_fmt", scope: !56, file: !57, line: 101, baseType: !24, size: 32, align: 32, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "in_ch_layout", scope: !56, file: !57, line: 102, baseType: !110, size: 64, align: 64, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !111, line: 40, baseType: !112)
!111 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!112 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "out_ch_layout", scope: !56, file: !57, line: 103, baseType: !110, size: 64, align: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "in_sample_rate", scope: !56, file: !57, line: 104, baseType: !54, size: 32, align: 32, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "out_sample_rate", scope: !56, file: !57, line: 105, baseType: !54, size: 32, align: 32, offset: 480)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !56, file: !57, line: 106, baseType: !54, size: 32, align: 32, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "slev", scope: !56, file: !57, line: 107, baseType: !118, size: 32, align: 32, offset: 544)
!118 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "clev", scope: !56, file: !57, line: 108, baseType: !118, size: 32, align: 32, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "lfe_mix_level", scope: !56, file: !57, line: 109, baseType: !118, size: 32, align: 32, offset: 608)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_volume", scope: !56, file: !57, line: 110, baseType: !118, size: 32, align: 32, offset: 640)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_maxval", scope: !56, file: !57, line: 111, baseType: !118, size: 32, align: 32, offset: 672)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_encoding", scope: !56, file: !57, line: 112, baseType: !54, size: 32, align: 32, offset: 704)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "channel_map", scope: !56, file: !57, line: 113, baseType: !125, size: 64, align: 64, offset: 768)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "used_ch_count", scope: !56, file: !57, line: 114, baseType: !54, size: 32, align: 32, offset: 832)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !56, file: !57, line: 115, baseType: !54, size: 32, align: 32, offset: 864)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "user_in_ch_count", scope: !56, file: !57, line: 117, baseType: !54, size: 32, align: 32, offset: 896)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "user_out_ch_count", scope: !56, file: !57, line: 118, baseType: !54, size: 32, align: 32, offset: 928)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "user_used_ch_count", scope: !56, file: !57, line: 119, baseType: !54, size: 32, align: 32, offset: 960)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "user_in_ch_layout", scope: !56, file: !57, line: 120, baseType: !110, size: 64, align: 64, offset: 1024)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "user_out_ch_layout", scope: !56, file: !57, line: 121, baseType: !110, size: 64, align: 64, offset: 1088)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "user_int_sample_fmt", scope: !56, file: !57, line: 122, baseType: !24, size: 32, align: 32, offset: 1152)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "user_dither_method", scope: !56, file: !57, line: 123, baseType: !54, size: 32, align: 32, offset: 1184)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !56, file: !57, line: 125, baseType: !137, size: 91584, align: 64, offset: 1216)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DitherContext", file: !57, line: 55, size: 91584, align: 64, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !147, !151, !156, !172, !173}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !137, file: !57, line: 56, baseType: !54, size: 32, align: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "noise_pos", scope: !137, file: !57, line: 57, baseType: !54, size: 32, align: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !137, file: !57, line: 58, baseType: !118, size: 32, align: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "noise_scale", scope: !137, file: !57, line: 59, baseType: !118, size: 32, align: 32, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ns_taps", scope: !137, file: !57, line: 60, baseType: !54, size: 32, align: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ns_scale", scope: !137, file: !57, line: 61, baseType: !118, size: 32, align: 32, offset: 160)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ns_scale_1", scope: !137, file: !57, line: 62, baseType: !118, size: 32, align: 32, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ns_pos", scope: !137, file: !57, line: 63, baseType: !54, size: 32, align: 32, offset: 224)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ns_coeffs", scope: !137, file: !57, line: 64, baseType: !148, size: 640, align: 32, offset: 256)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 640, align: 32, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 20)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ns_errors", scope: !137, file: !57, line: 65, baseType: !152, size: 81920, align: 32, offset: 896)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 81920, align: 32, elements: !153)
!153 = !{!154, !155}
!154 = !DISubrange(count: 64)
!155 = !DISubrange(count: 40)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "noise", scope: !137, file: !57, line: 66, baseType: !157, size: 4352, align: 64, offset: 82816)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "AudioData", file: !57, line: 53, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AudioData", file: !57, line: 45, size: 4352, align: 64, elements: !159)
!159 = !{!160, !166, !167, !168, !169, !170, !171}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !158, file: !57, line: 46, baseType: !161, size: 4096, align: 64)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 4096, align: 64, elements: !165)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !111, line: 48, baseType: !164)
!164 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!165 = !{!154}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !158, file: !57, line: 47, baseType: !162, size: 64, align: 64, offset: 4096)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ch_count", scope: !158, file: !57, line: 48, baseType: !54, size: 32, align: 32, offset: 4160)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !158, file: !57, line: 49, baseType: !54, size: 32, align: 32, offset: 4192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !158, file: !57, line: 50, baseType: !54, size: 32, align: 32, offset: 4224)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "planar", scope: !158, file: !57, line: 51, baseType: !54, size: 32, align: 32, offset: 4256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !158, file: !57, line: 52, baseType: !24, size: 32, align: 32, offset: 4288)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !137, file: !57, line: 67, baseType: !157, size: 4352, align: 64, offset: 87168)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "output_sample_bits", scope: !137, file: !57, line: 68, baseType: !54, size: 32, align: 32, offset: 91520)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "filter_size", scope: !56, file: !57, line: 127, baseType: !54, size: 32, align: 32, offset: 92800)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "phase_shift", scope: !56, file: !57, line: 128, baseType: !54, size: 32, align: 32, offset: 92832)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "linear_interp", scope: !56, file: !57, line: 129, baseType: !54, size: 32, align: 32, offset: 92864)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "exact_rational", scope: !56, file: !57, line: 130, baseType: !54, size: 32, align: 32, offset: 92896)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !56, file: !57, line: 131, baseType: !179, size: 64, align: 64, offset: 92928)
!179 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !56, file: !57, line: 132, baseType: !54, size: 32, align: 32, offset: 92992)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "kaiser_beta", scope: !56, file: !57, line: 133, baseType: !179, size: 64, align: 64, offset: 93056)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !56, file: !57, line: 134, baseType: !179, size: 64, align: 64, offset: 93120)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "cheby", scope: !56, file: !57, line: 135, baseType: !54, size: 32, align: 32, offset: 93184)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "min_compensation", scope: !56, file: !57, line: 137, baseType: !118, size: 32, align: 32, offset: 93216)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "min_hard_compensation", scope: !56, file: !57, line: 138, baseType: !118, size: 32, align: 32, offset: 93248)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "soft_compensation_duration", scope: !56, file: !57, line: 139, baseType: !118, size: 32, align: 32, offset: 93280)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "max_soft_compensation", scope: !56, file: !57, line: 140, baseType: !118, size: 32, align: 32, offset: 93312)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "async", scope: !56, file: !57, line: 141, baseType: !118, size: 32, align: 32, offset: 93344)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "firstpts_in_samples", scope: !56, file: !57, line: 142, baseType: !110, size: 64, align: 64, offset: 93376)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "resample_first", scope: !56, file: !57, line: 144, baseType: !54, size: 32, align: 32, offset: 93440)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix", scope: !56, file: !57, line: 145, baseType: !54, size: 32, align: 32, offset: 93472)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_custom", scope: !56, file: !57, line: 146, baseType: !54, size: 32, align: 32, offset: 93504)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !56, file: !57, line: 148, baseType: !157, size: 4352, align: 64, offset: 93568)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "postin", scope: !56, file: !57, line: 149, baseType: !157, size: 4352, align: 64, offset: 97920)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "midbuf", scope: !56, file: !57, line: 150, baseType: !157, size: 4352, align: 64, offset: 102272)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "preout", scope: !56, file: !57, line: 151, baseType: !157, size: 4352, align: 64, offset: 106624)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !56, file: !57, line: 152, baseType: !157, size: 4352, align: 64, offset: 110976)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer", scope: !56, file: !57, line: 153, baseType: !157, size: 4352, align: 64, offset: 115328)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "silence", scope: !56, file: !57, line: 154, baseType: !157, size: 4352, align: 64, offset: 119680)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "drop_temp", scope: !56, file: !57, line: 155, baseType: !157, size: 4352, align: 64, offset: 124032)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer_index", scope: !56, file: !57, line: 156, baseType: !54, size: 32, align: 32, offset: 128384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer_count", scope: !56, file: !57, line: 157, baseType: !54, size: 32, align: 32, offset: 128416)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "resample_in_constraint", scope: !56, file: !57, line: 158, baseType: !54, size: 32, align: 32, offset: 128448)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "flushed", scope: !56, file: !57, line: 159, baseType: !54, size: 32, align: 32, offset: 128480)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "outpts", scope: !56, file: !57, line: 160, baseType: !110, size: 64, align: 64, offset: 128512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "firstpts", scope: !56, file: !57, line: 161, baseType: !110, size: 64, align: 64, offset: 128576)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "drop_output", scope: !56, file: !57, line: 162, baseType: !54, size: 32, align: 32, offset: 128640)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_samples_fixup", scope: !56, file: !57, line: 163, baseType: !179, size: 64, align: 64, offset: 128704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "in_convert", scope: !56, file: !57, line: 165, baseType: !210, size: 64, align: 64, offset: 128768)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "AudioConvert", file: !57, line: 165, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "out_convert", scope: !56, file: !57, line: 166, baseType: !210, size: 64, align: 64, offset: 128832)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "full_convert", scope: !56, file: !57, line: 167, baseType: !210, size: 64, align: 64, offset: 128896)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "resample", scope: !56, file: !57, line: 168, baseType: !215, size: 64, align: 64, offset: 128960)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "ResampleContext", file: !57, line: 71, flags: DIFlagFwdDecl)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "resampler", scope: !56, file: !57, line: 169, baseType: !218, size: 64, align: 64, offset: 129024)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Resampler", file: !57, line: 81, size: 512, align: 64, elements: !221)
!221 = !{!222, !227, !233, !240, !243, !248, !253, !260}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !220, file: !57, line: 82, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_init_func", file: !57, line: 71, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!215, !215, !54, !54, !54, !54, !54, !179, !24, !41, !179, !179, !54, !54}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !220, file: !57, line: 83, baseType: !228, size: 64, align: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_free_func", file: !57, line: 73, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !232}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "multiple_resample", scope: !220, file: !57, line: 84, baseType: !234, size: 64, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiple_resample_func", file: !57, line: 74, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!54, !215, !238, !54, !238, !54, !239}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !220, file: !57, line: 85, baseType: !241, size: 64, align: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_flush_func", file: !57, line: 75, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "set_compensation", scope: !220, file: !57, line: 86, baseType: !244, size: 64, align: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "set_compensation_func", file: !57, line: 76, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!54, !215, !54, !54}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "get_delay", scope: !220, file: !57, line: 87, baseType: !249, size: 64, align: 64, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_delay_func", file: !57, line: 77, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!110, !55, !110}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "invert_initial_buffer", scope: !220, file: !57, line: 88, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "invert_initial_buffer_func", file: !57, line: 78, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!54, !215, !238, !258, !54, !239, !239}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "get_out_samples", scope: !220, file: !57, line: 89, baseType: !261, size: 64, align: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_out_samples_func", file: !57, line: 79, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!110, !55, !54}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !56, file: !57, line: 171, baseType: !266, size: 262144, align: 64, offset: 129088)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 262144, align: 64, elements: !267)
!267 = !{!154, !154}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_flt", scope: !56, file: !57, line: 172, baseType: !269, size: 131072, align: 32, offset: 391232)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 131072, align: 32, elements: !267)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "native_matrix", scope: !56, file: !57, line: 173, baseType: !162, size: 64, align: 64, offset: 522304)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "native_one", scope: !56, file: !57, line: 174, baseType: !162, size: 64, align: 64, offset: 522368)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "native_simd_one", scope: !56, file: !57, line: 175, baseType: !162, size: 64, align: 64, offset: 522432)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "native_simd_matrix", scope: !56, file: !57, line: 176, baseType: !162, size: 64, align: 64, offset: 522496)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "matrix32", scope: !56, file: !57, line: 177, baseType: !275, size: 131072, align: 32, offset: 522560)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 131072, align: 32, elements: !267)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !111, line: 38, baseType: !54)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_ch", scope: !56, file: !57, line: 178, baseType: !278, size: 33280, align: 8, offset: 653632)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 33280, align: 8, elements: !279)
!279 = !{!154, !280}
!280 = !DISubrange(count: 65)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "mix_1_1_f", scope: !56, file: !57, line: 179, baseType: !282, size: 64, align: 64, offset: 686912)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_1_1_func_type", file: !57, line: 40, baseType: !284)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !73, !286, !73, !288, !288}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "integer", file: !57, line: 35, baseType: !110)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "mix_1_1_simd", scope: !56, file: !57, line: 180, baseType: !282, size: 64, align: 64, offset: 686976)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "mix_2_1_f", scope: !56, file: !57, line: 182, baseType: !291, size: 64, align: 64, offset: 687040)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_2_1_func_type", file: !57, line: 41, baseType: !293)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !73, !286, !286, !73, !288, !288, !288}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mix_2_1_simd", scope: !56, file: !57, line: 183, baseType: !291, size: 64, align: 64, offset: 687104)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "mix_any_f", scope: !56, file: !57, line: 185, baseType: !297, size: 64, align: 64, offset: 687168)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_any_func_type", file: !57, line: 43, baseType: !299)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !301, !302, !73, !288}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!305 = !{}
!306 = !DILocalVariable(name: "s", arg: 1, scope: !50, file: !51, line: 33, type: !55)
!307 = !DIExpression()
!308 = !DILocation(line: 33, column: 69, scope: !50)
!309 = !DILocation(line: 89, column: 5, scope: !50)
