; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a/[inter]libswresample--options.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a/[inter]libswresample--options.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a/[inter]libswresample--options.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!2 = !{!3, !25, !46, !63}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !4, line: 221, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!6 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!7 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!8 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!9 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!10 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!11 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!12 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!13 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!14 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!15 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!16 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!17 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!18 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!19 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!20 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!21 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!22 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!23 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!24 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 29, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!28 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!29 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!30 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!31 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!32 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!33 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!34 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!35 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!36 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!37 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!38 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!39 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!40 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!41 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!42 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!43 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!44 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!45 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSampleFormat", file: !47, line: 58, size: 32, align: 32, elements: !48)
!47 = !DIFile(filename: "./libavutil/samplefmt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62}
!49 = !DIEnumerator(name: "AV_SAMPLE_FMT_NONE", value: -1)
!50 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8", value: 0)
!51 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16", value: 1)
!52 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32", value: 2)
!53 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLT", value: 3)
!54 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBL", value: 4)
!55 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8P", value: 5)
!56 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16P", value: 6)
!57 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32P", value: 7)
!58 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLTP", value: 8)
!59 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBLP", value: 9)
!60 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64", value: 10)
!61 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!62 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwrFilterType", file: !64, line: 166, size: 32, align: 32, elements: !65)
!64 = !DIFile(filename: "libswresample/swresample.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!65 = !{!66, !67, !68}
!66 = !DIEnumerator(name: "SWR_FILTER_TYPE_CUBIC", value: 0)
!67 = !DIEnumerator(name: "SWR_FILTER_TYPE_BLACKMAN_NUTTALL", value: 1)
!68 = !DIEnumerator(name: "SWR_FILTER_TYPE_KAISER", value: 2)
!69 = !{!70, !157}
!70 = distinct !DIGlobalVariable(name: "av_class", scope: !0, file: !71, line: 134, type: !72, isLocal: true, isDefinition: true, variable: %struct.AVClass* @av_class)
!71 = !DIFile(filename: "libswresample/options.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !75)
!75 = !{!76, !80, !85, !116, !117, !118, !119, !123, !129, !131, !135}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !74, file: !26, line: 72, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !74, file: !26, line: 78, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!77, !84}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !74, file: !26, line: 85, baseType: !86, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !89)
!89 = !{!90, !91, !92, !94, !95, !112, !113, !114, !115}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !88, file: !4, line: 247, baseType: !77, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !88, file: !4, line: 253, baseType: !77, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !88, file: !4, line: 259, baseType: !93, size: 32, align: 32, offset: 128)
!93 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !88, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !88, file: !4, line: 271, baseType: !96, size: 64, align: 64, offset: 192)
!96 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !88, file: !4, line: 265, size: 64, align: 64, elements: !97)
!97 = !{!98, !102, !104, !105}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !96, file: !4, line: 266, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !100, line: 40, baseType: !101)
!100 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!101 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !96, file: !4, line: 267, baseType: !103, size: 64, align: 64)
!103 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !96, file: !4, line: 268, baseType: !77, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !96, file: !4, line: 270, baseType: !106, size: 64, align: 32)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !107, line: 61, baseType: !108)
!107 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !107, line: 58, size: 64, align: 32, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !108, file: !107, line: 59, baseType: !93, size: 32, align: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !108, file: !107, line: 60, baseType: !93, size: 32, align: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !88, file: !4, line: 272, baseType: !103, size: 64, align: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !88, file: !4, line: 273, baseType: !103, size: 64, align: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !88, file: !4, line: 275, baseType: !93, size: 32, align: 32, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !88, file: !4, line: 300, baseType: !77, size: 64, align: 64, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !74, file: !26, line: 93, baseType: !93, size: 32, align: 32, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !74, file: !26, line: 99, baseType: !93, size: 32, align: 32, offset: 224)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !74, file: !26, line: 108, baseType: !93, size: 32, align: 32, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !74, file: !26, line: 113, baseType: !120, size: 64, align: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!84, !84, !84}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !74, file: !26, line: 123, baseType: !124, size: 64, align: 64, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!127, !127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !74, file: !26, line: 130, baseType: !130, size: 32, align: 32, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !74, file: !26, line: 136, baseType: !132, size: 64, align: 64, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!130, !84}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !74, file: !26, line: 142, baseType: !136, size: 64, align: 64, offset: 576)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!93, !139, !84, !77, !93}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !142)
!142 = !{!143, !155, !156}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !141, file: !4, line: 360, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !148)
!148 = !{!149, !150, !151, !152, !153, !154}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !147, file: !4, line: 307, baseType: !77, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !147, file: !4, line: 313, baseType: !103, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !147, file: !4, line: 313, baseType: !103, size: 64, align: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !147, file: !4, line: 318, baseType: !103, size: 64, align: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !147, file: !4, line: 318, baseType: !103, size: 64, align: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !147, file: !4, line: 323, baseType: !93, size: 32, align: 32, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !141, file: !4, line: 364, baseType: !93, size: 32, align: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !141, file: !4, line: 368, baseType: !93, size: 32, align: 32, offset: 96)
!157 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !71, line: 37, type: !158, isLocal: true, isDefinition: true, variable: <{ %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption }>* @options)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 36352, align: 64, elements: !161)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !88)
!161 = !{!162}
!162 = !DISubrange(count: 71)
!163 = !{i32 2, !"Dwarf Version", i32 4}
!164 = !{i32 2, !"Debug Info Version", i32 3}
!165 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!166 = distinct !DISubprogram(name: "swr_get_class", scope: !71, file: !71, line: 144, type: !167, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !170)
!167 = !DISubroutineType(types: !168)
!168 = !{!169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!170 = !{}
!171 = !DILocation(line: 146, column: 5, scope: !166)
!172 = distinct !DISubprogram(name: "swr_alloc", scope: !71, file: !71, line: 149, type: !173, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !170)
!173 = !DISubroutineType(types: !174)
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwrContext", file: !177, line: 95, size: 687232, align: 64, elements: !178)
!177 = !DIFile(filename: "libswresample/swresample_internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !192, !193, !194, !195, !196, !197, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !284, !285, !286, !289, !339, !342, !344, !345, !346, !347, !348, !351, !355, !363, !364, !369, !370}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !176, file: !177, line: 96, baseType: !169, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !176, file: !177, line: 97, baseType: !93, size: 32, align: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !176, file: !177, line: 98, baseType: !84, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "in_sample_fmt", scope: !176, file: !177, line: 99, baseType: !46, size: 32, align: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "int_sample_fmt", scope: !176, file: !177, line: 100, baseType: !46, size: 32, align: 32, offset: 224)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "out_sample_fmt", scope: !176, file: !177, line: 101, baseType: !46, size: 32, align: 32, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "in_ch_layout", scope: !176, file: !177, line: 102, baseType: !99, size: 64, align: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "out_ch_layout", scope: !176, file: !177, line: 103, baseType: !99, size: 64, align: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "in_sample_rate", scope: !176, file: !177, line: 104, baseType: !93, size: 32, align: 32, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "out_sample_rate", scope: !176, file: !177, line: 105, baseType: !93, size: 32, align: 32, offset: 480)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !176, file: !177, line: 106, baseType: !93, size: 32, align: 32, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "slev", scope: !176, file: !177, line: 107, baseType: !191, size: 32, align: 32, offset: 544)
!191 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "clev", scope: !176, file: !177, line: 108, baseType: !191, size: 32, align: 32, offset: 576)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "lfe_mix_level", scope: !176, file: !177, line: 109, baseType: !191, size: 32, align: 32, offset: 608)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_volume", scope: !176, file: !177, line: 110, baseType: !191, size: 32, align: 32, offset: 640)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_maxval", scope: !176, file: !177, line: 111, baseType: !191, size: 32, align: 32, offset: 672)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_encoding", scope: !176, file: !177, line: 112, baseType: !93, size: 32, align: 32, offset: 704)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "channel_map", scope: !176, file: !177, line: 113, baseType: !198, size: 64, align: 64, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "used_ch_count", scope: !176, file: !177, line: 114, baseType: !93, size: 32, align: 32, offset: 832)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !176, file: !177, line: 115, baseType: !93, size: 32, align: 32, offset: 864)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "user_in_ch_count", scope: !176, file: !177, line: 117, baseType: !93, size: 32, align: 32, offset: 896)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "user_out_ch_count", scope: !176, file: !177, line: 118, baseType: !93, size: 32, align: 32, offset: 928)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "user_used_ch_count", scope: !176, file: !177, line: 119, baseType: !93, size: 32, align: 32, offset: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "user_in_ch_layout", scope: !176, file: !177, line: 120, baseType: !99, size: 64, align: 64, offset: 1024)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "user_out_ch_layout", scope: !176, file: !177, line: 121, baseType: !99, size: 64, align: 64, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "user_int_sample_fmt", scope: !176, file: !177, line: 122, baseType: !46, size: 32, align: 32, offset: 1152)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "user_dither_method", scope: !176, file: !177, line: 123, baseType: !93, size: 32, align: 32, offset: 1184)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !176, file: !177, line: 125, baseType: !210, size: 91584, align: 64, offset: 1216)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DitherContext", file: !177, line: 55, size: 91584, align: 64, elements: !211)
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220, !224, !229, !245, !246}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !210, file: !177, line: 56, baseType: !93, size: 32, align: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "noise_pos", scope: !210, file: !177, line: 57, baseType: !93, size: 32, align: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !210, file: !177, line: 58, baseType: !191, size: 32, align: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "noise_scale", scope: !210, file: !177, line: 59, baseType: !191, size: 32, align: 32, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ns_taps", scope: !210, file: !177, line: 60, baseType: !93, size: 32, align: 32, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ns_scale", scope: !210, file: !177, line: 61, baseType: !191, size: 32, align: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ns_scale_1", scope: !210, file: !177, line: 62, baseType: !191, size: 32, align: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ns_pos", scope: !210, file: !177, line: 63, baseType: !93, size: 32, align: 32, offset: 224)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ns_coeffs", scope: !210, file: !177, line: 64, baseType: !221, size: 640, align: 32, offset: 256)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 640, align: 32, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 20)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ns_errors", scope: !210, file: !177, line: 65, baseType: !225, size: 81920, align: 32, offset: 896)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 81920, align: 32, elements: !226)
!226 = !{!227, !228}
!227 = !DISubrange(count: 64)
!228 = !DISubrange(count: 40)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "noise", scope: !210, file: !177, line: 66, baseType: !230, size: 4352, align: 64, offset: 82816)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "AudioData", file: !177, line: 53, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AudioData", file: !177, line: 45, size: 4352, align: 64, elements: !232)
!232 = !{!233, !239, !240, !241, !242, !243, !244}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !231, file: !177, line: 46, baseType: !234, size: 4096, align: 64)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 4096, align: 64, elements: !238)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !100, line: 48, baseType: !237)
!237 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!238 = !{!227}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !231, file: !177, line: 47, baseType: !235, size: 64, align: 64, offset: 4096)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ch_count", scope: !231, file: !177, line: 48, baseType: !93, size: 32, align: 32, offset: 4160)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !231, file: !177, line: 49, baseType: !93, size: 32, align: 32, offset: 4192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !231, file: !177, line: 50, baseType: !93, size: 32, align: 32, offset: 4224)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "planar", scope: !231, file: !177, line: 51, baseType: !93, size: 32, align: 32, offset: 4256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !231, file: !177, line: 52, baseType: !46, size: 32, align: 32, offset: 4288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !210, file: !177, line: 67, baseType: !230, size: 4352, align: 64, offset: 87168)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "output_sample_bits", scope: !210, file: !177, line: 68, baseType: !93, size: 32, align: 32, offset: 91520)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "filter_size", scope: !176, file: !177, line: 127, baseType: !93, size: 32, align: 32, offset: 92800)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "phase_shift", scope: !176, file: !177, line: 128, baseType: !93, size: 32, align: 32, offset: 92832)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "linear_interp", scope: !176, file: !177, line: 129, baseType: !93, size: 32, align: 32, offset: 92864)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "exact_rational", scope: !176, file: !177, line: 130, baseType: !93, size: 32, align: 32, offset: 92896)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !176, file: !177, line: 131, baseType: !103, size: 64, align: 64, offset: 92928)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !176, file: !177, line: 132, baseType: !93, size: 32, align: 32, offset: 92992)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "kaiser_beta", scope: !176, file: !177, line: 133, baseType: !103, size: 64, align: 64, offset: 93056)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !176, file: !177, line: 134, baseType: !103, size: 64, align: 64, offset: 93120)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cheby", scope: !176, file: !177, line: 135, baseType: !93, size: 32, align: 32, offset: 93184)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "min_compensation", scope: !176, file: !177, line: 137, baseType: !191, size: 32, align: 32, offset: 93216)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "min_hard_compensation", scope: !176, file: !177, line: 138, baseType: !191, size: 32, align: 32, offset: 93248)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "soft_compensation_duration", scope: !176, file: !177, line: 139, baseType: !191, size: 32, align: 32, offset: 93280)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "max_soft_compensation", scope: !176, file: !177, line: 140, baseType: !191, size: 32, align: 32, offset: 93312)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "async", scope: !176, file: !177, line: 141, baseType: !191, size: 32, align: 32, offset: 93344)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "firstpts_in_samples", scope: !176, file: !177, line: 142, baseType: !99, size: 64, align: 64, offset: 93376)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "resample_first", scope: !176, file: !177, line: 144, baseType: !93, size: 32, align: 32, offset: 93440)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix", scope: !176, file: !177, line: 145, baseType: !93, size: 32, align: 32, offset: 93472)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_custom", scope: !176, file: !177, line: 146, baseType: !93, size: 32, align: 32, offset: 93504)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !176, file: !177, line: 148, baseType: !230, size: 4352, align: 64, offset: 93568)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "postin", scope: !176, file: !177, line: 149, baseType: !230, size: 4352, align: 64, offset: 97920)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "midbuf", scope: !176, file: !177, line: 150, baseType: !230, size: 4352, align: 64, offset: 102272)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "preout", scope: !176, file: !177, line: 151, baseType: !230, size: 4352, align: 64, offset: 106624)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !176, file: !177, line: 152, baseType: !230, size: 4352, align: 64, offset: 110976)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer", scope: !176, file: !177, line: 153, baseType: !230, size: 4352, align: 64, offset: 115328)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "silence", scope: !176, file: !177, line: 154, baseType: !230, size: 4352, align: 64, offset: 119680)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "drop_temp", scope: !176, file: !177, line: 155, baseType: !230, size: 4352, align: 64, offset: 124032)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer_index", scope: !176, file: !177, line: 156, baseType: !93, size: 32, align: 32, offset: 128384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer_count", scope: !176, file: !177, line: 157, baseType: !93, size: 32, align: 32, offset: 128416)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "resample_in_constraint", scope: !176, file: !177, line: 158, baseType: !93, size: 32, align: 32, offset: 128448)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flushed", scope: !176, file: !177, line: 159, baseType: !93, size: 32, align: 32, offset: 128480)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "outpts", scope: !176, file: !177, line: 160, baseType: !99, size: 64, align: 64, offset: 128512)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "firstpts", scope: !176, file: !177, line: 161, baseType: !99, size: 64, align: 64, offset: 128576)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "drop_output", scope: !176, file: !177, line: 162, baseType: !93, size: 32, align: 32, offset: 128640)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_samples_fixup", scope: !176, file: !177, line: 163, baseType: !103, size: 64, align: 64, offset: 128704)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "in_convert", scope: !176, file: !177, line: 165, baseType: !282, size: 64, align: 64, offset: 128768)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "AudioConvert", file: !177, line: 165, flags: DIFlagFwdDecl)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "out_convert", scope: !176, file: !177, line: 166, baseType: !282, size: 64, align: 64, offset: 128832)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "full_convert", scope: !176, file: !177, line: 167, baseType: !282, size: 64, align: 64, offset: 128896)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "resample", scope: !176, file: !177, line: 168, baseType: !287, size: 64, align: 64, offset: 128960)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "ResampleContext", file: !177, line: 71, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "resampler", scope: !176, file: !177, line: 169, baseType: !290, size: 64, align: 64, offset: 129024)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Resampler", file: !177, line: 81, size: 512, align: 64, elements: !293)
!293 = !{!294, !299, !305, !312, !317, !322, !327, !334}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !292, file: !177, line: 82, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_init_func", file: !177, line: 71, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!287, !287, !93, !93, !93, !93, !93, !103, !46, !63, !103, !103, !93, !93}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !292, file: !177, line: 83, baseType: !300, size: 64, align: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_free_func", file: !177, line: 73, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !304}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "multiple_resample", scope: !292, file: !177, line: 84, baseType: !306, size: 64, align: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiple_resample_func", file: !177, line: 74, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!93, !287, !310, !93, !310, !93, !311}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !292, file: !177, line: 85, baseType: !313, size: 64, align: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_flush_func", file: !177, line: 75, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!93, !175}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set_compensation", scope: !292, file: !177, line: 86, baseType: !318, size: 64, align: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "set_compensation_func", file: !177, line: 76, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!93, !287, !93, !93}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "get_delay", scope: !292, file: !177, line: 87, baseType: !323, size: 64, align: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_delay_func", file: !177, line: 77, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!99, !175, !99}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "invert_initial_buffer", scope: !292, file: !177, line: 88, baseType: !328, size: 64, align: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "invert_initial_buffer_func", file: !177, line: 78, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!93, !287, !310, !332, !93, !311, !311}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "get_out_samples", scope: !292, file: !177, line: 89, baseType: !335, size: 64, align: 64, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_out_samples_func", file: !177, line: 79, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!99, !175, !93}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !176, file: !177, line: 171, baseType: !340, size: 262144, align: 64, offset: 129088)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 262144, align: 64, elements: !341)
!341 = !{!227, !227}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_flt", scope: !176, file: !177, line: 172, baseType: !343, size: 131072, align: 32, offset: 391232)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 131072, align: 32, elements: !341)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "native_matrix", scope: !176, file: !177, line: 173, baseType: !235, size: 64, align: 64, offset: 522304)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "native_one", scope: !176, file: !177, line: 174, baseType: !235, size: 64, align: 64, offset: 522368)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "native_simd_one", scope: !176, file: !177, line: 175, baseType: !235, size: 64, align: 64, offset: 522432)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "native_simd_matrix", scope: !176, file: !177, line: 176, baseType: !235, size: 64, align: 64, offset: 522496)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "matrix32", scope: !176, file: !177, line: 177, baseType: !349, size: 131072, align: 32, offset: 522560)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 131072, align: 32, elements: !341)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !100, line: 38, baseType: !93)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_ch", scope: !176, file: !177, line: 178, baseType: !352, size: 33280, align: 8, offset: 653632)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 33280, align: 8, elements: !353)
!353 = !{!227, !354}
!354 = !DISubrange(count: 65)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "mix_1_1_f", scope: !176, file: !177, line: 179, baseType: !356, size: 64, align: 64, offset: 686912)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_1_1_func_type", file: !177, line: 40, baseType: !358)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !84, !360, !84, !362, !362}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "integer", file: !177, line: 35, baseType: !99)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "mix_1_1_simd", scope: !176, file: !177, line: 180, baseType: !356, size: 64, align: 64, offset: 686976)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mix_2_1_f", scope: !176, file: !177, line: 182, baseType: !365, size: 64, align: 64, offset: 687040)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_2_1_func_type", file: !177, line: 41, baseType: !367)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !84, !360, !360, !84, !362, !362, !362}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mix_2_1_simd", scope: !176, file: !177, line: 183, baseType: !365, size: 64, align: 64, offset: 687104)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mix_any_f", scope: !176, file: !177, line: 185, baseType: !371, size: 64, align: 64, offset: 687168)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_any_func_type", file: !177, line: 43, baseType: !373)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !375, !376, !84, !362}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!379 = !DILocalVariable(name: "s", scope: !172, file: !71, line: 150, type: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwrContext", file: !64, line: 182, baseType: !176)
!382 = !DIExpression()
!383 = !DILocation(line: 150, column: 17, scope: !172)
!384 = !DILocation(line: 150, column: 20, scope: !172)
!385 = !DILocation(line: 151, column: 8, scope: !386)
!386 = distinct !DILexicalBlock(scope: !172, file: !71, line: 151, column: 8)
!387 = !DILocation(line: 151, column: 8, scope: !172)
!388 = !DILocation(line: 152, column: 9, scope: !389)
!389 = distinct !DILexicalBlock(scope: !386, file: !71, line: 151, column: 10)
!390 = !DILocation(line: 152, column: 12, scope: !389)
!391 = !DILocation(line: 152, column: 20, scope: !389)
!392 = !DILocation(line: 153, column: 29, scope: !389)
!393 = !DILocation(line: 153, column: 9, scope: !389)
!394 = !DILocation(line: 154, column: 5, scope: !389)
!395 = !DILocation(line: 155, column: 12, scope: !172)
!396 = !DILocation(line: 155, column: 5, scope: !172)
!397 = distinct !DISubprogram(name: "context_to_name", scope: !71, file: !71, line: 130, type: !82, isLocal: true, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !170)
!398 = !DILocalVariable(name: "ptr", arg: 1, scope: !397, file: !71, line: 130, type: !84)
!399 = !DILocation(line: 130, column: 42, scope: !397)
!400 = !DILocation(line: 131, column: 5, scope: !397)
