; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a/[inter]libswresample--rematrix.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a/[inter]libswresample--rematrix.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SwrContext = type { %struct.AVClass*, i32, i8*, i32, i32, i32, i64, i64, i32, i32, i32, float, float, float, float, float, i32, i32*, i32, i32, i32, i32, i32, i64, i64, i32, i32, %struct.DitherContext, i32, i32, i32, i32, double, i32, double, double, i32, float, float, float, float, float, i64, i32, i32, i32, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, i32, i32, i32, i32, i64, i64, i32, double, %struct.AudioConvert*, %struct.AudioConvert*, %struct.AudioConvert*, %struct.ResampleContext*, %struct.Resampler*, [64 x [64 x double]], [64 x [64 x float]], i8*, i8*, i8*, i8*, [64 x [64 x i32]], [64 x [65 x i8]], void (i8*, i8*, i8*, i64, i64)*, void (i8*, i8*, i8*, i64, i64)*, void (i8*, i8*, i8*, i8*, i64, i64, i64)*, void (i8*, i8*, i8*, i8*, i64, i64, i64)*, void (i8**, i8**, i8*, i64)* }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }

!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVMatrixEncoding", file: !48, line: 114, size: 32, align: 32, elements: !49)
!48 = !DIFile(filename: "./libavutil/channel_layout.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57}
!50 = !DIEnumerator(name: "AV_MATRIX_ENCODING_NONE", value: 0)
!51 = !DIEnumerator(name: "AV_MATRIX_ENCODING_DOLBY", value: 1)
!52 = !DIEnumerator(name: "AV_MATRIX_ENCODING_DPLII", value: 2)
!53 = !DIEnumerator(name: "AV_MATRIX_ENCODING_DPLIIX", value: 3)
!54 = !DIEnumerator(name: "AV_MATRIX_ENCODING_DPLIIZ", value: 4)
!55 = !DIEnumerator(name: "AV_MATRIX_ENCODING_DOLBYEX", value: 5)
!56 = !DIEnumerator(name: "AV_MATRIX_ENCODING_DOLBYHEADPHONE", value: 6)
!57 = !DIEnumerator(name: "AV_MATRIX_ENCODING_NB", value: 7)
!58 = !{!59, !60, !62, !73, !77, !88, !90, !85, !92, !61, !89, !91, !70}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_1_1_func_type", file: !64, line: 40, baseType: !65)
!64 = !DIFile(filename: "libswresample/swresample_internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!65 = !DISubroutineType(types: !66)
!66 = !{null, !59, !67, !59, !69, !69}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "integer", file: !64, line: 35, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !71, line: 40, baseType: !72)
!71 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!72 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_2_1_func_type", file: !64, line: 41, baseType: !75)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !59, !67, !67, !59, !69, !69, !69}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_any_func_type", file: !64, line: 43, baseType: !79)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !81, !85, !59, !69}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !71, line: 48, baseType: !84)
!84 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !71, line: 37, baseType: !94)
!94 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!95 = !{i32 2, !"Dwarf Version", i32 4}
!96 = !{i32 2, !"Debug Info Version", i32 3}
!97 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!98 = distinct !DISubprogram(name: "swr_set_matrix", scope: !99, file: !99, line: 64, type: !100, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !326)
!99 = !DIFile(filename: "libswresample/rematrix.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!100 = !DISubroutineType(types: !101)
!101 = !{!61, !102, !324, !61}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwrContext", file: !64, line: 95, size: 687232, align: 64, elements: !104)
!104 = !{!105, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !249, !250, !251, !254, !303, !306, !308, !309, !310, !311, !312, !315, !319, !320, !321, !322, !323}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !103, file: !64, line: 96, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !110)
!110 = !{!111, !115, !119, !123, !124, !125, !126, !130, !136, !138, !142}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !109, file: !4, line: 72, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!114 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !109, file: !4, line: 78, baseType: !116, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!112, !59}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !109, file: !4, line: 85, baseType: !120, size: 64, align: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !109, file: !4, line: 93, baseType: !61, size: 32, align: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !109, file: !4, line: 99, baseType: !61, size: 32, align: 32, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !109, file: !4, line: 108, baseType: !61, size: 32, align: 32, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !109, file: !4, line: 113, baseType: !127, size: 64, align: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!59, !59, !59}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !109, file: !4, line: 123, baseType: !131, size: 64, align: 64, offset: 384)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!134, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !109, file: !4, line: 130, baseType: !137, size: 32, align: 32, offset: 448)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !109, file: !4, line: 136, baseType: !139, size: 64, align: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!137, !59}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !109, file: !4, line: 142, baseType: !143, size: 64, align: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!61, !146, !59, !112, !61}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !103, file: !64, line: 97, baseType: !61, size: 32, align: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !103, file: !64, line: 98, baseType: !59, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "in_sample_fmt", scope: !103, file: !64, line: 99, baseType: !24, size: 32, align: 32, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "int_sample_fmt", scope: !103, file: !64, line: 100, baseType: !24, size: 32, align: 32, offset: 224)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "out_sample_fmt", scope: !103, file: !64, line: 101, baseType: !24, size: 32, align: 32, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "in_ch_layout", scope: !103, file: !64, line: 102, baseType: !70, size: 64, align: 64, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "out_ch_layout", scope: !103, file: !64, line: 103, baseType: !70, size: 64, align: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "in_sample_rate", scope: !103, file: !64, line: 104, baseType: !61, size: 32, align: 32, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "out_sample_rate", scope: !103, file: !64, line: 105, baseType: !61, size: 32, align: 32, offset: 480)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !103, file: !64, line: 106, baseType: !61, size: 32, align: 32, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "slev", scope: !103, file: !64, line: 107, baseType: !89, size: 32, align: 32, offset: 544)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "clev", scope: !103, file: !64, line: 108, baseType: !89, size: 32, align: 32, offset: 576)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "lfe_mix_level", scope: !103, file: !64, line: 109, baseType: !89, size: 32, align: 32, offset: 608)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_volume", scope: !103, file: !64, line: 110, baseType: !89, size: 32, align: 32, offset: 640)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_maxval", scope: !103, file: !64, line: 111, baseType: !89, size: 32, align: 32, offset: 672)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_encoding", scope: !103, file: !64, line: 112, baseType: !61, size: 32, align: 32, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "channel_map", scope: !103, file: !64, line: 113, baseType: !166, size: 64, align: 64, offset: 768)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "used_ch_count", scope: !103, file: !64, line: 114, baseType: !61, size: 32, align: 32, offset: 832)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !103, file: !64, line: 115, baseType: !61, size: 32, align: 32, offset: 864)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "user_in_ch_count", scope: !103, file: !64, line: 117, baseType: !61, size: 32, align: 32, offset: 896)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "user_out_ch_count", scope: !103, file: !64, line: 118, baseType: !61, size: 32, align: 32, offset: 928)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "user_used_ch_count", scope: !103, file: !64, line: 119, baseType: !61, size: 32, align: 32, offset: 960)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "user_in_ch_layout", scope: !103, file: !64, line: 120, baseType: !70, size: 64, align: 64, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "user_out_ch_layout", scope: !103, file: !64, line: 121, baseType: !70, size: 64, align: 64, offset: 1088)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "user_int_sample_fmt", scope: !103, file: !64, line: 122, baseType: !24, size: 32, align: 32, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "user_dither_method", scope: !103, file: !64, line: 123, baseType: !61, size: 32, align: 32, offset: 1184)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !103, file: !64, line: 125, baseType: !178, size: 91584, align: 64, offset: 1216)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DitherContext", file: !64, line: 55, size: 91584, align: 64, elements: !179)
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !188, !192, !197, !210, !211}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !178, file: !64, line: 56, baseType: !61, size: 32, align: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "noise_pos", scope: !178, file: !64, line: 57, baseType: !61, size: 32, align: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !178, file: !64, line: 58, baseType: !89, size: 32, align: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "noise_scale", scope: !178, file: !64, line: 59, baseType: !89, size: 32, align: 32, offset: 96)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ns_taps", scope: !178, file: !64, line: 60, baseType: !61, size: 32, align: 32, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ns_scale", scope: !178, file: !64, line: 61, baseType: !89, size: 32, align: 32, offset: 160)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ns_scale_1", scope: !178, file: !64, line: 62, baseType: !89, size: 32, align: 32, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ns_pos", scope: !178, file: !64, line: 63, baseType: !61, size: 32, align: 32, offset: 224)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ns_coeffs", scope: !178, file: !64, line: 64, baseType: !189, size: 640, align: 32, offset: 256)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 640, align: 32, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 20)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ns_errors", scope: !178, file: !64, line: 65, baseType: !193, size: 81920, align: 32, offset: 896)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 81920, align: 32, elements: !194)
!194 = !{!195, !196}
!195 = !DISubrange(count: 64)
!196 = !DISubrange(count: 40)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "noise", scope: !178, file: !64, line: 66, baseType: !198, size: 4352, align: 64, offset: 82816)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "AudioData", file: !64, line: 53, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AudioData", file: !64, line: 45, size: 4352, align: 64, elements: !200)
!200 = !{!201, !204, !205, !206, !207, !208, !209}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !199, file: !64, line: 46, baseType: !202, size: 4096, align: 64)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 4096, align: 64, elements: !203)
!203 = !{!195}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !199, file: !64, line: 47, baseType: !82, size: 64, align: 64, offset: 4096)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ch_count", scope: !199, file: !64, line: 48, baseType: !61, size: 32, align: 32, offset: 4160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !199, file: !64, line: 49, baseType: !61, size: 32, align: 32, offset: 4192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !199, file: !64, line: 50, baseType: !61, size: 32, align: 32, offset: 4224)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "planar", scope: !199, file: !64, line: 51, baseType: !61, size: 32, align: 32, offset: 4256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !199, file: !64, line: 52, baseType: !24, size: 32, align: 32, offset: 4288)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !178, file: !64, line: 67, baseType: !198, size: 4352, align: 64, offset: 87168)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "output_sample_bits", scope: !178, file: !64, line: 68, baseType: !61, size: 32, align: 32, offset: 91520)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "filter_size", scope: !103, file: !64, line: 127, baseType: !61, size: 32, align: 32, offset: 92800)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "phase_shift", scope: !103, file: !64, line: 128, baseType: !61, size: 32, align: 32, offset: 92832)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "linear_interp", scope: !103, file: !64, line: 129, baseType: !61, size: 32, align: 32, offset: 92864)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "exact_rational", scope: !103, file: !64, line: 130, baseType: !61, size: 32, align: 32, offset: 92896)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !103, file: !64, line: 131, baseType: !91, size: 64, align: 64, offset: 92928)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !103, file: !64, line: 132, baseType: !61, size: 32, align: 32, offset: 92992)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "kaiser_beta", scope: !103, file: !64, line: 133, baseType: !91, size: 64, align: 64, offset: 93056)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !103, file: !64, line: 134, baseType: !91, size: 64, align: 64, offset: 93120)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cheby", scope: !103, file: !64, line: 135, baseType: !61, size: 32, align: 32, offset: 93184)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "min_compensation", scope: !103, file: !64, line: 137, baseType: !89, size: 32, align: 32, offset: 93216)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "min_hard_compensation", scope: !103, file: !64, line: 138, baseType: !89, size: 32, align: 32, offset: 93248)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "soft_compensation_duration", scope: !103, file: !64, line: 139, baseType: !89, size: 32, align: 32, offset: 93280)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "max_soft_compensation", scope: !103, file: !64, line: 140, baseType: !89, size: 32, align: 32, offset: 93312)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "async", scope: !103, file: !64, line: 141, baseType: !89, size: 32, align: 32, offset: 93344)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "firstpts_in_samples", scope: !103, file: !64, line: 142, baseType: !70, size: 64, align: 64, offset: 93376)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "resample_first", scope: !103, file: !64, line: 144, baseType: !61, size: 32, align: 32, offset: 93440)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix", scope: !103, file: !64, line: 145, baseType: !61, size: 32, align: 32, offset: 93472)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_custom", scope: !103, file: !64, line: 146, baseType: !61, size: 32, align: 32, offset: 93504)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !103, file: !64, line: 148, baseType: !198, size: 4352, align: 64, offset: 93568)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "postin", scope: !103, file: !64, line: 149, baseType: !198, size: 4352, align: 64, offset: 97920)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "midbuf", scope: !103, file: !64, line: 150, baseType: !198, size: 4352, align: 64, offset: 102272)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "preout", scope: !103, file: !64, line: 151, baseType: !198, size: 4352, align: 64, offset: 106624)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !103, file: !64, line: 152, baseType: !198, size: 4352, align: 64, offset: 110976)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer", scope: !103, file: !64, line: 153, baseType: !198, size: 4352, align: 64, offset: 115328)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "silence", scope: !103, file: !64, line: 154, baseType: !198, size: 4352, align: 64, offset: 119680)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "drop_temp", scope: !103, file: !64, line: 155, baseType: !198, size: 4352, align: 64, offset: 124032)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer_index", scope: !103, file: !64, line: 156, baseType: !61, size: 32, align: 32, offset: 128384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer_count", scope: !103, file: !64, line: 157, baseType: !61, size: 32, align: 32, offset: 128416)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "resample_in_constraint", scope: !103, file: !64, line: 158, baseType: !61, size: 32, align: 32, offset: 128448)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "flushed", scope: !103, file: !64, line: 159, baseType: !61, size: 32, align: 32, offset: 128480)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "outpts", scope: !103, file: !64, line: 160, baseType: !70, size: 64, align: 64, offset: 128512)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "firstpts", scope: !103, file: !64, line: 161, baseType: !70, size: 64, align: 64, offset: 128576)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "drop_output", scope: !103, file: !64, line: 162, baseType: !61, size: 32, align: 32, offset: 128640)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_samples_fixup", scope: !103, file: !64, line: 163, baseType: !91, size: 64, align: 64, offset: 128704)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "in_convert", scope: !103, file: !64, line: 165, baseType: !247, size: 64, align: 64, offset: 128768)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "AudioConvert", file: !64, line: 165, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "out_convert", scope: !103, file: !64, line: 166, baseType: !247, size: 64, align: 64, offset: 128832)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "full_convert", scope: !103, file: !64, line: 167, baseType: !247, size: 64, align: 64, offset: 128896)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "resample", scope: !103, file: !64, line: 168, baseType: !252, size: 64, align: 64, offset: 128960)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "ResampleContext", file: !64, line: 71, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "resampler", scope: !103, file: !64, line: 169, baseType: !255, size: 64, align: 64, offset: 129024)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Resampler", file: !64, line: 81, size: 512, align: 64, elements: !258)
!258 = !{!259, !264, !270, !276, !281, !286, !291, !298}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !257, file: !64, line: 82, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_init_func", file: !64, line: 71, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!252, !252, !61, !61, !61, !61, !61, !91, !24, !41, !91, !91, !61, !61}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !257, file: !64, line: 83, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_free_func", file: !64, line: 73, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !269}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "multiple_resample", scope: !257, file: !64, line: 84, baseType: !271, size: 64, align: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiple_resample_func", file: !64, line: 74, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!61, !252, !275, !61, !275, !61, !60}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !257, file: !64, line: 85, baseType: !277, size: 64, align: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_flush_func", file: !64, line: 75, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!61, !102}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "set_compensation", scope: !257, file: !64, line: 86, baseType: !282, size: 64, align: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "set_compensation_func", file: !64, line: 76, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!61, !252, !61, !61}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "get_delay", scope: !257, file: !64, line: 87, baseType: !287, size: 64, align: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_delay_func", file: !64, line: 77, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!70, !102, !70}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "invert_initial_buffer", scope: !257, file: !64, line: 88, baseType: !292, size: 64, align: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "invert_initial_buffer_func", file: !64, line: 78, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!61, !252, !275, !296, !61, !60, !60}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "get_out_samples", scope: !257, file: !64, line: 89, baseType: !299, size: 64, align: 64, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_out_samples_func", file: !64, line: 79, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!70, !102, !61}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !103, file: !64, line: 171, baseType: !304, size: 262144, align: 64, offset: 129088)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 262144, align: 64, elements: !305)
!305 = !{!195, !195}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_flt", scope: !103, file: !64, line: 172, baseType: !307, size: 131072, align: 32, offset: 391232)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 131072, align: 32, elements: !305)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "native_matrix", scope: !103, file: !64, line: 173, baseType: !82, size: 64, align: 64, offset: 522304)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "native_one", scope: !103, file: !64, line: 174, baseType: !82, size: 64, align: 64, offset: 522368)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "native_simd_one", scope: !103, file: !64, line: 175, baseType: !82, size: 64, align: 64, offset: 522432)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "native_simd_matrix", scope: !103, file: !64, line: 176, baseType: !82, size: 64, align: 64, offset: 522496)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "matrix32", scope: !103, file: !64, line: 177, baseType: !313, size: 131072, align: 32, offset: 522560)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 131072, align: 32, elements: !305)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !71, line: 38, baseType: !61)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_ch", scope: !103, file: !64, line: 178, baseType: !316, size: 33280, align: 8, offset: 653632)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 33280, align: 8, elements: !317)
!317 = !{!195, !318}
!318 = !DISubrange(count: 65)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "mix_1_1_f", scope: !103, file: !64, line: 179, baseType: !62, size: 64, align: 64, offset: 686912)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "mix_1_1_simd", scope: !103, file: !64, line: 180, baseType: !62, size: 64, align: 64, offset: 686976)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "mix_2_1_f", scope: !103, file: !64, line: 182, baseType: !73, size: 64, align: 64, offset: 687040)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "mix_2_1_simd", scope: !103, file: !64, line: 183, baseType: !73, size: 64, align: 64, offset: 687104)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mix_any_f", scope: !103, file: !64, line: 185, baseType: !77, size: 64, align: 64, offset: 687168)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!326 = !{}
!327 = !DILocalVariable(name: "s", arg: 1, scope: !98, file: !99, line: 64, type: !102)
!328 = !DIExpression()
!329 = !DILocation(line: 64, column: 39, scope: !98)
!330 = !DILocalVariable(name: "matrix", arg: 2, scope: !98, file: !99, line: 64, type: !324)
!331 = !DILocation(line: 64, column: 56, scope: !98)
!332 = !DILocalVariable(name: "stride", arg: 3, scope: !98, file: !99, line: 64, type: !61)
!333 = !DILocation(line: 64, column: 68, scope: !98)
!334 = !DILocalVariable(name: "nb_in", scope: !98, file: !99, line: 66, type: !61)
!335 = !DILocation(line: 66, column: 9, scope: !98)
!336 = !DILocalVariable(name: "nb_out", scope: !98, file: !99, line: 66, type: !61)
!337 = !DILocation(line: 66, column: 16, scope: !98)
!338 = !DILocalVariable(name: "in", scope: !98, file: !99, line: 66, type: !61)
!339 = !DILocation(line: 66, column: 24, scope: !98)
!340 = !DILocalVariable(name: "out", scope: !98, file: !99, line: 66, type: !61)
!341 = !DILocation(line: 66, column: 28, scope: !98)
!342 = !DILocation(line: 68, column: 10, scope: !343)
!343 = distinct !DILexicalBlock(scope: !98, file: !99, line: 68, column: 9)
!344 = !DILocation(line: 68, column: 12, scope: !343)
!345 = !DILocation(line: 68, column: 15, scope: !346)
!346 = !DILexicalBlockFile(scope: !343, file: !99, discriminator: 1)
!347 = !DILocation(line: 68, column: 18, scope: !346)
!348 = !DILocation(line: 68, column: 9, scope: !346)
!349 = !DILocation(line: 69, column: 9, scope: !343)
!350 = !DILocation(line: 70, column: 12, scope: !98)
!351 = !DILocation(line: 70, column: 15, scope: !98)
!352 = !DILocation(line: 70, column: 5, scope: !98)
!353 = !DILocation(line: 71, column: 12, scope: !98)
!354 = !DILocation(line: 71, column: 15, scope: !98)
!355 = !DILocation(line: 71, column: 5, scope: !98)
!356 = !DILocation(line: 72, column: 14, scope: !98)
!357 = !DILocation(line: 72, column: 17, scope: !98)
!358 = !DILocation(line: 72, column: 34, scope: !98)
!359 = !DILocation(line: 72, column: 13, scope: !98)
!360 = !DILocation(line: 72, column: 41, scope: !361)
!361 = !DILexicalBlockFile(scope: !98, file: !99, discriminator: 1)
!362 = !DILocation(line: 72, column: 44, scope: !361)
!363 = !DILocation(line: 72, column: 13, scope: !361)
!364 = !DILocation(line: 73, column: 43, scope: !98)
!365 = !DILocation(line: 73, column: 46, scope: !98)
!366 = !DILocation(line: 73, column: 9, scope: !98)
!367 = !DILocation(line: 72, column: 13, scope: !368)
!368 = !DILexicalBlockFile(scope: !98, file: !99, discriminator: 2)
!369 = !DILocation(line: 72, column: 13, scope: !370)
!370 = !DILexicalBlockFile(scope: !98, file: !99, discriminator: 3)
!371 = !DILocation(line: 72, column: 11, scope: !370)
!372 = !DILocation(line: 74, column: 15, scope: !98)
!373 = !DILocation(line: 74, column: 18, scope: !98)
!374 = !DILocation(line: 74, column: 36, scope: !98)
!375 = !DILocation(line: 74, column: 14, scope: !98)
!376 = !DILocation(line: 74, column: 43, scope: !361)
!377 = !DILocation(line: 74, column: 46, scope: !361)
!378 = !DILocation(line: 74, column: 14, scope: !361)
!379 = !DILocation(line: 75, column: 43, scope: !98)
!380 = !DILocation(line: 75, column: 46, scope: !98)
!381 = !DILocation(line: 75, column: 9, scope: !98)
!382 = !DILocation(line: 74, column: 14, scope: !368)
!383 = !DILocation(line: 74, column: 14, scope: !370)
!384 = !DILocation(line: 74, column: 12, scope: !370)
!385 = !DILocation(line: 76, column: 14, scope: !386)
!386 = distinct !DILexicalBlock(scope: !98, file: !99, line: 76, column: 5)
!387 = !DILocation(line: 76, column: 10, scope: !386)
!388 = !DILocation(line: 76, column: 19, scope: !389)
!389 = !DILexicalBlockFile(scope: !390, file: !99, discriminator: 1)
