; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a/[inter]libswresample--swresample_frame.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a/[inter]libswresample--swresample_frame.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SwrContext = type { %struct.AVClass*, i32, i8*, i32, i32, i32, i64, i64, i32, i32, i32, float, float, float, float, float, i32, i32*, i32, i32, i32, i32, i32, i64, i64, i32, i32, %struct.DitherContext, i32, i32, i32, i32, double, i32, double, double, i32, float, float, float, float, float, i64, i32, i32, i32, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, i32, i32, i32, i32, i64, i64, i32, double, %struct.AudioConvert*, %struct.AudioConvert*, %struct.AudioConvert*, %struct.ResampleContext*, %struct.Resampler*, [64 x [64 x double]], [64 x [64 x float]], i8*, i8*, i8*, i8*, [64 x [64 x i32]], [64 x [65 x i8]], void (i8*, i8*, i8*, i64, i64)*, void (i8*, i8*, i8*, i64, i64)*, void (i8*, i8*, i8*, i8*, i64, i64, i64)*, void (i8*, i8*, i8*, i8*, i64, i64, i64)*, void (i8**, i8**, i8*, i64)* }

!142 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!143 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!144 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!145 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!146 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!147 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!148 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!149 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!150 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!151 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!152 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !105, line: 493, size: 32, align: 32, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171}
!155 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!156 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!157 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!158 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!159 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!160 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!161 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!162 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!163 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!164 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!165 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!166 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!167 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!168 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!169 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!170 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!171 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!172 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !105, line: 538, size: 32, align: 32, elements: !173)
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181}
!174 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!175 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!176 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!177 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!178 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!179 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!180 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!181 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!182 = !{!183, !186}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !184, line: 40, baseType: !185)
!184 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!185 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !184, line: 48, baseType: !190)
!190 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!191 = !{i32 2, !"Dwarf Version", i32 4}
!192 = !{i32 2, !"Debug Info Version", i32 3}
!193 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!194 = distinct !DISubprogram(name: "swr_config_frame", scope: !195, file: !195, line: 26, type: !196, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !580)
!195 = !DIFile(filename: "libswresample/swresample_frame.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!196 = !DISubroutineType(types: !197)
!197 = !{!198, !199, !482, !482}
!198 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwrContext", file: !64, line: 182, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwrContext", file: !202, line: 95, size: 687232, align: 64, elements: !203)
!202 = !DIFile(filename: "libswresample/swresample_internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!203 = !{!204, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !299, !300, !301, !302, !303, !304, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !389, !390, !391, !394, !445, !448, !450, !451, !452, !453, !454, !457, !461, !469, !470, !475, !476}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !201, file: !202, line: 96, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !209)
!209 = !{!210, !214, !219, !246, !247, !248, !249, !253, !259, !261, !265}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !208, file: !26, line: 72, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!213 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !208, file: !26, line: 78, baseType: !215, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!211, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !208, file: !26, line: 85, baseType: !220, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !242, !243, !244, !245}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !222, file: !4, line: 247, baseType: !211, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !222, file: !4, line: 253, baseType: !211, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !222, file: !4, line: 259, baseType: !198, size: 32, align: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !222, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !222, file: !4, line: 271, baseType: !229, size: 64, align: 64, offset: 192)
!229 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !4, line: 265, size: 64, align: 64, elements: !230)
!230 = !{!231, !232, !234, !235}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !229, file: !4, line: 266, baseType: !183, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !229, file: !4, line: 267, baseType: !233, size: 64, align: 64)
!233 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !229, file: !4, line: 268, baseType: !211, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !229, file: !4, line: 270, baseType: !236, size: 64, align: 32)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !237, line: 61, baseType: !238)
!237 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !237, line: 58, size: 64, align: 32, elements: !239)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !238, file: !237, line: 59, baseType: !198, size: 32, align: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !238, file: !237, line: 60, baseType: !198, size: 32, align: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !222, file: !4, line: 272, baseType: !233, size: 64, align: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !222, file: !4, line: 273, baseType: !233, size: 64, align: 64, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !222, file: !4, line: 275, baseType: !198, size: 32, align: 32, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !222, file: !4, line: 300, baseType: !211, size: 64, align: 64, offset: 448)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !208, file: !26, line: 93, baseType: !198, size: 32, align: 32, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !208, file: !26, line: 99, baseType: !198, size: 32, align: 32, offset: 224)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !208, file: !26, line: 108, baseType: !198, size: 32, align: 32, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !208, file: !26, line: 113, baseType: !250, size: 64, align: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!218, !218, !218}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !208, file: !26, line: 123, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!257, !257}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !208, file: !26, line: 130, baseType: !260, size: 32, align: 32, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !208, file: !26, line: 136, baseType: !262, size: 64, align: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!260, !218}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !208, file: !26, line: 142, baseType: !266, size: 64, align: 64, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!198, !269, !218, !211, !198}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !272)
!272 = !{!273, !285, !286}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !271, file: !4, line: 360, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !278)
!278 = !{!279, !280, !281, !282, !283, !284}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !277, file: !4, line: 307, baseType: !211, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !277, file: !4, line: 313, baseType: !233, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !277, file: !4, line: 313, baseType: !233, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !277, file: !4, line: 318, baseType: !233, size: 64, align: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !277, file: !4, line: 318, baseType: !233, size: 64, align: 64, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !277, file: !4, line: 323, baseType: !198, size: 32, align: 32, offset: 320)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !271, file: !4, line: 364, baseType: !198, size: 32, align: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !271, file: !4, line: 368, baseType: !198, size: 32, align: 32, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !201, file: !202, line: 97, baseType: !198, size: 32, align: 32, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !201, file: !202, line: 98, baseType: !218, size: 64, align: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "in_sample_fmt", scope: !201, file: !202, line: 99, baseType: !46, size: 32, align: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "int_sample_fmt", scope: !201, file: !202, line: 100, baseType: !46, size: 32, align: 32, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "out_sample_fmt", scope: !201, file: !202, line: 101, baseType: !46, size: 32, align: 32, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "in_ch_layout", scope: !201, file: !202, line: 102, baseType: !183, size: 64, align: 64, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "out_ch_layout", scope: !201, file: !202, line: 103, baseType: !183, size: 64, align: 64, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "in_sample_rate", scope: !201, file: !202, line: 104, baseType: !198, size: 32, align: 32, offset: 448)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "out_sample_rate", scope: !201, file: !202, line: 105, baseType: !198, size: 32, align: 32, offset: 480)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !201, file: !202, line: 106, baseType: !198, size: 32, align: 32, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "slev", scope: !201, file: !202, line: 107, baseType: !298, size: 32, align: 32, offset: 544)
!298 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "clev", scope: !201, file: !202, line: 108, baseType: !298, size: 32, align: 32, offset: 576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "lfe_mix_level", scope: !201, file: !202, line: 109, baseType: !298, size: 32, align: 32, offset: 608)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_volume", scope: !201, file: !202, line: 110, baseType: !298, size: 32, align: 32, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_maxval", scope: !201, file: !202, line: 111, baseType: !298, size: 32, align: 32, offset: 672)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_encoding", scope: !201, file: !202, line: 112, baseType: !198, size: 32, align: 32, offset: 704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "channel_map", scope: !201, file: !202, line: 113, baseType: !305, size: 64, align: 64, offset: 768)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "used_ch_count", scope: !201, file: !202, line: 114, baseType: !198, size: 32, align: 32, offset: 832)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !201, file: !202, line: 115, baseType: !198, size: 32, align: 32, offset: 864)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "user_in_ch_count", scope: !201, file: !202, line: 117, baseType: !198, size: 32, align: 32, offset: 896)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "user_out_ch_count", scope: !201, file: !202, line: 118, baseType: !198, size: 32, align: 32, offset: 928)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "user_used_ch_count", scope: !201, file: !202, line: 119, baseType: !198, size: 32, align: 32, offset: 960)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "user_in_ch_layout", scope: !201, file: !202, line: 120, baseType: !183, size: 64, align: 64, offset: 1024)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "user_out_ch_layout", scope: !201, file: !202, line: 121, baseType: !183, size: 64, align: 64, offset: 1088)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "user_int_sample_fmt", scope: !201, file: !202, line: 122, baseType: !46, size: 32, align: 32, offset: 1152)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "user_dither_method", scope: !201, file: !202, line: 123, baseType: !198, size: 32, align: 32, offset: 1184)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !201, file: !202, line: 125, baseType: !317, size: 91584, align: 64, offset: 1216)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DitherContext", file: !202, line: 55, size: 91584, align: 64, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327, !331, !336, !350, !351}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !317, file: !202, line: 56, baseType: !198, size: 32, align: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "noise_pos", scope: !317, file: !202, line: 57, baseType: !198, size: 32, align: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !317, file: !202, line: 58, baseType: !298, size: 32, align: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "noise_scale", scope: !317, file: !202, line: 59, baseType: !298, size: 32, align: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ns_taps", scope: !317, file: !202, line: 60, baseType: !198, size: 32, align: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ns_scale", scope: !317, file: !202, line: 61, baseType: !298, size: 32, align: 32, offset: 160)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ns_scale_1", scope: !317, file: !202, line: 62, baseType: !298, size: 32, align: 32, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ns_pos", scope: !317, file: !202, line: 63, baseType: !198, size: 32, align: 32, offset: 224)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ns_coeffs", scope: !317, file: !202, line: 64, baseType: !328, size: 640, align: 32, offset: 256)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 640, align: 32, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 20)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ns_errors", scope: !317, file: !202, line: 65, baseType: !332, size: 81920, align: 32, offset: 896)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 81920, align: 32, elements: !333)
!333 = !{!334, !335}
!334 = !DISubrange(count: 64)
!335 = !DISubrange(count: 40)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "noise", scope: !317, file: !202, line: 66, baseType: !337, size: 4352, align: 64, offset: 82816)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "AudioData", file: !202, line: 53, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AudioData", file: !202, line: 45, size: 4352, align: 64, elements: !339)
!339 = !{!340, !344, !345, !346, !347, !348, !349}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !338, file: !202, line: 46, baseType: !341, size: 4096, align: 64)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 4096, align: 64, elements: !343)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!343 = !{!334}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !338, file: !202, line: 47, baseType: !342, size: 64, align: 64, offset: 4096)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ch_count", scope: !338, file: !202, line: 48, baseType: !198, size: 32, align: 32, offset: 4160)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !338, file: !202, line: 49, baseType: !198, size: 32, align: 32, offset: 4192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !338, file: !202, line: 50, baseType: !198, size: 32, align: 32, offset: 4224)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "planar", scope: !338, file: !202, line: 51, baseType: !198, size: 32, align: 32, offset: 4256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !338, file: !202, line: 52, baseType: !46, size: 32, align: 32, offset: 4288)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !317, file: !202, line: 67, baseType: !337, size: 4352, align: 64, offset: 87168)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "output_sample_bits", scope: !317, file: !202, line: 68, baseType: !198, size: 32, align: 32, offset: 91520)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "filter_size", scope: !201, file: !202, line: 127, baseType: !198, size: 32, align: 32, offset: 92800)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "phase_shift", scope: !201, file: !202, line: 128, baseType: !198, size: 32, align: 32, offset: 92832)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "linear_interp", scope: !201, file: !202, line: 129, baseType: !198, size: 32, align: 32, offset: 92864)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "exact_rational", scope: !201, file: !202, line: 130, baseType: !198, size: 32, align: 32, offset: 92896)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !201, file: !202, line: 131, baseType: !233, size: 64, align: 64, offset: 92928)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !201, file: !202, line: 132, baseType: !198, size: 32, align: 32, offset: 92992)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "kaiser_beta", scope: !201, file: !202, line: 133, baseType: !233, size: 64, align: 64, offset: 93056)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !201, file: !202, line: 134, baseType: !233, size: 64, align: 64, offset: 93120)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "cheby", scope: !201, file: !202, line: 135, baseType: !198, size: 32, align: 32, offset: 93184)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "min_compensation", scope: !201, file: !202, line: 137, baseType: !298, size: 32, align: 32, offset: 93216)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "min_hard_compensation", scope: !201, file: !202, line: 138, baseType: !298, size: 32, align: 32, offset: 93248)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "soft_compensation_duration", scope: !201, file: !202, line: 139, baseType: !298, size: 32, align: 32, offset: 93280)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "max_soft_compensation", scope: !201, file: !202, line: 140, baseType: !298, size: 32, align: 32, offset: 93312)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "async", scope: !201, file: !202, line: 141, baseType: !298, size: 32, align: 32, offset: 93344)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "firstpts_in_samples", scope: !201, file: !202, line: 142, baseType: !183, size: 64, align: 64, offset: 93376)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "resample_first", scope: !201, file: !202, line: 144, baseType: !198, size: 32, align: 32, offset: 93440)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix", scope: !201, file: !202, line: 145, baseType: !198, size: 32, align: 32, offset: 93472)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_custom", scope: !201, file: !202, line: 146, baseType: !198, size: 32, align: 32, offset: 93504)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !201, file: !202, line: 148, baseType: !337, size: 4352, align: 64, offset: 93568)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "postin", scope: !201, file: !202, line: 149, baseType: !337, size: 4352, align: 64, offset: 97920)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "midbuf", scope: !201, file: !202, line: 150, baseType: !337, size: 4352, align: 64, offset: 102272)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "preout", scope: !201, file: !202, line: 151, baseType: !337, size: 4352, align: 64, offset: 106624)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !201, file: !202, line: 152, baseType: !337, size: 4352, align: 64, offset: 110976)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer", scope: !201, file: !202, line: 153, baseType: !337, size: 4352, align: 64, offset: 115328)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "silence", scope: !201, file: !202, line: 154, baseType: !337, size: 4352, align: 64, offset: 119680)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "drop_temp", scope: !201, file: !202, line: 155, baseType: !337, size: 4352, align: 64, offset: 124032)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer_index", scope: !201, file: !202, line: 156, baseType: !198, size: 32, align: 32, offset: 128384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer_count", scope: !201, file: !202, line: 157, baseType: !198, size: 32, align: 32, offset: 128416)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "resample_in_constraint", scope: !201, file: !202, line: 158, baseType: !198, size: 32, align: 32, offset: 128448)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flushed", scope: !201, file: !202, line: 159, baseType: !198, size: 32, align: 32, offset: 128480)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "outpts", scope: !201, file: !202, line: 160, baseType: !183, size: 64, align: 64, offset: 128512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "firstpts", scope: !201, file: !202, line: 161, baseType: !183, size: 64, align: 64, offset: 128576)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "drop_output", scope: !201, file: !202, line: 162, baseType: !198, size: 32, align: 32, offset: 128640)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_samples_fixup", scope: !201, file: !202, line: 163, baseType: !233, size: 64, align: 64, offset: 128704)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "in_convert", scope: !201, file: !202, line: 165, baseType: !387, size: 64, align: 64, offset: 128768)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "AudioConvert", file: !202, line: 165, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "out_convert", scope: !201, file: !202, line: 166, baseType: !387, size: 64, align: 64, offset: 128832)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "full_convert", scope: !201, file: !202, line: 167, baseType: !387, size: 64, align: 64, offset: 128896)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "resample", scope: !201, file: !202, line: 168, baseType: !392, size: 64, align: 64, offset: 128960)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "ResampleContext", file: !202, line: 71, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "resampler", scope: !201, file: !202, line: 169, baseType: !395, size: 64, align: 64, offset: 129024)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Resampler", file: !202, line: 81, size: 512, align: 64, elements: !398)
!398 = !{!399, !404, !410, !417, !423, !428, !433, !440}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !397, file: !202, line: 82, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_init_func", file: !202, line: 71, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!392, !392, !198, !198, !198, !198, !198, !233, !46, !63, !233, !233, !198, !198}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !397, file: !202, line: 83, baseType: !405, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_free_func", file: !202, line: 73, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "multiple_resample", scope: !397, file: !202, line: 84, baseType: !411, size: 64, align: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiple_resample_func", file: !202, line: 74, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!198, !392, !415, !198, !415, !198, !416}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !397, file: !202, line: 85, baseType: !418, size: 64, align: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_flush_func", file: !202, line: 75, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!198, !422}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "set_compensation", scope: !397, file: !202, line: 86, baseType: !424, size: 64, align: 64, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "set_compensation_func", file: !202, line: 76, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!198, !392, !198, !198}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "get_delay", scope: !397, file: !202, line: 87, baseType: !429, size: 64, align: 64, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_delay_func", file: !202, line: 77, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!183, !422, !183}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "invert_initial_buffer", scope: !397, file: !202, line: 88, baseType: !434, size: 64, align: 64, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "invert_initial_buffer_func", file: !202, line: 78, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!198, !392, !415, !438, !198, !416, !416}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !337)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "get_out_samples", scope: !397, file: !202, line: 89, baseType: !441, size: 64, align: 64, offset: 448)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_out_samples_func", file: !202, line: 79, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!183, !422, !198}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !201, file: !202, line: 171, baseType: !446, size: 262144, align: 64, offset: 129088)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 262144, align: 64, elements: !447)
!447 = !{!334, !334}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_flt", scope: !201, file: !202, line: 172, baseType: !449, size: 131072, align: 32, offset: 391232)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 131072, align: 32, elements: !447)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "native_matrix", scope: !201, file: !202, line: 173, baseType: !342, size: 64, align: 64, offset: 522304)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "native_one", scope: !201, file: !202, line: 174, baseType: !342, size: 64, align: 64, offset: 522368)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "native_simd_one", scope: !201, file: !202, line: 175, baseType: !342, size: 64, align: 64, offset: 522432)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "native_simd_matrix", scope: !201, file: !202, line: 176, baseType: !342, size: 64, align: 64, offset: 522496)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "matrix32", scope: !201, file: !202, line: 177, baseType: !455, size: 131072, align: 32, offset: 522560)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 131072, align: 32, elements: !447)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !184, line: 38, baseType: !198)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_ch", scope: !201, file: !202, line: 178, baseType: !458, size: 33280, align: 8, offset: 653632)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 33280, align: 8, elements: !459)
!459 = !{!334, !460}
!460 = !DISubrange(count: 65)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "mix_1_1_f", scope: !201, file: !202, line: 179, baseType: !462, size: 64, align: 64, offset: 686912)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_1_1_func_type", file: !202, line: 40, baseType: !464)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !218, !466, !218, !468, !468}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "integer", file: !202, line: 35, baseType: !183)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mix_1_1_simd", scope: !201, file: !202, line: 180, baseType: !462, size: 64, align: 64, offset: 686976)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "mix_2_1_f", scope: !201, file: !202, line: 182, baseType: !471, size: 64, align: 64, offset: 687040)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_2_1_func_type", file: !202, line: 41, baseType: !473)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !218, !466, !466, !218, !468, !468, !468}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mix_2_1_simd", scope: !201, file: !202, line: 183, baseType: !471, size: 64, align: 64, offset: 687104)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "mix_any_f", scope: !201, file: !202, line: 185, baseType: !477, size: 64, align: 64, offset: 687168)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_any_func_type", file: !202, line: 43, baseType: !479)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !481, !186, !218, !468}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !81, line: 646, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !81, line: 268, size: 4288, align: 64, elements: !486)
!486 = !{!487, !491, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !512, !513, !514, !515, !516, !517, !518, !519, !532, !534, !535, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !568, !569, !570, !571, !572, !573, !576, !577, !578, !579}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !485, file: !81, line: 282, baseType: !488, size: 512, align: 64)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 512, align: 64, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 8)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !485, file: !81, line: 299, baseType: !492, size: 256, align: 32, offset: 512)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 256, align: 32, elements: !489)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !485, file: !81, line: 315, baseType: !481, size: 64, align: 64, offset: 768)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !485, file: !81, line: 326, baseType: !198, size: 32, align: 32, offset: 832)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !485, file: !81, line: 326, baseType: !198, size: 32, align: 32, offset: 864)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !485, file: !81, line: 334, baseType: !198, size: 32, align: 32, offset: 896)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !485, file: !81, line: 341, baseType: !198, size: 32, align: 32, offset: 928)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !485, file: !81, line: 346, baseType: !198, size: 32, align: 32, offset: 960)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !485, file: !81, line: 351, baseType: !69, size: 32, align: 32, offset: 992)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !485, file: !81, line: 356, baseType: !236, size: 64, align: 32, offset: 1024)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !485, file: !81, line: 361, baseType: !183, size: 64, align: 64, offset: 1088)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !485, file: !81, line: 369, baseType: !183, size: 64, align: 64, offset: 1152)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !485, file: !81, line: 377, baseType: !183, size: 64, align: 64, offset: 1216)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !485, file: !81, line: 382, baseType: !198, size: 32, align: 32, offset: 1280)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !485, file: !81, line: 386, baseType: !198, size: 32, align: 32, offset: 1312)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !485, file: !81, line: 391, baseType: !198, size: 32, align: 32, offset: 1344)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !485, file: !81, line: 396, baseType: !218, size: 64, align: 64, offset: 1408)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !485, file: !81, line: 403, baseType: !509, size: 512, align: 64, offset: 1472)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 512, align: 64, elements: !489)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !184, line: 55, baseType: !511)
!511 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !485, file: !81, line: 410, baseType: !198, size: 32, align: 32, offset: 1984)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !485, file: !81, line: 415, baseType: !198, size: 32, align: 32, offset: 2016)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !485, file: !81, line: 420, baseType: !198, size: 32, align: 32, offset: 2048)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !485, file: !81, line: 425, baseType: !198, size: 32, align: 32, offset: 2080)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !485, file: !81, line: 435, baseType: !183, size: 64, align: 64, offset: 2112)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !485, file: !81, line: 440, baseType: !198, size: 32, align: 32, offset: 2176)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !485, file: !81, line: 445, baseType: !510, size: 64, align: 64, offset: 2240)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !485, file: !81, line: 459, baseType: !520, size: 512, align: 64, offset: 2304)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 512, align: 64, elements: !489)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !523, line: 94, baseType: !524)
!523 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !523, line: 81, size: 192, align: 64, elements: !525)
!525 = !{!526, !530, !531}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !524, file: !523, line: 82, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !523, line: 73, baseType: !529)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !523, line: 73, flags: DIFlagFwdDecl)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !524, file: !523, line: 89, baseType: !342, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !524, file: !523, line: 93, baseType: !198, size: 32, align: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !485, file: !81, line: 473, baseType: !533, size: 64, align: 64, offset: 2816)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !485, file: !81, line: 477, baseType: !198, size: 32, align: 32, offset: 2880)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !485, file: !81, line: 479, baseType: !536, size: 64, align: 64, offset: 2944)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !81, line: 207, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !81, line: 201, size: 320, align: 64, elements: !540)
!540 = !{!541, !542, !543, !544, !549}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !539, file: !81, line: 202, baseType: !80, size: 32, align: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !539, file: !81, line: 203, baseType: !342, size: 64, align: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !539, file: !81, line: 204, baseType: !198, size: 32, align: 32, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !539, file: !81, line: 205, baseType: !545, size: 64, align: 64, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !547, line: 86, baseType: !548)
!547 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !547, line: 86, flags: DIFlagFwdDecl)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !539, file: !81, line: 206, baseType: !521, size: 64, align: 64, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !485, file: !81, line: 480, baseType: !198, size: 32, align: 32, offset: 3008)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !485, file: !81, line: 505, baseType: !198, size: 32, align: 32, offset: 3040)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !485, file: !81, line: 512, baseType: !104, size: 32, align: 32, offset: 3072)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !485, file: !81, line: 514, baseType: !111, size: 32, align: 32, offset: 3104)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !485, file: !81, line: 516, baseType: !129, size: 32, align: 32, offset: 3136)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !485, file: !81, line: 523, baseType: !153, size: 32, align: 32, offset: 3168)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !485, file: !81, line: 525, baseType: !172, size: 32, align: 32, offset: 3200)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !485, file: !81, line: 532, baseType: !183, size: 64, align: 64, offset: 3264)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !485, file: !81, line: 539, baseType: !183, size: 64, align: 64, offset: 3328)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !485, file: !81, line: 547, baseType: !183, size: 64, align: 64, offset: 3392)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !485, file: !81, line: 554, baseType: !545, size: 64, align: 64, offset: 3456)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !485, file: !81, line: 563, baseType: !198, size: 32, align: 32, offset: 3520)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !485, file: !81, line: 572, baseType: !198, size: 32, align: 32, offset: 3552)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !485, file: !81, line: 581, baseType: !198, size: 32, align: 32, offset: 3584)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !485, file: !81, line: 588, baseType: !565, size: 64, align: 64, offset: 3648)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !184, line: 36, baseType: !567)
!567 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !485, file: !81, line: 593, baseType: !198, size: 32, align: 32, offset: 3712)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !485, file: !81, line: 596, baseType: !198, size: 32, align: 32, offset: 3744)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !485, file: !81, line: 599, baseType: !521, size: 64, align: 64, offset: 3776)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !485, file: !81, line: 605, baseType: !521, size: 64, align: 64, offset: 3840)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !485, file: !81, line: 616, baseType: !521, size: 64, align: 64, offset: 3904)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !485, file: !81, line: 626, baseType: !574, size: 64, align: 64, offset: 3968)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !575, line: 216, baseType: !511)
!575 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!576 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !485, file: !81, line: 627, baseType: !574, size: 64, align: 64, offset: 4032)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !485, file: !81, line: 628, baseType: !574, size: 64, align: 64, offset: 4096)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !485, file: !81, line: 629, baseType: !574, size: 64, align: 64, offset: 4160)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !485, file: !81, line: 645, baseType: !521, size: 64, align: 64, offset: 4224)
!580 = !{}
!581 = !DILocalVariable(name: "s", arg: 1, scope: !194, file: !195, line: 26, type: !199)
!582 = !DIExpression()
!583 = !DILocation(line: 26, column: 34, scope: !194)
!584 = !DILocalVariable(name: "out", arg: 2, scope: !194, file: !195, line: 26, type: !482)
!585 = !DILocation(line: 26, column: 52, scope: !194)
!586 = !DILocalVariable(name: "in", arg: 3, scope: !194, file: !195, line: 26, type: !482)
!587 = !DILocation(line: 26, column: 72, scope: !194)
!588 = !DILocation(line: 28, column: 15, scope: !194)
!589 = !DILocation(line: 28, column: 5, scope: !194)
!590 = !DILocation(line: 30, column: 9, scope: !591)
!591 = distinct !DILexicalBlock(scope: !194, file: !195, line: 30, column: 9)
!592 = !DILocation(line: 30, column: 9, scope: !194)
!593 = !DILocation(line: 31, column: 28, scope: !594)
!594 = distinct !DILexicalBlock(scope: !595, file: !195, line: 31, column: 13)
!595 = distinct !DILexicalBlock(scope: !591, file: !195, line: 30, column: 13)
!596 = !DILocation(line: 31, column: 38, scope: !594)
!597 = !DILocation(line: 31, column: 42, scope: !594)
!598 = !DILocation(line: 31, column: 13, scope: !594)
!599 = !DILocation(line: 31, column: 61, scope: !594)
!600 = !DILocation(line: 31, column: 13, scope: !595)
!601 = !DILocation(line: 32, column: 13, scope: !594)
!602 = !DILocation(line: 33, column: 28, scope: !603)
!603 = distinct !DILexicalBlock(scope: !595, file: !195, line: 33, column: 13)
!604 = !DILocation(line: 33, column: 38, scope: !603)
!605 = !DILocation(line: 33, column: 42, scope: !603)
!606 = !DILocation(line: 33, column: 13, scope: !603)
!607 = !DILocation(line: 33, column: 53, scope: !603)
!608 = !DILocation(line: 33, column: 13, scope: !595)
!609 = !DILocation(line: 34, column: 13, scope: !603)
!610 = !DILocation(line: 35, column: 28, scope: !611)
!611 = distinct !DILexicalBlock(scope: !595, file: !195, line: 35, column: 13)
!612 = !DILocation(line: 35, column: 38, scope: !611)
!613 = !DILocation(line: 35, column: 42, scope: !611)
!614 = !DILocation(line: 35, column: 13, scope: !611)
!615 = !DILocation(line: 35, column: 58, scope: !611)
!616 = !DILocation(line: 35, column: 13, scope: !595)
!617 = !DILocation(line: 36, column: 13, scope: !611)
!618 = !DILocation(line: 37, column: 5, scope: !595)
!619 = !DILocation(line: 39, column: 9, scope: !620)
!620 = distinct !DILexicalBlock(scope: !194, file: !195, line: 39, column: 9)
!621 = !DILocation(line: 39, column: 9, scope: !194)
!622 = !DILocation(line: 40, column: 28, scope: !623)
!623 = distinct !DILexicalBlock(scope: !624, file: !195, line: 40, column: 13)
!624 = distinct !DILexicalBlock(scope: !620, file: !195, line: 39, column: 14)
!625 = !DILocation(line: 40, column: 38, scope: !623)
!626 = !DILocation(line: 40, column: 43, scope: !623)
!627 = !DILocation(line: 40, column: 13, scope: !623)
!628 = !DILocation(line: 40, column: 62, scope: !623)
!629 = !DILocation(line: 40, column: 13, scope: !624)
!630 = !DILocation(line: 41, column: 13, scope: !623)
!631 = !DILocation(line: 42, column: 28, scope: !632)
!632 = distinct !DILexicalBlock(scope: !624, file: !195, line: 42, column: 13)
!633 = !DILocation(line: 42, column: 38, scope: !632)
!634 = !DILocation(line: 42, column: 43, scope: !632)
!635 = !DILocation(line: 42, column: 13, scope: !632)
!636 = !DILocation(line: 42, column: 54, scope: !632)
!637 = !DILocation(line: 42, column: 13, scope: !624)
!638 = !DILocation(line: 43, column: 13, scope: !632)
!639 = !DILocation(line: 44, column: 28, scope: !640)
!640 = distinct !DILexicalBlock(scope: !624, file: !195, line: 44, column: 13)
!641 = !DILocation(line: 44, column: 38, scope: !640)
!642 = !DILocation(line: 44, column: 43, scope: !640)
!643 = !DILocation(line: 44, column: 13, scope: !640)
!644 = !DILocation(line: 44, column: 59, scope: !640)
!645 = !DILocation(line: 44, column: 13, scope: !624)
