; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a/[inter]libswresample--resample.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a/[inter]libswresample--resample.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ResampleContext = type { %struct.AVClass*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, double, i32, i32, i32, i32, %struct.anon }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.anon = type { void (i8*, i8*, i32, i64, i64)*, i32 (%struct.ResampleContext*, i8*, i8*, i32, i32)*, i32 (%struct.ResampleContext*, i8*, i8*, i32, i32)* }
%struct.AudioData = type { [64 x i8*], i8*, i32, i32, i32, i32, i32 }

!31 = !DIFile(filename: "./libavutil/samplefmt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!33 = !DIEnumerator(name: "AV_SAMPLE_FMT_NONE", value: -1)
!34 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8", value: 0)
!35 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16", value: 1)
!36 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32", value: 2)
!37 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLT", value: 3)
!38 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBL", value: 4)
!39 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8P", value: 5)
!40 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16P", value: 6)
!41 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32P", value: 7)
!42 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLTP", value: 8)
!43 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBLP", value: 9)
!44 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64", value: 10)
!45 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!46 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVRounding", file: !48, line: 79, size: 32, align: 32, elements: !49)
!48 = !DIFile(filename: "./libavutil/mathematics.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "AV_ROUND_ZERO", value: 0)
!51 = !DIEnumerator(name: "AV_ROUND_INF", value: 1)
!52 = !DIEnumerator(name: "AV_ROUND_DOWN", value: 2)
!53 = !DIEnumerator(name: "AV_ROUND_UP", value: 3)
!54 = !DIEnumerator(name: "AV_ROUND_NEAR_INF", value: 5)
!55 = !DIEnumerator(name: "AV_ROUND_PASS_MINMAX", value: 8192)
!56 = !{!57, !58, !59, !62, !63, !66, !68, !70, !67}
!57 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !60, line: 197, baseType: !61)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!61 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!62 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !60, line: 195, baseType: !65)
!65 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !60, line: 196, baseType: !57)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!71 = !{!72, !355, !364, !368, !372}
!72 = distinct !DIGlobalVariable(name: "swri_resampler", scope: !0, file: !73, line: 613, type: !74, isLocal: false, isDefinition: true, variable: { %struct.ResampleContext* (%struct.ResampleContext*, i32, i32, i32, i32, i32, double, i32, i32, double, double, i32, i32)*, void (%struct.ResampleContext**)*, i32 (%struct.ResampleContext*, %struct.AudioData*, i32, %struct.AudioData*, i32, i32*)*, i32 (%struct.SwrContext*)*, i32 (%struct.ResampleContext*, i32, i32)*, i64 (%struct.SwrContext*, i64)*, i32 (%struct.ResampleContext*, %struct.AudioData*, %struct.AudioData*, i32, i32*, i32*)*, i64 (%struct.SwrContext*, i32)* }* @swri_resampler)
!73 = !DIFile(filename: "libswresample/resample.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Resampler", file: !76, line: 81, size: 512, align: 64, elements: !77)
!76 = !DIFile(filename: "libswresample/swresample_internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!77 = !{!78, !169, !175, !195, !333, !338, !343, !350}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !75, file: !76, line: 82, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_init_func", file: !76, line: 71, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !83, !57, !57, !57, !57, !57, !62, !30, !24, !62, !62, !57, !57}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ResampleContext", file: !85, line: 30, size: 1024, align: 64, elements: !86)
!85 = !DIFile(filename: "libswresample/resample.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!86 = !{!87, !131, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !84, file: !85, line: 31, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !92)
!92 = !{!93, !97, !101, !105, !106, !107, !108, !112, !118, !120, !124}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !91, file: !4, line: 72, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!96 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !91, file: !4, line: 78, baseType: !98, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!94, !58}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !91, file: !4, line: 85, baseType: !102, size: 64, align: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !91, file: !4, line: 93, baseType: !57, size: 32, align: 32, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !91, file: !4, line: 99, baseType: !57, size: 32, align: 32, offset: 224)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !91, file: !4, line: 108, baseType: !57, size: 32, align: 32, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !91, file: !4, line: 113, baseType: !109, size: 64, align: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!58, !58, !58}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !91, file: !4, line: 123, baseType: !113, size: 64, align: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!116, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !91, file: !4, line: 130, baseType: !119, size: 32, align: 32, offset: 448)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !91, file: !4, line: 136, baseType: !121, size: 64, align: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!119, !58}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !91, file: !4, line: 142, baseType: !125, size: 64, align: 64, offset: 576)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!57, !128, !58, !94, !57}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "filter_bank", scope: !84, file: !85, line: 32, baseType: !132, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !134, line: 48, baseType: !135)
!134 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!135 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "filter_length", scope: !84, file: !85, line: 33, baseType: !57, size: 32, align: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "filter_alloc", scope: !84, file: !85, line: 34, baseType: !57, size: 32, align: 32, offset: 160)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ideal_dst_incr", scope: !84, file: !85, line: 35, baseType: !57, size: 32, align: 32, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "dst_incr", scope: !84, file: !85, line: 36, baseType: !57, size: 32, align: 32, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "dst_incr_div", scope: !84, file: !85, line: 37, baseType: !57, size: 32, align: 32, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "dst_incr_mod", scope: !84, file: !85, line: 38, baseType: !57, size: 32, align: 32, offset: 288)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !84, file: !85, line: 39, baseType: !57, size: 32, align: 32, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "frac", scope: !84, file: !85, line: 40, baseType: !57, size: 32, align: 32, offset: 352)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "src_incr", scope: !84, file: !85, line: 41, baseType: !57, size: 32, align: 32, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "compensation_distance", scope: !84, file: !85, line: 42, baseType: !57, size: 32, align: 32, offset: 416)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "phase_count", scope: !84, file: !85, line: 43, baseType: !57, size: 32, align: 32, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "linear", scope: !84, file: !85, line: 44, baseType: !57, size: 32, align: 32, offset: 480)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !84, file: !85, line: 45, baseType: !24, size: 32, align: 32, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "kaiser_beta", scope: !84, file: !85, line: 46, baseType: !62, size: 64, align: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !84, file: !85, line: 47, baseType: !62, size: 64, align: 64, offset: 640)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !84, file: !85, line: 48, baseType: !30, size: 32, align: 32, offset: 704)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "felem_size", scope: !84, file: !85, line: 49, baseType: !57, size: 32, align: 32, offset: 736)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "filter_shift", scope: !84, file: !85, line: 50, baseType: !57, size: 32, align: 32, offset: 768)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "phase_count_compensation", scope: !84, file: !85, line: 51, baseType: !57, size: 32, align: 32, offset: 800)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "dsp", scope: !84, file: !85, line: 60, baseType: !156, size: 192, align: 64, offset: 832)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !85, line: 53, size: 192, align: 64, elements: !157)
!157 = !{!158, !164, !168}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "resample_one", scope: !156, file: !85, line: 54, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !58, !162, !57, !59, !59}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "resample_common", scope: !156, file: !85, line: 56, baseType: !165, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!57, !83, !58, !162, !57, !57}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "resample_linear", scope: !156, file: !85, line: 58, baseType: !165, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !75, file: !76, line: 83, baseType: !170, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_free_func", file: !76, line: 73, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "multiple_resample", scope: !75, file: !76, line: 84, baseType: !176, size: 64, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiple_resample_func", file: !76, line: 74, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!57, !83, !180, !57, !180, !57, !194}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "AudioData", file: !76, line: 53, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AudioData", file: !76, line: 45, size: 4352, align: 64, elements: !183)
!183 = !{!184, !188, !189, !190, !191, !192, !193}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !182, file: !76, line: 46, baseType: !185, size: 4096, align: 64)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 4096, align: 64, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !182, file: !76, line: 47, baseType: !132, size: 64, align: 64, offset: 4096)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ch_count", scope: !182, file: !76, line: 48, baseType: !57, size: 32, align: 32, offset: 4160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !182, file: !76, line: 49, baseType: !57, size: 32, align: 32, offset: 4192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !182, file: !76, line: 50, baseType: !57, size: 32, align: 32, offset: 4224)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "planar", scope: !182, file: !76, line: 51, baseType: !57, size: 32, align: 32, offset: 4256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !182, file: !76, line: 52, baseType: !30, size: 32, align: 32, offset: 4288)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !75, file: !76, line: 85, baseType: !196, size: 64, align: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_flush_func", file: !76, line: 75, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!57, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwrContext", file: !76, line: 95, size: 687232, align: 64, elements: !202)
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !291, !292, !293, !294, !296, !299, !301, !302, !303, !304, !305, !307, !311, !317, !318, !323, !324}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !201, file: !76, line: 96, baseType: !88, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !201, file: !76, line: 97, baseType: !57, size: 32, align: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !201, file: !76, line: 98, baseType: !58, size: 64, align: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "in_sample_fmt", scope: !201, file: !76, line: 99, baseType: !30, size: 32, align: 32, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "int_sample_fmt", scope: !201, file: !76, line: 100, baseType: !30, size: 32, align: 32, offset: 224)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "out_sample_fmt", scope: !201, file: !76, line: 101, baseType: !30, size: 32, align: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "in_ch_layout", scope: !201, file: !76, line: 102, baseType: !59, size: 64, align: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "out_ch_layout", scope: !201, file: !76, line: 103, baseType: !59, size: 64, align: 64, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "in_sample_rate", scope: !201, file: !76, line: 104, baseType: !57, size: 32, align: 32, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "out_sample_rate", scope: !201, file: !76, line: 105, baseType: !57, size: 32, align: 32, offset: 480)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !201, file: !76, line: 106, baseType: !57, size: 32, align: 32, offset: 512)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "slev", scope: !201, file: !76, line: 107, baseType: !69, size: 32, align: 32, offset: 544)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "clev", scope: !201, file: !76, line: 108, baseType: !69, size: 32, align: 32, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "lfe_mix_level", scope: !201, file: !76, line: 109, baseType: !69, size: 32, align: 32, offset: 608)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_volume", scope: !201, file: !76, line: 110, baseType: !69, size: 32, align: 32, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_maxval", scope: !201, file: !76, line: 111, baseType: !69, size: 32, align: 32, offset: 672)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_encoding", scope: !201, file: !76, line: 112, baseType: !57, size: 32, align: 32, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "channel_map", scope: !201, file: !76, line: 113, baseType: !221, size: 64, align: 64, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "used_ch_count", scope: !201, file: !76, line: 114, baseType: !57, size: 32, align: 32, offset: 832)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !201, file: !76, line: 115, baseType: !57, size: 32, align: 32, offset: 864)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "user_in_ch_count", scope: !201, file: !76, line: 117, baseType: !57, size: 32, align: 32, offset: 896)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "user_out_ch_count", scope: !201, file: !76, line: 118, baseType: !57, size: 32, align: 32, offset: 928)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "user_used_ch_count", scope: !201, file: !76, line: 119, baseType: !57, size: 32, align: 32, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "user_in_ch_layout", scope: !201, file: !76, line: 120, baseType: !59, size: 64, align: 64, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "user_out_ch_layout", scope: !201, file: !76, line: 121, baseType: !59, size: 64, align: 64, offset: 1088)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "user_int_sample_fmt", scope: !201, file: !76, line: 122, baseType: !30, size: 32, align: 32, offset: 1152)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "user_dither_method", scope: !201, file: !76, line: 123, baseType: !57, size: 32, align: 32, offset: 1184)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !201, file: !76, line: 125, baseType: !233, size: 91584, align: 64, offset: 1216)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DitherContext", file: !76, line: 55, size: 91584, align: 64, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !247, !251, !252, !253}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !233, file: !76, line: 56, baseType: !57, size: 32, align: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "noise_pos", scope: !233, file: !76, line: 57, baseType: !57, size: 32, align: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !233, file: !76, line: 58, baseType: !69, size: 32, align: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "noise_scale", scope: !233, file: !76, line: 59, baseType: !69, size: 32, align: 32, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ns_taps", scope: !233, file: !76, line: 60, baseType: !57, size: 32, align: 32, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ns_scale", scope: !233, file: !76, line: 61, baseType: !69, size: 32, align: 32, offset: 160)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ns_scale_1", scope: !233, file: !76, line: 62, baseType: !69, size: 32, align: 32, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ns_pos", scope: !233, file: !76, line: 63, baseType: !57, size: 32, align: 32, offset: 224)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ns_coeffs", scope: !233, file: !76, line: 64, baseType: !244, size: 640, align: 32, offset: 256)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 640, align: 32, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 20)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ns_errors", scope: !233, file: !76, line: 65, baseType: !248, size: 81920, align: 32, offset: 896)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 81920, align: 32, elements: !249)
!249 = !{!187, !250}
!250 = !DISubrange(count: 40)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "noise", scope: !233, file: !76, line: 66, baseType: !181, size: 4352, align: 64, offset: 82816)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !233, file: !76, line: 67, baseType: !181, size: 4352, align: 64, offset: 87168)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "output_sample_bits", scope: !233, file: !76, line: 68, baseType: !57, size: 32, align: 32, offset: 91520)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "filter_size", scope: !201, file: !76, line: 127, baseType: !57, size: 32, align: 32, offset: 92800)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "phase_shift", scope: !201, file: !76, line: 128, baseType: !57, size: 32, align: 32, offset: 92832)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "linear_interp", scope: !201, file: !76, line: 129, baseType: !57, size: 32, align: 32, offset: 92864)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "exact_rational", scope: !201, file: !76, line: 130, baseType: !57, size: 32, align: 32, offset: 92896)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !201, file: !76, line: 131, baseType: !62, size: 64, align: 64, offset: 92928)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !201, file: !76, line: 132, baseType: !57, size: 32, align: 32, offset: 92992)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "kaiser_beta", scope: !201, file: !76, line: 133, baseType: !62, size: 64, align: 64, offset: 93056)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !201, file: !76, line: 134, baseType: !62, size: 64, align: 64, offset: 93120)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "cheby", scope: !201, file: !76, line: 135, baseType: !57, size: 32, align: 32, offset: 93184)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "min_compensation", scope: !201, file: !76, line: 137, baseType: !69, size: 32, align: 32, offset: 93216)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "min_hard_compensation", scope: !201, file: !76, line: 138, baseType: !69, size: 32, align: 32, offset: 93248)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "soft_compensation_duration", scope: !201, file: !76, line: 139, baseType: !69, size: 32, align: 32, offset: 93280)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "max_soft_compensation", scope: !201, file: !76, line: 140, baseType: !69, size: 32, align: 32, offset: 93312)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "async", scope: !201, file: !76, line: 141, baseType: !69, size: 32, align: 32, offset: 93344)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "firstpts_in_samples", scope: !201, file: !76, line: 142, baseType: !59, size: 64, align: 64, offset: 93376)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "resample_first", scope: !201, file: !76, line: 144, baseType: !57, size: 32, align: 32, offset: 93440)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix", scope: !201, file: !76, line: 145, baseType: !57, size: 32, align: 32, offset: 93472)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_custom", scope: !201, file: !76, line: 146, baseType: !57, size: 32, align: 32, offset: 93504)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !201, file: !76, line: 148, baseType: !181, size: 4352, align: 64, offset: 93568)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "postin", scope: !201, file: !76, line: 149, baseType: !181, size: 4352, align: 64, offset: 97920)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "midbuf", scope: !201, file: !76, line: 150, baseType: !181, size: 4352, align: 64, offset: 102272)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "preout", scope: !201, file: !76, line: 151, baseType: !181, size: 4352, align: 64, offset: 106624)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !201, file: !76, line: 152, baseType: !181, size: 4352, align: 64, offset: 110976)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer", scope: !201, file: !76, line: 153, baseType: !181, size: 4352, align: 64, offset: 115328)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "silence", scope: !201, file: !76, line: 154, baseType: !181, size: 4352, align: 64, offset: 119680)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "drop_temp", scope: !201, file: !76, line: 155, baseType: !181, size: 4352, align: 64, offset: 124032)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer_index", scope: !201, file: !76, line: 156, baseType: !57, size: 32, align: 32, offset: 128384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer_count", scope: !201, file: !76, line: 157, baseType: !57, size: 32, align: 32, offset: 128416)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "resample_in_constraint", scope: !201, file: !76, line: 158, baseType: !57, size: 32, align: 32, offset: 128448)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flushed", scope: !201, file: !76, line: 159, baseType: !57, size: 32, align: 32, offset: 128480)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "outpts", scope: !201, file: !76, line: 160, baseType: !59, size: 64, align: 64, offset: 128512)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "firstpts", scope: !201, file: !76, line: 161, baseType: !59, size: 64, align: 64, offset: 128576)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "drop_output", scope: !201, file: !76, line: 162, baseType: !57, size: 32, align: 32, offset: 128640)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_samples_fixup", scope: !201, file: !76, line: 163, baseType: !62, size: 64, align: 64, offset: 128704)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "in_convert", scope: !201, file: !76, line: 165, baseType: !289, size: 64, align: 64, offset: 128768)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "AudioConvert", file: !76, line: 165, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "out_convert", scope: !201, file: !76, line: 166, baseType: !289, size: 64, align: 64, offset: 128832)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "full_convert", scope: !201, file: !76, line: 167, baseType: !289, size: 64, align: 64, offset: 128896)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "resample", scope: !201, file: !76, line: 168, baseType: !83, size: 64, align: 64, offset: 128960)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "resampler", scope: !201, file: !76, line: 169, baseType: !295, size: 64, align: 64, offset: 129024)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !201, file: !76, line: 171, baseType: !297, size: 262144, align: 64, offset: 129088)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 262144, align: 64, elements: !298)
!298 = !{!187, !187}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_flt", scope: !201, file: !76, line: 172, baseType: !300, size: 131072, align: 32, offset: 391232)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 131072, align: 32, elements: !298)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "native_matrix", scope: !201, file: !76, line: 173, baseType: !132, size: 64, align: 64, offset: 522304)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "native_one", scope: !201, file: !76, line: 174, baseType: !132, size: 64, align: 64, offset: 522368)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "native_simd_one", scope: !201, file: !76, line: 175, baseType: !132, size: 64, align: 64, offset: 522432)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "native_simd_matrix", scope: !201, file: !76, line: 176, baseType: !132, size: 64, align: 64, offset: 522496)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "matrix32", scope: !201, file: !76, line: 177, baseType: !306, size: 131072, align: 32, offset: 522560)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 131072, align: 32, elements: !298)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_ch", scope: !201, file: !76, line: 178, baseType: !308, size: 33280, align: 8, offset: 653632)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 33280, align: 8, elements: !309)
!309 = !{!187, !310}
!310 = !DISubrange(count: 65)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "mix_1_1_f", scope: !201, file: !76, line: 179, baseType: !312, size: 64, align: 64, offset: 686912)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_1_1_func_type", file: !76, line: 40, baseType: !314)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !58, !162, !58, !316, !316}
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "integer", file: !76, line: 35, baseType: !59)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "mix_1_1_simd", scope: !201, file: !76, line: 180, baseType: !312, size: 64, align: 64, offset: 686976)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "mix_2_1_f", scope: !201, file: !76, line: 182, baseType: !319, size: 64, align: 64, offset: 687040)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_2_1_func_type", file: !76, line: 41, baseType: !321)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !58, !162, !162, !58, !316, !316, !316}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mix_2_1_simd", scope: !201, file: !76, line: 183, baseType: !319, size: 64, align: 64, offset: 687104)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "mix_any_f", scope: !201, file: !76, line: 185, baseType: !325, size: 64, align: 64, offset: 687168)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_any_func_type", file: !76, line: 43, baseType: !327)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !329, !330, !58, !316}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "set_compensation", scope: !75, file: !76, line: 86, baseType: !334, size: 64, align: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "set_compensation_func", file: !76, line: 76, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!57, !83, !57, !57}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "get_delay", scope: !75, file: !76, line: 87, baseType: !339, size: 64, align: 64, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_delay_func", file: !76, line: 77, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!59, !200, !59}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "invert_initial_buffer", scope: !75, file: !76, line: 88, baseType: !344, size: 64, align: 64, offset: 384)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "invert_initial_buffer_func", file: !76, line: 78, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!57, !83, !180, !348, !57, !194, !194}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "get_out_samples", scope: !75, file: !76, line: 89, baseType: !351, size: 64, align: 64, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_out_samples_func", file: !76, line: 79, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!59, !200, !57}
!355 = distinct !DIGlobalVariable(name: "p1", scope: !356, file: !73, line: 76, type: !360, isLocal: true, isDefinition: true, variable: [15 x double]* @bessel.p1)
!356 = distinct !DISubprogram(name: "bessel", scope: !73, file: !73, line: 72, type: !357, isLocal: true, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !359)
!357 = !DISubroutineType(types: !358)
!358 = !{!62, !62}
!359 = !{}
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 960, align: 64, elements: !362)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!362 = !{!363}
!363 = !DISubrange(count: 15)
!364 = distinct !DIGlobalVariable(name: "q1", scope: !356, file: !73, line: 93, type: !365, isLocal: true, isDefinition: true, variable: [6 x double]* @bessel.q1)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 384, align: 64, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 6)
!368 = distinct !DIGlobalVariable(name: "p2", scope: !356, file: !73, line: 101, type: !369, isLocal: true, isDefinition: true, variable: [7 x double]* @bessel.p2)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 448, align: 64, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 7)
!372 = distinct !DIGlobalVariable(name: "q2", scope: !356, file: !73, line: 110, type: !373, isLocal: true, isDefinition: true, variable: [8 x double]* @bessel.q2)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 512, align: 64, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 8)
!376 = !{i32 2, !"Dwarf Version", i32 4}
!377 = !{i32 2, !"Debug Info Version", i32 3}
!378 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!379 = distinct !DISubprogram(name: "resample_init", scope: !73, file: !73, line: 287, type: !380, isLocal: true, isDefinition: true, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !359)
!380 = !DISubroutineType(types: !381)
!381 = !{!382, !382, !57, !57, !57, !57, !57, !62, !30, !24, !62, !62, !57, !57}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResampleContext", file: !85, line: 61, baseType: !84)
!384 = !DILocalVariable(name: "c", arg: 1, scope: !379, file: !73, line: 287, type: !382)
!385 = !DIExpression()
!386 = !DILocation(line: 287, column: 56, scope: !379)
!387 = !DILocalVariable(name: "out_rate", arg: 2, scope: !379, file: !73, line: 287, type: !57)
!388 = !DILocation(line: 287, column: 63, scope: !379)
!389 = !DILocalVariable(name: "in_rate", arg: 3, scope: !379, file: !73, line: 287, type: !57)
!390 = !DILocation(line: 287, column: 77, scope: !379)
!391 = !DILocalVariable(name: "filter_size", arg: 4, scope: !379, file: !73, line: 287, type: !57)
!392 = !DILocation(line: 287, column: 90, scope: !379)
!393 = !DILocalVariable(name: "phase_shift", arg: 5, scope: !379, file: !73, line: 287, type: !57)
!394 = !DILocation(line: 287, column: 107, scope: !379)
!395 = !DILocalVariable(name: "linear", arg: 6, scope: !379, file: !73, line: 287, type: !57)
!396 = !DILocation(line: 287, column: 124, scope: !379)
!397 = !DILocalVariable(name: "cutoff0", arg: 7, scope: !379, file: !73, line: 288, type: !62)
!398 = !DILocation(line: 288, column: 44, scope: !379)
!399 = !DILocalVariable(name: "format", arg: 8, scope: !379, file: !73, line: 288, type: !30)
!400 = !DILocation(line: 288, column: 73, scope: !379)
!401 = !DILocalVariable(name: "filter_type", arg: 9, scope: !379, file: !73, line: 288, type: !24)
