; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a/[inter]libswresample--dither.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a/[inter]libswresample--dither.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.filter_t = type { i32, i32, i64, i32, double*, i32 }
%struct.SwrContext = type { %struct.AVClass*, i32, i8*, i32, i32, i32, i64, i64, i32, i32, i32, float, float, float, float, float, i32, i32*, i32, i32, i32, i32, i32, i64, i64, i32, i32, %struct.DitherContext, i32, i32, i32, i32, double, i32, double, double, i32, float, float, float, float, float, i64, i32, i32, i32, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, %struct.AudioData, i32, i32, i32, i32, i64, i64, i32, double, %struct.AudioConvert*, %struct.AudioConvert*, %struct.AudioConvert*, %struct.ResampleContext*, %struct.Resampler*, [64 x [64 x double]], [64 x [64 x float]], i8*, i8*, i8*, i8*, [64 x [64 x i32]], [64 x [65 x i8]], void (i8*, i8*, i8*, i64, i64)*, void (i8*, i8*, i8*, i64, i64)*, void (i8*, i8*, i8*, i8*, i64, i64, i64)*, void (i8*, i8*, i8*, i8*, i64, i64, i64)*, void (i8**, i8**, i8*, i64)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !82, globals: !99)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a/[inter]libswresample--dither.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!2 = !{!3, !24, !41, !47, !62}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 29, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!6 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!7 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!8 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!9 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!10 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!11 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!12 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!13 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!14 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!15 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!16 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!17 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!18 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!19 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!20 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!21 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!22 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!23 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSampleFormat", file: !25, line: 58, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "./libavutil/samplefmt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40}
!27 = !DIEnumerator(name: "AV_SAMPLE_FMT_NONE", value: -1)
!28 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8", value: 0)
!29 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16", value: 1)
!30 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32", value: 2)
!31 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLT", value: 3)
!32 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBL", value: 4)
!33 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8P", value: 5)
!34 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16P", value: 6)
!35 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32P", value: 7)
!36 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLTP", value: 8)
!37 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBLP", value: 9)
!38 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64", value: 10)
!39 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!40 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwrFilterType", file: !42, line: 166, size: 32, align: 32, elements: !43)
!42 = !DIFile(filename: "libswresample/swresample.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!43 = !{!44, !45, !46}
!44 = !DIEnumerator(name: "SWR_FILTER_TYPE_CUBIC", value: 0)
!45 = !DIEnumerator(name: "SWR_FILTER_TYPE_BLACKMAN_NUTTALL", value: 1)
!46 = !DIEnumerator(name: "SWR_FILTER_TYPE_KAISER", value: 2)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwrDitherType", file: !42, line: 141, size: 32, align: 32, elements: !48)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61}
!49 = !DIEnumerator(name: "SWR_DITHER_NONE", value: 0)
!50 = !DIEnumerator(name: "SWR_DITHER_RECTANGULAR", value: 1)
!51 = !DIEnumerator(name: "SWR_DITHER_TRIANGULAR", value: 2)
!52 = !DIEnumerator(name: "SWR_DITHER_TRIANGULAR_HIGHPASS", value: 3)
!53 = !DIEnumerator(name: "SWR_DITHER_NS", value: 64)
!54 = !DIEnumerator(name: "SWR_DITHER_NS_LIPSHITZ", value: 65)
!55 = !DIEnumerator(name: "SWR_DITHER_NS_F_WEIGHTED", value: 66)
!56 = !DIEnumerator(name: "SWR_DITHER_NS_MODIFIED_E_WEIGHTED", value: 67)
!57 = !DIEnumerator(name: "SWR_DITHER_NS_IMPROVED_E_WEIGHTED", value: 68)
!58 = !DIEnumerator(name: "SWR_DITHER_NS_SHIBATA", value: 69)
!59 = !DIEnumerator(name: "SWR_DITHER_NS_LOW_SHIBATA", value: 70)
!60 = !DIEnumerator(name: "SWR_DITHER_NS_HIGH_SHIBATA", value: 71)
!61 = !DIEnumerator(name: "SWR_DITHER_NB", value: 72)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !64, file: !63, line: 20, size: 32, align: 32, elements: !79)
!63 = !DIFile(filename: "libswresample/noise_shaping_data.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 18, size: 320, align: 64, elements: !65)
!65 = !{!66, !68, !69, !73, !74, !78}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !64, file: !63, line: 19, baseType: !67, size: 32, align: 32)
!67 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !64, file: !63, line: 20, baseType: !62, size: 32, align: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !64, file: !63, line: 21, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 216, baseType: !72)
!71 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!72 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "gain_cB", scope: !64, file: !63, line: 22, baseType: !67, size: 32, align: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "coefs", scope: !64, file: !63, line: 23, baseType: !75, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !64, file: !63, line: 24, baseType: !47, size: 32, align: 32, offset: 256)
!79 = !{!80, !81}
!80 = !DIEnumerator(name: "fir", value: 0)
!81 = !DIEnumerator(name: "iir", value: 1)
!82 = !{!77, !83, !84, !88, !90, !92, !93, !95, !97, !75}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !86, line: 195, baseType: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!87 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !86, line: 196, baseType: !67)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!99 = !{!100, !106, !110, !114, !115, !116, !118, !122, !123, !124, !125, !126, !127, !128, !129, !130}
!100 = distinct !DIGlobalVariable(name: "filters", scope: !0, file: !63, line: 205, type: !101, isLocal: true, isDefinition: true, variable: [16 x %struct.filter_t]* @filters)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 5120, align: 64, elements: !104)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "filter_t", file: !63, line: 25, baseType: !64)
!104 = !{!105}
!105 = !DISubrange(count: 16)
!106 = distinct !DIGlobalVariable(name: "lip44", scope: !0, file: !63, line: 27, type: !107, isLocal: true, isDefinition: true, variable: [5 x double]* @lip44)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 320, align: 64, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 5)
!110 = distinct !DIGlobalVariable(name: "fwe44", scope: !0, file: !63, line: 28, type: !111, isLocal: true, isDefinition: true, variable: [9 x double]* @fwe44)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 576, align: 64, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 9)
!114 = distinct !DIGlobalVariable(name: "mew44", scope: !0, file: !63, line: 30, type: !111, isLocal: true, isDefinition: true, variable: [9 x double]* @mew44)
!115 = distinct !DIGlobalVariable(name: "iew44", scope: !0, file: !63, line: 32, type: !111, isLocal: true, isDefinition: true, variable: [9 x double]* @iew44)
!116 = distinct !DIGlobalVariable(name: "shi48", scope: !0, file: !63, line: 39, type: !117, isLocal: true, isDefinition: true, variable: [16 x double]* @shi48)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 1024, align: 64, elements: !104)
!118 = distinct !DIGlobalVariable(name: "shi44", scope: !0, file: !63, line: 47, type: !119, isLocal: true, isDefinition: true, variable: [20 x double]* @shi44)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 1280, align: 64, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 20)
!122 = distinct !DIGlobalVariable(name: "shi38", scope: !0, file: !63, line: 56, type: !117, isLocal: true, isDefinition: true, variable: [16 x double]* @shi38)
!123 = distinct !DIGlobalVariable(name: "shi32", scope: !0, file: !63, line: 64, type: !119, isLocal: true, isDefinition: true, variable: [20 x double]* @shi32)
!124 = distinct !DIGlobalVariable(name: "shi22", scope: !0, file: !63, line: 87, type: !119, isLocal: true, isDefinition: true, variable: [20 x double]* @shi22)
!125 = distinct !DIGlobalVariable(name: "shi16", scope: !0, file: !63, line: 110, type: !119, isLocal: true, isDefinition: true, variable: [20 x double]* @shi16)
!126 = distinct !DIGlobalVariable(name: "shi11", scope: !0, file: !63, line: 133, type: !119, isLocal: true, isDefinition: true, variable: [20 x double]* @shi11)
!127 = distinct !DIGlobalVariable(name: "shi08", scope: !0, file: !63, line: 156, type: !119, isLocal: true, isDefinition: true, variable: [20 x double]* @shi08)
!128 = distinct !DIGlobalVariable(name: "shl48", scope: !0, file: !63, line: 179, type: !117, isLocal: true, isDefinition: true, variable: [16 x double]* @shl48)
!129 = distinct !DIGlobalVariable(name: "shl44", scope: !0, file: !63, line: 187, type: !117, isLocal: true, isDefinition: true, variable: [16 x double]* @shl44)
!130 = distinct !DIGlobalVariable(name: "shh44", scope: !0, file: !63, line: 195, type: !119, isLocal: true, isDefinition: true, variable: [20 x double]* @shh44)
!131 = !{i32 2, !"Dwarf Version", i32 4}
!132 = !{i32 2, !"Debug Info Version", i32 3}
!133 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!134 = distinct !DISubprogram(name: "swri_get_dither", scope: !135, file: !135, line: 26, type: !136, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !387)
!135 = !DIFile(filename: "libswresample/dither.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!136 = !DISubroutineType(types: !137)
!137 = !{!67, !138, !83, !67, !386, !24}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwrContext", file: !42, line: 182, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwrContext", file: !141, line: 95, size: 687232, align: 64, elements: !142)
!141 = !DIFile(filename: "libswresample/swresample_internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!142 = !{!143, !187, !188, !189, !190, !191, !192, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !291, !292, !293, !296, !347, !350, !352, !353, !354, !355, !356, !358, !362, !370, !371, !376, !377}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !140, file: !141, line: 96, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !148)
!148 = !{!149, !153, !157, !161, !162, !163, !164, !168, !174, !176, !180}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !147, file: !4, line: 72, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !147, file: !4, line: 78, baseType: !154, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!150, !83}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !147, file: !4, line: 85, baseType: !158, size: 64, align: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !147, file: !4, line: 93, baseType: !67, size: 32, align: 32, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !147, file: !4, line: 99, baseType: !67, size: 32, align: 32, offset: 224)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !147, file: !4, line: 108, baseType: !67, size: 32, align: 32, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !147, file: !4, line: 113, baseType: !165, size: 64, align: 64, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!83, !83, !83}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !147, file: !4, line: 123, baseType: !169, size: 64, align: 64, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!172, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !147, file: !4, line: 130, baseType: !175, size: 32, align: 32, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !147, file: !4, line: 136, baseType: !177, size: 64, align: 64, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!175, !83}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !147, file: !4, line: 142, baseType: !181, size: 64, align: 64, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!67, !184, !83, !150, !67}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !140, file: !141, line: 97, baseType: !67, size: 32, align: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !140, file: !141, line: 98, baseType: !83, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "in_sample_fmt", scope: !140, file: !141, line: 99, baseType: !24, size: 32, align: 32, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "int_sample_fmt", scope: !140, file: !141, line: 100, baseType: !24, size: 32, align: 32, offset: 224)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "out_sample_fmt", scope: !140, file: !141, line: 101, baseType: !24, size: 32, align: 32, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "in_ch_layout", scope: !140, file: !141, line: 102, baseType: !193, size: 64, align: 64, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !86, line: 197, baseType: !194)
!194 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "out_ch_layout", scope: !140, file: !141, line: 103, baseType: !193, size: 64, align: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "in_sample_rate", scope: !140, file: !141, line: 104, baseType: !67, size: 32, align: 32, offset: 448)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "out_sample_rate", scope: !140, file: !141, line: 105, baseType: !67, size: 32, align: 32, offset: 480)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !140, file: !141, line: 106, baseType: !67, size: 32, align: 32, offset: 512)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "slev", scope: !140, file: !141, line: 107, baseType: !91, size: 32, align: 32, offset: 544)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "clev", scope: !140, file: !141, line: 108, baseType: !91, size: 32, align: 32, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "lfe_mix_level", scope: !140, file: !141, line: 109, baseType: !91, size: 32, align: 32, offset: 608)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_volume", scope: !140, file: !141, line: 110, baseType: !91, size: 32, align: 32, offset: 640)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_maxval", scope: !140, file: !141, line: 111, baseType: !91, size: 32, align: 32, offset: 672)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_encoding", scope: !140, file: !141, line: 112, baseType: !67, size: 32, align: 32, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "channel_map", scope: !140, file: !141, line: 113, baseType: !206, size: 64, align: 64, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "used_ch_count", scope: !140, file: !141, line: 114, baseType: !67, size: 32, align: 32, offset: 832)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !140, file: !141, line: 115, baseType: !67, size: 32, align: 32, offset: 864)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "user_in_ch_count", scope: !140, file: !141, line: 117, baseType: !67, size: 32, align: 32, offset: 896)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "user_out_ch_count", scope: !140, file: !141, line: 118, baseType: !67, size: 32, align: 32, offset: 928)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "user_used_ch_count", scope: !140, file: !141, line: 119, baseType: !67, size: 32, align: 32, offset: 960)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "user_in_ch_layout", scope: !140, file: !141, line: 120, baseType: !193, size: 64, align: 64, offset: 1024)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "user_out_ch_layout", scope: !140, file: !141, line: 121, baseType: !193, size: 64, align: 64, offset: 1088)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "user_int_sample_fmt", scope: !140, file: !141, line: 122, baseType: !24, size: 32, align: 32, offset: 1152)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "user_dither_method", scope: !140, file: !141, line: 123, baseType: !67, size: 32, align: 32, offset: 1184)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !140, file: !141, line: 125, baseType: !218, size: 91584, align: 64, offset: 1216)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DitherContext", file: !141, line: 55, size: 91584, align: 64, elements: !219)
!219 = !{!220, !221, !222, !223, !224, !225, !226, !227, !228, !230, !235, !252, !253}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !218, file: !141, line: 56, baseType: !67, size: 32, align: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "noise_pos", scope: !218, file: !141, line: 57, baseType: !67, size: 32, align: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !218, file: !141, line: 58, baseType: !91, size: 32, align: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "noise_scale", scope: !218, file: !141, line: 59, baseType: !91, size: 32, align: 32, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ns_taps", scope: !218, file: !141, line: 60, baseType: !67, size: 32, align: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ns_scale", scope: !218, file: !141, line: 61, baseType: !91, size: 32, align: 32, offset: 160)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ns_scale_1", scope: !218, file: !141, line: 62, baseType: !91, size: 32, align: 32, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ns_pos", scope: !218, file: !141, line: 63, baseType: !67, size: 32, align: 32, offset: 224)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ns_coeffs", scope: !218, file: !141, line: 64, baseType: !229, size: 640, align: 32, offset: 256)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 640, align: 32, elements: !120)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ns_errors", scope: !218, file: !141, line: 65, baseType: !231, size: 81920, align: 32, offset: 896)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 81920, align: 32, elements: !232)
!232 = !{!233, !234}
!233 = !DISubrange(count: 64)
!234 = !DISubrange(count: 40)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "noise", scope: !218, file: !141, line: 66, baseType: !236, size: 4352, align: 64, offset: 82816)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "AudioData", file: !141, line: 53, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AudioData", file: !141, line: 45, size: 4352, align: 64, elements: !238)
!238 = !{!239, !246, !247, !248, !249, !250, !251}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !237, file: !141, line: 46, baseType: !240, size: 4096, align: 64)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 4096, align: 64, elements: !245)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !243, line: 48, baseType: !244)
!243 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswresample--libswresample.a")
!244 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!245 = !{!233}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !237, file: !141, line: 47, baseType: !241, size: 64, align: 64, offset: 4096)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ch_count", scope: !237, file: !141, line: 48, baseType: !67, size: 32, align: 32, offset: 4160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !237, file: !141, line: 49, baseType: !67, size: 32, align: 32, offset: 4192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !237, file: !141, line: 50, baseType: !67, size: 32, align: 32, offset: 4224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "planar", scope: !237, file: !141, line: 51, baseType: !67, size: 32, align: 32, offset: 4256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !237, file: !141, line: 52, baseType: !24, size: 32, align: 32, offset: 4288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !218, file: !141, line: 67, baseType: !236, size: 4352, align: 64, offset: 87168)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "output_sample_bits", scope: !218, file: !141, line: 68, baseType: !67, size: 32, align: 32, offset: 91520)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "filter_size", scope: !140, file: !141, line: 127, baseType: !67, size: 32, align: 32, offset: 92800)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "phase_shift", scope: !140, file: !141, line: 128, baseType: !67, size: 32, align: 32, offset: 92832)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "linear_interp", scope: !140, file: !141, line: 129, baseType: !67, size: 32, align: 32, offset: 92864)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "exact_rational", scope: !140, file: !141, line: 130, baseType: !67, size: 32, align: 32, offset: 92896)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !140, file: !141, line: 131, baseType: !77, size: 64, align: 64, offset: 92928)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !140, file: !141, line: 132, baseType: !67, size: 32, align: 32, offset: 92992)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "kaiser_beta", scope: !140, file: !141, line: 133, baseType: !77, size: 64, align: 64, offset: 93056)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !140, file: !141, line: 134, baseType: !77, size: 64, align: 64, offset: 93120)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "cheby", scope: !140, file: !141, line: 135, baseType: !67, size: 32, align: 32, offset: 93184)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "min_compensation", scope: !140, file: !141, line: 137, baseType: !91, size: 32, align: 32, offset: 93216)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "min_hard_compensation", scope: !140, file: !141, line: 138, baseType: !91, size: 32, align: 32, offset: 93248)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "soft_compensation_duration", scope: !140, file: !141, line: 139, baseType: !91, size: 32, align: 32, offset: 93280)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "max_soft_compensation", scope: !140, file: !141, line: 140, baseType: !91, size: 32, align: 32, offset: 93312)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "async", scope: !140, file: !141, line: 141, baseType: !91, size: 32, align: 32, offset: 93344)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "firstpts_in_samples", scope: !140, file: !141, line: 142, baseType: !193, size: 64, align: 64, offset: 93376)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "resample_first", scope: !140, file: !141, line: 144, baseType: !67, size: 32, align: 32, offset: 93440)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix", scope: !140, file: !141, line: 145, baseType: !67, size: 32, align: 32, offset: 93472)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_custom", scope: !140, file: !141, line: 146, baseType: !67, size: 32, align: 32, offset: 93504)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !140, file: !141, line: 148, baseType: !236, size: 4352, align: 64, offset: 93568)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "postin", scope: !140, file: !141, line: 149, baseType: !236, size: 4352, align: 64, offset: 97920)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "midbuf", scope: !140, file: !141, line: 150, baseType: !236, size: 4352, align: 64, offset: 102272)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "preout", scope: !140, file: !141, line: 151, baseType: !236, size: 4352, align: 64, offset: 106624)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !140, file: !141, line: 152, baseType: !236, size: 4352, align: 64, offset: 110976)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer", scope: !140, file: !141, line: 153, baseType: !236, size: 4352, align: 64, offset: 115328)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "silence", scope: !140, file: !141, line: 154, baseType: !236, size: 4352, align: 64, offset: 119680)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "drop_temp", scope: !140, file: !141, line: 155, baseType: !236, size: 4352, align: 64, offset: 124032)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer_index", scope: !140, file: !141, line: 156, baseType: !67, size: 32, align: 32, offset: 128384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer_count", scope: !140, file: !141, line: 157, baseType: !67, size: 32, align: 32, offset: 128416)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "resample_in_constraint", scope: !140, file: !141, line: 158, baseType: !67, size: 32, align: 32, offset: 128448)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flushed", scope: !140, file: !141, line: 159, baseType: !67, size: 32, align: 32, offset: 128480)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "outpts", scope: !140, file: !141, line: 160, baseType: !193, size: 64, align: 64, offset: 128512)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "firstpts", scope: !140, file: !141, line: 161, baseType: !193, size: 64, align: 64, offset: 128576)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "drop_output", scope: !140, file: !141, line: 162, baseType: !67, size: 32, align: 32, offset: 128640)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_samples_fixup", scope: !140, file: !141, line: 163, baseType: !77, size: 64, align: 64, offset: 128704)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "in_convert", scope: !140, file: !141, line: 165, baseType: !289, size: 64, align: 64, offset: 128768)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "AudioConvert", file: !141, line: 165, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "out_convert", scope: !140, file: !141, line: 166, baseType: !289, size: 64, align: 64, offset: 128832)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "full_convert", scope: !140, file: !141, line: 167, baseType: !289, size: 64, align: 64, offset: 128896)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "resample", scope: !140, file: !141, line: 168, baseType: !294, size: 64, align: 64, offset: 128960)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "ResampleContext", file: !141, line: 71, flags: DIFlagFwdDecl)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "resampler", scope: !140, file: !141, line: 169, baseType: !297, size: 64, align: 64, offset: 129024)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Resampler", file: !141, line: 81, size: 512, align: 64, elements: !300)
!300 = !{!301, !306, !312, !319, !325, !330, !335, !342}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !299, file: !141, line: 82, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_init_func", file: !141, line: 71, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!294, !294, !67, !67, !67, !67, !67, !77, !24, !41, !77, !77, !67, !67}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !299, file: !141, line: 83, baseType: !307, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_free_func", file: !141, line: 73, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !311}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "multiple_resample", scope: !299, file: !141, line: 84, baseType: !313, size: 64, align: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiple_resample_func", file: !141, line: 74, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!67, !294, !317, !67, !317, !67, !318}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !299, file: !141, line: 85, baseType: !320, size: 64, align: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_flush_func", file: !141, line: 75, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!67, !324}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "set_compensation", scope: !299, file: !141, line: 86, baseType: !326, size: 64, align: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "set_compensation_func", file: !141, line: 76, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!67, !294, !67, !67}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "get_delay", scope: !299, file: !141, line: 87, baseType: !331, size: 64, align: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_delay_func", file: !141, line: 77, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!193, !324, !193}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "invert_initial_buffer", scope: !299, file: !141, line: 88, baseType: !336, size: 64, align: 64, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "invert_initial_buffer_func", file: !141, line: 78, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!67, !294, !317, !340, !67, !318, !318}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "get_out_samples", scope: !299, file: !141, line: 89, baseType: !343, size: 64, align: 64, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_out_samples_func", file: !141, line: 79, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!193, !324, !67}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !140, file: !141, line: 171, baseType: !348, size: 262144, align: 64, offset: 129088)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 262144, align: 64, elements: !349)
!349 = !{!233, !233}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_flt", scope: !140, file: !141, line: 172, baseType: !351, size: 131072, align: 32, offset: 391232)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 131072, align: 32, elements: !349)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "native_matrix", scope: !140, file: !141, line: 173, baseType: !241, size: 64, align: 64, offset: 522304)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "native_one", scope: !140, file: !141, line: 174, baseType: !241, size: 64, align: 64, offset: 522368)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "native_simd_one", scope: !140, file: !141, line: 175, baseType: !241, size: 64, align: 64, offset: 522432)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "native_simd_matrix", scope: !140, file: !141, line: 176, baseType: !241, size: 64, align: 64, offset: 522496)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "matrix32", scope: !140, file: !141, line: 177, baseType: !357, size: 131072, align: 32, offset: 522560)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 131072, align: 32, elements: !349)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_ch", scope: !140, file: !141, line: 178, baseType: !359, size: 33280, align: 8, offset: 653632)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 33280, align: 8, elements: !360)
!360 = !{!233, !361}
!361 = !DISubrange(count: 65)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "mix_1_1_f", scope: !140, file: !141, line: 179, baseType: !363, size: 64, align: 64, offset: 686912)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_1_1_func_type", file: !141, line: 40, baseType: !365)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !83, !367, !83, !369, !369}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "integer", file: !141, line: 35, baseType: !193)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mix_1_1_simd", scope: !140, file: !141, line: 180, baseType: !363, size: 64, align: 64, offset: 686976)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mix_2_1_f", scope: !140, file: !141, line: 182, baseType: !372, size: 64, align: 64, offset: 687040)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_2_1_func_type", file: !141, line: 41, baseType: !374)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !83, !367, !367, !83, !369, !369, !369}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "mix_2_1_simd", scope: !140, file: !141, line: 183, baseType: !372, size: 64, align: 64, offset: 687104)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mix_any_f", scope: !140, file: !141, line: 185, baseType: !378, size: 64, align: 64, offset: 687168)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_any_func_type", file: !141, line: 43, baseType: !380)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !382, !383, !83, !369}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!386 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!387 = !{}
!388 = !DILocalVariable(name: "s", arg: 1, scope: !134, file: !135, line: 26, type: !138)
!389 = !DIExpression()
!390 = !DILocation(line: 26, column: 33, scope: !134)
!391 = !DILocalVariable(name: "dst", arg: 2, scope: !134, file: !135, line: 26, type: !83)
!392 = !DILocation(line: 26, column: 42, scope: !134)
!393 = !DILocalVariable(name: "len", arg: 3, scope: !134, file: !135, line: 26, type: !67)
!394 = !DILocation(line: 26, column: 51, scope: !134)
!395 = !DILocalVariable(name: "seed", arg: 4, scope: !134, file: !135, line: 26, type: !386)
!396 = !DILocation(line: 26, column: 65, scope: !134)
!397 = !DILocalVariable(name: "noise_fmt", arg: 5, scope: !134, file: !135, line: 26, type: !24)
!398 = !DILocation(line: 26, column: 91, scope: !134)
!399 = !DILocalVariable(name: "scale", scope: !134, file: !135, line: 27, type: !77)
!400 = !DILocation(line: 27, column: 12, scope: !134)
!401 = !DILocation(line: 27, column: 20, scope: !134)
!402 = !DILocation(line: 27, column: 23, scope: !134)
!403 = !DILocation(line: 27, column: 30, scope: !134)
!404 = !DILocalVariable(name: "tmp", scope: !134, file: !135, line: 29, type: !92)
!405 = !DILocation(line: 29, column: 13, scope: !134)
!406 = !DILocation(line: 29, column: 35, scope: !134)
!407 = !DILocation(line: 29, column: 39, scope: !134)
!408 = !DILocation(line: 29, column: 19, scope: !134)
!409 = !DILocalVariable(name: "i", scope: !134, file: !135, line: 30, type: !67)
!410 = !DILocation(line: 30, column: 9, scope: !134)
!411 = !DILocation(line: 32, column: 10, scope: !412)
!412 = distinct !DILexicalBlock(scope: !134, file: !135, line: 32, column: 9)
!413 = !DILocation(line: 32, column: 9, scope: !134)
!414 = !DILocation(line: 33, column: 9, scope: !412)
!415 = !DILocation(line: 35, column: 10, scope: !416)
!416 = distinct !DILexicalBlock(scope: !134, file: !135, line: 35, column: 5)
!417 = !DILocation(line: 35, column: 9, scope: !416)
!418 = !DILocation(line: 35, column: 14, scope: !419)
!419 = !DILexicalBlockFile(scope: !420, file: !135, discriminator: 1)
!420 = distinct !DILexicalBlock(scope: !416, file: !135, line: 35, column: 5)
!421 = !DILocation(line: 35, column: 16, scope: !419)
!422 = !DILocation(line: 35, column: 20, scope: !419)
!423 = !DILocation(line: 35, column: 15, scope: !419)
!424 = !DILocation(line: 35, column: 5, scope: !419)
!425 = !DILocalVariable(name: "v", scope: !426, file: !135, line: 36, type: !77)
!426 = distinct !DILexicalBlock(scope: !420, file: !135, line: 35, column: 29)
!427 = !DILocation(line: 36, column: 16, scope: !426)
!428 = !DILocation(line: 37, column: 16, scope: !426)
!429 = !DILocation(line: 37, column: 20, scope: !426)
!430 = !DILocation(line: 37, column: 30, scope: !426)
!431 = !DILocation(line: 37, column: 14, scope: !426)
!432 = !DILocation(line: 39, column: 16, scope: !426)
!433 = !DILocation(line: 39, column: 19, scope: !426)
!434 = !DILocation(line: 39, column: 26, scope: !426)
!435 = !DILocation(line: 39, column: 9, scope: !426)
!436 = !DILocation(line: 40, column: 54, scope: !437)
!437 = distinct !DILexicalBlock(scope: !426, file: !135, line: 39, column: 33)
!438 = !DILocation(line: 40, column: 46, scope: !437)
