; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g/[inter]fftools--ffmpeg_hw.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g/[inter]fftools--ffmpeg_hw.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.HWDevice = type { i8*, i32, %struct.AVBufferRef* }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque
%struct.AVDictionary = type opaque
%struct.InputStream = type { i32, %struct.AVStream*, i32, i32, i32, %struct.AVCodecContext*, %struct.AVCodec*, %struct.AVFrame*, %struct.AVFrame*, i64, i64, i64, i64, i64, i32, i64, i64, i64, i64, i64, double, i32, %struct.AVDictionary*, %struct.AVRational, i32, i32, i32, i32, %struct.anon.0, %struct.sub2video, i32, %struct.InputFilter**, i32, i32, i32, i32, i8*, i32, i8*, void (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*, i32)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32, i32, %struct.AVBufferRef*, i64, i64, i64, i64, i64*, i32, i32 }

!862 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !509, line: 538, size: 32, align: 32, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871}
!864 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!867 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!868 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!869 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!870 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!871 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !49, line: 1534, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879}
!874 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!875 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!876 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!877 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!878 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!879 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!880 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !49, line: 810, size: 32, align: 32, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887, !888, !889, !890, !891}
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!892 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !49, line: 798, size: 32, align: 32, elements: !893)
!893 = !{!894, !895, !896, !897, !898, !899, !900}
!894 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!895 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!896 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!897 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!898 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!899 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!900 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!901 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !902, line: 782, size: 32, align: 32, elements: !903)
!902 = !DIFile(filename: "./libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!903 = !{!904, !905, !906, !907, !908, !909}
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!905 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!906 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!907 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!908 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!909 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!910 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !49, line: 5085, size: 32, align: 32, elements: !911)
!911 = !{!912, !913, !914, !915}
!912 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!913 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!914 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!915 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !918, file: !917, line: 503, size: 32, align: 32, elements: !1232)
!917 = !DIFile(filename: "./libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !917, line: 439, size: 493504, align: 64, elements: !919)
!919 = !{!920, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1110, !1113, !1114, !1115, !1116, !1120, !1121, !1122, !1123, !1126, !1127, !1128, !1129, !1130, !1133, !1134, !1135, !1136, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !918, file: !917, line: 440, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !917, line: 67, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !917, line: 338, size: 1344, align: 64, elements: !924)
!924 = !{!925, !971, !1020, !1021, !1023, !1027, !1029, !1030, !1031, !1032, !1033, !1064, !1065, !1069, !1072, !1073, !1074, !1077, !1078, !1094, !1095, !1096}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !923, file: !917, line: 339, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !18, line: 143, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !18, line: 67, size: 640, align: 64, elements: !930)
!930 = !{!931, !935, !940, !944, !946, !947, !948, !952, !958, !960, !964}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !929, file: !18, line: 72, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !929, file: !18, line: 78, baseType: !936, size: 64, align: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!932, !939}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !929, file: !18, line: 85, baseType: !941, size: 64, align: 64, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !18, line: 85, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !929, file: !18, line: 93, baseType: !945, size: 32, align: 32, offset: 192)
!945 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !929, file: !18, line: 99, baseType: !945, size: 32, align: 32, offset: 224)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !929, file: !18, line: 108, baseType: !945, size: 32, align: 32, offset: 256)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !929, file: !18, line: 113, baseType: !949, size: 64, align: 64, offset: 320)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!939, !939, !939}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !929, file: !18, line: 123, baseType: !953, size: 64, align: 64, offset: 384)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!956, !956}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !929, file: !18, line: 130, baseType: !959, size: 32, align: 32, offset: 448)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !18, line: 48, baseType: !17)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !929, file: !18, line: 136, baseType: !961, size: 64, align: 64, offset: 512)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!959, !939}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !929, file: !18, line: 142, baseType: !965, size: 64, align: 64, offset: 576)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!945, !968, !939, !932, !945}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !18, line: 60, flags: DIFlagFwdDecl)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !923, file: !917, line: 341, baseType: !972, size: 64, align: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !917, line: 328, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !917, line: 144, size: 1024, align: 64, elements: !976)
!976 = !{!977, !978, !979, !984, !985, !986, !987, !991, !992, !1001, !1005, !1006, !1007, !1008, !1010, !1015, !1019}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !975, file: !917, line: 148, baseType: !932, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !975, file: !917, line: 155, baseType: !932, size: 64, align: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !975, file: !917, line: 164, baseType: !980, size: 64, align: 64, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !917, line: 69, baseType: !983)
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !917, line: 69, flags: DIFlagFwdDecl)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !975, file: !917, line: 172, baseType: !980, size: 64, align: 64, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !975, file: !917, line: 182, baseType: !926, size: 64, align: 64, offset: 256)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !975, file: !917, line: 187, baseType: !945, size: 32, align: 32, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !975, file: !917, line: 210, baseType: !988, size: 64, align: 64, offset: 384)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!945, !921}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !975, file: !917, line: 233, baseType: !988, size: 64, align: 64, offset: 448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !975, file: !917, line: 246, baseType: !993, size: 64, align: 64, offset: 512)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!945, !921, !996}
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !999, line: 86, baseType: !1000)
!999 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !999, line: 86, flags: DIFlagFwdDecl)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !975, file: !917, line: 258, baseType: !1002, size: 64, align: 64, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{null, !921}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !975, file: !917, line: 282, baseType: !988, size: 64, align: 64, offset: 640)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !975, file: !917, line: 284, baseType: !945, size: 32, align: 32, offset: 704)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !975, file: !917, line: 286, baseType: !945, size: 32, align: 32, offset: 736)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !975, file: !917, line: 292, baseType: !1009, size: 64, align: 64, offset: 768)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !975, file: !917, line: 306, baseType: !1011, size: 64, align: 64, offset: 832)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!945, !921, !932, !932, !1014, !945, !945}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !975, file: !917, line: 313, baseType: !1016, size: 64, align: 64, offset: 896)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!945, !921, !939}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !975, file: !917, line: 327, baseType: !988, size: 64, align: 64, offset: 960)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !923, file: !917, line: 343, baseType: !1014, size: 64, align: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !923, file: !917, line: 345, baseType: !1022, size: 64, align: 64, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !923, file: !917, line: 346, baseType: !1024, size: 64, align: 64, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !917, line: 68, baseType: !918)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !923, file: !917, line: 347, baseType: !1028, size: 32, align: 32, offset: 320)
!1028 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !923, file: !917, line: 349, baseType: !1022, size: 64, align: 64, offset: 384)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !923, file: !917, line: 350, baseType: !1024, size: 64, align: 64, offset: 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !923, file: !917, line: 351, baseType: !1028, size: 32, align: 32, offset: 512)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !923, file: !917, line: 353, baseType: !939, size: 64, align: 64, offset: 576)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !923, file: !917, line: 355, baseType: !1034, size: 64, align: 64, offset: 640)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !917, line: 840, size: 768, align: 64, elements: !1036)
!1036 = !{!1037, !1038, !1040, !1041, !1042, !1043, !1044, !1045, !1049, !1050, !1060, !1061, !1062, !1063}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1035, file: !917, line: 841, baseType: !926, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !1035, file: !917, line: 842, baseType: !1039, size: 64, align: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !1035, file: !917, line: 843, baseType: !1028, size: 32, align: 32, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !1035, file: !917, line: 845, baseType: !1014, size: 64, align: 64, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !1035, file: !917, line: 847, baseType: !1014, size: 64, align: 64, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1035, file: !917, line: 862, baseType: !945, size: 32, align: 32, offset: 320)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !1035, file: !917, line: 869, baseType: !945, size: 32, align: 32, offset: 352)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1035, file: !917, line: 874, baseType: !1046, size: 64, align: 64, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !917, line: 809, baseType: !1048)
!1048 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !917, line: 809, flags: DIFlagFwdDecl)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1035, file: !917, line: 881, baseType: !939, size: 64, align: 64, offset: 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1035, file: !917, line: 895, baseType: !1051, size: 64, align: 64, offset: 512)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !917, line: 837, baseType: !1053)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!945, !921, !1055, !939, !1059, !945}
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !917, line: 823, baseType: !1057)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!945, !921, !939, !945, !945}
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !1035, file: !917, line: 897, baseType: !1014, size: 64, align: 64, offset: 576)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !1035, file: !917, line: 906, baseType: !1024, size: 64, align: 64, offset: 640)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !1035, file: !917, line: 907, baseType: !945, size: 32, align: 32, offset: 704)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !1035, file: !917, line: 909, baseType: !1028, size: 32, align: 32, offset: 736)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !923, file: !917, line: 373, baseType: !945, size: 32, align: 32, offset: 704)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !923, file: !917, line: 378, baseType: !1066, size: 64, align: 64, offset: 768)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !917, line: 335, baseType: !1068)
!1068 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !917, line: 335, flags: DIFlagFwdDecl)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !923, file: !917, line: 380, baseType: !1070, size: 64, align: 64, offset: 832)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !917, line: 380, flags: DIFlagFwdDecl)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !923, file: !917, line: 382, baseType: !1014, size: 64, align: 64, offset: 896)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !923, file: !917, line: 383, baseType: !939, size: 64, align: 64, offset: 960)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !923, file: !917, line: 384, baseType: !1075, size: 64, align: 64, offset: 1024)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !923, file: !917, line: 385, baseType: !945, size: 32, align: 32, offset: 1088)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !923, file: !917, line: 394, baseType: !1079, size: 64, align: 64, offset: 1152)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1081, line: 94, baseType: !1082)
!1081 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1081, line: 81, size: 192, align: 64, elements: !1083)
!1083 = !{!1084, !1088, !1093}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1082, file: !1081, line: 82, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1081, line: 73, baseType: !1087)
!1087 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1081, line: 73, flags: DIFlagFwdDecl)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1082, file: !1081, line: 89, baseType: !1089, size: 64, align: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1091, line: 48, baseType: !1092)
!1091 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!1092 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1082, file: !1081, line: 93, baseType: !945, size: 32, align: 32, offset: 128)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !923, file: !917, line: 401, baseType: !945, size: 32, align: 32, offset: 1216)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !923, file: !917, line: 408, baseType: !1028, size: 32, align: 32, offset: 1248)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !923, file: !917, line: 424, baseType: !945, size: 32, align: 32, offset: 1280)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !918, file: !917, line: 441, baseType: !1022, size: 64, align: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !918, file: !917, line: 443, baseType: !921, size: 64, align: 64, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !918, file: !917, line: 444, baseType: !1022, size: 64, align: 64, offset: 192)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !918, file: !917, line: 446, baseType: !38, size: 32, align: 32, offset: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !918, file: !917, line: 449, baseType: !945, size: 32, align: 32, offset: 288)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !918, file: !917, line: 450, baseType: !945, size: 32, align: 32, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !918, file: !917, line: 451, baseType: !1104, size: 64, align: 32, offset: 352)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1105, line: 61, baseType: !1106)
!1105 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1105, line: 58, size: 64, align: 32, elements: !1107)
!1107 = !{!1108, !1109}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1106, file: !1105, line: 59, baseType: !945, size: 32, align: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1106, file: !1105, line: 60, baseType: !945, size: 32, align: 32, offset: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !918, file: !917, line: 453, baseType: !1111, size: 64, align: 64, offset: 448)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1091, line: 55, baseType: !1112)
!1112 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !918, file: !917, line: 454, baseType: !945, size: 32, align: 32, offset: 512)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !918, file: !917, line: 456, baseType: !945, size: 32, align: 32, offset: 544)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !918, file: !917, line: 465, baseType: !1104, size: 64, align: 32, offset: 576)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !918, file: !917, line: 481, baseType: !1117, size: 64, align: 64, offset: 640)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !917, line: 70, baseType: !1119)
!1119 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !917, line: 70, flags: DIFlagFwdDecl)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !918, file: !917, line: 482, baseType: !1117, size: 64, align: 64, offset: 704)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !918, file: !917, line: 488, baseType: !1117, size: 64, align: 64, offset: 768)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !918, file: !917, line: 489, baseType: !1117, size: 64, align: 64, offset: 832)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !918, file: !917, line: 490, baseType: !1124, size: 64, align: 64, offset: 896)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !917, line: 490, flags: DIFlagFwdDecl)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !918, file: !917, line: 491, baseType: !1124, size: 64, align: 64, offset: 960)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !918, file: !917, line: 500, baseType: !945, size: 32, align: 32, offset: 1024)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !918, file: !917, line: 507, baseType: !916, size: 32, align: 32, offset: 1056)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !918, file: !917, line: 512, baseType: !1034, size: 64, align: 64, offset: 1088)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !918, file: !917, line: 518, baseType: !1131, size: 64, align: 64, offset: 1152)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1091, line: 40, baseType: !1132)
!1132 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !918, file: !917, line: 524, baseType: !1131, size: 64, align: 64, offset: 1216)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !918, file: !917, line: 529, baseType: !945, size: 32, align: 32, offset: 1280)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !918, file: !917, line: 542, baseType: !1104, size: 64, align: 32, offset: 1312)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !918, file: !917, line: 547, baseType: !1137, size: 64, align: 64, offset: 1408)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !772, line: 646, baseType: !1139)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !772, line: 268, size: 4288, align: 64, elements: !1140)
!1140 = !{!1141, !1145, !1147, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1174, !1176, !1177, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1206, !1207, !1208, !1209, !1210, !1211, !1214, !1215, !1216, !1217}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1139, file: !772, line: 282, baseType: !1142, size: 512, align: 64)
!1142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1089, size: 512, align: 64, elements: !1143)
!1143 = !{!1144}
!1144 = !DISubrange(count: 8)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1139, file: !772, line: 299, baseType: !1146, size: 256, align: 32, offset: 512)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 256, align: 32, elements: !1143)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1139, file: !772, line: 315, baseType: !1148, size: 64, align: 64, offset: 768)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1139, file: !772, line: 326, baseType: !945, size: 32, align: 32, offset: 832)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1139, file: !772, line: 326, baseType: !945, size: 32, align: 32, offset: 864)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1139, file: !772, line: 334, baseType: !945, size: 32, align: 32, offset: 896)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1139, file: !772, line: 341, baseType: !945, size: 32, align: 32, offset: 928)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1139, file: !772, line: 346, baseType: !945, size: 32, align: 32, offset: 960)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1139, file: !772, line: 351, baseType: !761, size: 32, align: 32, offset: 992)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1139, file: !772, line: 356, baseType: !1104, size: 64, align: 32, offset: 1024)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1139, file: !772, line: 361, baseType: !1131, size: 64, align: 64, offset: 1088)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1139, file: !772, line: 369, baseType: !1131, size: 64, align: 64, offset: 1152)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1139, file: !772, line: 377, baseType: !1131, size: 64, align: 64, offset: 1216)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1139, file: !772, line: 382, baseType: !945, size: 32, align: 32, offset: 1280)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1139, file: !772, line: 386, baseType: !945, size: 32, align: 32, offset: 1312)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1139, file: !772, line: 391, baseType: !945, size: 32, align: 32, offset: 1344)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1139, file: !772, line: 396, baseType: !939, size: 64, align: 64, offset: 1408)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1139, file: !772, line: 403, baseType: !1164, size: 512, align: 64, offset: 1472)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1111, size: 512, align: 64, elements: !1143)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1139, file: !772, line: 410, baseType: !945, size: 32, align: 32, offset: 1984)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1139, file: !772, line: 415, baseType: !945, size: 32, align: 32, offset: 2016)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1139, file: !772, line: 420, baseType: !945, size: 32, align: 32, offset: 2048)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1139, file: !772, line: 425, baseType: !945, size: 32, align: 32, offset: 2080)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1139, file: !772, line: 435, baseType: !1131, size: 64, align: 64, offset: 2112)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1139, file: !772, line: 440, baseType: !945, size: 32, align: 32, offset: 2176)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1139, file: !772, line: 445, baseType: !1111, size: 64, align: 64, offset: 2240)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1139, file: !772, line: 459, baseType: !1173, size: 512, align: 64, offset: 2304)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1079, size: 512, align: 64, elements: !1143)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1139, file: !772, line: 473, baseType: !1175, size: 64, align: 64, offset: 2816)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1139, file: !772, line: 477, baseType: !945, size: 32, align: 32, offset: 2880)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1139, file: !772, line: 479, baseType: !1178, size: 64, align: 64, offset: 2944)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !772, line: 207, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !772, line: 201, size: 320, align: 64, elements: !1182)
!1182 = !{!1183, !1184, !1185, !1186, !1187}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1181, file: !772, line: 202, baseType: !771, size: 32, align: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1181, file: !772, line: 203, baseType: !1089, size: 64, align: 64, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1181, file: !772, line: 204, baseType: !945, size: 32, align: 32, offset: 128)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1181, file: !772, line: 205, baseType: !997, size: 64, align: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1181, file: !772, line: 206, baseType: !1079, size: 64, align: 64, offset: 256)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1139, file: !772, line: 480, baseType: !945, size: 32, align: 32, offset: 3008)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1139, file: !772, line: 505, baseType: !945, size: 32, align: 32, offset: 3040)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1139, file: !772, line: 512, baseType: !795, size: 32, align: 32, offset: 3072)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1139, file: !772, line: 514, baseType: !801, size: 32, align: 32, offset: 3104)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1139, file: !772, line: 516, baseType: !819, size: 32, align: 32, offset: 3136)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1139, file: !772, line: 523, baseType: !843, size: 32, align: 32, offset: 3168)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1139, file: !772, line: 525, baseType: !862, size: 32, align: 32, offset: 3200)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1139, file: !772, line: 532, baseType: !1131, size: 64, align: 64, offset: 3264)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1139, file: !772, line: 539, baseType: !1131, size: 64, align: 64, offset: 3328)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1139, file: !772, line: 547, baseType: !1131, size: 64, align: 64, offset: 3392)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1139, file: !772, line: 554, baseType: !997, size: 64, align: 64, offset: 3456)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1139, file: !772, line: 563, baseType: !945, size: 32, align: 32, offset: 3520)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1139, file: !772, line: 572, baseType: !945, size: 32, align: 32, offset: 3552)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1139, file: !772, line: 581, baseType: !945, size: 32, align: 32, offset: 3584)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1139, file: !772, line: 588, baseType: !1203, size: 64, align: 64, offset: 3648)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1091, line: 36, baseType: !1205)
!1205 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1139, file: !772, line: 593, baseType: !945, size: 32, align: 32, offset: 3712)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1139, file: !772, line: 596, baseType: !945, size: 32, align: 32, offset: 3744)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1139, file: !772, line: 599, baseType: !1079, size: 64, align: 64, offset: 3776)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1139, file: !772, line: 605, baseType: !1079, size: 64, align: 64, offset: 3840)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1139, file: !772, line: 616, baseType: !1079, size: 64, align: 64, offset: 3904)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1139, file: !772, line: 626, baseType: !1212, size: 64, align: 64, offset: 3968)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1213, line: 216, baseType: !1112)
!1213 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1139, file: !772, line: 627, baseType: !1212, size: 64, align: 64, offset: 4032)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1139, file: !772, line: 628, baseType: !1212, size: 64, align: 64, offset: 4096)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1139, file: !772, line: 629, baseType: !1212, size: 64, align: 64, offset: 4160)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1139, file: !772, line: 645, baseType: !1079, size: 64, align: 64, offset: 4224)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !918, file: !917, line: 553, baseType: !945, size: 32, align: 32, offset: 1472)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !918, file: !917, line: 562, baseType: !945, size: 32, align: 32, offset: 1504)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !918, file: !917, line: 568, baseType: !945, size: 32, align: 32, offset: 1536)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !918, file: !917, line: 573, baseType: !945, size: 32, align: 32, offset: 1568)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !918, file: !917, line: 578, baseType: !1028, size: 32, align: 32, offset: 1600)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !918, file: !917, line: 583, baseType: !1131, size: 64, align: 64, offset: 1664)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !918, file: !917, line: 583, baseType: !1131, size: 64, align: 64, offset: 1728)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !918, file: !917, line: 588, baseType: !939, size: 64, align: 64, offset: 1792)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !918, file: !917, line: 595, baseType: !945, size: 32, align: 32, offset: 1856)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !918, file: !917, line: 601, baseType: !1079, size: 64, align: 64, offset: 1920)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !918, file: !917, line: 610, baseType: !1229, size: 491520, align: 8, offset: 1984)
!1229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 491520, align: 8, elements: !1230)
!1230 = !{!1231}
!1231 = !DISubrange(count: 61440)
!1232 = !{!1233, !1234, !1235}
!1233 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!1234 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!1235 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!1236 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1237, line: 437, size: 32, align: 32, elements: !1238)
!1237 = !DIFile(filename: "fftools/ffmpeg.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!1238 = !{!1239, !1240}
!1239 = !DIEnumerator(name: "ENCODER_FINISHED", value: 1)
!1240 = !DIEnumerator(name: "MUXER_FINISHED", value: 2)
!1241 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HWAccelID", file: !1237, line: 58, size: 32, align: 32, elements: !1242)
!1242 = !{!1243, !1244, !1245, !1246, !1247, !1248}
!1243 = !DIEnumerator(name: "HWACCEL_NONE", value: 0)
!1244 = !DIEnumerator(name: "HWACCEL_AUTO", value: 1)
!1245 = !DIEnumerator(name: "HWACCEL_GENERIC", value: 2)
!1246 = !DIEnumerator(name: "HWACCEL_VIDEOTOOLBOX", value: 3)
!1247 = !DIEnumerator(name: "HWACCEL_QSV", value: 4)
!1248 = !DIEnumerator(name: "HWACCEL_CUVID", value: 5)
!1249 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 3406, size: 32, align: 32, elements: !1250)
!1250 = !{!1251, !1252, !1253, !1254}
!1251 = !DIEnumerator(name: "AV_CODEC_HW_CONFIG_METHOD_HW_DEVICE_CTX", value: 1)
!1252 = !DIEnumerator(name: "AV_CODEC_HW_CONFIG_METHOD_HW_FRAMES_CTX", value: 2)
!1253 = !DIEnumerator(name: "AV_CODEC_HW_CONFIG_METHOD_INTERNAL", value: 4)
!1254 = !DIEnumerator(name: "AV_CODEC_HW_CONFIG_METHOD_AD_HOC", value: 8)
!1255 = !{!939}
!1256 = !{!1257, !1259}
!1257 = distinct !DIGlobalVariable(name: "nb_hw_devices", scope: !0, file: !1258, line: 25, type: !945, isLocal: true, isDefinition: true, variable: i32* @nb_hw_devices)
!1258 = !DIFile(filename: "fftools/ffmpeg_hw.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!1259 = distinct !DIGlobalVariable(name: "hw_devices", scope: !0, file: !1258, line: 26, type: !1260, isLocal: true, isDefinition: true, variable: %struct.HWDevice*** @hw_devices)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "HWDevice", file: !1237, line: 78, baseType: !1263)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HWDevice", file: !1237, line: 74, size: 192, align: 64, elements: !1264)
!1264 = !{!1265, !1266, !1267}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1263, file: !1237, line: 75, baseType: !1014, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1263, file: !1237, line: 76, baseType: !3, size: 32, align: 32, offset: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "device_ref", scope: !1263, file: !1237, line: 77, baseType: !1079, size: 64, align: 64, offset: 128)
!1268 = !{i32 2, !"Dwarf Version", i32 4}
!1269 = !{i32 2, !"Debug Info Version", i32 3}
!1270 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1271 = distinct !DISubprogram(name: "hw_device_get_by_name", scope: !1258, file: !1258, line: 42, type: !1272, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1274)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!1261, !932}
!1274 = !{}
!1275 = !DILocalVariable(name: "name", arg: 1, scope: !1271, file: !1258, line: 42, type: !932)
!1276 = !DIExpression()
!1277 = !DILocation(line: 42, column: 45, scope: !1271)
!1278 = !DILocalVariable(name: "i", scope: !1271, file: !1258, line: 44, type: !945)
!1279 = !DILocation(line: 44, column: 9, scope: !1271)
!1280 = !DILocation(line: 45, column: 12, scope: !1281)
!1281 = distinct !DILexicalBlock(scope: !1271, file: !1258, line: 45, column: 5)
!1282 = !DILocation(line: 45, column: 10, scope: !1281)
!1283 = !DILocation(line: 45, column: 17, scope: !1284)
!1284 = !DILexicalBlockFile(scope: !1285, file: !1258, discriminator: 1)
!1285 = distinct !DILexicalBlock(scope: !1281, file: !1258, line: 45, column: 5)
!1286 = !DILocation(line: 45, column: 21, scope: !1284)
!1287 = !DILocation(line: 45, column: 19, scope: !1284)
!1288 = !DILocation(line: 45, column: 5, scope: !1284)
!1289 = !DILocation(line: 46, column: 32, scope: !1290)
!1290 = distinct !DILexicalBlock(scope: !1291, file: !1258, line: 46, column: 13)
!1291 = distinct !DILexicalBlock(scope: !1285, file: !1258, line: 45, column: 41)
!1292 = !DILocation(line: 46, column: 21, scope: !1290)
!1293 = !DILocation(line: 46, column: 36, scope: !1290)
!1294 = !DILocation(line: 46, column: 42, scope: !1290)
!1295 = !DILocation(line: 46, column: 14, scope: !1290)
!1296 = !DILocation(line: 46, column: 13, scope: !1291)
!1297 = !DILocation(line: 47, column: 31, scope: !1290)
!1298 = !DILocation(line: 47, column: 20, scope: !1290)
!1299 = !DILocation(line: 47, column: 13, scope: !1290)
!1300 = !DILocation(line: 48, column: 5, scope: !1291)
!1301 = !DILocation(line: 45, column: 37, scope: !1302)
!1302 = !DILexicalBlockFile(scope: !1285, file: !1258, discriminator: 2)
!1303 = !DILocation(line: 45, column: 5, scope: !1302)
!1304 = distinct !{!1304, !1305}
!1305 = !DILocation(line: 45, column: 5, scope: !1271)
!1306 = !DILocation(line: 49, column: 5, scope: !1271)
!1307 = !DILocation(line: 50, column: 1, scope: !1271)
!1308 = distinct !DISubprogram(name: "hw_device_init_from_string", scope: !1258, file: !1258, line: 92, type: !1309, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1274)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!945, !932, !1260}
!1311 = !DILocalVariable(name: "arg", arg: 1, scope: !1308, file: !1258, line: 92, type: !932)
!1312 = !DILocation(line: 92, column: 44, scope: !1308)
!1313 = !DILocalVariable(name: "dev_out", arg: 2, scope: !1308, file: !1258, line: 92, type: !1260)
!1314 = !DILocation(line: 92, column: 60, scope: !1308)
!1315 = !DILocalVariable(name: "options", scope: !1308, file: !1258, line: 101, type: !997)
!1316 = !DILocation(line: 101, column: 19, scope: !1308)
!1317 = !DILocalVariable(name: "type_name", scope: !1308, file: !1258, line: 102, type: !1014)
!1318 = !DILocation(line: 102, column: 11, scope: !1308)
!1319 = !DILocalVariable(name: "name", scope: !1308, file: !1258, line: 102, type: !1014)
!1320 = !DILocation(line: 102, column: 29, scope: !1308)
!1321 = !DILocalVariable(name: "device", scope: !1308, file: !1258, line: 102, type: !1014)
!1322 = !DILocation(line: 102, column: 43, scope: !1308)
!1323 = !DILocalVariable(name: "type", scope: !1308, file: !1258, line: 103, type: !3)
!1324 = !DILocation(line: 103, column: 25, scope: !1308)
!1325 = !DILocalVariable(name: "dev", scope: !1308, file: !1258, line: 104, type: !1261)
!1326 = !DILocation(line: 104, column: 15, scope: !1308)
!1327 = !DILocalVariable(name: "src", scope: !1308, file: !1258, line: 104, type: !1261)
!1328 = !DILocation(line: 104, column: 21, scope: !1308)
!1329 = !DILocalVariable(name: "device_ref", scope: !1308, file: !1258, line: 105, type: !1079)
!1330 = !DILocation(line: 105, column: 18, scope: !1308)
!1331 = !DILocalVariable(name: "err", scope: !1308, file: !1258, line: 106, type: !945)
!1332 = !DILocation(line: 106, column: 9, scope: !1308)
!1333 = !DILocalVariable(name: "errmsg", scope: !1308, file: !1258, line: 107, type: !932)
!1334 = !DILocation(line: 107, column: 17, scope: !1308)
!1335 = !DILocalVariable(name: "p", scope: !1308, file: !1258, line: 107, type: !932)
!1336 = !DILocation(line: 107, column: 26, scope: !1308)
!1337 = !DILocalVariable(name: "q", scope: !1308, file: !1258, line: 107, type: !932)
!1338 = !DILocation(line: 107, column: 30, scope: !1308)
!1339 = !DILocalVariable(name: "k", scope: !1308, file: !1258, line: 108, type: !1212)
!1340 = !DILocation(line: 108, column: 12, scope: !1308)
!1341 = !DILocation(line: 110, column: 17, scope: !1308)
!1342 = !DILocation(line: 110, column: 9, scope: !1308)
!1343 = !DILocation(line: 110, column: 7, scope: !1308)
!1344 = !DILocation(line: 111, column: 9, scope: !1308)
!1345 = !DILocation(line: 111, column: 15, scope: !1308)
!1346 = !DILocation(line: 111, column: 13, scope: !1308)
!1347 = !DILocation(line: 111, column: 7, scope: !1308)
!1348 = !DILocation(line: 113, column: 28, scope: !1308)
!1349 = !DILocation(line: 113, column: 33, scope: !1308)
!1350 = !DILocation(line: 113, column: 17, scope: !1308)
!1351 = !DILocation(line: 113, column: 15, scope: !1308)
!1352 = !DILocation(line: 114, column: 10, scope: !1353)
!1353 = distinct !DILexicalBlock(scope: !1308, file: !1258, line: 114, column: 9)
!1354 = !DILocation(line: 114, column: 9, scope: !1308)
!1355 = !DILocation(line: 115, column: 13, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !1353, file: !1258, line: 114, column: 21)
!1357 = !DILocation(line: 116, column: 9, scope: !1356)
!1358 = !DILocation(line: 118, column: 42, scope: !1308)
!1359 = !DILocation(line: 118, column: 12, scope: !1308)
!1360 = !DILocation(line: 118, column: 10, scope: !1308)
!1361 = !DILocation(line: 119, column: 9, scope: !1362)
!1362 = distinct !DILexicalBlock(scope: !1308, file: !1258, line: 119, column: 9)
!1363 = !DILocation(line: 119, column: 14, scope: !1362)
!1364 = !DILocation(line: 119, column: 9, scope: !1308)
!1365 = !DILocation(line: 120, column: 16, scope: !1366)
!1366 = distinct !DILexicalBlock(scope: !1362, file: !1258, line: 119, column: 40)
!1367 = !DILocation(line: 121, column: 9, scope: !1366)
!1368 = !DILocation(line: 124, column: 10, scope: !1369)
!1369 = distinct !DILexicalBlock(scope: !1308, file: !1258, line: 124, column: 9)
!1370 = !DILocation(line: 124, column: 9, scope: !1369)
!1371 = !DILocation(line: 124, column: 12, scope: !1369)
!1372 = !DILocation(line: 124, column: 9, scope: !1308)
!1373 = !DILocation(line: 125, column: 21, scope: !1374)
!1374 = distinct !DILexicalBlock(scope: !1369, file: !1258, line: 124, column: 20)
!1375 = !DILocation(line: 125, column: 23, scope: !1374)
!1376 = !DILocation(line: 125, column: 13, scope: !1374)
!1377 = !DILocation(line: 125, column: 11, scope: !1374)
!1378 = !DILocation(line: 127, column: 27, scope: !1374)
!1379 = !DILocation(line: 127, column: 29, scope: !1374)
!1380 = !DILocation(line: 127, column: 34, scope: !1374)
!1381 = !DILocation(line: 127, column: 16, scope: !1374)
!1382 = !DILocation(line: 127, column: 14, scope: !1374)
!1383 = !DILocation(line: 128, column: 14, scope: !1384)
!1384 = distinct !DILexicalBlock(scope: !1374, file: !1258, line: 128, column: 13)
!1385 = !DILocation(line: 128, column: 13, scope: !1374)
!1386 = !DILocation(line: 129, column: 17, scope: !1387)
!1387 = distinct !DILexicalBlock(scope: !1384, file: !1258, line: 128, column: 20)
!1388 = !DILocation(line: 130, column: 13, scope: !1387)
!1389 = !DILocation(line: 132, column: 35, scope: !1390)
!1390 = distinct !DILexicalBlock(scope: !1374, file: !1258, line: 132, column: 13)
!1391 = !DILocation(line: 132, column: 13, scope: !1390)
!1392 = !DILocation(line: 132, column: 13, scope: !1374)
!1393 = !DILocation(line: 133, column: 20, scope: !1394)
!1394 = distinct !DILexicalBlock(scope: !1390, file: !1258, line: 132, column: 42)
!1395 = !DILocation(line: 134, column: 13, scope: !1394)
!1396 = !DILocation(line: 137, column: 18, scope: !1374)
!1397 = !DILocation(line: 137, column: 16, scope: !1374)
!1398 = !DILocation(line: 137, column: 11, scope: !1374)
!1399 = !DILocation(line: 138, column: 5, scope: !1374)
!1400 = !DILocation(line: 139, column: 39, scope: !1401)
!1401 = distinct !DILexicalBlock(scope: !1369, file: !1258, line: 138, column: 12)
!1402 = !DILocation(line: 139, column: 16, scope: !1401)
!1403 = !DILocation(line: 139, column: 14, scope: !1401)
!1404 = !DILocation(line: 140, column: 14, scope: !1405)
!1405 = distinct !DILexicalBlock(scope: !1401, file: !1258, line: 140, column: 13)
!1406 = !DILocation(line: 140, column: 13, scope: !1401)
!1407 = !DILocation(line: 141, column: 17, scope: !1408)
!1408 = distinct !DILexicalBlock(scope: !1405, file: !1258, line: 140, column: 20)
!1409 = !DILocation(line: 142, column: 13, scope: !1408)
!1410 = !DILocation(line: 146, column: 11, scope: !1411)
!1411 = distinct !DILexicalBlock(scope: !1308, file: !1258, line: 146, column: 9)
!1412 = !DILocation(line: 146, column: 10, scope: !1411)
!1413 = !DILocation(line: 146, column: 9, scope: !1308)
!1414 = !DILocation(line: 148, column: 51, scope: !1415)
!1415 = distinct !DILexicalBlock(scope: !1411, file: !1258, line: 146, column: 14)
!1416 = !DILocation(line: 148, column: 15, scope: !1415)
!1417 = !DILocation(line: 148, column: 13, scope: !1415)
!1418 = !DILocation(line: 150, column: 13, scope: !1419)
!1419 = distinct !DILexicalBlock(scope: !1415, file: !1258, line: 150, column: 13)
!1420 = !DILocation(line: 150, column: 17, scope: !1419)
!1421 = !DILocation(line: 150, column: 13, scope: !1415)
!1422 = !DILocation(line: 151, column: 13, scope: !1419)
!1423 = !DILocation(line: 153, column: 5, scope: !1415)
!1424 = !DILocation(line: 153, column: 17, scope: !1425)
!1425 = !DILexicalBlockFile(scope: !1426, file: !1258, discriminator: 1)
!1426 = distinct !DILexicalBlock(scope: !1411, file: !1258, line: 153, column: 16)
!1427 = !DILocation(line: 153, column: 16, scope: !1425)
!1428 = !DILocation(line: 153, column: 19, scope: !1425)
!1429 = !DILocation(line: 155, column: 9, scope: !1430)
!1430 = distinct !DILexicalBlock(scope: !1426, file: !1258, line: 153, column: 27)
!1431 = !DILocation(line: 156, column: 20, scope: !1430)
!1432 = !DILocation(line: 156, column: 13, scope: !1430)
!1433 = !DILocation(line: 156, column: 11, scope: !1430)
!1434 = !DILocation(line: 157, column: 13, scope: !1435)
!1435 = distinct !DILexicalBlock(scope: !1430, file: !1258, line: 157, column: 13)
!1436 = !DILocation(line: 157, column: 13, scope: !1430)
!1437 = !DILocation(line: 158, column: 33, scope: !1438)
!1438 = distinct !DILexicalBlock(scope: !1435, file: !1258, line: 157, column: 16)
!1439 = !DILocation(line: 158, column: 36, scope: !1438)
!1440 = !DILocation(line: 158, column: 40, scope: !1438)
!1441 = !DILocation(line: 158, column: 38, scope: !1438)
!1442 = !DILocation(line: 158, column: 22, scope: !1438)
!1443 = !DILocation(line: 158, column: 20, scope: !1438)
!1444 = !DILocation(line: 159, column: 18, scope: !1445)
!1445 = distinct !DILexicalBlock(scope: !1438, file: !1258, line: 159, column: 17)
!1446 = !DILocation(line: 159, column: 17, scope: !1438)
!1447 = !DILocation(line: 160, column: 21, scope: !1448)
!1448 = distinct !DILexicalBlock(scope: !1445, file: !1258, line: 159, column: 26)
!1449 = !DILocation(line: 161, column: 17, scope: !1448)
!1450 = !DILocation(line: 163, column: 50, scope: !1438)
!1451 = !DILocation(line: 163, column: 52, scope: !1438)
!1452 = !DILocation(line: 163, column: 19, scope: !1438)
!1453 = !DILocation(line: 163, column: 17, scope: !1438)
!1454 = !DILocation(line: 164, column: 17, scope: !1455)
!1455 = distinct !DILexicalBlock(scope: !1438, file: !1258, line: 164, column: 17)
!1456 = !DILocation(line: 164, column: 21, scope: !1455)
!1457 = !DILocation(line: 164, column: 17, scope: !1438)
!1458 = !DILocation(line: 165, column: 24, scope: !1459)
!1459 = distinct !DILexicalBlock(scope: !1455, file: !1258, line: 164, column: 26)
!1460 = !DILocation(line: 166, column: 17, scope: !1459)
!1461 = !DILocation(line: 168, column: 9, scope: !1438)
!1462 = !DILocation(line: 170, column: 51, scope: !1430)
!1463 = !DILocation(line: 171, column: 38, scope: !1430)
!1464 = !DILocation(line: 171, column: 47, scope: !1465)
!1465 = !DILexicalBlockFile(scope: !1430, file: !1258, discriminator: 1)
!1466 = !DILocation(line: 171, column: 38, scope: !1465)
!1467 = !DILocation(line: 171, column: 56, scope: !1468)
!1468 = !DILexicalBlockFile(scope: !1430, file: !1258, discriminator: 2)
!1469 = !DILocation(line: 171, column: 38, scope: !1468)
!1470 = !DILocation(line: 171, column: 38, scope: !1471)
!1471 = !DILexicalBlockFile(scope: !1430, file: !1258, discriminator: 3)
!1472 = !DILocation(line: 171, column: 59, scope: !1471)
!1473 = !DILocation(line: 170, column: 15, scope: !1465)
!1474 = !DILocation(line: 170, column: 13, scope: !1465)
!1475 = !DILocation(line: 172, column: 13, scope: !1476)
!1476 = distinct !DILexicalBlock(scope: !1430, file: !1258, line: 172, column: 13)
!1477 = !DILocation(line: 172, column: 17, scope: !1476)
!1478 = !DILocation(line: 172, column: 13, scope: !1430)
!1479 = !DILocation(line: 173, column: 13, scope: !1476)
!1480 = !DILocation(line: 175, column: 5, scope: !1430)
!1481 = !DILocation(line: 175, column: 17, scope: !1482)
!1482 = !DILexicalBlockFile(scope: !1483, file: !1258, discriminator: 1)
!1483 = distinct !DILexicalBlock(scope: !1426, file: !1258, line: 175, column: 16)
!1484 = !DILocation(line: 175, column: 16, scope: !1482)
!1485 = !DILocation(line: 175, column: 19, scope: !1482)
!1486 = !DILocation(line: 178, column: 37, scope: !1487)
!1487 = distinct !DILexicalBlock(scope: !1483, file: !1258, line: 175, column: 27)
!1488 = !DILocation(line: 178, column: 39, scope: !1487)
!1489 = !DILocation(line: 178, column: 15, scope: !1487)
!1490 = !DILocation(line: 178, column: 13, scope: !1487)
!1491 = !DILocation(line: 179, column: 14, scope: !1492)
!1492 = distinct !DILexicalBlock(scope: !1487, file: !1258, line: 179, column: 13)
!1493 = !DILocation(line: 179, column: 13, scope: !1487)
!1494 = !DILocation(line: 180, column: 20, scope: !1495)
!1495 = distinct !DILexicalBlock(scope: !1492, file: !1258, line: 179, column: 19)
!1496 = !DILocation(line: 181, column: 13, scope: !1495)
!1497 = !DILocation(line: 184, column: 59, scope: !1487)
!1498 = !DILocation(line: 185, column: 46, scope: !1487)
!1499 = !DILocation(line: 185, column: 51, scope: !1487)
!1500 = !DILocation(line: 184, column: 15, scope: !1487)
!1501 = !DILocation(line: 184, column: 13, scope: !1487)
!1502 = !DILocation(line: 186, column: 13, scope: !1503)
!1503 = distinct !DILexicalBlock(scope: !1487, file: !1258, line: 186, column: 13)
!1504 = !DILocation(line: 186, column: 17, scope: !1503)
!1505 = !DILocation(line: 186, column: 13, scope: !1487)
!1506 = !DILocation(line: 187, column: 13, scope: !1503)
!1507 = !DILocation(line: 188, column: 5, scope: !1487)
!1508 = !DILocation(line: 189, column: 16, scope: !1509)
!1509 = distinct !DILexicalBlock(scope: !1483, file: !1258, line: 188, column: 12)
!1510 = !DILocation(line: 190, column: 9, scope: !1509)
!1511 = !DILocation(line: 193, column: 11, scope: !1308)
!1512 = !DILocation(line: 193, column: 9, scope: !1308)
!1513 = !DILocation(line: 194, column: 10, scope: !1514)
!1514 = distinct !DILexicalBlock(scope: !1308, file: !1258, line: 194, column: 9)
!1515 = !DILocation(line: 194, column: 9, scope: !1308)
!1516 = !DILocation(line: 195, column: 13, scope: !1517)
!1517 = distinct !DILexicalBlock(scope: !1514, file: !1258, line: 194, column: 15)
!1518 = !DILocation(line: 196, column: 9, scope: !1517)
!1519 = !DILocation(line: 199, column: 17, scope: !1308)
!1520 = !DILocation(line: 199, column: 5, scope: !1308)
!1521 = !DILocation(line: 199, column: 10, scope: !1308)
!1522 = !DILocation(line: 199, column: 15, scope: !1308)
!1523 = !DILocation(line: 200, column: 17, scope: !1308)
!1524 = !DILocation(line: 200, column: 5, scope: !1308)
!1525 = !DILocation(line: 200, column: 10, scope: !1308)
!1526 = !DILocation(line: 200, column: 15, scope: !1308)
!1527 = !DILocation(line: 201, column: 23, scope: !1308)
!1528 = !DILocation(line: 201, column: 5, scope: !1308)
!1529 = !DILocation(line: 201, column: 10, scope: !1308)
!1530 = !DILocation(line: 201, column: 21, scope: !1308)
!1531 = !DILocation(line: 203, column: 9, scope: !1532)
!1532 = distinct !DILexicalBlock(scope: !1308, file: !1258, line: 203, column: 9)
!1533 = !DILocation(line: 203, column: 9, scope: !1308)
!1534 = !DILocation(line: 204, column: 20, scope: !1532)
!1535 = !DILocation(line: 204, column: 10, scope: !1532)
!1536 = !DILocation(line: 204, column: 18, scope: !1532)
!1537 = !DILocation(line: 204, column: 9, scope: !1532)
!1538 = !DILocation(line: 206, column: 10, scope: !1308)
!1539 = !DILocation(line: 207, column: 9, scope: !1308)
!1540 = !DILocation(line: 207, column: 5, scope: !1308)
!1541 = !DILocation(line: 209, column: 14, scope: !1308)
!1542 = !DILocation(line: 209, column: 5, scope: !1308)
!1543 = !DILocation(line: 210, column: 14, scope: !1308)
!1544 = !DILocation(line: 210, column: 5, scope: !1308)
!1545 = !DILocation(line: 211, column: 14, scope: !1308)
!1546 = !DILocation(line: 211, column: 5, scope: !1308)
!1547 = !DILocation(line: 212, column: 5, scope: !1308)
!1548 = !DILocation(line: 213, column: 12, scope: !1308)
!1549 = !DILocation(line: 213, column: 5, scope: !1308)
!1550 = !DILocation(line: 216, column: 57, scope: !1308)
!1551 = !DILocation(line: 216, column: 62, scope: !1308)
!1552 = !DILocation(line: 215, column: 5, scope: !1308)
!1553 = !DILocation(line: 217, column: 9, scope: !1308)
!1554 = !DILocation(line: 218, column: 5, scope: !1308)
!1555 = !DILocation(line: 221, column: 45, scope: !1308)
!1556 = !DILocation(line: 220, column: 5, scope: !1308)
!1557 = !DILocation(line: 222, column: 5, scope: !1308)
!1558 = !DILocation(line: 223, column: 5, scope: !1308)
!1559 = distinct !DISubprogram(name: "hw_device_default_name", scope: !1258, file: !1258, line: 67, type: !1560, isLocal: true, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1274)
!1560 = !DISubroutineType(types: !1561)
!1561 = !{!1014, !3}
!1562 = !DILocalVariable(name: "type", arg: 1, scope: !1559, file: !1258, line: 67, type: !3)
!1563 = !DILocation(line: 67, column: 57, scope: !1559)
!1564 = !DILocalVariable(name: "type_name", scope: !1559, file: !1258, line: 72, type: !932)
!1565 = !DILocation(line: 72, column: 17, scope: !1559)
!1566 = !DILocation(line: 72, column: 55, scope: !1559)
!1567 = !DILocation(line: 72, column: 29, scope: !1559)
!1568 = !DILocalVariable(name: "name", scope: !1559, file: !1258, line: 73, type: !1014)
!1569 = !DILocation(line: 73, column: 11, scope: !1559)
!1570 = !DILocalVariable(name: "index_pos", scope: !1559, file: !1258, line: 74, type: !1212)
!1571 = !DILocation(line: 74, column: 12, scope: !1559)
!1572 = !DILocalVariable(name: "index", scope: !1559, file: !1258, line: 75, type: !945)
!1573 = !DILocation(line: 75, column: 9, scope: !1559)
!1574 = !DILocalVariable(name: "index_limit", scope: !1559, file: !1258, line: 75, type: !945)
!1575 = !DILocation(line: 75, column: 16, scope: !1559)
!1576 = !DILocation(line: 76, column: 24, scope: !1559)
!1577 = !DILocation(line: 76, column: 17, scope: !1559)
!1578 = !DILocation(line: 76, column: 15, scope: !1559)
!1579 = !DILocation(line: 77, column: 22, scope: !1559)
!1580 = !DILocation(line: 77, column: 32, scope: !1559)
!1581 = !DILocation(line: 77, column: 12, scope: !1559)
!1582 = !DILocation(line: 77, column: 10, scope: !1559)
!1583 = !DILocation(line: 78, column: 10, scope: !1584)
!1584 = distinct !DILexicalBlock(scope: !1559, file: !1258, line: 78, column: 9)
!1585 = !DILocation(line: 78, column: 9, scope: !1559)
!1586 = !DILocation(line: 79, column: 9, scope: !1584)
!1587 = !DILocation(line: 80, column: 16, scope: !1588)
!1588 = distinct !DILexicalBlock(scope: !1559, file: !1258, line: 80, column: 5)
!1589 = !DILocation(line: 80, column: 10, scope: !1588)
!1590 = !DILocation(line: 80, column: 21, scope: !1591)
!1591 = !DILexicalBlockFile(scope: !1592, file: !1258, discriminator: 1)
!1592 = distinct !DILexicalBlock(scope: !1588, file: !1258, line: 80, column: 5)
!1593 = !DILocation(line: 80, column: 29, scope: !1591)
!1594 = !DILocation(line: 80, column: 27, scope: !1591)
!1595 = !DILocation(line: 80, column: 5, scope: !1591)
!1596 = !DILocation(line: 81, column: 18, scope: !1597)
!1597 = distinct !DILexicalBlock(scope: !1592, file: !1258, line: 80, column: 51)
!1598 = !DILocation(line: 81, column: 24, scope: !1597)
!1599 = !DILocation(line: 81, column: 34, scope: !1597)
!1600 = !DILocation(line: 81, column: 47, scope: !1597)
!1601 = !DILocation(line: 81, column: 58, scope: !1597)
!1602 = !DILocation(line: 81, column: 9, scope: !1597)
!1603 = !DILocation(line: 82, column: 36, scope: !1604)
!1604 = distinct !DILexicalBlock(scope: !1597, file: !1258, line: 82, column: 13)
!1605 = !DILocation(line: 82, column: 14, scope: !1604)
!1606 = !DILocation(line: 82, column: 13, scope: !1597)
!1607 = !DILocation(line: 83, column: 13, scope: !1604)
!1608 = !DILocation(line: 84, column: 5, scope: !1597)
!1609 = !DILocation(line: 80, column: 47, scope: !1610)
!1610 = !DILexicalBlockFile(scope: !1592, file: !1258, discriminator: 2)
!1611 = !DILocation(line: 80, column: 5, scope: !1610)
!1612 = distinct !{!1612, !1613}
!1613 = !DILocation(line: 80, column: 5, scope: !1559)
!1614 = !DILocation(line: 85, column: 9, scope: !1615)
!1615 = distinct !DILexicalBlock(scope: !1559, file: !1258, line: 85, column: 9)
!1616 = !DILocation(line: 85, column: 18, scope: !1615)
!1617 = !DILocation(line: 85, column: 15, scope: !1615)
!1618 = !DILocation(line: 85, column: 9, scope: !1559)
!1619 = !DILocation(line: 86, column: 18, scope: !1620)
!1620 = distinct !DILexicalBlock(scope: !1615, file: !1258, line: 85, column: 31)
!1621 = !DILocation(line: 86, column: 9, scope: !1620)
!1622 = !DILocation(line: 87, column: 9, scope: !1620)
!1623 = !DILocation(line: 89, column: 12, scope: !1559)
!1624 = !DILocation(line: 89, column: 5, scope: !1559)
!1625 = !DILocation(line: 90, column: 1, scope: !1559)
!1626 = distinct !DISubprogram(name: "hw_device_add", scope: !1258, file: !1258, line: 52, type: !1627, isLocal: true, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1274)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{!1261}
!1629 = !DILocalVariable(name: "err", scope: !1626, file: !1258, line: 54, type: !945)
!1630 = !DILocation(line: 54, column: 9, scope: !1626)
!1631 = !DILocation(line: 55, column: 42, scope: !1626)
!1632 = !DILocation(line: 55, column: 56, scope: !1626)
!1633 = !DILocation(line: 55, column: 11, scope: !1626)
!1634 = !DILocation(line: 55, column: 9, scope: !1626)
!1635 = !DILocation(line: 57, column: 9, scope: !1636)
!1636 = distinct !DILexicalBlock(scope: !1626, file: !1258, line: 57, column: 9)
!1637 = !DILocation(line: 57, column: 9, scope: !1626)
!1638 = !DILocation(line: 58, column: 23, scope: !1639)
!1639 = distinct !DILexicalBlock(scope: !1636, file: !1258, line: 57, column: 14)
!1640 = !DILocation(line: 59, column: 9, scope: !1639)
!1641 = !DILocation(line: 61, column: 33, scope: !1626)
!1642 = !DILocation(line: 61, column: 16, scope: !1626)
!1643 = !DILocation(line: 61, column: 5, scope: !1626)
!1644 = !DILocation(line: 61, column: 31, scope: !1626)
!1645 = !DILocation(line: 62, column: 21, scope: !1646)
!1646 = distinct !DILexicalBlock(scope: !1626, file: !1258, line: 62, column: 9)
!1647 = !DILocation(line: 62, column: 10, scope: !1646)
!1648 = !DILocation(line: 62, column: 9, scope: !1626)
!1649 = !DILocation(line: 63, column: 9, scope: !1646)
!1650 = !DILocation(line: 64, column: 36, scope: !1626)
!1651 = !DILocation(line: 64, column: 12, scope: !1626)
!1652 = !DILocation(line: 64, column: 5, scope: !1626)
!1653 = !DILocation(line: 65, column: 1, scope: !1626)
!1654 = distinct !DISubprogram(name: "hw_device_free_all", scope: !1258, file: !1258, line: 269, type: !1655, isLocal: false, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1274)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{null}
!1657 = !DILocalVariable(name: "i", scope: !1654, file: !1258, line: 271, type: !945)
!1658 = !DILocation(line: 271, column: 9, scope: !1654)
!1659 = !DILocation(line: 272, column: 12, scope: !1660)
!1660 = distinct !DILexicalBlock(scope: !1654, file: !1258, line: 272, column: 5)
!1661 = !DILocation(line: 272, column: 10, scope: !1660)
!1662 = !DILocation(line: 272, column: 17, scope: !1663)
!1663 = !DILexicalBlockFile(scope: !1664, file: !1258, discriminator: 1)
!1664 = distinct !DILexicalBlock(scope: !1660, file: !1258, line: 272, column: 5)
!1665 = !DILocation(line: 272, column: 21, scope: !1663)
!1666 = !DILocation(line: 272, column: 19, scope: !1663)
!1667 = !DILocation(line: 272, column: 5, scope: !1663)
!1668 = !DILocation(line: 273, column: 30, scope: !1669)
!1669 = distinct !DILexicalBlock(scope: !1664, file: !1258, line: 272, column: 41)
!1670 = !DILocation(line: 273, column: 19, scope: !1669)
!1671 = !DILocation(line: 273, column: 34, scope: !1669)
!1672 = !DILocation(line: 273, column: 18, scope: !1669)
!1673 = !DILocation(line: 273, column: 9, scope: !1669)
!1674 = !DILocation(line: 274, column: 37, scope: !1669)
!1675 = !DILocation(line: 274, column: 26, scope: !1669)
!1676 = !DILocation(line: 274, column: 41, scope: !1669)
!1677 = !DILocation(line: 274, column: 9, scope: !1669)
!1678 = !DILocation(line: 275, column: 30, scope: !1669)
!1679 = !DILocation(line: 275, column: 19, scope: !1669)
!1680 = !DILocation(line: 275, column: 18, scope: !1669)
!1681 = !DILocation(line: 275, column: 9, scope: !1669)
!1682 = !DILocation(line: 276, column: 5, scope: !1669)
!1683 = !DILocation(line: 272, column: 37, scope: !1684)
!1684 = !DILexicalBlockFile(scope: !1664, file: !1258, discriminator: 2)
!1685 = !DILocation(line: 272, column: 5, scope: !1684)
!1686 = distinct !{!1686, !1687}
!1687 = !DILocation(line: 272, column: 5, scope: !1654)
!1688 = !DILocation(line: 277, column: 5, scope: !1654)
!1689 = !DILocation(line: 278, column: 19, scope: !1654)
!1690 = !DILocation(line: 279, column: 1, scope: !1654)
!1691 = distinct !DISubprogram(name: "hw_device_setup_for_decode", scope: !1258, file: !1258, line: 298, type: !1692, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1274)
!1692 = !DISubroutineType(types: !1693)
!1693 = !{!945, !1694}
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputStream", file: !1237, line: 391, baseType: !1696)
!1696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InputStream", file: !1237, line: 295, size: 3392, align: 64, elements: !1697)
!1697 = !{!1698, !1699, !2360, !2361, !2362, !2363, !2364, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2395, !2415, !2416, !2655, !2656, !2657, !2658, !2659, !2660, !2661, !2662, !2663, !2667, !2668, !2669, !2670, !2671, !2672, !2673, !2674, !2675, !2676, !2677}
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "file_index", scope: !1696, file: !1237, line: 296, baseType: !945, size: 32, align: 32)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !1696, file: !1237, line: 297, baseType: !1700, size: 64, align: 64, offset: 64)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64, align: 64)
!1701 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !902, line: 1223, baseType: !1702)
!1702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !902, line: 865, size: 6144, align: 64, elements: !1703)
!1703 = !{!1704, !1705, !1706, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2200, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2300, !2306, !2315, !2319, !2329, !2330, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2351, !2352, !2353, !2354, !2355, !2356}
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1702, file: !902, line: 866, baseType: !945, size: 32, align: 32)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1702, file: !902, line: 872, baseType: !945, size: 32, align: 32, offset: 32)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1702, file: !902, line: 878, baseType: !1707, size: 64, align: 64, offset: 64)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64, align: 64)
!1708 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !49, line: 3360, baseType: !1709)
!1709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !49, line: 1556, size: 8448, align: 64, elements: !1710)
!1710 = !{!1711, !1712, !1713, !1714, !1873, !1874, !1875, !1876, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1902, !1906, !1907, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2088, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149}
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1709, file: !49, line: 1561, baseType: !926, size: 64, align: 64)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1709, file: !49, line: 1562, baseType: !945, size: 32, align: 32, offset: 64)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1709, file: !49, line: 1564, baseType: !38, size: 32, align: 32, offset: 96)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1709, file: !49, line: 1565, baseType: !1715, size: 64, align: 64, offset: 128)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1717)
!1717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !49, line: 3468, size: 1984, align: 64, elements: !1718)
!1718 = !{!1719, !1720, !1721, !1722, !1723, !1724, !1727, !1730, !1733, !1736, !1739, !1740, !1741, !1749, !1750, !1751, !1753, !1757, !1763, !1768, !1772, !1773, !1816, !1845, !1849, !1850, !1854, !1858, !1862, !1866, !1867, !1868}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1717, file: !49, line: 3475, baseType: !932, size: 64, align: 64)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1717, file: !49, line: 3480, baseType: !932, size: 64, align: 64, offset: 64)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1717, file: !49, line: 3481, baseType: !38, size: 32, align: 32, offset: 128)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1717, file: !49, line: 3482, baseType: !48, size: 32, align: 32, offset: 160)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1717, file: !49, line: 3487, baseType: !945, size: 32, align: 32, offset: 192)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1717, file: !49, line: 3488, baseType: !1725, size: 64, align: 64, offset: 256)
!1725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1726, size: 64, align: 64)
!1726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1104)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1717, file: !49, line: 3489, baseType: !1728, size: 64, align: 64, offset: 320)
!1728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1729, size: 64, align: 64)
!1729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1717, file: !49, line: 3490, baseType: !1731, size: 64, align: 64, offset: 384)
!1731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1732, size: 64, align: 64)
!1732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1717, file: !49, line: 3491, baseType: !1734, size: 64, align: 64, offset: 448)
!1734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1735, size: 64, align: 64)
!1735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1717, file: !49, line: 3492, baseType: !1737, size: 64, align: 64, offset: 512)
!1737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1738, size: 64, align: 64)
!1738 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1111)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1717, file: !49, line: 3493, baseType: !1090, size: 8, align: 8, offset: 576)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1717, file: !49, line: 3494, baseType: !926, size: 64, align: 64, offset: 640)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1717, file: !49, line: 3495, baseType: !1742, size: 64, align: 64, offset: 704)
!1742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1743, size: 64, align: 64)
!1743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1744)
!1744 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !49, line: 3404, baseType: !1745)
!1745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !49, line: 3401, size: 128, align: 64, elements: !1746)
!1746 = !{!1747, !1748}
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1745, file: !49, line: 3402, baseType: !945, size: 32, align: 32)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1745, file: !49, line: 3403, baseType: !932, size: 64, align: 64, offset: 64)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1717, file: !49, line: 3507, baseType: !932, size: 64, align: 64, offset: 768)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1717, file: !49, line: 3516, baseType: !945, size: 32, align: 32, offset: 832)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1717, file: !49, line: 3517, baseType: !1752, size: 64, align: 64, offset: 896)
!1752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1717, file: !49, line: 3527, baseType: !1754, size: 64, align: 64, offset: 960)
!1754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1755, size: 64, align: 64)
!1755 = !DISubroutineType(types: !1756)
!1756 = !{!945, !1707}
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1717, file: !49, line: 3535, baseType: !1758, size: 64, align: 64, offset: 1024)
!1758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1759, size: 64, align: 64)
!1759 = !DISubroutineType(types: !1760)
!1760 = !{!945, !1707, !1761}
!1761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1762, size: 64, align: 64)
!1762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1708)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1717, file: !49, line: 3541, baseType: !1764, size: 64, align: 64, offset: 1088)
!1764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1765, size: 64, align: 64)
!1765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1766)
!1766 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !49, line: 3461, baseType: !1767)
!1767 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !49, line: 3461, flags: DIFlagFwdDecl)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1717, file: !49, line: 3549, baseType: !1769, size: 64, align: 64, offset: 1152)
!1769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1770, size: 64, align: 64)
!1770 = !DISubroutineType(types: !1771)
!1771 = !{null, !1752}
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1717, file: !49, line: 3551, baseType: !1754, size: 64, align: 64, offset: 1216)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1717, file: !49, line: 3552, baseType: !1774, size: 64, align: 64, offset: 1280)
!1774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1775, size: 64, align: 64)
!1775 = !DISubroutineType(types: !1776)
!1776 = !{!945, !1707, !1089, !945, !1777}
!1777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1778, size: 64, align: 64)
!1778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1779)
!1779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !49, line: 3920, size: 256, align: 64, elements: !1780)
!1780 = !{!1781, !1784, !1786, !1787, !1788, !1815}
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1779, file: !49, line: 3921, baseType: !1782, size: 16, align: 16)
!1782 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1091, line: 49, baseType: !1783)
!1783 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1779, file: !49, line: 3922, baseType: !1785, size: 32, align: 32, offset: 32)
!1785 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1091, line: 51, baseType: !1028)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1779, file: !49, line: 3923, baseType: !1785, size: 32, align: 32, offset: 64)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1779, file: !49, line: 3924, baseType: !1028, size: 32, align: 32, offset: 96)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1779, file: !49, line: 3925, baseType: !1789, size: 64, align: 64, offset: 128)
!1789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1790, size: 64, align: 64)
!1790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1791, size: 64, align: 64)
!1791 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !49, line: 3918, baseType: !1792)
!1792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !49, line: 3885, size: 1600, align: 64, elements: !1793)
!1793 = !{!1794, !1795, !1796, !1797, !1798, !1799, !1805, !1809, !1811, !1812, !1813, !1814}
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1792, file: !49, line: 3886, baseType: !945, size: 32, align: 32)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1792, file: !49, line: 3887, baseType: !945, size: 32, align: 32, offset: 32)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1792, file: !49, line: 3888, baseType: !945, size: 32, align: 32, offset: 64)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1792, file: !49, line: 3889, baseType: !945, size: 32, align: 32, offset: 96)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1792, file: !49, line: 3890, baseType: !945, size: 32, align: 32, offset: 128)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1792, file: !49, line: 3897, baseType: !1800, size: 768, align: 64, offset: 192)
!1800 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !49, line: 3858, baseType: !1801)
!1801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !49, line: 3853, size: 768, align: 64, elements: !1802)
!1802 = !{!1803, !1804}
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1801, file: !49, line: 3855, baseType: !1142, size: 512, align: 64)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1801, file: !49, line: 3857, baseType: !1146, size: 256, align: 32, offset: 512)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1792, file: !49, line: 3903, baseType: !1806, size: 256, align: 64, offset: 960)
!1806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1089, size: 256, align: 64, elements: !1807)
!1807 = !{!1808}
!1808 = !DISubrange(count: 4)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1792, file: !49, line: 3904, baseType: !1810, size: 128, align: 32, offset: 1216)
!1810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 128, align: 32, elements: !1807)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1792, file: !49, line: 3906, baseType: !725, size: 32, align: 32, offset: 1344)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1792, file: !49, line: 3908, baseType: !1014, size: 64, align: 64, offset: 1408)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1792, file: !49, line: 3915, baseType: !1014, size: 64, align: 64, offset: 1472)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1792, file: !49, line: 3917, baseType: !945, size: 32, align: 32, offset: 1536)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1779, file: !49, line: 3926, baseType: !1131, size: 64, align: 64, offset: 192)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1717, file: !49, line: 3564, baseType: !1817, size: 64, align: 64, offset: 1344)
!1817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1818, size: 64, align: 64)
!1818 = !DISubroutineType(types: !1819)
!1819 = !{!945, !1707, !1820, !1843, !1059}
!1820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1821, size: 64, align: 64)
!1821 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !49, line: 1499, baseType: !1822)
!1822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !49, line: 1445, size: 704, align: 64, elements: !1823)
!1823 = !{!1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1839, !1840, !1841, !1842}
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1822, file: !49, line: 1451, baseType: !1079, size: 64, align: 64)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1822, file: !49, line: 1461, baseType: !1131, size: 64, align: 64, offset: 64)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1822, file: !49, line: 1467, baseType: !1131, size: 64, align: 64, offset: 128)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1822, file: !49, line: 1468, baseType: !1089, size: 64, align: 64, offset: 192)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1822, file: !49, line: 1469, baseType: !945, size: 32, align: 32, offset: 256)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1822, file: !49, line: 1470, baseType: !945, size: 32, align: 32, offset: 288)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1822, file: !49, line: 1474, baseType: !945, size: 32, align: 32, offset: 320)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1822, file: !49, line: 1479, baseType: !1832, size: 64, align: 64, offset: 384)
!1832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1833, size: 64, align: 64)
!1833 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !49, line: 1415, baseType: !1834)
!1834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !49, line: 1411, size: 128, align: 64, elements: !1835)
!1835 = !{!1836, !1837, !1838}
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1834, file: !49, line: 1412, baseType: !1089, size: 64, align: 64)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1834, file: !49, line: 1413, baseType: !945, size: 32, align: 32, offset: 64)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1834, file: !49, line: 1414, baseType: !731, size: 32, align: 32, offset: 96)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1822, file: !49, line: 1480, baseType: !945, size: 32, align: 32, offset: 448)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1822, file: !49, line: 1486, baseType: !1131, size: 64, align: 64, offset: 512)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1822, file: !49, line: 1488, baseType: !1131, size: 64, align: 64, offset: 576)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1822, file: !49, line: 1497, baseType: !1131, size: 64, align: 64, offset: 640)
!1843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1844, size: 64, align: 64)
!1844 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1138)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1717, file: !49, line: 3566, baseType: !1846, size: 64, align: 64, offset: 1408)
!1846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1847, size: 64, align: 64)
!1847 = !DISubroutineType(types: !1848)
!1848 = !{!945, !1707, !939, !1059, !1820}
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1717, file: !49, line: 3567, baseType: !1754, size: 64, align: 64, offset: 1472)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1717, file: !49, line: 3576, baseType: !1851, size: 64, align: 64, offset: 1536)
!1851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1852, size: 64, align: 64)
!1852 = !DISubroutineType(types: !1853)
!1853 = !{!945, !1707, !1843}
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1717, file: !49, line: 3577, baseType: !1855, size: 64, align: 64, offset: 1600)
!1855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1856, size: 64, align: 64)
!1856 = !DISubroutineType(types: !1857)
!1857 = !{!945, !1707, !1820}
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1717, file: !49, line: 3584, baseType: !1859, size: 64, align: 64, offset: 1664)
!1859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1860, size: 64, align: 64)
!1860 = !DISubroutineType(types: !1861)
!1861 = !{!945, !1707, !1137}
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1717, file: !49, line: 3589, baseType: !1863, size: 64, align: 64, offset: 1728)
!1863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1864, size: 64, align: 64)
!1864 = !DISubroutineType(types: !1865)
!1865 = !{null, !1707}
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1717, file: !49, line: 3594, baseType: !945, size: 32, align: 32, offset: 1792)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1717, file: !49, line: 3600, baseType: !932, size: 64, align: 64, offset: 1856)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1717, file: !49, line: 3609, baseType: !1869, size: 64, align: 64, offset: 1920)
!1869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1870, size: 64, align: 64)
!1870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1871, size: 64, align: 64)
!1871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1872)
!1872 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !49, line: 3609, flags: DIFlagFwdDecl)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1709, file: !49, line: 1566, baseType: !48, size: 32, align: 32, offset: 192)
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1709, file: !49, line: 1581, baseType: !1028, size: 32, align: 32, offset: 224)
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1709, file: !49, line: 1583, baseType: !939, size: 64, align: 64, offset: 256)
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1709, file: !49, line: 1591, baseType: !1877, size: 64, align: 64, offset: 320)
!1877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1878, size: 64, align: 64)
!1878 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !49, line: 1532, flags: DIFlagFwdDecl)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1709, file: !49, line: 1598, baseType: !939, size: 64, align: 64, offset: 384)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1709, file: !49, line: 1606, baseType: !1131, size: 64, align: 64, offset: 448)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1709, file: !49, line: 1614, baseType: !945, size: 32, align: 32, offset: 512)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1709, file: !49, line: 1622, baseType: !945, size: 32, align: 32, offset: 544)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1709, file: !49, line: 1628, baseType: !945, size: 32, align: 32, offset: 576)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1709, file: !49, line: 1636, baseType: !945, size: 32, align: 32, offset: 608)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1709, file: !49, line: 1643, baseType: !945, size: 32, align: 32, offset: 640)
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1709, file: !49, line: 1657, baseType: !1089, size: 64, align: 64, offset: 704)
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1709, file: !49, line: 1658, baseType: !945, size: 32, align: 32, offset: 768)
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1709, file: !49, line: 1679, baseType: !1104, size: 64, align: 32, offset: 800)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1709, file: !49, line: 1688, baseType: !945, size: 32, align: 32, offset: 864)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1709, file: !49, line: 1712, baseType: !945, size: 32, align: 32, offset: 896)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1709, file: !49, line: 1729, baseType: !945, size: 32, align: 32, offset: 928)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1709, file: !49, line: 1729, baseType: !945, size: 32, align: 32, offset: 960)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1709, file: !49, line: 1744, baseType: !945, size: 32, align: 32, offset: 992)
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1709, file: !49, line: 1744, baseType: !945, size: 32, align: 32, offset: 1024)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1709, file: !49, line: 1751, baseType: !945, size: 32, align: 32, offset: 1056)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1709, file: !49, line: 1766, baseType: !508, size: 32, align: 32, offset: 1088)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1709, file: !49, line: 1791, baseType: !1898, size: 64, align: 64, offset: 1152)
!1898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1899, size: 64, align: 64)
!1899 = !DISubroutineType(types: !1900)
!1900 = !{null, !1901, !1843, !1059, !945, !945, !945}
!1901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1709, size: 64, align: 64)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1709, file: !49, line: 1808, baseType: !1903, size: 64, align: 64, offset: 1216)
!1903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1904, size: 64, align: 64)
!1904 = !DISubroutineType(types: !1905)
!1905 = !{!508, !1901, !1728}
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1709, file: !49, line: 1816, baseType: !945, size: 32, align: 32, offset: 1280)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1709, file: !49, line: 1825, baseType: !1908, size: 32, align: 32, offset: 1312)
!1908 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1709, file: !49, line: 1830, baseType: !945, size: 32, align: 32, offset: 1344)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1709, file: !49, line: 1838, baseType: !1908, size: 32, align: 32, offset: 1376)
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1709, file: !49, line: 1846, baseType: !945, size: 32, align: 32, offset: 1408)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1709, file: !49, line: 1851, baseType: !945, size: 32, align: 32, offset: 1440)
