; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g/[inter]fftools--ffmpeg_opt.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g/[inter]fftools--ffmpeg_opt.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.HWAccel = type { i8*, i32 (%struct.AVCodecContext*)*, i32, i32 }

!917 = !DIEnumerator(name: "HWACCEL_CUVID", value: 5)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OptGroup", file: !919, line: 3243, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "fftools/ffmpeg_opt.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!920 = !{!921, !922}
!921 = !DIEnumerator(name: "GROUP_OUTFILE", value: 0)
!922 = !DIEnumerator(name: "GROUP_INFILE", value: 1)
!923 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVHWDeviceType", file: !924, line: 27, size: 32, align: 32, elements: !925)
!924 = !DIFile(filename: "./libavutil/hwcontext.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!925 = !{!926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936}
!926 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_NONE", value: 0)
!927 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_VDPAU", value: 1)
!928 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_CUDA", value: 2)
!929 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_VAAPI", value: 3)
!930 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_DXVA2", value: 4)
!931 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_QSV", value: 5)
!932 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_VIDEOTOOLBOX", value: 6)
!933 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_D3D11VA", value: 7)
!934 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_DRM", value: 8)
!935 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_OPENCL", value: 9)
!936 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_MEDIACODEC", value: 10)
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVIODataMarkerType", file: !938, line: 111, size: 32, align: 32, elements: !939)
!938 = !DIFile(filename: "./libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!939 = !{!940, !941, !942, !943, !944, !945}
!940 = !DIEnumerator(name: "AVIO_DATA_MARKER_HEADER", value: 0)
!941 = !DIEnumerator(name: "AVIO_DATA_MARKER_SYNC_POINT", value: 1)
!942 = !DIEnumerator(name: "AVIO_DATA_MARKER_BOUNDARY_POINT", value: 2)
!943 = !DIEnumerator(name: "AVIO_DATA_MARKER_UNKNOWN", value: 3)
!944 = !DIEnumerator(name: "AVIO_DATA_MARKER_TRAILER", value: 4)
!945 = !DIEnumerator(name: "AVIO_DATA_MARKER_FLUSH_POINT", value: 5)
!946 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !947, line: 782, size: 32, align: 32, elements: !948)
!947 = !DIFile(filename: "./libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!948 = !{!949, !950, !951, !952, !953, !954}
!949 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!950 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!951 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!952 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!953 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!954 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!955 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !57, line: 5085, size: 32, align: 32, elements: !956)
!956 = !{!957, !958, !959, !960}
!957 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!958 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!959 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!960 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!961 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !947, line: 1315, size: 32, align: 32, elements: !962)
!962 = !{!963, !964, !965}
!963 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!964 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!965 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!966 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !968, file: !967, line: 503, size: 32, align: 32, elements: !1313)
!967 = !DIFile(filename: "./libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !967, line: 439, size: 493504, align: 64, elements: !969)
!969 = !{!970, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1196, !1197, !1198, !1199, !1203, !1204, !1205, !1206, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !968, file: !967, line: 440, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !967, line: 67, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !967, line: 338, size: 1344, align: 64, elements: !974)
!974 = !{!975, !1062, !1111, !1112, !1114, !1118, !1120, !1121, !1122, !1123, !1124, !1155, !1156, !1160, !1163, !1164, !1165, !1167, !1168, !1183, !1184, !1185}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !973, file: !967, line: 339, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !980)
!980 = !{!981, !985, !990, !1021, !1022, !1023, !1024, !1028, !1034, !1036, !1040}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !979, file: !26, line: 72, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !979, file: !26, line: 78, baseType: !986, size: 64, align: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!982, !989}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !979, file: !26, line: 85, baseType: !991, size: 64, align: 64, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !994)
!994 = !{!995, !996, !997, !999, !1000, !1017, !1018, !1019, !1020}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !993, file: !4, line: 247, baseType: !982, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !993, file: !4, line: 253, baseType: !982, size: 64, align: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !993, file: !4, line: 259, baseType: !998, size: 32, align: 32, offset: 128)
!998 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !993, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !993, file: !4, line: 271, baseType: !1001, size: 64, align: 64, offset: 192)
!1001 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !993, file: !4, line: 265, size: 64, align: 64, elements: !1002)
!1002 = !{!1003, !1007, !1009, !1010}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1001, file: !4, line: 266, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1005, line: 40, baseType: !1006)
!1005 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!1006 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1001, file: !4, line: 267, baseType: !1008, size: 64, align: 64)
!1008 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1001, file: !4, line: 268, baseType: !982, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1001, file: !4, line: 270, baseType: !1011, size: 64, align: 32)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1012, line: 61, baseType: !1013)
!1012 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1012, line: 58, size: 64, align: 32, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1013, file: !1012, line: 59, baseType: !998, size: 32, align: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1013, file: !1012, line: 60, baseType: !998, size: 32, align: 32, offset: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !993, file: !4, line: 272, baseType: !1008, size: 64, align: 64, offset: 256)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !993, file: !4, line: 273, baseType: !1008, size: 64, align: 64, offset: 320)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !993, file: !4, line: 275, baseType: !998, size: 32, align: 32, offset: 384)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !993, file: !4, line: 300, baseType: !982, size: 64, align: 64, offset: 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !979, file: !26, line: 93, baseType: !998, size: 32, align: 32, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !979, file: !26, line: 99, baseType: !998, size: 32, align: 32, offset: 224)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !979, file: !26, line: 108, baseType: !998, size: 32, align: 32, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !979, file: !26, line: 113, baseType: !1025, size: 64, align: 64, offset: 320)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!989, !989, !989}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !979, file: !26, line: 123, baseType: !1029, size: 64, align: 64, offset: 384)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!1032, !1032}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !979, file: !26, line: 130, baseType: !1035, size: 32, align: 32, offset: 448)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !979, file: !26, line: 136, baseType: !1037, size: 64, align: 64, offset: 512)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!1035, !989}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !979, file: !26, line: 142, baseType: !1041, size: 64, align: 64, offset: 576)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!998, !1044, !989, !982, !998}
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1047)
!1047 = !{!1048, !1060, !1061}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1046, file: !4, line: 360, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1059}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1052, file: !4, line: 307, baseType: !982, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1052, file: !4, line: 313, baseType: !1008, size: 64, align: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1052, file: !4, line: 313, baseType: !1008, size: 64, align: 64, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1052, file: !4, line: 318, baseType: !1008, size: 64, align: 64, offset: 192)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1052, file: !4, line: 318, baseType: !1008, size: 64, align: 64, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1052, file: !4, line: 323, baseType: !998, size: 32, align: 32, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1046, file: !4, line: 364, baseType: !998, size: 32, align: 32, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1046, file: !4, line: 368, baseType: !998, size: 32, align: 32, offset: 96)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !973, file: !967, line: 341, baseType: !1063, size: 64, align: 64, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1065)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !967, line: 328, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !967, line: 144, size: 1024, align: 64, elements: !1067)
!1067 = !{!1068, !1069, !1070, !1075, !1076, !1077, !1078, !1082, !1083, !1092, !1096, !1097, !1098, !1099, !1101, !1106, !1110}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1066, file: !967, line: 148, baseType: !982, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1066, file: !967, line: 155, baseType: !982, size: 64, align: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1066, file: !967, line: 164, baseType: !1071, size: 64, align: 64, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1073)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !967, line: 69, baseType: !1074)
!1074 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !967, line: 69, flags: DIFlagFwdDecl)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1066, file: !967, line: 172, baseType: !1071, size: 64, align: 64, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1066, file: !967, line: 182, baseType: !976, size: 64, align: 64, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1066, file: !967, line: 187, baseType: !998, size: 32, align: 32, offset: 320)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !1066, file: !967, line: 210, baseType: !1079, size: 64, align: 64, offset: 384)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!998, !971}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1066, file: !967, line: 233, baseType: !1079, size: 64, align: 64, offset: 448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !1066, file: !967, line: 246, baseType: !1084, size: 64, align: 64, offset: 512)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!998, !971, !1087}
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1090, line: 86, baseType: !1091)
!1090 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!1091 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1090, line: 86, flags: DIFlagFwdDecl)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1066, file: !967, line: 258, baseType: !1093, size: 64, align: 64, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{null, !971}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !1066, file: !967, line: 282, baseType: !1079, size: 64, align: 64, offset: 640)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !1066, file: !967, line: 284, baseType: !998, size: 32, align: 32, offset: 704)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !1066, file: !967, line: 286, baseType: !998, size: 32, align: 32, offset: 736)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1066, file: !967, line: 292, baseType: !1100, size: 64, align: 64, offset: 768)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !1066, file: !967, line: 306, baseType: !1102, size: 64, align: 64, offset: 832)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!998, !971, !982, !982, !1105, !998, !998}
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !1066, file: !967, line: 313, baseType: !1107, size: 64, align: 64, offset: 896)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!998, !971, !989}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !1066, file: !967, line: 327, baseType: !1079, size: 64, align: 64, offset: 960)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !973, file: !967, line: 343, baseType: !1105, size: 64, align: 64, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !973, file: !967, line: 345, baseType: !1113, size: 64, align: 64, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !973, file: !967, line: 346, baseType: !1115, size: 64, align: 64, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !967, line: 68, baseType: !968)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !973, file: !967, line: 347, baseType: !1119, size: 32, align: 32, offset: 320)
!1119 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !973, file: !967, line: 349, baseType: !1113, size: 64, align: 64, offset: 384)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !973, file: !967, line: 350, baseType: !1115, size: 64, align: 64, offset: 448)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !973, file: !967, line: 351, baseType: !1119, size: 32, align: 32, offset: 512)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !973, file: !967, line: 353, baseType: !989, size: 64, align: 64, offset: 576)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !973, file: !967, line: 355, baseType: !1125, size: 64, align: 64, offset: 640)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !967, line: 840, size: 768, align: 64, elements: !1127)
!1127 = !{!1128, !1129, !1131, !1132, !1133, !1134, !1135, !1136, !1140, !1141, !1151, !1152, !1153, !1154}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1126, file: !967, line: 841, baseType: !976, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !1126, file: !967, line: 842, baseType: !1130, size: 64, align: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !1126, file: !967, line: 843, baseType: !1119, size: 32, align: 32, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !1126, file: !967, line: 845, baseType: !1105, size: 64, align: 64, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !1126, file: !967, line: 847, baseType: !1105, size: 64, align: 64, offset: 256)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1126, file: !967, line: 862, baseType: !998, size: 32, align: 32, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !1126, file: !967, line: 869, baseType: !998, size: 32, align: 32, offset: 352)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1126, file: !967, line: 874, baseType: !1137, size: 64, align: 64, offset: 384)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !967, line: 809, baseType: !1139)
!1139 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !967, line: 809, flags: DIFlagFwdDecl)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1126, file: !967, line: 881, baseType: !989, size: 64, align: 64, offset: 448)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1126, file: !967, line: 895, baseType: !1142, size: 64, align: 64, offset: 512)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !967, line: 837, baseType: !1144)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!998, !971, !1146, !989, !1150, !998}
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !967, line: 823, baseType: !1148)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!998, !971, !989, !998, !998}
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !1126, file: !967, line: 897, baseType: !1105, size: 64, align: 64, offset: 576)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !1126, file: !967, line: 906, baseType: !1115, size: 64, align: 64, offset: 640)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !1126, file: !967, line: 907, baseType: !998, size: 32, align: 32, offset: 704)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !1126, file: !967, line: 909, baseType: !1119, size: 32, align: 32, offset: 736)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !973, file: !967, line: 373, baseType: !998, size: 32, align: 32, offset: 704)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !973, file: !967, line: 378, baseType: !1157, size: 64, align: 64, offset: 768)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !967, line: 335, baseType: !1159)
!1159 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !967, line: 335, flags: DIFlagFwdDecl)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !973, file: !967, line: 380, baseType: !1161, size: 64, align: 64, offset: 832)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !967, line: 380, flags: DIFlagFwdDecl)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !973, file: !967, line: 382, baseType: !1105, size: 64, align: 64, offset: 896)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !973, file: !967, line: 383, baseType: !989, size: 64, align: 64, offset: 960)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !973, file: !967, line: 384, baseType: !1166, size: 64, align: 64, offset: 1024)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !973, file: !967, line: 385, baseType: !998, size: 32, align: 32, offset: 1088)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !973, file: !967, line: 394, baseType: !1169, size: 64, align: 64, offset: 1152)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1171, line: 94, baseType: !1172)
!1171 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1171, line: 81, size: 192, align: 64, elements: !1173)
!1173 = !{!1174, !1178, !1182}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1172, file: !1171, line: 82, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1171, line: 73, baseType: !1177)
!1177 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1171, line: 73, flags: DIFlagFwdDecl)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1172, file: !1171, line: 89, baseType: !1179, size: 64, align: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1005, line: 48, baseType: !1181)
!1181 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1172, file: !1171, line: 93, baseType: !998, size: 32, align: 32, offset: 128)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !973, file: !967, line: 401, baseType: !998, size: 32, align: 32, offset: 1216)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !973, file: !967, line: 408, baseType: !1119, size: 32, align: 32, offset: 1248)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !973, file: !967, line: 424, baseType: !998, size: 32, align: 32, offset: 1280)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !968, file: !967, line: 441, baseType: !1113, size: 64, align: 64, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !968, file: !967, line: 443, baseType: !971, size: 64, align: 64, offset: 128)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !968, file: !967, line: 444, baseType: !1113, size: 64, align: 64, offset: 192)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !968, file: !967, line: 446, baseType: !46, size: 32, align: 32, offset: 256)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !968, file: !967, line: 449, baseType: !998, size: 32, align: 32, offset: 288)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !968, file: !967, line: 450, baseType: !998, size: 32, align: 32, offset: 320)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !968, file: !967, line: 451, baseType: !1011, size: 64, align: 32, offset: 352)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !968, file: !967, line: 453, baseType: !1194, size: 64, align: 64, offset: 448)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1005, line: 55, baseType: !1195)
!1195 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !968, file: !967, line: 454, baseType: !998, size: 32, align: 32, offset: 512)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !968, file: !967, line: 456, baseType: !998, size: 32, align: 32, offset: 544)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !968, file: !967, line: 465, baseType: !1011, size: 64, align: 32, offset: 576)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !968, file: !967, line: 481, baseType: !1200, size: 64, align: 64, offset: 640)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !967, line: 70, baseType: !1202)
!1202 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !967, line: 70, flags: DIFlagFwdDecl)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !968, file: !967, line: 482, baseType: !1200, size: 64, align: 64, offset: 704)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !968, file: !967, line: 488, baseType: !1200, size: 64, align: 64, offset: 768)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !968, file: !967, line: 489, baseType: !1200, size: 64, align: 64, offset: 832)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !968, file: !967, line: 490, baseType: !1207, size: 64, align: 64, offset: 896)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !967, line: 490, flags: DIFlagFwdDecl)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !968, file: !967, line: 491, baseType: !1207, size: 64, align: 64, offset: 960)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !968, file: !967, line: 500, baseType: !998, size: 32, align: 32, offset: 1024)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !968, file: !967, line: 507, baseType: !966, size: 32, align: 32, offset: 1056)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !968, file: !967, line: 512, baseType: !1125, size: 64, align: 64, offset: 1088)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !968, file: !967, line: 518, baseType: !1004, size: 64, align: 64, offset: 1152)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !968, file: !967, line: 524, baseType: !1004, size: 64, align: 64, offset: 1216)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !968, file: !967, line: 529, baseType: !998, size: 32, align: 32, offset: 1280)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !968, file: !967, line: 542, baseType: !1011, size: 64, align: 32, offset: 1312)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !968, file: !967, line: 547, baseType: !1218, size: 64, align: 64, offset: 1408)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1221)
!1221 = !{!1222, !1226, !1228, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1255, !1257, !1258, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1287, !1288, !1289, !1290, !1291, !1292, !1295, !1296, !1297, !1298}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1220, file: !780, line: 282, baseType: !1223, size: 512, align: 64)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1179, size: 512, align: 64, elements: !1224)
!1224 = !{!1225}
!1225 = !DISubrange(count: 8)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1220, file: !780, line: 299, baseType: !1227, size: 256, align: 32, offset: 512)
!1227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !998, size: 256, align: 32, elements: !1224)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1220, file: !780, line: 315, baseType: !1229, size: 64, align: 64, offset: 768)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1220, file: !780, line: 326, baseType: !998, size: 32, align: 32, offset: 832)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1220, file: !780, line: 326, baseType: !998, size: 32, align: 32, offset: 864)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1220, file: !780, line: 334, baseType: !998, size: 32, align: 32, offset: 896)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1220, file: !780, line: 341, baseType: !998, size: 32, align: 32, offset: 928)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1220, file: !780, line: 346, baseType: !998, size: 32, align: 32, offset: 960)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1220, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1220, file: !780, line: 356, baseType: !1011, size: 64, align: 32, offset: 1024)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1220, file: !780, line: 361, baseType: !1004, size: 64, align: 64, offset: 1088)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1220, file: !780, line: 369, baseType: !1004, size: 64, align: 64, offset: 1152)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1220, file: !780, line: 377, baseType: !1004, size: 64, align: 64, offset: 1216)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1220, file: !780, line: 382, baseType: !998, size: 32, align: 32, offset: 1280)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1220, file: !780, line: 386, baseType: !998, size: 32, align: 32, offset: 1312)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1220, file: !780, line: 391, baseType: !998, size: 32, align: 32, offset: 1344)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1220, file: !780, line: 396, baseType: !989, size: 64, align: 64, offset: 1408)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1220, file: !780, line: 403, baseType: !1245, size: 512, align: 64, offset: 1472)
!1245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1194, size: 512, align: 64, elements: !1224)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1220, file: !780, line: 410, baseType: !998, size: 32, align: 32, offset: 1984)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1220, file: !780, line: 415, baseType: !998, size: 32, align: 32, offset: 2016)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1220, file: !780, line: 420, baseType: !998, size: 32, align: 32, offset: 2048)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1220, file: !780, line: 425, baseType: !998, size: 32, align: 32, offset: 2080)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1220, file: !780, line: 435, baseType: !1004, size: 64, align: 64, offset: 2112)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1220, file: !780, line: 440, baseType: !998, size: 32, align: 32, offset: 2176)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1220, file: !780, line: 445, baseType: !1194, size: 64, align: 64, offset: 2240)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1220, file: !780, line: 459, baseType: !1254, size: 512, align: 64, offset: 2304)
!1254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1169, size: 512, align: 64, elements: !1224)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1220, file: !780, line: 473, baseType: !1256, size: 64, align: 64, offset: 2816)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1220, file: !780, line: 477, baseType: !998, size: 32, align: 32, offset: 2880)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1220, file: !780, line: 479, baseType: !1259, size: 64, align: 64, offset: 2944)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1262)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1263)
!1263 = !{!1264, !1265, !1266, !1267, !1268}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1262, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1262, file: !780, line: 203, baseType: !1179, size: 64, align: 64, offset: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1262, file: !780, line: 204, baseType: !998, size: 32, align: 32, offset: 128)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1262, file: !780, line: 205, baseType: !1088, size: 64, align: 64, offset: 192)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1262, file: !780, line: 206, baseType: !1169, size: 64, align: 64, offset: 256)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1220, file: !780, line: 480, baseType: !998, size: 32, align: 32, offset: 3008)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1220, file: !780, line: 505, baseType: !998, size: 32, align: 32, offset: 3040)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1220, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1220, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1220, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1220, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1220, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1220, file: !780, line: 532, baseType: !1004, size: 64, align: 64, offset: 3264)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1220, file: !780, line: 539, baseType: !1004, size: 64, align: 64, offset: 3328)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1220, file: !780, line: 547, baseType: !1004, size: 64, align: 64, offset: 3392)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1220, file: !780, line: 554, baseType: !1088, size: 64, align: 64, offset: 3456)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1220, file: !780, line: 563, baseType: !998, size: 32, align: 32, offset: 3520)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1220, file: !780, line: 572, baseType: !998, size: 32, align: 32, offset: 3552)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1220, file: !780, line: 581, baseType: !998, size: 32, align: 32, offset: 3584)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1220, file: !780, line: 588, baseType: !1284, size: 64, align: 64, offset: 3648)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1005, line: 36, baseType: !1286)
!1286 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1220, file: !780, line: 593, baseType: !998, size: 32, align: 32, offset: 3712)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1220, file: !780, line: 596, baseType: !998, size: 32, align: 32, offset: 3744)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1220, file: !780, line: 599, baseType: !1169, size: 64, align: 64, offset: 3776)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1220, file: !780, line: 605, baseType: !1169, size: 64, align: 64, offset: 3840)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1220, file: !780, line: 616, baseType: !1169, size: 64, align: 64, offset: 3904)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1220, file: !780, line: 626, baseType: !1293, size: 64, align: 64, offset: 3968)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1294, line: 216, baseType: !1195)
!1294 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1220, file: !780, line: 627, baseType: !1293, size: 64, align: 64, offset: 4032)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1220, file: !780, line: 628, baseType: !1293, size: 64, align: 64, offset: 4096)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1220, file: !780, line: 629, baseType: !1293, size: 64, align: 64, offset: 4160)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1220, file: !780, line: 645, baseType: !1169, size: 64, align: 64, offset: 4224)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !968, file: !967, line: 553, baseType: !998, size: 32, align: 32, offset: 1472)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !968, file: !967, line: 562, baseType: !998, size: 32, align: 32, offset: 1504)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !968, file: !967, line: 568, baseType: !998, size: 32, align: 32, offset: 1536)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !968, file: !967, line: 573, baseType: !998, size: 32, align: 32, offset: 1568)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !968, file: !967, line: 578, baseType: !1119, size: 32, align: 32, offset: 1600)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !968, file: !967, line: 583, baseType: !1004, size: 64, align: 64, offset: 1664)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !968, file: !967, line: 583, baseType: !1004, size: 64, align: 64, offset: 1728)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !968, file: !967, line: 588, baseType: !989, size: 64, align: 64, offset: 1792)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !968, file: !967, line: 595, baseType: !998, size: 32, align: 32, offset: 1856)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !968, file: !967, line: 601, baseType: !1169, size: 64, align: 64, offset: 1920)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !968, file: !967, line: 610, baseType: !1310, size: 491520, align: 8, offset: 1984)
!1310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 491520, align: 8, elements: !1311)
!1311 = !{!1312}
!1312 = !DISubrange(count: 61440)
!1313 = !{!1314, !1315, !1316}
!1314 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!1315 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!1316 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!1317 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !910, line: 437, size: 32, align: 32, elements: !1318)
!1318 = !{!1319, !1320}
!1319 = !DIEnumerator(name: "ENCODER_FINISHED", value: 1)
!1320 = !DIEnumerator(name: "MUXER_FINISHED", value: 2)
!1321 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1322, file: !919, line: 2755, size: 32, align: 32, elements: !1326)
!1322 = distinct !DISubprogram(name: "opt_target", scope: !919, file: !919, line: 2752, type: !1323, isLocal: true, isDefinition: true, scopeLine: 2753, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1325)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!998, !989, !982, !982}
!1325 = !{}
!1326 = !{!1327, !1328, !1329, !1330}
!1327 = !DIEnumerator(name: "PAL", value: 0)
!1328 = !DIEnumerator(name: "NTSC", value: 1)
!1329 = !DIEnumerator(name: "FILM", value: 2)
!1330 = !DIEnumerator(name: "UNKNOWN", value: 3)
!1331 = !{!989, !1004, !1179, !1150, !998, !1119, !1008, !1332, !1339, !1344}
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1334)
!1334 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1335, line: 221, size: 32, align: 8, elements: !1336)
!1335 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!1336 = !{!1337}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1334, file: !1335, line: 221, baseType: !1338, size: 32, align: 32)
!1338 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1005, line: 51, baseType: !1119)
!1339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !1340, line: 85, baseType: !1341)
!1340 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DISubroutineType(types: !1343)
!1343 = !{null, !998}
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1346, line: 75, baseType: !1347)
!1346 = !DIFile(filename: "/usr/include/time.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !1348, line: 139, baseType: !1006)
!1348 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[task]ffmpeg_g")
!1349 = !{!1350, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1850, !1851, !1859, !1860, !1861, !1862, !1873, !1874, !1875, !1876, !1877, !1878, !1882, !1887, !1888, !1889, !1890}
!1350 = distinct !DIGlobalVariable(name: "hwaccels", scope: !0, file: !919, line: 68, type: !1351, isLocal: false, isDefinition: true, variable: [1 x %struct.HWAccel]* @hwaccels)
!1351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1352, size: 192, align: 64, elements: !1802)
!1352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1353)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "HWAccel", file: !910, line: 72, baseType: !1354)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HWAccel", file: !910, line: 67, size: 192, align: 64, elements: !1355)
!1355 = !{!1356, !1357, !1800, !1801}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1354, file: !910, line: 68, baseType: !982, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1354, file: !910, line: 69, baseType: !1358, size: 64, align: 64, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DISubroutineType(types: !1360)
!1360 = !{!998, !1361}
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1363)
!1363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1364)
!1364 = !{!1365, !1366, !1367, !1368, !1523, !1524, !1525, !1526, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1552, !1556, !1557, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1738, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1363, file: !57, line: 1561, baseType: !976, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1363, file: !57, line: 1562, baseType: !998, size: 32, align: 32, offset: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1363, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1363, file: !57, line: 1565, baseType: !1369, size: 64, align: 64, offset: 128)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1372)
!1372 = !{!1373, !1374, !1375, !1376, !1377, !1378, !1381, !1384, !1387, !1390, !1393, !1394, !1395, !1403, !1404, !1405, !1407, !1408, !1414, !1419, !1423, !1424, !1466, !1495, !1499, !1500, !1504, !1508, !1512, !1516, !1517, !1518}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1371, file: !57, line: 3475, baseType: !982, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1371, file: !57, line: 3480, baseType: !982, size: 64, align: 64, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1371, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1371, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1371, file: !57, line: 3487, baseType: !998, size: 32, align: 32, offset: 192)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1371, file: !57, line: 3488, baseType: !1379, size: 64, align: 64, offset: 256)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1011)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1371, file: !57, line: 3489, baseType: !1382, size: 64, align: 64, offset: 320)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1371, file: !57, line: 3490, baseType: !1385, size: 64, align: 64, offset: 384)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1371, file: !57, line: 3491, baseType: !1388, size: 64, align: 64, offset: 448)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1371, file: !57, line: 3492, baseType: !1391, size: 64, align: 64, offset: 512)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1194)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1371, file: !57, line: 3493, baseType: !1180, size: 8, align: 8, offset: 576)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1371, file: !57, line: 3494, baseType: !976, size: 64, align: 64, offset: 640)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1371, file: !57, line: 3495, baseType: !1396, size: 64, align: 64, offset: 704)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1398)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1400)
!1400 = !{!1401, !1402}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1399, file: !57, line: 3402, baseType: !998, size: 32, align: 32)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1399, file: !57, line: 3403, baseType: !982, size: 64, align: 64, offset: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1371, file: !57, line: 3507, baseType: !982, size: 64, align: 64, offset: 768)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1371, file: !57, line: 3516, baseType: !998, size: 32, align: 32, offset: 832)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1371, file: !57, line: 3517, baseType: !1406, size: 64, align: 64, offset: 896)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1371, file: !57, line: 3527, baseType: !1358, size: 64, align: 64, offset: 960)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1371, file: !57, line: 3535, baseType: !1409, size: 64, align: 64, offset: 1024)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{!998, !1361, !1412}
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1362)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1371, file: !57, line: 3541, baseType: !1415, size: 64, align: 64, offset: 1088)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1417)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1418)
!1418 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !57, line: 3461, flags: DIFlagFwdDecl)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1371, file: !57, line: 3549, baseType: !1420, size: 64, align: 64, offset: 1152)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DISubroutineType(types: !1422)
!1422 = !{null, !1406}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1371, file: !57, line: 3551, baseType: !1358, size: 64, align: 64, offset: 1216)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1371, file: !57, line: 3552, baseType: !1425, size: 64, align: 64, offset: 1280)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DISubroutineType(types: !1427)
!1427 = !{!998, !1361, !1179, !998, !1428}
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1430)
!1430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1431)
!1431 = !{!1432, !1435, !1436, !1437, !1438, !1465}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1430, file: !57, line: 3921, baseType: !1433, size: 16, align: 16)
!1433 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1005, line: 49, baseType: !1434)
!1434 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1430, file: !57, line: 3922, baseType: !1338, size: 32, align: 32, offset: 32)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1430, file: !57, line: 3923, baseType: !1338, size: 32, align: 32, offset: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1430, file: !57, line: 3924, baseType: !1119, size: 32, align: 32, offset: 96)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1430, file: !57, line: 3925, baseType: !1439, size: 64, align: 64, offset: 128)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1442)
!1442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1443)
!1443 = !{!1444, !1445, !1446, !1447, !1448, !1449, !1455, !1459, !1461, !1462, !1463, !1464}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1442, file: !57, line: 3886, baseType: !998, size: 32, align: 32)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1442, file: !57, line: 3887, baseType: !998, size: 32, align: 32, offset: 32)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1442, file: !57, line: 3888, baseType: !998, size: 32, align: 32, offset: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1442, file: !57, line: 3889, baseType: !998, size: 32, align: 32, offset: 96)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1442, file: !57, line: 3890, baseType: !998, size: 32, align: 32, offset: 128)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1442, file: !57, line: 3897, baseType: !1450, size: 768, align: 64, offset: 192)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1451)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1452)
!1452 = !{!1453, !1454}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1451, file: !57, line: 3855, baseType: !1223, size: 512, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1451, file: !57, line: 3857, baseType: !1227, size: 256, align: 32, offset: 512)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1442, file: !57, line: 3903, baseType: !1456, size: 256, align: 64, offset: 960)
!1456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1179, size: 256, align: 64, elements: !1457)
!1457 = !{!1458}
!1458 = !DISubrange(count: 4)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1442, file: !57, line: 3904, baseType: !1460, size: 128, align: 32, offset: 1216)
!1460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !998, size: 128, align: 32, elements: !1457)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1442, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1442, file: !57, line: 3908, baseType: !1105, size: 64, align: 64, offset: 1408)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1442, file: !57, line: 3915, baseType: !1105, size: 64, align: 64, offset: 1472)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1442, file: !57, line: 3917, baseType: !998, size: 32, align: 32, offset: 1536)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1430, file: !57, line: 3926, baseType: !1004, size: 64, align: 64, offset: 192)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1371, file: !57, line: 3564, baseType: !1467, size: 64, align: 64, offset: 1344)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DISubroutineType(types: !1469)
!1469 = !{!998, !1361, !1470, !1493, !1150}
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1472)
!1472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1473)
!1473 = !{!1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1489, !1490, !1491, !1492}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1472, file: !57, line: 1451, baseType: !1169, size: 64, align: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1472, file: !57, line: 1461, baseType: !1004, size: 64, align: 64, offset: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1472, file: !57, line: 1467, baseType: !1004, size: 64, align: 64, offset: 128)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1472, file: !57, line: 1468, baseType: !1179, size: 64, align: 64, offset: 192)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1472, file: !57, line: 1469, baseType: !998, size: 32, align: 32, offset: 256)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1472, file: !57, line: 1470, baseType: !998, size: 32, align: 32, offset: 288)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1472, file: !57, line: 1474, baseType: !998, size: 32, align: 32, offset: 320)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1472, file: !57, line: 1479, baseType: !1482, size: 64, align: 64, offset: 384)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1484)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1485)
!1485 = !{!1486, !1487, !1488}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1484, file: !57, line: 1412, baseType: !1179, size: 64, align: 64)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1484, file: !57, line: 1413, baseType: !998, size: 32, align: 32, offset: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1484, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1472, file: !57, line: 1480, baseType: !998, size: 32, align: 32, offset: 448)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1472, file: !57, line: 1486, baseType: !1004, size: 64, align: 64, offset: 512)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1472, file: !57, line: 1488, baseType: !1004, size: 64, align: 64, offset: 576)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1472, file: !57, line: 1497, baseType: !1004, size: 64, align: 64, offset: 640)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1219)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1371, file: !57, line: 3566, baseType: !1496, size: 64, align: 64, offset: 1408)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{!998, !1361, !989, !1150, !1470}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1371, file: !57, line: 3567, baseType: !1358, size: 64, align: 64, offset: 1472)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1371, file: !57, line: 3576, baseType: !1501, size: 64, align: 64, offset: 1536)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{!998, !1361, !1493}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1371, file: !57, line: 3577, baseType: !1505, size: 64, align: 64, offset: 1600)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DISubroutineType(types: !1507)
!1507 = !{!998, !1361, !1470}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1371, file: !57, line: 3584, baseType: !1509, size: 64, align: 64, offset: 1664)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DISubroutineType(types: !1511)
!1511 = !{!998, !1361, !1218}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1371, file: !57, line: 3589, baseType: !1513, size: 64, align: 64, offset: 1728)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{null, !1361}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1371, file: !57, line: 3594, baseType: !998, size: 32, align: 32, offset: 1792)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1371, file: !57, line: 3600, baseType: !982, size: 64, align: 64, offset: 1856)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1371, file: !57, line: 3609, baseType: !1519, size: 64, align: 64, offset: 1920)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1522)
!1522 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1363, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1363, file: !57, line: 1581, baseType: !1119, size: 32, align: 32, offset: 224)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1363, file: !57, line: 1583, baseType: !989, size: 64, align: 64, offset: 256)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1363, file: !57, line: 1591, baseType: !1527, size: 64, align: 64, offset: 320)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !57, line: 1532, flags: DIFlagFwdDecl)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1363, file: !57, line: 1598, baseType: !989, size: 64, align: 64, offset: 384)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1363, file: !57, line: 1606, baseType: !1004, size: 64, align: 64, offset: 448)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1363, file: !57, line: 1614, baseType: !998, size: 32, align: 32, offset: 512)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1363, file: !57, line: 1622, baseType: !998, size: 32, align: 32, offset: 544)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1363, file: !57, line: 1628, baseType: !998, size: 32, align: 32, offset: 576)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1363, file: !57, line: 1636, baseType: !998, size: 32, align: 32, offset: 608)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1363, file: !57, line: 1643, baseType: !998, size: 32, align: 32, offset: 640)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1363, file: !57, line: 1657, baseType: !1179, size: 64, align: 64, offset: 704)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1363, file: !57, line: 1658, baseType: !998, size: 32, align: 32, offset: 768)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1363, file: !57, line: 1679, baseType: !1011, size: 64, align: 32, offset: 800)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1363, file: !57, line: 1688, baseType: !998, size: 32, align: 32, offset: 864)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1363, file: !57, line: 1712, baseType: !998, size: 32, align: 32, offset: 896)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1363, file: !57, line: 1729, baseType: !998, size: 32, align: 32, offset: 928)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1363, file: !57, line: 1729, baseType: !998, size: 32, align: 32, offset: 960)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1363, file: !57, line: 1744, baseType: !998, size: 32, align: 32, offset: 992)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1363, file: !57, line: 1744, baseType: !998, size: 32, align: 32, offset: 1024)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1363, file: !57, line: 1751, baseType: !998, size: 32, align: 32, offset: 1056)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1363, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1363, file: !57, line: 1791, baseType: !1548, size: 64, align: 64, offset: 1152)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DISubroutineType(types: !1550)
!1550 = !{null, !1551, !1493, !1150, !998, !998, !998}
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1363, file: !57, line: 1808, baseType: !1553, size: 64, align: 64, offset: 1216)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DISubroutineType(types: !1555)
!1555 = !{!516, !1551, !1382}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1363, file: !57, line: 1816, baseType: !998, size: 32, align: 32, offset: 1280)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1363, file: !57, line: 1825, baseType: !1558, size: 32, align: 32, offset: 1312)
!1558 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1363, file: !57, line: 1830, baseType: !998, size: 32, align: 32, offset: 1344)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1363, file: !57, line: 1838, baseType: !1558, size: 32, align: 32, offset: 1376)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1363, file: !57, line: 1846, baseType: !998, size: 32, align: 32, offset: 1408)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1363, file: !57, line: 1851, baseType: !998, size: 32, align: 32, offset: 1440)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1363, file: !57, line: 1861, baseType: !1558, size: 32, align: 32, offset: 1472)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1363, file: !57, line: 1868, baseType: !1558, size: 32, align: 32, offset: 1504)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1363, file: !57, line: 1875, baseType: !1558, size: 32, align: 32, offset: 1536)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1363, file: !57, line: 1882, baseType: !1558, size: 32, align: 32, offset: 1568)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1363, file: !57, line: 1889, baseType: !1558, size: 32, align: 32, offset: 1600)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1363, file: !57, line: 1896, baseType: !1558, size: 32, align: 32, offset: 1632)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1363, file: !57, line: 1903, baseType: !1558, size: 32, align: 32, offset: 1664)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1363, file: !57, line: 1910, baseType: !998, size: 32, align: 32, offset: 1696)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1363, file: !57, line: 1915, baseType: !998, size: 32, align: 32, offset: 1728)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1363, file: !57, line: 1926, baseType: !1150, size: 64, align: 64, offset: 1792)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1363, file: !57, line: 1935, baseType: !1011, size: 64, align: 32, offset: 1856)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1363, file: !57, line: 1942, baseType: !998, size: 32, align: 32, offset: 1920)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1363, file: !57, line: 1948, baseType: !998, size: 32, align: 32, offset: 1952)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1363, file: !57, line: 1954, baseType: !998, size: 32, align: 32, offset: 1984)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1363, file: !57, line: 1960, baseType: !998, size: 32, align: 32, offset: 2016)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1363, file: !57, line: 1984, baseType: !998, size: 32, align: 32, offset: 2048)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1363, file: !57, line: 1991, baseType: !998, size: 32, align: 32, offset: 2080)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1363, file: !57, line: 1996, baseType: !998, size: 32, align: 32, offset: 2112)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1363, file: !57, line: 2004, baseType: !998, size: 32, align: 32, offset: 2144)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1363, file: !57, line: 2011, baseType: !998, size: 32, align: 32, offset: 2176)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1363, file: !57, line: 2018, baseType: !998, size: 32, align: 32, offset: 2208)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1363, file: !57, line: 2027, baseType: !998, size: 32, align: 32, offset: 2240)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1363, file: !57, line: 2034, baseType: !998, size: 32, align: 32, offset: 2272)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1363, file: !57, line: 2044, baseType: !998, size: 32, align: 32, offset: 2304)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1363, file: !57, line: 2054, baseType: !1588, size: 64, align: 64, offset: 2368)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1363, file: !57, line: 2061, baseType: !1588, size: 64, align: 64, offset: 2432)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1363, file: !57, line: 2066, baseType: !998, size: 32, align: 32, offset: 2496)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1363, file: !57, line: 2070, baseType: !998, size: 32, align: 32, offset: 2528)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1363, file: !57, line: 2078, baseType: !998, size: 32, align: 32, offset: 2560)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1363, file: !57, line: 2085, baseType: !998, size: 32, align: 32, offset: 2592)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1363, file: !57, line: 2092, baseType: !998, size: 32, align: 32, offset: 2624)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1363, file: !57, line: 2099, baseType: !998, size: 32, align: 32, offset: 2656)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1363, file: !57, line: 2106, baseType: !998, size: 32, align: 32, offset: 2688)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1363, file: !57, line: 2113, baseType: !998, size: 32, align: 32, offset: 2720)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1363, file: !57, line: 2120, baseType: !998, size: 32, align: 32, offset: 2752)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1363, file: !57, line: 2125, baseType: !998, size: 32, align: 32, offset: 2784)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1363, file: !57, line: 2133, baseType: !998, size: 32, align: 32, offset: 2816)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1363, file: !57, line: 2140, baseType: !998, size: 32, align: 32, offset: 2848)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1363, file: !57, line: 2145, baseType: !998, size: 32, align: 32, offset: 2880)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1363, file: !57, line: 2153, baseType: !998, size: 32, align: 32, offset: 2912)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1363, file: !57, line: 2158, baseType: !998, size: 32, align: 32, offset: 2944)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1363, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1363, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1363, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1363, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1363, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1363, file: !57, line: 2203, baseType: !998, size: 32, align: 32, offset: 3136)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1363, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1363, file: !57, line: 2212, baseType: !998, size: 32, align: 32, offset: 3200)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1363, file: !57, line: 2213, baseType: !998, size: 32, align: 32, offset: 3232)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1363, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1363, file: !57, line: 2232, baseType: !998, size: 32, align: 32, offset: 3296)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1363, file: !57, line: 2243, baseType: !998, size: 32, align: 32, offset: 3328)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1363, file: !57, line: 2249, baseType: !998, size: 32, align: 32, offset: 3360)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1363, file: !57, line: 2256, baseType: !998, size: 32, align: 32, offset: 3392)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1363, file: !57, line: 2263, baseType: !1194, size: 64, align: 64, offset: 3456)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1363, file: !57, line: 2270, baseType: !1194, size: 64, align: 64, offset: 3520)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1363, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1363, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1363, file: !57, line: 2367, baseType: !1624, size: 64, align: 64, offset: 3648)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DISubroutineType(types: !1626)
!1626 = !{!998, !1551, !1218, !998}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1363, file: !57, line: 2383, baseType: !998, size: 32, align: 32, offset: 3712)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1363, file: !57, line: 2386, baseType: !1558, size: 32, align: 32, offset: 3744)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1363, file: !57, line: 2387, baseType: !1558, size: 32, align: 32, offset: 3776)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1363, file: !57, line: 2394, baseType: !998, size: 32, align: 32, offset: 3808)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1363, file: !57, line: 2401, baseType: !998, size: 32, align: 32, offset: 3840)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1363, file: !57, line: 2408, baseType: !998, size: 32, align: 32, offset: 3872)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1363, file: !57, line: 2415, baseType: !998, size: 32, align: 32, offset: 3904)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1363, file: !57, line: 2422, baseType: !998, size: 32, align: 32, offset: 3936)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1363, file: !57, line: 2423, baseType: !1636, size: 64, align: 64, offset: 3968)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1638)
!1638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1639)
!1639 = !{!1640, !1641, !1642, !1643}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1638, file: !57, line: 827, baseType: !998, size: 32, align: 32)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1638, file: !57, line: 828, baseType: !998, size: 32, align: 32, offset: 32)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1638, file: !57, line: 829, baseType: !998, size: 32, align: 32, offset: 64)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1638, file: !57, line: 830, baseType: !1558, size: 32, align: 32, offset: 96)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1363, file: !57, line: 2430, baseType: !1004, size: 64, align: 64, offset: 4032)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1363, file: !57, line: 2437, baseType: !1004, size: 64, align: 64, offset: 4096)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1363, file: !57, line: 2444, baseType: !1558, size: 32, align: 32, offset: 4160)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1363, file: !57, line: 2451, baseType: !1558, size: 32, align: 32, offset: 4192)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1363, file: !57, line: 2458, baseType: !998, size: 32, align: 32, offset: 4224)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1363, file: !57, line: 2469, baseType: !998, size: 32, align: 32, offset: 4256)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1363, file: !57, line: 2475, baseType: !998, size: 32, align: 32, offset: 4288)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1363, file: !57, line: 2481, baseType: !998, size: 32, align: 32, offset: 4320)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1363, file: !57, line: 2485, baseType: !998, size: 32, align: 32, offset: 4352)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1363, file: !57, line: 2489, baseType: !998, size: 32, align: 32, offset: 4384)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1363, file: !57, line: 2493, baseType: !998, size: 32, align: 32, offset: 4416)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1363, file: !57, line: 2501, baseType: !998, size: 32, align: 32, offset: 4448)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1363, file: !57, line: 2506, baseType: !998, size: 32, align: 32, offset: 4480)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1363, file: !57, line: 2510, baseType: !998, size: 32, align: 32, offset: 4512)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1363, file: !57, line: 2514, baseType: !1004, size: 64, align: 64, offset: 4544)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1363, file: !57, line: 2528, baseType: !1660, size: 64, align: 64, offset: 4608)
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64, align: 64)
!1661 = !DISubroutineType(types: !1662)
!1662 = !{null, !1551, !989, !998, !998}
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1363, file: !57, line: 2534, baseType: !998, size: 32, align: 32, offset: 4672)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1363, file: !57, line: 2545, baseType: !998, size: 32, align: 32, offset: 4704)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1363, file: !57, line: 2547, baseType: !998, size: 32, align: 32, offset: 4736)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1363, file: !57, line: 2549, baseType: !998, size: 32, align: 32, offset: 4768)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1363, file: !57, line: 2551, baseType: !998, size: 32, align: 32, offset: 4800)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1363, file: !57, line: 2553, baseType: !998, size: 32, align: 32, offset: 4832)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1363, file: !57, line: 2555, baseType: !998, size: 32, align: 32, offset: 4864)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1363, file: !57, line: 2557, baseType: !998, size: 32, align: 32, offset: 4896)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1363, file: !57, line: 2559, baseType: !998, size: 32, align: 32, offset: 4928)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1363, file: !57, line: 2563, baseType: !998, size: 32, align: 32, offset: 4960)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1363, file: !57, line: 2571, baseType: !1105, size: 64, align: 64, offset: 4992)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1363, file: !57, line: 2579, baseType: !1105, size: 64, align: 64, offset: 5056)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1363, file: !57, line: 2586, baseType: !998, size: 32, align: 32, offset: 5120)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1363, file: !57, line: 2615, baseType: !998, size: 32, align: 32, offset: 5152)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1363, file: !57, line: 2627, baseType: !998, size: 32, align: 32, offset: 5184)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1363, file: !57, line: 2637, baseType: !998, size: 32, align: 32, offset: 5216)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1363, file: !57, line: 2681, baseType: !998, size: 32, align: 32, offset: 5248)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1363, file: !57, line: 2709, baseType: !1004, size: 64, align: 64, offset: 5312)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1363, file: !57, line: 2716, baseType: !1682, size: 64, align: 64, offset: 5376)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64, align: 64)
!1683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1684)
!1684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1685)
!1685 = !{!1686, !1687, !1688, !1689, !1690, !1691, !1692, !1698, !1702, !1703, !1704, !1705, !1711, !1712, !1713, !1714, !1715}
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1684, file: !57, line: 3642, baseType: !982, size: 64, align: 64)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1684, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1684, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1684, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1684, file: !57, line: 3669, baseType: !998, size: 32, align: 32, offset: 160)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1684, file: !57, line: 3682, baseType: !1509, size: 64, align: 64, offset: 192)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1684, file: !57, line: 3698, baseType: !1693, size: 64, align: 64, offset: 256)
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DISubroutineType(types: !1695)
!1695 = !{!998, !1361, !1696, !1338}
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1180)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1684, file: !57, line: 3712, baseType: !1699, size: 64, align: 64, offset: 320)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{!998, !1361, !998, !1696, !1338}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1684, file: !57, line: 3726, baseType: !1693, size: 64, align: 64, offset: 384)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1684, file: !57, line: 3737, baseType: !1358, size: 64, align: 64, offset: 448)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1684, file: !57, line: 3746, baseType: !998, size: 32, align: 32, offset: 512)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1684, file: !57, line: 3757, baseType: !1706, size: 64, align: 64, offset: 576)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DISubroutineType(types: !1708)
!1708 = !{null, !1709}
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !57, line: 3617, flags: DIFlagFwdDecl)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1684, file: !57, line: 3766, baseType: !1358, size: 64, align: 64, offset: 640)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1684, file: !57, line: 3774, baseType: !1358, size: 64, align: 64, offset: 704)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1684, file: !57, line: 3780, baseType: !998, size: 32, align: 32, offset: 768)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1684, file: !57, line: 3785, baseType: !998, size: 32, align: 32, offset: 800)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1684, file: !57, line: 3795, baseType: !1716, size: 64, align: 64, offset: 832)
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1717 = !DISubroutineType(types: !1718)
!1718 = !{!998, !1361, !1169}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1363, file: !57, line: 2728, baseType: !989, size: 64, align: 64, offset: 5440)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1363, file: !57, line: 2735, baseType: !1245, size: 512, align: 64, offset: 5504)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1363, file: !57, line: 2742, baseType: !998, size: 32, align: 32, offset: 6016)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1363, file: !57, line: 2755, baseType: !998, size: 32, align: 32, offset: 6048)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1363, file: !57, line: 2776, baseType: !998, size: 32, align: 32, offset: 6080)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1363, file: !57, line: 2783, baseType: !998, size: 32, align: 32, offset: 6112)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1363, file: !57, line: 2791, baseType: !998, size: 32, align: 32, offset: 6144)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1363, file: !57, line: 2802, baseType: !1218, size: 64, align: 64, offset: 6208)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1363, file: !57, line: 2811, baseType: !998, size: 32, align: 32, offset: 6272)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1363, file: !57, line: 2821, baseType: !998, size: 32, align: 32, offset: 6304)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1363, file: !57, line: 2830, baseType: !998, size: 32, align: 32, offset: 6336)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1363, file: !57, line: 2840, baseType: !998, size: 32, align: 32, offset: 6368)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1363, file: !57, line: 2851, baseType: !1732, size: 64, align: 64, offset: 6400)
!1732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1733, size: 64, align: 64)
!1733 = !DISubroutineType(types: !1734)
!1734 = !{!998, !1551, !1735, !989, !1150, !998, !998}
!1735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64, align: 64)
!1736 = !DISubroutineType(types: !1737)
!1737 = !{!998, !1551, !989}
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1363, file: !57, line: 2871, baseType: !1739, size: 64, align: 64, offset: 6464)
!1739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1740, size: 64, align: 64)
!1740 = !DISubroutineType(types: !1741)
!1741 = !{!998, !1551, !1742, !989, !1150, !998}
!1742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1743, size: 64, align: 64)
!1743 = !DISubroutineType(types: !1744)
!1744 = !{!998, !1551, !989, !998, !998}
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1363, file: !57, line: 2878, baseType: !998, size: 32, align: 32, offset: 6528)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1363, file: !57, line: 2885, baseType: !998, size: 32, align: 32, offset: 6560)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1363, file: !57, line: 3005, baseType: !998, size: 32, align: 32, offset: 6592)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1363, file: !57, line: 3013, baseType: !900, size: 32, align: 32, offset: 6624)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1363, file: !57, line: 3020, baseType: !900, size: 32, align: 32, offset: 6656)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1363, file: !57, line: 3027, baseType: !900, size: 32, align: 32, offset: 6688)
