; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--dhtest/[inter]test--dhtest-bin-dhtest.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--dhtest/[inter]test--dhtest-bin-dhtest.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rfc5114_td = type { %struct.dh_st* ()*, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64 }
%struct.dh_st = type opaque
%struct.bignum_st = type opaque
%struct.bn_gencb_st = type opaque

@.str = private unnamed_addr constant [8 x i8] c"dh_test\00", align 1
@.str.1 = private unnamed_addr constant [13 x i8] c"rfc5114_test\00", align 1
@.str.2 = private unnamed_addr constant [14 x i8] c"test/dhtest.c\00", align 1
@.str.3 = private unnamed_addr constant [14 x i8] c"dh = DH_new()\00", align 1
@.str.4 = private unnamed_addr constant [13 x i8] c"p = BN_new()\00", align 1
@.str.5 = private unnamed_addr constant [13 x i8] c"q = BN_new()\00", align 1
@.str.6 = private unnamed_addr constant [13 x i8] c"g = BN_new()\00", align 1
@.str.7 = private unnamed_addr constant [20 x i8] c"priv_key = BN_new()\00", align 1
@.str.8 = private unnamed_addr constant [22 x i8] c"BN_set_word(p, 4079L)\00", align 1
@.str.9 = private unnamed_addr constant [22 x i8] c"BN_set_word(q, 2039L)\00", align 1
@.str.10 = private unnamed_addr constant [19 x i8] c"BN_set_word(g, 3L)\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !9)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--dhtest/[inter]test--dhtest-bin-dhtest.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--dhtest")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 216, baseType: !8)
!7 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--dhtest")
!8 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!9 = !{!10, !40, !44, !48, !49, !50, !51, !55, !59, !60, !61, !62, !66, !67, !68, !69, !70}
!10 = distinct !DIGlobalVariable(name: "rfctd", scope: !0, file: !11, line: 496, type: !12, isLocal: true, isDefinition: true, variable: [3 x %struct.rfc5114_td]* @rfctd)
!11 = !DIFile(filename: "test/dhtest.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--dhtest")
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 2112, align: 64, elements: !38)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "rfc5114_td", file: !11, line: 485, baseType: !15)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 473, size: 704, align: 64, elements: !16)
!16 = !{!17, !25, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "get_param", scope: !15, file: !11, line: 474, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DISubroutineType(types: !20)
!20 = !{!21}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "DH", file: !23, line: 108, baseType: !24)
!23 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--dhtest")
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "dh_st", file: !23, line: 108, flags: DIFlagFwdDecl)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "xA", scope: !15, file: !11, line: 475, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "xA_len", scope: !15, file: !11, line: 476, baseType: !6, size: 64, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "yA", scope: !15, file: !11, line: 477, baseType: !26, size: 64, align: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "yA_len", scope: !15, file: !11, line: 478, baseType: !6, size: 64, align: 64, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "xB", scope: !15, file: !11, line: 479, baseType: !26, size: 64, align: 64, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "xB_len", scope: !15, file: !11, line: 480, baseType: !6, size: 64, align: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "yB", scope: !15, file: !11, line: 481, baseType: !26, size: 64, align: 64, offset: 448)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "yB_len", scope: !15, file: !11, line: 482, baseType: !6, size: 64, align: 64, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Z", scope: !15, file: !11, line: 483, baseType: !26, size: 64, align: 64, offset: 576)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "Z_len", scope: !15, file: !11, line: 484, baseType: !6, size: 64, align: 64, offset: 640)
!38 = !{!39}
!39 = !DISubrange(count: 3)
!40 = distinct !DIGlobalVariable(name: "dhtest_1024_160_xA", scope: !0, file: !11, line: 222, type: !41, isLocal: true, isDefinition: true, variable: [20 x i8]* @dhtest_1024_160_xA)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, align: 8, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 20)
!44 = distinct !DIGlobalVariable(name: "dhtest_1024_160_yA", scope: !0, file: !11, line: 227, type: !45, isLocal: true, isDefinition: true, variable: [128 x i8]* @dhtest_1024_160_yA)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1024, align: 8, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 128)
!48 = distinct !DIGlobalVariable(name: "dhtest_1024_160_xB", scope: !0, file: !11, line: 241, type: !41, isLocal: true, isDefinition: true, variable: [20 x i8]* @dhtest_1024_160_xB)
!49 = distinct !DIGlobalVariable(name: "dhtest_1024_160_yB", scope: !0, file: !11, line: 246, type: !45, isLocal: true, isDefinition: true, variable: [128 x i8]* @dhtest_1024_160_yB)
!50 = distinct !DIGlobalVariable(name: "dhtest_1024_160_Z", scope: !0, file: !11, line: 260, type: !45, isLocal: true, isDefinition: true, variable: [128 x i8]* @dhtest_1024_160_Z)
!51 = distinct !DIGlobalVariable(name: "dhtest_2048_224_xA", scope: !0, file: !11, line: 274, type: !52, isLocal: true, isDefinition: true, variable: [28 x i8]* @dhtest_2048_224_xA)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 224, align: 8, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 28)
!55 = distinct !DIGlobalVariable(name: "dhtest_2048_224_yA", scope: !0, file: !11, line: 280, type: !56, isLocal: true, isDefinition: true, variable: [256 x i8]* @dhtest_2048_224_yA)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2048, align: 8, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 256)
!59 = distinct !DIGlobalVariable(name: "dhtest_2048_224_xB", scope: !0, file: !11, line: 305, type: !52, isLocal: true, isDefinition: true, variable: [28 x i8]* @dhtest_2048_224_xB)
!60 = distinct !DIGlobalVariable(name: "dhtest_2048_224_yB", scope: !0, file: !11, line: 311, type: !56, isLocal: true, isDefinition: true, variable: [256 x i8]* @dhtest_2048_224_yB)
!61 = distinct !DIGlobalVariable(name: "dhtest_2048_224_Z", scope: !0, file: !11, line: 336, type: !56, isLocal: true, isDefinition: true, variable: [256 x i8]* @dhtest_2048_224_Z)
!62 = distinct !DIGlobalVariable(name: "dhtest_2048_256_xA", scope: !0, file: !11, line: 361, type: !63, isLocal: true, isDefinition: true, variable: [32 x i8]* @dhtest_2048_256_xA)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 256, align: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 32)
!66 = distinct !DIGlobalVariable(name: "dhtest_2048_256_yA", scope: !0, file: !11, line: 367, type: !56, isLocal: true, isDefinition: true, variable: [256 x i8]* @dhtest_2048_256_yA)
!67 = distinct !DIGlobalVariable(name: "dhtest_2048_256_xB", scope: !0, file: !11, line: 392, type: !63, isLocal: true, isDefinition: true, variable: [32 x i8]* @dhtest_2048_256_xB)
!68 = distinct !DIGlobalVariable(name: "dhtest_2048_256_yB", scope: !0, file: !11, line: 398, type: !56, isLocal: true, isDefinition: true, variable: [256 x i8]* @dhtest_2048_256_yB)
!69 = distinct !DIGlobalVariable(name: "dhtest_2048_256_Z", scope: !0, file: !11, line: 423, type: !56, isLocal: true, isDefinition: true, variable: [256 x i8]* @dhtest_2048_256_Z)
!70 = distinct !DIGlobalVariable(name: "dhtest_rfc5114_2048_224_bad_y", scope: !0, file: !11, line: 448, type: !56, isLocal: true, isDefinition: true, variable: [256 x i8]* @dhtest_rfc5114_2048_224_bad_y)
!71 = !{i32 2, !"Dwarf Version", i32 4}
!72 = !{i32 2, !"Debug Info Version", i32 3}
!73 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
