; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--dnn_backend_native.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--dnn_backend_native.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.DNNModel = type { i8*, i32 (i8*, %struct.DNNData*, %struct.DNNData*)* }
%struct.DNNData = type { float*, i32, i32, i32 }
%union.av_intfloat32 = type { i32 }
%struct.ConvolutionalNetwork = type { %struct.Layer*, i32 }
%struct.Layer = type { i32, float*, i8* }
%struct.AVIOContext = type { %struct.AVClass*, i8*, i32, i8*, i8*, i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i64, i32, i32, i32, i64, i8*, i64 (i64, i8*, i32)*, i32, i32 (i8*, i32)*, i64 (i8*, i32, i64, i32)*, i32, i64, i32, i64, i32, i32, i32, i32, i8*, i8*, i32 (i8*, i8*, i32, i32, i64)*, i32, i32, i64, i32 (i8*)*, i64, i8*, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.ConvolutionalParams = type { i32, i32, i32, i32, float*, float* }
%struct.DepthToSpaceParams = type { i32 }
%struct.InputParams = type { i32, i32, i32 }

; Function Attrs: nounwind uwtable
define %struct.DNNModel* @ff_dnn_load_model_native(i8* %model_filename) #0 !dbg !96 {

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !49)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--dnn_backend_native.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3, !8, !14, !35, !44}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 29, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavfilter/dnn_interface.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "DNN_SUCCESS", value: 0)
!7 = !DIEnumerator(name: "DNN_ERROR", value: 1)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 33, size: 32, align: 32, elements: !10)
!9 = !DIFile(filename: "libavfilter/dnn_backend_native.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "INPUT", value: 0)
!12 = !DIEnumerator(name: "CONV", value: 1)
!13 = !DIEnumerator(name: "DEPTH_TO_SPACE", value: 2)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 29, size: 32, align: 32, elements: !16)
!15 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!17 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!18 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!19 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!20 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!21 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!22 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!23 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!24 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!25 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!26 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!27 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!28 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!29 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!30 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!31 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!32 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!33 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!34 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVIODataMarkerType", file: !36, line: 111, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "./libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!37 = !{!38, !39, !40, !41, !42, !43}
!38 = !DIEnumerator(name: "AVIO_DATA_MARKER_HEADER", value: 0)
!39 = !DIEnumerator(name: "AVIO_DATA_MARKER_SYNC_POINT", value: 1)
!40 = !DIEnumerator(name: "AVIO_DATA_MARKER_BOUNDARY_POINT", value: 2)
!41 = !DIEnumerator(name: "AVIO_DATA_MARKER_UNKNOWN", value: 3)
!42 = !DIEnumerator(name: "AVIO_DATA_MARKER_TRAILER", value: 4)
!43 = !DIEnumerator(name: "AVIO_DATA_MARKER_FLUSH_POINT", value: 5)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 35, size: 32, align: 32, elements: !45)
!45 = !{!46, !47, !48}
!46 = !DIEnumerator(name: "RELU", value: 0)
!47 = !DIEnumerator(name: "TANH", value: 1)
!48 = !DIEnumerator(name: "SIGMOID", value: 2)
!49 = !{!50, !51, !54, !70, !77, !88}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !52, line: 38, baseType: !53)
!52 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!53 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConvolutionalNetwork", file: !9, line: 62, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ConvolutionalNetwork", file: !9, line: 59, size: 128, align: 64, elements: !57)
!57 = !{!58, !69}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !56, file: !9, line: 60, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "Layer", file: !9, line: 41, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Layer", file: !9, line: 37, size: 192, align: 64, elements: !62)
!62 = !{!63, !65, !68}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !61, file: !9, line: 38, baseType: !64, size: 32, align: 32)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "DNNLayerType", file: !9, line: 33, baseType: !8)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !61, file: !9, line: 39, baseType: !66, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !61, file: !9, line: 40, baseType: !50, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "layers_num", scope: !56, file: !9, line: 61, baseType: !51, size: 32, align: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParams", file: !9, line: 52, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InputParams", file: !9, line: 50, size: 96, align: 32, elements: !73)
!73 = !{!74, !75, !76}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !72, file: !9, line: 51, baseType: !53, size: 32, align: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !72, file: !9, line: 51, baseType: !53, size: 32, align: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !72, file: !9, line: 51, baseType: !53, size: 32, align: 32, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConvolutionalParams", file: !9, line: 48, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ConvolutionalParams", file: !9, line: 43, size: 256, align: 64, elements: !80)
!80 = !{!81, !82, !83, !84, !86, !87}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "input_num", scope: !79, file: !9, line: 44, baseType: !51, size: 32, align: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "output_num", scope: !79, file: !9, line: 44, baseType: !51, size: 32, align: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_size", scope: !79, file: !9, line: 44, baseType: !51, size: 32, align: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "activation", scope: !79, file: !9, line: 45, baseType: !85, size: 32, align: 32, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "DNNActivationFunc", file: !9, line: 35, baseType: !44)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "kernel", scope: !79, file: !9, line: 46, baseType: !66, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "biases", scope: !79, file: !9, line: 47, baseType: !66, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "DepthToSpaceParams", file: !9, line: 56, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DepthToSpaceParams", file: !9, line: 54, size: 32, align: 32, elements: !91)
!91 = !{!92}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !90, file: !9, line: 55, baseType: !53, size: 32, align: 32)
!93 = !{i32 2, !"Dwarf Version", i32 4}
!94 = !{i32 2, !"Debug Info Version", i32 3}
!95 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!96 = distinct !DISubprogram(name: "ff_dnn_load_model_native", scope: !97, file: !97, line: 96, type: !98, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !121)
!97 = !DIFile(filename: "libavfilter/dnn_backend_native.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !118}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "DNNModel", file: !4, line: 44, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DNNModel", file: !4, line: 38, size: 128, align: 64, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !102, file: !4, line: 40, baseType: !50, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "set_input_output", scope: !102, file: !4, line: 43, baseType: !106, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!109, !50, !110, !110}
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "DNNReturnType", file: !4, line: 29, baseType: !3)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "DNNData", file: !4, line: 36, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DNNData", file: !4, line: 33, size: 192, align: 64, elements: !113)
!113 = !{!114, !115, !116, !117}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !112, file: !4, line: 34, baseType: !66, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !112, file: !4, line: 35, baseType: !53, size: 32, align: 32, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !112, file: !4, line: 35, baseType: !53, size: 32, align: 32, offset: 96)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !112, file: !4, line: 35, baseType: !53, size: 32, align: 32, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!121 = !{}
!122 = !DILocalVariable(name: "i", arg: 1, scope: !123, file: !124, line: 40, type: !127)
!123 = distinct !DISubprogram(name: "av_int2float", scope: !124, file: !124, line: 40, type: !125, isLocal: true, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !121)
!124 = !DIFile(filename: "./libavutil/intfloat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!125 = !DISubroutineType(types: !126)
!126 = !{!67, !127}
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !52, line: 51, baseType: !128)
!128 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!129 = !DIExpression()
!130 = !DILocation(line: 40, column: 74, scope: !123, inlinedAt: !131)
!131 = distinct !DILocation(line: 184, column: 42, scope: !132)
!132 = !DILexicalBlockFile(scope: !133, file: !97, discriminator: 1)
!133 = distinct !DILexicalBlock(scope: !134, file: !97, line: 183, column: 58)
!134 = distinct !DILexicalBlock(scope: !135, file: !97, line: 183, column: 13)
!135 = distinct !DILexicalBlock(scope: !136, file: !97, line: 183, column: 13)
!136 = distinct !DILexicalBlock(scope: !137, file: !97, line: 152, column: 28)
!137 = distinct !DILexicalBlock(scope: !138, file: !97, line: 149, column: 58)
!138 = distinct !DILexicalBlock(scope: !139, file: !97, line: 149, column: 5)
!139 = distinct !DILexicalBlock(scope: !96, file: !97, line: 149, column: 5)
!140 = !DILocalVariable(name: "v", scope: !123, file: !124, line: 42, type: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "av_intfloat32", file: !124, line: 27, size: 32, align: 32, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !141, file: !124, line: 28, baseType: !127, size: 32, align: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !141, file: !124, line: 29, baseType: !67, size: 32, align: 32)
!145 = !DILocation(line: 42, column: 25, scope: !123, inlinedAt: !131)
!146 = !DILocation(line: 40, column: 74, scope: !123, inlinedAt: !147)
!147 = distinct !DILocation(line: 181, column: 42, scope: !148)
!148 = !DILexicalBlockFile(scope: !149, file: !97, discriminator: 1)
!149 = distinct !DILexicalBlock(scope: !150, file: !97, line: 180, column: 46)
!150 = distinct !DILexicalBlock(scope: !151, file: !97, line: 180, column: 13)
!151 = distinct !DILexicalBlock(scope: !136, file: !97, line: 180, column: 13)
!152 = !DILocation(line: 42, column: 25, scope: !123, inlinedAt: !147)
!153 = !DILocalVariable(name: "model_filename", arg: 1, scope: !96, file: !97, line: 96, type: !118)
!154 = !DILocation(line: 96, column: 48, scope: !96)
!155 = !DILocalVariable(name: "model", scope: !96, file: !97, line: 98, type: !100)
!156 = !DILocation(line: 98, column: 15, scope: !96)
!157 = !DILocalVariable(name: "network", scope: !96, file: !97, line: 99, type: !54)
!158 = !DILocation(line: 99, column: 27, scope: !96)
!159 = !DILocalVariable(name: "model_file_context", scope: !96, file: !97, line: 100, type: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !36, line: 352, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !36, line: 161, size: 2112, align: 64, elements: !163)
!163 = !{!164, !205, !208, !209, !210, !211, !212, !218, !219, !225, !226, !227, !228, !229, !231, !232, !238, !239, !243, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !261, !262, !263, !264, !268, !269, !270}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !162, file: !36, line: 174, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !15, line: 143, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !15, line: 67, size: 640, align: 64, elements: !169)
!169 = !{!170, !171, !175, !179, !180, !181, !182, !186, !192, !194, !198}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !168, file: !15, line: 72, baseType: !118, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !168, file: !15, line: 78, baseType: !172, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!118, !50}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !168, file: !15, line: 85, baseType: !176, size: 64, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !15, line: 85, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !168, file: !15, line: 93, baseType: !53, size: 32, align: 32, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !168, file: !15, line: 99, baseType: !53, size: 32, align: 32, offset: 224)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !168, file: !15, line: 108, baseType: !53, size: 32, align: 32, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !168, file: !15, line: 113, baseType: !183, size: 64, align: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!50, !50, !50}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !168, file: !15, line: 123, baseType: !187, size: 64, align: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!190, !190}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !168, file: !15, line: 130, baseType: !193, size: 32, align: 32, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !15, line: 48, baseType: !14)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !168, file: !15, line: 136, baseType: !195, size: 64, align: 64, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!193, !50}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !168, file: !15, line: 142, baseType: !199, size: 64, align: 64, offset: 576)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!53, !202, !50, !118, !53}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !15, line: 60, flags: DIFlagFwdDecl)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !162, file: !36, line: 226, baseType: !206, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !162, file: !36, line: 227, baseType: !53, size: 32, align: 32, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !162, file: !36, line: 228, baseType: !206, size: 64, align: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !162, file: !36, line: 229, baseType: !206, size: 64, align: 64, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !162, file: !36, line: 233, baseType: !50, size: 64, align: 64, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !162, file: !36, line: 235, baseType: !213, size: 64, align: 64, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!53, !50, !216, !53}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !52, line: 48, baseType: !207)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !162, file: !36, line: 236, baseType: !213, size: 64, align: 64, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !162, file: !36, line: 237, baseType: !220, size: 64, align: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!223, !50, !223, !53}
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !52, line: 40, baseType: !224)
!224 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !162, file: !36, line: 238, baseType: !223, size: 64, align: 64, offset: 576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !162, file: !36, line: 239, baseType: !53, size: 32, align: 32, offset: 640)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !162, file: !36, line: 240, baseType: !53, size: 32, align: 32, offset: 672)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !162, file: !36, line: 241, baseType: !53, size: 32, align: 32, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !162, file: !36, line: 242, baseType: !230, size: 64, align: 64, offset: 768)
!230 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !162, file: !36, line: 243, baseType: !206, size: 64, align: 64, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !162, file: !36, line: 244, baseType: !233, size: 64, align: 64, offset: 896)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!230, !230, !236, !128}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !217)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !162, file: !36, line: 245, baseType: !53, size: 32, align: 32, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !162, file: !36, line: 249, baseType: !240, size: 64, align: 64, offset: 1024)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!53, !50, !53}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !162, file: !36, line: 255, baseType: !244, size: 64, align: 64, offset: 1088)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!223, !50, !53, !223, !53}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !162, file: !36, line: 260, baseType: !53, size: 32, align: 32, offset: 1152)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !162, file: !36, line: 266, baseType: !223, size: 64, align: 64, offset: 1216)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !162, file: !36, line: 273, baseType: !53, size: 32, align: 32, offset: 1280)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !162, file: !36, line: 279, baseType: !223, size: 64, align: 64, offset: 1344)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !162, file: !36, line: 285, baseType: !53, size: 32, align: 32, offset: 1408)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !162, file: !36, line: 291, baseType: !53, size: 32, align: 32, offset: 1440)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !162, file: !36, line: 298, baseType: !53, size: 32, align: 32, offset: 1472)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !162, file: !36, line: 304, baseType: !53, size: 32, align: 32, offset: 1504)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !162, file: !36, line: 309, baseType: !118, size: 64, align: 64, offset: 1536)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !162, file: !36, line: 314, baseType: !118, size: 64, align: 64, offset: 1600)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !162, file: !36, line: 319, baseType: !258, size: 64, align: 64, offset: 1664)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!53, !50, !216, !53, !35, !223}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !162, file: !36, line: 326, baseType: !53, size: 32, align: 32, offset: 1728)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !162, file: !36, line: 331, baseType: !35, size: 32, align: 32, offset: 1760)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !162, file: !36, line: 332, baseType: !223, size: 64, align: 64, offset: 1792)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !162, file: !36, line: 338, baseType: !265, size: 64, align: 64, offset: 1856)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!53, !50}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !162, file: !36, line: 340, baseType: !223, size: 64, align: 64, offset: 1920)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !162, file: !36, line: 346, baseType: !206, size: 64, align: 64, offset: 1984)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !162, file: !36, line: 351, baseType: !53, size: 32, align: 32, offset: 2048)
!271 = !DILocation(line: 100, column: 18, scope: !96)
!272 = !DILocalVariable(name: "file_size", scope: !96, file: !97, line: 101, type: !53)
!273 = !DILocation(line: 101, column: 9, scope: !96)
!274 = !DILocalVariable(name: "dnn_size", scope: !96, file: !97, line: 101, type: !53)
!275 = !DILocation(line: 101, column: 20, scope: !96)
!276 = !DILocalVariable(name: "kernel_size", scope: !96, file: !97, line: 101, type: !53)
!277 = !DILocation(line: 101, column: 30, scope: !96)
!278 = !DILocalVariable(name: "i", scope: !96, file: !97, line: 101, type: !53)
!279 = !DILocation(line: 101, column: 43, scope: !96)
!280 = !DILocalVariable(name: "layer", scope: !96, file: !97, line: 102, type: !51)
!281 = !DILocation(line: 102, column: 13, scope: !96)
!282 = !DILocalVariable(name: "layer_type", scope: !96, file: !97, line: 103, type: !64)
!283 = !DILocation(line: 103, column: 18, scope: !96)
!284 = !DILocalVariable(name: "conv_params", scope: !96, file: !97, line: 104, type: !77)
!285 = !DILocation(line: 104, column: 26, scope: !96)
!286 = !DILocalVariable(name: "depth_to_space_params", scope: !96, file: !97, line: 105, type: !88)
!287 = !DILocation(line: 105, column: 25, scope: !96)
!288 = !DILocation(line: 107, column: 13, scope: !96)
!289 = !DILocation(line: 107, column: 11, scope: !96)
!290 = !DILocation(line: 108, column: 10, scope: !291)
!291 = distinct !DILexicalBlock(scope: !96, file: !97, line: 108, column: 9)
!292 = !DILocation(line: 108, column: 9, scope: !96)
!293 = !DILocation(line: 109, column: 9, scope: !294)
!294 = distinct !DILexicalBlock(scope: !291, file: !97, line: 108, column: 16)
!295 = !DILocation(line: 112, column: 40, scope: !296)
!296 = distinct !DILexicalBlock(scope: !96, file: !97, line: 112, column: 9)
!297 = !DILocation(line: 112, column: 9, scope: !296)
!298 = !DILocation(line: 112, column: 59, scope: !296)
!299 = !DILocation(line: 112, column: 9, scope: !96)
!300 = !DILocation(line: 113, column: 18, scope: !301)
!301 = distinct !DILexicalBlock(scope: !296, file: !97, line: 112, column: 63)
!302 = !DILocation(line: 113, column: 9, scope: !301)
!303 = !DILocation(line: 114, column: 9, scope: !301)
!304 = !DILocation(line: 116, column: 27, scope: !96)
!305 = !DILocation(line: 116, column: 17, scope: !96)
!306 = !DILocation(line: 116, column: 15, scope: !96)
!307 = !DILocation(line: 118, column: 15, scope: !96)
!308 = !DILocation(line: 118, column: 13, scope: !96)
!309 = !DILocation(line: 119, column: 10, scope: !310)
!310 = distinct !DILexicalBlock(scope: !96, file: !97, line: 119, column: 9)
!311 = !DILocation(line: 119, column: 9, scope: !96)
!312 = !DILocation(line: 120, column: 9, scope: !313)
!313 = distinct !DILexicalBlock(scope: !310, file: !97, line: 119, column: 18)
!314 = !DILocation(line: 121, column: 18, scope: !313)
!315 = !DILocation(line: 121, column: 9, scope: !313)
!316 = !DILocation(line: 122, column: 9, scope: !313)
!317 = !DILocation(line: 124, column: 28, scope: !96)
!318 = !DILocation(line: 124, column: 20, scope: !96)
!319 = !DILocation(line: 124, column: 5, scope: !96)
!320 = !DILocation(line: 124, column: 12, scope: !96)
!321 = !DILocation(line: 124, column: 18, scope: !96)
!322 = !DILocation(line: 126, column: 50, scope: !96)
!323 = !DILocation(line: 126, column: 40, scope: !96)
!324 = !DILocation(line: 126, column: 29, scope: !96)
!325 = !DILocation(line: 126, column: 5, scope: !96)
!326 = !DILocation(line: 126, column: 14, scope: !96)
!327 = !DILocation(line: 126, column: 25, scope: !96)
!328 = !DILocation(line: 127, column: 14, scope: !96)
!329 = !DILocation(line: 129, column: 33, scope: !96)
!330 = !DILocation(line: 129, column: 42, scope: !96)
!331 = !DILocation(line: 129, column: 53, scope: !96)
!332 = !DILocation(line: 129, column: 23, scope: !96)
!333 = !DILocation(line: 129, column: 5, scope: !96)
!334 = !DILocation(line: 129, column: 14, scope: !96)
