; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--aadec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--aadec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }

!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVRounding", file: !939, line: 79, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "./libavutil/mathematics.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!940 = !{!941, !942, !943, !944, !945, !946}
!941 = !DIEnumerator(name: "AV_ROUND_ZERO", value: 0)
!942 = !DIEnumerator(name: "AV_ROUND_INF", value: 1)
!943 = !DIEnumerator(name: "AV_ROUND_DOWN", value: 2)
!944 = !DIEnumerator(name: "AV_ROUND_UP", value: 3)
!945 = !DIEnumerator(name: "AV_ROUND_NEAR_INF", value: 5)
!946 = !DIEnumerator(name: "AV_ROUND_PASS_MINMAX", value: 8192)
!947 = !{!948, !957, !956, !958}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !951, line: 221, size: 32, align: 8, elements: !952)
!951 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!952 = !{!953}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !950, file: !951, line: 221, baseType: !954, size: 32, align: 32)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !955, line: 51, baseType: !956)
!955 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!956 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!957 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!959 = !{!960, !2206, !2207}
!960 = distinct !DIGlobalVariable(name: "ff_aa_demuxer", scope: !0, file: !961, line: 399, type: !962, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_aa_demuxer)
!961 = !DIFile(filename: "libavformat/aadec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !964)
!964 = !{!965, !969, !970, !971, !972, !982, !1064, !1065, !1067, !1068, !1069, !1083, !2187, !2188, !2189, !2193, !2197, !2198, !2199, !2203, !2204, !2205}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !963, file: !919, line: 638, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !963, file: !919, line: 645, baseType: !966, size: 64, align: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !963, file: !919, line: 652, baseType: !957, size: 32, align: 32, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !963, file: !919, line: 659, baseType: !966, size: 64, align: 64, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !963, file: !919, line: 661, baseType: !973, size: 64, align: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !978, line: 44, size: 64, align: 32, elements: !979)
!978 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !977, file: !978, line: 45, baseType: !3, size: 32, align: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !977, file: !978, line: 46, baseType: !956, size: 32, align: 32, offset: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !963, file: !919, line: 663, baseType: !983, size: 64, align: 64, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !987)
!987 = !{!988, !989, !994, !1023, !1024, !1025, !1026, !1030, !1036, !1038, !1042}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !986, file: !486, line: 72, baseType: !966, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !986, file: !486, line: 78, baseType: !990, size: 64, align: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!966, !993}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !986, file: !486, line: 85, baseType: !995, size: 64, align: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !998)
!998 = !{!999, !1000, !1001, !1002, !1003, !1019, !1020, !1021, !1022}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !997, file: !464, line: 247, baseType: !966, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !997, file: !464, line: 253, baseType: !966, size: 64, align: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !997, file: !464, line: 259, baseType: !957, size: 32, align: 32, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !997, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !997, file: !464, line: 271, baseType: !1004, size: 64, align: 64, offset: 192)
!1004 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !997, file: !464, line: 265, size: 64, align: 64, elements: !1005)
!1005 = !{!1006, !1009, !1011, !1012}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1004, file: !464, line: 266, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !955, line: 40, baseType: !1008)
!1008 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1004, file: !464, line: 267, baseType: !1010, size: 64, align: 64)
!1010 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1004, file: !464, line: 268, baseType: !966, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1004, file: !464, line: 270, baseType: !1013, size: 64, align: 32)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1014, line: 61, baseType: !1015)
!1014 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1014, line: 58, size: 64, align: 32, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1015, file: !1014, line: 59, baseType: !957, size: 32, align: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1015, file: !1014, line: 60, baseType: !957, size: 32, align: 32, offset: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !997, file: !464, line: 272, baseType: !1010, size: 64, align: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !997, file: !464, line: 273, baseType: !1010, size: 64, align: 64, offset: 320)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !997, file: !464, line: 275, baseType: !957, size: 32, align: 32, offset: 384)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !997, file: !464, line: 300, baseType: !966, size: 64, align: 64, offset: 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !986, file: !486, line: 93, baseType: !957, size: 32, align: 32, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !986, file: !486, line: 99, baseType: !957, size: 32, align: 32, offset: 224)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !986, file: !486, line: 108, baseType: !957, size: 32, align: 32, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !986, file: !486, line: 113, baseType: !1027, size: 64, align: 64, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!993, !993, !993}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !986, file: !486, line: 123, baseType: !1031, size: 64, align: 64, offset: 384)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!1034, !1034}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !986, file: !486, line: 130, baseType: !1037, size: 32, align: 32, offset: 448)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !986, file: !486, line: 136, baseType: !1039, size: 64, align: 64, offset: 512)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!1037, !993}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !986, file: !486, line: 142, baseType: !1043, size: 64, align: 64, offset: 576)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!957, !1046, !993, !966, !957}
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1049)
!1049 = !{!1050, !1062, !1063}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1048, file: !464, line: 360, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059, !1060, !1061}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1054, file: !464, line: 307, baseType: !966, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1054, file: !464, line: 313, baseType: !1010, size: 64, align: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1054, file: !464, line: 313, baseType: !1010, size: 64, align: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1054, file: !464, line: 318, baseType: !1010, size: 64, align: 64, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1054, file: !464, line: 318, baseType: !1010, size: 64, align: 64, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1054, file: !464, line: 323, baseType: !957, size: 32, align: 32, offset: 320)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1048, file: !464, line: 364, baseType: !957, size: 32, align: 32, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1048, file: !464, line: 368, baseType: !957, size: 32, align: 32, offset: 96)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !963, file: !919, line: 670, baseType: !966, size: 64, align: 64, offset: 384)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !963, file: !919, line: 679, baseType: !1066, size: 64, align: 64, offset: 448)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !963, file: !919, line: 684, baseType: !957, size: 32, align: 32, offset: 512)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !963, file: !919, line: 689, baseType: !957, size: 32, align: 32, offset: 544)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !963, file: !919, line: 696, baseType: !1070, size: 64, align: 64, offset: 576)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!957, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1076)
!1076 = !{!1077, !1078, !1081, !1082}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1075, file: !919, line: 449, baseType: !966, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1075, file: !919, line: 450, baseType: !1079, size: 64, align: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1075, file: !919, line: 451, baseType: !957, size: 32, align: 32, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1075, file: !919, line: 452, baseType: !966, size: 64, align: 64, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !963, file: !919, line: 703, baseType: !1084, size: 64, align: 64, offset: 640)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!957, !1087}
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1284, !1285, !1350, !1351, !1352, !2044, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2098, !2099, !2100, !2101, !2102, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2153, !2154, !2157, !2158, !2159, !2160, !2161, !2162, !2164, !2165, !2166, !2167, !2175, !2176, !2180, !2184, !2185, !2186}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1088, file: !919, line: 1342, baseType: !983, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1088, file: !919, line: 1349, baseType: !1066, size: 64, align: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1088, file: !919, line: 1356, baseType: !1093, size: 64, align: 64, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1095)
!1095 = !{!1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1149, !1150, !1154, !1158, !1163, !1170, !1259, !1265, !1271, !1272, !1273, !1274, !1278}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1094, file: !919, line: 498, baseType: !966, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1094, file: !919, line: 504, baseType: !966, size: 64, align: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1094, file: !919, line: 505, baseType: !966, size: 64, align: 64, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1094, file: !919, line: 506, baseType: !966, size: 64, align: 64, offset: 192)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1094, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1094, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1094, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1094, file: !919, line: 517, baseType: !957, size: 32, align: 32, offset: 352)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1094, file: !919, line: 523, baseType: !973, size: 64, align: 64, offset: 384)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1094, file: !919, line: 526, baseType: !983, size: 64, align: 64, offset: 448)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1094, file: !919, line: 535, baseType: !1093, size: 64, align: 64, offset: 512)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1094, file: !919, line: 539, baseType: !957, size: 32, align: 32, offset: 576)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1094, file: !919, line: 541, baseType: !1084, size: 64, align: 64, offset: 640)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1094, file: !919, line: 549, baseType: !1110, size: 64, align: 64, offset: 704)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!957, !1087, !1113}
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1115)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1116)
!1116 = !{!1117, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1145, !1146, !1147, !1148}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1115, file: !4, line: 1451, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1120, line: 94, baseType: !1121)
!1120 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1120, line: 81, size: 192, align: 64, elements: !1122)
!1122 = !{!1123, !1127, !1130}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1121, file: !1120, line: 82, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1120, line: 73, baseType: !1126)
!1126 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1120, line: 73, flags: DIFlagFwdDecl)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1121, file: !1120, line: 89, baseType: !1128, size: 64, align: 64, offset: 64)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !955, line: 48, baseType: !1080)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1121, file: !1120, line: 93, baseType: !957, size: 32, align: 32, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1115, file: !4, line: 1461, baseType: !1007, size: 64, align: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1115, file: !4, line: 1467, baseType: !1007, size: 64, align: 64, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1115, file: !4, line: 1468, baseType: !1128, size: 64, align: 64, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1115, file: !4, line: 1469, baseType: !957, size: 32, align: 32, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1115, file: !4, line: 1470, baseType: !957, size: 32, align: 32, offset: 288)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1115, file: !4, line: 1474, baseType: !957, size: 32, align: 32, offset: 320)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1115, file: !4, line: 1479, baseType: !1138, size: 64, align: 64, offset: 384)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1141)
!1141 = !{!1142, !1143, !1144}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1140, file: !4, line: 1412, baseType: !1128, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1140, file: !4, line: 1413, baseType: !957, size: 32, align: 32, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1140, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1115, file: !4, line: 1480, baseType: !957, size: 32, align: 32, offset: 448)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1115, file: !4, line: 1486, baseType: !1007, size: 64, align: 64, offset: 512)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1115, file: !4, line: 1488, baseType: !1007, size: 64, align: 64, offset: 576)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1115, file: !4, line: 1497, baseType: !1007, size: 64, align: 64, offset: 640)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1094, file: !919, line: 550, baseType: !1084, size: 64, align: 64, offset: 768)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1094, file: !919, line: 554, baseType: !1151, size: 64, align: 64, offset: 832)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!957, !1087, !1113, !1113, !957}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1094, file: !919, line: 563, baseType: !1155, size: 64, align: 64, offset: 896)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!957, !3, !957}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1094, file: !919, line: 565, baseType: !1159, size: 64, align: 64, offset: 960)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{null, !1087, !957, !1162, !1162}
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1094, file: !919, line: 570, baseType: !1164, size: 64, align: 64, offset: 1024)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!957, !1087, !957, !993, !1167}
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1168, line: 216, baseType: !1169)
!1168 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1169 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1094, file: !919, line: 581, baseType: !1171, size: 64, align: 64, offset: 1088)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!957, !1087, !957, !1174, !956}
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1178)
!1178 = !{!1179, !1183, !1185, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1213, !1215, !1216, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1177, file: !548, line: 282, baseType: !1180, size: 512, align: 64)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1128, size: 512, align: 64, elements: !1181)
!1181 = !{!1182}
!1182 = !DISubrange(count: 8)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1177, file: !548, line: 299, baseType: !1184, size: 256, align: 32, offset: 512)
!1184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 256, align: 32, elements: !1181)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1177, file: !548, line: 315, baseType: !1186, size: 64, align: 64, offset: 768)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1177, file: !548, line: 326, baseType: !957, size: 32, align: 32, offset: 832)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1177, file: !548, line: 326, baseType: !957, size: 32, align: 32, offset: 864)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1177, file: !548, line: 334, baseType: !957, size: 32, align: 32, offset: 896)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1177, file: !548, line: 341, baseType: !957, size: 32, align: 32, offset: 928)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1177, file: !548, line: 346, baseType: !957, size: 32, align: 32, offset: 960)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1177, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1177, file: !548, line: 356, baseType: !1013, size: 64, align: 32, offset: 1024)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1177, file: !548, line: 361, baseType: !1007, size: 64, align: 64, offset: 1088)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1177, file: !548, line: 369, baseType: !1007, size: 64, align: 64, offset: 1152)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1177, file: !548, line: 377, baseType: !1007, size: 64, align: 64, offset: 1216)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1177, file: !548, line: 382, baseType: !957, size: 32, align: 32, offset: 1280)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1177, file: !548, line: 386, baseType: !957, size: 32, align: 32, offset: 1312)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1177, file: !548, line: 391, baseType: !957, size: 32, align: 32, offset: 1344)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1177, file: !548, line: 396, baseType: !993, size: 64, align: 64, offset: 1408)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1177, file: !548, line: 403, baseType: !1202, size: 512, align: 64, offset: 1472)
!1202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1203, size: 512, align: 64, elements: !1181)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !955, line: 55, baseType: !1169)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1177, file: !548, line: 410, baseType: !957, size: 32, align: 32, offset: 1984)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1177, file: !548, line: 415, baseType: !957, size: 32, align: 32, offset: 2016)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1177, file: !548, line: 420, baseType: !957, size: 32, align: 32, offset: 2048)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1177, file: !548, line: 425, baseType: !957, size: 32, align: 32, offset: 2080)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1177, file: !548, line: 435, baseType: !1007, size: 64, align: 64, offset: 2112)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1177, file: !548, line: 440, baseType: !957, size: 32, align: 32, offset: 2176)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1177, file: !548, line: 445, baseType: !1203, size: 64, align: 64, offset: 2240)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1177, file: !548, line: 459, baseType: !1212, size: 512, align: 64, offset: 2304)
!1212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1118, size: 512, align: 64, elements: !1181)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1177, file: !548, line: 473, baseType: !1214, size: 64, align: 64, offset: 2816)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1177, file: !548, line: 477, baseType: !957, size: 32, align: 32, offset: 2880)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1177, file: !548, line: 479, baseType: !1217, size: 64, align: 64, offset: 2944)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1221)
!1221 = !{!1222, !1223, !1224, !1225, !1230}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1220, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1220, file: !548, line: 203, baseType: !1128, size: 64, align: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1220, file: !548, line: 204, baseType: !957, size: 32, align: 32, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1220, file: !548, line: 205, baseType: !1226, size: 64, align: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1228, line: 86, baseType: !1229)
!1228 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1229 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1228, line: 86, flags: DIFlagFwdDecl)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1220, file: !548, line: 206, baseType: !1118, size: 64, align: 64, offset: 256)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1177, file: !548, line: 480, baseType: !957, size: 32, align: 32, offset: 3008)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1177, file: !548, line: 505, baseType: !957, size: 32, align: 32, offset: 3040)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1177, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1177, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1177, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1177, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1177, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1177, file: !548, line: 532, baseType: !1007, size: 64, align: 64, offset: 3264)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1177, file: !548, line: 539, baseType: !1007, size: 64, align: 64, offset: 3328)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1177, file: !548, line: 547, baseType: !1007, size: 64, align: 64, offset: 3392)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1177, file: !548, line: 554, baseType: !1226, size: 64, align: 64, offset: 3456)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1177, file: !548, line: 563, baseType: !957, size: 32, align: 32, offset: 3520)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1177, file: !548, line: 572, baseType: !957, size: 32, align: 32, offset: 3552)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1177, file: !548, line: 581, baseType: !957, size: 32, align: 32, offset: 3584)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1177, file: !548, line: 588, baseType: !1246, size: 64, align: 64, offset: 3648)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !955, line: 36, baseType: !1248)
!1248 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1177, file: !548, line: 593, baseType: !957, size: 32, align: 32, offset: 3712)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1177, file: !548, line: 596, baseType: !957, size: 32, align: 32, offset: 3744)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1177, file: !548, line: 599, baseType: !1118, size: 64, align: 64, offset: 3776)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1177, file: !548, line: 605, baseType: !1118, size: 64, align: 64, offset: 3840)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1177, file: !548, line: 616, baseType: !1118, size: 64, align: 64, offset: 3904)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1177, file: !548, line: 626, baseType: !1167, size: 64, align: 64, offset: 3968)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1177, file: !548, line: 627, baseType: !1167, size: 64, align: 64, offset: 4032)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1177, file: !548, line: 628, baseType: !1167, size: 64, align: 64, offset: 4096)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1177, file: !548, line: 629, baseType: !1167, size: 64, align: 64, offset: 4160)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1177, file: !548, line: 645, baseType: !1118, size: 64, align: 64, offset: 4224)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1094, file: !919, line: 587, baseType: !1260, size: 64, align: 64, offset: 1152)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!957, !1087, !1263}
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1094, file: !919, line: 592, baseType: !1266, size: 64, align: 64, offset: 1216)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!957, !1087, !1269}
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1094, file: !919, line: 597, baseType: !1266, size: 64, align: 64, offset: 1280)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1094, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1094, file: !919, line: 608, baseType: !1084, size: 64, align: 64, offset: 1408)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1094, file: !919, line: 617, baseType: !1275, size: 64, align: 64, offset: 1472)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{null, !1087}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1094, file: !919, line: 623, baseType: !1279, size: 64, align: 64, offset: 1536)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!957, !1087, !1282}
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1114)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1088, file: !919, line: 1365, baseType: !993, size: 64, align: 64, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1088, file: !919, line: 1379, baseType: !1286, size: 64, align: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1289)
!1289 = !{!1290, !1291, !1292, !1293, !1294, !1295, !1296, !1300, !1301, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1317, !1318, !1322, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1340, !1341, !1342, !1343, !1347, !1348, !1349}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1288, file: !650, line: 174, baseType: !983, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1288, file: !650, line: 226, baseType: !1079, size: 64, align: 64, offset: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1288, file: !650, line: 227, baseType: !957, size: 32, align: 32, offset: 128)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1288, file: !650, line: 228, baseType: !1079, size: 64, align: 64, offset: 192)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1288, file: !650, line: 229, baseType: !1079, size: 64, align: 64, offset: 256)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1288, file: !650, line: 233, baseType: !993, size: 64, align: 64, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1288, file: !650, line: 235, baseType: !1297, size: 64, align: 64, offset: 384)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!957, !993, !1128, !957}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1288, file: !650, line: 236, baseType: !1297, size: 64, align: 64, offset: 448)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1288, file: !650, line: 237, baseType: !1302, size: 64, align: 64, offset: 512)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!1007, !993, !1007, !957}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1288, file: !650, line: 238, baseType: !1007, size: 64, align: 64, offset: 576)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1288, file: !650, line: 239, baseType: !957, size: 32, align: 32, offset: 640)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1288, file: !650, line: 240, baseType: !957, size: 32, align: 32, offset: 672)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1288, file: !650, line: 241, baseType: !957, size: 32, align: 32, offset: 704)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1288, file: !650, line: 242, baseType: !1169, size: 64, align: 64, offset: 768)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1288, file: !650, line: 243, baseType: !1079, size: 64, align: 64, offset: 832)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1288, file: !650, line: 244, baseType: !1312, size: 64, align: 64, offset: 896)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!1169, !1169, !1315, !956}
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1129)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1288, file: !650, line: 245, baseType: !957, size: 32, align: 32, offset: 960)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1288, file: !650, line: 249, baseType: !1319, size: 64, align: 64, offset: 1024)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!957, !993, !957}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1288, file: !650, line: 255, baseType: !1323, size: 64, align: 64, offset: 1088)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!1007, !993, !957, !1007, !957}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1288, file: !650, line: 260, baseType: !957, size: 32, align: 32, offset: 1152)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1288, file: !650, line: 266, baseType: !1007, size: 64, align: 64, offset: 1216)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1288, file: !650, line: 273, baseType: !957, size: 32, align: 32, offset: 1280)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1288, file: !650, line: 279, baseType: !1007, size: 64, align: 64, offset: 1344)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1288, file: !650, line: 285, baseType: !957, size: 32, align: 32, offset: 1408)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1288, file: !650, line: 291, baseType: !957, size: 32, align: 32, offset: 1440)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1288, file: !650, line: 298, baseType: !957, size: 32, align: 32, offset: 1472)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1288, file: !650, line: 304, baseType: !957, size: 32, align: 32, offset: 1504)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1288, file: !650, line: 309, baseType: !966, size: 64, align: 64, offset: 1536)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1288, file: !650, line: 314, baseType: !966, size: 64, align: 64, offset: 1600)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1288, file: !650, line: 319, baseType: !1337, size: 64, align: 64, offset: 1664)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{!957, !993, !1128, !957, !649, !1007}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1288, file: !650, line: 326, baseType: !957, size: 32, align: 32, offset: 1728)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1288, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1288, file: !650, line: 332, baseType: !1007, size: 64, align: 64, offset: 1792)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1288, file: !650, line: 338, baseType: !1344, size: 64, align: 64, offset: 1856)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DISubroutineType(types: !1346)
!1346 = !{!957, !993}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1288, file: !650, line: 340, baseType: !1007, size: 64, align: 64, offset: 1920)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1288, file: !650, line: 346, baseType: !1079, size: 64, align: 64, offset: 1984)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1288, file: !650, line: 351, baseType: !957, size: 32, align: 32, offset: 2048)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1088, file: !919, line: 1386, baseType: !957, size: 32, align: 32, offset: 320)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1088, file: !919, line: 1393, baseType: !956, size: 32, align: 32, offset: 352)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1088, file: !919, line: 1405, baseType: !1353, size: 64, align: 64, offset: 384)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1356)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1357)
!1357 = !{!1358, !1359, !1360, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1830, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1930, !1936, !1937, !1941, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1973, !1974, !1975, !1976, !1977, !1978}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1356, file: !919, line: 866, baseType: !957, size: 32, align: 32)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1356, file: !919, line: 872, baseType: !957, size: 32, align: 32, offset: 32)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1356, file: !919, line: 878, baseType: !1361, size: 64, align: 64, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1363)
!1363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1364)
!1364 = !{!1365, !1366, !1367, !1368, !1505, !1506, !1507, !1508, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1534, !1538, !1539, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1718, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1363, file: !4, line: 1561, baseType: !983, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1363, file: !4, line: 1562, baseType: !957, size: 32, align: 32, offset: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1363, file: !4, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1363, file: !4, line: 1565, baseType: !1369, size: 64, align: 64, offset: 128)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1372)
!1372 = !{!1373, !1374, !1375, !1376, !1377, !1378, !1381, !1384, !1387, !1390, !1393, !1394, !1395, !1403, !1404, !1405, !1407, !1411, !1417, !1422, !1426, !1427, !1470, !1477, !1481, !1482, !1486, !1490, !1494, !1498, !1499, !1500}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1371, file: !4, line: 3475, baseType: !966, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1371, file: !4, line: 3480, baseType: !966, size: 64, align: 64, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1371, file: !4, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1371, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1371, file: !4, line: 3487, baseType: !957, size: 32, align: 32, offset: 192)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1371, file: !4, line: 3488, baseType: !1379, size: 64, align: 64, offset: 256)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1371, file: !4, line: 3489, baseType: !1382, size: 64, align: 64, offset: 320)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1371, file: !4, line: 3490, baseType: !1385, size: 64, align: 64, offset: 384)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1371, file: !4, line: 3491, baseType: !1388, size: 64, align: 64, offset: 448)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1371, file: !4, line: 3492, baseType: !1391, size: 64, align: 64, offset: 512)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1203)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1371, file: !4, line: 3493, baseType: !1129, size: 8, align: 8, offset: 576)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1371, file: !4, line: 3494, baseType: !983, size: 64, align: 64, offset: 640)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1371, file: !4, line: 3495, baseType: !1396, size: 64, align: 64, offset: 704)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1398)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1400)
!1400 = !{!1401, !1402}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1399, file: !4, line: 3402, baseType: !957, size: 32, align: 32)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1399, file: !4, line: 3403, baseType: !966, size: 64, align: 64, offset: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1371, file: !4, line: 3507, baseType: !966, size: 64, align: 64, offset: 768)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1371, file: !4, line: 3516, baseType: !957, size: 32, align: 32, offset: 832)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1371, file: !4, line: 3517, baseType: !1406, size: 64, align: 64, offset: 896)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1371, file: !4, line: 3527, baseType: !1408, size: 64, align: 64, offset: 960)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DISubroutineType(types: !1410)
!1410 = !{!957, !1361}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1371, file: !4, line: 3535, baseType: !1412, size: 64, align: 64, offset: 1024)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DISubroutineType(types: !1414)
!1414 = !{!957, !1361, !1415}
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1362)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1371, file: !4, line: 3541, baseType: !1418, size: 64, align: 64, offset: 1088)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1420)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1421)
!1421 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1371, file: !4, line: 3549, baseType: !1423, size: 64, align: 64, offset: 1152)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{null, !1406}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1371, file: !4, line: 3551, baseType: !1408, size: 64, align: 64, offset: 1216)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1371, file: !4, line: 3552, baseType: !1428, size: 64, align: 64, offset: 1280)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{!957, !1361, !1128, !957, !1431}
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1433)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1434)
!1434 = !{!1435, !1438, !1439, !1440, !1441, !1469}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1433, file: !4, line: 3921, baseType: !1436, size: 16, align: 16)
!1436 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !955, line: 49, baseType: !1437)
!1437 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1433, file: !4, line: 3922, baseType: !954, size: 32, align: 32, offset: 32)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1433, file: !4, line: 3923, baseType: !954, size: 32, align: 32, offset: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1433, file: !4, line: 3924, baseType: !956, size: 32, align: 32, offset: 96)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1433, file: !4, line: 3925, baseType: !1442, size: 64, align: 64, offset: 128)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1445)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1446)
!1446 = !{!1447, !1448, !1449, !1450, !1451, !1452, !1458, !1462, !1464, !1465, !1467, !1468}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1445, file: !4, line: 3886, baseType: !957, size: 32, align: 32)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1445, file: !4, line: 3887, baseType: !957, size: 32, align: 32, offset: 32)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1445, file: !4, line: 3888, baseType: !957, size: 32, align: 32, offset: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1445, file: !4, line: 3889, baseType: !957, size: 32, align: 32, offset: 96)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1445, file: !4, line: 3890, baseType: !957, size: 32, align: 32, offset: 128)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1445, file: !4, line: 3897, baseType: !1453, size: 768, align: 64, offset: 192)
!1453 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1454)
!1454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1455)
!1455 = !{!1456, !1457}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1454, file: !4, line: 3855, baseType: !1180, size: 512, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1454, file: !4, line: 3857, baseType: !1184, size: 256, align: 32, offset: 512)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1445, file: !4, line: 3903, baseType: !1459, size: 256, align: 64, offset: 960)
!1459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1128, size: 256, align: 64, elements: !1460)
!1460 = !{!1461}
!1461 = !DISubrange(count: 4)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1445, file: !4, line: 3904, baseType: !1463, size: 128, align: 32, offset: 1216)
!1463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 128, align: 32, elements: !1460)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1445, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1445, file: !4, line: 3908, baseType: !1466, size: 64, align: 64, offset: 1408)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1445, file: !4, line: 3915, baseType: !1466, size: 64, align: 64, offset: 1472)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1445, file: !4, line: 3917, baseType: !957, size: 32, align: 32, offset: 1536)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1433, file: !4, line: 3926, baseType: !1007, size: 64, align: 64, offset: 192)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1371, file: !4, line: 3564, baseType: !1471, size: 64, align: 64, offset: 1344)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{!957, !1361, !1113, !1474, !1476}
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64, align: 64)
!1475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1176)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1371, file: !4, line: 3566, baseType: !1478, size: 64, align: 64, offset: 1408)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{!957, !1361, !993, !1476, !1113}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1371, file: !4, line: 3567, baseType: !1408, size: 64, align: 64, offset: 1472)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1371, file: !4, line: 3576, baseType: !1483, size: 64, align: 64, offset: 1536)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DISubroutineType(types: !1485)
!1485 = !{!957, !1361, !1474}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1371, file: !4, line: 3577, baseType: !1487, size: 64, align: 64, offset: 1600)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DISubroutineType(types: !1489)
!1489 = !{!957, !1361, !1113}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1371, file: !4, line: 3584, baseType: !1491, size: 64, align: 64, offset: 1664)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!957, !1361, !1175}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1371, file: !4, line: 3589, baseType: !1495, size: 64, align: 64, offset: 1728)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{null, !1361}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1371, file: !4, line: 3594, baseType: !957, size: 32, align: 32, offset: 1792)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1371, file: !4, line: 3600, baseType: !966, size: 64, align: 64, offset: 1856)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1371, file: !4, line: 3609, baseType: !1501, size: 64, align: 64, offset: 1920)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1504)
!1504 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1363, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1363, file: !4, line: 1581, baseType: !956, size: 32, align: 32, offset: 224)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1363, file: !4, line: 1583, baseType: !993, size: 64, align: 64, offset: 256)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1363, file: !4, line: 1591, baseType: !1509, size: 64, align: 64, offset: 320)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1363, file: !4, line: 1598, baseType: !993, size: 64, align: 64, offset: 384)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1363, file: !4, line: 1606, baseType: !1007, size: 64, align: 64, offset: 448)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1363, file: !4, line: 1614, baseType: !957, size: 32, align: 32, offset: 512)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1363, file: !4, line: 1622, baseType: !957, size: 32, align: 32, offset: 544)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1363, file: !4, line: 1628, baseType: !957, size: 32, align: 32, offset: 576)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1363, file: !4, line: 1636, baseType: !957, size: 32, align: 32, offset: 608)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1363, file: !4, line: 1643, baseType: !957, size: 32, align: 32, offset: 640)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1363, file: !4, line: 1657, baseType: !1128, size: 64, align: 64, offset: 704)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1363, file: !4, line: 1658, baseType: !957, size: 32, align: 32, offset: 768)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1363, file: !4, line: 1679, baseType: !1013, size: 64, align: 32, offset: 800)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1363, file: !4, line: 1688, baseType: !957, size: 32, align: 32, offset: 864)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1363, file: !4, line: 1712, baseType: !957, size: 32, align: 32, offset: 896)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1363, file: !4, line: 1729, baseType: !957, size: 32, align: 32, offset: 928)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1363, file: !4, line: 1729, baseType: !957, size: 32, align: 32, offset: 960)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1363, file: !4, line: 1744, baseType: !957, size: 32, align: 32, offset: 992)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1363, file: !4, line: 1744, baseType: !957, size: 32, align: 32, offset: 1024)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1363, file: !4, line: 1751, baseType: !957, size: 32, align: 32, offset: 1056)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1363, file: !4, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1363, file: !4, line: 1791, baseType: !1530, size: 64, align: 64, offset: 1152)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DISubroutineType(types: !1532)
!1532 = !{null, !1533, !1474, !1476, !957, !957, !957}
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1363, file: !4, line: 1808, baseType: !1535, size: 64, align: 64, offset: 1216)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!667, !1533, !1382}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1363, file: !4, line: 1816, baseType: !957, size: 32, align: 32, offset: 1280)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1363, file: !4, line: 1825, baseType: !1540, size: 32, align: 32, offset: 1312)
!1540 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1363, file: !4, line: 1830, baseType: !957, size: 32, align: 32, offset: 1344)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1363, file: !4, line: 1838, baseType: !1540, size: 32, align: 32, offset: 1376)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1363, file: !4, line: 1846, baseType: !957, size: 32, align: 32, offset: 1408)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1363, file: !4, line: 1851, baseType: !957, size: 32, align: 32, offset: 1440)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1363, file: !4, line: 1861, baseType: !1540, size: 32, align: 32, offset: 1472)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1363, file: !4, line: 1868, baseType: !1540, size: 32, align: 32, offset: 1504)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1363, file: !4, line: 1875, baseType: !1540, size: 32, align: 32, offset: 1536)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1363, file: !4, line: 1882, baseType: !1540, size: 32, align: 32, offset: 1568)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1363, file: !4, line: 1889, baseType: !1540, size: 32, align: 32, offset: 1600)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1363, file: !4, line: 1896, baseType: !1540, size: 32, align: 32, offset: 1632)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1363, file: !4, line: 1903, baseType: !1540, size: 32, align: 32, offset: 1664)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1363, file: !4, line: 1910, baseType: !957, size: 32, align: 32, offset: 1696)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1363, file: !4, line: 1915, baseType: !957, size: 32, align: 32, offset: 1728)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1363, file: !4, line: 1926, baseType: !1476, size: 64, align: 64, offset: 1792)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1363, file: !4, line: 1935, baseType: !1013, size: 64, align: 32, offset: 1856)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1363, file: !4, line: 1942, baseType: !957, size: 32, align: 32, offset: 1920)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1363, file: !4, line: 1948, baseType: !957, size: 32, align: 32, offset: 1952)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1363, file: !4, line: 1954, baseType: !957, size: 32, align: 32, offset: 1984)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1363, file: !4, line: 1960, baseType: !957, size: 32, align: 32, offset: 2016)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1363, file: !4, line: 1984, baseType: !957, size: 32, align: 32, offset: 2048)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1363, file: !4, line: 1991, baseType: !957, size: 32, align: 32, offset: 2080)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1363, file: !4, line: 1996, baseType: !957, size: 32, align: 32, offset: 2112)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1363, file: !4, line: 2004, baseType: !957, size: 32, align: 32, offset: 2144)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1363, file: !4, line: 2011, baseType: !957, size: 32, align: 32, offset: 2176)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1363, file: !4, line: 2018, baseType: !957, size: 32, align: 32, offset: 2208)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1363, file: !4, line: 2027, baseType: !957, size: 32, align: 32, offset: 2240)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1363, file: !4, line: 2034, baseType: !957, size: 32, align: 32, offset: 2272)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1363, file: !4, line: 2044, baseType: !957, size: 32, align: 32, offset: 2304)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1363, file: !4, line: 2054, baseType: !1570, size: 64, align: 64, offset: 2368)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1363, file: !4, line: 2061, baseType: !1570, size: 64, align: 64, offset: 2432)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1363, file: !4, line: 2066, baseType: !957, size: 32, align: 32, offset: 2496)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1363, file: !4, line: 2070, baseType: !957, size: 32, align: 32, offset: 2528)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1363, file: !4, line: 2078, baseType: !957, size: 32, align: 32, offset: 2560)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1363, file: !4, line: 2085, baseType: !957, size: 32, align: 32, offset: 2592)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1363, file: !4, line: 2092, baseType: !957, size: 32, align: 32, offset: 2624)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1363, file: !4, line: 2099, baseType: !957, size: 32, align: 32, offset: 2656)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1363, file: !4, line: 2106, baseType: !957, size: 32, align: 32, offset: 2688)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1363, file: !4, line: 2113, baseType: !957, size: 32, align: 32, offset: 2720)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1363, file: !4, line: 2120, baseType: !957, size: 32, align: 32, offset: 2752)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1363, file: !4, line: 2125, baseType: !957, size: 32, align: 32, offset: 2784)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1363, file: !4, line: 2133, baseType: !957, size: 32, align: 32, offset: 2816)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1363, file: !4, line: 2140, baseType: !957, size: 32, align: 32, offset: 2848)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1363, file: !4, line: 2145, baseType: !957, size: 32, align: 32, offset: 2880)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1363, file: !4, line: 2153, baseType: !957, size: 32, align: 32, offset: 2912)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1363, file: !4, line: 2158, baseType: !957, size: 32, align: 32, offset: 2944)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1363, file: !4, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1363, file: !4, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1363, file: !4, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1363, file: !4, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1363, file: !4, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1363, file: !4, line: 2203, baseType: !957, size: 32, align: 32, offset: 3136)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1363, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1363, file: !4, line: 2212, baseType: !957, size: 32, align: 32, offset: 3200)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1363, file: !4, line: 2213, baseType: !957, size: 32, align: 32, offset: 3232)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1363, file: !4, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1363, file: !4, line: 2232, baseType: !957, size: 32, align: 32, offset: 3296)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1363, file: !4, line: 2243, baseType: !957, size: 32, align: 32, offset: 3328)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1363, file: !4, line: 2249, baseType: !957, size: 32, align: 32, offset: 3360)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1363, file: !4, line: 2256, baseType: !957, size: 32, align: 32, offset: 3392)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1363, file: !4, line: 2263, baseType: !1203, size: 64, align: 64, offset: 3456)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1363, file: !4, line: 2270, baseType: !1203, size: 64, align: 64, offset: 3520)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1363, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1363, file: !4, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1363, file: !4, line: 2367, baseType: !1606, size: 64, align: 64, offset: 3648)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DISubroutineType(types: !1608)
!1608 = !{!957, !1533, !1175, !957}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1363, file: !4, line: 2383, baseType: !957, size: 32, align: 32, offset: 3712)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1363, file: !4, line: 2386, baseType: !1540, size: 32, align: 32, offset: 3744)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1363, file: !4, line: 2387, baseType: !1540, size: 32, align: 32, offset: 3776)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1363, file: !4, line: 2394, baseType: !957, size: 32, align: 32, offset: 3808)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1363, file: !4, line: 2401, baseType: !957, size: 32, align: 32, offset: 3840)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1363, file: !4, line: 2408, baseType: !957, size: 32, align: 32, offset: 3872)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1363, file: !4, line: 2415, baseType: !957, size: 32, align: 32, offset: 3904)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1363, file: !4, line: 2422, baseType: !957, size: 32, align: 32, offset: 3936)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1363, file: !4, line: 2423, baseType: !1618, size: 64, align: 64, offset: 3968)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1620)
!1620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1621)
!1621 = !{!1622, !1623, !1624, !1625}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1620, file: !4, line: 827, baseType: !957, size: 32, align: 32)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1620, file: !4, line: 828, baseType: !957, size: 32, align: 32, offset: 32)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1620, file: !4, line: 829, baseType: !957, size: 32, align: 32, offset: 64)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1620, file: !4, line: 830, baseType: !1540, size: 32, align: 32, offset: 96)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1363, file: !4, line: 2430, baseType: !1007, size: 64, align: 64, offset: 4032)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1363, file: !4, line: 2437, baseType: !1007, size: 64, align: 64, offset: 4096)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1363, file: !4, line: 2444, baseType: !1540, size: 32, align: 32, offset: 4160)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1363, file: !4, line: 2451, baseType: !1540, size: 32, align: 32, offset: 4192)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1363, file: !4, line: 2458, baseType: !957, size: 32, align: 32, offset: 4224)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1363, file: !4, line: 2469, baseType: !957, size: 32, align: 32, offset: 4256)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1363, file: !4, line: 2475, baseType: !957, size: 32, align: 32, offset: 4288)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1363, file: !4, line: 2481, baseType: !957, size: 32, align: 32, offset: 4320)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1363, file: !4, line: 2485, baseType: !957, size: 32, align: 32, offset: 4352)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1363, file: !4, line: 2489, baseType: !957, size: 32, align: 32, offset: 4384)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1363, file: !4, line: 2493, baseType: !957, size: 32, align: 32, offset: 4416)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1363, file: !4, line: 2501, baseType: !957, size: 32, align: 32, offset: 4448)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1363, file: !4, line: 2506, baseType: !957, size: 32, align: 32, offset: 4480)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1363, file: !4, line: 2510, baseType: !957, size: 32, align: 32, offset: 4512)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1363, file: !4, line: 2514, baseType: !1007, size: 64, align: 64, offset: 4544)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1363, file: !4, line: 2528, baseType: !1642, size: 64, align: 64, offset: 4608)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{null, !1533, !993, !957, !957}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1363, file: !4, line: 2534, baseType: !957, size: 32, align: 32, offset: 4672)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1363, file: !4, line: 2545, baseType: !957, size: 32, align: 32, offset: 4704)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1363, file: !4, line: 2547, baseType: !957, size: 32, align: 32, offset: 4736)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1363, file: !4, line: 2549, baseType: !957, size: 32, align: 32, offset: 4768)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1363, file: !4, line: 2551, baseType: !957, size: 32, align: 32, offset: 4800)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1363, file: !4, line: 2553, baseType: !957, size: 32, align: 32, offset: 4832)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1363, file: !4, line: 2555, baseType: !957, size: 32, align: 32, offset: 4864)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1363, file: !4, line: 2557, baseType: !957, size: 32, align: 32, offset: 4896)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1363, file: !4, line: 2559, baseType: !957, size: 32, align: 32, offset: 4928)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1363, file: !4, line: 2563, baseType: !957, size: 32, align: 32, offset: 4960)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1363, file: !4, line: 2571, baseType: !1466, size: 64, align: 64, offset: 4992)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1363, file: !4, line: 2579, baseType: !1466, size: 64, align: 64, offset: 5056)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1363, file: !4, line: 2586, baseType: !957, size: 32, align: 32, offset: 5120)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1363, file: !4, line: 2615, baseType: !957, size: 32, align: 32, offset: 5152)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1363, file: !4, line: 2627, baseType: !957, size: 32, align: 32, offset: 5184)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1363, file: !4, line: 2637, baseType: !957, size: 32, align: 32, offset: 5216)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1363, file: !4, line: 2681, baseType: !957, size: 32, align: 32, offset: 5248)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1363, file: !4, line: 2709, baseType: !1007, size: 64, align: 64, offset: 5312)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1363, file: !4, line: 2716, baseType: !1664, size: 64, align: 64, offset: 5376)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1666)
!1666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1667)
!1667 = !{!1668, !1669, !1670, !1671, !1672, !1673, !1674, !1678, !1682, !1683, !1684, !1685, !1691, !1692, !1693, !1694, !1695}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1666, file: !4, line: 3642, baseType: !966, size: 64, align: 64)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1666, file: !4, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1666, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1666, file: !4, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1666, file: !4, line: 3669, baseType: !957, size: 32, align: 32, offset: 160)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1666, file: !4, line: 3682, baseType: !1491, size: 64, align: 64, offset: 192)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1666, file: !4, line: 3698, baseType: !1675, size: 64, align: 64, offset: 256)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DISubroutineType(types: !1677)
!1677 = !{!957, !1361, !1315, !954}
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1666, file: !4, line: 3712, baseType: !1679, size: 64, align: 64, offset: 320)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DISubroutineType(types: !1681)
!1681 = !{!957, !1361, !957, !1315, !954}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1666, file: !4, line: 3726, baseType: !1675, size: 64, align: 64, offset: 384)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1666, file: !4, line: 3737, baseType: !1408, size: 64, align: 64, offset: 448)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1666, file: !4, line: 3746, baseType: !957, size: 32, align: 32, offset: 512)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1666, file: !4, line: 3757, baseType: !1686, size: 64, align: 64, offset: 576)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64, align: 64)
!1687 = !DISubroutineType(types: !1688)
!1688 = !{null, !1689}
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1690 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1666, file: !4, line: 3766, baseType: !1408, size: 64, align: 64, offset: 640)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1666, file: !4, line: 3774, baseType: !1408, size: 64, align: 64, offset: 704)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1666, file: !4, line: 3780, baseType: !957, size: 32, align: 32, offset: 768)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1666, file: !4, line: 3785, baseType: !957, size: 32, align: 32, offset: 800)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1666, file: !4, line: 3795, baseType: !1696, size: 64, align: 64, offset: 832)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!957, !1361, !1118}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1363, file: !4, line: 2728, baseType: !993, size: 64, align: 64, offset: 5440)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1363, file: !4, line: 2735, baseType: !1202, size: 512, align: 64, offset: 5504)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1363, file: !4, line: 2742, baseType: !957, size: 32, align: 32, offset: 6016)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1363, file: !4, line: 2755, baseType: !957, size: 32, align: 32, offset: 6048)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1363, file: !4, line: 2776, baseType: !957, size: 32, align: 32, offset: 6080)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1363, file: !4, line: 2783, baseType: !957, size: 32, align: 32, offset: 6112)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1363, file: !4, line: 2791, baseType: !957, size: 32, align: 32, offset: 6144)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1363, file: !4, line: 2802, baseType: !1175, size: 64, align: 64, offset: 6208)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1363, file: !4, line: 2811, baseType: !957, size: 32, align: 32, offset: 6272)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1363, file: !4, line: 2821, baseType: !957, size: 32, align: 32, offset: 6304)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1363, file: !4, line: 2830, baseType: !957, size: 32, align: 32, offset: 6336)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1363, file: !4, line: 2840, baseType: !957, size: 32, align: 32, offset: 6368)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1363, file: !4, line: 2851, baseType: !1712, size: 64, align: 64, offset: 6400)
!1712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1713, size: 64, align: 64)
!1713 = !DISubroutineType(types: !1714)
!1714 = !{!957, !1533, !1715, !993, !1476, !957, !957}
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1716 = !DISubroutineType(types: !1717)
!1717 = !{!957, !1533, !993}
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1363, file: !4, line: 2871, baseType: !1719, size: 64, align: 64, offset: 6464)
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64, align: 64)
!1720 = !DISubroutineType(types: !1721)
!1721 = !{!957, !1533, !1722, !993, !1476, !957}
!1722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1723, size: 64, align: 64)
!1723 = !DISubroutineType(types: !1724)
!1724 = !{!957, !1533, !993, !957, !957}
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1363, file: !4, line: 2878, baseType: !957, size: 32, align: 32, offset: 6528)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1363, file: !4, line: 2885, baseType: !957, size: 32, align: 32, offset: 6560)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1363, file: !4, line: 3005, baseType: !957, size: 32, align: 32, offset: 6592)
