; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h264_redundant_pps_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h264_redundant_pps_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }
%struct.AVPacket = type { %struct.AVBufferRef*, i64, i64, i8*, i32, i32, i32, %struct.AVPacketSideData*, i32, i64, i64, i64 }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!576 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!577 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!578 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!579 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !4, line: 1175, size: 32, align: 32, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!582 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!583 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!584 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!585 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!586 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!587 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!588 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!589 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!590 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!591 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!592 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!593 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!594 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!595 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!596 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!597 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!598 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!599 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!600 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!601 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!602 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!603 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!604 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!605 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!606 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!607 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!608 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!609 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!610 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !611, line: 33, size: 32, align: 32, elements: !612)
!611 = !DIFile(filename: "libavcodec/h264.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!613 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED", value: 0)
!614 = !DIEnumerator(name: "H264_NAL_SLICE", value: 1)
!615 = !DIEnumerator(name: "H264_NAL_DPA", value: 2)
!616 = !DIEnumerator(name: "H264_NAL_DPB", value: 3)
!617 = !DIEnumerator(name: "H264_NAL_DPC", value: 4)
!618 = !DIEnumerator(name: "H264_NAL_IDR_SLICE", value: 5)
!619 = !DIEnumerator(name: "H264_NAL_SEI", value: 6)
!620 = !DIEnumerator(name: "H264_NAL_SPS", value: 7)
!621 = !DIEnumerator(name: "H264_NAL_PPS", value: 8)
!622 = !DIEnumerator(name: "H264_NAL_AUD", value: 9)
!623 = !DIEnumerator(name: "H264_NAL_END_SEQUENCE", value: 10)
!624 = !DIEnumerator(name: "H264_NAL_END_STREAM", value: 11)
!625 = !DIEnumerator(name: "H264_NAL_FILLER_DATA", value: 12)
!626 = !DIEnumerator(name: "H264_NAL_SPS_EXT", value: 13)
!627 = !DIEnumerator(name: "H264_NAL_PREFIX", value: 14)
!628 = !DIEnumerator(name: "H264_NAL_SUB_SPS", value: 15)
!629 = !DIEnumerator(name: "H264_NAL_DPS", value: 16)
!630 = !DIEnumerator(name: "H264_NAL_RESERVED17", value: 17)
!631 = !DIEnumerator(name: "H264_NAL_RESERVED18", value: 18)
!632 = !DIEnumerator(name: "H264_NAL_AUXILIARY_SLICE", value: 19)
!633 = !DIEnumerator(name: "H264_NAL_EXTEN_SLICE", value: 20)
!634 = !DIEnumerator(name: "H264_NAL_DEPTH_EXTEN_SLICE", value: 21)
!635 = !DIEnumerator(name: "H264_NAL_RESERVED22", value: 22)
!636 = !DIEnumerator(name: "H264_NAL_RESERVED23", value: 23)
!637 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED24", value: 24)
!638 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED25", value: 25)
!639 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED26", value: 26)
!640 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED27", value: 27)
!641 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED28", value: 28)
!642 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED29", value: 29)
!643 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED30", value: 30)
!644 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED31", value: 31)
!645 = !{!646, !816}
!646 = distinct !DIGlobalVariable(name: "ff_h264_redundant_pps_bsf", scope: !0, file: !647, line: 191, type: !648, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_h264_redundant_pps_bsf)
!647 = !DIFile(filename: "libavcodec/h264_redundant_pps_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !651)
!651 = !{!652, !656, !659, !702, !703, !773, !811, !815}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !650, file: !4, line: 5797, baseType: !653, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !655)
!655 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !650, file: !4, line: 5804, baseType: !657, size: 64, align: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !650, file: !4, line: 5815, baseType: !660, size: 64, align: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !664)
!664 = !{!665, !666, !671, !675, !677, !678, !679, !683, !689, !691, !695}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !663, file: !464, line: 72, baseType: !653, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !663, file: !464, line: 78, baseType: !667, size: 64, align: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64, align: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!653, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !663, file: !464, line: 85, baseType: !672, size: 64, align: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !663, file: !464, line: 93, baseType: !676, size: 32, align: 32, offset: 192)
!676 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !663, file: !464, line: 99, baseType: !676, size: 32, align: 32, offset: 224)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !663, file: !464, line: 108, baseType: !676, size: 32, align: 32, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !663, file: !464, line: 113, baseType: !680, size: 64, align: 64, offset: 320)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64, align: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!670, !670, !670}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !663, file: !464, line: 123, baseType: !684, size: 64, align: 64, offset: 384)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, align: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!687, !687}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !663)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !663, file: !464, line: 130, baseType: !690, size: 32, align: 32, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !663, file: !464, line: 136, baseType: !692, size: 64, align: 64, offset: 512)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!690, !670}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !663, file: !464, line: 142, baseType: !696, size: 64, align: 64, offset: 576)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64, align: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!676, !699, !670, !653, !676}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64, align: 64)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !650, file: !4, line: 5825, baseType: !676, size: 32, align: 32, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !650, file: !4, line: 5826, baseType: !704, size: 64, align: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64, align: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!676, !707}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !710)
!710 = !{!711, !712, !715, !719, !720, !770, !771, !772}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !709, file: !4, line: 5751, baseType: !660, size: 64, align: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !709, file: !4, line: 5756, baseType: !713, size: 64, align: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !709, file: !4, line: 5762, baseType: !716, size: 64, align: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64, align: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !718)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !709, file: !4, line: 5768, baseType: !670, size: 64, align: 64, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !709, file: !4, line: 5775, baseType: !721, size: 64, align: 64, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !724)
!724 = !{!725, !726, !727, !731, !735, !736, !737, !740, !741, !742, !743, !744, !745, !746, !753, !754, !755, !756, !757, !758, !759, !760, !763, !764, !765, !766, !767, !768, !769}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !723, file: !4, line: 3940, baseType: !484, size: 32, align: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !723, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !723, file: !4, line: 3948, baseType: !728, size: 32, align: 32, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !729, line: 51, baseType: !730)
!729 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!730 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !723, file: !4, line: 3958, baseType: !732, size: 64, align: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !729, line: 48, baseType: !734)
!734 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !723, file: !4, line: 3962, baseType: !676, size: 32, align: 32, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !723, file: !4, line: 3968, baseType: !676, size: 32, align: 32, offset: 224)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !723, file: !4, line: 3973, baseType: !738, size: 64, align: 64, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !729, line: 40, baseType: !739)
!739 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !723, file: !4, line: 3986, baseType: !676, size: 32, align: 32, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !723, file: !4, line: 3999, baseType: !676, size: 32, align: 32, offset: 352)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !723, file: !4, line: 4004, baseType: !676, size: 32, align: 32, offset: 384)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !723, file: !4, line: 4005, baseType: !676, size: 32, align: 32, offset: 416)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !723, file: !4, line: 4010, baseType: !676, size: 32, align: 32, offset: 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !723, file: !4, line: 4011, baseType: !676, size: 32, align: 32, offset: 480)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !723, file: !4, line: 4020, baseType: !747, size: 64, align: 32, offset: 512)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !748, line: 61, baseType: !749)
!748 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !748, line: 58, size: 64, align: 32, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !749, file: !748, line: 59, baseType: !676, size: 32, align: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !749, file: !748, line: 60, baseType: !676, size: 32, align: 32, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !723, file: !4, line: 4025, baseType: !494, size: 32, align: 32, offset: 576)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !723, file: !4, line: 4030, baseType: !502, size: 32, align: 32, offset: 608)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !723, file: !4, line: 4031, baseType: !509, size: 32, align: 32, offset: 640)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !723, file: !4, line: 4032, baseType: !527, size: 32, align: 32, offset: 672)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !723, file: !4, line: 4033, baseType: !551, size: 32, align: 32, offset: 704)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !723, file: !4, line: 4034, baseType: !570, size: 32, align: 32, offset: 736)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !723, file: !4, line: 4039, baseType: !676, size: 32, align: 32, offset: 768)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !723, file: !4, line: 4046, baseType: !761, size: 64, align: 64, offset: 832)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !729, line: 55, baseType: !762)
!762 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !723, file: !4, line: 4050, baseType: !676, size: 32, align: 32, offset: 896)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !723, file: !4, line: 4054, baseType: !676, size: 32, align: 32, offset: 928)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !723, file: !4, line: 4061, baseType: !676, size: 32, align: 32, offset: 960)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !723, file: !4, line: 4065, baseType: !676, size: 32, align: 32, offset: 992)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !723, file: !4, line: 4073, baseType: !676, size: 32, align: 32, offset: 1024)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !723, file: !4, line: 4080, baseType: !676, size: 32, align: 32, offset: 1056)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !723, file: !4, line: 4084, baseType: !676, size: 32, align: 32, offset: 1088)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !709, file: !4, line: 5781, baseType: !721, size: 64, align: 64, offset: 320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !709, file: !4, line: 5787, baseType: !747, size: 64, align: 32, offset: 384)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !709, file: !4, line: 5793, baseType: !747, size: 64, align: 32, offset: 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !650, file: !4, line: 5827, baseType: !774, size: 64, align: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64, align: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!676, !707, !777}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64, align: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !780)
!780 = !{!781, !793, !794, !795, !796, !797, !798, !799, !807, !808, !809, !810}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !779, file: !4, line: 1451, baseType: !782, size: 64, align: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !784, line: 94, baseType: !785)
!784 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !784, line: 81, size: 192, align: 64, elements: !786)
!786 = !{!787, !791, !792}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !785, file: !784, line: 82, baseType: !788, size: 64, align: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64, align: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !784, line: 73, baseType: !790)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !784, line: 73, flags: DIFlagFwdDecl)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !785, file: !784, line: 89, baseType: !732, size: 64, align: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !785, file: !784, line: 93, baseType: !676, size: 32, align: 32, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !779, file: !4, line: 1461, baseType: !738, size: 64, align: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !779, file: !4, line: 1467, baseType: !738, size: 64, align: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !779, file: !4, line: 1468, baseType: !732, size: 64, align: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !779, file: !4, line: 1469, baseType: !676, size: 32, align: 32, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !779, file: !4, line: 1470, baseType: !676, size: 32, align: 32, offset: 288)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !779, file: !4, line: 1474, baseType: !676, size: 32, align: 32, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !779, file: !4, line: 1479, baseType: !800, size: 64, align: 64, offset: 384)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64, align: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !803)
!803 = !{!804, !805, !806}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !802, file: !4, line: 1412, baseType: !732, size: 64, align: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !802, file: !4, line: 1413, baseType: !676, size: 32, align: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !802, file: !4, line: 1414, baseType: !580, size: 32, align: 32, offset: 96)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !779, file: !4, line: 1480, baseType: !676, size: 32, align: 32, offset: 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !779, file: !4, line: 1486, baseType: !738, size: 64, align: 64, offset: 512)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !779, file: !4, line: 1488, baseType: !738, size: 64, align: 64, offset: 576)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !779, file: !4, line: 1497, baseType: !738, size: 64, align: 64, offset: 640)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !650, file: !4, line: 5828, baseType: !812, size: 64, align: 64, offset: 384)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64, align: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{null, !707}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !650, file: !4, line: 5829, baseType: !812, size: 64, align: 64, offset: 448)
!816 = distinct !DIGlobalVariable(name: "h264_redundant_pps_codec_ids", scope: !0, file: !647, line: 187, type: !817, isLocal: true, isDefinition: true, variable: [2 x i32]* @h264_redundant_pps_codec_ids)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 64, align: 32, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 2)
!820 = !{i32 2, !"Dwarf Version", i32 4}
!821 = !{i32 2, !"Debug Info Version", i32 3}
!822 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!823 = distinct !DISubprogram(name: "h264_redundant_pps_init", scope: !647, file: !647, line: 129, type: !705, isLocal: true, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !824)
!824 = !{}
!825 = !DILocalVariable(name: "bsf", arg: 1, scope: !823, file: !647, line: 129, type: !707)
!826 = !DIExpression()
!827 = !DILocation(line: 129, column: 50, scope: !823)
!828 = !DILocalVariable(name: "ctx", scope: !823, file: !647, line: 131, type: !829)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64, align: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264RedundantPPSContext", file: !647, line: 39, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264RedundantPPSContext", file: !647, line: 30, size: 640, align: 64, elements: !832)
!832 = !{!833, !851, !852, !875, !876, !877}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !831, file: !647, line: 31, baseType: !834, size: 64, align: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64, align: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamContext", file: !836, line: 204, baseType: !837)
!836 = !DIFile(filename: "libavcodec/cbs.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamContext", file: !836, line: 159, size: 384, align: 64, elements: !838)
!838 = !{!839, !840, !844, !845, !848, !849, !850}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !837, file: !836, line: 164, baseType: !670, size: 64, align: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !837, file: !836, line: 169, baseType: !841, size: 64, align: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64, align: 64)
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !843)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamType", file: !836, line: 43, flags: DIFlagFwdDecl)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !837, file: !836, line: 180, baseType: !670, size: 64, align: 64, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "decompose_unit_types", scope: !837, file: !836, line: 188, baseType: !846, size: 64, align: 64, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64, align: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamUnitType", file: !836, line: 53, baseType: !728)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "nb_decompose_unit_types", scope: !837, file: !836, line: 192, baseType: !676, size: 32, align: 32, offset: 256)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "trace_enable", scope: !837, file: !836, line: 197, baseType: !676, size: 32, align: 32, offset: 288)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !837, file: !836, line: 203, baseType: !676, size: 32, align: 32, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !831, file: !647, line: 32, baseType: !834, size: 64, align: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "access_unit", scope: !831, file: !647, line: 34, baseType: !853, size: 384, align: 64, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamFragment", file: !836, line: 154, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamFragment", file: !836, line: 116, size: 384, align: 64, elements: !855)
!855 = !{!856, !857, !860, !861, !862, !863}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !854, file: !836, line: 122, baseType: !732, size: 64, align: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !854, file: !836, line: 129, baseType: !858, size: 64, align: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !859, line: 216, baseType: !762)
!859 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!860 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_padding", scope: !854, file: !836, line: 133, baseType: !858, size: 64, align: 64, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !854, file: !836, line: 139, baseType: !782, size: 64, align: 64, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "nb_units", scope: !854, file: !836, line: 147, baseType: !676, size: 32, align: 32, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !854, file: !836, line: 153, baseType: !864, size: 64, align: 64, offset: 320)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64, align: 64)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamUnit", file: !836, line: 107, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamUnit", file: !836, line: 64, size: 448, align: 64, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !866, file: !836, line: 68, baseType: !847, size: 32, align: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !866, file: !836, line: 75, baseType: !732, size: 64, align: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !866, file: !836, line: 80, baseType: !858, size: 64, align: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_padding", scope: !866, file: !836, line: 86, baseType: !858, size: 64, align: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !866, file: !836, line: 92, baseType: !782, size: 64, align: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "content", scope: !866, file: !836, line: 101, baseType: !670, size: 64, align: 64, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "content_ref", scope: !866, file: !836, line: 106, baseType: !782, size: 64, align: 64, offset: 384)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "global_pic_init_qp", scope: !831, file: !647, line: 36, baseType: !676, size: 32, align: 32, offset: 512)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "current_pic_init_qp", scope: !831, file: !647, line: 37, baseType: !676, size: 32, align: 32, offset: 544)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_pic_init_qp", scope: !831, file: !647, line: 38, baseType: !676, size: 32, align: 32, offset: 576)
!878 = !DILocation(line: 131, column: 30, scope: !823)
!879 = !DILocation(line: 131, column: 36, scope: !823)
!880 = !DILocation(line: 131, column: 41, scope: !823)
!881 = !DILocalVariable(name: "au", scope: !823, file: !647, line: 132, type: !882)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64, align: 64)
!883 = !DILocation(line: 132, column: 29, scope: !823)
!884 = !DILocation(line: 132, column: 35, scope: !823)
!885 = !DILocation(line: 132, column: 40, scope: !823)
!886 = !DILocalVariable(name: "err", scope: !823, file: !647, line: 133, type: !676)
!887 = !DILocation(line: 133, column: 9, scope: !823)
!888 = !DILocalVariable(name: "i", scope: !823, file: !647, line: 133, type: !676)
!889 = !DILocation(line: 133, column: 14, scope: !823)
!890 = !DILocation(line: 135, column: 24, scope: !823)
!891 = !DILocation(line: 135, column: 29, scope: !823)
!892 = !DILocation(line: 135, column: 54, scope: !823)
!893 = !DILocation(line: 135, column: 11, scope: !823)
!894 = !DILocation(line: 135, column: 9, scope: !823)
!895 = !DILocation(line: 136, column: 9, scope: !896)
!896 = distinct !DILexicalBlock(scope: !823, file: !647, line: 136, column: 9)
!897 = !DILocation(line: 136, column: 13, scope: !896)
!898 = !DILocation(line: 136, column: 9, scope: !823)
!899 = !DILocation(line: 137, column: 16, scope: !896)
!900 = !DILocation(line: 137, column: 9, scope: !896)
!901 = !DILocation(line: 139, column: 24, scope: !823)
!902 = !DILocation(line: 139, column: 29, scope: !823)
!903 = !DILocation(line: 139, column: 55, scope: !823)
!904 = !DILocation(line: 139, column: 11, scope: !823)
!905 = !DILocation(line: 139, column: 9, scope: !823)
!906 = !DILocation(line: 140, column: 9, scope: !907)
!907 = distinct !DILexicalBlock(scope: !823, file: !647, line: 140, column: 9)
!908 = !DILocation(line: 140, column: 13, scope: !907)
!909 = !DILocation(line: 140, column: 9, scope: !823)
!910 = !DILocation(line: 141, column: 16, scope: !907)
!911 = !DILocation(line: 141, column: 9, scope: !907)
!912 = !DILocation(line: 143, column: 5, scope: !823)
!913 = !DILocation(line: 143, column: 10, scope: !823)
!914 = !DILocation(line: 143, column: 29, scope: !823)
!915 = !DILocation(line: 145, column: 9, scope: !916)
!916 = distinct !DILexicalBlock(scope: !823, file: !647, line: 145, column: 9)
!917 = !DILocation(line: 145, column: 14, scope: !916)
!918 = !DILocation(line: 145, column: 22, scope: !916)
!919 = !DILocation(line: 145, column: 9, scope: !823)
!920 = !DILocation(line: 146, column: 37, scope: !921)
!921 = distinct !DILexicalBlock(scope: !916, file: !647, line: 145, column: 33)
!922 = !DILocation(line: 146, column: 42, scope: !921)
!923 = !DILocation(line: 146, column: 49, scope: !921)
!924 = !DILocation(line: 146, column: 53, scope: !921)
!925 = !DILocation(line: 146, column: 58, scope: !921)
!926 = !DILocation(line: 146, column: 15, scope: !921)
!927 = !DILocation(line: 146, column: 13, scope: !921)
!928 = !DILocation(line: 147, column: 13, scope: !929)
!929 = distinct !DILexicalBlock(scope: !921, file: !647, line: 147, column: 13)
!930 = !DILocation(line: 147, column: 17, scope: !929)
!931 = !DILocation(line: 147, column: 13, scope: !921)
!932 = !DILocation(line: 148, column: 20, scope: !933)
!933 = distinct !DILexicalBlock(scope: !929, file: !647, line: 147, column: 22)
!934 = !DILocation(line: 148, column: 13, scope: !933)
!935 = !DILocation(line: 149, column: 13, scope: !933)
!936 = !DILocation(line: 152, column: 16, scope: !937)
!937 = distinct !DILexicalBlock(scope: !921, file: !647, line: 152, column: 9)
!938 = !DILocation(line: 152, column: 14, scope: !937)
!939 = !DILocation(line: 152, column: 21, scope: !940)
!940 = !DILexicalBlockFile(scope: !941, file: !647, discriminator: 1)
!941 = distinct !DILexicalBlock(scope: !937, file: !647, line: 152, column: 9)
!942 = !DILocation(line: 152, column: 25, scope: !940)
!943 = !DILocation(line: 152, column: 29, scope: !940)
!944 = !DILocation(line: 152, column: 23, scope: !940)
!945 = !DILocation(line: 152, column: 9, scope: !940)
!946 = !DILocation(line: 153, column: 27, scope: !947)
!947 = distinct !DILexicalBlock(scope: !948, file: !647, line: 153, column: 17)
!948 = distinct !DILexicalBlock(scope: !941, file: !647, line: 152, column: 44)
!949 = !DILocation(line: 153, column: 17, scope: !947)
!950 = !DILocation(line: 153, column: 21, scope: !947)
!951 = !DILocation(line: 153, column: 30, scope: !947)
!952 = !DILocation(line: 153, column: 35, scope: !947)
!953 = !DILocation(line: 153, column: 17, scope: !948)
!954 = !DILocation(line: 154, column: 52, scope: !955)
!955 = distinct !DILexicalBlock(scope: !947, file: !647, line: 153, column: 52)
!956 = !DILocation(line: 154, column: 67, scope: !955)
!957 = !DILocation(line: 154, column: 57, scope: !955)
!958 = !DILocation(line: 154, column: 61, scope: !955)
!959 = !DILocation(line: 154, column: 70, scope: !955)
!960 = !DILocation(line: 154, column: 23, scope: !955)
!961 = !DILocation(line: 154, column: 21, scope: !955)
!962 = !DILocation(line: 155, column: 21, scope: !963)
!963 = distinct !DILexicalBlock(scope: !955, file: !647, line: 155, column: 21)
!964 = !DILocation(line: 155, column: 25, scope: !963)
!965 = !DILocation(line: 155, column: 21, scope: !955)
!966 = !DILocation(line: 156, column: 21, scope: !963)
!967 = !DILocation(line: 157, column: 13, scope: !955)
!968 = !DILocation(line: 158, column: 9, scope: !948)
!969 = !DILocation(line: 152, column: 40, scope: !970)
!970 = !DILexicalBlockFile(scope: !941, file: !647, discriminator: 2)
!971 = !DILocation(line: 152, column: 9, scope: !970)
!972 = distinct !{!972, !973}
!973 = !DILocation(line: 152, column: 9, scope: !921)
!974 = !DILocation(line: 160, column: 38, scope: !921)
!975 = !DILocation(line: 160, column: 43, scope: !921)
!976 = !DILocation(line: 160, column: 9, scope: !921)
!977 = !DILocation(line: 160, column: 14, scope: !921)
!978 = !DILocation(line: 160, column: 36, scope: !921)
!979 = !DILocation(line: 161, column: 38, scope: !921)
!980 = !DILocation(line: 161, column: 43, scope: !921)
!981 = !DILocation(line: 161, column: 51, scope: !921)
!982 = !DILocation(line: 161, column: 56, scope: !921)
!983 = !DILocation(line: 161, column: 65, scope: !921)
!984 = !DILocation(line: 161, column: 15, scope: !921)
!985 = !DILocation(line: 161, column: 13, scope: !921)
!986 = !DILocation(line: 162, column: 13, scope: !987)
!987 = distinct !DILexicalBlock(scope: !921, file: !647, line: 162, column: 13)
!988 = !DILocation(line: 162, column: 17, scope: !987)
!989 = !DILocation(line: 162, column: 13, scope: !921)
!990 = !DILocation(line: 163, column: 20, scope: !991)
!991 = distinct !DILexicalBlock(scope: !987, file: !647, line: 162, column: 22)
!992 = !DILocation(line: 163, column: 13, scope: !991)
!993 = !DILocation(line: 164, column: 13, scope: !991)
!994 = !DILocation(line: 166, column: 5, scope: !921)
!995 = !DILocation(line: 168, column: 9, scope: !823)
!996 = !DILocation(line: 168, column: 5, scope: !823)
!997 = !DILocation(line: 170, column: 28, scope: !823)
!998 = !DILocation(line: 170, column: 33, scope: !823)
!999 = !DILocation(line: 170, column: 41, scope: !823)
!1000 = !DILocation(line: 170, column: 5, scope: !823)
!1001 = !DILocation(line: 171, column: 12, scope: !823)
!1002 = !DILocation(line: 171, column: 5, scope: !823)
!1003 = !DILocation(line: 172, column: 1, scope: !823)
!1004 = distinct !DISubprogram(name: "h264_redundant_pps_filter", scope: !647, file: !647, line: 69, type: !775, isLocal: true, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !824)
!1005 = !DILocalVariable(name: "bsf", arg: 1, scope: !1004, file: !647, line: 69, type: !707)
!1006 = !DILocation(line: 69, column: 52, scope: !1004)
!1007 = !DILocalVariable(name: "out", arg: 2, scope: !1004, file: !647, line: 69, type: !777)
!1008 = !DILocation(line: 69, column: 67, scope: !1004)
!1009 = !DILocalVariable(name: "ctx", scope: !1004, file: !647, line: 71, type: !829)
!1010 = !DILocation(line: 71, column: 30, scope: !1004)
!1011 = !DILocation(line: 71, column: 36, scope: !1004)
!1012 = !DILocation(line: 71, column: 41, scope: !1004)
!1013 = !DILocalVariable(name: "in", scope: !1004, file: !647, line: 72, type: !777)
!1014 = !DILocation(line: 72, column: 15, scope: !1004)
!1015 = !DILocalVariable(name: "au", scope: !1004, file: !647, line: 73, type: !882)
!1016 = !DILocation(line: 73, column: 29, scope: !1004)
!1017 = !DILocation(line: 73, column: 35, scope: !1004)
!1018 = !DILocation(line: 73, column: 40, scope: !1004)
!1019 = !DILocalVariable(name: "au_has_sps", scope: !1004, file: !647, line: 74, type: !676)
!1020 = !DILocation(line: 74, column: 9, scope: !1004)
!1021 = !DILocalVariable(name: "err", scope: !1004, file: !647, line: 75, type: !676)
!1022 = !DILocation(line: 75, column: 9, scope: !1004)
!1023 = !DILocalVariable(name: "i", scope: !1004, file: !647, line: 75, type: !676)
!1024 = !DILocation(line: 75, column: 14, scope: !1004)
!1025 = !DILocation(line: 77, column: 29, scope: !1004)
!1026 = !DILocation(line: 77, column: 11, scope: !1004)
!1027 = !DILocation(line: 77, column: 9, scope: !1004)
!1028 = !DILocation(line: 78, column: 9, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1004, file: !647, line: 78, column: 9)
!1030 = !DILocation(line: 78, column: 13, scope: !1029)
!1031 = !DILocation(line: 78, column: 9, scope: !1004)
!1032 = !DILocation(line: 79, column: 16, scope: !1029)
!1033 = !DILocation(line: 79, column: 9, scope: !1029)
!1034 = !DILocation(line: 81, column: 30, scope: !1004)
!1035 = !DILocation(line: 81, column: 35, scope: !1004)
!1036 = !DILocation(line: 81, column: 42, scope: !1004)
!1037 = !DILocation(line: 81, column: 46, scope: !1004)
!1038 = !DILocation(line: 81, column: 11, scope: !1004)
!1039 = !DILocation(line: 81, column: 9, scope: !1004)
!1040 = !DILocation(line: 82, column: 9, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1004, file: !647, line: 82, column: 9)
!1042 = !DILocation(line: 82, column: 13, scope: !1041)
!1043 = !DILocation(line: 82, column: 9, scope: !1004)
!1044 = !DILocation(line: 83, column: 9, scope: !1041)
!1045 = !DILocation(line: 85, column: 16, scope: !1004)
!1046 = !DILocation(line: 86, column: 12, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1004, file: !647, line: 86, column: 5)
!1048 = !DILocation(line: 86, column: 10, scope: !1047)
!1049 = !DILocation(line: 86, column: 17, scope: !1050)
!1050 = !DILexicalBlockFile(scope: !1051, file: !647, discriminator: 1)
!1051 = distinct !DILexicalBlock(scope: !1047, file: !647, line: 86, column: 5)
!1052 = !DILocation(line: 86, column: 21, scope: !1050)
!1053 = !DILocation(line: 86, column: 25, scope: !1050)
!1054 = !DILocation(line: 86, column: 19, scope: !1050)
!1055 = !DILocation(line: 86, column: 5, scope: !1050)
!1056 = !DILocalVariable(name: "nal", scope: !1057, file: !647, line: 87, type: !864)
!1057 = distinct !DILexicalBlock(scope: !1051, file: !647, line: 86, column: 40)
!1058 = !DILocation(line: 87, column: 29, scope: !1057)
!1059 = !DILocation(line: 87, column: 46, scope: !1057)
!1060 = !DILocation(line: 87, column: 36, scope: !1057)
!1061 = !DILocation(line: 87, column: 40, scope: !1057)
!1062 = !DILocation(line: 89, column: 13, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1057, file: !647, line: 89, column: 13)
!1064 = !DILocation(line: 89, column: 18, scope: !1063)
!1065 = !DILocation(line: 89, column: 23, scope: !1063)
!1066 = !DILocation(line: 89, column: 13, scope: !1057)
!1067 = !DILocation(line: 90, column: 24, scope: !1063)
!1068 = !DILocation(line: 90, column: 13, scope: !1063)
!1069 = !DILocation(line: 91, column: 13, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1057, file: !647, line: 91, column: 13)
!1071 = !DILocation(line: 91, column: 18, scope: !1070)
!1072 = !DILocation(line: 91, column: 23, scope: !1070)
!1073 = !DILocation(line: 91, column: 13, scope: !1057)
!1074 = !DILocation(line: 92, column: 48, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1070, file: !647, line: 91, column: 40)
!1076 = !DILocation(line: 92, column: 53, scope: !1075)
!1077 = !DILocation(line: 92, column: 58, scope: !1075)
!1078 = !DILocation(line: 92, column: 19, scope: !1075)
!1079 = !DILocation(line: 92, column: 17, scope: !1075)
!1080 = !DILocation(line: 93, column: 17, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1075, file: !647, line: 93, column: 17)
!1082 = !DILocation(line: 93, column: 21, scope: !1081)
!1083 = !DILocation(line: 93, column: 17, scope: !1075)
!1084 = !DILocation(line: 94, column: 17, scope: !1081)
!1085 = !DILocation(line: 95, column: 18, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1075, file: !647, line: 95, column: 17)
!1087 = !DILocation(line: 95, column: 17, scope: !1075)
!1088 = !DILocation(line: 96, column: 24, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1086, file: !647, line: 95, column: 30)
!1090 = !DILocation(line: 97, column: 42, scope: !1089)
!1091 = !DILocation(line: 97, column: 46, scope: !1089)
!1092 = !DILocation(line: 96, column: 17, scope: !1089)
!1093 = !DILocation(line: 98, column: 42, scope: !1089)
!1094 = !DILocation(line: 98, column: 47, scope: !1089)
!1095 = !DILocation(line: 98, column: 54, scope: !1089)
!1096 = !DILocation(line: 98, column: 58, scope: !1089)
!1097 = !DILocation(line: 98, column: 23, scope: !1089)
!1098 = !DILocation(line: 98, column: 21, scope: !1089)
!1099 = !DILocation(line: 99, column: 21, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1089, file: !647, line: 99, column: 21)
!1101 = !DILocation(line: 99, column: 25, scope: !1100)
!1102 = !DILocation(line: 99, column: 21, scope: !1089)
!1103 = !DILocation(line: 100, column: 21, scope: !1100)
!1104 = !DILocation(line: 101, column: 13, scope: !1089)
!1105 = !DILocation(line: 102, column: 9, scope: !1075)
!1106 = !DILocation(line: 103, column: 13, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1057, file: !647, line: 103, column: 13)
!1108 = !DILocation(line: 103, column: 18, scope: !1107)
!1109 = !DILocation(line: 103, column: 23, scope: !1107)
!1110 = !DILocation(line: 103, column: 41, scope: !1107)
!1111 = !DILocation(line: 104, column: 13, scope: !1107)
!1112 = !DILocation(line: 104, column: 18, scope: !1107)
!1113 = !DILocation(line: 104, column: 23, scope: !1107)
!1114 = !DILocation(line: 103, column: 13, scope: !1115)
!1115 = !DILexicalBlockFile(scope: !1057, file: !647, discriminator: 1)
!1116 = !DILocalVariable(name: "slice", scope: !1117, file: !647, line: 105, type: !1118)
!1117 = distinct !DILexicalBlock(scope: !1107, file: !647, line: 104, column: 46)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264RawSlice", file: !1120, line: 431, baseType: !1121)
!1120 = !DIFile(filename: "libavcodec/cbs_h264.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264RawSlice", file: !1120, line: 424, size: 17664, align: 64, elements: !1122)
!1122 = !{!1123, !1212, !1213, !1214, !1215}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1121, file: !1120, line: 425, baseType: !1124, size: 17376, align: 32)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264RawSliceHeader", file: !1120, line: 422, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264RawSliceHeader", file: !1120, line: 346, size: 17376, align: 32, elements: !1126)
!1126 = !{!1127, !1136, !1137, !1138, !1139, !1140, !1143, !1144, !1145, !1146, !1147, !1149, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1167, !1168, !1169, !1170, !1174, !1178, !1179, !1180, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "nal_unit_header", scope: !1125, file: !1120, line: 347, baseType: !1128, size: 40, align: 8)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264RawNALUnitHeader", file: !1120, line: 47, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264RawNALUnitHeader", file: !1120, line: 40, size: 40, align: 8, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1134, !1135}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "forbidden_zero_bit", scope: !1129, file: !1120, line: 41, baseType: !733, size: 8, align: 8)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !1129, file: !1120, line: 42, baseType: !733, size: 8, align: 8, offset: 8)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "nal_unit_type", scope: !1129, file: !1120, line: 43, baseType: !733, size: 8, align: 8, offset: 16)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "svc_extension_flag", scope: !1129, file: !1120, line: 45, baseType: !733, size: 8, align: 8, offset: 24)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "avc_3d_extension_flag", scope: !1129, file: !1120, line: 46, baseType: !733, size: 8, align: 8, offset: 32)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "first_mb_in_slice", scope: !1125, file: !1120, line: 349, baseType: !728, size: 32, align: 32, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !1125, file: !1120, line: 350, baseType: !733, size: 8, align: 8, offset: 96)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !1125, file: !1120, line: 352, baseType: !733, size: 8, align: 8, offset: 104)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "colour_plane_id", scope: !1125, file: !1120, line: 354, baseType: !733, size: 8, align: 8, offset: 112)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !1125, file: !1120, line: 356, baseType: !1141, size: 16, align: 16, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !729, line: 49, baseType: !1142)
!1142 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !1125, file: !1120, line: 357, baseType: !733, size: 8, align: 8, offset: 144)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !1125, file: !1120, line: 358, baseType: !733, size: 8, align: 8, offset: 152)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !1125, file: !1120, line: 360, baseType: !1141, size: 16, align: 16, offset: 160)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_lsb", scope: !1125, file: !1120, line: 362, baseType: !1141, size: 16, align: 16, offset: 176)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt_bottom", scope: !1125, file: !1120, line: 363, baseType: !1148, size: 32, align: 32, offset: 192)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !729, line: 38, baseType: !676)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !1125, file: !1120, line: 364, baseType: !1150, size: 64, align: 32, offset: 224)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1148, size: 64, align: 32, elements: !818)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt", scope: !1125, file: !1120, line: 366, baseType: !733, size: 8, align: 8, offset: 288)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !1125, file: !1120, line: 367, baseType: !733, size: 8, align: 8, offset: 296)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_active_override_flag", scope: !1125, file: !1120, line: 369, baseType: !733, size: 8, align: 8, offset: 304)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !1125, file: !1120, line: 370, baseType: !733, size: 8, align: 8, offset: 312)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !1125, file: !1120, line: 371, baseType: !733, size: 8, align: 8, offset: 320)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_modification_flag_l0", scope: !1125, file: !1120, line: 373, baseType: !733, size: 8, align: 8, offset: 328)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_modification_flag_l1", scope: !1125, file: !1120, line: 374, baseType: !733, size: 8, align: 8, offset: 336)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "rplm_l0", scope: !1125, file: !1120, line: 379, baseType: !1159, size: 3168, align: 32, offset: 352)
!1159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1160, size: 3168, align: 32, elements: !1165)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1125, file: !1120, line: 375, size: 96, align: 32, elements: !1161)
!1161 = !{!1162, !1163, !1164}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "modification_of_pic_nums_idc", scope: !1160, file: !1120, line: 376, baseType: !733, size: 8, align: 8)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1", scope: !1160, file: !1120, line: 377, baseType: !1148, size: 32, align: 32, offset: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !1160, file: !1120, line: 378, baseType: !733, size: 8, align: 8, offset: 64)
!1165 = !{!1166}
!1166 = !DISubrange(count: 33)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "rplm_l1", scope: !1125, file: !1120, line: 379, baseType: !1159, size: 3168, align: 32, offset: 3520)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "luma_log2_weight_denom", scope: !1125, file: !1120, line: 381, baseType: !733, size: 8, align: 8, offset: 6688)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_log2_weight_denom", scope: !1125, file: !1120, line: 382, baseType: !733, size: 8, align: 8, offset: 6696)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "luma_weight_l0_flag", scope: !1125, file: !1120, line: 384, baseType: !1171, size: 256, align: 8, offset: 6704)
!1171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !733, size: 256, align: 8, elements: !1172)
!1172 = !{!1173}
!1173 = !DISubrange(count: 32)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "luma_weight_l0", scope: !1125, file: !1120, line: 385, baseType: !1175, size: 256, align: 8, offset: 6960)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1176, size: 256, align: 8, elements: !1172)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !729, line: 36, baseType: !1177)
!1177 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "luma_offset_l0", scope: !1125, file: !1120, line: 386, baseType: !1175, size: 256, align: 8, offset: 7216)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_weight_l0_flag", scope: !1125, file: !1120, line: 387, baseType: !1171, size: 256, align: 8, offset: 7472)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_weight_l0", scope: !1125, file: !1120, line: 388, baseType: !1181, size: 512, align: 8, offset: 7728)
!1181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1176, size: 512, align: 8, elements: !1182)
!1182 = !{!1173, !819}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_offset_l0", scope: !1125, file: !1120, line: 389, baseType: !1181, size: 512, align: 8, offset: 8240)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "luma_weight_l1_flag", scope: !1125, file: !1120, line: 391, baseType: !1171, size: 256, align: 8, offset: 8752)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "luma_weight_l1", scope: !1125, file: !1120, line: 392, baseType: !1175, size: 256, align: 8, offset: 9008)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "luma_offset_l1", scope: !1125, file: !1120, line: 393, baseType: !1175, size: 256, align: 8, offset: 9264)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_weight_l1_flag", scope: !1125, file: !1120, line: 394, baseType: !1171, size: 256, align: 8, offset: 9520)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_weight_l1", scope: !1125, file: !1120, line: 395, baseType: !1181, size: 512, align: 8, offset: 9776)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_offset_l1", scope: !1125, file: !1120, line: 396, baseType: !1181, size: 512, align: 8, offset: 10288)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !1125, file: !1120, line: 398, baseType: !733, size: 8, align: 8, offset: 10800)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !1125, file: !1120, line: 399, baseType: !733, size: 8, align: 8, offset: 10808)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_marking_mode_flag", scope: !1125, file: !1120, line: 401, baseType: !733, size: 8, align: 8, offset: 10816)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !1125, file: !1120, line: 408, baseType: !1194, size: 6432, align: 32, offset: 10848)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1195, size: 6432, align: 32, elements: !1202)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1125, file: !1120, line: 402, size: 96, align: 32, elements: !1196)
!1196 = !{!1197, !1198, !1199, !1200, !1201}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !1195, file: !1120, line: 403, baseType: !733, size: 8, align: 8)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !1195, file: !1120, line: 404, baseType: !1148, size: 32, align: 32, offset: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !1195, file: !1120, line: 405, baseType: !733, size: 8, align: 8, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !1195, file: !1120, line: 406, baseType: !733, size: 8, align: 8, offset: 72)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !1195, file: !1120, line: 407, baseType: !733, size: 8, align: 8, offset: 80)
!1202 = !{!1203}
!1203 = !DISubrange(count: 67)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "cabac_init_idc", scope: !1125, file: !1120, line: 410, baseType: !733, size: 8, align: 8, offset: 17280)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !1125, file: !1120, line: 412, baseType: !1176, size: 8, align: 8, offset: 17288)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "sp_for_switch_flag", scope: !1125, file: !1120, line: 414, baseType: !733, size: 8, align: 8, offset: 17296)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qs_delta", scope: !1125, file: !1120, line: 415, baseType: !1176, size: 8, align: 8, offset: 17304)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "disable_deblocking_filter_idc", scope: !1125, file: !1120, line: 417, baseType: !733, size: 8, align: 8, offset: 17312)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "slice_alpha_c0_offset_div2", scope: !1125, file: !1120, line: 418, baseType: !1176, size: 8, align: 8, offset: 17320)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "slice_beta_offset_div2", scope: !1125, file: !1120, line: 419, baseType: !1176, size: 8, align: 8, offset: 17328)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_cycle", scope: !1125, file: !1120, line: 421, baseType: !1141, size: 16, align: 16, offset: 17344)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1121, file: !1120, line: 427, baseType: !732, size: 64, align: 64, offset: 17408)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1121, file: !1120, line: 428, baseType: !858, size: 64, align: 64, offset: 17472)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_start", scope: !1121, file: !1120, line: 429, baseType: !676, size: 32, align: 32, offset: 17536)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !1121, file: !1120, line: 430, baseType: !782, size: 64, align: 64, offset: 17600)
!1216 = !DILocation(line: 105, column: 27, scope: !1117)
!1217 = !DILocation(line: 105, column: 35, scope: !1117)
!1218 = !DILocation(line: 105, column: 40, scope: !1117)
!1219 = !DILocation(line: 106, column: 44, scope: !1117)
!1220 = !DILocation(line: 106, column: 50, scope: !1117)
!1221 = !DILocation(line: 106, column: 57, scope: !1117)
!1222 = !DILocation(line: 106, column: 13, scope: !1117)
!1223 = !DILocation(line: 107, column: 9, scope: !1117)
!1224 = !DILocation(line: 108, column: 5, scope: !1057)
!1225 = !DILocation(line: 86, column: 36, scope: !1226)
!1226 = !DILexicalBlockFile(scope: !1051, file: !647, discriminator: 2)
!1227 = !DILocation(line: 86, column: 5, scope: !1226)
!1228 = distinct !{!1228, !1229}
!1229 = !DILocation(line: 86, column: 5, scope: !1004)
!1230 = !DILocation(line: 110, column: 31, scope: !1004)
!1231 = !DILocation(line: 110, column: 36, scope: !1004)
!1232 = !DILocation(line: 110, column: 44, scope: !1004)
!1233 = !DILocation(line: 110, column: 49, scope: !1004)
!1234 = !DILocation(line: 110, column: 11, scope: !1004)
!1235 = !DILocation(line: 110, column: 9, scope: !1004)
!1236 = !DILocation(line: 111, column: 9, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1004, file: !647, line: 111, column: 9)
!1238 = !DILocation(line: 111, column: 13, scope: !1237)
!1239 = !DILocation(line: 111, column: 9, scope: !1004)
!1240 = !DILocation(line: 112, column: 9, scope: !1237)
!1241 = !DILocation(line: 115, column: 32, scope: !1004)
!1242 = !DILocation(line: 115, column: 37, scope: !1004)
!1243 = !DILocation(line: 115, column: 11, scope: !1004)
!1244 = !DILocation(line: 115, column: 9, scope: !1004)
!1245 = !DILocation(line: 116, column: 9, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1004, file: !647, line: 116, column: 9)
!1247 = !DILocation(line: 116, column: 13, scope: !1246)
!1248 = !DILocation(line: 116, column: 9, scope: !1004)
!1249 = !DILocation(line: 117, column: 9, scope: !1246)
!1250 = !DILocation(line: 119, column: 9, scope: !1004)
!1251 = !DILocation(line: 119, column: 5, scope: !1004)
!1252 = !DILocation(line: 121, column: 28, scope: !1004)
!1253 = !DILocation(line: 121, column: 33, scope: !1004)
!1254 = !DILocation(line: 121, column: 41, scope: !1004)
!1255 = !DILocation(line: 121, column: 5, scope: !1004)
!1256 = !DILocation(line: 122, column: 5, scope: !1004)
!1257 = !DILocation(line: 123, column: 9, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1004, file: !647, line: 123, column: 9)
!1259 = !DILocation(line: 123, column: 13, scope: !1258)
!1260 = !DILocation(line: 123, column: 9, scope: !1004)
!1261 = !DILocation(line: 124, column: 25, scope: !1258)
!1262 = !DILocation(line: 124, column: 9, scope: !1258)
!1263 = !DILocation(line: 126, column: 12, scope: !1004)
!1264 = !DILocation(line: 126, column: 5, scope: !1004)
!1265 = !DILocation(line: 127, column: 1, scope: !1004)
!1266 = distinct !DISubprogram(name: "h264_redundant_pps_close", scope: !647, file: !647, line: 180, type: !813, isLocal: true, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !824)
!1267 = !DILocalVariable(name: "bsf", arg: 1, scope: !1266, file: !647, line: 180, type: !707)
!1268 = !DILocation(line: 180, column: 52, scope: !1266)
!1269 = !DILocalVariable(name: "ctx", scope: !1266, file: !647, line: 182, type: !829)
!1270 = !DILocation(line: 182, column: 30, scope: !1266)
!1271 = !DILocation(line: 182, column: 36, scope: !1266)
!1272 = !DILocation(line: 182, column: 41, scope: !1266)
!1273 = !DILocation(line: 183, column: 19, scope: !1266)
!1274 = !DILocation(line: 183, column: 24, scope: !1266)
!1275 = !DILocation(line: 183, column: 5, scope: !1266)
!1276 = !DILocation(line: 184, column: 19, scope: !1266)
!1277 = !DILocation(line: 184, column: 24, scope: !1266)
!1278 = !DILocation(line: 184, column: 5, scope: !1266)
!1279 = !DILocation(line: 185, column: 1, scope: !1266)
!1280 = distinct !DISubprogram(name: "h264_redundant_pps_flush", scope: !647, file: !647, line: 174, type: !813, isLocal: true, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !824)
!1281 = !DILocalVariable(name: "bsf", arg: 1, scope: !1280, file: !647, line: 174, type: !707)
!1282 = !DILocation(line: 174, column: 52, scope: !1280)
!1283 = !DILocalVariable(name: "ctx", scope: !1280, file: !647, line: 176, type: !829)
!1284 = !DILocation(line: 176, column: 30, scope: !1280)
!1285 = !DILocation(line: 176, column: 36, scope: !1280)
!1286 = !DILocation(line: 176, column: 41, scope: !1280)
!1287 = !DILocation(line: 177, column: 32, scope: !1280)
!1288 = !DILocation(line: 177, column: 37, scope: !1280)
!1289 = !DILocation(line: 177, column: 5, scope: !1280)
!1290 = !DILocation(line: 177, column: 10, scope: !1280)
!1291 = !DILocation(line: 177, column: 30, scope: !1280)
!1292 = !DILocation(line: 178, column: 1, scope: !1280)
!1293 = distinct !DISubprogram(name: "h264_redundant_pps_fixup_pps", scope: !647, file: !647, line: 42, type: !1294, isLocal: true, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !824)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!676, !829, !1296}
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264RawPPS", file: !1120, line: 226, baseType: !1298)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264RawPPS", file: !1120, line: 181, size: 7104, align: 64, elements: !1299)
!1299 = !{!1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1335, !1346, !1347}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "nal_unit_header", scope: !1298, file: !1120, line: 182, baseType: !1128, size: 40, align: 8)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !1298, file: !1120, line: 184, baseType: !733, size: 8, align: 8, offset: 40)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !1298, file: !1120, line: 185, baseType: !733, size: 8, align: 8, offset: 48)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !1298, file: !1120, line: 187, baseType: !733, size: 8, align: 8, offset: 56)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !1298, file: !1120, line: 188, baseType: !733, size: 8, align: 8, offset: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !1298, file: !1120, line: 190, baseType: !733, size: 8, align: 8, offset: 72)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !1298, file: !1120, line: 191, baseType: !733, size: 8, align: 8, offset: 80)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !1298, file: !1120, line: 192, baseType: !1308, size: 128, align: 16, offset: 96)
!1308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1141, size: 128, align: 16, elements: !1309)
!1309 = !{!1310}
!1310 = !DISubrange(count: 8)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !1298, file: !1120, line: 193, baseType: !1308, size: 128, align: 16, offset: 224)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !1298, file: !1120, line: 194, baseType: !1308, size: 128, align: 16, offset: 352)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !1298, file: !1120, line: 195, baseType: !733, size: 8, align: 8, offset: 480)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !1298, file: !1120, line: 196, baseType: !1141, size: 16, align: 16, offset: 496)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !1298, file: !1120, line: 197, baseType: !1141, size: 16, align: 16, offset: 512)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !1298, file: !1120, line: 199, baseType: !732, size: 64, align: 64, offset: 576)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id_ref", scope: !1298, file: !1120, line: 200, baseType: !782, size: 64, align: 64, offset: 640)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_default_active_minus1", scope: !1298, file: !1120, line: 202, baseType: !733, size: 8, align: 8, offset: 704)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_default_active_minus1", scope: !1298, file: !1120, line: 203, baseType: !733, size: 8, align: 8, offset: 712)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !1298, file: !1120, line: 205, baseType: !733, size: 8, align: 8, offset: 720)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !1298, file: !1120, line: 206, baseType: !733, size: 8, align: 8, offset: 728)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !1298, file: !1120, line: 208, baseType: !1176, size: 8, align: 8, offset: 736)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !1298, file: !1120, line: 209, baseType: !1176, size: 8, align: 8, offset: 744)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !1298, file: !1120, line: 210, baseType: !1176, size: 8, align: 8, offset: 752)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !1298, file: !1120, line: 212, baseType: !733, size: 8, align: 8, offset: 760)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !1298, file: !1120, line: 213, baseType: !733, size: 8, align: 8, offset: 768)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "more_rbsp_data", scope: !1298, file: !1120, line: 215, baseType: !733, size: 8, align: 8, offset: 776)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !1298, file: !1120, line: 217, baseType: !733, size: 8, align: 8, offset: 784)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !1298, file: !1120, line: 218, baseType: !733, size: 8, align: 8, offset: 792)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !1298, file: !1120, line: 220, baseType: !733, size: 8, align: 8, offset: 800)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !1298, file: !1120, line: 221, baseType: !1332, size: 96, align: 8, offset: 808)
!1332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !733, size: 96, align: 8, elements: !1333)
!1333 = !{!1334}
!1334 = !DISubrange(count: 12)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list_4x4", scope: !1298, file: !1120, line: 222, baseType: !1336, size: 3072, align: 8, offset: 904)
!1336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1337, size: 3072, align: 8, elements: !1344)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264RawScalingList", file: !1120, line: 51, baseType: !1338)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264RawScalingList", file: !1120, line: 49, size: 512, align: 8, elements: !1339)
!1339 = !{!1340}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "delta_scale", scope: !1338, file: !1120, line: 50, baseType: !1341, size: 512, align: 8)
!1341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1176, size: 512, align: 8, elements: !1342)
!1342 = !{!1343}
!1343 = !DISubrange(count: 64)
!1344 = !{!1345}
!1345 = !DISubrange(count: 6)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list_8x8", scope: !1298, file: !1120, line: 223, baseType: !1336, size: 3072, align: 8, offset: 3976)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !1298, file: !1120, line: 225, baseType: !1176, size: 8, align: 8, offset: 7048)
!1348 = !DILocalVariable(name: "ctx", arg: 1, scope: !1293, file: !647, line: 42, type: !829)
!1349 = !DILocation(line: 42, column: 66, scope: !1293)
!1350 = !DILocalVariable(name: "pps", arg: 2, scope: !1293, file: !647, line: 43, type: !1296)
!1351 = !DILocation(line: 43, column: 53, scope: !1293)
!1352 = !DILocation(line: 47, column: 32, scope: !1293)
!1353 = !DILocation(line: 47, column: 37, scope: !1293)
!1354 = !DILocation(line: 47, column: 57, scope: !1293)
!1355 = !DILocation(line: 47, column: 5, scope: !1293)
!1356 = !DILocation(line: 47, column: 10, scope: !1293)
!1357 = !DILocation(line: 47, column: 30, scope: !1293)
!1358 = !DILocation(line: 48, column: 32, scope: !1293)
!1359 = !DILocation(line: 48, column: 37, scope: !1293)
!1360 = !DILocation(line: 48, column: 56, scope: !1293)
!1361 = !DILocation(line: 48, column: 5, scope: !1293)
!1362 = !DILocation(line: 48, column: 10, scope: !1293)
!1363 = !DILocation(line: 48, column: 30, scope: !1293)
!1364 = !DILocation(line: 53, column: 5, scope: !1293)
!1365 = !DILocation(line: 53, column: 10, scope: !1293)
!1366 = !DILocation(line: 53, column: 29, scope: !1293)
!1367 = !DILocation(line: 55, column: 5, scope: !1293)
!1368 = distinct !DISubprogram(name: "h264_redundant_pps_fixup_slice", scope: !647, file: !647, line: 58, type: !1369, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !824)
!1369 = !DISubroutineType(types: !1370)
!1370 = !{!676, !829, !1371}
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1372 = !DILocalVariable(name: "ctx", arg: 1, scope: !1368, file: !647, line: 58, type: !829)
!1373 = !DILocation(line: 58, column: 68, scope: !1368)
!1374 = !DILocalVariable(name: "slice", arg: 2, scope: !1368, file: !647, line: 59, type: !1371)
!1375 = !DILocation(line: 59, column: 63, scope: !1368)
!1376 = !DILocalVariable(name: "qp", scope: !1368, file: !647, line: 61, type: !676)
!1377 = !DILocation(line: 61, column: 9, scope: !1368)
!1378 = !DILocation(line: 63, column: 10, scope: !1368)
!1379 = !DILocation(line: 63, column: 15, scope: !1368)
!1380 = !DILocation(line: 63, column: 37, scope: !1368)
!1381 = !DILocation(line: 63, column: 44, scope: !1368)
!1382 = !DILocation(line: 63, column: 35, scope: !1368)
!1383 = !DILocation(line: 63, column: 8, scope: !1368)
!1384 = !DILocation(line: 64, column: 29, scope: !1368)
!1385 = !DILocation(line: 64, column: 34, scope: !1368)
!1386 = !DILocation(line: 64, column: 39, scope: !1368)
!1387 = !DILocation(line: 64, column: 32, scope: !1368)
!1388 = !DILocation(line: 64, column: 5, scope: !1368)
!1389 = !DILocation(line: 64, column: 12, scope: !1368)
!1390 = !DILocation(line: 64, column: 27, scope: !1368)
!1391 = !DILocation(line: 66, column: 5, scope: !1368)
