; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--sbrdsp_fixed.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--sbrdsp_fixed.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SBRDSPContext = type { void (i32*)*, i64 ([2 x i32]*, i32)*, void (i32*)*, void (i32*)*, void ([2 x i32]*, i32*)*, void (i32*, i32*)*, void (i32*, i32*, i32*)*, void ([2 x i32]*, [2 x [2 x %struct.SoftFloat]]*)*, void ([2 x i32]*, [2 x i32]*, i32*, i32*, i32, i32, i32)*, void ([2 x i32]*, [40 x [2 x i32]]*, %struct.SoftFloat*, i32, i64)*, [4 x void ([2 x i32]*, %struct.SoftFloat*, %struct.SoftFloat*, i32, i32, i32)*] }
%struct.SoftFloat = type { i32, i32 }

@.str = private unnamed_addr constant [42 x i8] c"Overflow in sbr_hf_apply_noise, shift=%d\0A\00", align 1
@ff_sbr_noise_table_fixed = external constant [0 x [2 x i32]], align 4

; Function Attrs: cold nounwind optsize uwtable
define void @ff_sbrdsp_init_fixed(%struct.SBRDSPContext* %s) #0 !dbg !17 {
entry:
  %s.addr = alloca %struct.SBRDSPContext*, align 8
  store %struct.SBRDSPContext* %s, %struct.SBRDSPContext** %s.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.SBRDSPContext** %s.addr, metadata !93, metadata !94), !dbg !95
  %0 = load %struct.SBRDSPContext*, %struct.SBRDSPContext** %s.addr, align 8, !dbg !96

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--sbrdsp_fixed.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{}
!3 = !{!4, !7, !8, !9, !11, !13}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !5, line: 40, baseType: !6)
!5 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!6 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !5, line: 38, baseType: !8)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !5, line: 55, baseType: !10)
!10 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTFLOAT", file: !12, line: 37, baseType: !8)
!12 = !DIFile(filename: "libavcodec/aac_defines.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!14 = !{i32 2, !"Dwarf Version", i32 4}
!15 = !{i32 2, !"Debug Info Version", i32 3}
!16 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!17 = distinct !DISubprogram(name: "ff_sbrdsp_init_fixed", scope: !18, file: !18, line: 76, type: !19, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!18 = !DIFile(filename: "libavcodec/sbrdsp_template.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!19 = !DISubroutineType(types: !20)
!20 = !{null, !21}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBRDSPContext", file: !23, line: 45, baseType: !24)
!23 = !DIFile(filename: "libavcodec/sbrdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBRDSPContext", file: !23, line: 28, size: 896, align: 64, elements: !25)
!25 = !{!26, !31, !46, !47, !48, !54, !58, !62, !71, !75, !86}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "sum64x5", scope: !24, file: !23, line: 29, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{null, !30}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "sum_square", scope: !24, file: !23, line: 30, baseType: !32, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !42, !8}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "AAC_FLOAT", file: !12, line: 41, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "SoftFloat", file: !37, line: 37, baseType: !38)
!37 = !DIFile(filename: "./libavutil/softfloat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SoftFloat", file: !37, line: 34, size: 64, align: 32, elements: !39)
!39 = !{!40, !41}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "mant", scope: !38, file: !37, line: 35, baseType: !7, size: 32, align: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !38, file: !37, line: 36, baseType: !7, size: 32, align: 32, offset: 32)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, align: 32, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 2)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "neg_odd_64", scope: !24, file: !23, line: 31, baseType: !27, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_pre_shuffle", scope: !24, file: !23, line: 32, baseType: !27, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_post_shuffle", scope: !24, file: !23, line: 33, baseType: !49, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !42, !52}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_deint_neg", scope: !24, file: !23, line: 34, baseType: !55, size: 64, align: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !30, !52}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_deint_bfly", scope: !24, file: !23, line: 35, baseType: !59, size: 64, align: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !30, !52, !52}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "autocorrelate", scope: !24, file: !23, line: 36, baseType: !63, size: 64, align: 64, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !66, !68}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 64, align: 32, elements: !44)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 256, align: 32, elements: !70)
!70 = !{!45, !45}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "hf_gen", scope: !24, file: !23, line: 37, baseType: !72, size: 64, align: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !42, !66, !52, !52, !11, !8, !8}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "hf_g_filt", scope: !24, file: !23, line: 40, baseType: !76, size: 64, align: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !42, !79, !83, !8, !85}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 2560, align: 32, elements: !81)
!81 = !{!82, !45}
!82 = !DISubrange(count: 40)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !5, line: 119, baseType: !6)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "hf_apply_noise", scope: !24, file: !23, line: 42, baseType: !87, size: 256, align: 64, offset: 640)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 256, align: 64, elements: !91)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !42, !83, !83, !8, !8, !8}
!91 = !{!92}
!92 = !DISubrange(count: 4)
!93 = !DILocalVariable(name: "s", arg: 1, scope: !17, file: !18, line: 76, type: !21)
!94 = !DIExpression()
!95 = !DILocation(line: 76, column: 64, scope: !17)
!96 = !DILocation(line: 78, column: 5, scope: !17)
!97 = !DILocation(line: 78, column: 8, scope: !17)
!98 = !DILocation(line: 78, column: 16, scope: !17)
!99 = !DILocation(line: 79, column: 5, scope: !17)
!100 = !DILocation(line: 79, column: 8, scope: !17)
!101 = !DILocation(line: 79, column: 19, scope: !17)
!102 = !DILocation(line: 80, column: 5, scope: !17)
!103 = !DILocation(line: 80, column: 8, scope: !17)
!104 = !DILocation(line: 80, column: 19, scope: !17)
!105 = !DILocation(line: 81, column: 5, scope: !17)
!106 = !DILocation(line: 81, column: 8, scope: !17)
!107 = !DILocation(line: 81, column: 24, scope: !17)
!108 = !DILocation(line: 82, column: 5, scope: !17)
!109 = !DILocation(line: 82, column: 8, scope: !17)
!110 = !DILocation(line: 82, column: 25, scope: !17)
!111 = !DILocation(line: 83, column: 5, scope: !17)
!112 = !DILocation(line: 83, column: 8, scope: !17)
!113 = !DILocation(line: 83, column: 22, scope: !17)
!114 = !DILocation(line: 84, column: 5, scope: !17)
!115 = !DILocation(line: 84, column: 8, scope: !17)
!116 = !DILocation(line: 84, column: 23, scope: !17)
!117 = !DILocation(line: 85, column: 5, scope: !17)
!118 = !DILocation(line: 85, column: 8, scope: !17)
!119 = !DILocation(line: 85, column: 22, scope: !17)
!120 = !DILocation(line: 86, column: 5, scope: !17)
!121 = !DILocation(line: 86, column: 8, scope: !17)
!122 = !DILocation(line: 86, column: 15, scope: !17)
!123 = !DILocation(line: 87, column: 5, scope: !17)
!124 = !DILocation(line: 87, column: 8, scope: !17)
!125 = !DILocation(line: 87, column: 18, scope: !17)
!126 = !DILocation(line: 89, column: 5, scope: !17)
!127 = !DILocation(line: 89, column: 8, scope: !17)
!128 = !DILocation(line: 89, column: 26, scope: !17)
!129 = !DILocation(line: 90, column: 5, scope: !17)
!130 = !DILocation(line: 90, column: 8, scope: !17)
!131 = !DILocation(line: 90, column: 26, scope: !17)
!132 = !DILocation(line: 91, column: 5, scope: !17)
!133 = !DILocation(line: 91, column: 8, scope: !17)
!134 = !DILocation(line: 91, column: 26, scope: !17)
!135 = !DILocation(line: 92, column: 5, scope: !17)
!136 = !DILocation(line: 92, column: 8, scope: !17)
!137 = !DILocation(line: 92, column: 26, scope: !17)
!138 = !DILocation(line: 104, column: 1, scope: !17)
!139 = distinct !DISubprogram(name: "sbr_sum64x5_c", scope: !18, file: !18, line: 23, type: !28, isLocal: true, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!140 = !DILocalVariable(name: "z", arg: 1, scope: !139, file: !18, line: 23, type: !30)
!141 = !DILocation(line: 23, column: 37, scope: !139)
!142 = !DILocalVariable(name: "k", scope: !139, file: !18, line: 25, type: !8)
!143 = !DILocation(line: 25, column: 9, scope: !139)
!144 = !DILocation(line: 26, column: 12, scope: !145)
!145 = distinct !DILexicalBlock(scope: !139, file: !18, line: 26, column: 5)
!146 = !DILocation(line: 26, column: 10, scope: !145)
!147 = !DILocation(line: 26, column: 17, scope: !148)
!148 = !DILexicalBlockFile(scope: !149, file: !18, discriminator: 1)
!149 = distinct !DILexicalBlock(scope: !145, file: !18, line: 26, column: 5)
!150 = !DILocation(line: 26, column: 19, scope: !148)
!151 = !DILocation(line: 26, column: 5, scope: !148)
!152 = !DILocalVariable(name: "f", scope: !153, file: !18, line: 27, type: !11)
!153 = distinct !DILexicalBlock(scope: !149, file: !18, line: 26, column: 30)
