; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--twinvq.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--twinvq.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !895, line: 77, size: 32, align: 32, elements: !896)
!895 = !DIFile(filename: "libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!896 = !{!897, !898, !899}
!897 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!898 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!899 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !895, line: 83, size: 32, align: 32, elements: !901)
!901 = !{!902, !903}
!902 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!903 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!904 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TwinVQCodec", file: !4, line: 34, size: 32, align: 32, elements: !905)
!905 = !{!906, !907}
!906 = !DIEnumerator(name: "TWINVQ_CODEC_VQF", value: 0)
!907 = !DIEnumerator(name: "TWINVQ_CODEC_METASOUND", value: 1)
!908 = !{!909, !912, !913, !914}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!912 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!913 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !916, line: 37, baseType: !917)
!916 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!917 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!918 = !{!919, !925}
!919 = distinct !DIGlobalVariable(name: "ff_twinvq_wtype_to_ftype_table", scope: !0, file: !920, line: 470, type: !921, isLocal: false, isDefinition: true, variable: [9 x i32]* @ff_twinvq_wtype_to_ftype_table)
!920 = !DIFile(filename: "libavcodec/twinvq.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !922, size: 288, align: 32, elements: !923)
!922 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!923 = !{!924}
!924 = !DISubrange(count: 9)
!925 = distinct !DIGlobalVariable(name: "wtype_to_wsize", scope: !0, file: !920, line: 325, type: !926, isLocal: true, isDefinition: true, variable: [9 x i8]* @wtype_to_wsize)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !927, size: 72, align: 8, elements: !923)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !916, line: 48, baseType: !929)
!929 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!930 = !{i32 2, !"Dwarf Version", i32 4}
!931 = !{i32 2, !"Debug Info Version", i32 3}
!932 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!933 = distinct !DISubprogram(name: "ff_twinvq_decode_frame", scope: !920, file: !920, line: 476, type: !934, isLocal: false, isDefinition: true, scopeLine: 478, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1659)
!934 = !DISubroutineType(types: !935)
!935 = !{!912, !936, !954, !1230, !1114}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !42, line: 3360, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !42, line: 1556, size: 8448, align: 64, elements: !939)
!939 = !{!940, !985, !986, !987, !1258, !1259, !1260, !1261, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1414, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1597, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !938, file: !42, line: 1561, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !11, line: 143, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !11, line: 67, size: 640, align: 64, elements: !945)
!945 = !{!946, !950, !955, !959, !960, !961, !962, !966, !972, !974, !978}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !944, file: !11, line: 72, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !944, file: !11, line: 78, baseType: !951, size: 64, align: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!947, !954}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !944, file: !11, line: 85, baseType: !956, size: 64, align: 64, offset: 128)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !11, line: 85, flags: DIFlagFwdDecl)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !944, file: !11, line: 93, baseType: !912, size: 32, align: 32, offset: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !944, file: !11, line: 99, baseType: !912, size: 32, align: 32, offset: 224)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !944, file: !11, line: 108, baseType: !912, size: 32, align: 32, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !944, file: !11, line: 113, baseType: !963, size: 64, align: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!954, !954, !954}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !944, file: !11, line: 123, baseType: !967, size: 64, align: 64, offset: 384)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!970, !970}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !944, file: !11, line: 130, baseType: !973, size: 32, align: 32, offset: 448)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !11, line: 48, baseType: !10)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !944, file: !11, line: 136, baseType: !975, size: 64, align: 64, offset: 512)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!973, !954}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !944, file: !11, line: 142, baseType: !979, size: 64, align: 64, offset: 576)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!912, !982, !954, !947, !912}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !11, line: 60, flags: DIFlagFwdDecl)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !938, file: !42, line: 1562, baseType: !912, size: 32, align: 32, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !938, file: !42, line: 1564, baseType: !31, size: 32, align: 32, offset: 96)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !938, file: !42, line: 1565, baseType: !988, size: 64, align: 64, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !42, line: 3468, size: 1984, align: 64, elements: !991)
!991 = !{!992, !993, !994, !995, !996, !997, !1006, !1009, !1012, !1015, !1020, !1021, !1022, !1030, !1031, !1032, !1034, !1038, !1044, !1054, !1058, !1059, !1110, !1231, !1233, !1234, !1238, !1242, !1247, !1251, !1252, !1253}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !990, file: !42, line: 3475, baseType: !947, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !990, file: !42, line: 3480, baseType: !947, size: 64, align: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !990, file: !42, line: 3481, baseType: !31, size: 32, align: 32, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !990, file: !42, line: 3482, baseType: !41, size: 32, align: 32, offset: 160)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !990, file: !42, line: 3487, baseType: !912, size: 32, align: 32, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !990, file: !42, line: 3488, baseType: !998, size: 64, align: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1001, line: 61, baseType: !1002)
!1001 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1001, line: 58, size: 64, align: 32, elements: !1003)
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1002, file: !1001, line: 59, baseType: !912, size: 32, align: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1002, file: !1001, line: 60, baseType: !912, size: 32, align: 32, offset: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !990, file: !42, line: 3489, baseType: !1007, size: 64, align: 64, offset: 320)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !501)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !990, file: !42, line: 3490, baseType: !1010, size: 64, align: 64, offset: 384)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !990, file: !42, line: 3491, baseType: !1013, size: 64, align: 64, offset: 448)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !701)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !990, file: !42, line: 3492, baseType: !1016, size: 64, align: 64, offset: 512)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !916, line: 55, baseType: !1019)
!1019 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !990, file: !42, line: 3493, baseType: !928, size: 8, align: 8, offset: 576)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !990, file: !42, line: 3494, baseType: !941, size: 64, align: 64, offset: 640)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !990, file: !42, line: 3495, baseType: !1023, size: 64, align: 64, offset: 704)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !42, line: 3404, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !42, line: 3401, size: 128, align: 64, elements: !1027)
!1027 = !{!1028, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1026, file: !42, line: 3402, baseType: !912, size: 32, align: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1026, file: !42, line: 3403, baseType: !947, size: 64, align: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !990, file: !42, line: 3507, baseType: !947, size: 64, align: 64, offset: 768)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !990, file: !42, line: 3516, baseType: !912, size: 32, align: 32, offset: 832)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !990, file: !42, line: 3517, baseType: !1033, size: 64, align: 64, offset: 896)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !990, file: !42, line: 3527, baseType: !1035, size: 64, align: 64, offset: 960)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!912, !936}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !990, file: !42, line: 3535, baseType: !1039, size: 64, align: 64, offset: 1024)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!912, !936, !1042}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !990, file: !42, line: 3541, baseType: !1045, size: 64, align: 64, offset: 1088)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1047)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !42, line: 3461, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1049, line: 223, size: 128, align: 64, elements: !1050)
!1049 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1050 = !{!1051, !1053}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1048, file: !1049, line: 224, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1048, file: !1049, line: 225, baseType: !1052, size: 64, align: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !990, file: !42, line: 3549, baseType: !1055, size: 64, align: 64, offset: 1152)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{null, !1033}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !990, file: !42, line: 3551, baseType: !1035, size: 64, align: 64, offset: 1216)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !990, file: !42, line: 3552, baseType: !1060, size: 64, align: 64, offset: 1280)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!912, !936, !1063, !912, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !42, line: 3920, size: 256, align: 64, elements: !1067)
!1067 = !{!1068, !1071, !1073, !1074, !1075, !1107}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1066, file: !42, line: 3921, baseType: !1069, size: 16, align: 16)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !916, line: 49, baseType: !1070)
!1070 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1066, file: !42, line: 3922, baseType: !1072, size: 32, align: 32, offset: 32)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !916, line: 51, baseType: !913)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1066, file: !42, line: 3923, baseType: !1072, size: 32, align: 32, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1066, file: !42, line: 3924, baseType: !913, size: 32, align: 32, offset: 96)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1066, file: !42, line: 3925, baseType: !1076, size: 64, align: 64, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !42, line: 3918, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !42, line: 3885, size: 1600, align: 64, elements: !1080)
!1080 = !{!1081, !1082, !1083, !1084, !1085, !1086, !1096, !1100, !1102, !1103, !1105, !1106}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1079, file: !42, line: 3886, baseType: !912, size: 32, align: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1079, file: !42, line: 3887, baseType: !912, size: 32, align: 32, offset: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1079, file: !42, line: 3888, baseType: !912, size: 32, align: 32, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1079, file: !42, line: 3889, baseType: !912, size: 32, align: 32, offset: 96)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1079, file: !42, line: 3890, baseType: !912, size: 32, align: 32, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1079, file: !42, line: 3897, baseType: !1087, size: 768, align: 64, offset: 192)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !42, line: 3858, baseType: !1088)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !42, line: 3853, size: 768, align: 64, elements: !1089)
!1089 = !{!1090, !1094}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1088, file: !42, line: 3855, baseType: !1091, size: 512, align: 64)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1063, size: 512, align: 64, elements: !1092)
!1092 = !{!1093}
!1093 = !DISubrange(count: 8)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1088, file: !42, line: 3857, baseType: !1095, size: 256, align: 32, offset: 512)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 256, align: 32, elements: !1092)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1079, file: !42, line: 3903, baseType: !1097, size: 256, align: 64, offset: 960)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1063, size: 256, align: 64, elements: !1098)
!1098 = !{!1099}
!1099 = !DISubrange(count: 4)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1079, file: !42, line: 3904, baseType: !1101, size: 128, align: 32, offset: 1216)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 128, align: 32, elements: !1098)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1079, file: !42, line: 3906, baseType: !718, size: 32, align: 32, offset: 1344)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1079, file: !42, line: 3908, baseType: !1104, size: 64, align: 64, offset: 1408)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1079, file: !42, line: 3915, baseType: !1104, size: 64, align: 64, offset: 1472)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1079, file: !42, line: 3917, baseType: !912, size: 32, align: 32, offset: 1536)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1066, file: !42, line: 3926, baseType: !1108, size: 64, align: 64, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !916, line: 40, baseType: !1109)
!1109 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !990, file: !42, line: 3564, baseType: !1111, size: 64, align: 64, offset: 1344)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!912, !936, !1114, !1148, !1230}
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !42, line: 1499, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !42, line: 1445, size: 704, align: 64, elements: !1117)
!1117 = !{!1118, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1144, !1145, !1146, !1147}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1116, file: !42, line: 1451, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1121, line: 94, baseType: !1122)
!1121 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1121, line: 81, size: 192, align: 64, elements: !1123)
!1123 = !{!1124, !1128, !1129}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1122, file: !1121, line: 82, baseType: !1125, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1121, line: 73, baseType: !1127)
!1127 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1121, line: 73, flags: DIFlagFwdDecl)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1122, file: !1121, line: 89, baseType: !1063, size: 64, align: 64, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1122, file: !1121, line: 93, baseType: !912, size: 32, align: 32, offset: 128)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1116, file: !42, line: 1461, baseType: !1108, size: 64, align: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1116, file: !42, line: 1467, baseType: !1108, size: 64, align: 64, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1116, file: !42, line: 1468, baseType: !1063, size: 64, align: 64, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1116, file: !42, line: 1469, baseType: !912, size: 32, align: 32, offset: 256)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1116, file: !42, line: 1470, baseType: !912, size: 32, align: 32, offset: 288)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1116, file: !42, line: 1474, baseType: !912, size: 32, align: 32, offset: 320)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1116, file: !42, line: 1479, baseType: !1137, size: 64, align: 64, offset: 384)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !42, line: 1415, baseType: !1139)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !42, line: 1411, size: 128, align: 64, elements: !1140)
!1140 = !{!1141, !1142, !1143}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1139, file: !42, line: 1412, baseType: !1063, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1139, file: !42, line: 1413, baseType: !912, size: 32, align: 32, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1139, file: !42, line: 1414, baseType: !724, size: 32, align: 32, offset: 96)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1116, file: !42, line: 1480, baseType: !912, size: 32, align: 32, offset: 448)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1116, file: !42, line: 1486, baseType: !1108, size: 64, align: 64, offset: 512)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1116, file: !42, line: 1488, baseType: !1108, size: 64, align: 64, offset: 576)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1116, file: !42, line: 1497, baseType: !1108, size: 64, align: 64, offset: 640)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1150)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !765, line: 646, baseType: !1151)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !765, line: 268, size: 4288, align: 64, elements: !1152)
!1152 = !{!1153, !1154, !1155, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1182, !1184, !1185, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1218, !1219, !1220, !1221, !1222, !1223, !1226, !1227, !1228, !1229}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1151, file: !765, line: 282, baseType: !1091, size: 512, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1151, file: !765, line: 299, baseType: !1095, size: 256, align: 32, offset: 512)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1151, file: !765, line: 315, baseType: !1156, size: 64, align: 64, offset: 768)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1151, file: !765, line: 326, baseType: !912, size: 32, align: 32, offset: 832)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1151, file: !765, line: 326, baseType: !912, size: 32, align: 32, offset: 864)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1151, file: !765, line: 334, baseType: !912, size: 32, align: 32, offset: 896)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1151, file: !765, line: 341, baseType: !912, size: 32, align: 32, offset: 928)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1151, file: !765, line: 346, baseType: !912, size: 32, align: 32, offset: 960)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1151, file: !765, line: 351, baseType: !754, size: 32, align: 32, offset: 992)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1151, file: !765, line: 356, baseType: !1000, size: 64, align: 32, offset: 1024)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1151, file: !765, line: 361, baseType: !1108, size: 64, align: 64, offset: 1088)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1151, file: !765, line: 369, baseType: !1108, size: 64, align: 64, offset: 1152)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1151, file: !765, line: 377, baseType: !1108, size: 64, align: 64, offset: 1216)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1151, file: !765, line: 382, baseType: !912, size: 32, align: 32, offset: 1280)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1151, file: !765, line: 386, baseType: !912, size: 32, align: 32, offset: 1312)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1151, file: !765, line: 391, baseType: !912, size: 32, align: 32, offset: 1344)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1151, file: !765, line: 396, baseType: !954, size: 64, align: 64, offset: 1408)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1151, file: !765, line: 403, baseType: !1172, size: 512, align: 64, offset: 1472)
!1172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 512, align: 64, elements: !1092)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1151, file: !765, line: 410, baseType: !912, size: 32, align: 32, offset: 1984)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1151, file: !765, line: 415, baseType: !912, size: 32, align: 32, offset: 2016)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1151, file: !765, line: 420, baseType: !912, size: 32, align: 32, offset: 2048)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1151, file: !765, line: 425, baseType: !912, size: 32, align: 32, offset: 2080)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1151, file: !765, line: 435, baseType: !1108, size: 64, align: 64, offset: 2112)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1151, file: !765, line: 440, baseType: !912, size: 32, align: 32, offset: 2176)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1151, file: !765, line: 445, baseType: !1018, size: 64, align: 64, offset: 2240)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1151, file: !765, line: 459, baseType: !1181, size: 512, align: 64, offset: 2304)
!1181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1119, size: 512, align: 64, elements: !1092)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1151, file: !765, line: 473, baseType: !1183, size: 64, align: 64, offset: 2816)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1151, file: !765, line: 477, baseType: !912, size: 32, align: 32, offset: 2880)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1151, file: !765, line: 479, baseType: !1186, size: 64, align: 64, offset: 2944)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !765, line: 207, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !765, line: 201, size: 320, align: 64, elements: !1190)
!1190 = !{!1191, !1192, !1193, !1194, !1199}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1189, file: !765, line: 202, baseType: !764, size: 32, align: 32)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1189, file: !765, line: 203, baseType: !1063, size: 64, align: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1189, file: !765, line: 204, baseType: !912, size: 32, align: 32, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1189, file: !765, line: 205, baseType: !1195, size: 64, align: 64, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1197, line: 86, baseType: !1198)
!1197 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1198 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1197, line: 86, flags: DIFlagFwdDecl)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1189, file: !765, line: 206, baseType: !1119, size: 64, align: 64, offset: 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1151, file: !765, line: 480, baseType: !912, size: 32, align: 32, offset: 3008)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1151, file: !765, line: 505, baseType: !912, size: 32, align: 32, offset: 3040)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1151, file: !765, line: 512, baseType: !788, size: 32, align: 32, offset: 3072)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1151, file: !765, line: 514, baseType: !794, size: 32, align: 32, offset: 3104)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1151, file: !765, line: 516, baseType: !812, size: 32, align: 32, offset: 3136)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1151, file: !765, line: 523, baseType: !836, size: 32, align: 32, offset: 3168)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1151, file: !765, line: 525, baseType: !855, size: 32, align: 32, offset: 3200)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1151, file: !765, line: 532, baseType: !1108, size: 64, align: 64, offset: 3264)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1151, file: !765, line: 539, baseType: !1108, size: 64, align: 64, offset: 3328)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1151, file: !765, line: 547, baseType: !1108, size: 64, align: 64, offset: 3392)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1151, file: !765, line: 554, baseType: !1195, size: 64, align: 64, offset: 3456)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1151, file: !765, line: 563, baseType: !912, size: 32, align: 32, offset: 3520)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1151, file: !765, line: 572, baseType: !912, size: 32, align: 32, offset: 3552)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1151, file: !765, line: 581, baseType: !912, size: 32, align: 32, offset: 3584)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1151, file: !765, line: 588, baseType: !1215, size: 64, align: 64, offset: 3648)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !916, line: 36, baseType: !1217)
!1217 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1151, file: !765, line: 593, baseType: !912, size: 32, align: 32, offset: 3712)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1151, file: !765, line: 596, baseType: !912, size: 32, align: 32, offset: 3744)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1151, file: !765, line: 599, baseType: !1119, size: 64, align: 64, offset: 3776)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1151, file: !765, line: 605, baseType: !1119, size: 64, align: 64, offset: 3840)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1151, file: !765, line: 616, baseType: !1119, size: 64, align: 64, offset: 3904)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1151, file: !765, line: 626, baseType: !1224, size: 64, align: 64, offset: 3968)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1225, line: 216, baseType: !1019)
!1225 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1151, file: !765, line: 627, baseType: !1224, size: 64, align: 64, offset: 4032)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1151, file: !765, line: 628, baseType: !1224, size: 64, align: 64, offset: 4096)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1151, file: !765, line: 629, baseType: !1224, size: 64, align: 64, offset: 4160)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1151, file: !765, line: 645, baseType: !1119, size: 64, align: 64, offset: 4224)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !990, file: !42, line: 3566, baseType: !1232, size: 64, align: 64, offset: 1408)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !990, file: !42, line: 3567, baseType: !1035, size: 64, align: 64, offset: 1472)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !990, file: !42, line: 3576, baseType: !1235, size: 64, align: 64, offset: 1536)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!912, !936, !1148}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !990, file: !42, line: 3577, baseType: !1239, size: 64, align: 64, offset: 1600)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!912, !936, !1114}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !990, file: !42, line: 3584, baseType: !1243, size: 64, align: 64, offset: 1664)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!912, !936, !1246}
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !990, file: !42, line: 3589, baseType: !1248, size: 64, align: 64, offset: 1728)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{null, !936}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !990, file: !42, line: 3594, baseType: !912, size: 32, align: 32, offset: 1792)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !990, file: !42, line: 3600, baseType: !947, size: 64, align: 64, offset: 1856)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !990, file: !42, line: 3609, baseType: !1254, size: 64, align: 64, offset: 1920)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1257)
!1257 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !42, line: 3609, flags: DIFlagFwdDecl)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !938, file: !42, line: 1566, baseType: !41, size: 32, align: 32, offset: 192)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !938, file: !42, line: 1581, baseType: !913, size: 32, align: 32, offset: 224)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !938, file: !42, line: 1583, baseType: !954, size: 64, align: 64, offset: 256)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !938, file: !42, line: 1591, baseType: !1262, size: 64, align: 64, offset: 320)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1049, line: 129, size: 1664, align: 64, elements: !1264)
!1264 = !{!1265, !1266, !1267, !1268, !1269, !1287, !1288, !1294, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1263, file: !1049, line: 136, baseType: !912, size: 32, align: 32)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1263, file: !1049, line: 151, baseType: !912, size: 32, align: 32, offset: 32)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1263, file: !1049, line: 157, baseType: !912, size: 32, align: 32, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1263, file: !1049, line: 159, baseType: !1246, size: 64, align: 64, offset: 128)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1263, file: !1049, line: 161, baseType: !1270, size: 64, align: 64, offset: 192)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1049, line: 117, baseType: !1272)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1049, line: 100, size: 832, align: 64, elements: !1273)
!1273 = !{!1274, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1272, file: !1049, line: 105, baseType: !1275, size: 256, align: 64)
!1275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1276, size: 256, align: 64, elements: !1098)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1121, line: 238, baseType: !1278)
!1278 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1121, line: 238, flags: DIFlagFwdDecl)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1272, file: !1049, line: 110, baseType: !912, size: 32, align: 32, offset: 256)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1272, file: !1049, line: 111, baseType: !912, size: 32, align: 32, offset: 288)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1272, file: !1049, line: 111, baseType: !912, size: 32, align: 32, offset: 320)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1272, file: !1049, line: 112, baseType: !1095, size: 256, align: 32, offset: 352)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1272, file: !1049, line: 113, baseType: !1101, size: 128, align: 32, offset: 608)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1272, file: !1049, line: 114, baseType: !912, size: 32, align: 32, offset: 736)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1272, file: !1049, line: 115, baseType: !912, size: 32, align: 32, offset: 768)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1272, file: !1049, line: 116, baseType: !912, size: 32, align: 32, offset: 800)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1263, file: !1049, line: 163, baseType: !954, size: 64, align: 64, offset: 256)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1263, file: !1049, line: 165, baseType: !1289, size: 128, align: 64, offset: 320)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1049, line: 122, baseType: !1290)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1049, line: 119, size: 128, align: 64, elements: !1291)
!1291 = !{!1292, !1293}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1290, file: !1049, line: 120, baseType: !1114, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1290, file: !1049, line: 121, baseType: !1246, size: 64, align: 64, offset: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1263, file: !1049, line: 166, baseType: !1295, size: 128, align: 64, offset: 448)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1049, line: 127, baseType: !1296)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1049, line: 124, size: 128, align: 64, elements: !1297)
!1297 = !{!1298, !1371}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1296, file: !1049, line: 125, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !42, line: 5794, baseType: !1302)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !42, line: 5747, size: 512, align: 64, elements: !1303)
!1303 = !{!1304, !1305, !1329, !1333, !1334, !1368, !1369, !1370}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1302, file: !42, line: 5751, baseType: !941, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1302, file: !42, line: 5756, baseType: !1306, size: 64, align: 64, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1308)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !42, line: 5796, size: 512, align: 64, elements: !1309)
!1309 = !{!1310, !1311, !1314, !1315, !1316, !1320, !1324, !1328}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1308, file: !42, line: 5797, baseType: !947, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1308, file: !42, line: 5804, baseType: !1312, size: 64, align: 64, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1308, file: !42, line: 5815, baseType: !941, size: 64, align: 64, offset: 128)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1308, file: !42, line: 5825, baseType: !912, size: 32, align: 32, offset: 192)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1308, file: !42, line: 5826, baseType: !1317, size: 64, align: 64, offset: 256)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!912, !1300}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1308, file: !42, line: 5827, baseType: !1321, size: 64, align: 64, offset: 320)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DISubroutineType(types: !1323)
!1323 = !{!912, !1300, !1114}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1308, file: !42, line: 5828, baseType: !1325, size: 64, align: 64, offset: 384)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{null, !1300}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1308, file: !42, line: 5829, baseType: !1325, size: 64, align: 64, offset: 448)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1302, file: !42, line: 5762, baseType: !1330, size: 64, align: 64, offset: 128)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !42, line: 5735, baseType: !1332)
!1332 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !42, line: 5735, flags: DIFlagFwdDecl)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1302, file: !42, line: 5768, baseType: !954, size: 64, align: 64, offset: 192)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1302, file: !42, line: 5775, baseType: !1335, size: 64, align: 64, offset: 256)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !42, line: 4085, baseType: !1337)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !42, line: 3936, size: 1152, align: 64, elements: !1338)
!1338 = !{!1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1337, file: !42, line: 3940, baseType: !31, size: 32, align: 32)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1337, file: !42, line: 3944, baseType: !41, size: 32, align: 32, offset: 32)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1337, file: !42, line: 3948, baseType: !1072, size: 32, align: 32, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1337, file: !42, line: 3958, baseType: !1063, size: 64, align: 64, offset: 128)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1337, file: !42, line: 3962, baseType: !912, size: 32, align: 32, offset: 192)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1337, file: !42, line: 3968, baseType: !912, size: 32, align: 32, offset: 224)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1337, file: !42, line: 3973, baseType: !1108, size: 64, align: 64, offset: 256)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1337, file: !42, line: 3986, baseType: !912, size: 32, align: 32, offset: 320)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1337, file: !42, line: 3999, baseType: !912, size: 32, align: 32, offset: 352)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1337, file: !42, line: 4004, baseType: !912, size: 32, align: 32, offset: 384)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1337, file: !42, line: 4005, baseType: !912, size: 32, align: 32, offset: 416)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1337, file: !42, line: 4010, baseType: !912, size: 32, align: 32, offset: 448)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1337, file: !42, line: 4011, baseType: !912, size: 32, align: 32, offset: 480)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1337, file: !42, line: 4020, baseType: !1000, size: 64, align: 32, offset: 512)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1337, file: !42, line: 4025, baseType: !865, size: 32, align: 32, offset: 576)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1337, file: !42, line: 4030, baseType: !788, size: 32, align: 32, offset: 608)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1337, file: !42, line: 4031, baseType: !794, size: 32, align: 32, offset: 640)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1337, file: !42, line: 4032, baseType: !812, size: 32, align: 32, offset: 672)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1337, file: !42, line: 4033, baseType: !836, size: 32, align: 32, offset: 704)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1337, file: !42, line: 4034, baseType: !855, size: 32, align: 32, offset: 736)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1337, file: !42, line: 4039, baseType: !912, size: 32, align: 32, offset: 768)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1337, file: !42, line: 4046, baseType: !1018, size: 64, align: 64, offset: 832)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1337, file: !42, line: 4050, baseType: !912, size: 32, align: 32, offset: 896)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1337, file: !42, line: 4054, baseType: !912, size: 32, align: 32, offset: 928)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1337, file: !42, line: 4061, baseType: !912, size: 32, align: 32, offset: 960)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1337, file: !42, line: 4065, baseType: !912, size: 32, align: 32, offset: 992)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1337, file: !42, line: 4073, baseType: !912, size: 32, align: 32, offset: 1024)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1337, file: !42, line: 4080, baseType: !912, size: 32, align: 32, offset: 1056)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1337, file: !42, line: 4084, baseType: !912, size: 32, align: 32, offset: 1088)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1302, file: !42, line: 5781, baseType: !1335, size: 64, align: 64, offset: 320)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1302, file: !42, line: 5787, baseType: !1000, size: 64, align: 32, offset: 384)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1302, file: !42, line: 5793, baseType: !1000, size: 64, align: 32, offset: 448)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1296, file: !1049, line: 126, baseType: !912, size: 32, align: 32, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1263, file: !1049, line: 172, baseType: !1114, size: 64, align: 64, offset: 576)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1263, file: !1049, line: 177, baseType: !1063, size: 64, align: 64, offset: 640)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1263, file: !1049, line: 178, baseType: !913, size: 32, align: 32, offset: 704)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1263, file: !1049, line: 180, baseType: !954, size: 64, align: 64, offset: 768)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1263, file: !1049, line: 185, baseType: !912, size: 32, align: 32, offset: 832)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1263, file: !1049, line: 190, baseType: !954, size: 64, align: 64, offset: 896)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1263, file: !1049, line: 195, baseType: !912, size: 32, align: 32, offset: 960)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1263, file: !1049, line: 200, baseType: !1114, size: 64, align: 64, offset: 1024)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1263, file: !1049, line: 201, baseType: !912, size: 32, align: 32, offset: 1088)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1263, file: !1049, line: 202, baseType: !1246, size: 64, align: 64, offset: 1152)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1263, file: !1049, line: 203, baseType: !912, size: 32, align: 32, offset: 1216)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1263, file: !1049, line: 205, baseType: !912, size: 32, align: 32, offset: 1248)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1263, file: !1049, line: 206, baseType: !912, size: 32, align: 32, offset: 1280)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1263, file: !1049, line: 209, baseType: !1224, size: 64, align: 64, offset: 1344)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1263, file: !1049, line: 212, baseType: !1224, size: 64, align: 64, offset: 1408)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1263, file: !1049, line: 213, baseType: !1246, size: 64, align: 64, offset: 1472)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1263, file: !1049, line: 215, baseType: !912, size: 32, align: 32, offset: 1536)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1263, file: !1049, line: 217, baseType: !912, size: 32, align: 32, offset: 1568)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1263, file: !1049, line: 220, baseType: !912, size: 32, align: 32, offset: 1600)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !938, file: !42, line: 1598, baseType: !954, size: 64, align: 64, offset: 384)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !938, file: !42, line: 1606, baseType: !1108, size: 64, align: 64, offset: 448)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !938, file: !42, line: 1614, baseType: !912, size: 32, align: 32, offset: 512)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !938, file: !42, line: 1622, baseType: !912, size: 32, align: 32, offset: 544)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !938, file: !42, line: 1628, baseType: !912, size: 32, align: 32, offset: 576)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !938, file: !42, line: 1636, baseType: !912, size: 32, align: 32, offset: 608)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !938, file: !42, line: 1643, baseType: !912, size: 32, align: 32, offset: 640)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !938, file: !42, line: 1657, baseType: !1063, size: 64, align: 64, offset: 704)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !938, file: !42, line: 1658, baseType: !912, size: 32, align: 32, offset: 768)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !938, file: !42, line: 1679, baseType: !1000, size: 64, align: 32, offset: 800)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !938, file: !42, line: 1688, baseType: !912, size: 32, align: 32, offset: 864)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !938, file: !42, line: 1712, baseType: !912, size: 32, align: 32, offset: 896)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !938, file: !42, line: 1729, baseType: !912, size: 32, align: 32, offset: 928)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !938, file: !42, line: 1729, baseType: !912, size: 32, align: 32, offset: 960)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !938, file: !42, line: 1744, baseType: !912, size: 32, align: 32, offset: 992)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !938, file: !42, line: 1744, baseType: !912, size: 32, align: 32, offset: 1024)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !938, file: !42, line: 1751, baseType: !912, size: 32, align: 32, offset: 1056)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !938, file: !42, line: 1766, baseType: !501, size: 32, align: 32, offset: 1088)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !938, file: !42, line: 1791, baseType: !1410, size: 64, align: 64, offset: 1152)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DISubroutineType(types: !1412)
!1412 = !{null, !1413, !1148, !1230, !912, !912, !912}
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !938, file: !42, line: 1808, baseType: !1415, size: 64, align: 64, offset: 1216)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{!501, !1413, !1007}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !938, file: !42, line: 1816, baseType: !912, size: 32, align: 32, offset: 1280)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !938, file: !42, line: 1825, baseType: !911, size: 32, align: 32, offset: 1312)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !938, file: !42, line: 1830, baseType: !912, size: 32, align: 32, offset: 1344)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !938, file: !42, line: 1838, baseType: !911, size: 32, align: 32, offset: 1376)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !938, file: !42, line: 1846, baseType: !912, size: 32, align: 32, offset: 1408)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !938, file: !42, line: 1851, baseType: !912, size: 32, align: 32, offset: 1440)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !938, file: !42, line: 1861, baseType: !911, size: 32, align: 32, offset: 1472)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !938, file: !42, line: 1868, baseType: !911, size: 32, align: 32, offset: 1504)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !938, file: !42, line: 1875, baseType: !911, size: 32, align: 32, offset: 1536)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !938, file: !42, line: 1882, baseType: !911, size: 32, align: 32, offset: 1568)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !938, file: !42, line: 1889, baseType: !911, size: 32, align: 32, offset: 1600)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !938, file: !42, line: 1896, baseType: !911, size: 32, align: 32, offset: 1632)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !938, file: !42, line: 1903, baseType: !911, size: 32, align: 32, offset: 1664)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !938, file: !42, line: 1910, baseType: !912, size: 32, align: 32, offset: 1696)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !938, file: !42, line: 1915, baseType: !912, size: 32, align: 32, offset: 1728)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !938, file: !42, line: 1926, baseType: !1230, size: 64, align: 64, offset: 1792)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !938, file: !42, line: 1935, baseType: !1000, size: 64, align: 32, offset: 1856)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !938, file: !42, line: 1942, baseType: !912, size: 32, align: 32, offset: 1920)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !938, file: !42, line: 1948, baseType: !912, size: 32, align: 32, offset: 1952)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !938, file: !42, line: 1954, baseType: !912, size: 32, align: 32, offset: 1984)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !938, file: !42, line: 1960, baseType: !912, size: 32, align: 32, offset: 2016)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !938, file: !42, line: 1984, baseType: !912, size: 32, align: 32, offset: 2048)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !938, file: !42, line: 1991, baseType: !912, size: 32, align: 32, offset: 2080)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !938, file: !42, line: 1996, baseType: !912, size: 32, align: 32, offset: 2112)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !938, file: !42, line: 2004, baseType: !912, size: 32, align: 32, offset: 2144)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !938, file: !42, line: 2011, baseType: !912, size: 32, align: 32, offset: 2176)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !938, file: !42, line: 2018, baseType: !912, size: 32, align: 32, offset: 2208)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !938, file: !42, line: 2027, baseType: !912, size: 32, align: 32, offset: 2240)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !938, file: !42, line: 2034, baseType: !912, size: 32, align: 32, offset: 2272)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !938, file: !42, line: 2044, baseType: !912, size: 32, align: 32, offset: 2304)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !938, file: !42, line: 2054, baseType: !1449, size: 64, align: 64, offset: 2368)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !938, file: !42, line: 2061, baseType: !1449, size: 64, align: 64, offset: 2432)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !938, file: !42, line: 2066, baseType: !912, size: 32, align: 32, offset: 2496)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !938, file: !42, line: 2070, baseType: !912, size: 32, align: 32, offset: 2528)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !938, file: !42, line: 2078, baseType: !912, size: 32, align: 32, offset: 2560)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !938, file: !42, line: 2085, baseType: !912, size: 32, align: 32, offset: 2592)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !938, file: !42, line: 2092, baseType: !912, size: 32, align: 32, offset: 2624)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !938, file: !42, line: 2099, baseType: !912, size: 32, align: 32, offset: 2656)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !938, file: !42, line: 2106, baseType: !912, size: 32, align: 32, offset: 2688)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !938, file: !42, line: 2113, baseType: !912, size: 32, align: 32, offset: 2720)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !938, file: !42, line: 2120, baseType: !912, size: 32, align: 32, offset: 2752)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !938, file: !42, line: 2125, baseType: !912, size: 32, align: 32, offset: 2784)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !938, file: !42, line: 2133, baseType: !912, size: 32, align: 32, offset: 2816)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !938, file: !42, line: 2140, baseType: !912, size: 32, align: 32, offset: 2848)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !938, file: !42, line: 2145, baseType: !912, size: 32, align: 32, offset: 2880)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !938, file: !42, line: 2153, baseType: !912, size: 32, align: 32, offset: 2912)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !938, file: !42, line: 2158, baseType: !912, size: 32, align: 32, offset: 2944)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !938, file: !42, line: 2166, baseType: !794, size: 32, align: 32, offset: 2976)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !938, file: !42, line: 2173, baseType: !812, size: 32, align: 32, offset: 3008)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !938, file: !42, line: 2180, baseType: !836, size: 32, align: 32, offset: 3040)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !938, file: !42, line: 2187, baseType: !788, size: 32, align: 32, offset: 3072)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !938, file: !42, line: 2194, baseType: !855, size: 32, align: 32, offset: 3104)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !938, file: !42, line: 2203, baseType: !912, size: 32, align: 32, offset: 3136)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !938, file: !42, line: 2209, baseType: !865, size: 32, align: 32, offset: 3168)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !938, file: !42, line: 2212, baseType: !912, size: 32, align: 32, offset: 3200)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !938, file: !42, line: 2213, baseType: !912, size: 32, align: 32, offset: 3232)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !938, file: !42, line: 2220, baseType: !701, size: 32, align: 32, offset: 3264)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !938, file: !42, line: 2232, baseType: !912, size: 32, align: 32, offset: 3296)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !938, file: !42, line: 2243, baseType: !912, size: 32, align: 32, offset: 3328)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !938, file: !42, line: 2249, baseType: !912, size: 32, align: 32, offset: 3360)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !938, file: !42, line: 2256, baseType: !912, size: 32, align: 32, offset: 3392)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !938, file: !42, line: 2263, baseType: !1018, size: 64, align: 64, offset: 3456)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !938, file: !42, line: 2270, baseType: !1018, size: 64, align: 64, offset: 3520)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !938, file: !42, line: 2277, baseType: !873, size: 32, align: 32, offset: 3584)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !938, file: !42, line: 2285, baseType: !701, size: 32, align: 32, offset: 3616)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !938, file: !42, line: 2367, baseType: !1485, size: 64, align: 64, offset: 3648)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{!912, !1413, !1246, !912}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !938, file: !42, line: 2383, baseType: !912, size: 32, align: 32, offset: 3712)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !938, file: !42, line: 2386, baseType: !911, size: 32, align: 32, offset: 3744)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !938, file: !42, line: 2387, baseType: !911, size: 32, align: 32, offset: 3776)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !938, file: !42, line: 2394, baseType: !912, size: 32, align: 32, offset: 3808)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !938, file: !42, line: 2401, baseType: !912, size: 32, align: 32, offset: 3840)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !938, file: !42, line: 2408, baseType: !912, size: 32, align: 32, offset: 3872)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !938, file: !42, line: 2415, baseType: !912, size: 32, align: 32, offset: 3904)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !938, file: !42, line: 2422, baseType: !912, size: 32, align: 32, offset: 3936)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !938, file: !42, line: 2423, baseType: !1497, size: 64, align: 64, offset: 3968)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !42, line: 831, baseType: !1499)
!1499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !42, line: 826, size: 128, align: 32, elements: !1500)
!1500 = !{!1501, !1502, !1503, !1504}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1499, file: !42, line: 827, baseType: !912, size: 32, align: 32)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1499, file: !42, line: 828, baseType: !912, size: 32, align: 32, offset: 32)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1499, file: !42, line: 829, baseType: !912, size: 32, align: 32, offset: 64)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1499, file: !42, line: 830, baseType: !911, size: 32, align: 32, offset: 96)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !938, file: !42, line: 2430, baseType: !1108, size: 64, align: 64, offset: 4032)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !938, file: !42, line: 2437, baseType: !1108, size: 64, align: 64, offset: 4096)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !938, file: !42, line: 2444, baseType: !911, size: 32, align: 32, offset: 4160)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !938, file: !42, line: 2451, baseType: !911, size: 32, align: 32, offset: 4192)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !938, file: !42, line: 2458, baseType: !912, size: 32, align: 32, offset: 4224)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !938, file: !42, line: 2469, baseType: !912, size: 32, align: 32, offset: 4256)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !938, file: !42, line: 2475, baseType: !912, size: 32, align: 32, offset: 4288)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !938, file: !42, line: 2481, baseType: !912, size: 32, align: 32, offset: 4320)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !938, file: !42, line: 2485, baseType: !912, size: 32, align: 32, offset: 4352)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !938, file: !42, line: 2489, baseType: !912, size: 32, align: 32, offset: 4384)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !938, file: !42, line: 2493, baseType: !912, size: 32, align: 32, offset: 4416)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !938, file: !42, line: 2501, baseType: !912, size: 32, align: 32, offset: 4448)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !938, file: !42, line: 2506, baseType: !912, size: 32, align: 32, offset: 4480)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !938, file: !42, line: 2510, baseType: !912, size: 32, align: 32, offset: 4512)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !938, file: !42, line: 2514, baseType: !1108, size: 64, align: 64, offset: 4544)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !938, file: !42, line: 2528, baseType: !1521, size: 64, align: 64, offset: 4608)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DISubroutineType(types: !1523)
!1523 = !{null, !1413, !954, !912, !912}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !938, file: !42, line: 2534, baseType: !912, size: 32, align: 32, offset: 4672)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !938, file: !42, line: 2545, baseType: !912, size: 32, align: 32, offset: 4704)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !938, file: !42, line: 2547, baseType: !912, size: 32, align: 32, offset: 4736)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !938, file: !42, line: 2549, baseType: !912, size: 32, align: 32, offset: 4768)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !938, file: !42, line: 2551, baseType: !912, size: 32, align: 32, offset: 4800)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !938, file: !42, line: 2553, baseType: !912, size: 32, align: 32, offset: 4832)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !938, file: !42, line: 2555, baseType: !912, size: 32, align: 32, offset: 4864)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !938, file: !42, line: 2557, baseType: !912, size: 32, align: 32, offset: 4896)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !938, file: !42, line: 2559, baseType: !912, size: 32, align: 32, offset: 4928)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !938, file: !42, line: 2563, baseType: !912, size: 32, align: 32, offset: 4960)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !938, file: !42, line: 2571, baseType: !1104, size: 64, align: 64, offset: 4992)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !938, file: !42, line: 2579, baseType: !1104, size: 64, align: 64, offset: 5056)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !938, file: !42, line: 2586, baseType: !912, size: 32, align: 32, offset: 5120)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !938, file: !42, line: 2615, baseType: !912, size: 32, align: 32, offset: 5152)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !938, file: !42, line: 2627, baseType: !912, size: 32, align: 32, offset: 5184)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !938, file: !42, line: 2637, baseType: !912, size: 32, align: 32, offset: 5216)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !938, file: !42, line: 2681, baseType: !912, size: 32, align: 32, offset: 5248)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !938, file: !42, line: 2709, baseType: !1108, size: 64, align: 64, offset: 5312)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !938, file: !42, line: 2716, baseType: !1543, size: 64, align: 64, offset: 5376)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1545)
!1545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !42, line: 3636, size: 896, align: 64, elements: !1546)
!1546 = !{!1547, !1548, !1549, !1550, !1551, !1552, !1553, !1557, !1561, !1562, !1563, !1564, !1570, !1571, !1572, !1573, !1574}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1545, file: !42, line: 3642, baseType: !947, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1545, file: !42, line: 3649, baseType: !31, size: 32, align: 32, offset: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1545, file: !42, line: 3656, baseType: !41, size: 32, align: 32, offset: 96)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1545, file: !42, line: 3663, baseType: !501, size: 32, align: 32, offset: 128)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1545, file: !42, line: 3669, baseType: !912, size: 32, align: 32, offset: 160)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1545, file: !42, line: 3682, baseType: !1243, size: 64, align: 64, offset: 192)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1545, file: !42, line: 3698, baseType: !1554, size: 64, align: 64, offset: 256)
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1555, size: 64, align: 64)
!1555 = !DISubroutineType(types: !1556)
!1556 = !{!912, !936, !1052, !1072}
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1545, file: !42, line: 3712, baseType: !1558, size: 64, align: 64, offset: 320)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DISubroutineType(types: !1560)
!1560 = !{!912, !936, !912, !1052, !1072}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1545, file: !42, line: 3726, baseType: !1554, size: 64, align: 64, offset: 384)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1545, file: !42, line: 3737, baseType: !1035, size: 64, align: 64, offset: 448)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1545, file: !42, line: 3746, baseType: !912, size: 32, align: 32, offset: 512)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1545, file: !42, line: 3757, baseType: !1565, size: 64, align: 64, offset: 576)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64, align: 64)
!1566 = !DISubroutineType(types: !1567)
!1567 = !{null, !1568}
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !42, line: 3617, flags: DIFlagFwdDecl)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1545, file: !42, line: 3766, baseType: !1035, size: 64, align: 64, offset: 640)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1545, file: !42, line: 3774, baseType: !1035, size: 64, align: 64, offset: 704)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1545, file: !42, line: 3780, baseType: !912, size: 32, align: 32, offset: 768)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1545, file: !42, line: 3785, baseType: !912, size: 32, align: 32, offset: 800)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1545, file: !42, line: 3795, baseType: !1575, size: 64, align: 64, offset: 832)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64, align: 64)
!1576 = !DISubroutineType(types: !1577)
!1577 = !{!912, !936, !1119}
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !938, file: !42, line: 2728, baseType: !954, size: 64, align: 64, offset: 5440)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !938, file: !42, line: 2735, baseType: !1172, size: 512, align: 64, offset: 5504)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !938, file: !42, line: 2742, baseType: !912, size: 32, align: 32, offset: 6016)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !938, file: !42, line: 2755, baseType: !912, size: 32, align: 32, offset: 6048)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !938, file: !42, line: 2776, baseType: !912, size: 32, align: 32, offset: 6080)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !938, file: !42, line: 2783, baseType: !912, size: 32, align: 32, offset: 6112)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !938, file: !42, line: 2791, baseType: !912, size: 32, align: 32, offset: 6144)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !938, file: !42, line: 2802, baseType: !1246, size: 64, align: 64, offset: 6208)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !938, file: !42, line: 2811, baseType: !912, size: 32, align: 32, offset: 6272)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !938, file: !42, line: 2821, baseType: !912, size: 32, align: 32, offset: 6304)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !938, file: !42, line: 2830, baseType: !912, size: 32, align: 32, offset: 6336)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !938, file: !42, line: 2840, baseType: !912, size: 32, align: 32, offset: 6368)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !938, file: !42, line: 2851, baseType: !1591, size: 64, align: 64, offset: 6400)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1592 = !DISubroutineType(types: !1593)
!1593 = !{!912, !1413, !1594, !954, !1230, !912, !912}
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DISubroutineType(types: !1596)
!1596 = !{!912, !1413, !954}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !938, file: !42, line: 2871, baseType: !1598, size: 64, align: 64, offset: 6464)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DISubroutineType(types: !1600)
!1600 = !{!912, !1413, !1601, !954, !1230, !912}
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DISubroutineType(types: !1603)
!1603 = !{!912, !1413, !954, !912, !912}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !938, file: !42, line: 2878, baseType: !912, size: 32, align: 32, offset: 6528)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !938, file: !42, line: 2885, baseType: !912, size: 32, align: 32, offset: 6560)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !938, file: !42, line: 3005, baseType: !912, size: 32, align: 32, offset: 6592)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !938, file: !42, line: 3013, baseType: !885, size: 32, align: 32, offset: 6624)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !938, file: !42, line: 3020, baseType: !885, size: 32, align: 32, offset: 6656)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !938, file: !42, line: 3027, baseType: !885, size: 32, align: 32, offset: 6688)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !938, file: !42, line: 3037, baseType: !1063, size: 64, align: 64, offset: 6720)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !938, file: !42, line: 3038, baseType: !912, size: 32, align: 32, offset: 6784)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !938, file: !42, line: 3050, baseType: !1018, size: 64, align: 64, offset: 6848)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !938, file: !42, line: 3065, baseType: !912, size: 32, align: 32, offset: 6912)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !938, file: !42, line: 3083, baseType: !912, size: 32, align: 32, offset: 6944)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !938, file: !42, line: 3092, baseType: !1000, size: 64, align: 32, offset: 6976)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !938, file: !42, line: 3099, baseType: !501, size: 32, align: 32, offset: 7040)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !938, file: !42, line: 3106, baseType: !1000, size: 64, align: 32, offset: 7072)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !938, file: !42, line: 3113, baseType: !1619, size: 64, align: 64, offset: 7168)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1621)
!1621 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !42, line: 740, baseType: !1622)
!1622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !42, line: 712, size: 384, align: 64, elements: !1623)
!1623 = !{!1624, !1625, !1626, !1627, !1628, !1629, !1632}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1622, file: !42, line: 713, baseType: !41, size: 32, align: 32)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1622, file: !42, line: 714, baseType: !31, size: 32, align: 32, offset: 32)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1622, file: !42, line: 720, baseType: !947, size: 64, align: 64, offset: 64)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1622, file: !42, line: 724, baseType: !947, size: 64, align: 64, offset: 128)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1622, file: !42, line: 728, baseType: !912, size: 32, align: 32, offset: 192)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1622, file: !42, line: 734, baseType: !1630, size: 64, align: 64, offset: 256)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1622, file: !42, line: 739, baseType: !1633, size: 64, align: 64, offset: 320)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !938, file: !42, line: 3129, baseType: !1108, size: 64, align: 64, offset: 7232)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !938, file: !42, line: 3130, baseType: !1108, size: 64, align: 64, offset: 7296)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !938, file: !42, line: 3131, baseType: !1108, size: 64, align: 64, offset: 7360)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !938, file: !42, line: 3132, baseType: !1108, size: 64, align: 64, offset: 7424)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !938, file: !42, line: 3139, baseType: !1104, size: 64, align: 64, offset: 7488)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !938, file: !42, line: 3147, baseType: !912, size: 32, align: 32, offset: 7552)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !938, file: !42, line: 3165, baseType: !912, size: 32, align: 32, offset: 7584)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !938, file: !42, line: 3172, baseType: !912, size: 32, align: 32, offset: 7616)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !938, file: !42, line: 3180, baseType: !912, size: 32, align: 32, offset: 7648)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !938, file: !42, line: 3191, baseType: !1449, size: 64, align: 64, offset: 7680)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !938, file: !42, line: 3199, baseType: !1063, size: 64, align: 64, offset: 7744)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !938, file: !42, line: 3207, baseType: !1104, size: 64, align: 64, offset: 7808)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !938, file: !42, line: 3214, baseType: !913, size: 32, align: 32, offset: 7872)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !938, file: !42, line: 3224, baseType: !1137, size: 64, align: 64, offset: 7936)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !938, file: !42, line: 3225, baseType: !912, size: 32, align: 32, offset: 8000)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !938, file: !42, line: 3249, baseType: !1119, size: 64, align: 64, offset: 8064)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !938, file: !42, line: 3256, baseType: !912, size: 32, align: 32, offset: 8128)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !938, file: !42, line: 3271, baseType: !912, size: 32, align: 32, offset: 8160)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !938, file: !42, line: 3279, baseType: !1108, size: 64, align: 64, offset: 8192)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !938, file: !42, line: 3301, baseType: !1119, size: 64, align: 64, offset: 8256)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !938, file: !42, line: 3310, baseType: !912, size: 32, align: 32, offset: 8320)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !938, file: !42, line: 3337, baseType: !912, size: 32, align: 32, offset: 8352)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !938, file: !42, line: 3351, baseType: !912, size: 32, align: 32, offset: 8384)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !938, file: !42, line: 3359, baseType: !912, size: 32, align: 32, offset: 8416)
!1659 = !{}
!1660 = !DILocalVariable(name: "avctx", arg: 1, scope: !933, file: !920, line: 476, type: !936)
!1661 = !DIExpression()
!1662 = !DILocation(line: 476, column: 44, scope: !933)
!1663 = !DILocalVariable(name: "data", arg: 2, scope: !933, file: !920, line: 476, type: !954)
!1664 = !DILocation(line: 476, column: 57, scope: !933)
!1665 = !DILocalVariable(name: "got_frame_ptr", arg: 3, scope: !933, file: !920, line: 477, type: !1230)
!1666 = !DILocation(line: 477, column: 33, scope: !933)
!1667 = !DILocalVariable(name: "avpkt", arg: 4, scope: !933, file: !920, line: 477, type: !1114)
!1668 = !DILocation(line: 477, column: 58, scope: !933)
!1669 = !DILocalVariable(name: "frame", scope: !933, file: !920, line: 479, type: !1246)
!1670 = !DILocation(line: 479, column: 14, scope: !933)
!1671 = !DILocation(line: 479, column: 22, scope: !933)
!1672 = !DILocalVariable(name: "buf", scope: !933, file: !920, line: 480, type: !1052)
!1673 = !DILocation(line: 480, column: 20, scope: !933)
!1674 = !DILocation(line: 480, column: 26, scope: !933)
!1675 = !DILocation(line: 480, column: 33, scope: !933)
!1676 = !DILocalVariable(name: "buf_size", scope: !933, file: !920, line: 481, type: !912)
!1677 = !DILocation(line: 481, column: 9, scope: !933)
!1678 = !DILocation(line: 481, column: 20, scope: !933)
!1679 = !DILocation(line: 481, column: 27, scope: !933)
!1680 = !DILocalVariable(name: "tctx", scope: !933, file: !920, line: 482, type: !1681)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DIDerivedType(tag: DW_TAG_typedef, name: "TwinVQContext", file: !4, line: 181, baseType: !1683)
!1683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TwinVQContext", file: !4, line: 137, size: 296448, align: 64, elements: !1684)
!1684 = !{!1685, !1686, !1731, !1779, !1815, !1816, !1821, !1825, !1829, !1832, !1834, !1837, !1838, !1839, !1840, !1841, !1842, !1845, !1846, !1848, !1849, !1850, !1851, !1852, !1887, !1888, !1893, !1897}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1683, file: !4, line: 138, baseType: !936, size: 64, align: 64)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "fdsp", scope: !1683, file: !4, line: 139, baseType: !1687, size: 64, align: 64, offset: 64)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFloatDSPContext", file: !1689, line: 192, baseType: !1690)
!1689 = !DIFile(filename: "./libavutil/float_dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFloatDSPContext", file: !1689, line: 24, size: 704, align: 64, elements: !1691)
!1691 = !{!1692, !1698, !1702, !1710, !1711, !1712, !1716, !1717, !1718, !1723, !1727}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul", scope: !1690, file: !1689, line: 38, baseType: !1693, size: 64, align: 64)
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DISubroutineType(types: !1695)
!1695 = !{null, !910, !1696, !1696, !912}
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !911)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmac_scalar", scope: !1690, file: !1689, line: 54, baseType: !1699, size: 64, align: 64, offset: 64)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{null, !910, !1696, !911, !912}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmac_scalar", scope: !1690, file: !1689, line: 70, baseType: !1703, size: 64, align: 64, offset: 128)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DISubroutineType(types: !1705)
!1705 = !{null, !1706, !1708, !1707, !912}
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1709, size: 64, align: 64)
!1709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1707)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_scalar", scope: !1690, file: !1689, line: 85, baseType: !1699, size: 64, align: 64, offset: 192)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmul_scalar", scope: !1690, file: !1689, line: 100, baseType: !1703, size: 64, align: 64, offset: 256)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_window", scope: !1690, file: !1689, line: 119, baseType: !1713, size: 64, align: 64, offset: 320)
!1713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1714, size: 64, align: 64)
