; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--pcm.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--pcm.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !895, line: 55, baseType: !930)
!930 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "av_alias32", file: !917, line: 41, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !917, line: 36, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !940, !944}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !933, file: !917, line: 37, baseType: !894, size: 32, align: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "u16", scope: !933, file: !917, line: 38, baseType: !937, size: 32, align: 16)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 32, align: 16, elements: !938)
!938 = !{!939}
!939 = !DISubrange(count: 2)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !933, file: !917, line: 39, baseType: !941, size: 32, align: 8)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 32, align: 8, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 4)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "f32", scope: !933, file: !917, line: 40, baseType: !945, size: 32, align: 32)
!945 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "av_alias16", file: !917, line: 46, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !917, line: 43, size: 16, align: 16, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "u16", scope: !948, file: !917, line: 44, baseType: !902, size: 16, align: 16)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !948, file: !917, line: 45, baseType: !952, size: 16, align: 8)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 16, align: 8, elements: !938)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "av_alias64", file: !917, line: 34, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !917, line: 27, size: 64, align: 64, elements: !956)
!956 = !{!957, !958, !960, !962, !966, !968}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !955, file: !917, line: 28, baseType: !929, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !955, file: !917, line: 29, baseType: !959, size: 64, align: 32)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 64, align: 32, elements: !938)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "u16", scope: !955, file: !917, line: 30, baseType: !961, size: 64, align: 16)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 64, align: 16, elements: !942)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !955, file: !917, line: 31, baseType: !963, size: 64, align: 8)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 64, align: 8, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 8)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "f64", scope: !955, file: !917, line: 32, baseType: !967, size: 64, align: 64)
!967 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "f32", scope: !955, file: !917, line: 33, baseType: !969, size: 64, align: 32)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 64, align: 32, elements: !938)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!980 = !{!981, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1762, !1763}
!981 = distinct !DIGlobalVariable(name: "ff_pcm_alaw_encoder", scope: !0, file: !982, line: 597, type: !983, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_pcm_alaw_encoder)
!982 = !DIFile(filename: "libavcodec/pcm.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !985)
!985 = !{!986, !990, !991, !992, !993, !994, !1003, !1006, !1009, !1012, !1015, !1016, !1058, !1066, !1067, !1068, !1070, !1611, !1617, !1625, !1629, !1630, !1667, !1671, !1675, !1676, !1680, !1684, !1685, !1689, !1690, !1691}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !984, file: !14, line: 3475, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !984, file: !14, line: 3480, baseType: !987, size: 64, align: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !984, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !984, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !984, file: !14, line: 3487, baseType: !899, size: 32, align: 32, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !984, file: !14, line: 3488, baseType: !995, size: 64, align: 64, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !998, line: 61, baseType: !999)
!998 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !998, line: 58, size: 64, align: 32, elements: !1000)
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !999, file: !998, line: 59, baseType: !899, size: 32, align: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !999, file: !998, line: 60, baseType: !899, size: 32, align: 32, offset: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !984, file: !14, line: 3489, baseType: !1004, size: 64, align: 64, offset: 320)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !984, file: !14, line: 3490, baseType: !1007, size: 64, align: 64, offset: 384)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !984, file: !14, line: 3491, baseType: !1010, size: 64, align: 64, offset: 448)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !984, file: !14, line: 3492, baseType: !1013, size: 64, align: 64, offset: 512)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !984, file: !14, line: 3493, baseType: !906, size: 8, align: 8, offset: 576)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !984, file: !14, line: 3494, baseType: !1017, size: 64, align: 64, offset: 640)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !1021)
!1021 = !{!1022, !1023, !1028, !1032, !1033, !1034, !1035, !1039, !1045, !1047, !1051}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1020, file: !691, line: 72, baseType: !987, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1020, file: !691, line: 78, baseType: !1024, size: 64, align: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!987, !1027}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1020, file: !691, line: 85, baseType: !1029, size: 64, align: 64, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1020, file: !691, line: 93, baseType: !899, size: 32, align: 32, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1020, file: !691, line: 99, baseType: !899, size: 32, align: 32, offset: 224)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1020, file: !691, line: 108, baseType: !899, size: 32, align: 32, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1020, file: !691, line: 113, baseType: !1036, size: 64, align: 64, offset: 320)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!1027, !1027, !1027}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1020, file: !691, line: 123, baseType: !1040, size: 64, align: 64, offset: 384)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!1043, !1043}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1020, file: !691, line: 130, baseType: !1046, size: 32, align: 32, offset: 448)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1020, file: !691, line: 136, baseType: !1048, size: 64, align: 64, offset: 512)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!1046, !1027}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1020, file: !691, line: 142, baseType: !1052, size: 64, align: 64, offset: 576)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!899, !1055, !1027, !987, !899}
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !984, file: !14, line: 3495, baseType: !1059, size: 64, align: 64, offset: 704)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1063)
!1063 = !{!1064, !1065}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1062, file: !14, line: 3402, baseType: !899, size: 32, align: 32)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1062, file: !14, line: 3403, baseType: !987, size: 64, align: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !984, file: !14, line: 3507, baseType: !987, size: 64, align: 64, offset: 768)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !984, file: !14, line: 3516, baseType: !899, size: 32, align: 32, offset: 832)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !984, file: !14, line: 3517, baseType: !1069, size: 64, align: 64, offset: 896)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !984, file: !14, line: 3527, baseType: !1071, size: 64, align: 64, offset: 960)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!899, !1074}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1077)
!1077 = !{!1078, !1079, !1080, !1081, !1084, !1085, !1086, !1087, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1362, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1549, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1076, file: !14, line: 1561, baseType: !1017, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1076, file: !14, line: 1562, baseType: !899, size: 32, align: 32, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1076, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1076, file: !14, line: 1565, baseType: !1082, size: 64, align: 64, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1076, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1076, file: !14, line: 1581, baseType: !888, size: 32, align: 32, offset: 224)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1076, file: !14, line: 1583, baseType: !1027, size: 64, align: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1076, file: !14, line: 1591, baseType: !1088, size: 64, align: 64, offset: 320)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1090, line: 129, size: 1664, align: 64, elements: !1091)
!1090 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1091 = !{!1092, !1093, !1094, !1095, !1190, !1209, !1210, !1239, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1089, file: !1090, line: 136, baseType: !899, size: 32, align: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1089, file: !1090, line: 151, baseType: !899, size: 32, align: 32, offset: 32)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1089, file: !1090, line: 157, baseType: !899, size: 32, align: 32, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1089, file: !1090, line: 159, baseType: !1096, size: 64, align: 64, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1099)
!1099 = !{!1100, !1102, !1104, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1142, !1144, !1145, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1178, !1179, !1180, !1181, !1182, !1183, !1186, !1187, !1188, !1189}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1098, file: !722, line: 282, baseType: !1101, size: 512, align: 64)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 512, align: 64, elements: !964)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1098, file: !722, line: 299, baseType: !1103, size: 256, align: 32, offset: 512)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 256, align: 32, elements: !964)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1098, file: !722, line: 315, baseType: !1105, size: 64, align: 64, offset: 768)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1098, file: !722, line: 326, baseType: !899, size: 32, align: 32, offset: 832)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1098, file: !722, line: 326, baseType: !899, size: 32, align: 32, offset: 864)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1098, file: !722, line: 334, baseType: !899, size: 32, align: 32, offset: 896)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1098, file: !722, line: 341, baseType: !899, size: 32, align: 32, offset: 928)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1098, file: !722, line: 346, baseType: !899, size: 32, align: 32, offset: 960)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1098, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1098, file: !722, line: 356, baseType: !997, size: 64, align: 32, offset: 1024)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1098, file: !722, line: 361, baseType: !910, size: 64, align: 64, offset: 1088)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1098, file: !722, line: 369, baseType: !910, size: 64, align: 64, offset: 1152)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1098, file: !722, line: 377, baseType: !910, size: 64, align: 64, offset: 1216)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1098, file: !722, line: 382, baseType: !899, size: 32, align: 32, offset: 1280)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1098, file: !722, line: 386, baseType: !899, size: 32, align: 32, offset: 1312)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1098, file: !722, line: 391, baseType: !899, size: 32, align: 32, offset: 1344)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1098, file: !722, line: 396, baseType: !1027, size: 64, align: 64, offset: 1408)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1098, file: !722, line: 403, baseType: !1121, size: 512, align: 64, offset: 1472)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 512, align: 64, elements: !964)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1098, file: !722, line: 410, baseType: !899, size: 32, align: 32, offset: 1984)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1098, file: !722, line: 415, baseType: !899, size: 32, align: 32, offset: 2016)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1098, file: !722, line: 420, baseType: !899, size: 32, align: 32, offset: 2048)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1098, file: !722, line: 425, baseType: !899, size: 32, align: 32, offset: 2080)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1098, file: !722, line: 435, baseType: !910, size: 64, align: 64, offset: 2112)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1098, file: !722, line: 440, baseType: !899, size: 32, align: 32, offset: 2176)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1098, file: !722, line: 445, baseType: !929, size: 64, align: 64, offset: 2240)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1098, file: !722, line: 459, baseType: !1130, size: 512, align: 64, offset: 2304)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1131, size: 512, align: 64, elements: !964)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1133, line: 94, baseType: !1134)
!1133 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1133, line: 81, size: 192, align: 64, elements: !1135)
!1135 = !{!1136, !1140, !1141}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1134, file: !1133, line: 82, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1133, line: 73, baseType: !1139)
!1139 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1133, line: 73, flags: DIFlagFwdDecl)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1134, file: !1133, line: 89, baseType: !920, size: 64, align: 64, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1134, file: !1133, line: 93, baseType: !899, size: 32, align: 32, offset: 128)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1098, file: !722, line: 473, baseType: !1143, size: 64, align: 64, offset: 2816)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1098, file: !722, line: 477, baseType: !899, size: 32, align: 32, offset: 2880)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1098, file: !722, line: 479, baseType: !1146, size: 64, align: 64, offset: 2944)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1149)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1150)
!1150 = !{!1151, !1152, !1153, !1154, !1159}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1149, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1149, file: !722, line: 203, baseType: !920, size: 64, align: 64, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1149, file: !722, line: 204, baseType: !899, size: 32, align: 32, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1149, file: !722, line: 205, baseType: !1155, size: 64, align: 64, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1157, line: 86, baseType: !1158)
!1157 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1158 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1157, line: 86, flags: DIFlagFwdDecl)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1149, file: !722, line: 206, baseType: !1131, size: 64, align: 64, offset: 256)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1098, file: !722, line: 480, baseType: !899, size: 32, align: 32, offset: 3008)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1098, file: !722, line: 505, baseType: !899, size: 32, align: 32, offset: 3040)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1098, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1098, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1098, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1098, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1098, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1098, file: !722, line: 532, baseType: !910, size: 64, align: 64, offset: 3264)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1098, file: !722, line: 539, baseType: !910, size: 64, align: 64, offset: 3328)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1098, file: !722, line: 547, baseType: !910, size: 64, align: 64, offset: 3392)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1098, file: !722, line: 554, baseType: !1155, size: 64, align: 64, offset: 3456)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1098, file: !722, line: 563, baseType: !899, size: 32, align: 32, offset: 3520)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1098, file: !722, line: 572, baseType: !899, size: 32, align: 32, offset: 3552)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1098, file: !722, line: 581, baseType: !899, size: 32, align: 32, offset: 3584)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1098, file: !722, line: 588, baseType: !1175, size: 64, align: 64, offset: 3648)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !895, line: 36, baseType: !1177)
!1177 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1098, file: !722, line: 593, baseType: !899, size: 32, align: 32, offset: 3712)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1098, file: !722, line: 596, baseType: !899, size: 32, align: 32, offset: 3744)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1098, file: !722, line: 599, baseType: !1131, size: 64, align: 64, offset: 3776)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1098, file: !722, line: 605, baseType: !1131, size: 64, align: 64, offset: 3840)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1098, file: !722, line: 616, baseType: !1131, size: 64, align: 64, offset: 3904)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1098, file: !722, line: 626, baseType: !1184, size: 64, align: 64, offset: 3968)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1185, line: 216, baseType: !930)
!1185 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1098, file: !722, line: 627, baseType: !1184, size: 64, align: 64, offset: 4032)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1098, file: !722, line: 628, baseType: !1184, size: 64, align: 64, offset: 4096)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1098, file: !722, line: 629, baseType: !1184, size: 64, align: 64, offset: 4160)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1098, file: !722, line: 645, baseType: !1131, size: 64, align: 64, offset: 4224)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1089, file: !1090, line: 161, baseType: !1191, size: 64, align: 64, offset: 192)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1090, line: 117, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1090, line: 100, size: 832, align: 64, elements: !1194)
!1194 = !{!1195, !1200, !1201, !1202, !1203, !1204, !1206, !1207, !1208}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1193, file: !1090, line: 105, baseType: !1196, size: 256, align: 64)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1197, size: 256, align: 64, elements: !942)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1133, line: 238, baseType: !1199)
!1199 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1133, line: 238, flags: DIFlagFwdDecl)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1193, file: !1090, line: 110, baseType: !899, size: 32, align: 32, offset: 256)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1193, file: !1090, line: 111, baseType: !899, size: 32, align: 32, offset: 288)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1193, file: !1090, line: 111, baseType: !899, size: 32, align: 32, offset: 320)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1193, file: !1090, line: 112, baseType: !1103, size: 256, align: 32, offset: 352)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1193, file: !1090, line: 113, baseType: !1205, size: 128, align: 32, offset: 608)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 128, align: 32, elements: !942)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1193, file: !1090, line: 114, baseType: !899, size: 32, align: 32, offset: 736)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1193, file: !1090, line: 115, baseType: !899, size: 32, align: 32, offset: 768)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1193, file: !1090, line: 116, baseType: !899, size: 32, align: 32, offset: 800)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1089, file: !1090, line: 163, baseType: !1027, size: 64, align: 64, offset: 256)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1089, file: !1090, line: 165, baseType: !1211, size: 128, align: 64, offset: 320)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1090, line: 122, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1090, line: 119, size: 128, align: 64, elements: !1213)
!1213 = !{!1214, !1238}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1212, file: !1090, line: 120, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1218)
!1218 = !{!1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1234, !1235, !1236, !1237}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1217, file: !14, line: 1451, baseType: !1131, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1217, file: !14, line: 1461, baseType: !910, size: 64, align: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1217, file: !14, line: 1467, baseType: !910, size: 64, align: 64, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1217, file: !14, line: 1468, baseType: !920, size: 64, align: 64, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1217, file: !14, line: 1469, baseType: !899, size: 32, align: 32, offset: 256)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1217, file: !14, line: 1470, baseType: !899, size: 32, align: 32, offset: 288)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1217, file: !14, line: 1474, baseType: !899, size: 32, align: 32, offset: 320)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1217, file: !14, line: 1479, baseType: !1227, size: 64, align: 64, offset: 384)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1229)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1230)
!1230 = !{!1231, !1232, !1233}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1229, file: !14, line: 1412, baseType: !920, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1229, file: !14, line: 1413, baseType: !899, size: 32, align: 32, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1229, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1217, file: !14, line: 1480, baseType: !899, size: 32, align: 32, offset: 448)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1217, file: !14, line: 1486, baseType: !910, size: 64, align: 64, offset: 512)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1217, file: !14, line: 1488, baseType: !910, size: 64, align: 64, offset: 576)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1217, file: !14, line: 1497, baseType: !910, size: 64, align: 64, offset: 640)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1212, file: !1090, line: 121, baseType: !1096, size: 64, align: 64, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1089, file: !1090, line: 166, baseType: !1240, size: 128, align: 64, offset: 448)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1090, line: 127, baseType: !1241)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1090, line: 124, size: 128, align: 64, elements: !1242)
!1242 = !{!1243, !1316}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1241, file: !1090, line: 125, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1248)
!1248 = !{!1249, !1250, !1274, !1278, !1279, !1313, !1314, !1315}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1247, file: !14, line: 5751, baseType: !1017, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1247, file: !14, line: 5756, baseType: !1251, size: 64, align: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1253)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1254)
!1254 = !{!1255, !1256, !1259, !1260, !1261, !1265, !1269, !1273}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1253, file: !14, line: 5797, baseType: !987, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1253, file: !14, line: 5804, baseType: !1257, size: 64, align: 64, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1253, file: !14, line: 5815, baseType: !1017, size: 64, align: 64, offset: 128)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1253, file: !14, line: 5825, baseType: !899, size: 32, align: 32, offset: 192)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1253, file: !14, line: 5826, baseType: !1262, size: 64, align: 64, offset: 256)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!899, !1245}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1253, file: !14, line: 5827, baseType: !1266, size: 64, align: 64, offset: 320)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!899, !1245, !1215}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1253, file: !14, line: 5828, baseType: !1270, size: 64, align: 64, offset: 384)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{null, !1245}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1253, file: !14, line: 5829, baseType: !1270, size: 64, align: 64, offset: 448)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1247, file: !14, line: 5762, baseType: !1275, size: 64, align: 64, offset: 128)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1277)
!1277 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1247, file: !14, line: 5768, baseType: !1027, size: 64, align: 64, offset: 192)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1247, file: !14, line: 5775, baseType: !1280, size: 64, align: 64, offset: 256)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1282)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1283)
!1283 = !{!1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1282, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1282, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1282, file: !14, line: 3948, baseType: !894, size: 32, align: 32, offset: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1282, file: !14, line: 3958, baseType: !920, size: 64, align: 64, offset: 128)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1282, file: !14, line: 3962, baseType: !899, size: 32, align: 32, offset: 192)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1282, file: !14, line: 3968, baseType: !899, size: 32, align: 32, offset: 224)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1282, file: !14, line: 3973, baseType: !910, size: 64, align: 64, offset: 256)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1282, file: !14, line: 3986, baseType: !899, size: 32, align: 32, offset: 320)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1282, file: !14, line: 3999, baseType: !899, size: 32, align: 32, offset: 352)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1282, file: !14, line: 4004, baseType: !899, size: 32, align: 32, offset: 384)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1282, file: !14, line: 4005, baseType: !899, size: 32, align: 32, offset: 416)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1282, file: !14, line: 4010, baseType: !899, size: 32, align: 32, offset: 448)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1282, file: !14, line: 4011, baseType: !899, size: 32, align: 32, offset: 480)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1282, file: !14, line: 4020, baseType: !997, size: 64, align: 32, offset: 512)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1282, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1282, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1282, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1282, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1282, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1282, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1282, file: !14, line: 4039, baseType: !899, size: 32, align: 32, offset: 768)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1282, file: !14, line: 4046, baseType: !929, size: 64, align: 64, offset: 832)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1282, file: !14, line: 4050, baseType: !899, size: 32, align: 32, offset: 896)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1282, file: !14, line: 4054, baseType: !899, size: 32, align: 32, offset: 928)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1282, file: !14, line: 4061, baseType: !899, size: 32, align: 32, offset: 960)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1282, file: !14, line: 4065, baseType: !899, size: 32, align: 32, offset: 992)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1282, file: !14, line: 4073, baseType: !899, size: 32, align: 32, offset: 1024)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1282, file: !14, line: 4080, baseType: !899, size: 32, align: 32, offset: 1056)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1282, file: !14, line: 4084, baseType: !899, size: 32, align: 32, offset: 1088)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1247, file: !14, line: 5781, baseType: !1280, size: 64, align: 64, offset: 320)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1247, file: !14, line: 5787, baseType: !997, size: 64, align: 32, offset: 384)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1247, file: !14, line: 5793, baseType: !997, size: 64, align: 32, offset: 448)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1241, file: !1090, line: 126, baseType: !899, size: 32, align: 32, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1089, file: !1090, line: 172, baseType: !1215, size: 64, align: 64, offset: 576)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1089, file: !1090, line: 177, baseType: !920, size: 64, align: 64, offset: 640)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1089, file: !1090, line: 178, baseType: !888, size: 32, align: 32, offset: 704)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1089, file: !1090, line: 180, baseType: !1027, size: 64, align: 64, offset: 768)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1089, file: !1090, line: 185, baseType: !899, size: 32, align: 32, offset: 832)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1089, file: !1090, line: 190, baseType: !1027, size: 64, align: 64, offset: 896)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1089, file: !1090, line: 195, baseType: !899, size: 32, align: 32, offset: 960)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1089, file: !1090, line: 200, baseType: !1215, size: 64, align: 64, offset: 1024)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1089, file: !1090, line: 201, baseType: !899, size: 32, align: 32, offset: 1088)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1089, file: !1090, line: 202, baseType: !1096, size: 64, align: 64, offset: 1152)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1089, file: !1090, line: 203, baseType: !899, size: 32, align: 32, offset: 1216)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1089, file: !1090, line: 205, baseType: !899, size: 32, align: 32, offset: 1248)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1089, file: !1090, line: 206, baseType: !899, size: 32, align: 32, offset: 1280)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1089, file: !1090, line: 209, baseType: !1184, size: 64, align: 64, offset: 1344)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1089, file: !1090, line: 212, baseType: !1184, size: 64, align: 64, offset: 1408)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1089, file: !1090, line: 213, baseType: !1096, size: 64, align: 64, offset: 1472)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1089, file: !1090, line: 215, baseType: !899, size: 32, align: 32, offset: 1536)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1089, file: !1090, line: 217, baseType: !899, size: 32, align: 32, offset: 1568)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1089, file: !1090, line: 220, baseType: !899, size: 32, align: 32, offset: 1600)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1076, file: !14, line: 1598, baseType: !1027, size: 64, align: 64, offset: 384)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1076, file: !14, line: 1606, baseType: !910, size: 64, align: 64, offset: 448)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1076, file: !14, line: 1614, baseType: !899, size: 32, align: 32, offset: 512)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1076, file: !14, line: 1622, baseType: !899, size: 32, align: 32, offset: 544)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1076, file: !14, line: 1628, baseType: !899, size: 32, align: 32, offset: 576)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1076, file: !14, line: 1636, baseType: !899, size: 32, align: 32, offset: 608)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1076, file: !14, line: 1643, baseType: !899, size: 32, align: 32, offset: 640)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1076, file: !14, line: 1657, baseType: !920, size: 64, align: 64, offset: 704)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1076, file: !14, line: 1658, baseType: !899, size: 32, align: 32, offset: 768)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1076, file: !14, line: 1679, baseType: !997, size: 64, align: 32, offset: 800)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1076, file: !14, line: 1688, baseType: !899, size: 32, align: 32, offset: 864)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1076, file: !14, line: 1712, baseType: !899, size: 32, align: 32, offset: 896)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1076, file: !14, line: 1729, baseType: !899, size: 32, align: 32, offset: 928)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1076, file: !14, line: 1729, baseType: !899, size: 32, align: 32, offset: 960)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1076, file: !14, line: 1744, baseType: !899, size: 32, align: 32, offset: 992)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1076, file: !14, line: 1744, baseType: !899, size: 32, align: 32, offset: 1024)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1076, file: !14, line: 1751, baseType: !899, size: 32, align: 32, offset: 1056)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1076, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1076, file: !14, line: 1791, baseType: !1355, size: 64, align: 64, offset: 1152)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{null, !1358, !1359, !1361, !899, !899, !899}
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1097)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1076, file: !14, line: 1808, baseType: !1363, size: 64, align: 64, offset: 1216)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DISubroutineType(types: !1365)
!1365 = !{!473, !1358, !1004}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1076, file: !14, line: 1816, baseType: !899, size: 32, align: 32, offset: 1280)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1076, file: !14, line: 1825, baseType: !945, size: 32, align: 32, offset: 1312)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1076, file: !14, line: 1830, baseType: !899, size: 32, align: 32, offset: 1344)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1076, file: !14, line: 1838, baseType: !945, size: 32, align: 32, offset: 1376)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1076, file: !14, line: 1846, baseType: !899, size: 32, align: 32, offset: 1408)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1076, file: !14, line: 1851, baseType: !899, size: 32, align: 32, offset: 1440)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1076, file: !14, line: 1861, baseType: !945, size: 32, align: 32, offset: 1472)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1076, file: !14, line: 1868, baseType: !945, size: 32, align: 32, offset: 1504)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1076, file: !14, line: 1875, baseType: !945, size: 32, align: 32, offset: 1536)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1076, file: !14, line: 1882, baseType: !945, size: 32, align: 32, offset: 1568)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1076, file: !14, line: 1889, baseType: !945, size: 32, align: 32, offset: 1600)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1076, file: !14, line: 1896, baseType: !945, size: 32, align: 32, offset: 1632)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1076, file: !14, line: 1903, baseType: !945, size: 32, align: 32, offset: 1664)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1076, file: !14, line: 1910, baseType: !899, size: 32, align: 32, offset: 1696)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1076, file: !14, line: 1915, baseType: !899, size: 32, align: 32, offset: 1728)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1076, file: !14, line: 1926, baseType: !1361, size: 64, align: 64, offset: 1792)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1076, file: !14, line: 1935, baseType: !997, size: 64, align: 32, offset: 1856)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1076, file: !14, line: 1942, baseType: !899, size: 32, align: 32, offset: 1920)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1076, file: !14, line: 1948, baseType: !899, size: 32, align: 32, offset: 1952)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1076, file: !14, line: 1954, baseType: !899, size: 32, align: 32, offset: 1984)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1076, file: !14, line: 1960, baseType: !899, size: 32, align: 32, offset: 2016)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1076, file: !14, line: 1984, baseType: !899, size: 32, align: 32, offset: 2048)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1076, file: !14, line: 1991, baseType: !899, size: 32, align: 32, offset: 2080)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1076, file: !14, line: 1996, baseType: !899, size: 32, align: 32, offset: 2112)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1076, file: !14, line: 2004, baseType: !899, size: 32, align: 32, offset: 2144)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1076, file: !14, line: 2011, baseType: !899, size: 32, align: 32, offset: 2176)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1076, file: !14, line: 2018, baseType: !899, size: 32, align: 32, offset: 2208)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1076, file: !14, line: 2027, baseType: !899, size: 32, align: 32, offset: 2240)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1076, file: !14, line: 2034, baseType: !899, size: 32, align: 32, offset: 2272)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1076, file: !14, line: 2044, baseType: !899, size: 32, align: 32, offset: 2304)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1076, file: !14, line: 2054, baseType: !1397, size: 64, align: 64, offset: 2368)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1076, file: !14, line: 2061, baseType: !1397, size: 64, align: 64, offset: 2432)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1076, file: !14, line: 2066, baseType: !899, size: 32, align: 32, offset: 2496)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1076, file: !14, line: 2070, baseType: !899, size: 32, align: 32, offset: 2528)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1076, file: !14, line: 2078, baseType: !899, size: 32, align: 32, offset: 2560)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1076, file: !14, line: 2085, baseType: !899, size: 32, align: 32, offset: 2592)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1076, file: !14, line: 2092, baseType: !899, size: 32, align: 32, offset: 2624)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1076, file: !14, line: 2099, baseType: !899, size: 32, align: 32, offset: 2656)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1076, file: !14, line: 2106, baseType: !899, size: 32, align: 32, offset: 2688)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1076, file: !14, line: 2113, baseType: !899, size: 32, align: 32, offset: 2720)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1076, file: !14, line: 2120, baseType: !899, size: 32, align: 32, offset: 2752)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1076, file: !14, line: 2125, baseType: !899, size: 32, align: 32, offset: 2784)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1076, file: !14, line: 2133, baseType: !899, size: 32, align: 32, offset: 2816)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1076, file: !14, line: 2140, baseType: !899, size: 32, align: 32, offset: 2848)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1076, file: !14, line: 2145, baseType: !899, size: 32, align: 32, offset: 2880)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1076, file: !14, line: 2153, baseType: !899, size: 32, align: 32, offset: 2912)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1076, file: !14, line: 2158, baseType: !899, size: 32, align: 32, offset: 2944)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1076, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1076, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1076, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1076, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1076, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1076, file: !14, line: 2203, baseType: !899, size: 32, align: 32, offset: 3136)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1076, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1076, file: !14, line: 2212, baseType: !899, size: 32, align: 32, offset: 3200)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1076, file: !14, line: 2213, baseType: !899, size: 32, align: 32, offset: 3232)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1076, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1076, file: !14, line: 2232, baseType: !899, size: 32, align: 32, offset: 3296)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1076, file: !14, line: 2243, baseType: !899, size: 32, align: 32, offset: 3328)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1076, file: !14, line: 2249, baseType: !899, size: 32, align: 32, offset: 3360)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1076, file: !14, line: 2256, baseType: !899, size: 32, align: 32, offset: 3392)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1076, file: !14, line: 2263, baseType: !929, size: 64, align: 64, offset: 3456)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1076, file: !14, line: 2270, baseType: !929, size: 64, align: 64, offset: 3520)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1076, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1076, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1076, file: !14, line: 2367, baseType: !1433, size: 64, align: 64, offset: 3648)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DISubroutineType(types: !1435)
!1435 = !{!899, !1358, !1096, !899}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1076, file: !14, line: 2383, baseType: !899, size: 32, align: 32, offset: 3712)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1076, file: !14, line: 2386, baseType: !945, size: 32, align: 32, offset: 3744)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1076, file: !14, line: 2387, baseType: !945, size: 32, align: 32, offset: 3776)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1076, file: !14, line: 2394, baseType: !899, size: 32, align: 32, offset: 3808)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1076, file: !14, line: 2401, baseType: !899, size: 32, align: 32, offset: 3840)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1076, file: !14, line: 2408, baseType: !899, size: 32, align: 32, offset: 3872)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1076, file: !14, line: 2415, baseType: !899, size: 32, align: 32, offset: 3904)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1076, file: !14, line: 2422, baseType: !899, size: 32, align: 32, offset: 3936)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1076, file: !14, line: 2423, baseType: !1445, size: 64, align: 64, offset: 3968)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1447)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1448)
!1448 = !{!1449, !1450, !1451, !1452}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1447, file: !14, line: 827, baseType: !899, size: 32, align: 32)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1447, file: !14, line: 828, baseType: !899, size: 32, align: 32, offset: 32)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1447, file: !14, line: 829, baseType: !899, size: 32, align: 32, offset: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1447, file: !14, line: 830, baseType: !945, size: 32, align: 32, offset: 96)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1076, file: !14, line: 2430, baseType: !910, size: 64, align: 64, offset: 4032)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1076, file: !14, line: 2437, baseType: !910, size: 64, align: 64, offset: 4096)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1076, file: !14, line: 2444, baseType: !945, size: 32, align: 32, offset: 4160)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1076, file: !14, line: 2451, baseType: !945, size: 32, align: 32, offset: 4192)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1076, file: !14, line: 2458, baseType: !899, size: 32, align: 32, offset: 4224)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1076, file: !14, line: 2469, baseType: !899, size: 32, align: 32, offset: 4256)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1076, file: !14, line: 2475, baseType: !899, size: 32, align: 32, offset: 4288)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1076, file: !14, line: 2481, baseType: !899, size: 32, align: 32, offset: 4320)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1076, file: !14, line: 2485, baseType: !899, size: 32, align: 32, offset: 4352)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1076, file: !14, line: 2489, baseType: !899, size: 32, align: 32, offset: 4384)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1076, file: !14, line: 2493, baseType: !899, size: 32, align: 32, offset: 4416)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1076, file: !14, line: 2501, baseType: !899, size: 32, align: 32, offset: 4448)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1076, file: !14, line: 2506, baseType: !899, size: 32, align: 32, offset: 4480)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1076, file: !14, line: 2510, baseType: !899, size: 32, align: 32, offset: 4512)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1076, file: !14, line: 2514, baseType: !910, size: 64, align: 64, offset: 4544)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1076, file: !14, line: 2528, baseType: !1469, size: 64, align: 64, offset: 4608)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DISubroutineType(types: !1471)
!1471 = !{null, !1358, !1027, !899, !899}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1076, file: !14, line: 2534, baseType: !899, size: 32, align: 32, offset: 4672)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1076, file: !14, line: 2545, baseType: !899, size: 32, align: 32, offset: 4704)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1076, file: !14, line: 2547, baseType: !899, size: 32, align: 32, offset: 4736)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1076, file: !14, line: 2549, baseType: !899, size: 32, align: 32, offset: 4768)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1076, file: !14, line: 2551, baseType: !899, size: 32, align: 32, offset: 4800)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1076, file: !14, line: 2553, baseType: !899, size: 32, align: 32, offset: 4832)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1076, file: !14, line: 2555, baseType: !899, size: 32, align: 32, offset: 4864)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1076, file: !14, line: 2557, baseType: !899, size: 32, align: 32, offset: 4896)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1076, file: !14, line: 2559, baseType: !899, size: 32, align: 32, offset: 4928)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1076, file: !14, line: 2563, baseType: !899, size: 32, align: 32, offset: 4960)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1076, file: !14, line: 2571, baseType: !1483, size: 64, align: 64, offset: 4992)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1076, file: !14, line: 2579, baseType: !1483, size: 64, align: 64, offset: 5056)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1076, file: !14, line: 2586, baseType: !899, size: 32, align: 32, offset: 5120)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1076, file: !14, line: 2615, baseType: !899, size: 32, align: 32, offset: 5152)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1076, file: !14, line: 2627, baseType: !899, size: 32, align: 32, offset: 5184)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1076, file: !14, line: 2637, baseType: !899, size: 32, align: 32, offset: 5216)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1076, file: !14, line: 2681, baseType: !899, size: 32, align: 32, offset: 5248)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1076, file: !14, line: 2709, baseType: !910, size: 64, align: 64, offset: 5312)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1076, file: !14, line: 2716, baseType: !1492, size: 64, align: 64, offset: 5376)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1494)
!1494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1495)
!1495 = !{!1496, !1497, !1498, !1499, !1500, !1501, !1505, !1509, !1513, !1514, !1515, !1516, !1522, !1523, !1524, !1525, !1526}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1494, file: !14, line: 3642, baseType: !987, size: 64, align: 64)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1494, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1494, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1494, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1494, file: !14, line: 3669, baseType: !899, size: 32, align: 32, offset: 160)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1494, file: !14, line: 3682, baseType: !1502, size: 64, align: 64, offset: 192)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{!899, !1074, !1096}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1494, file: !14, line: 3698, baseType: !1506, size: 64, align: 64, offset: 256)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{!899, !1074, !904, !894}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1494, file: !14, line: 3712, baseType: !1510, size: 64, align: 64, offset: 320)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DISubroutineType(types: !1512)
!1512 = !{!899, !1074, !899, !904, !894}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1494, file: !14, line: 3726, baseType: !1506, size: 64, align: 64, offset: 384)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1494, file: !14, line: 3737, baseType: !1071, size: 64, align: 64, offset: 448)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1494, file: !14, line: 3746, baseType: !899, size: 32, align: 32, offset: 512)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1494, file: !14, line: 3757, baseType: !1517, size: 64, align: 64, offset: 576)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1518 = !DISubroutineType(types: !1519)
!1519 = !{null, !1520}
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1494, file: !14, line: 3766, baseType: !1071, size: 64, align: 64, offset: 640)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1494, file: !14, line: 3774, baseType: !1071, size: 64, align: 64, offset: 704)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1494, file: !14, line: 3780, baseType: !899, size: 32, align: 32, offset: 768)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1494, file: !14, line: 3785, baseType: !899, size: 32, align: 32, offset: 800)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1494, file: !14, line: 3795, baseType: !1527, size: 64, align: 64, offset: 832)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DISubroutineType(types: !1529)
!1529 = !{!899, !1074, !1131}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1076, file: !14, line: 2728, baseType: !1027, size: 64, align: 64, offset: 5440)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1076, file: !14, line: 2735, baseType: !1121, size: 512, align: 64, offset: 5504)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1076, file: !14, line: 2742, baseType: !899, size: 32, align: 32, offset: 6016)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1076, file: !14, line: 2755, baseType: !899, size: 32, align: 32, offset: 6048)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1076, file: !14, line: 2776, baseType: !899, size: 32, align: 32, offset: 6080)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1076, file: !14, line: 2783, baseType: !899, size: 32, align: 32, offset: 6112)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1076, file: !14, line: 2791, baseType: !899, size: 32, align: 32, offset: 6144)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1076, file: !14, line: 2802, baseType: !1096, size: 64, align: 64, offset: 6208)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1076, file: !14, line: 2811, baseType: !899, size: 32, align: 32, offset: 6272)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1076, file: !14, line: 2821, baseType: !899, size: 32, align: 32, offset: 6304)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1076, file: !14, line: 2830, baseType: !899, size: 32, align: 32, offset: 6336)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1076, file: !14, line: 2840, baseType: !899, size: 32, align: 32, offset: 6368)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1076, file: !14, line: 2851, baseType: !1543, size: 64, align: 64, offset: 6400)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DISubroutineType(types: !1545)
!1545 = !{!899, !1358, !1546, !1027, !1361, !899, !899}
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DISubroutineType(types: !1548)
!1548 = !{!899, !1358, !1027}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1076, file: !14, line: 2871, baseType: !1550, size: 64, align: 64, offset: 6464)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{!899, !1358, !1553, !1027, !1361, !899}
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DISubroutineType(types: !1555)
!1555 = !{!899, !1358, !1027, !899, !899}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1076, file: !14, line: 2878, baseType: !899, size: 32, align: 32, offset: 6528)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1076, file: !14, line: 2885, baseType: !899, size: 32, align: 32, offset: 6560)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1076, file: !14, line: 3005, baseType: !899, size: 32, align: 32, offset: 6592)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1076, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1076, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1076, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1076, file: !14, line: 3037, baseType: !920, size: 64, align: 64, offset: 6720)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1076, file: !14, line: 3038, baseType: !899, size: 32, align: 32, offset: 6784)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1076, file: !14, line: 3050, baseType: !929, size: 64, align: 64, offset: 6848)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1076, file: !14, line: 3065, baseType: !899, size: 32, align: 32, offset: 6912)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1076, file: !14, line: 3083, baseType: !899, size: 32, align: 32, offset: 6944)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1076, file: !14, line: 3092, baseType: !997, size: 64, align: 32, offset: 6976)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1076, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1076, file: !14, line: 3106, baseType: !997, size: 64, align: 32, offset: 7072)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1076, file: !14, line: 3113, baseType: !1571, size: 64, align: 64, offset: 7168)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1573)
!1573 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1574)
!1574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1575)
!1575 = !{!1576, !1577, !1578, !1579, !1580, !1581, !1584}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1574, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1574, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1574, file: !14, line: 720, baseType: !987, size: 64, align: 64, offset: 64)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1574, file: !14, line: 724, baseType: !987, size: 64, align: 64, offset: 128)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1574, file: !14, line: 728, baseType: !899, size: 32, align: 32, offset: 192)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1574, file: !14, line: 734, baseType: !1582, size: 64, align: 64, offset: 256)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1574, file: !14, line: 739, baseType: !1585, size: 64, align: 64, offset: 320)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1062)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1076, file: !14, line: 3129, baseType: !910, size: 64, align: 64, offset: 7232)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1076, file: !14, line: 3130, baseType: !910, size: 64, align: 64, offset: 7296)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1076, file: !14, line: 3131, baseType: !910, size: 64, align: 64, offset: 7360)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1076, file: !14, line: 3132, baseType: !910, size: 64, align: 64, offset: 7424)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1076, file: !14, line: 3139, baseType: !1483, size: 64, align: 64, offset: 7488)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1076, file: !14, line: 3147, baseType: !899, size: 32, align: 32, offset: 7552)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1076, file: !14, line: 3165, baseType: !899, size: 32, align: 32, offset: 7584)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1076, file: !14, line: 3172, baseType: !899, size: 32, align: 32, offset: 7616)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1076, file: !14, line: 3180, baseType: !899, size: 32, align: 32, offset: 7648)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1076, file: !14, line: 3191, baseType: !1397, size: 64, align: 64, offset: 7680)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1076, file: !14, line: 3199, baseType: !920, size: 64, align: 64, offset: 7744)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1076, file: !14, line: 3207, baseType: !1483, size: 64, align: 64, offset: 7808)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1076, file: !14, line: 3214, baseType: !888, size: 32, align: 32, offset: 7872)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1076, file: !14, line: 3224, baseType: !1227, size: 64, align: 64, offset: 7936)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1076, file: !14, line: 3225, baseType: !899, size: 32, align: 32, offset: 8000)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1076, file: !14, line: 3249, baseType: !1131, size: 64, align: 64, offset: 8064)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1076, file: !14, line: 3256, baseType: !899, size: 32, align: 32, offset: 8128)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1076, file: !14, line: 3271, baseType: !899, size: 32, align: 32, offset: 8160)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1076, file: !14, line: 3279, baseType: !910, size: 64, align: 64, offset: 8192)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1076, file: !14, line: 3301, baseType: !1131, size: 64, align: 64, offset: 8256)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1076, file: !14, line: 3310, baseType: !899, size: 32, align: 32, offset: 8320)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1076, file: !14, line: 3337, baseType: !899, size: 32, align: 32, offset: 8352)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1076, file: !14, line: 3351, baseType: !899, size: 32, align: 32, offset: 8384)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1076, file: !14, line: 3359, baseType: !899, size: 32, align: 32, offset: 8416)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !984, file: !14, line: 3535, baseType: !1612, size: 64, align: 64, offset: 1024)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DISubroutineType(types: !1614)
!1614 = !{!899, !1074, !1615}
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1075)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !984, file: !14, line: 3541, baseType: !1618, size: 64, align: 64, offset: 1088)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1620)
!1620 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1621)
!1621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1090, line: 223, size: 128, align: 64, elements: !1622)
!1622 = !{!1623, !1624}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1621, file: !1090, line: 224, baseType: !904, size: 64, align: 64)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1621, file: !1090, line: 225, baseType: !904, size: 64, align: 64, offset: 64)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !984, file: !14, line: 3549, baseType: !1626, size: 64, align: 64, offset: 1152)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{null, !1069}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !984, file: !14, line: 3551, baseType: !1071, size: 64, align: 64, offset: 1216)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !984, file: !14, line: 3552, baseType: !1631, size: 64, align: 64, offset: 1280)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64, align: 64)
!1632 = !DISubroutineType(types: !1633)
!1633 = !{!899, !1074, !920, !899, !1634}
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1636)
!1636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1637)
!1637 = !{!1638, !1639, !1640, !1641, !1642, !1666}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1636, file: !14, line: 3921, baseType: !902, size: 16, align: 16)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1636, file: !14, line: 3922, baseType: !894, size: 32, align: 32, offset: 32)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1636, file: !14, line: 3923, baseType: !894, size: 32, align: 32, offset: 64)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1636, file: !14, line: 3924, baseType: !888, size: 32, align: 32, offset: 96)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1636, file: !14, line: 3925, baseType: !1643, size: 64, align: 64, offset: 128)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64, align: 64)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1646)
!1646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1647)
!1647 = !{!1648, !1649, !1650, !1651, !1652, !1653, !1659, !1661, !1662, !1663, !1664, !1665}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1646, file: !14, line: 3886, baseType: !899, size: 32, align: 32)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1646, file: !14, line: 3887, baseType: !899, size: 32, align: 32, offset: 32)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1646, file: !14, line: 3888, baseType: !899, size: 32, align: 32, offset: 64)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1646, file: !14, line: 3889, baseType: !899, size: 32, align: 32, offset: 96)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1646, file: !14, line: 3890, baseType: !899, size: 32, align: 32, offset: 128)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1646, file: !14, line: 3897, baseType: !1654, size: 768, align: 64, offset: 192)
!1654 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1655)
!1655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1656)
!1656 = !{!1657, !1658}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1655, file: !14, line: 3855, baseType: !1101, size: 512, align: 64)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1655, file: !14, line: 3857, baseType: !1103, size: 256, align: 32, offset: 512)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1646, file: !14, line: 3903, baseType: !1660, size: 256, align: 64, offset: 960)
!1660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 256, align: 64, elements: !942)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1646, file: !14, line: 3904, baseType: !1205, size: 128, align: 32, offset: 1216)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1646, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1646, file: !14, line: 3908, baseType: !1483, size: 64, align: 64, offset: 1408)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1646, file: !14, line: 3915, baseType: !1483, size: 64, align: 64, offset: 1472)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1646, file: !14, line: 3917, baseType: !899, size: 32, align: 32, offset: 1536)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1636, file: !14, line: 3926, baseType: !910, size: 64, align: 64, offset: 192)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !984, file: !14, line: 3564, baseType: !1668, size: 64, align: 64, offset: 1344)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{!899, !1074, !1215, !1359, !1361}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !984, file: !14, line: 3566, baseType: !1672, size: 64, align: 64, offset: 1408)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{!899, !1074, !1027, !1361, !1215}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !984, file: !14, line: 3567, baseType: !1071, size: 64, align: 64, offset: 1472)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !984, file: !14, line: 3576, baseType: !1677, size: 64, align: 64, offset: 1536)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DISubroutineType(types: !1679)
!1679 = !{!899, !1074, !1359}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !984, file: !14, line: 3577, baseType: !1681, size: 64, align: 64, offset: 1600)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{!899, !1074, !1215}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !984, file: !14, line: 3584, baseType: !1502, size: 64, align: 64, offset: 1664)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !984, file: !14, line: 3589, baseType: !1686, size: 64, align: 64, offset: 1728)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64, align: 64)
!1687 = !DISubroutineType(types: !1688)
!1688 = !{null, !1074}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !984, file: !14, line: 3594, baseType: !899, size: 32, align: 32, offset: 1792)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !984, file: !14, line: 3600, baseType: !987, size: 64, align: 64, offset: 1856)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !984, file: !14, line: 3609, baseType: !1692, size: 64, align: 64, offset: 1920)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1695)
!1695 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1696 = distinct !DIGlobalVariable(name: "ff_pcm_alaw_decoder", scope: !0, file: !982, line: 597, type: !983, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_pcm_alaw_decoder)
!1697 = distinct !DIGlobalVariable(name: "ff_pcm_f16le_decoder", scope: !0, file: !982, line: 598, type: !983, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_pcm_f16le_decoder)
!1698 = distinct !DIGlobalVariable(name: "ff_pcm_f24le_decoder", scope: !0, file: !982, line: 599, type: !983, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_pcm_f24le_decoder)
!1699 = distinct !DIGlobalVariable(name: "ff_pcm_f32be_encoder", scope: !0, file: !982, line: 600, type: !983, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_pcm_f32be_encoder)
!1700 = distinct !DIGlobalVariable(name: "ff_pcm_f32be_decoder", scope: !0, file: !982, line: 600, type: !983, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_pcm_f32be_decoder)
!1701 = distinct !DIGlobalVariable(name: "ff_pcm_f32le_encoder", scope: !0, file: !982, line: 601, type: !983, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_pcm_f32le_encoder)
!1702 = distinct !DIGlobalVariable(name: "ff_pcm_f32le_decoder", scope: !0, file: !982, line: 601, type: !983, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_pcm_f32le_decoder)
!1703 = distinct !DIGlobalVariable(name: "ff_pcm_f64be_encoder", scope: !0, file: !982, line: 602, type: !983, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_pcm_f64be_encoder)
!1704 = distinct !DIGlobalVariable(name: "ff_pcm_f64be_decoder", scope: !0, file: !982, line: 602, type: !983, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_pcm_f64be_decoder)
!1705 = distinct !DIGlobalVariable(name: "ff_pcm_f64le_encoder", scope: !0, file: !982, line: 603, type: !983, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_pcm_f64le_encoder)
!1706 = distinct !DIGlobalVariable(name: "ff_pcm_f64le_decoder", scope: !0, file: !982, line: 603, type: !983, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_pcm_f64le_decoder)
