; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--hevc_ps.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--hevc_ps.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVRational = type { i32, i32 }
%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }

!903 = !DIEnumerator(name: "HEVC_MAX_LUMA_PS", value: 35651584)
!904 = !DIEnumerator(name: "HEVC_MAX_WIDTH", value: 16888)
!905 = !DIEnumerator(name: "HEVC_MAX_HEIGHT", value: 16888)
!906 = !DIEnumerator(name: "HEVC_MAX_TILE_ROWS", value: 22)
!907 = !DIEnumerator(name: "HEVC_MAX_TILE_COLUMNS", value: 20)
!908 = !DIEnumerator(name: "HEVC_MAX_SLICE_SEGMENTS", value: 600)
!909 = !DIEnumerator(name: "HEVC_MAX_ENTRY_POINT_OFFSETS", value: 2700)
!910 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HEVCNALUnitType", file: !888, line: 28, size: 32, align: 32, elements: !911)
!911 = !{!912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975}
!912 = !DIEnumerator(name: "HEVC_NAL_TRAIL_N", value: 0)
!913 = !DIEnumerator(name: "HEVC_NAL_TRAIL_R", value: 1)
!914 = !DIEnumerator(name: "HEVC_NAL_TSA_N", value: 2)
!915 = !DIEnumerator(name: "HEVC_NAL_TSA_R", value: 3)
!916 = !DIEnumerator(name: "HEVC_NAL_STSA_N", value: 4)
!917 = !DIEnumerator(name: "HEVC_NAL_STSA_R", value: 5)
!918 = !DIEnumerator(name: "HEVC_NAL_RADL_N", value: 6)
!919 = !DIEnumerator(name: "HEVC_NAL_RADL_R", value: 7)
!920 = !DIEnumerator(name: "HEVC_NAL_RASL_N", value: 8)
!921 = !DIEnumerator(name: "HEVC_NAL_RASL_R", value: 9)
!922 = !DIEnumerator(name: "HEVC_NAL_VCL_N10", value: 10)
!923 = !DIEnumerator(name: "HEVC_NAL_VCL_R11", value: 11)
!924 = !DIEnumerator(name: "HEVC_NAL_VCL_N12", value: 12)
!925 = !DIEnumerator(name: "HEVC_NAL_VCL_R13", value: 13)
!926 = !DIEnumerator(name: "HEVC_NAL_VCL_N14", value: 14)
!927 = !DIEnumerator(name: "HEVC_NAL_VCL_R15", value: 15)
!928 = !DIEnumerator(name: "HEVC_NAL_BLA_W_LP", value: 16)
!929 = !DIEnumerator(name: "HEVC_NAL_BLA_W_RADL", value: 17)
!930 = !DIEnumerator(name: "HEVC_NAL_BLA_N_LP", value: 18)
!931 = !DIEnumerator(name: "HEVC_NAL_IDR_W_RADL", value: 19)
!932 = !DIEnumerator(name: "HEVC_NAL_IDR_N_LP", value: 20)
!933 = !DIEnumerator(name: "HEVC_NAL_CRA_NUT", value: 21)
!934 = !DIEnumerator(name: "HEVC_NAL_IRAP_VCL22", value: 22)
!935 = !DIEnumerator(name: "HEVC_NAL_IRAP_VCL23", value: 23)
!936 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL24", value: 24)
!937 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL25", value: 25)
!938 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL26", value: 26)
!939 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL27", value: 27)
!940 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL28", value: 28)
!941 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL29", value: 29)
!942 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL30", value: 30)
!943 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL31", value: 31)
!944 = !DIEnumerator(name: "HEVC_NAL_VPS", value: 32)
!945 = !DIEnumerator(name: "HEVC_NAL_SPS", value: 33)
!946 = !DIEnumerator(name: "HEVC_NAL_PPS", value: 34)
!947 = !DIEnumerator(name: "HEVC_NAL_AUD", value: 35)
!948 = !DIEnumerator(name: "HEVC_NAL_EOS_NUT", value: 36)
!949 = !DIEnumerator(name: "HEVC_NAL_EOB_NUT", value: 37)
!950 = !DIEnumerator(name: "HEVC_NAL_FD_NUT", value: 38)
!951 = !DIEnumerator(name: "HEVC_NAL_SEI_PREFIX", value: 39)
!952 = !DIEnumerator(name: "HEVC_NAL_SEI_SUFFIX", value: 40)
!953 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL41", value: 41)
!954 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL42", value: 42)
!955 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL43", value: 43)
!956 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL44", value: 44)
!957 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL45", value: 45)
!958 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL46", value: 46)
!959 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL47", value: 47)
!960 = !DIEnumerator(name: "HEVC_NAL_UNSPEC48", value: 48)
!961 = !DIEnumerator(name: "HEVC_NAL_UNSPEC49", value: 49)
!962 = !DIEnumerator(name: "HEVC_NAL_UNSPEC50", value: 50)
!963 = !DIEnumerator(name: "HEVC_NAL_UNSPEC51", value: 51)
!964 = !DIEnumerator(name: "HEVC_NAL_UNSPEC52", value: 52)
!965 = !DIEnumerator(name: "HEVC_NAL_UNSPEC53", value: 53)
!966 = !DIEnumerator(name: "HEVC_NAL_UNSPEC54", value: 54)
!967 = !DIEnumerator(name: "HEVC_NAL_UNSPEC55", value: 55)
!968 = !DIEnumerator(name: "HEVC_NAL_UNSPEC56", value: 56)
!969 = !DIEnumerator(name: "HEVC_NAL_UNSPEC57", value: 57)
!970 = !DIEnumerator(name: "HEVC_NAL_UNSPEC58", value: 58)
!971 = !DIEnumerator(name: "HEVC_NAL_UNSPEC59", value: 59)
!972 = !DIEnumerator(name: "HEVC_NAL_UNSPEC60", value: 60)
!973 = !DIEnumerator(name: "HEVC_NAL_UNSPEC61", value: 61)
!974 = !DIEnumerator(name: "HEVC_NAL_UNSPEC62", value: 62)
!975 = !DIEnumerator(name: "HEVC_NAL_UNSPEC63", value: 63)
!976 = !{!977, !978, !979, !1036, !1197, !1198, !1199, !985, !1205, !1207, !1209, !1026, !1278}
!977 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!978 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCVPS", file: !981, line: 216, baseType: !982)
!981 = !DIFile(filename: "libavcodec/hevc_ps.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCVPS", file: !981, line: 195, size: 36544, align: 32, elements: !983)
!983 = !{!984, !988, !989, !990, !1017, !1018, !1020, !1021, !1022, !1023, !1024, !1025, !1027, !1028, !1029, !1030, !1031, !1035}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "vps_temporal_id_nesting_flag", scope: !982, file: !981, line: 196, baseType: !985, size: 8, align: 8)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !986, line: 48, baseType: !987)
!986 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!987 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_layers", scope: !982, file: !981, line: 197, baseType: !977, size: 32, align: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_sub_layers", scope: !982, file: !981, line: 198, baseType: !977, size: 32, align: 32, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ptl", scope: !982, file: !981, line: 200, baseType: !991, size: 2672, align: 8, offset: 96)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "PTL", file: !981, line: 193, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PTL", file: !981, line: 187, size: 2672, align: 8, elements: !993)
!993 = !{!994, !1010, !1014, !1016}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "general_ptl", scope: !992, file: !981, line: 188, baseType: !995, size: 320, align: 8)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "PTLCommon", file: !981, line: 185, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PTLCommon", file: !981, line: 175, size: 320, align: 8, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1005, !1006, !1007, !1008, !1009}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "profile_space", scope: !996, file: !981, line: 176, baseType: !985, size: 8, align: 8)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "tier_flag", scope: !996, file: !981, line: 177, baseType: !985, size: 8, align: 8, offset: 8)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !996, file: !981, line: 178, baseType: !985, size: 8, align: 8, offset: 16)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "profile_compatibility_flag", scope: !996, file: !981, line: 179, baseType: !1002, size: 256, align: 8, offset: 24)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 256, align: 8, elements: !1003)
!1003 = !{!1004}
!1004 = !DISubrange(count: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !996, file: !981, line: 180, baseType: !985, size: 8, align: 8, offset: 280)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_source_flag", scope: !996, file: !981, line: 181, baseType: !985, size: 8, align: 8, offset: 288)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_source_flag", scope: !996, file: !981, line: 182, baseType: !985, size: 8, align: 8, offset: 296)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "non_packed_constraint_flag", scope: !996, file: !981, line: 183, baseType: !985, size: 8, align: 8, offset: 304)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "frame_only_constraint_flag", scope: !996, file: !981, line: 184, baseType: !985, size: 8, align: 8, offset: 312)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_ptl", scope: !992, file: !981, line: 189, baseType: !1011, size: 2240, align: 8, offset: 320)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !995, size: 2240, align: 8, elements: !1012)
!1012 = !{!1013}
!1013 = !DISubrange(count: 7)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_profile_present_flag", scope: !992, file: !981, line: 191, baseType: !1015, size: 56, align: 8, offset: 2560)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 56, align: 8, elements: !1012)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_level_present_flag", scope: !992, file: !981, line: 192, baseType: !1015, size: 56, align: 8, offset: 2616)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "vps_sub_layer_ordering_info_present_flag", scope: !982, file: !981, line: 201, baseType: !977, size: 32, align: 32, offset: 2784)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_dec_pic_buffering", scope: !982, file: !981, line: 202, baseType: !1019, size: 224, align: 32, offset: 2816)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 224, align: 32, elements: !1012)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_reorder_pics", scope: !982, file: !981, line: 203, baseType: !1019, size: 224, align: 32, offset: 3040)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_latency_increase", scope: !982, file: !981, line: 204, baseType: !1019, size: 224, align: 32, offset: 3264)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_layer_id", scope: !982, file: !981, line: 205, baseType: !977, size: 32, align: 32, offset: 3488)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_layer_sets", scope: !982, file: !981, line: 206, baseType: !977, size: 32, align: 32, offset: 3520)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "vps_timing_info_present_flag", scope: !982, file: !981, line: 207, baseType: !985, size: 8, align: 8, offset: 3552)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_units_in_tick", scope: !982, file: !981, line: 208, baseType: !1026, size: 32, align: 32, offset: 3584)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !986, line: 51, baseType: !978)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "vps_time_scale", scope: !982, file: !981, line: 209, baseType: !1026, size: 32, align: 32, offset: 3616)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "vps_poc_proportional_to_timing_flag", scope: !982, file: !981, line: 210, baseType: !985, size: 8, align: 8, offset: 3648)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_ticks_poc_diff_one", scope: !982, file: !981, line: 211, baseType: !977, size: 32, align: 32, offset: 3680)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_hrd_parameters", scope: !982, file: !981, line: 212, baseType: !977, size: 32, align: 32, offset: 3712)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !982, file: !981, line: 214, baseType: !1032, size: 32768, align: 8, offset: 3744)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 32768, align: 8, elements: !1033)
!1033 = !{!1034}
!1034 = !DISubrange(count: 4096)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !982, file: !981, line: 215, baseType: !977, size: 32, align: 32, offset: 36512)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSPS", file: !981, line: 319, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSPS", file: !981, line: 225, size: 140544, align: 32, elements: !1039)
!1039 = !{!1040, !1041, !1042, !1043, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1066, !1067, !1110, !1111, !1112, !1126, !1127, !1140, !1141, !1142, !1143, !1147, !1148, !1149, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1193, !1194, !1195, !1196}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "vps_id", scope: !1038, file: !981, line: 226, baseType: !978, size: 32, align: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !1038, file: !981, line: 227, baseType: !977, size: 32, align: 32, offset: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !1038, file: !981, line: 228, baseType: !985, size: 8, align: 8, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "output_window", scope: !1038, file: !981, line: 230, baseType: !1044, size: 128, align: 32, offset: 96)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCWindow", file: !981, line: 130, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCWindow", file: !981, line: 125, size: 128, align: 32, elements: !1046)
!1046 = !{!1047, !1048, !1049, !1050}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "left_offset", scope: !1045, file: !981, line: 126, baseType: !978, size: 32, align: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "right_offset", scope: !1045, file: !981, line: 127, baseType: !978, size: 32, align: 32, offset: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "top_offset", scope: !1045, file: !981, line: 128, baseType: !978, size: 32, align: 32, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_offset", scope: !1045, file: !981, line: 129, baseType: !978, size: 32, align: 32, offset: 96)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "pic_conf_win", scope: !1038, file: !981, line: 232, baseType: !1044, size: 128, align: 32, offset: 224)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !1038, file: !981, line: 234, baseType: !977, size: 32, align: 32, offset: 352)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma", scope: !1038, file: !981, line: 235, baseType: !977, size: 32, align: 32, offset: 384)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_shift", scope: !1038, file: !981, line: 236, baseType: !977, size: 32, align: 32, offset: 416)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1038, file: !981, line: 237, baseType: !494, size: 32, align: 32, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_poc_lsb", scope: !1038, file: !981, line: 239, baseType: !978, size: 32, align: 32, offset: 480)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "pcm_enabled_flag", scope: !1038, file: !981, line: 240, baseType: !977, size: 32, align: 32, offset: 512)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "max_sub_layers", scope: !1038, file: !981, line: 242, baseType: !977, size: 32, align: 32, offset: 544)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_layer", scope: !1038, file: !981, line: 247, baseType: !1060, size: 672, align: 32, offset: 576)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1061, size: 672, align: 32, elements: !1012)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1038, file: !981, line: 243, size: 96, align: 32, elements: !1062)
!1062 = !{!1063, !1064, !1065}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_pic_buffering", scope: !1061, file: !981, line: 244, baseType: !977, size: 32, align: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_pics", scope: !1061, file: !981, line: 245, baseType: !977, size: 32, align: 32, offset: 32)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "max_latency_increase", scope: !1061, file: !981, line: 246, baseType: !977, size: 32, align: 32, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id_nesting_flag", scope: !1038, file: !981, line: 248, baseType: !985, size: 8, align: 8, offset: 1248)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !1038, file: !981, line: 250, baseType: !1068, size: 1120, align: 32, offset: 1280)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "VUI", file: !981, line: 173, baseType: !1069)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VUI", file: !981, line: 132, size: 1120, align: 32, elements: !1070)
!1070 = !{!1071, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "sar", scope: !1069, file: !981, line: 133, baseType: !1072, size: 64, align: 32)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1073, line: 61, baseType: !1074)
!1073 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1073, line: 58, size: 64, align: 32, elements: !1075)
!1075 = !{!1076, !1077}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1074, file: !1073, line: 59, baseType: !977, size: 32, align: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1074, file: !1073, line: 60, baseType: !977, size: 32, align: 32, offset: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !1069, file: !981, line: 135, baseType: !977, size: 32, align: 32, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !1069, file: !981, line: 136, baseType: !977, size: 32, align: 32, offset: 96)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !1069, file: !981, line: 138, baseType: !977, size: 32, align: 32, offset: 128)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !1069, file: !981, line: 139, baseType: !977, size: 32, align: 32, offset: 160)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !1069, file: !981, line: 140, baseType: !977, size: 32, align: 32, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !1069, file: !981, line: 141, baseType: !977, size: 32, align: 32, offset: 224)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !1069, file: !981, line: 142, baseType: !985, size: 8, align: 8, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristic", scope: !1069, file: !981, line: 143, baseType: !985, size: 8, align: 8, offset: 264)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coeffs", scope: !1069, file: !981, line: 144, baseType: !985, size: 8, align: 8, offset: 272)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_loc_info_present_flag", scope: !1069, file: !981, line: 146, baseType: !977, size: 32, align: 32, offset: 288)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !1069, file: !981, line: 147, baseType: !977, size: 32, align: 32, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !1069, file: !981, line: 148, baseType: !977, size: 32, align: 32, offset: 352)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "neutra_chroma_indication_flag", scope: !1069, file: !981, line: 149, baseType: !977, size: 32, align: 32, offset: 384)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "field_seq_flag", scope: !1069, file: !981, line: 151, baseType: !977, size: 32, align: 32, offset: 416)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "frame_field_info_present_flag", scope: !1069, file: !981, line: 152, baseType: !977, size: 32, align: 32, offset: 448)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "default_display_window_flag", scope: !1069, file: !981, line: 154, baseType: !977, size: 32, align: 32, offset: 480)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "def_disp_win", scope: !1069, file: !981, line: 155, baseType: !1044, size: 128, align: 32, offset: 512)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "vui_timing_info_present_flag", scope: !1069, file: !981, line: 157, baseType: !977, size: 32, align: 32, offset: 640)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "vui_num_units_in_tick", scope: !1069, file: !981, line: 158, baseType: !1026, size: 32, align: 32, offset: 672)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "vui_time_scale", scope: !1069, file: !981, line: 159, baseType: !1026, size: 32, align: 32, offset: 704)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "vui_poc_proportional_to_timing_flag", scope: !1069, file: !981, line: 160, baseType: !977, size: 32, align: 32, offset: 736)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "vui_num_ticks_poc_diff_one_minus1", scope: !1069, file: !981, line: 161, baseType: !977, size: 32, align: 32, offset: 768)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "vui_hrd_parameters_present_flag", scope: !1069, file: !981, line: 162, baseType: !977, size: 32, align: 32, offset: 800)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !1069, file: !981, line: 164, baseType: !977, size: 32, align: 32, offset: 832)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "tiles_fixed_structure_flag", scope: !1069, file: !981, line: 165, baseType: !977, size: 32, align: 32, offset: 864)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !1069, file: !981, line: 166, baseType: !977, size: 32, align: 32, offset: 896)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "restricted_ref_pic_lists_flag", scope: !1069, file: !981, line: 167, baseType: !977, size: 32, align: 32, offset: 928)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "min_spatial_segmentation_idc", scope: !1069, file: !981, line: 168, baseType: !977, size: 32, align: 32, offset: 960)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !1069, file: !981, line: 169, baseType: !977, size: 32, align: 32, offset: 992)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_min_cu_denom", scope: !1069, file: !981, line: 170, baseType: !977, size: 32, align: 32, offset: 1024)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !1069, file: !981, line: 171, baseType: !977, size: 32, align: 32, offset: 1056)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !1069, file: !981, line: 172, baseType: !977, size: 32, align: 32, offset: 1088)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "ptl", scope: !1038, file: !981, line: 251, baseType: !991, size: 2672, align: 8, offset: 2400)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list_enable_flag", scope: !1038, file: !981, line: 253, baseType: !985, size: 8, align: 8, offset: 5072)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !1038, file: !981, line: 254, baseType: !1113, size: 12384, align: 8, offset: 5080)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScalingList", file: !981, line: 223, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScalingList", file: !981, line: 218, size: 12384, align: 8, elements: !1115)
!1115 = !{!1116, !1122}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "sl", scope: !1114, file: !981, line: 221, baseType: !1117, size: 12288, align: 8)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 12288, align: 8, elements: !1118)
!1118 = !{!1119, !1120, !1121}
!1119 = !DISubrange(count: 4)
!1120 = !DISubrange(count: 6)
!1121 = !DISubrange(count: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "sl_dc", scope: !1114, file: !981, line: 222, baseType: !1123, size: 96, align: 8, offset: 12288)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 96, align: 8, elements: !1124)
!1124 = !{!1125, !1120}
!1125 = !DISubrange(count: 2)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "nb_st_rps", scope: !1038, file: !981, line: 256, baseType: !978, size: 32, align: 32, offset: 17472)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "st_rps", scope: !1038, file: !981, line: 257, baseType: !1128, size: 88064, align: 32, offset: 17504)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1129, size: 88064, align: 32, elements: !1139)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ShortTermRPS", file: !981, line: 40, baseType: !1130)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ShortTermRPS", file: !981, line: 34, size: 1376, align: 32, elements: !1131)
!1131 = !{!1132, !1133, !1134, !1135, !1138}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "num_negative_pics", scope: !1130, file: !981, line: 35, baseType: !978, size: 32, align: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "num_delta_pocs", scope: !1130, file: !981, line: 36, baseType: !977, size: 32, align: 32, offset: 32)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "rps_idx_num_delta_pocs", scope: !1130, file: !981, line: 37, baseType: !977, size: 32, align: 32, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "delta_poc", scope: !1130, file: !981, line: 38, baseType: !1136, size: 1024, align: 32, offset: 96)
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1137, size: 1024, align: 32, elements: !1003)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !986, line: 38, baseType: !977)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1130, file: !981, line: 39, baseType: !1002, size: 256, align: 8, offset: 1120)
!1139 = !{!1121}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "amp_enabled_flag", scope: !1038, file: !981, line: 259, baseType: !985, size: 8, align: 8, offset: 105568)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "sao_enabled", scope: !1038, file: !981, line: 260, baseType: !985, size: 8, align: 8, offset: 105576)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_ref_pics_present_flag", scope: !1038, file: !981, line: 262, baseType: !985, size: 8, align: 8, offset: 105584)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "lt_ref_pic_poc_lsb_sps", scope: !1038, file: !981, line: 263, baseType: !1144, size: 512, align: 16, offset: 105600)
!1144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1145, size: 512, align: 16, elements: !1003)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !986, line: 49, baseType: !1146)
!1146 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "used_by_curr_pic_lt_sps_flag", scope: !1038, file: !981, line: 264, baseType: !1002, size: 256, align: 8, offset: 106112)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "num_long_term_ref_pics_sps", scope: !1038, file: !981, line: 265, baseType: !985, size: 8, align: 8, offset: 106368)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "pcm", scope: !1038, file: !981, line: 273, baseType: !1150, size: 128, align: 32, offset: 106400)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1038, file: !981, line: 267, size: 128, align: 32, elements: !1151)
!1151 = !{!1152, !1153, !1154, !1155, !1156}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !1150, file: !981, line: 268, baseType: !985, size: 8, align: 8)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma", scope: !1150, file: !981, line: 269, baseType: !985, size: 8, align: 8, offset: 8)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_pcm_cb_size", scope: !1150, file: !981, line: 270, baseType: !978, size: 32, align: 32, offset: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pcm_cb_size", scope: !1150, file: !981, line: 271, baseType: !978, size: 32, align: 32, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_disable_flag", scope: !1150, file: !981, line: 272, baseType: !985, size: 8, align: 8, offset: 96)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "sps_temporal_mvp_enabled_flag", scope: !1038, file: !981, line: 274, baseType: !985, size: 8, align: 8, offset: 106528)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "sps_strong_intra_smoothing_enable_flag", scope: !1038, file: !981, line: 275, baseType: !985, size: 8, align: 8, offset: 106536)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_cb_size", scope: !1038, file: !981, line: 277, baseType: !978, size: 32, align: 32, offset: 106560)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "log2_diff_max_min_coding_block_size", scope: !1038, file: !981, line: 278, baseType: !978, size: 32, align: 32, offset: 106592)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_tb_size", scope: !1038, file: !981, line: 279, baseType: !978, size: 32, align: 32, offset: 106624)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_trafo_size", scope: !1038, file: !981, line: 280, baseType: !978, size: 32, align: 32, offset: 106656)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "log2_ctb_size", scope: !1038, file: !981, line: 281, baseType: !978, size: 32, align: 32, offset: 106688)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_pu_size", scope: !1038, file: !981, line: 282, baseType: !978, size: 32, align: 32, offset: 106720)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "max_transform_hierarchy_depth_inter", scope: !1038, file: !981, line: 284, baseType: !977, size: 32, align: 32, offset: 106752)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "max_transform_hierarchy_depth_intra", scope: !1038, file: !981, line: 285, baseType: !977, size: 32, align: 32, offset: 106784)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "sps_range_extension_flag", scope: !1038, file: !981, line: 287, baseType: !977, size: 32, align: 32, offset: 106816)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "transform_skip_rotation_enabled_flag", scope: !1038, file: !981, line: 288, baseType: !977, size: 32, align: 32, offset: 106848)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "transform_skip_context_enabled_flag", scope: !1038, file: !981, line: 289, baseType: !977, size: 32, align: 32, offset: 106880)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_rdpcm_enabled_flag", scope: !1038, file: !981, line: 290, baseType: !977, size: 32, align: 32, offset: 106912)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_rdpcm_enabled_flag", scope: !1038, file: !981, line: 291, baseType: !977, size: 32, align: 32, offset: 106944)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "extended_precision_processing_flag", scope: !1038, file: !981, line: 292, baseType: !977, size: 32, align: 32, offset: 106976)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "intra_smoothing_disabled_flag", scope: !1038, file: !981, line: 293, baseType: !977, size: 32, align: 32, offset: 107008)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "high_precision_offsets_enabled_flag", scope: !1038, file: !981, line: 294, baseType: !977, size: 32, align: 32, offset: 107040)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "persistent_rice_adaptation_enabled_flag", scope: !1038, file: !981, line: 295, baseType: !977, size: 32, align: 32, offset: 107072)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "cabac_bypass_alignment_enabled_flag", scope: !1038, file: !981, line: 296, baseType: !977, size: 32, align: 32, offset: 107104)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1038, file: !981, line: 299, baseType: !977, size: 32, align: 32, offset: 107136)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1038, file: !981, line: 300, baseType: !977, size: 32, align: 32, offset: 107168)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_width", scope: !1038, file: !981, line: 301, baseType: !977, size: 32, align: 32, offset: 107200)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_height", scope: !1038, file: !981, line: 302, baseType: !977, size: 32, align: 32, offset: 107232)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_size", scope: !1038, file: !981, line: 303, baseType: !977, size: 32, align: 32, offset: 107264)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "min_cb_width", scope: !1038, file: !981, line: 304, baseType: !977, size: 32, align: 32, offset: 107296)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "min_cb_height", scope: !1038, file: !981, line: 305, baseType: !977, size: 32, align: 32, offset: 107328)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "min_tb_width", scope: !1038, file: !981, line: 306, baseType: !977, size: 32, align: 32, offset: 107360)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "min_tb_height", scope: !1038, file: !981, line: 307, baseType: !977, size: 32, align: 32, offset: 107392)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "min_pu_width", scope: !1038, file: !981, line: 308, baseType: !977, size: 32, align: 32, offset: 107424)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "min_pu_height", scope: !1038, file: !981, line: 309, baseType: !977, size: 32, align: 32, offset: 107456)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "tb_mask", scope: !1038, file: !981, line: 310, baseType: !977, size: 32, align: 32, offset: 107488)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "hshift", scope: !1038, file: !981, line: 312, baseType: !1190, size: 96, align: 32, offset: 107520)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 96, align: 32, elements: !1191)
!1191 = !{!1192}
!1192 = !DISubrange(count: 3)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "vshift", scope: !1038, file: !981, line: 313, baseType: !1190, size: 96, align: 32, offset: 107616)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "qp_bd_offset", scope: !1038, file: !981, line: 315, baseType: !977, size: 32, align: 32, offset: 107712)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1038, file: !981, line: 317, baseType: !1032, size: 32768, align: 8, offset: 107744)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1038, file: !981, line: 318, baseType: !977, size: 32, align: 32, offset: 140512)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1202, line: 221, size: 32, align: 8, elements: !1203)
!1202 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1203 = !{!1204}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1201, file: !1202, line: 221, baseType: !1026, size: 32, align: 32)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCPPS", file: !981, line: 397, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCPPS", file: !981, line: 321, size: 46784, align: 64, elements: !1212)
!1212 = !{!1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1260, !1261, !1262, !1263, !1265, !1266, !1267, !1268, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "sps_id", scope: !1211, file: !981, line: 322, baseType: !978, size: 32, align: 32)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "sign_data_hiding_flag", scope: !1211, file: !981, line: 324, baseType: !985, size: 8, align: 8, offset: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "cabac_init_present_flag", scope: !1211, file: !981, line: 326, baseType: !985, size: 8, align: 8, offset: 40)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_default_active", scope: !1211, file: !981, line: 328, baseType: !977, size: 32, align: 32, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_default_active", scope: !1211, file: !981, line: 329, baseType: !977, size: 32, align: 32, offset: 96)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !1211, file: !981, line: 330, baseType: !977, size: 32, align: 32, offset: 128)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !1211, file: !981, line: 332, baseType: !985, size: 8, align: 8, offset: 160)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "transform_skip_enabled_flag", scope: !1211, file: !981, line: 333, baseType: !985, size: 8, align: 8, offset: 168)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "cu_qp_delta_enabled_flag", scope: !1211, file: !981, line: 335, baseType: !985, size: 8, align: 8, offset: 176)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "diff_cu_qp_delta_depth", scope: !1211, file: !981, line: 336, baseType: !977, size: 32, align: 32, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_offset", scope: !1211, file: !981, line: 338, baseType: !977, size: 32, align: 32, offset: 224)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_offset", scope: !1211, file: !981, line: 339, baseType: !977, size: 32, align: 32, offset: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "pic_slice_level_chroma_qp_offsets_present_flag", scope: !1211, file: !981, line: 340, baseType: !985, size: 8, align: 8, offset: 288)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !1211, file: !981, line: 341, baseType: !985, size: 8, align: 8, offset: 296)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_flag", scope: !1211, file: !981, line: 342, baseType: !985, size: 8, align: 8, offset: 304)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "output_flag_present_flag", scope: !1211, file: !981, line: 343, baseType: !985, size: 8, align: 8, offset: 312)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "transquant_bypass_enable_flag", scope: !1211, file: !981, line: 344, baseType: !985, size: 8, align: 8, offset: 320)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "dependent_slice_segments_enabled_flag", scope: !1211, file: !981, line: 346, baseType: !985, size: 8, align: 8, offset: 328)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "tiles_enabled_flag", scope: !1211, file: !981, line: 347, baseType: !985, size: 8, align: 8, offset: 336)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_sync_enabled_flag", scope: !1211, file: !981, line: 348, baseType: !985, size: 8, align: 8, offset: 344)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "num_tile_columns", scope: !1211, file: !981, line: 350, baseType: !977, size: 32, align: 32, offset: 352)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "num_tile_rows", scope: !1211, file: !981, line: 351, baseType: !977, size: 32, align: 32, offset: 384)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "uniform_spacing_flag", scope: !1211, file: !981, line: 352, baseType: !985, size: 8, align: 8, offset: 416)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_across_tiles_enabled_flag", scope: !1211, file: !981, line: 353, baseType: !985, size: 8, align: 8, offset: 424)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "seq_loop_filter_across_slices_enabled_flag", scope: !1211, file: !981, line: 355, baseType: !985, size: 8, align: 8, offset: 432)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !1211, file: !981, line: 357, baseType: !985, size: 8, align: 8, offset: 440)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_override_enabled_flag", scope: !1211, file: !981, line: 358, baseType: !985, size: 8, align: 8, offset: 448)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "disable_dbf", scope: !1211, file: !981, line: 359, baseType: !985, size: 8, align: 8, offset: 456)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "beta_offset", scope: !1211, file: !981, line: 360, baseType: !977, size: 32, align: 32, offset: 480)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "tc_offset", scope: !1211, file: !981, line: 361, baseType: !977, size: 32, align: 32, offset: 512)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list_data_present_flag", scope: !1211, file: !981, line: 363, baseType: !985, size: 8, align: 8, offset: 544)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !1211, file: !981, line: 364, baseType: !1113, size: 12384, align: 8, offset: 552)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "lists_modification_present_flag", scope: !1211, file: !981, line: 366, baseType: !985, size: 8, align: 8, offset: 12936)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "log2_parallel_merge_level", scope: !1211, file: !981, line: 367, baseType: !977, size: 32, align: 32, offset: 12960)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "num_extra_slice_header_bits", scope: !1211, file: !981, line: 368, baseType: !977, size: 32, align: 32, offset: 12992)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "slice_header_extension_present_flag", scope: !1211, file: !981, line: 369, baseType: !985, size: 8, align: 8, offset: 13024)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_transform_skip_block_size", scope: !1211, file: !981, line: 370, baseType: !985, size: 8, align: 8, offset: 13032)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "pps_range_extensions_flag", scope: !1211, file: !981, line: 371, baseType: !985, size: 8, align: 8, offset: 13040)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "cross_component_prediction_enabled_flag", scope: !1211, file: !981, line: 372, baseType: !985, size: 8, align: 8, offset: 13048)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset_list_enabled_flag", scope: !1211, file: !981, line: 373, baseType: !985, size: 8, align: 8, offset: 13056)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "diff_cu_chroma_qp_offset_depth", scope: !1211, file: !981, line: 374, baseType: !985, size: 8, align: 8, offset: 13064)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset_list_len_minus1", scope: !1211, file: !981, line: 375, baseType: !985, size: 8, align: 8, offset: 13072)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_offset_list", scope: !1211, file: !981, line: 376, baseType: !1256, size: 48, align: 8, offset: 13080)
!1256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1257, size: 48, align: 8, elements: !1259)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !986, line: 36, baseType: !1258)
!1258 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1259 = !{!1120}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_offset_list", scope: !1211, file: !981, line: 377, baseType: !1256, size: 48, align: 8, offset: 13128)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "log2_sao_offset_scale_luma", scope: !1211, file: !981, line: 378, baseType: !985, size: 8, align: 8, offset: 13176)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "log2_sao_offset_scale_chroma", scope: !1211, file: !981, line: 379, baseType: !985, size: 8, align: 8, offset: 13184)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "column_width", scope: !1211, file: !981, line: 382, baseType: !1264, size: 64, align: 64, offset: 13248)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "row_height", scope: !1211, file: !981, line: 383, baseType: !1264, size: 64, align: 64, offset: 13312)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "col_bd", scope: !1211, file: !981, line: 384, baseType: !1264, size: 64, align: 64, offset: 13376)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "row_bd", scope: !1211, file: !981, line: 385, baseType: !1264, size: 64, align: 64, offset: 13440)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "col_idxX", scope: !1211, file: !981, line: 386, baseType: !1269, size: 64, align: 64, offset: 13504)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_addr_rs_to_ts", scope: !1211, file: !981, line: 388, baseType: !1269, size: 64, align: 64, offset: 13568)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_addr_ts_to_rs", scope: !1211, file: !981, line: 389, baseType: !1269, size: 64, align: 64, offset: 13632)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "tile_id", scope: !1211, file: !981, line: 390, baseType: !1269, size: 64, align: 64, offset: 13696)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "tile_pos_rs", scope: !1211, file: !981, line: 391, baseType: !1269, size: 64, align: 64, offset: 13760)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "min_tb_addr_zs", scope: !1211, file: !981, line: 392, baseType: !1269, size: 64, align: 64, offset: 13824)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "min_tb_addr_zs_tab", scope: !1211, file: !981, line: 393, baseType: !1269, size: 64, align: 64, offset: 13888)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1211, file: !981, line: 395, baseType: !1032, size: 32768, align: 8, offset: 13952)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1211, file: !981, line: 396, baseType: !977, size: 32, align: 32, offset: 46720)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1210)
!1280 = !{!1281, !1286, !1287, !1289, !1290}
!1281 = distinct !DIGlobalVariable(name: "hevc_sub_height_c", scope: !0, file: !1282, line: 77, type: !1283, isLocal: true, isDefinition: true, variable: [4 x i8]* @hevc_sub_height_c)
!1282 = !DIFile(filename: "libavcodec/hevc_ps.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1284, size: 32, align: 8, elements: !1285)
!1284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!1285 = !{!1119}
!1286 = distinct !DIGlobalVariable(name: "hevc_sub_width_c", scope: !0, file: !1282, line: 73, type: !1283, isLocal: true, isDefinition: true, variable: [4 x i8]* @hevc_sub_width_c)
!1287 = distinct !DIGlobalVariable(name: "default_scaling_list_intra", scope: !0, file: !1282, line: 31, type: !1288, isLocal: true, isDefinition: true, variable: [64 x i8]* @default_scaling_list_intra)
!1288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1284, size: 512, align: 8, elements: !1139)
!1289 = distinct !DIGlobalVariable(name: "default_scaling_list_inter", scope: !0, file: !1282, line: 42, type: !1288, isLocal: true, isDefinition: true, variable: [64 x i8]* @default_scaling_list_inter)
!1290 = distinct !DIGlobalVariable(name: "vui_sar", scope: !0, file: !1282, line: 53, type: !1291, isLocal: true, isDefinition: true, variable: [17 x %struct.AVRational]* @vui_sar)
!1291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1292, size: 1088, align: 32, elements: !1293)
!1292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1072)
!1293 = !{!1294}
!1294 = !DISubrange(count: 17)
!1295 = !{i32 2, !"Dwarf Version", i32 4}
!1296 = !{i32 2, !"Debug Info Version", i32 3}
!1297 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1298 = distinct !DISubprogram(name: "ff_hevc_decode_short_term_rps", scope: !1282, file: !1282, line: 119, type: !1299, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1890)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!977, !1301, !1312, !1889, !1207, !977}
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1303, line: 70, baseType: !1304)
!1303 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1303, line: 61, size: 256, align: 64, elements: !1305)
!1305 = !{!1306, !1308, !1309, !1310, !1311}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1304, file: !1303, line: 62, baseType: !1307, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1304, file: !1303, line: 62, baseType: !1307, size: 64, align: 64, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1304, file: !1303, line: 67, baseType: !977, size: 32, align: 32, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1304, file: !1303, line: 68, baseType: !977, size: 32, align: 32, offset: 160)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1304, file: !1303, line: 69, baseType: !977, size: 32, align: 32, offset: 192)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1314)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1315)
!1315 = !{!1316, !1360, !1361, !1362, !1614, !1615, !1616, !1617, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1643, !1647, !1648, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1827, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1314, file: !35, line: 1561, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1319)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1320)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1321)
!1321 = !{!1322, !1326, !1330, !1334, !1335, !1336, !1337, !1341, !1347, !1349, !1353}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1320, file: !4, line: 72, baseType: !1323, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1325)
!1325 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1320, file: !4, line: 78, baseType: !1327, size: 64, align: 64, offset: 64)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!1323, !1198}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1320, file: !4, line: 85, baseType: !1331, size: 64, align: 64, offset: 128)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1333)
!1333 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1320, file: !4, line: 93, baseType: !977, size: 32, align: 32, offset: 192)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1320, file: !4, line: 99, baseType: !977, size: 32, align: 32, offset: 224)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1320, file: !4, line: 108, baseType: !977, size: 32, align: 32, offset: 256)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1320, file: !4, line: 113, baseType: !1338, size: 64, align: 64, offset: 320)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!1198, !1198, !1198}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1320, file: !4, line: 123, baseType: !1342, size: 64, align: 64, offset: 384)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!1345, !1345}
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1320)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1320, file: !4, line: 130, baseType: !1348, size: 32, align: 32, offset: 448)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1320, file: !4, line: 136, baseType: !1350, size: 64, align: 64, offset: 512)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DISubroutineType(types: !1352)
!1352 = !{!1348, !1198}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1320, file: !4, line: 142, baseType: !1354, size: 64, align: 64, offset: 576)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DISubroutineType(types: !1356)
!1356 = !{!977, !1357, !1198, !1323, !977}
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1314, file: !35, line: 1562, baseType: !977, size: 32, align: 32, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1314, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1314, file: !35, line: 1565, baseType: !1363, size: 64, align: 64, offset: 128)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1365)
!1365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1366)
!1366 = !{!1367, !1368, !1369, !1370, !1371, !1372, !1374, !1377, !1380, !1383, !1388, !1389, !1390, !1398, !1399, !1400, !1402, !1406, !1412, !1417, !1421, !1422, !1467, !1585, !1589, !1590, !1594, !1598, !1603, !1607, !1608, !1609}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1365, file: !35, line: 3475, baseType: !1323, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1365, file: !35, line: 3480, baseType: !1323, size: 64, align: 64, offset: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1365, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1365, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1365, file: !35, line: 3487, baseType: !977, size: 32, align: 32, offset: 192)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1365, file: !35, line: 3488, baseType: !1373, size: 64, align: 64, offset: 256)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1365, file: !35, line: 3489, baseType: !1375, size: 64, align: 64, offset: 320)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1365, file: !35, line: 3490, baseType: !1378, size: 64, align: 64, offset: 384)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1365, file: !35, line: 3491, baseType: !1381, size: 64, align: 64, offset: 448)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1365, file: !35, line: 3492, baseType: !1384, size: 64, align: 64, offset: 512)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1386)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !986, line: 55, baseType: !1387)
!1387 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1365, file: !35, line: 3493, baseType: !985, size: 8, align: 8, offset: 576)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1365, file: !35, line: 3494, baseType: !1317, size: 64, align: 64, offset: 640)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1365, file: !35, line: 3495, baseType: !1391, size: 64, align: 64, offset: 704)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1393)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1394)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1395)
!1395 = !{!1396, !1397}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1394, file: !35, line: 3402, baseType: !977, size: 32, align: 32)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1394, file: !35, line: 3403, baseType: !1323, size: 64, align: 64, offset: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1365, file: !35, line: 3507, baseType: !1323, size: 64, align: 64, offset: 768)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1365, file: !35, line: 3516, baseType: !977, size: 32, align: 32, offset: 832)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1365, file: !35, line: 3517, baseType: !1401, size: 64, align: 64, offset: 896)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1365, file: !35, line: 3527, baseType: !1403, size: 64, align: 64, offset: 960)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DISubroutineType(types: !1405)
!1405 = !{!977, !1312}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1365, file: !35, line: 3535, baseType: !1407, size: 64, align: 64, offset: 1024)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DISubroutineType(types: !1409)
!1409 = !{!977, !1312, !1410}
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1313)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1365, file: !35, line: 3541, baseType: !1413, size: 64, align: 64, offset: 1088)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1415)
!1415 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1416)
!1416 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1365, file: !35, line: 3549, baseType: !1418, size: 64, align: 64, offset: 1152)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{null, !1401}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1365, file: !35, line: 3551, baseType: !1403, size: 64, align: 64, offset: 1216)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1365, file: !35, line: 3552, baseType: !1423, size: 64, align: 64, offset: 1280)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{!977, !1312, !1197, !977, !1426}
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1428)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1429)
!1429 = !{!1430, !1431, !1432, !1433, !1434, !1464}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1428, file: !35, line: 3921, baseType: !1145, size: 16, align: 16)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1428, file: !35, line: 3922, baseType: !1026, size: 32, align: 32, offset: 32)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1428, file: !35, line: 3923, baseType: !1026, size: 32, align: 32, offset: 64)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1428, file: !35, line: 3924, baseType: !978, size: 32, align: 32, offset: 96)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1428, file: !35, line: 3925, baseType: !1435, size: 64, align: 64, offset: 128)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1438)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1439)
!1439 = !{!1440, !1441, !1442, !1443, !1444, !1445, !1455, !1457, !1459, !1460, !1462, !1463}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1438, file: !35, line: 3886, baseType: !977, size: 32, align: 32)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1438, file: !35, line: 3887, baseType: !977, size: 32, align: 32, offset: 32)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1438, file: !35, line: 3888, baseType: !977, size: 32, align: 32, offset: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1438, file: !35, line: 3889, baseType: !977, size: 32, align: 32, offset: 96)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1438, file: !35, line: 3890, baseType: !977, size: 32, align: 32, offset: 128)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1438, file: !35, line: 3897, baseType: !1446, size: 768, align: 64, offset: 192)
!1446 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1447)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1448)
!1448 = !{!1449, !1453}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1447, file: !35, line: 3855, baseType: !1450, size: 512, align: 64)
!1450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1197, size: 512, align: 64, elements: !1451)
!1451 = !{!1452}
!1452 = !DISubrange(count: 8)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1447, file: !35, line: 3857, baseType: !1454, size: 256, align: 32, offset: 512)
!1454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 256, align: 32, elements: !1451)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1438, file: !35, line: 3903, baseType: !1456, size: 256, align: 64, offset: 960)
!1456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1197, size: 256, align: 64, elements: !1285)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1438, file: !35, line: 3904, baseType: !1458, size: 128, align: 32, offset: 1216)
!1458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 128, align: 32, elements: !1285)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1438, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1438, file: !35, line: 3908, baseType: !1461, size: 64, align: 64, offset: 1408)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1438, file: !35, line: 3915, baseType: !1461, size: 64, align: 64, offset: 1472)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1438, file: !35, line: 3917, baseType: !977, size: 32, align: 32, offset: 1536)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1428, file: !35, line: 3926, baseType: !1465, size: 64, align: 64, offset: 192)
!1465 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !986, line: 40, baseType: !1466)
!1466 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1365, file: !35, line: 3564, baseType: !1468, size: 64, align: 64, offset: 1344)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!977, !1312, !1471, !1505, !1269}
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1473)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1474)
!1474 = !{!1475, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1501, !1502, !1503, !1504}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1473, file: !35, line: 1451, baseType: !1476, size: 64, align: 64)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1478, line: 94, baseType: !1479)
!1478 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1478, line: 81, size: 192, align: 64, elements: !1480)
!1480 = !{!1481, !1485, !1486}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1479, file: !1478, line: 82, baseType: !1482, size: 64, align: 64)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1478, line: 73, baseType: !1484)
!1484 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1478, line: 73, flags: DIFlagFwdDecl)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1479, file: !1478, line: 89, baseType: !1197, size: 64, align: 64, offset: 64)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1479, file: !1478, line: 93, baseType: !977, size: 32, align: 32, offset: 128)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1473, file: !35, line: 1461, baseType: !1465, size: 64, align: 64, offset: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1473, file: !35, line: 1467, baseType: !1465, size: 64, align: 64, offset: 128)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1473, file: !35, line: 1468, baseType: !1197, size: 64, align: 64, offset: 192)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1473, file: !35, line: 1469, baseType: !977, size: 32, align: 32, offset: 256)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1473, file: !35, line: 1470, baseType: !977, size: 32, align: 32, offset: 288)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1473, file: !35, line: 1474, baseType: !977, size: 32, align: 32, offset: 320)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1473, file: !35, line: 1479, baseType: !1494, size: 64, align: 64, offset: 384)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1496)
!1496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1497)
!1497 = !{!1498, !1499, !1500}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1496, file: !35, line: 1412, baseType: !1197, size: 64, align: 64)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1496, file: !35, line: 1413, baseType: !977, size: 32, align: 32, offset: 64)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1496, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1473, file: !35, line: 1480, baseType: !977, size: 32, align: 32, offset: 448)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1473, file: !35, line: 1486, baseType: !1465, size: 64, align: 64, offset: 512)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1473, file: !35, line: 1488, baseType: !1465, size: 64, align: 64, offset: 576)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1473, file: !35, line: 1497, baseType: !1465, size: 64, align: 64, offset: 640)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1507)
!1507 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1508)
!1508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1509)
!1509 = !{!1510, !1511, !1512, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1539, !1541, !1542, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1573, !1574, !1575, !1576, !1577, !1578, !1581, !1582, !1583, !1584}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1508, file: !758, line: 282, baseType: !1450, size: 512, align: 64)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1508, file: !758, line: 299, baseType: !1454, size: 256, align: 32, offset: 512)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1508, file: !758, line: 315, baseType: !1513, size: 64, align: 64, offset: 768)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1508, file: !758, line: 326, baseType: !977, size: 32, align: 32, offset: 832)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1508, file: !758, line: 326, baseType: !977, size: 32, align: 32, offset: 864)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1508, file: !758, line: 334, baseType: !977, size: 32, align: 32, offset: 896)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1508, file: !758, line: 341, baseType: !977, size: 32, align: 32, offset: 928)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1508, file: !758, line: 346, baseType: !977, size: 32, align: 32, offset: 960)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1508, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1508, file: !758, line: 356, baseType: !1072, size: 64, align: 32, offset: 1024)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1508, file: !758, line: 361, baseType: !1465, size: 64, align: 64, offset: 1088)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1508, file: !758, line: 369, baseType: !1465, size: 64, align: 64, offset: 1152)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1508, file: !758, line: 377, baseType: !1465, size: 64, align: 64, offset: 1216)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1508, file: !758, line: 382, baseType: !977, size: 32, align: 32, offset: 1280)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1508, file: !758, line: 386, baseType: !977, size: 32, align: 32, offset: 1312)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1508, file: !758, line: 391, baseType: !977, size: 32, align: 32, offset: 1344)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1508, file: !758, line: 396, baseType: !1198, size: 64, align: 64, offset: 1408)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1508, file: !758, line: 403, baseType: !1529, size: 512, align: 64, offset: 1472)
!1529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1386, size: 512, align: 64, elements: !1451)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1508, file: !758, line: 410, baseType: !977, size: 32, align: 32, offset: 1984)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1508, file: !758, line: 415, baseType: !977, size: 32, align: 32, offset: 2016)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1508, file: !758, line: 420, baseType: !977, size: 32, align: 32, offset: 2048)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1508, file: !758, line: 425, baseType: !977, size: 32, align: 32, offset: 2080)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1508, file: !758, line: 435, baseType: !1465, size: 64, align: 64, offset: 2112)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1508, file: !758, line: 440, baseType: !977, size: 32, align: 32, offset: 2176)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1508, file: !758, line: 445, baseType: !1386, size: 64, align: 64, offset: 2240)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1508, file: !758, line: 459, baseType: !1538, size: 512, align: 64, offset: 2304)
!1538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1476, size: 512, align: 64, elements: !1451)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1508, file: !758, line: 473, baseType: !1540, size: 64, align: 64, offset: 2816)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1508, file: !758, line: 477, baseType: !977, size: 32, align: 32, offset: 2880)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1508, file: !758, line: 479, baseType: !1543, size: 64, align: 64, offset: 2944)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1546)
!1546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1547)
!1547 = !{!1548, !1549, !1550, !1551, !1556}
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1546, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1546, file: !758, line: 203, baseType: !1197, size: 64, align: 64, offset: 64)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1546, file: !758, line: 204, baseType: !977, size: 32, align: 32, offset: 128)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1546, file: !758, line: 205, baseType: !1552, size: 64, align: 64, offset: 192)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1554, line: 86, baseType: !1555)
!1554 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1555 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1554, line: 86, flags: DIFlagFwdDecl)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1546, file: !758, line: 206, baseType: !1476, size: 64, align: 64, offset: 256)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1508, file: !758, line: 480, baseType: !977, size: 32, align: 32, offset: 3008)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1508, file: !758, line: 505, baseType: !977, size: 32, align: 32, offset: 3040)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1508, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1508, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1508, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1508, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1508, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1508, file: !758, line: 532, baseType: !1465, size: 64, align: 64, offset: 3264)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1508, file: !758, line: 539, baseType: !1465, size: 64, align: 64, offset: 3328)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1508, file: !758, line: 547, baseType: !1465, size: 64, align: 64, offset: 3392)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1508, file: !758, line: 554, baseType: !1552, size: 64, align: 64, offset: 3456)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1508, file: !758, line: 563, baseType: !977, size: 32, align: 32, offset: 3520)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1508, file: !758, line: 572, baseType: !977, size: 32, align: 32, offset: 3552)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1508, file: !758, line: 581, baseType: !977, size: 32, align: 32, offset: 3584)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1508, file: !758, line: 588, baseType: !1572, size: 64, align: 64, offset: 3648)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1508, file: !758, line: 593, baseType: !977, size: 32, align: 32, offset: 3712)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1508, file: !758, line: 596, baseType: !977, size: 32, align: 32, offset: 3744)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1508, file: !758, line: 599, baseType: !1476, size: 64, align: 64, offset: 3776)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1508, file: !758, line: 605, baseType: !1476, size: 64, align: 64, offset: 3840)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1508, file: !758, line: 616, baseType: !1476, size: 64, align: 64, offset: 3904)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1508, file: !758, line: 626, baseType: !1579, size: 64, align: 64, offset: 3968)
!1579 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1580, line: 216, baseType: !1387)
!1580 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1508, file: !758, line: 627, baseType: !1579, size: 64, align: 64, offset: 4032)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1508, file: !758, line: 628, baseType: !1579, size: 64, align: 64, offset: 4096)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1508, file: !758, line: 629, baseType: !1579, size: 64, align: 64, offset: 4160)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1508, file: !758, line: 645, baseType: !1476, size: 64, align: 64, offset: 4224)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1365, file: !35, line: 3566, baseType: !1586, size: 64, align: 64, offset: 1408)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DISubroutineType(types: !1588)
!1588 = !{!977, !1312, !1198, !1269, !1471}
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1365, file: !35, line: 3567, baseType: !1403, size: 64, align: 64, offset: 1472)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1365, file: !35, line: 3576, baseType: !1591, size: 64, align: 64, offset: 1536)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1592 = !DISubroutineType(types: !1593)
!1593 = !{!977, !1312, !1505}
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1365, file: !35, line: 3577, baseType: !1595, size: 64, align: 64, offset: 1600)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64, align: 64)
!1596 = !DISubroutineType(types: !1597)
!1597 = !{!977, !1312, !1471}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1365, file: !35, line: 3584, baseType: !1599, size: 64, align: 64, offset: 1664)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DISubroutineType(types: !1601)
!1601 = !{!977, !1312, !1602}
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1365, file: !35, line: 3589, baseType: !1604, size: 64, align: 64, offset: 1728)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DISubroutineType(types: !1606)
!1606 = !{null, !1312}
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1365, file: !35, line: 3594, baseType: !977, size: 32, align: 32, offset: 1792)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1365, file: !35, line: 3600, baseType: !1323, size: 64, align: 64, offset: 1856)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1365, file: !35, line: 3609, baseType: !1610, size: 64, align: 64, offset: 1920)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1613)
!1613 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1314, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1314, file: !35, line: 1581, baseType: !978, size: 32, align: 32, offset: 224)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1314, file: !35, line: 1583, baseType: !1198, size: 64, align: 64, offset: 256)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1314, file: !35, line: 1591, baseType: !1618, size: 64, align: 64, offset: 320)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1314, file: !35, line: 1598, baseType: !1198, size: 64, align: 64, offset: 384)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1314, file: !35, line: 1606, baseType: !1465, size: 64, align: 64, offset: 448)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1314, file: !35, line: 1614, baseType: !977, size: 32, align: 32, offset: 512)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1314, file: !35, line: 1622, baseType: !977, size: 32, align: 32, offset: 544)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1314, file: !35, line: 1628, baseType: !977, size: 32, align: 32, offset: 576)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1314, file: !35, line: 1636, baseType: !977, size: 32, align: 32, offset: 608)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1314, file: !35, line: 1643, baseType: !977, size: 32, align: 32, offset: 640)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1314, file: !35, line: 1657, baseType: !1197, size: 64, align: 64, offset: 704)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1314, file: !35, line: 1658, baseType: !977, size: 32, align: 32, offset: 768)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1314, file: !35, line: 1679, baseType: !1072, size: 64, align: 32, offset: 800)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1314, file: !35, line: 1688, baseType: !977, size: 32, align: 32, offset: 864)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1314, file: !35, line: 1712, baseType: !977, size: 32, align: 32, offset: 896)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1314, file: !35, line: 1729, baseType: !977, size: 32, align: 32, offset: 928)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1314, file: !35, line: 1729, baseType: !977, size: 32, align: 32, offset: 960)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1314, file: !35, line: 1744, baseType: !977, size: 32, align: 32, offset: 992)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1314, file: !35, line: 1744, baseType: !977, size: 32, align: 32, offset: 1024)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1314, file: !35, line: 1751, baseType: !977, size: 32, align: 32, offset: 1056)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1314, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1314, file: !35, line: 1791, baseType: !1639, size: 64, align: 64, offset: 1152)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{null, !1642, !1505, !1269, !977, !977, !977}
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1314, file: !35, line: 1808, baseType: !1644, size: 64, align: 64, offset: 1216)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DISubroutineType(types: !1646)
!1646 = !{!494, !1642, !1375}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1314, file: !35, line: 1816, baseType: !977, size: 32, align: 32, offset: 1280)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1314, file: !35, line: 1825, baseType: !1649, size: 32, align: 32, offset: 1312)
!1649 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1314, file: !35, line: 1830, baseType: !977, size: 32, align: 32, offset: 1344)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1314, file: !35, line: 1838, baseType: !1649, size: 32, align: 32, offset: 1376)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1314, file: !35, line: 1846, baseType: !977, size: 32, align: 32, offset: 1408)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1314, file: !35, line: 1851, baseType: !977, size: 32, align: 32, offset: 1440)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1314, file: !35, line: 1861, baseType: !1649, size: 32, align: 32, offset: 1472)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1314, file: !35, line: 1868, baseType: !1649, size: 32, align: 32, offset: 1504)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1314, file: !35, line: 1875, baseType: !1649, size: 32, align: 32, offset: 1536)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1314, file: !35, line: 1882, baseType: !1649, size: 32, align: 32, offset: 1568)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1314, file: !35, line: 1889, baseType: !1649, size: 32, align: 32, offset: 1600)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1314, file: !35, line: 1896, baseType: !1649, size: 32, align: 32, offset: 1632)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1314, file: !35, line: 1903, baseType: !1649, size: 32, align: 32, offset: 1664)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1314, file: !35, line: 1910, baseType: !977, size: 32, align: 32, offset: 1696)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1314, file: !35, line: 1915, baseType: !977, size: 32, align: 32, offset: 1728)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1314, file: !35, line: 1926, baseType: !1269, size: 64, align: 64, offset: 1792)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1314, file: !35, line: 1935, baseType: !1072, size: 64, align: 32, offset: 1856)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1314, file: !35, line: 1942, baseType: !977, size: 32, align: 32, offset: 1920)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1314, file: !35, line: 1948, baseType: !977, size: 32, align: 32, offset: 1952)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1314, file: !35, line: 1954, baseType: !977, size: 32, align: 32, offset: 1984)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1314, file: !35, line: 1960, baseType: !977, size: 32, align: 32, offset: 2016)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1314, file: !35, line: 1984, baseType: !977, size: 32, align: 32, offset: 2048)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1314, file: !35, line: 1991, baseType: !977, size: 32, align: 32, offset: 2080)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1314, file: !35, line: 1996, baseType: !977, size: 32, align: 32, offset: 2112)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1314, file: !35, line: 2004, baseType: !977, size: 32, align: 32, offset: 2144)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1314, file: !35, line: 2011, baseType: !977, size: 32, align: 32, offset: 2176)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1314, file: !35, line: 2018, baseType: !977, size: 32, align: 32, offset: 2208)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1314, file: !35, line: 2027, baseType: !977, size: 32, align: 32, offset: 2240)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1314, file: !35, line: 2034, baseType: !977, size: 32, align: 32, offset: 2272)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1314, file: !35, line: 2044, baseType: !977, size: 32, align: 32, offset: 2304)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1314, file: !35, line: 2054, baseType: !1679, size: 64, align: 64, offset: 2368)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1314, file: !35, line: 2061, baseType: !1679, size: 64, align: 64, offset: 2432)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1314, file: !35, line: 2066, baseType: !977, size: 32, align: 32, offset: 2496)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1314, file: !35, line: 2070, baseType: !977, size: 32, align: 32, offset: 2528)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1314, file: !35, line: 2078, baseType: !977, size: 32, align: 32, offset: 2560)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1314, file: !35, line: 2085, baseType: !977, size: 32, align: 32, offset: 2592)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1314, file: !35, line: 2092, baseType: !977, size: 32, align: 32, offset: 2624)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1314, file: !35, line: 2099, baseType: !977, size: 32, align: 32, offset: 2656)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1314, file: !35, line: 2106, baseType: !977, size: 32, align: 32, offset: 2688)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1314, file: !35, line: 2113, baseType: !977, size: 32, align: 32, offset: 2720)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1314, file: !35, line: 2120, baseType: !977, size: 32, align: 32, offset: 2752)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1314, file: !35, line: 2125, baseType: !977, size: 32, align: 32, offset: 2784)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1314, file: !35, line: 2133, baseType: !977, size: 32, align: 32, offset: 2816)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1314, file: !35, line: 2140, baseType: !977, size: 32, align: 32, offset: 2848)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1314, file: !35, line: 2145, baseType: !977, size: 32, align: 32, offset: 2880)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1314, file: !35, line: 2153, baseType: !977, size: 32, align: 32, offset: 2912)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1314, file: !35, line: 2158, baseType: !977, size: 32, align: 32, offset: 2944)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1314, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1314, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1314, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1314, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1314, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1314, file: !35, line: 2203, baseType: !977, size: 32, align: 32, offset: 3136)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1314, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1314, file: !35, line: 2212, baseType: !977, size: 32, align: 32, offset: 3200)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1314, file: !35, line: 2213, baseType: !977, size: 32, align: 32, offset: 3232)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1314, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
