; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--vc1dec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--vc1dec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type opaque

!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !47, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !47, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !47, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !47, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Profile", file: !939, line: 48, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "./libavcodec/vc1_common.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!940 = !{!941, !942, !943, !944}
!941 = !DIEnumerator(name: "PROFILE_SIMPLE", value: 0)
!942 = !DIEnumerator(name: "PROFILE_MAIN", value: 1)
!943 = !DIEnumerator(name: "PROFILE_COMPLEX", value: 2)
!944 = !DIEnumerator(name: "PROFILE_ADVANCED", value: 3)
!945 = !{!946}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !949, line: 221, size: 32, align: 8, elements: !950)
!949 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!950 = !{!951}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !948, file: !949, line: 221, baseType: !952, size: 32, align: 32)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !953, line: 51, baseType: !954)
!953 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!954 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!955 = !{!956, !2215}
!956 = distinct !DIGlobalVariable(name: "ff_vc1_demuxer", scope: !0, file: !957, line: 81, type: !958, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_vc1_demuxer)
!957 = !DIFile(filename: "libavformat/vc1dec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !960)
!960 = !{!961, !965, !966, !968, !969, !975, !1057, !1058, !1060, !1061, !1062, !1076, !2196, !2197, !2198, !2202, !2206, !2207, !2208, !2212, !2213, !2214}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !959, file: !919, line: 638, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !959, file: !919, line: 645, baseType: !962, size: 64, align: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !959, file: !919, line: 652, baseType: !967, size: 32, align: 32, offset: 128)
!967 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !959, file: !919, line: 659, baseType: !962, size: 64, align: 64, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !959, file: !919, line: 661, baseType: !970, size: 64, align: 64, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !919, line: 443, flags: DIFlagFwdDecl)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !959, file: !919, line: 663, baseType: !976, size: 64, align: 64, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !980)
!980 = !{!981, !982, !987, !1016, !1017, !1018, !1019, !1023, !1029, !1031, !1035}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !979, file: !26, line: 72, baseType: !962, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !979, file: !26, line: 78, baseType: !983, size: 64, align: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!962, !986}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !979, file: !26, line: 85, baseType: !988, size: 64, align: 64, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !991)
!991 = !{!992, !993, !994, !995, !996, !1012, !1013, !1014, !1015}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !990, file: !4, line: 247, baseType: !962, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !990, file: !4, line: 253, baseType: !962, size: 64, align: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !990, file: !4, line: 259, baseType: !967, size: 32, align: 32, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !990, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !990, file: !4, line: 271, baseType: !997, size: 64, align: 64, offset: 192)
!997 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !990, file: !4, line: 265, size: 64, align: 64, elements: !998)
!998 = !{!999, !1002, !1004, !1005}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !997, file: !4, line: 266, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !953, line: 40, baseType: !1001)
!1001 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !997, file: !4, line: 267, baseType: !1003, size: 64, align: 64)
!1003 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !997, file: !4, line: 268, baseType: !962, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !997, file: !4, line: 270, baseType: !1006, size: 64, align: 32)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1007, line: 61, baseType: !1008)
!1007 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1007, line: 58, size: 64, align: 32, elements: !1009)
!1009 = !{!1010, !1011}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1008, file: !1007, line: 59, baseType: !967, size: 32, align: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1008, file: !1007, line: 60, baseType: !967, size: 32, align: 32, offset: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !990, file: !4, line: 272, baseType: !1003, size: 64, align: 64, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !990, file: !4, line: 273, baseType: !1003, size: 64, align: 64, offset: 320)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !990, file: !4, line: 275, baseType: !967, size: 32, align: 32, offset: 384)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !990, file: !4, line: 300, baseType: !962, size: 64, align: 64, offset: 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !979, file: !26, line: 93, baseType: !967, size: 32, align: 32, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !979, file: !26, line: 99, baseType: !967, size: 32, align: 32, offset: 224)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !979, file: !26, line: 108, baseType: !967, size: 32, align: 32, offset: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !979, file: !26, line: 113, baseType: !1020, size: 64, align: 64, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!986, !986, !986}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !979, file: !26, line: 123, baseType: !1024, size: 64, align: 64, offset: 384)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!1027, !1027}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !979, file: !26, line: 130, baseType: !1030, size: 32, align: 32, offset: 448)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !979, file: !26, line: 136, baseType: !1032, size: 64, align: 64, offset: 512)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!1030, !986}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !979, file: !26, line: 142, baseType: !1036, size: 64, align: 64, offset: 576)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!967, !1039, !986, !962, !967}
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1042)
!1042 = !{!1043, !1055, !1056}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1041, file: !4, line: 360, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1047, file: !4, line: 307, baseType: !962, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1047, file: !4, line: 313, baseType: !1003, size: 64, align: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1047, file: !4, line: 313, baseType: !1003, size: 64, align: 64, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1047, file: !4, line: 318, baseType: !1003, size: 64, align: 64, offset: 192)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1047, file: !4, line: 318, baseType: !1003, size: 64, align: 64, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1047, file: !4, line: 323, baseType: !967, size: 32, align: 32, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1041, file: !4, line: 364, baseType: !967, size: 32, align: 32, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1041, file: !4, line: 368, baseType: !967, size: 32, align: 32, offset: 96)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !959, file: !919, line: 670, baseType: !962, size: 64, align: 64, offset: 384)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !959, file: !919, line: 679, baseType: !1059, size: 64, align: 64, offset: 448)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !959, file: !919, line: 684, baseType: !967, size: 32, align: 32, offset: 512)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !959, file: !919, line: 689, baseType: !967, size: 32, align: 32, offset: 544)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !959, file: !919, line: 696, baseType: !1063, size: 64, align: 64, offset: 576)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!967, !1066}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1069)
!1069 = !{!1070, !1071, !1074, !1075}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1068, file: !919, line: 449, baseType: !962, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1068, file: !919, line: 450, baseType: !1072, size: 64, align: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1068, file: !919, line: 451, baseType: !967, size: 32, align: 32, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1068, file: !919, line: 452, baseType: !962, size: 64, align: 64, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !959, file: !919, line: 703, baseType: !1077, size: 64, align: 64, offset: 640)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!967, !1080}
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1277, !1278, !1343, !1344, !1345, !2073, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2127, !2128, !2129, !2130, !2131, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2162, !2163, !2166, !2167, !2168, !2169, !2170, !2171, !2173, !2174, !2175, !2176, !2184, !2185, !2189, !2193, !2194, !2195}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1081, file: !919, line: 1342, baseType: !976, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1081, file: !919, line: 1349, baseType: !1059, size: 64, align: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1081, file: !919, line: 1356, baseType: !1086, size: 64, align: 64, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1142, !1143, !1147, !1151, !1156, !1163, !1252, !1258, !1264, !1265, !1266, !1267, !1271}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1087, file: !919, line: 498, baseType: !962, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1087, file: !919, line: 504, baseType: !962, size: 64, align: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1087, file: !919, line: 505, baseType: !962, size: 64, align: 64, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1087, file: !919, line: 506, baseType: !962, size: 64, align: 64, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1087, file: !919, line: 508, baseType: !46, size: 32, align: 32, offset: 256)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1087, file: !919, line: 509, baseType: !46, size: 32, align: 32, offset: 288)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1087, file: !919, line: 510, baseType: !46, size: 32, align: 32, offset: 320)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1087, file: !919, line: 517, baseType: !967, size: 32, align: 32, offset: 352)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1087, file: !919, line: 523, baseType: !970, size: 64, align: 64, offset: 384)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1087, file: !919, line: 526, baseType: !976, size: 64, align: 64, offset: 448)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1087, file: !919, line: 535, baseType: !1086, size: 64, align: 64, offset: 512)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1087, file: !919, line: 539, baseType: !967, size: 32, align: 32, offset: 576)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1087, file: !919, line: 541, baseType: !1077, size: 64, align: 64, offset: 640)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1087, file: !919, line: 549, baseType: !1103, size: 64, align: 64, offset: 704)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!967, !1080, !1106}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !47, line: 1499, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !47, line: 1445, size: 704, align: 64, elements: !1109)
!1109 = !{!1110, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1138, !1139, !1140, !1141}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1108, file: !47, line: 1451, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1113, line: 94, baseType: !1114)
!1113 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1113, line: 81, size: 192, align: 64, elements: !1115)
!1115 = !{!1116, !1120, !1123}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1114, file: !1113, line: 82, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1113, line: 73, baseType: !1119)
!1119 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1113, line: 73, flags: DIFlagFwdDecl)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1114, file: !1113, line: 89, baseType: !1121, size: 64, align: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !953, line: 48, baseType: !1073)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1114, file: !1113, line: 93, baseType: !967, size: 32, align: 32, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1108, file: !47, line: 1461, baseType: !1000, size: 64, align: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1108, file: !47, line: 1467, baseType: !1000, size: 64, align: 64, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1108, file: !47, line: 1468, baseType: !1121, size: 64, align: 64, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1108, file: !47, line: 1469, baseType: !967, size: 32, align: 32, offset: 256)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1108, file: !47, line: 1470, baseType: !967, size: 32, align: 32, offset: 288)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1108, file: !47, line: 1474, baseType: !967, size: 32, align: 32, offset: 320)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1108, file: !47, line: 1479, baseType: !1131, size: 64, align: 64, offset: 384)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !47, line: 1415, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !47, line: 1411, size: 128, align: 64, elements: !1134)
!1134 = !{!1135, !1136, !1137}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1133, file: !47, line: 1412, baseType: !1121, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1133, file: !47, line: 1413, baseType: !967, size: 32, align: 32, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1133, file: !47, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1108, file: !47, line: 1480, baseType: !967, size: 32, align: 32, offset: 448)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1108, file: !47, line: 1486, baseType: !1000, size: 64, align: 64, offset: 512)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1108, file: !47, line: 1488, baseType: !1000, size: 64, align: 64, offset: 576)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1108, file: !47, line: 1497, baseType: !1000, size: 64, align: 64, offset: 640)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1087, file: !919, line: 550, baseType: !1077, size: 64, align: 64, offset: 768)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1087, file: !919, line: 554, baseType: !1144, size: 64, align: 64, offset: 832)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!967, !1080, !1106, !1106, !967}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1087, file: !919, line: 563, baseType: !1148, size: 64, align: 64, offset: 896)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!967, !46, !967}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1087, file: !919, line: 565, baseType: !1152, size: 64, align: 64, offset: 960)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{null, !1080, !967, !1155, !1155}
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1087, file: !919, line: 570, baseType: !1157, size: 64, align: 64, offset: 1024)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!967, !1080, !967, !986, !1160}
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1161, line: 216, baseType: !1162)
!1161 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1162 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1087, file: !919, line: 581, baseType: !1164, size: 64, align: 64, offset: 1088)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!967, !1080, !967, !1167, !954}
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1171)
!1171 = !{!1172, !1176, !1178, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1206, !1208, !1209, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1170, file: !548, line: 282, baseType: !1173, size: 512, align: 64)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1121, size: 512, align: 64, elements: !1174)
!1174 = !{!1175}
!1175 = !DISubrange(count: 8)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1170, file: !548, line: 299, baseType: !1177, size: 256, align: 32, offset: 512)
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 256, align: 32, elements: !1174)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1170, file: !548, line: 315, baseType: !1179, size: 64, align: 64, offset: 768)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1170, file: !548, line: 326, baseType: !967, size: 32, align: 32, offset: 832)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1170, file: !548, line: 326, baseType: !967, size: 32, align: 32, offset: 864)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1170, file: !548, line: 334, baseType: !967, size: 32, align: 32, offset: 896)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1170, file: !548, line: 341, baseType: !967, size: 32, align: 32, offset: 928)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1170, file: !548, line: 346, baseType: !967, size: 32, align: 32, offset: 960)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1170, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1170, file: !548, line: 356, baseType: !1006, size: 64, align: 32, offset: 1024)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1170, file: !548, line: 361, baseType: !1000, size: 64, align: 64, offset: 1088)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1170, file: !548, line: 369, baseType: !1000, size: 64, align: 64, offset: 1152)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1170, file: !548, line: 377, baseType: !1000, size: 64, align: 64, offset: 1216)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1170, file: !548, line: 382, baseType: !967, size: 32, align: 32, offset: 1280)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1170, file: !548, line: 386, baseType: !967, size: 32, align: 32, offset: 1312)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1170, file: !548, line: 391, baseType: !967, size: 32, align: 32, offset: 1344)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1170, file: !548, line: 396, baseType: !986, size: 64, align: 64, offset: 1408)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1170, file: !548, line: 403, baseType: !1195, size: 512, align: 64, offset: 1472)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1196, size: 512, align: 64, elements: !1174)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !953, line: 55, baseType: !1162)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1170, file: !548, line: 410, baseType: !967, size: 32, align: 32, offset: 1984)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1170, file: !548, line: 415, baseType: !967, size: 32, align: 32, offset: 2016)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1170, file: !548, line: 420, baseType: !967, size: 32, align: 32, offset: 2048)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1170, file: !548, line: 425, baseType: !967, size: 32, align: 32, offset: 2080)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1170, file: !548, line: 435, baseType: !1000, size: 64, align: 64, offset: 2112)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1170, file: !548, line: 440, baseType: !967, size: 32, align: 32, offset: 2176)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1170, file: !548, line: 445, baseType: !1196, size: 64, align: 64, offset: 2240)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1170, file: !548, line: 459, baseType: !1205, size: 512, align: 64, offset: 2304)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1111, size: 512, align: 64, elements: !1174)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1170, file: !548, line: 473, baseType: !1207, size: 64, align: 64, offset: 2816)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1170, file: !548, line: 477, baseType: !967, size: 32, align: 32, offset: 2880)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1170, file: !548, line: 479, baseType: !1210, size: 64, align: 64, offset: 2944)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1214)
!1214 = !{!1215, !1216, !1217, !1218, !1223}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1213, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1213, file: !548, line: 203, baseType: !1121, size: 64, align: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1213, file: !548, line: 204, baseType: !967, size: 32, align: 32, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1213, file: !548, line: 205, baseType: !1219, size: 64, align: 64, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1221, line: 86, baseType: !1222)
!1221 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1222 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1221, line: 86, flags: DIFlagFwdDecl)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1213, file: !548, line: 206, baseType: !1111, size: 64, align: 64, offset: 256)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1170, file: !548, line: 480, baseType: !967, size: 32, align: 32, offset: 3008)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1170, file: !548, line: 505, baseType: !967, size: 32, align: 32, offset: 3040)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1170, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1170, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1170, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1170, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1170, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1170, file: !548, line: 532, baseType: !1000, size: 64, align: 64, offset: 3264)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1170, file: !548, line: 539, baseType: !1000, size: 64, align: 64, offset: 3328)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1170, file: !548, line: 547, baseType: !1000, size: 64, align: 64, offset: 3392)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1170, file: !548, line: 554, baseType: !1219, size: 64, align: 64, offset: 3456)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1170, file: !548, line: 563, baseType: !967, size: 32, align: 32, offset: 3520)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1170, file: !548, line: 572, baseType: !967, size: 32, align: 32, offset: 3552)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1170, file: !548, line: 581, baseType: !967, size: 32, align: 32, offset: 3584)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1170, file: !548, line: 588, baseType: !1239, size: 64, align: 64, offset: 3648)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !953, line: 36, baseType: !1241)
!1241 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1170, file: !548, line: 593, baseType: !967, size: 32, align: 32, offset: 3712)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1170, file: !548, line: 596, baseType: !967, size: 32, align: 32, offset: 3744)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1170, file: !548, line: 599, baseType: !1111, size: 64, align: 64, offset: 3776)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1170, file: !548, line: 605, baseType: !1111, size: 64, align: 64, offset: 3840)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1170, file: !548, line: 616, baseType: !1111, size: 64, align: 64, offset: 3904)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1170, file: !548, line: 626, baseType: !1160, size: 64, align: 64, offset: 3968)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1170, file: !548, line: 627, baseType: !1160, size: 64, align: 64, offset: 4032)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1170, file: !548, line: 628, baseType: !1160, size: 64, align: 64, offset: 4096)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1170, file: !548, line: 629, baseType: !1160, size: 64, align: 64, offset: 4160)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1170, file: !548, line: 645, baseType: !1111, size: 64, align: 64, offset: 4224)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1087, file: !919, line: 587, baseType: !1253, size: 64, align: 64, offset: 1152)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!967, !1080, !1256}
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1087, file: !919, line: 592, baseType: !1259, size: 64, align: 64, offset: 1216)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!967, !1080, !1262}
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1087, file: !919, line: 597, baseType: !1259, size: 64, align: 64, offset: 1280)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1087, file: !919, line: 598, baseType: !46, size: 32, align: 32, offset: 1344)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1087, file: !919, line: 608, baseType: !1077, size: 64, align: 64, offset: 1408)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1087, file: !919, line: 617, baseType: !1268, size: 64, align: 64, offset: 1472)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{null, !1080}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1087, file: !919, line: 623, baseType: !1272, size: 64, align: 64, offset: 1536)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!967, !1080, !1275}
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1107)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1081, file: !919, line: 1365, baseType: !986, size: 64, align: 64, offset: 192)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1081, file: !919, line: 1379, baseType: !1279, size: 64, align: 64, offset: 256)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1281)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1282)
!1282 = !{!1283, !1284, !1285, !1286, !1287, !1288, !1289, !1293, !1294, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1310, !1311, !1315, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1333, !1334, !1335, !1336, !1340, !1341, !1342}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1281, file: !650, line: 174, baseType: !976, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1281, file: !650, line: 226, baseType: !1072, size: 64, align: 64, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1281, file: !650, line: 227, baseType: !967, size: 32, align: 32, offset: 128)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1281, file: !650, line: 228, baseType: !1072, size: 64, align: 64, offset: 192)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1281, file: !650, line: 229, baseType: !1072, size: 64, align: 64, offset: 256)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1281, file: !650, line: 233, baseType: !986, size: 64, align: 64, offset: 320)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1281, file: !650, line: 235, baseType: !1290, size: 64, align: 64, offset: 384)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!967, !986, !1121, !967}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1281, file: !650, line: 236, baseType: !1290, size: 64, align: 64, offset: 448)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1281, file: !650, line: 237, baseType: !1295, size: 64, align: 64, offset: 512)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{!1000, !986, !1000, !967}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1281, file: !650, line: 238, baseType: !1000, size: 64, align: 64, offset: 576)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1281, file: !650, line: 239, baseType: !967, size: 32, align: 32, offset: 640)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1281, file: !650, line: 240, baseType: !967, size: 32, align: 32, offset: 672)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1281, file: !650, line: 241, baseType: !967, size: 32, align: 32, offset: 704)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1281, file: !650, line: 242, baseType: !1162, size: 64, align: 64, offset: 768)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1281, file: !650, line: 243, baseType: !1072, size: 64, align: 64, offset: 832)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1281, file: !650, line: 244, baseType: !1305, size: 64, align: 64, offset: 896)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DISubroutineType(types: !1307)
!1307 = !{!1162, !1162, !1308, !954}
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1122)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1281, file: !650, line: 245, baseType: !967, size: 32, align: 32, offset: 960)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1281, file: !650, line: 249, baseType: !1312, size: 64, align: 64, offset: 1024)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!967, !986, !967}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1281, file: !650, line: 255, baseType: !1316, size: 64, align: 64, offset: 1088)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{!1000, !986, !967, !1000, !967}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1281, file: !650, line: 260, baseType: !967, size: 32, align: 32, offset: 1152)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1281, file: !650, line: 266, baseType: !1000, size: 64, align: 64, offset: 1216)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1281, file: !650, line: 273, baseType: !967, size: 32, align: 32, offset: 1280)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1281, file: !650, line: 279, baseType: !1000, size: 64, align: 64, offset: 1344)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1281, file: !650, line: 285, baseType: !967, size: 32, align: 32, offset: 1408)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1281, file: !650, line: 291, baseType: !967, size: 32, align: 32, offset: 1440)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1281, file: !650, line: 298, baseType: !967, size: 32, align: 32, offset: 1472)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1281, file: !650, line: 304, baseType: !967, size: 32, align: 32, offset: 1504)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1281, file: !650, line: 309, baseType: !962, size: 64, align: 64, offset: 1536)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1281, file: !650, line: 314, baseType: !962, size: 64, align: 64, offset: 1600)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1281, file: !650, line: 319, baseType: !1330, size: 64, align: 64, offset: 1664)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{!967, !986, !1121, !967, !649, !1000}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1281, file: !650, line: 326, baseType: !967, size: 32, align: 32, offset: 1728)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1281, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1281, file: !650, line: 332, baseType: !1000, size: 64, align: 64, offset: 1792)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1281, file: !650, line: 338, baseType: !1337, size: 64, align: 64, offset: 1856)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{!967, !986}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1281, file: !650, line: 340, baseType: !1000, size: 64, align: 64, offset: 1920)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1281, file: !650, line: 346, baseType: !1072, size: 64, align: 64, offset: 1984)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1281, file: !650, line: 351, baseType: !967, size: 32, align: 32, offset: 2048)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1081, file: !919, line: 1386, baseType: !967, size: 32, align: 32, offset: 320)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1081, file: !919, line: 1393, baseType: !954, size: 32, align: 32, offset: 352)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1081, file: !919, line: 1405, baseType: !1346, size: 64, align: 64, offset: 384)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1349)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1350)
!1350 = !{!1351, !1352, !1353, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !2021, !2027, !2028, !2032, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2064, !2065, !2066, !2067, !2068, !2069}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1349, file: !919, line: 866, baseType: !967, size: 32, align: 32)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1349, file: !919, line: 872, baseType: !967, size: 32, align: 32, offset: 32)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1349, file: !919, line: 878, baseType: !1354, size: 64, align: 64, offset: 64)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !47, line: 3360, baseType: !1356)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !47, line: 1556, size: 8448, align: 64, elements: !1357)
!1357 = !{!1358, !1359, !1360, !1361, !1502, !1503, !1504, !1505, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1658, !1662, !1663, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1842, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1356, file: !47, line: 1561, baseType: !976, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1356, file: !47, line: 1562, baseType: !967, size: 32, align: 32, offset: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1356, file: !47, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1356, file: !47, line: 1565, baseType: !1362, size: 64, align: 64, offset: 128)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1364)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !47, line: 3468, size: 1984, align: 64, elements: !1365)
!1365 = !{!1366, !1367, !1368, !1369, !1370, !1371, !1374, !1377, !1380, !1383, !1386, !1387, !1388, !1396, !1397, !1398, !1400, !1404, !1410, !1419, !1423, !1424, !1467, !1474, !1478, !1479, !1483, !1487, !1491, !1495, !1496, !1497}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1364, file: !47, line: 3475, baseType: !962, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1364, file: !47, line: 3480, baseType: !962, size: 64, align: 64, offset: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1364, file: !47, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1364, file: !47, line: 3482, baseType: !46, size: 32, align: 32, offset: 160)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1364, file: !47, line: 3487, baseType: !967, size: 32, align: 32, offset: 192)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1364, file: !47, line: 3488, baseType: !1372, size: 64, align: 64, offset: 256)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1364, file: !47, line: 3489, baseType: !1375, size: 64, align: 64, offset: 320)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1364, file: !47, line: 3490, baseType: !1378, size: 64, align: 64, offset: 384)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1364, file: !47, line: 3491, baseType: !1381, size: 64, align: 64, offset: 448)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1364, file: !47, line: 3492, baseType: !1384, size: 64, align: 64, offset: 512)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1196)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1364, file: !47, line: 3493, baseType: !1122, size: 8, align: 8, offset: 576)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1364, file: !47, line: 3494, baseType: !976, size: 64, align: 64, offset: 640)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1364, file: !47, line: 3495, baseType: !1389, size: 64, align: 64, offset: 704)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1391)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !47, line: 3404, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !47, line: 3401, size: 128, align: 64, elements: !1393)
!1393 = !{!1394, !1395}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1392, file: !47, line: 3402, baseType: !967, size: 32, align: 32)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1392, file: !47, line: 3403, baseType: !962, size: 64, align: 64, offset: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1364, file: !47, line: 3507, baseType: !962, size: 64, align: 64, offset: 768)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1364, file: !47, line: 3516, baseType: !967, size: 32, align: 32, offset: 832)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1364, file: !47, line: 3517, baseType: !1399, size: 64, align: 64, offset: 896)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1364, file: !47, line: 3527, baseType: !1401, size: 64, align: 64, offset: 960)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DISubroutineType(types: !1403)
!1403 = !{!967, !1354}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1364, file: !47, line: 3535, baseType: !1405, size: 64, align: 64, offset: 1024)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{!967, !1354, !1408}
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1355)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1364, file: !47, line: 3541, baseType: !1411, size: 64, align: 64, offset: 1088)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1413)
!1413 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !47, line: 3461, baseType: !1414)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1415, line: 223, size: 128, align: 64, elements: !1416)
!1415 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1416 = !{!1417, !1418}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1414, file: !1415, line: 224, baseType: !1308, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1414, file: !1415, line: 225, baseType: !1308, size: 64, align: 64, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1364, file: !47, line: 3549, baseType: !1420, size: 64, align: 64, offset: 1152)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DISubroutineType(types: !1422)
!1422 = !{null, !1399}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1364, file: !47, line: 3551, baseType: !1401, size: 64, align: 64, offset: 1216)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1364, file: !47, line: 3552, baseType: !1425, size: 64, align: 64, offset: 1280)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DISubroutineType(types: !1427)
!1427 = !{!967, !1354, !1121, !967, !1428}
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1430)
!1430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !47, line: 3920, size: 256, align: 64, elements: !1431)
!1431 = !{!1432, !1435, !1436, !1437, !1438, !1466}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1430, file: !47, line: 3921, baseType: !1433, size: 16, align: 16)
!1433 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !953, line: 49, baseType: !1434)
!1434 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1430, file: !47, line: 3922, baseType: !952, size: 32, align: 32, offset: 32)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1430, file: !47, line: 3923, baseType: !952, size: 32, align: 32, offset: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1430, file: !47, line: 3924, baseType: !954, size: 32, align: 32, offset: 96)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1430, file: !47, line: 3925, baseType: !1439, size: 64, align: 64, offset: 128)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !47, line: 3918, baseType: !1442)
!1442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !47, line: 3885, size: 1600, align: 64, elements: !1443)
!1443 = !{!1444, !1445, !1446, !1447, !1448, !1449, !1455, !1459, !1461, !1462, !1464, !1465}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1442, file: !47, line: 3886, baseType: !967, size: 32, align: 32)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1442, file: !47, line: 3887, baseType: !967, size: 32, align: 32, offset: 32)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1442, file: !47, line: 3888, baseType: !967, size: 32, align: 32, offset: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1442, file: !47, line: 3889, baseType: !967, size: 32, align: 32, offset: 96)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1442, file: !47, line: 3890, baseType: !967, size: 32, align: 32, offset: 128)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1442, file: !47, line: 3897, baseType: !1450, size: 768, align: 64, offset: 192)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !47, line: 3858, baseType: !1451)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !47, line: 3853, size: 768, align: 64, elements: !1452)
!1452 = !{!1453, !1454}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1451, file: !47, line: 3855, baseType: !1173, size: 512, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1451, file: !47, line: 3857, baseType: !1177, size: 256, align: 32, offset: 512)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1442, file: !47, line: 3903, baseType: !1456, size: 256, align: 64, offset: 960)
!1456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1121, size: 256, align: 64, elements: !1457)
!1457 = !{!1458}
!1458 = !DISubrange(count: 4)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1442, file: !47, line: 3904, baseType: !1460, size: 128, align: 32, offset: 1216)
!1460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 128, align: 32, elements: !1457)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1442, file: !47, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1442, file: !47, line: 3908, baseType: !1463, size: 64, align: 64, offset: 1408)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1442, file: !47, line: 3915, baseType: !1463, size: 64, align: 64, offset: 1472)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1442, file: !47, line: 3917, baseType: !967, size: 32, align: 32, offset: 1536)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1430, file: !47, line: 3926, baseType: !1000, size: 64, align: 64, offset: 192)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1364, file: !47, line: 3564, baseType: !1468, size: 64, align: 64, offset: 1344)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!967, !1354, !1106, !1471, !1473}
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1169)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1364, file: !47, line: 3566, baseType: !1475, size: 64, align: 64, offset: 1408)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!967, !1354, !986, !1473, !1106}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1364, file: !47, line: 3567, baseType: !1401, size: 64, align: 64, offset: 1472)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1364, file: !47, line: 3576, baseType: !1480, size: 64, align: 64, offset: 1536)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DISubroutineType(types: !1482)
!1482 = !{!967, !1354, !1471}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1364, file: !47, line: 3577, baseType: !1484, size: 64, align: 64, offset: 1600)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!967, !1354, !1106}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1364, file: !47, line: 3584, baseType: !1488, size: 64, align: 64, offset: 1664)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!967, !1354, !1168}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1364, file: !47, line: 3589, baseType: !1492, size: 64, align: 64, offset: 1728)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{null, !1354}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1364, file: !47, line: 3594, baseType: !967, size: 32, align: 32, offset: 1792)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1364, file: !47, line: 3600, baseType: !962, size: 64, align: 64, offset: 1856)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1364, file: !47, line: 3609, baseType: !1498, size: 64, align: 64, offset: 1920)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1501)
!1501 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !47, line: 3609, flags: DIFlagFwdDecl)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1356, file: !47, line: 1566, baseType: !46, size: 32, align: 32, offset: 192)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1356, file: !47, line: 1581, baseType: !954, size: 32, align: 32, offset: 224)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1356, file: !47, line: 1583, baseType: !986, size: 64, align: 64, offset: 256)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1356, file: !47, line: 1591, baseType: !1506, size: 64, align: 64, offset: 320)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1415, line: 129, size: 1664, align: 64, elements: !1508)
!1508 = !{!1509, !1510, !1511, !1512, !1513, !1531, !1532, !1538, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1507, file: !1415, line: 136, baseType: !967, size: 32, align: 32)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1507, file: !1415, line: 151, baseType: !967, size: 32, align: 32, offset: 32)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1507, file: !1415, line: 157, baseType: !967, size: 32, align: 32, offset: 64)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1507, file: !1415, line: 159, baseType: !1168, size: 64, align: 64, offset: 128)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1507, file: !1415, line: 161, baseType: !1514, size: 64, align: 64, offset: 192)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1415, line: 117, baseType: !1516)
!1516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1415, line: 100, size: 832, align: 64, elements: !1517)
!1517 = !{!1518, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530}
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1516, file: !1415, line: 105, baseType: !1519, size: 256, align: 64)
!1519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1520, size: 256, align: 64, elements: !1457)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1113, line: 238, baseType: !1522)
!1522 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1113, line: 238, flags: DIFlagFwdDecl)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1516, file: !1415, line: 110, baseType: !967, size: 32, align: 32, offset: 256)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1516, file: !1415, line: 111, baseType: !967, size: 32, align: 32, offset: 288)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1516, file: !1415, line: 111, baseType: !967, size: 32, align: 32, offset: 320)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1516, file: !1415, line: 112, baseType: !1177, size: 256, align: 32, offset: 352)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1516, file: !1415, line: 113, baseType: !1460, size: 128, align: 32, offset: 608)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1516, file: !1415, line: 114, baseType: !967, size: 32, align: 32, offset: 736)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1516, file: !1415, line: 115, baseType: !967, size: 32, align: 32, offset: 768)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1516, file: !1415, line: 116, baseType: !967, size: 32, align: 32, offset: 800)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1507, file: !1415, line: 163, baseType: !986, size: 64, align: 64, offset: 256)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1507, file: !1415, line: 165, baseType: !1533, size: 128, align: 64, offset: 320)
!1533 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1415, line: 122, baseType: !1534)
!1534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1415, line: 119, size: 128, align: 64, elements: !1535)
!1535 = !{!1536, !1537}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1534, file: !1415, line: 120, baseType: !1106, size: 64, align: 64)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1534, file: !1415, line: 121, baseType: !1168, size: 64, align: 64, offset: 64)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1507, file: !1415, line: 166, baseType: !1539, size: 128, align: 64, offset: 448)
!1539 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1415, line: 127, baseType: !1540)
!1540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1415, line: 124, size: 128, align: 64, elements: !1541)
!1541 = !{!1542, !1615}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1540, file: !1415, line: 125, baseType: !1543, size: 64, align: 64)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !47, line: 5794, baseType: !1546)
!1546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !47, line: 5747, size: 512, align: 64, elements: !1547)
!1547 = !{!1548, !1549, !1573, !1577, !1578, !1612, !1613, !1614}
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1546, file: !47, line: 5751, baseType: !976, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1546, file: !47, line: 5756, baseType: !1550, size: 64, align: 64, offset: 64)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1552)
!1552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !47, line: 5796, size: 512, align: 64, elements: !1553)
!1553 = !{!1554, !1555, !1558, !1559, !1560, !1564, !1568, !1572}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1552, file: !47, line: 5797, baseType: !962, size: 64, align: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1552, file: !47, line: 5804, baseType: !1556, size: 64, align: 64, offset: 64)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1552, file: !47, line: 5815, baseType: !976, size: 64, align: 64, offset: 128)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1552, file: !47, line: 5825, baseType: !967, size: 32, align: 32, offset: 192)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1552, file: !47, line: 5826, baseType: !1561, size: 64, align: 64, offset: 256)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{!967, !1544}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1552, file: !47, line: 5827, baseType: !1565, size: 64, align: 64, offset: 320)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64, align: 64)
!1566 = !DISubroutineType(types: !1567)
!1567 = !{!967, !1544, !1106}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1552, file: !47, line: 5828, baseType: !1569, size: 64, align: 64, offset: 384)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DISubroutineType(types: !1571)
!1571 = !{null, !1544}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1552, file: !47, line: 5829, baseType: !1569, size: 64, align: 64, offset: 448)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1546, file: !47, line: 5762, baseType: !1574, size: 64, align: 64, offset: 128)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !47, line: 5735, baseType: !1576)
!1576 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !47, line: 5735, flags: DIFlagFwdDecl)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1546, file: !47, line: 5768, baseType: !986, size: 64, align: 64, offset: 192)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1546, file: !47, line: 5775, baseType: !1579, size: 64, align: 64, offset: 256)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !47, line: 4085, baseType: !1581)
!1581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !47, line: 3936, size: 1152, align: 64, elements: !1582)
!1582 = !{!1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611}
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1581, file: !47, line: 3940, baseType: !658, size: 32, align: 32)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1581, file: !47, line: 3944, baseType: !46, size: 32, align: 32, offset: 32)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1581, file: !47, line: 3948, baseType: !952, size: 32, align: 32, offset: 64)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1581, file: !47, line: 3958, baseType: !1121, size: 64, align: 64, offset: 128)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1581, file: !47, line: 3962, baseType: !967, size: 32, align: 32, offset: 192)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1581, file: !47, line: 3968, baseType: !967, size: 32, align: 32, offset: 224)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1581, file: !47, line: 3973, baseType: !1000, size: 64, align: 64, offset: 256)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1581, file: !47, line: 3986, baseType: !967, size: 32, align: 32, offset: 320)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1581, file: !47, line: 3999, baseType: !967, size: 32, align: 32, offset: 352)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1581, file: !47, line: 4004, baseType: !967, size: 32, align: 32, offset: 384)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1581, file: !47, line: 4005, baseType: !967, size: 32, align: 32, offset: 416)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1581, file: !47, line: 4010, baseType: !967, size: 32, align: 32, offset: 448)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1581, file: !47, line: 4011, baseType: !967, size: 32, align: 32, offset: 480)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1581, file: !47, line: 4020, baseType: !1006, size: 64, align: 32, offset: 512)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1581, file: !47, line: 4025, baseType: !889, size: 32, align: 32, offset: 576)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1581, file: !47, line: 4030, baseType: !571, size: 32, align: 32, offset: 608)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1581, file: !47, line: 4031, baseType: !578, size: 32, align: 32, offset: 640)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1581, file: !47, line: 4032, baseType: !596, size: 32, align: 32, offset: 672)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1581, file: !47, line: 4033, baseType: !620, size: 32, align: 32, offset: 704)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1581, file: !47, line: 4034, baseType: !639, size: 32, align: 32, offset: 736)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1581, file: !47, line: 4039, baseType: !967, size: 32, align: 32, offset: 768)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1581, file: !47, line: 4046, baseType: !1196, size: 64, align: 64, offset: 832)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1581, file: !47, line: 4050, baseType: !967, size: 32, align: 32, offset: 896)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1581, file: !47, line: 4054, baseType: !967, size: 32, align: 32, offset: 928)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1581, file: !47, line: 4061, baseType: !967, size: 32, align: 32, offset: 960)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1581, file: !47, line: 4065, baseType: !967, size: 32, align: 32, offset: 992)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1581, file: !47, line: 4073, baseType: !967, size: 32, align: 32, offset: 1024)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1581, file: !47, line: 4080, baseType: !967, size: 32, align: 32, offset: 1056)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1581, file: !47, line: 4084, baseType: !967, size: 32, align: 32, offset: 1088)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1546, file: !47, line: 5781, baseType: !1579, size: 64, align: 64, offset: 320)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1546, file: !47, line: 5787, baseType: !1006, size: 64, align: 32, offset: 384)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1546, file: !47, line: 5793, baseType: !1006, size: 64, align: 32, offset: 448)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1540, file: !1415, line: 126, baseType: !967, size: 32, align: 32, offset: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1507, file: !1415, line: 172, baseType: !1106, size: 64, align: 64, offset: 576)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1507, file: !1415, line: 177, baseType: !1121, size: 64, align: 64, offset: 640)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1507, file: !1415, line: 178, baseType: !954, size: 32, align: 32, offset: 704)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1507, file: !1415, line: 180, baseType: !986, size: 64, align: 64, offset: 768)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1507, file: !1415, line: 185, baseType: !967, size: 32, align: 32, offset: 832)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1507, file: !1415, line: 190, baseType: !986, size: 64, align: 64, offset: 896)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1507, file: !1415, line: 195, baseType: !967, size: 32, align: 32, offset: 960)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1507, file: !1415, line: 200, baseType: !1106, size: 64, align: 64, offset: 1024)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1507, file: !1415, line: 201, baseType: !967, size: 32, align: 32, offset: 1088)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1507, file: !1415, line: 202, baseType: !1168, size: 64, align: 64, offset: 1152)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1507, file: !1415, line: 203, baseType: !967, size: 32, align: 32, offset: 1216)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1507, file: !1415, line: 205, baseType: !967, size: 32, align: 32, offset: 1248)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1507, file: !1415, line: 206, baseType: !967, size: 32, align: 32, offset: 1280)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1507, file: !1415, line: 209, baseType: !1160, size: 64, align: 64, offset: 1344)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1507, file: !1415, line: 212, baseType: !1160, size: 64, align: 64, offset: 1408)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1507, file: !1415, line: 213, baseType: !1168, size: 64, align: 64, offset: 1472)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1507, file: !1415, line: 215, baseType: !967, size: 32, align: 32, offset: 1536)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1507, file: !1415, line: 217, baseType: !967, size: 32, align: 32, offset: 1568)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1507, file: !1415, line: 220, baseType: !967, size: 32, align: 32, offset: 1600)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1356, file: !47, line: 1598, baseType: !986, size: 64, align: 64, offset: 384)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1356, file: !47, line: 1606, baseType: !1000, size: 64, align: 64, offset: 448)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1356, file: !47, line: 1614, baseType: !967, size: 32, align: 32, offset: 512)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1356, file: !47, line: 1622, baseType: !967, size: 32, align: 32, offset: 544)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1356, file: !47, line: 1628, baseType: !967, size: 32, align: 32, offset: 576)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1356, file: !47, line: 1636, baseType: !967, size: 32, align: 32, offset: 608)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1356, file: !47, line: 1643, baseType: !967, size: 32, align: 32, offset: 640)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1356, file: !47, line: 1657, baseType: !1121, size: 64, align: 64, offset: 704)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1356, file: !47, line: 1658, baseType: !967, size: 32, align: 32, offset: 768)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1356, file: !47, line: 1679, baseType: !1006, size: 64, align: 32, offset: 800)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1356, file: !47, line: 1688, baseType: !967, size: 32, align: 32, offset: 864)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1356, file: !47, line: 1712, baseType: !967, size: 32, align: 32, offset: 896)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1356, file: !47, line: 1729, baseType: !967, size: 32, align: 32, offset: 928)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1356, file: !47, line: 1729, baseType: !967, size: 32, align: 32, offset: 960)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1356, file: !47, line: 1744, baseType: !967, size: 32, align: 32, offset: 992)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1356, file: !47, line: 1744, baseType: !967, size: 32, align: 32, offset: 1024)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1356, file: !47, line: 1751, baseType: !967, size: 32, align: 32, offset: 1056)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1356, file: !47, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1356, file: !47, line: 1791, baseType: !1654, size: 64, align: 64, offset: 1152)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{null, !1657, !1471, !1473, !967, !967, !967}
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1356, file: !47, line: 1808, baseType: !1659, size: 64, align: 64, offset: 1216)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DISubroutineType(types: !1661)
!1661 = !{!667, !1657, !1375}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1356, file: !47, line: 1816, baseType: !967, size: 32, align: 32, offset: 1280)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1356, file: !47, line: 1825, baseType: !1664, size: 32, align: 32, offset: 1312)
!1664 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1356, file: !47, line: 1830, baseType: !967, size: 32, align: 32, offset: 1344)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1356, file: !47, line: 1838, baseType: !1664, size: 32, align: 32, offset: 1376)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1356, file: !47, line: 1846, baseType: !967, size: 32, align: 32, offset: 1408)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1356, file: !47, line: 1851, baseType: !967, size: 32, align: 32, offset: 1440)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1356, file: !47, line: 1861, baseType: !1664, size: 32, align: 32, offset: 1472)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1356, file: !47, line: 1868, baseType: !1664, size: 32, align: 32, offset: 1504)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1356, file: !47, line: 1875, baseType: !1664, size: 32, align: 32, offset: 1536)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1356, file: !47, line: 1882, baseType: !1664, size: 32, align: 32, offset: 1568)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1356, file: !47, line: 1889, baseType: !1664, size: 32, align: 32, offset: 1600)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1356, file: !47, line: 1896, baseType: !1664, size: 32, align: 32, offset: 1632)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1356, file: !47, line: 1903, baseType: !1664, size: 32, align: 32, offset: 1664)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1356, file: !47, line: 1910, baseType: !967, size: 32, align: 32, offset: 1696)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1356, file: !47, line: 1915, baseType: !967, size: 32, align: 32, offset: 1728)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1356, file: !47, line: 1926, baseType: !1473, size: 64, align: 64, offset: 1792)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1356, file: !47, line: 1935, baseType: !1006, size: 64, align: 32, offset: 1856)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1356, file: !47, line: 1942, baseType: !967, size: 32, align: 32, offset: 1920)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1356, file: !47, line: 1948, baseType: !967, size: 32, align: 32, offset: 1952)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1356, file: !47, line: 1954, baseType: !967, size: 32, align: 32, offset: 1984)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1356, file: !47, line: 1960, baseType: !967, size: 32, align: 32, offset: 2016)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1356, file: !47, line: 1984, baseType: !967, size: 32, align: 32, offset: 2048)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1356, file: !47, line: 1991, baseType: !967, size: 32, align: 32, offset: 2080)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1356, file: !47, line: 1996, baseType: !967, size: 32, align: 32, offset: 2112)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1356, file: !47, line: 2004, baseType: !967, size: 32, align: 32, offset: 2144)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1356, file: !47, line: 2011, baseType: !967, size: 32, align: 32, offset: 2176)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1356, file: !47, line: 2018, baseType: !967, size: 32, align: 32, offset: 2208)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1356, file: !47, line: 2027, baseType: !967, size: 32, align: 32, offset: 2240)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1356, file: !47, line: 2034, baseType: !967, size: 32, align: 32, offset: 2272)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1356, file: !47, line: 2044, baseType: !967, size: 32, align: 32, offset: 2304)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1356, file: !47, line: 2054, baseType: !1694, size: 64, align: 64, offset: 2368)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1356, file: !47, line: 2061, baseType: !1694, size: 64, align: 64, offset: 2432)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1356, file: !47, line: 2066, baseType: !967, size: 32, align: 32, offset: 2496)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1356, file: !47, line: 2070, baseType: !967, size: 32, align: 32, offset: 2528)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1356, file: !47, line: 2078, baseType: !967, size: 32, align: 32, offset: 2560)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1356, file: !47, line: 2085, baseType: !967, size: 32, align: 32, offset: 2592)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1356, file: !47, line: 2092, baseType: !967, size: 32, align: 32, offset: 2624)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1356, file: !47, line: 2099, baseType: !967, size: 32, align: 32, offset: 2656)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1356, file: !47, line: 2106, baseType: !967, size: 32, align: 32, offset: 2688)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1356, file: !47, line: 2113, baseType: !967, size: 32, align: 32, offset: 2720)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1356, file: !47, line: 2120, baseType: !967, size: 32, align: 32, offset: 2752)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1356, file: !47, line: 2125, baseType: !967, size: 32, align: 32, offset: 2784)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1356, file: !47, line: 2133, baseType: !967, size: 32, align: 32, offset: 2816)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1356, file: !47, line: 2140, baseType: !967, size: 32, align: 32, offset: 2848)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1356, file: !47, line: 2145, baseType: !967, size: 32, align: 32, offset: 2880)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1356, file: !47, line: 2153, baseType: !967, size: 32, align: 32, offset: 2912)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1356, file: !47, line: 2158, baseType: !967, size: 32, align: 32, offset: 2944)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1356, file: !47, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1356, file: !47, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1356, file: !47, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1356, file: !47, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1356, file: !47, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1356, file: !47, line: 2203, baseType: !967, size: 32, align: 32, offset: 3136)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1356, file: !47, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
