; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavdevice--fbdev_dec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavdevice--fbdev_dec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }

!875 = !{!876, !877, !878, !879, !880, !881, !882}
!876 = !DIEnumerator(name: "AVMEDIA_TYPE_UNKNOWN", value: -1)
!877 = !DIEnumerator(name: "AVMEDIA_TYPE_VIDEO", value: 0)
!878 = !DIEnumerator(name: "AVMEDIA_TYPE_AUDIO", value: 1)
!879 = !DIEnumerator(name: "AVMEDIA_TYPE_DATA", value: 2)
!880 = !DIEnumerator(name: "AVMEDIA_TYPE_SUBTITLE", value: 3)
!881 = !DIEnumerator(name: "AVMEDIA_TYPE_ATTACHMENT", value: 4)
!882 = !DIEnumerator(name: "AVMEDIA_TYPE_NB", value: 5)
!883 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !4, line: 3865, size: 32, align: 32, elements: !884)
!884 = !{!885, !886, !887, !888}
!885 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!886 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!887 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!888 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "./libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !{!939, !942, !943}
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !940, line: 40, baseType: !941)
!940 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!941 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!943 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!944 = !{!945, !2218, !2219}
!945 = distinct !DIGlobalVariable(name: "ff_fbdev_demuxer", scope: !0, file: !946, line: 235, type: !947, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_fbdev_demuxer)
!946 = !DIFile(filename: "libavdevice/fbdev_dec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !949)
!949 = !{!950, !954, !955, !957, !958, !969, !1047, !1048, !1050, !1051, !1052, !1066, !2199, !2200, !2201, !2205, !2209, !2210, !2211, !2215, !2216, !2217}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !948, file: !919, line: 638, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !948, file: !919, line: 645, baseType: !951, size: 64, align: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !948, file: !919, line: 652, baseType: !956, size: 32, align: 32, offset: 128)
!956 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !948, file: !919, line: 659, baseType: !951, size: 64, align: 64, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !948, file: !919, line: 661, baseType: !959, size: 64, align: 64, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !964, line: 44, size: 64, align: 32, elements: !965)
!964 = !DIFile(filename: "./libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !963, file: !964, line: 45, baseType: !3, size: 32, align: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !963, file: !964, line: 46, baseType: !968, size: 32, align: 32, offset: 32)
!968 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !948, file: !919, line: 663, baseType: !970, size: 64, align: 64, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !974)
!974 = !{!975, !976, !980, !1006, !1007, !1008, !1009, !1013, !1019, !1021, !1025}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !973, file: !486, line: 72, baseType: !951, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !973, file: !486, line: 78, baseType: !977, size: 64, align: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!951, !942}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !973, file: !486, line: 85, baseType: !981, size: 64, align: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !1002, !1003, !1004, !1005}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !983, file: !464, line: 247, baseType: !951, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !983, file: !464, line: 253, baseType: !951, size: 64, align: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !983, file: !464, line: 259, baseType: !956, size: 32, align: 32, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !983, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !983, file: !464, line: 271, baseType: !990, size: 64, align: 64, offset: 192)
!990 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !983, file: !464, line: 265, size: 64, align: 64, elements: !991)
!991 = !{!992, !993, !994, !995}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !990, file: !464, line: 266, baseType: !939, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !990, file: !464, line: 267, baseType: !943, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !990, file: !464, line: 268, baseType: !951, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !990, file: !464, line: 270, baseType: !996, size: 64, align: 32)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !997, line: 61, baseType: !998)
!997 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !997, line: 58, size: 64, align: 32, elements: !999)
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !998, file: !997, line: 59, baseType: !956, size: 32, align: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !998, file: !997, line: 60, baseType: !956, size: 32, align: 32, offset: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !983, file: !464, line: 272, baseType: !943, size: 64, align: 64, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !983, file: !464, line: 273, baseType: !943, size: 64, align: 64, offset: 320)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !983, file: !464, line: 275, baseType: !956, size: 32, align: 32, offset: 384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !983, file: !464, line: 300, baseType: !951, size: 64, align: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !973, file: !486, line: 93, baseType: !956, size: 32, align: 32, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !973, file: !486, line: 99, baseType: !956, size: 32, align: 32, offset: 224)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !973, file: !486, line: 108, baseType: !956, size: 32, align: 32, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !973, file: !486, line: 113, baseType: !1010, size: 64, align: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!942, !942, !942}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !973, file: !486, line: 123, baseType: !1014, size: 64, align: 64, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!1017, !1017}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !973, file: !486, line: 130, baseType: !1020, size: 32, align: 32, offset: 448)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !973, file: !486, line: 136, baseType: !1022, size: 64, align: 64, offset: 512)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1020, !942}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !973, file: !486, line: 142, baseType: !1026, size: 64, align: 64, offset: 576)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!956, !1029, !942, !951, !956}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1032)
!1032 = !{!1033, !1045, !1046}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1031, file: !464, line: 360, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1044}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1037, file: !464, line: 307, baseType: !951, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1037, file: !464, line: 313, baseType: !943, size: 64, align: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1037, file: !464, line: 313, baseType: !943, size: 64, align: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1037, file: !464, line: 318, baseType: !943, size: 64, align: 64, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1037, file: !464, line: 318, baseType: !943, size: 64, align: 64, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1037, file: !464, line: 323, baseType: !956, size: 32, align: 32, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1031, file: !464, line: 364, baseType: !956, size: 32, align: 32, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1031, file: !464, line: 368, baseType: !956, size: 32, align: 32, offset: 96)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !948, file: !919, line: 670, baseType: !951, size: 64, align: 64, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !948, file: !919, line: 679, baseType: !1049, size: 64, align: 64, offset: 448)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !948, file: !919, line: 684, baseType: !956, size: 32, align: 32, offset: 512)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !948, file: !919, line: 689, baseType: !956, size: 32, align: 32, offset: 544)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !948, file: !919, line: 696, baseType: !1053, size: 64, align: 64, offset: 576)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!956, !1056}
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1059)
!1059 = !{!1060, !1061, !1064, !1065}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1058, file: !919, line: 449, baseType: !951, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1058, file: !919, line: 450, baseType: !1062, size: 64, align: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1058, file: !919, line: 451, baseType: !956, size: 32, align: 32, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1058, file: !919, line: 452, baseType: !951, size: 64, align: 64, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !948, file: !919, line: 703, baseType: !1067, size: 64, align: 64, offset: 640)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!956, !1070}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1296, !1297, !1362, !1363, !1364, !2056, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2110, !2111, !2112, !2113, !2114, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2165, !2166, !2169, !2170, !2171, !2172, !2173, !2174, !2176, !2177, !2178, !2179, !2187, !2188, !2192, !2196, !2197, !2198}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1071, file: !919, line: 1342, baseType: !970, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1071, file: !919, line: 1349, baseType: !1049, size: 64, align: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1071, file: !919, line: 1356, baseType: !1076, size: 64, align: 64, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1078)
!1078 = !{!1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1132, !1133, !1137, !1141, !1146, !1153, !1242, !1261, !1283, !1284, !1285, !1286, !1290}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1077, file: !919, line: 498, baseType: !951, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1077, file: !919, line: 504, baseType: !951, size: 64, align: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1077, file: !919, line: 505, baseType: !951, size: 64, align: 64, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1077, file: !919, line: 506, baseType: !951, size: 64, align: 64, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1077, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1077, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1077, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1077, file: !919, line: 517, baseType: !956, size: 32, align: 32, offset: 352)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1077, file: !919, line: 523, baseType: !959, size: 64, align: 64, offset: 384)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1077, file: !919, line: 526, baseType: !970, size: 64, align: 64, offset: 448)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1077, file: !919, line: 535, baseType: !1076, size: 64, align: 64, offset: 512)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1077, file: !919, line: 539, baseType: !956, size: 32, align: 32, offset: 576)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1077, file: !919, line: 541, baseType: !1067, size: 64, align: 64, offset: 640)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1077, file: !919, line: 549, baseType: !1093, size: 64, align: 64, offset: 704)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!956, !1070, !1096}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1099)
!1099 = !{!1100, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1128, !1129, !1130, !1131}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1098, file: !4, line: 1451, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1103, line: 94, baseType: !1104)
!1103 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1103, line: 81, size: 192, align: 64, elements: !1105)
!1105 = !{!1106, !1110, !1113}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1104, file: !1103, line: 82, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1103, line: 73, baseType: !1109)
!1109 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1103, line: 73, flags: DIFlagFwdDecl)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1104, file: !1103, line: 89, baseType: !1111, size: 64, align: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !940, line: 48, baseType: !1063)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1104, file: !1103, line: 93, baseType: !956, size: 32, align: 32, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1098, file: !4, line: 1461, baseType: !939, size: 64, align: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1098, file: !4, line: 1467, baseType: !939, size: 64, align: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1098, file: !4, line: 1468, baseType: !1111, size: 64, align: 64, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1098, file: !4, line: 1469, baseType: !956, size: 32, align: 32, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1098, file: !4, line: 1470, baseType: !956, size: 32, align: 32, offset: 288)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1098, file: !4, line: 1474, baseType: !956, size: 32, align: 32, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1098, file: !4, line: 1479, baseType: !1121, size: 64, align: 64, offset: 384)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1124)
!1124 = !{!1125, !1126, !1127}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1123, file: !4, line: 1412, baseType: !1111, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1123, file: !4, line: 1413, baseType: !956, size: 32, align: 32, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1123, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1098, file: !4, line: 1480, baseType: !956, size: 32, align: 32, offset: 448)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1098, file: !4, line: 1486, baseType: !939, size: 64, align: 64, offset: 512)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1098, file: !4, line: 1488, baseType: !939, size: 64, align: 64, offset: 576)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1098, file: !4, line: 1497, baseType: !939, size: 64, align: 64, offset: 640)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1077, file: !919, line: 550, baseType: !1067, size: 64, align: 64, offset: 768)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1077, file: !919, line: 554, baseType: !1134, size: 64, align: 64, offset: 832)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!956, !1070, !1096, !1096, !956}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1077, file: !919, line: 563, baseType: !1138, size: 64, align: 64, offset: 896)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!956, !3, !956}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1077, file: !919, line: 565, baseType: !1142, size: 64, align: 64, offset: 960)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{null, !1070, !956, !1145, !1145}
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1077, file: !919, line: 570, baseType: !1147, size: 64, align: 64, offset: 1024)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!956, !1070, !956, !942, !1150}
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1151, line: 216, baseType: !1152)
!1151 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1152 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1077, file: !919, line: 581, baseType: !1154, size: 64, align: 64, offset: 1088)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!956, !1070, !956, !1157, !968}
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1161)
!1161 = !{!1162, !1166, !1168, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1196, !1198, !1199, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1160, file: !548, line: 282, baseType: !1163, size: 512, align: 64)
!1163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1111, size: 512, align: 64, elements: !1164)
!1164 = !{!1165}
!1165 = !DISubrange(count: 8)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1160, file: !548, line: 299, baseType: !1167, size: 256, align: 32, offset: 512)
!1167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 256, align: 32, elements: !1164)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1160, file: !548, line: 315, baseType: !1169, size: 64, align: 64, offset: 768)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1160, file: !548, line: 326, baseType: !956, size: 32, align: 32, offset: 832)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1160, file: !548, line: 326, baseType: !956, size: 32, align: 32, offset: 864)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1160, file: !548, line: 334, baseType: !956, size: 32, align: 32, offset: 896)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1160, file: !548, line: 341, baseType: !956, size: 32, align: 32, offset: 928)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1160, file: !548, line: 346, baseType: !956, size: 32, align: 32, offset: 960)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1160, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1160, file: !548, line: 356, baseType: !996, size: 64, align: 32, offset: 1024)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1160, file: !548, line: 361, baseType: !939, size: 64, align: 64, offset: 1088)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1160, file: !548, line: 369, baseType: !939, size: 64, align: 64, offset: 1152)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1160, file: !548, line: 377, baseType: !939, size: 64, align: 64, offset: 1216)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1160, file: !548, line: 382, baseType: !956, size: 32, align: 32, offset: 1280)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1160, file: !548, line: 386, baseType: !956, size: 32, align: 32, offset: 1312)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1160, file: !548, line: 391, baseType: !956, size: 32, align: 32, offset: 1344)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1160, file: !548, line: 396, baseType: !942, size: 64, align: 64, offset: 1408)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1160, file: !548, line: 403, baseType: !1185, size: 512, align: 64, offset: 1472)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1186, size: 512, align: 64, elements: !1164)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !940, line: 55, baseType: !1152)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1160, file: !548, line: 410, baseType: !956, size: 32, align: 32, offset: 1984)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1160, file: !548, line: 415, baseType: !956, size: 32, align: 32, offset: 2016)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1160, file: !548, line: 420, baseType: !956, size: 32, align: 32, offset: 2048)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1160, file: !548, line: 425, baseType: !956, size: 32, align: 32, offset: 2080)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1160, file: !548, line: 435, baseType: !939, size: 64, align: 64, offset: 2112)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1160, file: !548, line: 440, baseType: !956, size: 32, align: 32, offset: 2176)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1160, file: !548, line: 445, baseType: !1186, size: 64, align: 64, offset: 2240)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1160, file: !548, line: 459, baseType: !1195, size: 512, align: 64, offset: 2304)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 512, align: 64, elements: !1164)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1160, file: !548, line: 473, baseType: !1197, size: 64, align: 64, offset: 2816)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1160, file: !548, line: 477, baseType: !956, size: 32, align: 32, offset: 2880)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1160, file: !548, line: 479, baseType: !1200, size: 64, align: 64, offset: 2944)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1204)
!1204 = !{!1205, !1206, !1207, !1208, !1213}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1203, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1203, file: !548, line: 203, baseType: !1111, size: 64, align: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1203, file: !548, line: 204, baseType: !956, size: 32, align: 32, offset: 128)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1203, file: !548, line: 205, baseType: !1209, size: 64, align: 64, offset: 192)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1211, line: 86, baseType: !1212)
!1211 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1212 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1211, line: 86, flags: DIFlagFwdDecl)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1203, file: !548, line: 206, baseType: !1101, size: 64, align: 64, offset: 256)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1160, file: !548, line: 480, baseType: !956, size: 32, align: 32, offset: 3008)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1160, file: !548, line: 505, baseType: !956, size: 32, align: 32, offset: 3040)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1160, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1160, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1160, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1160, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1160, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1160, file: !548, line: 532, baseType: !939, size: 64, align: 64, offset: 3264)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1160, file: !548, line: 539, baseType: !939, size: 64, align: 64, offset: 3328)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1160, file: !548, line: 547, baseType: !939, size: 64, align: 64, offset: 3392)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1160, file: !548, line: 554, baseType: !1209, size: 64, align: 64, offset: 3456)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1160, file: !548, line: 563, baseType: !956, size: 32, align: 32, offset: 3520)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1160, file: !548, line: 572, baseType: !956, size: 32, align: 32, offset: 3552)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1160, file: !548, line: 581, baseType: !956, size: 32, align: 32, offset: 3584)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1160, file: !548, line: 588, baseType: !1229, size: 64, align: 64, offset: 3648)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !940, line: 36, baseType: !1231)
!1231 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1160, file: !548, line: 593, baseType: !956, size: 32, align: 32, offset: 3712)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1160, file: !548, line: 596, baseType: !956, size: 32, align: 32, offset: 3744)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1160, file: !548, line: 599, baseType: !1101, size: 64, align: 64, offset: 3776)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1160, file: !548, line: 605, baseType: !1101, size: 64, align: 64, offset: 3840)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1160, file: !548, line: 616, baseType: !1101, size: 64, align: 64, offset: 3904)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1160, file: !548, line: 626, baseType: !1150, size: 64, align: 64, offset: 3968)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1160, file: !548, line: 627, baseType: !1150, size: 64, align: 64, offset: 4032)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1160, file: !548, line: 628, baseType: !1150, size: 64, align: 64, offset: 4096)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1160, file: !548, line: 629, baseType: !1150, size: 64, align: 64, offset: 4160)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1160, file: !548, line: 645, baseType: !1101, size: 64, align: 64, offset: 4224)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1077, file: !919, line: 587, baseType: !1243, size: 64, align: 64, offset: 1152)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!956, !1070, !1246}
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !1248, line: 460, size: 128, align: 64, elements: !1249)
!1248 = !DIFile(filename: "libavdevice/avdevice.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1249 = !{!1250, !1259, !1260}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "devices", scope: !1247, file: !1248, line: 461, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDeviceInfo", file: !1248, line: 455, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfo", file: !1248, line: 452, size: 128, align: 64, elements: !1255)
!1255 = !{!1256, !1258}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "device_name", scope: !1254, file: !1248, line: 453, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "device_description", scope: !1254, file: !1248, line: 454, baseType: !1257, size: 64, align: 64, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "nb_devices", scope: !1247, file: !1248, line: 462, baseType: !956, size: 32, align: 32, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "default_device", scope: !1247, file: !1248, line: 463, baseType: !956, size: 32, align: 32, offset: 96)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1077, file: !919, line: 592, baseType: !1262, size: 64, align: 64, offset: 1216)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!956, !1070, !1265}
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !1248, line: 400, size: 576, align: 64, elements: !1267)
!1267 = !{!1268, !1269, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1266, file: !1248, line: 401, baseType: !970, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "device_context", scope: !1266, file: !1248, line: 402, baseType: !1270, size: 64, align: 64, offset: 64)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !919, line: 1947, baseType: !1071)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1266, file: !1248, line: 403, baseType: !3, size: 32, align: 32, offset: 128)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "sample_format", scope: !1266, file: !1248, line: 404, baseType: !649, size: 32, align: 32, offset: 160)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_format", scope: !1266, file: !1248, line: 405, baseType: !666, size: 32, align: 32, offset: 192)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1266, file: !1248, line: 406, baseType: !956, size: 32, align: 32, offset: 224)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1266, file: !1248, line: 407, baseType: !956, size: 32, align: 32, offset: 256)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1266, file: !1248, line: 408, baseType: !939, size: 64, align: 64, offset: 320)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "window_width", scope: !1266, file: !1248, line: 409, baseType: !956, size: 32, align: 32, offset: 384)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "window_height", scope: !1266, file: !1248, line: 410, baseType: !956, size: 32, align: 32, offset: 416)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !1266, file: !1248, line: 411, baseType: !956, size: 32, align: 32, offset: 448)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !1266, file: !1248, line: 412, baseType: !956, size: 32, align: 32, offset: 480)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "fps", scope: !1266, file: !1248, line: 413, baseType: !996, size: 64, align: 32, offset: 512)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1077, file: !919, line: 597, baseType: !1262, size: 64, align: 64, offset: 1280)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1077, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1077, file: !919, line: 608, baseType: !1067, size: 64, align: 64, offset: 1408)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1077, file: !919, line: 617, baseType: !1287, size: 64, align: 64, offset: 1472)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{null, !1070}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1077, file: !919, line: 623, baseType: !1291, size: 64, align: 64, offset: 1536)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!956, !1070, !1294}
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1097)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1071, file: !919, line: 1365, baseType: !942, size: 64, align: 64, offset: 192)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1071, file: !919, line: 1379, baseType: !1298, size: 64, align: 64, offset: 256)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !866, line: 352, baseType: !1300)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !866, line: 161, size: 2112, align: 64, elements: !1301)
!1301 = !{!1302, !1303, !1304, !1305, !1306, !1307, !1308, !1312, !1313, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1329, !1330, !1334, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1352, !1353, !1354, !1355, !1359, !1360, !1361}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1300, file: !866, line: 174, baseType: !970, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1300, file: !866, line: 226, baseType: !1062, size: 64, align: 64, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1300, file: !866, line: 227, baseType: !956, size: 32, align: 32, offset: 128)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1300, file: !866, line: 228, baseType: !1062, size: 64, align: 64, offset: 192)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1300, file: !866, line: 229, baseType: !1062, size: 64, align: 64, offset: 256)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1300, file: !866, line: 233, baseType: !942, size: 64, align: 64, offset: 320)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1300, file: !866, line: 235, baseType: !1309, size: 64, align: 64, offset: 384)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!956, !942, !1111, !956}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1300, file: !866, line: 236, baseType: !1309, size: 64, align: 64, offset: 448)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1300, file: !866, line: 237, baseType: !1314, size: 64, align: 64, offset: 512)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{!939, !942, !939, !956}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1300, file: !866, line: 238, baseType: !939, size: 64, align: 64, offset: 576)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1300, file: !866, line: 239, baseType: !956, size: 32, align: 32, offset: 640)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1300, file: !866, line: 240, baseType: !956, size: 32, align: 32, offset: 672)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1300, file: !866, line: 241, baseType: !956, size: 32, align: 32, offset: 704)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1300, file: !866, line: 242, baseType: !1152, size: 64, align: 64, offset: 768)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1300, file: !866, line: 243, baseType: !1062, size: 64, align: 64, offset: 832)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1300, file: !866, line: 244, baseType: !1324, size: 64, align: 64, offset: 896)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!1152, !1152, !1327, !968}
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1112)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1300, file: !866, line: 245, baseType: !956, size: 32, align: 32, offset: 960)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1300, file: !866, line: 249, baseType: !1331, size: 64, align: 64, offset: 1024)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!956, !942, !956}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1300, file: !866, line: 255, baseType: !1335, size: 64, align: 64, offset: 1088)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DISubroutineType(types: !1337)
!1337 = !{!939, !942, !956, !939, !956}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1300, file: !866, line: 260, baseType: !956, size: 32, align: 32, offset: 1152)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1300, file: !866, line: 266, baseType: !939, size: 64, align: 64, offset: 1216)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1300, file: !866, line: 273, baseType: !956, size: 32, align: 32, offset: 1280)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1300, file: !866, line: 279, baseType: !939, size: 64, align: 64, offset: 1344)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1300, file: !866, line: 285, baseType: !956, size: 32, align: 32, offset: 1408)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1300, file: !866, line: 291, baseType: !956, size: 32, align: 32, offset: 1440)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1300, file: !866, line: 298, baseType: !956, size: 32, align: 32, offset: 1472)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1300, file: !866, line: 304, baseType: !956, size: 32, align: 32, offset: 1504)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1300, file: !866, line: 309, baseType: !951, size: 64, align: 64, offset: 1536)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1300, file: !866, line: 314, baseType: !951, size: 64, align: 64, offset: 1600)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1300, file: !866, line: 319, baseType: !1349, size: 64, align: 64, offset: 1664)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!956, !942, !1111, !956, !865, !939}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1300, file: !866, line: 326, baseType: !956, size: 32, align: 32, offset: 1728)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1300, file: !866, line: 331, baseType: !865, size: 32, align: 32, offset: 1760)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1300, file: !866, line: 332, baseType: !939, size: 64, align: 64, offset: 1792)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1300, file: !866, line: 338, baseType: !1356, size: 64, align: 64, offset: 1856)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!956, !942}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1300, file: !866, line: 340, baseType: !939, size: 64, align: 64, offset: 1920)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1300, file: !866, line: 346, baseType: !1062, size: 64, align: 64, offset: 1984)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1300, file: !866, line: 351, baseType: !956, size: 32, align: 32, offset: 2048)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1071, file: !919, line: 1386, baseType: !956, size: 32, align: 32, offset: 320)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1071, file: !919, line: 1393, baseType: !968, size: 32, align: 32, offset: 352)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1071, file: !919, line: 1405, baseType: !1365, size: 64, align: 64, offset: 384)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1368)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1369)
!1369 = !{!1370, !1371, !1372, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1842, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1942, !1948, !1949, !1953, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1985, !1986, !1987, !1988, !1989, !1990}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1368, file: !919, line: 866, baseType: !956, size: 32, align: 32)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1368, file: !919, line: 872, baseType: !956, size: 32, align: 32, offset: 32)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1368, file: !919, line: 878, baseType: !1373, size: 64, align: 64, offset: 64)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1375)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1376)
!1376 = !{!1377, !1378, !1379, !1380, !1517, !1518, !1519, !1520, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1546, !1550, !1551, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1730, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1375, file: !4, line: 1561, baseType: !970, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1375, file: !4, line: 1562, baseType: !956, size: 32, align: 32, offset: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1375, file: !4, line: 1564, baseType: !874, size: 32, align: 32, offset: 96)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1375, file: !4, line: 1565, baseType: !1381, size: 64, align: 64, offset: 128)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1383)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1384)
!1384 = !{!1385, !1386, !1387, !1388, !1389, !1390, !1393, !1396, !1399, !1402, !1405, !1406, !1407, !1415, !1416, !1417, !1419, !1423, !1429, !1434, !1438, !1439, !1482, !1489, !1493, !1494, !1498, !1502, !1506, !1510, !1511, !1512}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1383, file: !4, line: 3475, baseType: !951, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1383, file: !4, line: 3480, baseType: !951, size: 64, align: 64, offset: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1383, file: !4, line: 3481, baseType: !874, size: 32, align: 32, offset: 128)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1383, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1383, file: !4, line: 3487, baseType: !956, size: 32, align: 32, offset: 192)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1383, file: !4, line: 3488, baseType: !1391, size: 64, align: 64, offset: 256)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1383, file: !4, line: 3489, baseType: !1394, size: 64, align: 64, offset: 320)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !666)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1383, file: !4, line: 3490, baseType: !1397, size: 64, align: 64, offset: 384)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1383, file: !4, line: 3491, baseType: !1400, size: 64, align: 64, offset: 448)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1383, file: !4, line: 3492, baseType: !1403, size: 64, align: 64, offset: 512)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1186)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1383, file: !4, line: 3493, baseType: !1112, size: 8, align: 8, offset: 576)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1383, file: !4, line: 3494, baseType: !970, size: 64, align: 64, offset: 640)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1383, file: !4, line: 3495, baseType: !1408, size: 64, align: 64, offset: 704)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1410)
!1410 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1411)
!1411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1412)
!1412 = !{!1413, !1414}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1411, file: !4, line: 3402, baseType: !956, size: 32, align: 32)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1411, file: !4, line: 3403, baseType: !951, size: 64, align: 64, offset: 64)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1383, file: !4, line: 3507, baseType: !951, size: 64, align: 64, offset: 768)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1383, file: !4, line: 3516, baseType: !956, size: 32, align: 32, offset: 832)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1383, file: !4, line: 3517, baseType: !1418, size: 64, align: 64, offset: 896)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1383, file: !4, line: 3527, baseType: !1420, size: 64, align: 64, offset: 960)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DISubroutineType(types: !1422)
!1422 = !{!956, !1373}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1383, file: !4, line: 3535, baseType: !1424, size: 64, align: 64, offset: 1024)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DISubroutineType(types: !1426)
!1426 = !{!956, !1373, !1427}
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1374)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1383, file: !4, line: 3541, baseType: !1430, size: 64, align: 64, offset: 1088)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1432)
!1432 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1433)
!1433 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1383, file: !4, line: 3549, baseType: !1435, size: 64, align: 64, offset: 1152)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{null, !1418}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1383, file: !4, line: 3551, baseType: !1420, size: 64, align: 64, offset: 1216)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1383, file: !4, line: 3552, baseType: !1440, size: 64, align: 64, offset: 1280)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{!956, !1373, !1111, !956, !1443}
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1445)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1446)
!1446 = !{!1447, !1450, !1452, !1453, !1454, !1481}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1445, file: !4, line: 3921, baseType: !1448, size: 16, align: 16)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !940, line: 49, baseType: !1449)
!1449 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1445, file: !4, line: 3922, baseType: !1451, size: 32, align: 32, offset: 32)
!1451 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !940, line: 51, baseType: !968)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1445, file: !4, line: 3923, baseType: !1451, size: 32, align: 32, offset: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1445, file: !4, line: 3924, baseType: !968, size: 32, align: 32, offset: 96)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1445, file: !4, line: 3925, baseType: !1455, size: 64, align: 64, offset: 128)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1458)
!1458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1459)
!1459 = !{!1460, !1461, !1462, !1463, !1464, !1465, !1471, !1475, !1477, !1478, !1479, !1480}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1458, file: !4, line: 3886, baseType: !956, size: 32, align: 32)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1458, file: !4, line: 3887, baseType: !956, size: 32, align: 32, offset: 32)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1458, file: !4, line: 3888, baseType: !956, size: 32, align: 32, offset: 64)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1458, file: !4, line: 3889, baseType: !956, size: 32, align: 32, offset: 96)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1458, file: !4, line: 3890, baseType: !956, size: 32, align: 32, offset: 128)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1458, file: !4, line: 3897, baseType: !1466, size: 768, align: 64, offset: 192)
!1466 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1467)
!1467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1468)
!1468 = !{!1469, !1470}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1467, file: !4, line: 3855, baseType: !1163, size: 512, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1467, file: !4, line: 3857, baseType: !1167, size: 256, align: 32, offset: 512)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1458, file: !4, line: 3903, baseType: !1472, size: 256, align: 64, offset: 960)
!1472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1111, size: 256, align: 64, elements: !1473)
!1473 = !{!1474}
!1474 = !DISubrange(count: 4)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1458, file: !4, line: 3904, baseType: !1476, size: 128, align: 32, offset: 1216)
!1476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 128, align: 32, elements: !1473)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1458, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1458, file: !4, line: 3908, baseType: !1257, size: 64, align: 64, offset: 1408)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1458, file: !4, line: 3915, baseType: !1257, size: 64, align: 64, offset: 1472)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1458, file: !4, line: 3917, baseType: !956, size: 32, align: 32, offset: 1536)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1445, file: !4, line: 3926, baseType: !939, size: 64, align: 64, offset: 192)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1383, file: !4, line: 3564, baseType: !1483, size: 64, align: 64, offset: 1344)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DISubroutineType(types: !1485)
!1485 = !{!956, !1373, !1096, !1486, !1488}
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1159)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1383, file: !4, line: 3566, baseType: !1490, size: 64, align: 64, offset: 1408)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{!956, !1373, !942, !1488, !1096}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1383, file: !4, line: 3567, baseType: !1420, size: 64, align: 64, offset: 1472)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1383, file: !4, line: 3576, baseType: !1495, size: 64, align: 64, offset: 1536)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!956, !1373, !1486}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1383, file: !4, line: 3577, baseType: !1499, size: 64, align: 64, offset: 1600)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DISubroutineType(types: !1501)
!1501 = !{!956, !1373, !1096}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1383, file: !4, line: 3584, baseType: !1503, size: 64, align: 64, offset: 1664)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DISubroutineType(types: !1505)
!1505 = !{!956, !1373, !1158}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1383, file: !4, line: 3589, baseType: !1507, size: 64, align: 64, offset: 1728)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{null, !1373}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1383, file: !4, line: 3594, baseType: !956, size: 32, align: 32, offset: 1792)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1383, file: !4, line: 3600, baseType: !951, size: 64, align: 64, offset: 1856)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1383, file: !4, line: 3609, baseType: !1513, size: 64, align: 64, offset: 1920)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1516)
!1516 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1375, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1375, file: !4, line: 1581, baseType: !968, size: 32, align: 32, offset: 224)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1375, file: !4, line: 1583, baseType: !942, size: 64, align: 64, offset: 256)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1375, file: !4, line: 1591, baseType: !1521, size: 64, align: 64, offset: 320)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1375, file: !4, line: 1598, baseType: !942, size: 64, align: 64, offset: 384)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1375, file: !4, line: 1606, baseType: !939, size: 64, align: 64, offset: 448)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1375, file: !4, line: 1614, baseType: !956, size: 32, align: 32, offset: 512)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1375, file: !4, line: 1622, baseType: !956, size: 32, align: 32, offset: 544)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1375, file: !4, line: 1628, baseType: !956, size: 32, align: 32, offset: 576)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1375, file: !4, line: 1636, baseType: !956, size: 32, align: 32, offset: 608)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1375, file: !4, line: 1643, baseType: !956, size: 32, align: 32, offset: 640)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1375, file: !4, line: 1657, baseType: !1111, size: 64, align: 64, offset: 704)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1375, file: !4, line: 1658, baseType: !956, size: 32, align: 32, offset: 768)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1375, file: !4, line: 1679, baseType: !996, size: 64, align: 32, offset: 800)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1375, file: !4, line: 1688, baseType: !956, size: 32, align: 32, offset: 864)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1375, file: !4, line: 1712, baseType: !956, size: 32, align: 32, offset: 896)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1375, file: !4, line: 1729, baseType: !956, size: 32, align: 32, offset: 928)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1375, file: !4, line: 1729, baseType: !956, size: 32, align: 32, offset: 960)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1375, file: !4, line: 1744, baseType: !956, size: 32, align: 32, offset: 992)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1375, file: !4, line: 1744, baseType: !956, size: 32, align: 32, offset: 1024)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1375, file: !4, line: 1751, baseType: !956, size: 32, align: 32, offset: 1056)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1375, file: !4, line: 1766, baseType: !666, size: 32, align: 32, offset: 1088)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1375, file: !4, line: 1791, baseType: !1542, size: 64, align: 64, offset: 1152)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DISubroutineType(types: !1544)
!1544 = !{null, !1545, !1486, !1488, !956, !956, !956}
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1375, file: !4, line: 1808, baseType: !1547, size: 64, align: 64, offset: 1216)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DISubroutineType(types: !1549)
!1549 = !{!666, !1545, !1394}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1375, file: !4, line: 1816, baseType: !956, size: 32, align: 32, offset: 1280)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1375, file: !4, line: 1825, baseType: !1552, size: 32, align: 32, offset: 1312)
!1552 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1375, file: !4, line: 1830, baseType: !956, size: 32, align: 32, offset: 1344)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1375, file: !4, line: 1838, baseType: !1552, size: 32, align: 32, offset: 1376)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1375, file: !4, line: 1846, baseType: !956, size: 32, align: 32, offset: 1408)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1375, file: !4, line: 1851, baseType: !956, size: 32, align: 32, offset: 1440)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1375, file: !4, line: 1861, baseType: !1552, size: 32, align: 32, offset: 1472)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1375, file: !4, line: 1868, baseType: !1552, size: 32, align: 32, offset: 1504)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1375, file: !4, line: 1875, baseType: !1552, size: 32, align: 32, offset: 1536)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1375, file: !4, line: 1882, baseType: !1552, size: 32, align: 32, offset: 1568)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1375, file: !4, line: 1889, baseType: !1552, size: 32, align: 32, offset: 1600)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1375, file: !4, line: 1896, baseType: !1552, size: 32, align: 32, offset: 1632)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1375, file: !4, line: 1903, baseType: !1552, size: 32, align: 32, offset: 1664)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1375, file: !4, line: 1910, baseType: !956, size: 32, align: 32, offset: 1696)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1375, file: !4, line: 1915, baseType: !956, size: 32, align: 32, offset: 1728)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1375, file: !4, line: 1926, baseType: !1488, size: 64, align: 64, offset: 1792)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1375, file: !4, line: 1935, baseType: !996, size: 64, align: 32, offset: 1856)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1375, file: !4, line: 1942, baseType: !956, size: 32, align: 32, offset: 1920)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1375, file: !4, line: 1948, baseType: !956, size: 32, align: 32, offset: 1952)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1375, file: !4, line: 1954, baseType: !956, size: 32, align: 32, offset: 1984)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1375, file: !4, line: 1960, baseType: !956, size: 32, align: 32, offset: 2016)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1375, file: !4, line: 1984, baseType: !956, size: 32, align: 32, offset: 2048)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1375, file: !4, line: 1991, baseType: !956, size: 32, align: 32, offset: 2080)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1375, file: !4, line: 1996, baseType: !956, size: 32, align: 32, offset: 2112)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1375, file: !4, line: 2004, baseType: !956, size: 32, align: 32, offset: 2144)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1375, file: !4, line: 2011, baseType: !956, size: 32, align: 32, offset: 2176)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1375, file: !4, line: 2018, baseType: !956, size: 32, align: 32, offset: 2208)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1375, file: !4, line: 2027, baseType: !956, size: 32, align: 32, offset: 2240)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1375, file: !4, line: 2034, baseType: !956, size: 32, align: 32, offset: 2272)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1375, file: !4, line: 2044, baseType: !956, size: 32, align: 32, offset: 2304)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1375, file: !4, line: 2054, baseType: !1582, size: 64, align: 64, offset: 2368)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1375, file: !4, line: 2061, baseType: !1582, size: 64, align: 64, offset: 2432)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1375, file: !4, line: 2066, baseType: !956, size: 32, align: 32, offset: 2496)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1375, file: !4, line: 2070, baseType: !956, size: 32, align: 32, offset: 2528)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1375, file: !4, line: 2078, baseType: !956, size: 32, align: 32, offset: 2560)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1375, file: !4, line: 2085, baseType: !956, size: 32, align: 32, offset: 2592)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1375, file: !4, line: 2092, baseType: !956, size: 32, align: 32, offset: 2624)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1375, file: !4, line: 2099, baseType: !956, size: 32, align: 32, offset: 2656)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1375, file: !4, line: 2106, baseType: !956, size: 32, align: 32, offset: 2688)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1375, file: !4, line: 2113, baseType: !956, size: 32, align: 32, offset: 2720)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1375, file: !4, line: 2120, baseType: !956, size: 32, align: 32, offset: 2752)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1375, file: !4, line: 2125, baseType: !956, size: 32, align: 32, offset: 2784)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1375, file: !4, line: 2133, baseType: !956, size: 32, align: 32, offset: 2816)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1375, file: !4, line: 2140, baseType: !956, size: 32, align: 32, offset: 2848)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1375, file: !4, line: 2145, baseType: !956, size: 32, align: 32, offset: 2880)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1375, file: !4, line: 2153, baseType: !956, size: 32, align: 32, offset: 2912)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1375, file: !4, line: 2158, baseType: !956, size: 32, align: 32, offset: 2944)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1375, file: !4, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1375, file: !4, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1375, file: !4, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1375, file: !4, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1375, file: !4, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1375, file: !4, line: 2203, baseType: !956, size: 32, align: 32, offset: 3136)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1375, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1375, file: !4, line: 2212, baseType: !956, size: 32, align: 32, offset: 3200)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1375, file: !4, line: 2213, baseType: !956, size: 32, align: 32, offset: 3232)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1375, file: !4, line: 2220, baseType: !649, size: 32, align: 32, offset: 3264)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1375, file: !4, line: 2232, baseType: !956, size: 32, align: 32, offset: 3296)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1375, file: !4, line: 2243, baseType: !956, size: 32, align: 32, offset: 3328)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1375, file: !4, line: 2249, baseType: !956, size: 32, align: 32, offset: 3360)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1375, file: !4, line: 2256, baseType: !956, size: 32, align: 32, offset: 3392)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1375, file: !4, line: 2263, baseType: !1186, size: 64, align: 64, offset: 3456)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1375, file: !4, line: 2270, baseType: !1186, size: 64, align: 64, offset: 3520)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1375, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1375, file: !4, line: 2285, baseType: !649, size: 32, align: 32, offset: 3616)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1375, file: !4, line: 2367, baseType: !1618, size: 64, align: 64, offset: 3648)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DISubroutineType(types: !1620)
!1620 = !{!956, !1545, !1158, !956}
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1375, file: !4, line: 2383, baseType: !956, size: 32, align: 32, offset: 3712)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1375, file: !4, line: 2386, baseType: !1552, size: 32, align: 32, offset: 3744)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1375, file: !4, line: 2387, baseType: !1552, size: 32, align: 32, offset: 3776)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1375, file: !4, line: 2394, baseType: !956, size: 32, align: 32, offset: 3808)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1375, file: !4, line: 2401, baseType: !956, size: 32, align: 32, offset: 3840)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1375, file: !4, line: 2408, baseType: !956, size: 32, align: 32, offset: 3872)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1375, file: !4, line: 2415, baseType: !956, size: 32, align: 32, offset: 3904)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1375, file: !4, line: 2422, baseType: !956, size: 32, align: 32, offset: 3936)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1375, file: !4, line: 2423, baseType: !1630, size: 64, align: 64, offset: 3968)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1632)
!1632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1633)
!1633 = !{!1634, !1635, !1636, !1637}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1632, file: !4, line: 827, baseType: !956, size: 32, align: 32)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1632, file: !4, line: 828, baseType: !956, size: 32, align: 32, offset: 32)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1632, file: !4, line: 829, baseType: !956, size: 32, align: 32, offset: 64)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1632, file: !4, line: 830, baseType: !1552, size: 32, align: 32, offset: 96)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1375, file: !4, line: 2430, baseType: !939, size: 64, align: 64, offset: 4032)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1375, file: !4, line: 2437, baseType: !939, size: 64, align: 64, offset: 4096)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1375, file: !4, line: 2444, baseType: !1552, size: 32, align: 32, offset: 4160)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1375, file: !4, line: 2451, baseType: !1552, size: 32, align: 32, offset: 4192)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1375, file: !4, line: 2458, baseType: !956, size: 32, align: 32, offset: 4224)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1375, file: !4, line: 2469, baseType: !956, size: 32, align: 32, offset: 4256)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1375, file: !4, line: 2475, baseType: !956, size: 32, align: 32, offset: 4288)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1375, file: !4, line: 2481, baseType: !956, size: 32, align: 32, offset: 4320)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1375, file: !4, line: 2485, baseType: !956, size: 32, align: 32, offset: 4352)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1375, file: !4, line: 2489, baseType: !956, size: 32, align: 32, offset: 4384)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1375, file: !4, line: 2493, baseType: !956, size: 32, align: 32, offset: 4416)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1375, file: !4, line: 2501, baseType: !956, size: 32, align: 32, offset: 4448)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1375, file: !4, line: 2506, baseType: !956, size: 32, align: 32, offset: 4480)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1375, file: !4, line: 2510, baseType: !956, size: 32, align: 32, offset: 4512)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1375, file: !4, line: 2514, baseType: !939, size: 64, align: 64, offset: 4544)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1375, file: !4, line: 2528, baseType: !1654, size: 64, align: 64, offset: 4608)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{null, !1545, !942, !956, !956}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1375, file: !4, line: 2534, baseType: !956, size: 32, align: 32, offset: 4672)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1375, file: !4, line: 2545, baseType: !956, size: 32, align: 32, offset: 4704)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1375, file: !4, line: 2547, baseType: !956, size: 32, align: 32, offset: 4736)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1375, file: !4, line: 2549, baseType: !956, size: 32, align: 32, offset: 4768)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1375, file: !4, line: 2551, baseType: !956, size: 32, align: 32, offset: 4800)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1375, file: !4, line: 2553, baseType: !956, size: 32, align: 32, offset: 4832)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1375, file: !4, line: 2555, baseType: !956, size: 32, align: 32, offset: 4864)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1375, file: !4, line: 2557, baseType: !956, size: 32, align: 32, offset: 4896)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1375, file: !4, line: 2559, baseType: !956, size: 32, align: 32, offset: 4928)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1375, file: !4, line: 2563, baseType: !956, size: 32, align: 32, offset: 4960)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1375, file: !4, line: 2571, baseType: !1257, size: 64, align: 64, offset: 4992)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1375, file: !4, line: 2579, baseType: !1257, size: 64, align: 64, offset: 5056)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1375, file: !4, line: 2586, baseType: !956, size: 32, align: 32, offset: 5120)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1375, file: !4, line: 2615, baseType: !956, size: 32, align: 32, offset: 5152)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1375, file: !4, line: 2627, baseType: !956, size: 32, align: 32, offset: 5184)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1375, file: !4, line: 2637, baseType: !956, size: 32, align: 32, offset: 5216)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1375, file: !4, line: 2681, baseType: !956, size: 32, align: 32, offset: 5248)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1375, file: !4, line: 2709, baseType: !939, size: 64, align: 64, offset: 5312)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1375, file: !4, line: 2716, baseType: !1676, size: 64, align: 64, offset: 5376)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1678)
!1678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1679)
!1679 = !{!1680, !1681, !1682, !1683, !1684, !1685, !1686, !1690, !1694, !1695, !1696, !1697, !1703, !1704, !1705, !1706, !1707}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1678, file: !4, line: 3642, baseType: !951, size: 64, align: 64)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1678, file: !4, line: 3649, baseType: !874, size: 32, align: 32, offset: 64)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1678, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1678, file: !4, line: 3663, baseType: !666, size: 32, align: 32, offset: 128)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1678, file: !4, line: 3669, baseType: !956, size: 32, align: 32, offset: 160)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1678, file: !4, line: 3682, baseType: !1503, size: 64, align: 64, offset: 192)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1678, file: !4, line: 3698, baseType: !1687, size: 64, align: 64, offset: 256)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DISubroutineType(types: !1689)
!1689 = !{!956, !1373, !1327, !1451}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1678, file: !4, line: 3712, baseType: !1691, size: 64, align: 64, offset: 320)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DISubroutineType(types: !1693)
!1693 = !{!956, !1373, !956, !1327, !1451}
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1678, file: !4, line: 3726, baseType: !1687, size: 64, align: 64, offset: 384)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1678, file: !4, line: 3737, baseType: !1420, size: 64, align: 64, offset: 448)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1678, file: !4, line: 3746, baseType: !956, size: 32, align: 32, offset: 512)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1678, file: !4, line: 3757, baseType: !1698, size: 64, align: 64, offset: 576)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DISubroutineType(types: !1700)
!1700 = !{null, !1701}
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1678, file: !4, line: 3766, baseType: !1420, size: 64, align: 64, offset: 640)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1678, file: !4, line: 3774, baseType: !1420, size: 64, align: 64, offset: 704)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1678, file: !4, line: 3780, baseType: !956, size: 32, align: 32, offset: 768)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1678, file: !4, line: 3785, baseType: !956, size: 32, align: 32, offset: 800)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1678, file: !4, line: 3795, baseType: !1708, size: 64, align: 64, offset: 832)
