; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--wvdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--wvdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProbeData = type { i8*, i8*, i32, i8* }

!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "WV_FLAGS", file: !917, line: 31, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavformat/wvdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !{!919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930}
!919 = !DIEnumerator(name: "WV_MONO", value: 4)
!920 = !DIEnumerator(name: "WV_HYBRID", value: 8)
!921 = !DIEnumerator(name: "WV_JOINT", value: 16)
!922 = !DIEnumerator(name: "WV_CROSSD", value: 32)
!923 = !DIEnumerator(name: "WV_HSHAPE", value: 64)
!924 = !DIEnumerator(name: "WV_FLOAT", value: 128)
!925 = !DIEnumerator(name: "WV_INT32", value: 256)
!926 = !DIEnumerator(name: "WV_HBR", value: 512)
!927 = !DIEnumerator(name: "WV_HBAL", value: 1024)
!928 = !DIEnumerator(name: "WV_MCINIT", value: 2048)
!929 = !DIEnumerator(name: "WV_MCEND", value: 4096)
!930 = !DIEnumerator(name: "WV_DSD", value: -2147483648)
!931 = !{!932, !940, !941, !948}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !935, line: 221, size: 32, align: 8, elements: !936)
!935 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!936 = !{!937}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !934, file: !935, line: 221, baseType: !938, size: 32, align: 32)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !939, line: 51, baseType: !940)
!939 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!940 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !935, line: 222, size: 16, align: 8, elements: !944)
!944 = !{!945}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !943, file: !935, line: 222, baseType: !946, size: 16, align: 16)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !939, line: 49, baseType: !947)
!947 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!948 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!949 = !{!950, !2162}
!950 = distinct !DIGlobalVariable(name: "ff_wv_demuxer", scope: !0, file: !917, line: 326, type: !951, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_wv_demuxer)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !897, line: 777, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !953)
!953 = !{!954, !958, !959, !960, !961, !971, !1013, !1014, !1016, !1017, !1018, !1032, !2143, !2144, !2145, !2149, !2153, !2154, !2155, !2159, !2160, !2161}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !952, file: !897, line: 638, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !952, file: !897, line: 645, baseType: !955, size: 64, align: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !952, file: !897, line: 652, baseType: !948, size: 32, align: 32, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !952, file: !897, line: 659, baseType: !955, size: 64, align: 64, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !952, file: !897, line: 661, baseType: !962, size: 64, align: 64, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !967, line: 44, size: 64, align: 32, elements: !968)
!967 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!968 = !{!969, !970}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !966, file: !967, line: 45, baseType: !3, size: 32, align: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !966, file: !967, line: 46, baseType: !940, size: 32, align: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !952, file: !897, line: 663, baseType: !972, size: 64, align: 64, offset: 320)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !976)
!976 = !{!977, !978, !983, !987, !988, !989, !990, !994, !1000, !1002, !1006}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !975, file: !464, line: 72, baseType: !955, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !975, file: !464, line: 78, baseType: !979, size: 64, align: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!955, !982}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !975, file: !464, line: 85, baseType: !984, size: 64, align: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !975, file: !464, line: 93, baseType: !948, size: 32, align: 32, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !975, file: !464, line: 99, baseType: !948, size: 32, align: 32, offset: 224)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !975, file: !464, line: 108, baseType: !948, size: 32, align: 32, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !975, file: !464, line: 113, baseType: !991, size: 64, align: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!982, !982, !982}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !975, file: !464, line: 123, baseType: !995, size: 64, align: 64, offset: 384)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!998, !998}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !975, file: !464, line: 130, baseType: !1001, size: 32, align: 32, offset: 448)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !975, file: !464, line: 136, baseType: !1003, size: 64, align: 64, offset: 512)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!1001, !982}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !975, file: !464, line: 142, baseType: !1007, size: 64, align: 64, offset: 576)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!948, !1010, !982, !955, !948}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !952, file: !897, line: 670, baseType: !955, size: 64, align: 64, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !952, file: !897, line: 679, baseType: !1015, size: 64, align: 64, offset: 448)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !952, file: !897, line: 684, baseType: !948, size: 32, align: 32, offset: 512)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !952, file: !897, line: 689, baseType: !948, size: 32, align: 32, offset: 544)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !952, file: !897, line: 696, baseType: !1019, size: 64, align: 64, offset: 576)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!948, !1022}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1025)
!1025 = !{!1026, !1027, !1030, !1031}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1024, file: !897, line: 449, baseType: !955, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1024, file: !897, line: 450, baseType: !1028, size: 64, align: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1024, file: !897, line: 451, baseType: !948, size: 32, align: 32, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1024, file: !897, line: 452, baseType: !955, size: 64, align: 64, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !952, file: !897, line: 703, baseType: !1033, size: 64, align: 64, offset: 640)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!948, !1036}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1241, !1242, !1307, !1308, !1309, !2000, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2054, !2055, !2056, !2057, !2058, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2109, !2110, !2113, !2114, !2115, !2116, !2117, !2118, !2120, !2121, !2122, !2123, !2131, !2132, !2136, !2140, !2141, !2142}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1037, file: !897, line: 1342, baseType: !972, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1037, file: !897, line: 1349, baseType: !1015, size: 64, align: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1037, file: !897, line: 1356, baseType: !1042, size: 64, align: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1100, !1101, !1105, !1109, !1114, !1121, !1216, !1222, !1228, !1229, !1230, !1231, !1235}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1043, file: !897, line: 498, baseType: !955, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1043, file: !897, line: 504, baseType: !955, size: 64, align: 64, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1043, file: !897, line: 505, baseType: !955, size: 64, align: 64, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1043, file: !897, line: 506, baseType: !955, size: 64, align: 64, offset: 192)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1043, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1043, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1043, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1043, file: !897, line: 517, baseType: !948, size: 32, align: 32, offset: 352)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1043, file: !897, line: 523, baseType: !962, size: 64, align: 64, offset: 384)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1043, file: !897, line: 526, baseType: !972, size: 64, align: 64, offset: 448)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1043, file: !897, line: 535, baseType: !1042, size: 64, align: 64, offset: 512)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1043, file: !897, line: 539, baseType: !948, size: 32, align: 32, offset: 576)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1043, file: !897, line: 541, baseType: !1033, size: 64, align: 64, offset: 640)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1043, file: !897, line: 549, baseType: !1059, size: 64, align: 64, offset: 704)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!948, !1036, !1062}
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1065)
!1065 = !{!1066, !1080, !1083, !1084, !1085, !1086, !1087, !1088, !1096, !1097, !1098, !1099}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1064, file: !4, line: 1451, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1069, line: 94, baseType: !1070)
!1069 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1069, line: 81, size: 192, align: 64, elements: !1071)
!1071 = !{!1072, !1076, !1079}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1070, file: !1069, line: 82, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1069, line: 73, baseType: !1075)
!1075 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1069, line: 73, flags: DIFlagFwdDecl)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1070, file: !1069, line: 89, baseType: !1077, size: 64, align: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !939, line: 48, baseType: !1029)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1070, file: !1069, line: 93, baseType: !948, size: 32, align: 32, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1064, file: !4, line: 1461, baseType: !1081, size: 64, align: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !939, line: 40, baseType: !1082)
!1082 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1064, file: !4, line: 1467, baseType: !1081, size: 64, align: 64, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1064, file: !4, line: 1468, baseType: !1077, size: 64, align: 64, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1064, file: !4, line: 1469, baseType: !948, size: 32, align: 32, offset: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1064, file: !4, line: 1470, baseType: !948, size: 32, align: 32, offset: 288)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1064, file: !4, line: 1474, baseType: !948, size: 32, align: 32, offset: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1064, file: !4, line: 1479, baseType: !1089, size: 64, align: 64, offset: 384)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1092)
!1092 = !{!1093, !1094, !1095}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1091, file: !4, line: 1412, baseType: !1077, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1091, file: !4, line: 1413, baseType: !948, size: 32, align: 32, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1091, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1064, file: !4, line: 1480, baseType: !948, size: 32, align: 32, offset: 448)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1064, file: !4, line: 1486, baseType: !1081, size: 64, align: 64, offset: 512)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1064, file: !4, line: 1488, baseType: !1081, size: 64, align: 64, offset: 576)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1064, file: !4, line: 1497, baseType: !1081, size: 64, align: 64, offset: 640)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1043, file: !897, line: 550, baseType: !1033, size: 64, align: 64, offset: 768)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1043, file: !897, line: 554, baseType: !1102, size: 64, align: 64, offset: 832)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!948, !1036, !1062, !1062, !948}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1043, file: !897, line: 563, baseType: !1106, size: 64, align: 64, offset: 896)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!948, !3, !948}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1043, file: !897, line: 565, baseType: !1110, size: 64, align: 64, offset: 960)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{null, !1036, !948, !1113, !1113}
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1043, file: !897, line: 570, baseType: !1115, size: 64, align: 64, offset: 1024)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!948, !1036, !948, !982, !1118}
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1119, line: 216, baseType: !1120)
!1119 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1120 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1043, file: !897, line: 581, baseType: !1122, size: 64, align: 64, offset: 1088)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!948, !1036, !948, !1125, !940}
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1129)
!1129 = !{!1130, !1134, !1136, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1170, !1172, !1173, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1128, file: !526, line: 282, baseType: !1131, size: 512, align: 64)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1077, size: 512, align: 64, elements: !1132)
!1132 = !{!1133}
!1133 = !DISubrange(count: 8)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1128, file: !526, line: 299, baseType: !1135, size: 256, align: 32, offset: 512)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 256, align: 32, elements: !1132)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1128, file: !526, line: 315, baseType: !1137, size: 64, align: 64, offset: 768)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1128, file: !526, line: 326, baseType: !948, size: 32, align: 32, offset: 832)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1128, file: !526, line: 326, baseType: !948, size: 32, align: 32, offset: 864)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1128, file: !526, line: 334, baseType: !948, size: 32, align: 32, offset: 896)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1128, file: !526, line: 341, baseType: !948, size: 32, align: 32, offset: 928)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1128, file: !526, line: 346, baseType: !948, size: 32, align: 32, offset: 960)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1128, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1128, file: !526, line: 356, baseType: !1145, size: 64, align: 32, offset: 1024)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1146, line: 61, baseType: !1147)
!1146 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1146, line: 58, size: 64, align: 32, elements: !1148)
!1148 = !{!1149, !1150}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1147, file: !1146, line: 59, baseType: !948, size: 32, align: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1147, file: !1146, line: 60, baseType: !948, size: 32, align: 32, offset: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1128, file: !526, line: 361, baseType: !1081, size: 64, align: 64, offset: 1088)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1128, file: !526, line: 369, baseType: !1081, size: 64, align: 64, offset: 1152)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1128, file: !526, line: 377, baseType: !1081, size: 64, align: 64, offset: 1216)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1128, file: !526, line: 382, baseType: !948, size: 32, align: 32, offset: 1280)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1128, file: !526, line: 386, baseType: !948, size: 32, align: 32, offset: 1312)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1128, file: !526, line: 391, baseType: !948, size: 32, align: 32, offset: 1344)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1128, file: !526, line: 396, baseType: !982, size: 64, align: 64, offset: 1408)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1128, file: !526, line: 403, baseType: !1159, size: 512, align: 64, offset: 1472)
!1159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1160, size: 512, align: 64, elements: !1132)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !939, line: 55, baseType: !1120)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1128, file: !526, line: 410, baseType: !948, size: 32, align: 32, offset: 1984)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1128, file: !526, line: 415, baseType: !948, size: 32, align: 32, offset: 2016)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1128, file: !526, line: 420, baseType: !948, size: 32, align: 32, offset: 2048)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1128, file: !526, line: 425, baseType: !948, size: 32, align: 32, offset: 2080)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1128, file: !526, line: 435, baseType: !1081, size: 64, align: 64, offset: 2112)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1128, file: !526, line: 440, baseType: !948, size: 32, align: 32, offset: 2176)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1128, file: !526, line: 445, baseType: !1160, size: 64, align: 64, offset: 2240)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1128, file: !526, line: 459, baseType: !1169, size: 512, align: 64, offset: 2304)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 512, align: 64, elements: !1132)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1128, file: !526, line: 473, baseType: !1171, size: 64, align: 64, offset: 2816)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1128, file: !526, line: 477, baseType: !948, size: 32, align: 32, offset: 2880)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1128, file: !526, line: 479, baseType: !1174, size: 64, align: 64, offset: 2944)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1178)
!1178 = !{!1179, !1180, !1181, !1182, !1187}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1177, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1177, file: !526, line: 203, baseType: !1077, size: 64, align: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1177, file: !526, line: 204, baseType: !948, size: 32, align: 32, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1177, file: !526, line: 205, baseType: !1183, size: 64, align: 64, offset: 192)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1185, line: 86, baseType: !1186)
!1185 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1186 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1185, line: 86, flags: DIFlagFwdDecl)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1177, file: !526, line: 206, baseType: !1067, size: 64, align: 64, offset: 256)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1128, file: !526, line: 480, baseType: !948, size: 32, align: 32, offset: 3008)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1128, file: !526, line: 505, baseType: !948, size: 32, align: 32, offset: 3040)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1128, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1128, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1128, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1128, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1128, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1128, file: !526, line: 532, baseType: !1081, size: 64, align: 64, offset: 3264)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1128, file: !526, line: 539, baseType: !1081, size: 64, align: 64, offset: 3328)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1128, file: !526, line: 547, baseType: !1081, size: 64, align: 64, offset: 3392)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1128, file: !526, line: 554, baseType: !1183, size: 64, align: 64, offset: 3456)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1128, file: !526, line: 563, baseType: !948, size: 32, align: 32, offset: 3520)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1128, file: !526, line: 572, baseType: !948, size: 32, align: 32, offset: 3552)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1128, file: !526, line: 581, baseType: !948, size: 32, align: 32, offset: 3584)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1128, file: !526, line: 588, baseType: !1203, size: 64, align: 64, offset: 3648)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !939, line: 36, baseType: !1205)
!1205 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1128, file: !526, line: 593, baseType: !948, size: 32, align: 32, offset: 3712)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1128, file: !526, line: 596, baseType: !948, size: 32, align: 32, offset: 3744)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1128, file: !526, line: 599, baseType: !1067, size: 64, align: 64, offset: 3776)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1128, file: !526, line: 605, baseType: !1067, size: 64, align: 64, offset: 3840)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1128, file: !526, line: 616, baseType: !1067, size: 64, align: 64, offset: 3904)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1128, file: !526, line: 626, baseType: !1118, size: 64, align: 64, offset: 3968)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1128, file: !526, line: 627, baseType: !1118, size: 64, align: 64, offset: 4032)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1128, file: !526, line: 628, baseType: !1118, size: 64, align: 64, offset: 4096)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1128, file: !526, line: 629, baseType: !1118, size: 64, align: 64, offset: 4160)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1128, file: !526, line: 645, baseType: !1067, size: 64, align: 64, offset: 4224)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1043, file: !897, line: 587, baseType: !1217, size: 64, align: 64, offset: 1152)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!948, !1036, !1220}
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1043, file: !897, line: 592, baseType: !1223, size: 64, align: 64, offset: 1216)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!948, !1036, !1226}
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1043, file: !897, line: 597, baseType: !1223, size: 64, align: 64, offset: 1280)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1043, file: !897, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1043, file: !897, line: 608, baseType: !1033, size: 64, align: 64, offset: 1408)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1043, file: !897, line: 617, baseType: !1232, size: 64, align: 64, offset: 1472)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{null, !1036}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1043, file: !897, line: 623, baseType: !1236, size: 64, align: 64, offset: 1536)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!948, !1036, !1239}
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1063)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1037, file: !897, line: 1365, baseType: !982, size: 64, align: 64, offset: 192)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1037, file: !897, line: 1379, baseType: !1243, size: 64, align: 64, offset: 256)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1246)
!1246 = !{!1247, !1248, !1249, !1250, !1251, !1252, !1253, !1257, !1258, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1274, !1275, !1279, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1297, !1298, !1299, !1300, !1304, !1305, !1306}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1245, file: !628, line: 174, baseType: !972, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1245, file: !628, line: 226, baseType: !1028, size: 64, align: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1245, file: !628, line: 227, baseType: !948, size: 32, align: 32, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1245, file: !628, line: 228, baseType: !1028, size: 64, align: 64, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1245, file: !628, line: 229, baseType: !1028, size: 64, align: 64, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1245, file: !628, line: 233, baseType: !982, size: 64, align: 64, offset: 320)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1245, file: !628, line: 235, baseType: !1254, size: 64, align: 64, offset: 384)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!948, !982, !1077, !948}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1245, file: !628, line: 236, baseType: !1254, size: 64, align: 64, offset: 448)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1245, file: !628, line: 237, baseType: !1259, size: 64, align: 64, offset: 512)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!1081, !982, !1081, !948}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1245, file: !628, line: 238, baseType: !1081, size: 64, align: 64, offset: 576)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1245, file: !628, line: 239, baseType: !948, size: 32, align: 32, offset: 640)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1245, file: !628, line: 240, baseType: !948, size: 32, align: 32, offset: 672)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1245, file: !628, line: 241, baseType: !948, size: 32, align: 32, offset: 704)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1245, file: !628, line: 242, baseType: !1120, size: 64, align: 64, offset: 768)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1245, file: !628, line: 243, baseType: !1028, size: 64, align: 64, offset: 832)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1245, file: !628, line: 244, baseType: !1269, size: 64, align: 64, offset: 896)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!1120, !1120, !1272, !940}
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1078)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1245, file: !628, line: 245, baseType: !948, size: 32, align: 32, offset: 960)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1245, file: !628, line: 249, baseType: !1276, size: 64, align: 64, offset: 1024)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!948, !982, !948}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1245, file: !628, line: 255, baseType: !1280, size: 64, align: 64, offset: 1088)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!1081, !982, !948, !1081, !948}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1245, file: !628, line: 260, baseType: !948, size: 32, align: 32, offset: 1152)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1245, file: !628, line: 266, baseType: !1081, size: 64, align: 64, offset: 1216)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1245, file: !628, line: 273, baseType: !948, size: 32, align: 32, offset: 1280)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1245, file: !628, line: 279, baseType: !1081, size: 64, align: 64, offset: 1344)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1245, file: !628, line: 285, baseType: !948, size: 32, align: 32, offset: 1408)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1245, file: !628, line: 291, baseType: !948, size: 32, align: 32, offset: 1440)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1245, file: !628, line: 298, baseType: !948, size: 32, align: 32, offset: 1472)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1245, file: !628, line: 304, baseType: !948, size: 32, align: 32, offset: 1504)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1245, file: !628, line: 309, baseType: !955, size: 64, align: 64, offset: 1536)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1245, file: !628, line: 314, baseType: !955, size: 64, align: 64, offset: 1600)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1245, file: !628, line: 319, baseType: !1294, size: 64, align: 64, offset: 1664)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!948, !982, !1077, !948, !627, !1081}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1245, file: !628, line: 326, baseType: !948, size: 32, align: 32, offset: 1728)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1245, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1245, file: !628, line: 332, baseType: !1081, size: 64, align: 64, offset: 1792)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1245, file: !628, line: 338, baseType: !1301, size: 64, align: 64, offset: 1856)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!948, !982}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1245, file: !628, line: 340, baseType: !1081, size: 64, align: 64, offset: 1920)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1245, file: !628, line: 346, baseType: !1028, size: 64, align: 64, offset: 1984)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1245, file: !628, line: 351, baseType: !948, size: 32, align: 32, offset: 2048)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1037, file: !897, line: 1386, baseType: !948, size: 32, align: 32, offset: 320)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1037, file: !897, line: 1393, baseType: !940, size: 32, align: 32, offset: 352)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1037, file: !897, line: 1405, baseType: !1310, size: 64, align: 64, offset: 384)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1313)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1314)
!1314 = !{!1315, !1316, !1317, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1785, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1886, !1892, !1893, !1897, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1929, !1930, !1931, !1932, !1933, !1934}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1313, file: !897, line: 866, baseType: !948, size: 32, align: 32)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1313, file: !897, line: 872, baseType: !948, size: 32, align: 32, offset: 32)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1313, file: !897, line: 878, baseType: !1318, size: 64, align: 64, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1320)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1321)
!1321 = !{!1322, !1323, !1324, !1325, !1460, !1461, !1462, !1463, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1489, !1493, !1494, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1673, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1320, file: !4, line: 1561, baseType: !972, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1320, file: !4, line: 1562, baseType: !948, size: 32, align: 32, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1320, file: !4, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1320, file: !4, line: 1565, baseType: !1326, size: 64, align: 64, offset: 128)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1328)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1329)
!1329 = !{!1330, !1331, !1332, !1333, !1334, !1335, !1338, !1341, !1344, !1347, !1350, !1351, !1352, !1360, !1361, !1362, !1364, !1368, !1374, !1379, !1383, !1384, !1425, !1432, !1436, !1437, !1441, !1445, !1449, !1453, !1454, !1455}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1328, file: !4, line: 3475, baseType: !955, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1328, file: !4, line: 3480, baseType: !955, size: 64, align: 64, offset: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1328, file: !4, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1328, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1328, file: !4, line: 3487, baseType: !948, size: 32, align: 32, offset: 192)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1328, file: !4, line: 3488, baseType: !1336, size: 64, align: 64, offset: 256)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1145)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1328, file: !4, line: 3489, baseType: !1339, size: 64, align: 64, offset: 320)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1328, file: !4, line: 3490, baseType: !1342, size: 64, align: 64, offset: 384)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1328, file: !4, line: 3491, baseType: !1345, size: 64, align: 64, offset: 448)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1328, file: !4, line: 3492, baseType: !1348, size: 64, align: 64, offset: 512)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1160)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1328, file: !4, line: 3493, baseType: !1078, size: 8, align: 8, offset: 576)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1328, file: !4, line: 3494, baseType: !972, size: 64, align: 64, offset: 640)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1328, file: !4, line: 3495, baseType: !1353, size: 64, align: 64, offset: 704)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1355)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1356)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1357)
!1357 = !{!1358, !1359}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1356, file: !4, line: 3402, baseType: !948, size: 32, align: 32)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1356, file: !4, line: 3403, baseType: !955, size: 64, align: 64, offset: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1328, file: !4, line: 3507, baseType: !955, size: 64, align: 64, offset: 768)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1328, file: !4, line: 3516, baseType: !948, size: 32, align: 32, offset: 832)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1328, file: !4, line: 3517, baseType: !1363, size: 64, align: 64, offset: 896)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1328, file: !4, line: 3527, baseType: !1365, size: 64, align: 64, offset: 960)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{!948, !1318}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1328, file: !4, line: 3535, baseType: !1369, size: 64, align: 64, offset: 1024)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DISubroutineType(types: !1371)
!1371 = !{!948, !1318, !1372}
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1319)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1328, file: !4, line: 3541, baseType: !1375, size: 64, align: 64, offset: 1088)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1377)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1378)
!1378 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1328, file: !4, line: 3549, baseType: !1380, size: 64, align: 64, offset: 1152)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DISubroutineType(types: !1382)
!1382 = !{null, !1363}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1328, file: !4, line: 3551, baseType: !1365, size: 64, align: 64, offset: 1216)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1328, file: !4, line: 3552, baseType: !1385, size: 64, align: 64, offset: 1280)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DISubroutineType(types: !1387)
!1387 = !{!948, !1318, !1077, !948, !1388}
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1390)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1391)
!1391 = !{!1392, !1393, !1394, !1395, !1396, !1424}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1390, file: !4, line: 3921, baseType: !946, size: 16, align: 16)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1390, file: !4, line: 3922, baseType: !938, size: 32, align: 32, offset: 32)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1390, file: !4, line: 3923, baseType: !938, size: 32, align: 32, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1390, file: !4, line: 3924, baseType: !940, size: 32, align: 32, offset: 96)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1390, file: !4, line: 3925, baseType: !1397, size: 64, align: 64, offset: 128)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1401)
!1401 = !{!1402, !1403, !1404, !1405, !1406, !1407, !1413, !1417, !1419, !1420, !1422, !1423}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1400, file: !4, line: 3886, baseType: !948, size: 32, align: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1400, file: !4, line: 3887, baseType: !948, size: 32, align: 32, offset: 32)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1400, file: !4, line: 3888, baseType: !948, size: 32, align: 32, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1400, file: !4, line: 3889, baseType: !948, size: 32, align: 32, offset: 96)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1400, file: !4, line: 3890, baseType: !948, size: 32, align: 32, offset: 128)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1400, file: !4, line: 3897, baseType: !1408, size: 768, align: 64, offset: 192)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1409)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1410)
!1410 = !{!1411, !1412}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1409, file: !4, line: 3855, baseType: !1131, size: 512, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1409, file: !4, line: 3857, baseType: !1135, size: 256, align: 32, offset: 512)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1400, file: !4, line: 3903, baseType: !1414, size: 256, align: 64, offset: 960)
!1414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1077, size: 256, align: 64, elements: !1415)
!1415 = !{!1416}
!1416 = !DISubrange(count: 4)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1400, file: !4, line: 3904, baseType: !1418, size: 128, align: 32, offset: 1216)
!1418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 128, align: 32, elements: !1415)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1400, file: !4, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1400, file: !4, line: 3908, baseType: !1421, size: 64, align: 64, offset: 1408)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1400, file: !4, line: 3915, baseType: !1421, size: 64, align: 64, offset: 1472)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1400, file: !4, line: 3917, baseType: !948, size: 32, align: 32, offset: 1536)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1390, file: !4, line: 3926, baseType: !1081, size: 64, align: 64, offset: 192)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1328, file: !4, line: 3564, baseType: !1426, size: 64, align: 64, offset: 1344)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DISubroutineType(types: !1428)
!1428 = !{!948, !1318, !1062, !1429, !1431}
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1127)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1328, file: !4, line: 3566, baseType: !1433, size: 64, align: 64, offset: 1408)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DISubroutineType(types: !1435)
!1435 = !{!948, !1318, !982, !1431, !1062}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1328, file: !4, line: 3567, baseType: !1365, size: 64, align: 64, offset: 1472)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1328, file: !4, line: 3576, baseType: !1438, size: 64, align: 64, offset: 1536)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DISubroutineType(types: !1440)
!1440 = !{!948, !1318, !1429}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1328, file: !4, line: 3577, baseType: !1442, size: 64, align: 64, offset: 1600)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{!948, !1318, !1062}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1328, file: !4, line: 3584, baseType: !1446, size: 64, align: 64, offset: 1664)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DISubroutineType(types: !1448)
!1448 = !{!948, !1318, !1126}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1328, file: !4, line: 3589, baseType: !1450, size: 64, align: 64, offset: 1728)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DISubroutineType(types: !1452)
!1452 = !{null, !1318}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1328, file: !4, line: 3594, baseType: !948, size: 32, align: 32, offset: 1792)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1328, file: !4, line: 3600, baseType: !955, size: 64, align: 64, offset: 1856)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1328, file: !4, line: 3609, baseType: !1456, size: 64, align: 64, offset: 1920)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1459)
!1459 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1320, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1320, file: !4, line: 1581, baseType: !940, size: 32, align: 32, offset: 224)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1320, file: !4, line: 1583, baseType: !982, size: 64, align: 64, offset: 256)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1320, file: !4, line: 1591, baseType: !1464, size: 64, align: 64, offset: 320)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1320, file: !4, line: 1598, baseType: !982, size: 64, align: 64, offset: 384)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1320, file: !4, line: 1606, baseType: !1081, size: 64, align: 64, offset: 448)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1320, file: !4, line: 1614, baseType: !948, size: 32, align: 32, offset: 512)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1320, file: !4, line: 1622, baseType: !948, size: 32, align: 32, offset: 544)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1320, file: !4, line: 1628, baseType: !948, size: 32, align: 32, offset: 576)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1320, file: !4, line: 1636, baseType: !948, size: 32, align: 32, offset: 608)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1320, file: !4, line: 1643, baseType: !948, size: 32, align: 32, offset: 640)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1320, file: !4, line: 1657, baseType: !1077, size: 64, align: 64, offset: 704)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1320, file: !4, line: 1658, baseType: !948, size: 32, align: 32, offset: 768)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1320, file: !4, line: 1679, baseType: !1145, size: 64, align: 32, offset: 800)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1320, file: !4, line: 1688, baseType: !948, size: 32, align: 32, offset: 864)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1320, file: !4, line: 1712, baseType: !948, size: 32, align: 32, offset: 896)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1320, file: !4, line: 1729, baseType: !948, size: 32, align: 32, offset: 928)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1320, file: !4, line: 1729, baseType: !948, size: 32, align: 32, offset: 960)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1320, file: !4, line: 1744, baseType: !948, size: 32, align: 32, offset: 992)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1320, file: !4, line: 1744, baseType: !948, size: 32, align: 32, offset: 1024)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1320, file: !4, line: 1751, baseType: !948, size: 32, align: 32, offset: 1056)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1320, file: !4, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1320, file: !4, line: 1791, baseType: !1485, size: 64, align: 64, offset: 1152)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{null, !1488, !1429, !1431, !948, !948, !948}
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1320, file: !4, line: 1808, baseType: !1490, size: 64, align: 64, offset: 1216)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{!645, !1488, !1339}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1320, file: !4, line: 1816, baseType: !948, size: 32, align: 32, offset: 1280)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1320, file: !4, line: 1825, baseType: !1495, size: 32, align: 32, offset: 1312)
!1495 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1320, file: !4, line: 1830, baseType: !948, size: 32, align: 32, offset: 1344)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1320, file: !4, line: 1838, baseType: !1495, size: 32, align: 32, offset: 1376)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1320, file: !4, line: 1846, baseType: !948, size: 32, align: 32, offset: 1408)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1320, file: !4, line: 1851, baseType: !948, size: 32, align: 32, offset: 1440)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1320, file: !4, line: 1861, baseType: !1495, size: 32, align: 32, offset: 1472)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1320, file: !4, line: 1868, baseType: !1495, size: 32, align: 32, offset: 1504)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1320, file: !4, line: 1875, baseType: !1495, size: 32, align: 32, offset: 1536)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1320, file: !4, line: 1882, baseType: !1495, size: 32, align: 32, offset: 1568)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1320, file: !4, line: 1889, baseType: !1495, size: 32, align: 32, offset: 1600)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1320, file: !4, line: 1896, baseType: !1495, size: 32, align: 32, offset: 1632)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1320, file: !4, line: 1903, baseType: !1495, size: 32, align: 32, offset: 1664)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1320, file: !4, line: 1910, baseType: !948, size: 32, align: 32, offset: 1696)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1320, file: !4, line: 1915, baseType: !948, size: 32, align: 32, offset: 1728)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1320, file: !4, line: 1926, baseType: !1431, size: 64, align: 64, offset: 1792)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1320, file: !4, line: 1935, baseType: !1145, size: 64, align: 32, offset: 1856)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1320, file: !4, line: 1942, baseType: !948, size: 32, align: 32, offset: 1920)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1320, file: !4, line: 1948, baseType: !948, size: 32, align: 32, offset: 1952)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1320, file: !4, line: 1954, baseType: !948, size: 32, align: 32, offset: 1984)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1320, file: !4, line: 1960, baseType: !948, size: 32, align: 32, offset: 2016)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1320, file: !4, line: 1984, baseType: !948, size: 32, align: 32, offset: 2048)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1320, file: !4, line: 1991, baseType: !948, size: 32, align: 32, offset: 2080)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1320, file: !4, line: 1996, baseType: !948, size: 32, align: 32, offset: 2112)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1320, file: !4, line: 2004, baseType: !948, size: 32, align: 32, offset: 2144)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1320, file: !4, line: 2011, baseType: !948, size: 32, align: 32, offset: 2176)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1320, file: !4, line: 2018, baseType: !948, size: 32, align: 32, offset: 2208)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1320, file: !4, line: 2027, baseType: !948, size: 32, align: 32, offset: 2240)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1320, file: !4, line: 2034, baseType: !948, size: 32, align: 32, offset: 2272)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1320, file: !4, line: 2044, baseType: !948, size: 32, align: 32, offset: 2304)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1320, file: !4, line: 2054, baseType: !1525, size: 64, align: 64, offset: 2368)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1320, file: !4, line: 2061, baseType: !1525, size: 64, align: 64, offset: 2432)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1320, file: !4, line: 2066, baseType: !948, size: 32, align: 32, offset: 2496)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1320, file: !4, line: 2070, baseType: !948, size: 32, align: 32, offset: 2528)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1320, file: !4, line: 2078, baseType: !948, size: 32, align: 32, offset: 2560)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1320, file: !4, line: 2085, baseType: !948, size: 32, align: 32, offset: 2592)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1320, file: !4, line: 2092, baseType: !948, size: 32, align: 32, offset: 2624)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1320, file: !4, line: 2099, baseType: !948, size: 32, align: 32, offset: 2656)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1320, file: !4, line: 2106, baseType: !948, size: 32, align: 32, offset: 2688)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1320, file: !4, line: 2113, baseType: !948, size: 32, align: 32, offset: 2720)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1320, file: !4, line: 2120, baseType: !948, size: 32, align: 32, offset: 2752)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1320, file: !4, line: 2125, baseType: !948, size: 32, align: 32, offset: 2784)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1320, file: !4, line: 2133, baseType: !948, size: 32, align: 32, offset: 2816)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1320, file: !4, line: 2140, baseType: !948, size: 32, align: 32, offset: 2848)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1320, file: !4, line: 2145, baseType: !948, size: 32, align: 32, offset: 2880)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1320, file: !4, line: 2153, baseType: !948, size: 32, align: 32, offset: 2912)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1320, file: !4, line: 2158, baseType: !948, size: 32, align: 32, offset: 2944)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1320, file: !4, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1320, file: !4, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1320, file: !4, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1320, file: !4, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1320, file: !4, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1320, file: !4, line: 2203, baseType: !948, size: 32, align: 32, offset: 3136)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1320, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1320, file: !4, line: 2212, baseType: !948, size: 32, align: 32, offset: 3200)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1320, file: !4, line: 2213, baseType: !948, size: 32, align: 32, offset: 3232)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1320, file: !4, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1320, file: !4, line: 2232, baseType: !948, size: 32, align: 32, offset: 3296)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1320, file: !4, line: 2243, baseType: !948, size: 32, align: 32, offset: 3328)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1320, file: !4, line: 2249, baseType: !948, size: 32, align: 32, offset: 3360)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1320, file: !4, line: 2256, baseType: !948, size: 32, align: 32, offset: 3392)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1320, file: !4, line: 2263, baseType: !1160, size: 64, align: 64, offset: 3456)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1320, file: !4, line: 2270, baseType: !1160, size: 64, align: 64, offset: 3520)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1320, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1320, file: !4, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1320, file: !4, line: 2367, baseType: !1561, size: 64, align: 64, offset: 3648)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{!948, !1488, !1126, !948}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1320, file: !4, line: 2383, baseType: !948, size: 32, align: 32, offset: 3712)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1320, file: !4, line: 2386, baseType: !1495, size: 32, align: 32, offset: 3744)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1320, file: !4, line: 2387, baseType: !1495, size: 32, align: 32, offset: 3776)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1320, file: !4, line: 2394, baseType: !948, size: 32, align: 32, offset: 3808)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1320, file: !4, line: 2401, baseType: !948, size: 32, align: 32, offset: 3840)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1320, file: !4, line: 2408, baseType: !948, size: 32, align: 32, offset: 3872)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1320, file: !4, line: 2415, baseType: !948, size: 32, align: 32, offset: 3904)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1320, file: !4, line: 2422, baseType: !948, size: 32, align: 32, offset: 3936)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1320, file: !4, line: 2423, baseType: !1573, size: 64, align: 64, offset: 3968)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1575)
!1575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1576)
!1576 = !{!1577, !1578, !1579, !1580}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1575, file: !4, line: 827, baseType: !948, size: 32, align: 32)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1575, file: !4, line: 828, baseType: !948, size: 32, align: 32, offset: 32)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1575, file: !4, line: 829, baseType: !948, size: 32, align: 32, offset: 64)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1575, file: !4, line: 830, baseType: !1495, size: 32, align: 32, offset: 96)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1320, file: !4, line: 2430, baseType: !1081, size: 64, align: 64, offset: 4032)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1320, file: !4, line: 2437, baseType: !1081, size: 64, align: 64, offset: 4096)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1320, file: !4, line: 2444, baseType: !1495, size: 32, align: 32, offset: 4160)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1320, file: !4, line: 2451, baseType: !1495, size: 32, align: 32, offset: 4192)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1320, file: !4, line: 2458, baseType: !948, size: 32, align: 32, offset: 4224)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1320, file: !4, line: 2469, baseType: !948, size: 32, align: 32, offset: 4256)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1320, file: !4, line: 2475, baseType: !948, size: 32, align: 32, offset: 4288)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1320, file: !4, line: 2481, baseType: !948, size: 32, align: 32, offset: 4320)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1320, file: !4, line: 2485, baseType: !948, size: 32, align: 32, offset: 4352)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1320, file: !4, line: 2489, baseType: !948, size: 32, align: 32, offset: 4384)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1320, file: !4, line: 2493, baseType: !948, size: 32, align: 32, offset: 4416)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1320, file: !4, line: 2501, baseType: !948, size: 32, align: 32, offset: 4448)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1320, file: !4, line: 2506, baseType: !948, size: 32, align: 32, offset: 4480)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1320, file: !4, line: 2510, baseType: !948, size: 32, align: 32, offset: 4512)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1320, file: !4, line: 2514, baseType: !1081, size: 64, align: 64, offset: 4544)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1320, file: !4, line: 2528, baseType: !1597, size: 64, align: 64, offset: 4608)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DISubroutineType(types: !1599)
!1599 = !{null, !1488, !982, !948, !948}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1320, file: !4, line: 2534, baseType: !948, size: 32, align: 32, offset: 4672)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1320, file: !4, line: 2545, baseType: !948, size: 32, align: 32, offset: 4704)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1320, file: !4, line: 2547, baseType: !948, size: 32, align: 32, offset: 4736)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1320, file: !4, line: 2549, baseType: !948, size: 32, align: 32, offset: 4768)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1320, file: !4, line: 2551, baseType: !948, size: 32, align: 32, offset: 4800)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1320, file: !4, line: 2553, baseType: !948, size: 32, align: 32, offset: 4832)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1320, file: !4, line: 2555, baseType: !948, size: 32, align: 32, offset: 4864)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1320, file: !4, line: 2557, baseType: !948, size: 32, align: 32, offset: 4896)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1320, file: !4, line: 2559, baseType: !948, size: 32, align: 32, offset: 4928)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1320, file: !4, line: 2563, baseType: !948, size: 32, align: 32, offset: 4960)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1320, file: !4, line: 2571, baseType: !1421, size: 64, align: 64, offset: 4992)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1320, file: !4, line: 2579, baseType: !1421, size: 64, align: 64, offset: 5056)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1320, file: !4, line: 2586, baseType: !948, size: 32, align: 32, offset: 5120)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1320, file: !4, line: 2615, baseType: !948, size: 32, align: 32, offset: 5152)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1320, file: !4, line: 2627, baseType: !948, size: 32, align: 32, offset: 5184)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1320, file: !4, line: 2637, baseType: !948, size: 32, align: 32, offset: 5216)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1320, file: !4, line: 2681, baseType: !948, size: 32, align: 32, offset: 5248)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1320, file: !4, line: 2709, baseType: !1081, size: 64, align: 64, offset: 5312)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1320, file: !4, line: 2716, baseType: !1619, size: 64, align: 64, offset: 5376)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1621)
!1621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1622)
!1622 = !{!1623, !1624, !1625, !1626, !1627, !1628, !1629, !1633, !1637, !1638, !1639, !1640, !1646, !1647, !1648, !1649, !1650}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1621, file: !4, line: 3642, baseType: !955, size: 64, align: 64)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1621, file: !4, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1621, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1621, file: !4, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1621, file: !4, line: 3669, baseType: !948, size: 32, align: 32, offset: 160)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1621, file: !4, line: 3682, baseType: !1446, size: 64, align: 64, offset: 192)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1621, file: !4, line: 3698, baseType: !1630, size: 64, align: 64, offset: 256)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DISubroutineType(types: !1632)
!1632 = !{!948, !1318, !1272, !938}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1621, file: !4, line: 3712, baseType: !1634, size: 64, align: 64, offset: 320)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DISubroutineType(types: !1636)
!1636 = !{!948, !1318, !948, !1272, !938}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1621, file: !4, line: 3726, baseType: !1630, size: 64, align: 64, offset: 384)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1621, file: !4, line: 3737, baseType: !1365, size: 64, align: 64, offset: 448)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1621, file: !4, line: 3746, baseType: !948, size: 32, align: 32, offset: 512)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1621, file: !4, line: 3757, baseType: !1641, size: 64, align: 64, offset: 576)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{null, !1644}
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1621, file: !4, line: 3766, baseType: !1365, size: 64, align: 64, offset: 640)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1621, file: !4, line: 3774, baseType: !1365, size: 64, align: 64, offset: 704)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1621, file: !4, line: 3780, baseType: !948, size: 32, align: 32, offset: 768)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1621, file: !4, line: 3785, baseType: !948, size: 32, align: 32, offset: 800)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1621, file: !4, line: 3795, baseType: !1651, size: 64, align: 64, offset: 832)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{!948, !1318, !1067}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1320, file: !4, line: 2728, baseType: !982, size: 64, align: 64, offset: 5440)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1320, file: !4, line: 2735, baseType: !1159, size: 512, align: 64, offset: 5504)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1320, file: !4, line: 2742, baseType: !948, size: 32, align: 32, offset: 6016)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1320, file: !4, line: 2755, baseType: !948, size: 32, align: 32, offset: 6048)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1320, file: !4, line: 2776, baseType: !948, size: 32, align: 32, offset: 6080)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1320, file: !4, line: 2783, baseType: !948, size: 32, align: 32, offset: 6112)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1320, file: !4, line: 2791, baseType: !948, size: 32, align: 32, offset: 6144)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1320, file: !4, line: 2802, baseType: !1126, size: 64, align: 64, offset: 6208)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1320, file: !4, line: 2811, baseType: !948, size: 32, align: 32, offset: 6272)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1320, file: !4, line: 2821, baseType: !948, size: 32, align: 32, offset: 6304)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1320, file: !4, line: 2830, baseType: !948, size: 32, align: 32, offset: 6336)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1320, file: !4, line: 2840, baseType: !948, size: 32, align: 32, offset: 6368)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1320, file: !4, line: 2851, baseType: !1667, size: 64, align: 64, offset: 6400)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{!948, !1488, !1670, !982, !1431, !948, !948}
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{!948, !1488, !982}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1320, file: !4, line: 2871, baseType: !1674, size: 64, align: 64, offset: 6464)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DISubroutineType(types: !1676)
!1676 = !{!948, !1488, !1677, !982, !1431, !948}
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DISubroutineType(types: !1679)
!1679 = !{!948, !1488, !982, !948, !948}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1320, file: !4, line: 2878, baseType: !948, size: 32, align: 32, offset: 6528)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1320, file: !4, line: 2885, baseType: !948, size: 32, align: 32, offset: 6560)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1320, file: !4, line: 3005, baseType: !948, size: 32, align: 32, offset: 6592)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1320, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1320, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1320, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1320, file: !4, line: 3037, baseType: !1077, size: 64, align: 64, offset: 6720)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1320, file: !4, line: 3038, baseType: !948, size: 32, align: 32, offset: 6784)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1320, file: !4, line: 3050, baseType: !1160, size: 64, align: 64, offset: 6848)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1320, file: !4, line: 3065, baseType: !948, size: 32, align: 32, offset: 6912)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1320, file: !4, line: 3083, baseType: !948, size: 32, align: 32, offset: 6944)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1320, file: !4, line: 3092, baseType: !1145, size: 64, align: 32, offset: 6976)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1320, file: !4, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1320, file: !4, line: 3106, baseType: !1145, size: 64, align: 32, offset: 7072)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1320, file: !4, line: 3113, baseType: !1695, size: 64, align: 64, offset: 7168)
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64, align: 64)
!1696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1697)
!1697 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1698)
!1698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1699)
!1699 = !{!1700, !1701, !1702, !1703, !1704, !1705, !1708}
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1698, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1698, file: !4, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1698, file: !4, line: 720, baseType: !955, size: 64, align: 64, offset: 64)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1698, file: !4, line: 724, baseType: !955, size: 64, align: 64, offset: 128)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1698, file: !4, line: 728, baseType: !948, size: 32, align: 32, offset: 192)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1698, file: !4, line: 734, baseType: !1706, size: 64, align: 64, offset: 256)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1698, file: !4, line: 739, baseType: !1709, size: 64, align: 64, offset: 320)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1356)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1320, file: !4, line: 3129, baseType: !1081, size: 64, align: 64, offset: 7232)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1320, file: !4, line: 3130, baseType: !1081, size: 64, align: 64, offset: 7296)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1320, file: !4, line: 3131, baseType: !1081, size: 64, align: 64, offset: 7360)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1320, file: !4, line: 3132, baseType: !1081, size: 64, align: 64, offset: 7424)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1320, file: !4, line: 3139, baseType: !1421, size: 64, align: 64, offset: 7488)
