; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--apedec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--apedec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902}
!896 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!897 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!898 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!899 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!900 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!901 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!902 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "APECompressionLevel", file: !910, line: 67, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/apedec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915, !916}
!912 = !DIEnumerator(name: "COMPRESSION_LEVEL_FAST", value: 1000)
!913 = !DIEnumerator(name: "COMPRESSION_LEVEL_NORMAL", value: 2000)
!914 = !DIEnumerator(name: "COMPRESSION_LEVEL_HIGH", value: 3000)
!915 = !DIEnumerator(name: "COMPRESSION_LEVEL_EXTRA_HIGH", value: 4000)
!916 = !DIEnumerator(name: "COMPRESSION_LEVEL_INSANE", value: 5000)
!917 = !{!918, !919, !920, !929, !935, !934, !937, !939, !940, !941, !943, !944, !947}
!918 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!919 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !923, line: 222, size: 16, align: 8, elements: !924)
!923 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!924 = !{!925}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !922, file: !923, line: 222, baseType: !926, size: 16, align: 16)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !927, line: 49, baseType: !928)
!927 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!928 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !923, line: 221, size: 32, align: 8, elements: !932)
!932 = !{!933}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !931, file: !923, line: 221, baseType: !934, size: 32, align: 32)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !927, line: 51, baseType: !919)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !927, line: 48, baseType: !936)
!936 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !927, line: 37, baseType: !946)
!946 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !927, line: 38, baseType: !918)
!949 = !{!950, !1704, !1705, !1711, !1716, !1720, !1724, !1725, !1726, !1728, !1733, !1735, !1737}
!950 = distinct !DIGlobalVariable(name: "ff_ape_decoder", scope: !0, file: !910, line: 1577, type: !951, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_ape_decoder)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !953)
!953 = !{!954, !958, !959, !960, !961, !962, !971, !974, !977, !980, !985, !986, !1061, !1069, !1070, !1071, !1073, !1619, !1625, !1633, !1637, !1638, !1675, !1679, !1683, !1684, !1688, !1692, !1693, !1697, !1698, !1699}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !952, file: !14, line: 3475, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !952, file: !14, line: 3480, baseType: !955, size: 64, align: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !952, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !952, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !952, file: !14, line: 3487, baseType: !918, size: 32, align: 32, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !952, file: !14, line: 3488, baseType: !963, size: 64, align: 64, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !966, line: 61, baseType: !967)
!966 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !966, line: 58, size: 64, align: 32, elements: !968)
!968 = !{!969, !970}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !967, file: !966, line: 59, baseType: !918, size: 32, align: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !967, file: !966, line: 60, baseType: !918, size: 32, align: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !952, file: !14, line: 3489, baseType: !972, size: 64, align: 64, offset: 320)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !952, file: !14, line: 3490, baseType: !975, size: 64, align: 64, offset: 384)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !952, file: !14, line: 3491, baseType: !978, size: 64, align: 64, offset: 448)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !952, file: !14, line: 3492, baseType: !981, size: 64, align: 64, offset: 512)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !927, line: 55, baseType: !984)
!984 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !952, file: !14, line: 3493, baseType: !935, size: 8, align: 8, offset: 576)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !952, file: !14, line: 3494, baseType: !987, size: 64, align: 64, offset: 640)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !991)
!991 = !{!992, !993, !997, !1020, !1021, !1022, !1023, !1027, !1033, !1035, !1039}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !990, file: !713, line: 72, baseType: !955, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !990, file: !713, line: 78, baseType: !994, size: 64, align: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!955, !939}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !990, file: !713, line: 85, baseType: !998, size: 64, align: 64, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1016, !1017, !1018, !1019}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1000, file: !691, line: 247, baseType: !955, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1000, file: !691, line: 253, baseType: !955, size: 64, align: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1000, file: !691, line: 259, baseType: !918, size: 32, align: 32, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1000, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1000, file: !691, line: 271, baseType: !1007, size: 64, align: 64, offset: 192)
!1007 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1000, file: !691, line: 265, size: 64, align: 64, elements: !1008)
!1008 = !{!1009, !1012, !1014, !1015}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1007, file: !691, line: 266, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !927, line: 40, baseType: !1011)
!1011 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1007, file: !691, line: 267, baseType: !1013, size: 64, align: 64)
!1013 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1007, file: !691, line: 268, baseType: !955, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1007, file: !691, line: 270, baseType: !965, size: 64, align: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1000, file: !691, line: 272, baseType: !1013, size: 64, align: 64, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1000, file: !691, line: 273, baseType: !1013, size: 64, align: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1000, file: !691, line: 275, baseType: !918, size: 32, align: 32, offset: 384)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1000, file: !691, line: 300, baseType: !955, size: 64, align: 64, offset: 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !990, file: !713, line: 93, baseType: !918, size: 32, align: 32, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !990, file: !713, line: 99, baseType: !918, size: 32, align: 32, offset: 224)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !990, file: !713, line: 108, baseType: !918, size: 32, align: 32, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !990, file: !713, line: 113, baseType: !1024, size: 64, align: 64, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!939, !939, !939}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !990, file: !713, line: 123, baseType: !1028, size: 64, align: 64, offset: 384)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!1031, !1031}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !990, file: !713, line: 130, baseType: !1034, size: 32, align: 32, offset: 448)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !990, file: !713, line: 136, baseType: !1036, size: 64, align: 64, offset: 512)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!1034, !939}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !990, file: !713, line: 142, baseType: !1040, size: 64, align: 64, offset: 576)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!918, !1043, !939, !955, !918}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1046)
!1046 = !{!1047, !1059, !1060}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1045, file: !691, line: 360, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1052)
!1052 = !{!1053, !1054, !1055, !1056, !1057, !1058}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1051, file: !691, line: 307, baseType: !955, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1051, file: !691, line: 313, baseType: !1013, size: 64, align: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1051, file: !691, line: 313, baseType: !1013, size: 64, align: 64, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1051, file: !691, line: 318, baseType: !1013, size: 64, align: 64, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1051, file: !691, line: 318, baseType: !1013, size: 64, align: 64, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1051, file: !691, line: 323, baseType: !918, size: 32, align: 32, offset: 320)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1045, file: !691, line: 364, baseType: !918, size: 32, align: 32, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1045, file: !691, line: 368, baseType: !918, size: 32, align: 32, offset: 96)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !952, file: !14, line: 3495, baseType: !1062, size: 64, align: 64, offset: 704)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1064)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1066)
!1066 = !{!1067, !1068}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1065, file: !14, line: 3402, baseType: !918, size: 32, align: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1065, file: !14, line: 3403, baseType: !955, size: 64, align: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !952, file: !14, line: 3507, baseType: !955, size: 64, align: 64, offset: 768)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !952, file: !14, line: 3516, baseType: !918, size: 32, align: 32, offset: 832)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !952, file: !14, line: 3517, baseType: !1072, size: 64, align: 64, offset: 896)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !952, file: !14, line: 3527, baseType: !1074, size: 64, align: 64, offset: 960)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!918, !1077}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1080)
!1080 = !{!1081, !1082, !1083, !1084, !1087, !1088, !1089, !1090, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1369, !1373, !1374, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1557, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1079, file: !14, line: 1561, baseType: !987, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1079, file: !14, line: 1562, baseType: !918, size: 32, align: 32, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1079, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1079, file: !14, line: 1565, baseType: !1085, size: 64, align: 64, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1079, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1079, file: !14, line: 1581, baseType: !919, size: 32, align: 32, offset: 224)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1079, file: !14, line: 1583, baseType: !939, size: 64, align: 64, offset: 256)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1079, file: !14, line: 1591, baseType: !1091, size: 64, align: 64, offset: 320)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1093, line: 129, size: 1664, align: 64, elements: !1094)
!1093 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1094 = !{!1095, !1096, !1097, !1098, !1195, !1216, !1217, !1246, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1092, file: !1093, line: 136, baseType: !918, size: 32, align: 32)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1092, file: !1093, line: 151, baseType: !918, size: 32, align: 32, offset: 32)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1092, file: !1093, line: 157, baseType: !918, size: 32, align: 32, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1092, file: !1093, line: 159, baseType: !1099, size: 64, align: 64, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1102)
!1102 = !{!1103, !1107, !1109, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1147, !1149, !1150, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1183, !1184, !1185, !1186, !1187, !1188, !1191, !1192, !1193, !1194}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1101, file: !744, line: 282, baseType: !1104, size: 512, align: 64)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 512, align: 64, elements: !1105)
!1105 = !{!1106}
!1106 = !DISubrange(count: 8)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1101, file: !744, line: 299, baseType: !1108, size: 256, align: 32, offset: 512)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 256, align: 32, elements: !1105)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1101, file: !744, line: 315, baseType: !1110, size: 64, align: 64, offset: 768)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1101, file: !744, line: 326, baseType: !918, size: 32, align: 32, offset: 832)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1101, file: !744, line: 326, baseType: !918, size: 32, align: 32, offset: 864)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1101, file: !744, line: 334, baseType: !918, size: 32, align: 32, offset: 896)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1101, file: !744, line: 341, baseType: !918, size: 32, align: 32, offset: 928)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1101, file: !744, line: 346, baseType: !918, size: 32, align: 32, offset: 960)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1101, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1101, file: !744, line: 356, baseType: !965, size: 64, align: 32, offset: 1024)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1101, file: !744, line: 361, baseType: !1010, size: 64, align: 64, offset: 1088)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1101, file: !744, line: 369, baseType: !1010, size: 64, align: 64, offset: 1152)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1101, file: !744, line: 377, baseType: !1010, size: 64, align: 64, offset: 1216)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1101, file: !744, line: 382, baseType: !918, size: 32, align: 32, offset: 1280)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1101, file: !744, line: 386, baseType: !918, size: 32, align: 32, offset: 1312)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1101, file: !744, line: 391, baseType: !918, size: 32, align: 32, offset: 1344)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1101, file: !744, line: 396, baseType: !939, size: 64, align: 64, offset: 1408)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1101, file: !744, line: 403, baseType: !1126, size: 512, align: 64, offset: 1472)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !983, size: 512, align: 64, elements: !1105)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1101, file: !744, line: 410, baseType: !918, size: 32, align: 32, offset: 1984)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1101, file: !744, line: 415, baseType: !918, size: 32, align: 32, offset: 2016)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1101, file: !744, line: 420, baseType: !918, size: 32, align: 32, offset: 2048)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1101, file: !744, line: 425, baseType: !918, size: 32, align: 32, offset: 2080)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1101, file: !744, line: 435, baseType: !1010, size: 64, align: 64, offset: 2112)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1101, file: !744, line: 440, baseType: !918, size: 32, align: 32, offset: 2176)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1101, file: !744, line: 445, baseType: !983, size: 64, align: 64, offset: 2240)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1101, file: !744, line: 459, baseType: !1135, size: 512, align: 64, offset: 2304)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 512, align: 64, elements: !1105)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1138, line: 94, baseType: !1139)
!1138 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1138, line: 81, size: 192, align: 64, elements: !1140)
!1140 = !{!1141, !1145, !1146}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1139, file: !1138, line: 82, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1138, line: 73, baseType: !1144)
!1144 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1138, line: 73, flags: DIFlagFwdDecl)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1139, file: !1138, line: 89, baseType: !943, size: 64, align: 64, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1139, file: !1138, line: 93, baseType: !918, size: 32, align: 32, offset: 128)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1101, file: !744, line: 473, baseType: !1148, size: 64, align: 64, offset: 2816)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1101, file: !744, line: 477, baseType: !918, size: 32, align: 32, offset: 2880)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1101, file: !744, line: 479, baseType: !1151, size: 64, align: 64, offset: 2944)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1159, !1164}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1154, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1154, file: !744, line: 203, baseType: !943, size: 64, align: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1154, file: !744, line: 204, baseType: !918, size: 32, align: 32, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1154, file: !744, line: 205, baseType: !1160, size: 64, align: 64, offset: 192)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1162, line: 86, baseType: !1163)
!1162 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1163 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1162, line: 86, flags: DIFlagFwdDecl)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1154, file: !744, line: 206, baseType: !1136, size: 64, align: 64, offset: 256)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1101, file: !744, line: 480, baseType: !918, size: 32, align: 32, offset: 3008)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1101, file: !744, line: 505, baseType: !918, size: 32, align: 32, offset: 3040)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1101, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1101, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1101, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1101, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1101, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1101, file: !744, line: 532, baseType: !1010, size: 64, align: 64, offset: 3264)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1101, file: !744, line: 539, baseType: !1010, size: 64, align: 64, offset: 3328)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1101, file: !744, line: 547, baseType: !1010, size: 64, align: 64, offset: 3392)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1101, file: !744, line: 554, baseType: !1160, size: 64, align: 64, offset: 3456)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1101, file: !744, line: 563, baseType: !918, size: 32, align: 32, offset: 3520)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1101, file: !744, line: 572, baseType: !918, size: 32, align: 32, offset: 3552)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1101, file: !744, line: 581, baseType: !918, size: 32, align: 32, offset: 3584)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1101, file: !744, line: 588, baseType: !1180, size: 64, align: 64, offset: 3648)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !927, line: 36, baseType: !1182)
!1182 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1101, file: !744, line: 593, baseType: !918, size: 32, align: 32, offset: 3712)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1101, file: !744, line: 596, baseType: !918, size: 32, align: 32, offset: 3744)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1101, file: !744, line: 599, baseType: !1136, size: 64, align: 64, offset: 3776)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1101, file: !744, line: 605, baseType: !1136, size: 64, align: 64, offset: 3840)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1101, file: !744, line: 616, baseType: !1136, size: 64, align: 64, offset: 3904)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1101, file: !744, line: 626, baseType: !1189, size: 64, align: 64, offset: 3968)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1190, line: 216, baseType: !984)
!1190 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1101, file: !744, line: 627, baseType: !1189, size: 64, align: 64, offset: 4032)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1101, file: !744, line: 628, baseType: !1189, size: 64, align: 64, offset: 4096)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1101, file: !744, line: 629, baseType: !1189, size: 64, align: 64, offset: 4160)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1101, file: !744, line: 645, baseType: !1136, size: 64, align: 64, offset: 4224)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1092, file: !1093, line: 161, baseType: !1196, size: 64, align: 64, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1093, line: 117, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1093, line: 100, size: 832, align: 64, elements: !1199)
!1199 = !{!1200, !1207, !1208, !1209, !1210, !1211, !1213, !1214, !1215}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1198, file: !1093, line: 105, baseType: !1201, size: 256, align: 64)
!1201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1202, size: 256, align: 64, elements: !1205)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1138, line: 238, baseType: !1204)
!1204 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1138, line: 238, flags: DIFlagFwdDecl)
!1205 = !{!1206}
!1206 = !DISubrange(count: 4)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1198, file: !1093, line: 110, baseType: !918, size: 32, align: 32, offset: 256)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1198, file: !1093, line: 111, baseType: !918, size: 32, align: 32, offset: 288)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1198, file: !1093, line: 111, baseType: !918, size: 32, align: 32, offset: 320)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1198, file: !1093, line: 112, baseType: !1108, size: 256, align: 32, offset: 352)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1198, file: !1093, line: 113, baseType: !1212, size: 128, align: 32, offset: 608)
!1212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 128, align: 32, elements: !1205)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1198, file: !1093, line: 114, baseType: !918, size: 32, align: 32, offset: 736)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1198, file: !1093, line: 115, baseType: !918, size: 32, align: 32, offset: 768)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1198, file: !1093, line: 116, baseType: !918, size: 32, align: 32, offset: 800)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1092, file: !1093, line: 163, baseType: !939, size: 64, align: 64, offset: 256)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1092, file: !1093, line: 165, baseType: !1218, size: 128, align: 64, offset: 320)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1093, line: 122, baseType: !1219)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1093, line: 119, size: 128, align: 64, elements: !1220)
!1220 = !{!1221, !1245}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1219, file: !1093, line: 120, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1224)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1225)
!1225 = !{!1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1241, !1242, !1243, !1244}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1224, file: !14, line: 1451, baseType: !1136, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1224, file: !14, line: 1461, baseType: !1010, size: 64, align: 64, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1224, file: !14, line: 1467, baseType: !1010, size: 64, align: 64, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1224, file: !14, line: 1468, baseType: !943, size: 64, align: 64, offset: 192)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1224, file: !14, line: 1469, baseType: !918, size: 32, align: 32, offset: 256)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1224, file: !14, line: 1470, baseType: !918, size: 32, align: 32, offset: 288)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1224, file: !14, line: 1474, baseType: !918, size: 32, align: 32, offset: 320)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1224, file: !14, line: 1479, baseType: !1234, size: 64, align: 64, offset: 384)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1236)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1237)
!1237 = !{!1238, !1239, !1240}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1236, file: !14, line: 1412, baseType: !943, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1236, file: !14, line: 1413, baseType: !918, size: 32, align: 32, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1236, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1224, file: !14, line: 1480, baseType: !918, size: 32, align: 32, offset: 448)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1224, file: !14, line: 1486, baseType: !1010, size: 64, align: 64, offset: 512)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1224, file: !14, line: 1488, baseType: !1010, size: 64, align: 64, offset: 576)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1224, file: !14, line: 1497, baseType: !1010, size: 64, align: 64, offset: 640)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1219, file: !1093, line: 121, baseType: !1099, size: 64, align: 64, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1092, file: !1093, line: 166, baseType: !1247, size: 128, align: 64, offset: 448)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1093, line: 127, baseType: !1248)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1093, line: 124, size: 128, align: 64, elements: !1249)
!1249 = !{!1250, !1323}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1248, file: !1093, line: 125, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1255)
!1255 = !{!1256, !1257, !1281, !1285, !1286, !1320, !1321, !1322}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1254, file: !14, line: 5751, baseType: !987, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1254, file: !14, line: 5756, baseType: !1258, size: 64, align: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1260)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1261)
!1261 = !{!1262, !1263, !1266, !1267, !1268, !1272, !1276, !1280}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1260, file: !14, line: 5797, baseType: !955, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1260, file: !14, line: 5804, baseType: !1264, size: 64, align: 64, offset: 64)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1260, file: !14, line: 5815, baseType: !987, size: 64, align: 64, offset: 128)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1260, file: !14, line: 5825, baseType: !918, size: 32, align: 32, offset: 192)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1260, file: !14, line: 5826, baseType: !1269, size: 64, align: 64, offset: 256)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!918, !1252}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1260, file: !14, line: 5827, baseType: !1273, size: 64, align: 64, offset: 320)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!918, !1252, !1222}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1260, file: !14, line: 5828, baseType: !1277, size: 64, align: 64, offset: 384)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{null, !1252}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1260, file: !14, line: 5829, baseType: !1277, size: 64, align: 64, offset: 448)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1254, file: !14, line: 5762, baseType: !1282, size: 64, align: 64, offset: 128)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1284)
!1284 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1254, file: !14, line: 5768, baseType: !939, size: 64, align: 64, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1254, file: !14, line: 5775, baseType: !1287, size: 64, align: 64, offset: 256)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1289)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1290)
!1290 = !{!1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1289, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1289, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1289, file: !14, line: 3948, baseType: !934, size: 32, align: 32, offset: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1289, file: !14, line: 3958, baseType: !943, size: 64, align: 64, offset: 128)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1289, file: !14, line: 3962, baseType: !918, size: 32, align: 32, offset: 192)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1289, file: !14, line: 3968, baseType: !918, size: 32, align: 32, offset: 224)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1289, file: !14, line: 3973, baseType: !1010, size: 64, align: 64, offset: 256)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1289, file: !14, line: 3986, baseType: !918, size: 32, align: 32, offset: 320)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1289, file: !14, line: 3999, baseType: !918, size: 32, align: 32, offset: 352)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1289, file: !14, line: 4004, baseType: !918, size: 32, align: 32, offset: 384)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1289, file: !14, line: 4005, baseType: !918, size: 32, align: 32, offset: 416)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1289, file: !14, line: 4010, baseType: !918, size: 32, align: 32, offset: 448)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1289, file: !14, line: 4011, baseType: !918, size: 32, align: 32, offset: 480)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1289, file: !14, line: 4020, baseType: !965, size: 64, align: 32, offset: 512)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1289, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1289, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1289, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1289, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1289, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1289, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1289, file: !14, line: 4039, baseType: !918, size: 32, align: 32, offset: 768)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1289, file: !14, line: 4046, baseType: !983, size: 64, align: 64, offset: 832)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1289, file: !14, line: 4050, baseType: !918, size: 32, align: 32, offset: 896)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1289, file: !14, line: 4054, baseType: !918, size: 32, align: 32, offset: 928)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1289, file: !14, line: 4061, baseType: !918, size: 32, align: 32, offset: 960)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1289, file: !14, line: 4065, baseType: !918, size: 32, align: 32, offset: 992)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1289, file: !14, line: 4073, baseType: !918, size: 32, align: 32, offset: 1024)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1289, file: !14, line: 4080, baseType: !918, size: 32, align: 32, offset: 1056)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1289, file: !14, line: 4084, baseType: !918, size: 32, align: 32, offset: 1088)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1254, file: !14, line: 5781, baseType: !1287, size: 64, align: 64, offset: 320)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1254, file: !14, line: 5787, baseType: !965, size: 64, align: 32, offset: 384)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1254, file: !14, line: 5793, baseType: !965, size: 64, align: 32, offset: 448)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1248, file: !1093, line: 126, baseType: !918, size: 32, align: 32, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1092, file: !1093, line: 172, baseType: !1222, size: 64, align: 64, offset: 576)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1092, file: !1093, line: 177, baseType: !943, size: 64, align: 64, offset: 640)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1092, file: !1093, line: 178, baseType: !919, size: 32, align: 32, offset: 704)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1092, file: !1093, line: 180, baseType: !939, size: 64, align: 64, offset: 768)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1092, file: !1093, line: 185, baseType: !918, size: 32, align: 32, offset: 832)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1092, file: !1093, line: 190, baseType: !939, size: 64, align: 64, offset: 896)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1092, file: !1093, line: 195, baseType: !918, size: 32, align: 32, offset: 960)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1092, file: !1093, line: 200, baseType: !1222, size: 64, align: 64, offset: 1024)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1092, file: !1093, line: 201, baseType: !918, size: 32, align: 32, offset: 1088)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1092, file: !1093, line: 202, baseType: !1099, size: 64, align: 64, offset: 1152)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1092, file: !1093, line: 203, baseType: !918, size: 32, align: 32, offset: 1216)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1092, file: !1093, line: 205, baseType: !918, size: 32, align: 32, offset: 1248)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1092, file: !1093, line: 206, baseType: !918, size: 32, align: 32, offset: 1280)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1092, file: !1093, line: 209, baseType: !1189, size: 64, align: 64, offset: 1344)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1092, file: !1093, line: 212, baseType: !1189, size: 64, align: 64, offset: 1408)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1092, file: !1093, line: 213, baseType: !1099, size: 64, align: 64, offset: 1472)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1092, file: !1093, line: 215, baseType: !918, size: 32, align: 32, offset: 1536)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1092, file: !1093, line: 217, baseType: !918, size: 32, align: 32, offset: 1568)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1092, file: !1093, line: 220, baseType: !918, size: 32, align: 32, offset: 1600)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1079, file: !14, line: 1598, baseType: !939, size: 64, align: 64, offset: 384)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1079, file: !14, line: 1606, baseType: !1010, size: 64, align: 64, offset: 448)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1079, file: !14, line: 1614, baseType: !918, size: 32, align: 32, offset: 512)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1079, file: !14, line: 1622, baseType: !918, size: 32, align: 32, offset: 544)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1079, file: !14, line: 1628, baseType: !918, size: 32, align: 32, offset: 576)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1079, file: !14, line: 1636, baseType: !918, size: 32, align: 32, offset: 608)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1079, file: !14, line: 1643, baseType: !918, size: 32, align: 32, offset: 640)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1079, file: !14, line: 1657, baseType: !943, size: 64, align: 64, offset: 704)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1079, file: !14, line: 1658, baseType: !918, size: 32, align: 32, offset: 768)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1079, file: !14, line: 1679, baseType: !965, size: 64, align: 32, offset: 800)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1079, file: !14, line: 1688, baseType: !918, size: 32, align: 32, offset: 864)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1079, file: !14, line: 1712, baseType: !918, size: 32, align: 32, offset: 896)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1079, file: !14, line: 1729, baseType: !918, size: 32, align: 32, offset: 928)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1079, file: !14, line: 1729, baseType: !918, size: 32, align: 32, offset: 960)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1079, file: !14, line: 1744, baseType: !918, size: 32, align: 32, offset: 992)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1079, file: !14, line: 1744, baseType: !918, size: 32, align: 32, offset: 1024)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1079, file: !14, line: 1751, baseType: !918, size: 32, align: 32, offset: 1056)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1079, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1079, file: !14, line: 1791, baseType: !1362, size: 64, align: 64, offset: 1152)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{null, !1365, !1366, !1368, !918, !918, !918}
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1100)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1079, file: !14, line: 1808, baseType: !1370, size: 64, align: 64, offset: 1216)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{!473, !1365, !972}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1079, file: !14, line: 1816, baseType: !918, size: 32, align: 32, offset: 1280)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1079, file: !14, line: 1825, baseType: !1375, size: 32, align: 32, offset: 1312)
!1375 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1079, file: !14, line: 1830, baseType: !918, size: 32, align: 32, offset: 1344)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1079, file: !14, line: 1838, baseType: !1375, size: 32, align: 32, offset: 1376)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1079, file: !14, line: 1846, baseType: !918, size: 32, align: 32, offset: 1408)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1079, file: !14, line: 1851, baseType: !918, size: 32, align: 32, offset: 1440)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1079, file: !14, line: 1861, baseType: !1375, size: 32, align: 32, offset: 1472)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1079, file: !14, line: 1868, baseType: !1375, size: 32, align: 32, offset: 1504)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1079, file: !14, line: 1875, baseType: !1375, size: 32, align: 32, offset: 1536)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1079, file: !14, line: 1882, baseType: !1375, size: 32, align: 32, offset: 1568)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1079, file: !14, line: 1889, baseType: !1375, size: 32, align: 32, offset: 1600)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1079, file: !14, line: 1896, baseType: !1375, size: 32, align: 32, offset: 1632)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1079, file: !14, line: 1903, baseType: !1375, size: 32, align: 32, offset: 1664)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1079, file: !14, line: 1910, baseType: !918, size: 32, align: 32, offset: 1696)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1079, file: !14, line: 1915, baseType: !918, size: 32, align: 32, offset: 1728)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1079, file: !14, line: 1926, baseType: !1368, size: 64, align: 64, offset: 1792)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1079, file: !14, line: 1935, baseType: !965, size: 64, align: 32, offset: 1856)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1079, file: !14, line: 1942, baseType: !918, size: 32, align: 32, offset: 1920)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1079, file: !14, line: 1948, baseType: !918, size: 32, align: 32, offset: 1952)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1079, file: !14, line: 1954, baseType: !918, size: 32, align: 32, offset: 1984)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1079, file: !14, line: 1960, baseType: !918, size: 32, align: 32, offset: 2016)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1079, file: !14, line: 1984, baseType: !918, size: 32, align: 32, offset: 2048)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1079, file: !14, line: 1991, baseType: !918, size: 32, align: 32, offset: 2080)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1079, file: !14, line: 1996, baseType: !918, size: 32, align: 32, offset: 2112)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1079, file: !14, line: 2004, baseType: !918, size: 32, align: 32, offset: 2144)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1079, file: !14, line: 2011, baseType: !918, size: 32, align: 32, offset: 2176)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1079, file: !14, line: 2018, baseType: !918, size: 32, align: 32, offset: 2208)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1079, file: !14, line: 2027, baseType: !918, size: 32, align: 32, offset: 2240)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1079, file: !14, line: 2034, baseType: !918, size: 32, align: 32, offset: 2272)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1079, file: !14, line: 2044, baseType: !918, size: 32, align: 32, offset: 2304)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1079, file: !14, line: 2054, baseType: !1405, size: 64, align: 64, offset: 2368)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1079, file: !14, line: 2061, baseType: !1405, size: 64, align: 64, offset: 2432)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1079, file: !14, line: 2066, baseType: !918, size: 32, align: 32, offset: 2496)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1079, file: !14, line: 2070, baseType: !918, size: 32, align: 32, offset: 2528)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1079, file: !14, line: 2078, baseType: !918, size: 32, align: 32, offset: 2560)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1079, file: !14, line: 2085, baseType: !918, size: 32, align: 32, offset: 2592)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1079, file: !14, line: 2092, baseType: !918, size: 32, align: 32, offset: 2624)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1079, file: !14, line: 2099, baseType: !918, size: 32, align: 32, offset: 2656)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1079, file: !14, line: 2106, baseType: !918, size: 32, align: 32, offset: 2688)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1079, file: !14, line: 2113, baseType: !918, size: 32, align: 32, offset: 2720)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1079, file: !14, line: 2120, baseType: !918, size: 32, align: 32, offset: 2752)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1079, file: !14, line: 2125, baseType: !918, size: 32, align: 32, offset: 2784)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1079, file: !14, line: 2133, baseType: !918, size: 32, align: 32, offset: 2816)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1079, file: !14, line: 2140, baseType: !918, size: 32, align: 32, offset: 2848)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1079, file: !14, line: 2145, baseType: !918, size: 32, align: 32, offset: 2880)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1079, file: !14, line: 2153, baseType: !918, size: 32, align: 32, offset: 2912)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1079, file: !14, line: 2158, baseType: !918, size: 32, align: 32, offset: 2944)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1079, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1079, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1079, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1079, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1079, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1079, file: !14, line: 2203, baseType: !918, size: 32, align: 32, offset: 3136)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1079, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1079, file: !14, line: 2212, baseType: !918, size: 32, align: 32, offset: 3200)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1079, file: !14, line: 2213, baseType: !918, size: 32, align: 32, offset: 3232)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1079, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1079, file: !14, line: 2232, baseType: !918, size: 32, align: 32, offset: 3296)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1079, file: !14, line: 2243, baseType: !918, size: 32, align: 32, offset: 3328)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1079, file: !14, line: 2249, baseType: !918, size: 32, align: 32, offset: 3360)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1079, file: !14, line: 2256, baseType: !918, size: 32, align: 32, offset: 3392)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1079, file: !14, line: 2263, baseType: !983, size: 64, align: 64, offset: 3456)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1079, file: !14, line: 2270, baseType: !983, size: 64, align: 64, offset: 3520)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1079, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1079, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1079, file: !14, line: 2367, baseType: !1441, size: 64, align: 64, offset: 3648)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DISubroutineType(types: !1443)
!1443 = !{!918, !1365, !1099, !918}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1079, file: !14, line: 2383, baseType: !918, size: 32, align: 32, offset: 3712)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1079, file: !14, line: 2386, baseType: !1375, size: 32, align: 32, offset: 3744)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1079, file: !14, line: 2387, baseType: !1375, size: 32, align: 32, offset: 3776)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1079, file: !14, line: 2394, baseType: !918, size: 32, align: 32, offset: 3808)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1079, file: !14, line: 2401, baseType: !918, size: 32, align: 32, offset: 3840)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1079, file: !14, line: 2408, baseType: !918, size: 32, align: 32, offset: 3872)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1079, file: !14, line: 2415, baseType: !918, size: 32, align: 32, offset: 3904)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1079, file: !14, line: 2422, baseType: !918, size: 32, align: 32, offset: 3936)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1079, file: !14, line: 2423, baseType: !1453, size: 64, align: 64, offset: 3968)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1455)
!1455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1456)
!1456 = !{!1457, !1458, !1459, !1460}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1455, file: !14, line: 827, baseType: !918, size: 32, align: 32)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1455, file: !14, line: 828, baseType: !918, size: 32, align: 32, offset: 32)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1455, file: !14, line: 829, baseType: !918, size: 32, align: 32, offset: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1455, file: !14, line: 830, baseType: !1375, size: 32, align: 32, offset: 96)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1079, file: !14, line: 2430, baseType: !1010, size: 64, align: 64, offset: 4032)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1079, file: !14, line: 2437, baseType: !1010, size: 64, align: 64, offset: 4096)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1079, file: !14, line: 2444, baseType: !1375, size: 32, align: 32, offset: 4160)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1079, file: !14, line: 2451, baseType: !1375, size: 32, align: 32, offset: 4192)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1079, file: !14, line: 2458, baseType: !918, size: 32, align: 32, offset: 4224)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1079, file: !14, line: 2469, baseType: !918, size: 32, align: 32, offset: 4256)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1079, file: !14, line: 2475, baseType: !918, size: 32, align: 32, offset: 4288)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1079, file: !14, line: 2481, baseType: !918, size: 32, align: 32, offset: 4320)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1079, file: !14, line: 2485, baseType: !918, size: 32, align: 32, offset: 4352)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1079, file: !14, line: 2489, baseType: !918, size: 32, align: 32, offset: 4384)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1079, file: !14, line: 2493, baseType: !918, size: 32, align: 32, offset: 4416)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1079, file: !14, line: 2501, baseType: !918, size: 32, align: 32, offset: 4448)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1079, file: !14, line: 2506, baseType: !918, size: 32, align: 32, offset: 4480)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1079, file: !14, line: 2510, baseType: !918, size: 32, align: 32, offset: 4512)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1079, file: !14, line: 2514, baseType: !1010, size: 64, align: 64, offset: 4544)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1079, file: !14, line: 2528, baseType: !1477, size: 64, align: 64, offset: 4608)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{null, !1365, !939, !918, !918}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1079, file: !14, line: 2534, baseType: !918, size: 32, align: 32, offset: 4672)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1079, file: !14, line: 2545, baseType: !918, size: 32, align: 32, offset: 4704)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1079, file: !14, line: 2547, baseType: !918, size: 32, align: 32, offset: 4736)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1079, file: !14, line: 2549, baseType: !918, size: 32, align: 32, offset: 4768)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1079, file: !14, line: 2551, baseType: !918, size: 32, align: 32, offset: 4800)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1079, file: !14, line: 2553, baseType: !918, size: 32, align: 32, offset: 4832)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1079, file: !14, line: 2555, baseType: !918, size: 32, align: 32, offset: 4864)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1079, file: !14, line: 2557, baseType: !918, size: 32, align: 32, offset: 4896)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1079, file: !14, line: 2559, baseType: !918, size: 32, align: 32, offset: 4928)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1079, file: !14, line: 2563, baseType: !918, size: 32, align: 32, offset: 4960)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1079, file: !14, line: 2571, baseType: !1491, size: 64, align: 64, offset: 4992)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1079, file: !14, line: 2579, baseType: !1491, size: 64, align: 64, offset: 5056)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1079, file: !14, line: 2586, baseType: !918, size: 32, align: 32, offset: 5120)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1079, file: !14, line: 2615, baseType: !918, size: 32, align: 32, offset: 5152)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1079, file: !14, line: 2627, baseType: !918, size: 32, align: 32, offset: 5184)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1079, file: !14, line: 2637, baseType: !918, size: 32, align: 32, offset: 5216)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1079, file: !14, line: 2681, baseType: !918, size: 32, align: 32, offset: 5248)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1079, file: !14, line: 2709, baseType: !1010, size: 64, align: 64, offset: 5312)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1079, file: !14, line: 2716, baseType: !1500, size: 64, align: 64, offset: 5376)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1502)
!1502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1503)
!1503 = !{!1504, !1505, !1506, !1507, !1508, !1509, !1513, !1517, !1521, !1522, !1523, !1524, !1530, !1531, !1532, !1533, !1534}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1502, file: !14, line: 3642, baseType: !955, size: 64, align: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1502, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1502, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1502, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1502, file: !14, line: 3669, baseType: !918, size: 32, align: 32, offset: 160)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1502, file: !14, line: 3682, baseType: !1510, size: 64, align: 64, offset: 192)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DISubroutineType(types: !1512)
!1512 = !{!918, !1077, !1099}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1502, file: !14, line: 3698, baseType: !1514, size: 64, align: 64, offset: 256)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{!918, !1077, !937, !934}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1502, file: !14, line: 3712, baseType: !1518, size: 64, align: 64, offset: 320)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{!918, !1077, !918, !937, !934}
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1502, file: !14, line: 3726, baseType: !1514, size: 64, align: 64, offset: 384)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1502, file: !14, line: 3737, baseType: !1074, size: 64, align: 64, offset: 448)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1502, file: !14, line: 3746, baseType: !918, size: 32, align: 32, offset: 512)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1502, file: !14, line: 3757, baseType: !1525, size: 64, align: 64, offset: 576)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DISubroutineType(types: !1527)
!1527 = !{null, !1528}
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1502, file: !14, line: 3766, baseType: !1074, size: 64, align: 64, offset: 640)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1502, file: !14, line: 3774, baseType: !1074, size: 64, align: 64, offset: 704)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1502, file: !14, line: 3780, baseType: !918, size: 32, align: 32, offset: 768)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1502, file: !14, line: 3785, baseType: !918, size: 32, align: 32, offset: 800)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1502, file: !14, line: 3795, baseType: !1535, size: 64, align: 64, offset: 832)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!918, !1077, !1136}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1079, file: !14, line: 2728, baseType: !939, size: 64, align: 64, offset: 5440)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1079, file: !14, line: 2735, baseType: !1126, size: 512, align: 64, offset: 5504)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1079, file: !14, line: 2742, baseType: !918, size: 32, align: 32, offset: 6016)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1079, file: !14, line: 2755, baseType: !918, size: 32, align: 32, offset: 6048)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1079, file: !14, line: 2776, baseType: !918, size: 32, align: 32, offset: 6080)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1079, file: !14, line: 2783, baseType: !918, size: 32, align: 32, offset: 6112)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1079, file: !14, line: 2791, baseType: !918, size: 32, align: 32, offset: 6144)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1079, file: !14, line: 2802, baseType: !1099, size: 64, align: 64, offset: 6208)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1079, file: !14, line: 2811, baseType: !918, size: 32, align: 32, offset: 6272)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1079, file: !14, line: 2821, baseType: !918, size: 32, align: 32, offset: 6304)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1079, file: !14, line: 2830, baseType: !918, size: 32, align: 32, offset: 6336)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1079, file: !14, line: 2840, baseType: !918, size: 32, align: 32, offset: 6368)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1079, file: !14, line: 2851, baseType: !1551, size: 64, align: 64, offset: 6400)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64, align: 64)
!1552 = !DISubroutineType(types: !1553)
!1553 = !{!918, !1365, !1554, !939, !1368, !918, !918}
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1555, size: 64, align: 64)
!1555 = !DISubroutineType(types: !1556)
!1556 = !{!918, !1365, !939}
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1079, file: !14, line: 2871, baseType: !1558, size: 64, align: 64, offset: 6464)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DISubroutineType(types: !1560)
!1560 = !{!918, !1365, !1561, !939, !1368, !918}
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{!918, !1365, !939, !918, !918}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1079, file: !14, line: 2878, baseType: !918, size: 32, align: 32, offset: 6528)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1079, file: !14, line: 2885, baseType: !918, size: 32, align: 32, offset: 6560)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1079, file: !14, line: 3005, baseType: !918, size: 32, align: 32, offset: 6592)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1079, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1079, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1079, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1079, file: !14, line: 3037, baseType: !943, size: 64, align: 64, offset: 6720)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1079, file: !14, line: 3038, baseType: !918, size: 32, align: 32, offset: 6784)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1079, file: !14, line: 3050, baseType: !983, size: 64, align: 64, offset: 6848)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1079, file: !14, line: 3065, baseType: !918, size: 32, align: 32, offset: 6912)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1079, file: !14, line: 3083, baseType: !918, size: 32, align: 32, offset: 6944)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1079, file: !14, line: 3092, baseType: !965, size: 64, align: 32, offset: 6976)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1079, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1079, file: !14, line: 3106, baseType: !965, size: 64, align: 32, offset: 7072)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1079, file: !14, line: 3113, baseType: !1579, size: 64, align: 64, offset: 7168)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1581)
!1581 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1582)
!1582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1583)
!1583 = !{!1584, !1585, !1586, !1587, !1588, !1589, !1592}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1582, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1582, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1582, file: !14, line: 720, baseType: !955, size: 64, align: 64, offset: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1582, file: !14, line: 724, baseType: !955, size: 64, align: 64, offset: 128)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1582, file: !14, line: 728, baseType: !918, size: 32, align: 32, offset: 192)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1582, file: !14, line: 734, baseType: !1590, size: 64, align: 64, offset: 256)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1582, file: !14, line: 739, baseType: !1593, size: 64, align: 64, offset: 320)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1065)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1079, file: !14, line: 3129, baseType: !1010, size: 64, align: 64, offset: 7232)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1079, file: !14, line: 3130, baseType: !1010, size: 64, align: 64, offset: 7296)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1079, file: !14, line: 3131, baseType: !1010, size: 64, align: 64, offset: 7360)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1079, file: !14, line: 3132, baseType: !1010, size: 64, align: 64, offset: 7424)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1079, file: !14, line: 3139, baseType: !1491, size: 64, align: 64, offset: 7488)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1079, file: !14, line: 3147, baseType: !918, size: 32, align: 32, offset: 7552)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1079, file: !14, line: 3165, baseType: !918, size: 32, align: 32, offset: 7584)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1079, file: !14, line: 3172, baseType: !918, size: 32, align: 32, offset: 7616)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1079, file: !14, line: 3180, baseType: !918, size: 32, align: 32, offset: 7648)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1079, file: !14, line: 3191, baseType: !1405, size: 64, align: 64, offset: 7680)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1079, file: !14, line: 3199, baseType: !943, size: 64, align: 64, offset: 7744)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1079, file: !14, line: 3207, baseType: !1491, size: 64, align: 64, offset: 7808)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1079, file: !14, line: 3214, baseType: !919, size: 32, align: 32, offset: 7872)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1079, file: !14, line: 3224, baseType: !1234, size: 64, align: 64, offset: 7936)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1079, file: !14, line: 3225, baseType: !918, size: 32, align: 32, offset: 8000)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1079, file: !14, line: 3249, baseType: !1136, size: 64, align: 64, offset: 8064)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1079, file: !14, line: 3256, baseType: !918, size: 32, align: 32, offset: 8128)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1079, file: !14, line: 3271, baseType: !918, size: 32, align: 32, offset: 8160)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1079, file: !14, line: 3279, baseType: !1010, size: 64, align: 64, offset: 8192)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1079, file: !14, line: 3301, baseType: !1136, size: 64, align: 64, offset: 8256)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1079, file: !14, line: 3310, baseType: !918, size: 32, align: 32, offset: 8320)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1079, file: !14, line: 3337, baseType: !918, size: 32, align: 32, offset: 8352)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1079, file: !14, line: 3351, baseType: !918, size: 32, align: 32, offset: 8384)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1079, file: !14, line: 3359, baseType: !918, size: 32, align: 32, offset: 8416)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !952, file: !14, line: 3535, baseType: !1620, size: 64, align: 64, offset: 1024)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64, align: 64)
!1621 = !DISubroutineType(types: !1622)
!1622 = !{!918, !1077, !1623}
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1078)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !952, file: !14, line: 3541, baseType: !1626, size: 64, align: 64, offset: 1088)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1628)
!1628 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1629)
!1629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1093, line: 223, size: 128, align: 64, elements: !1630)
!1630 = !{!1631, !1632}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1629, file: !1093, line: 224, baseType: !937, size: 64, align: 64)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1629, file: !1093, line: 225, baseType: !937, size: 64, align: 64, offset: 64)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !952, file: !14, line: 3549, baseType: !1634, size: 64, align: 64, offset: 1152)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DISubroutineType(types: !1636)
!1636 = !{null, !1072}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !952, file: !14, line: 3551, baseType: !1074, size: 64, align: 64, offset: 1216)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !952, file: !14, line: 3552, baseType: !1639, size: 64, align: 64, offset: 1280)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{!918, !1077, !943, !918, !1642}
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1644)
!1644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1645)
!1645 = !{!1646, !1647, !1648, !1649, !1650, !1674}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1644, file: !14, line: 3921, baseType: !926, size: 16, align: 16)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1644, file: !14, line: 3922, baseType: !934, size: 32, align: 32, offset: 32)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1644, file: !14, line: 3923, baseType: !934, size: 32, align: 32, offset: 64)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1644, file: !14, line: 3924, baseType: !919, size: 32, align: 32, offset: 96)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1644, file: !14, line: 3925, baseType: !1651, size: 64, align: 64, offset: 128)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1654)
!1654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1655)
!1655 = !{!1656, !1657, !1658, !1659, !1660, !1661, !1667, !1669, !1670, !1671, !1672, !1673}
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1654, file: !14, line: 3886, baseType: !918, size: 32, align: 32)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1654, file: !14, line: 3887, baseType: !918, size: 32, align: 32, offset: 32)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1654, file: !14, line: 3888, baseType: !918, size: 32, align: 32, offset: 64)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1654, file: !14, line: 3889, baseType: !918, size: 32, align: 32, offset: 96)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1654, file: !14, line: 3890, baseType: !918, size: 32, align: 32, offset: 128)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1654, file: !14, line: 3897, baseType: !1662, size: 768, align: 64, offset: 192)
!1662 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1663)
!1663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1664)
!1664 = !{!1665, !1666}
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1663, file: !14, line: 3855, baseType: !1104, size: 512, align: 64)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1663, file: !14, line: 3857, baseType: !1108, size: 256, align: 32, offset: 512)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1654, file: !14, line: 3903, baseType: !1668, size: 256, align: 64, offset: 960)
!1668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 256, align: 64, elements: !1205)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1654, file: !14, line: 3904, baseType: !1212, size: 128, align: 32, offset: 1216)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1654, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1654, file: !14, line: 3908, baseType: !1491, size: 64, align: 64, offset: 1408)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1654, file: !14, line: 3915, baseType: !1491, size: 64, align: 64, offset: 1472)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1654, file: !14, line: 3917, baseType: !918, size: 32, align: 32, offset: 1536)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1644, file: !14, line: 3926, baseType: !1010, size: 64, align: 64, offset: 192)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !952, file: !14, line: 3564, baseType: !1676, size: 64, align: 64, offset: 1344)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DISubroutineType(types: !1678)
!1678 = !{!918, !1077, !1222, !1366, !1368}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !952, file: !14, line: 3566, baseType: !1680, size: 64, align: 64, offset: 1408)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!918, !1077, !939, !1368, !1222}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !952, file: !14, line: 3567, baseType: !1074, size: 64, align: 64, offset: 1472)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !952, file: !14, line: 3576, baseType: !1685, size: 64, align: 64, offset: 1536)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DISubroutineType(types: !1687)
!1687 = !{!918, !1077, !1366}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !952, file: !14, line: 3577, baseType: !1689, size: 64, align: 64, offset: 1600)
