; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--hevc_refs.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--hevc_refs.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.HEVCContext = type { %struct.AVClass*, %struct.AVCodecContext*, [16 x %struct.HEVCContext*], [16 x %struct.HEVCLocalContext*], %struct.HEVCLocalContext*, i8, i8, i32, i32, i8*, i8, %struct.AVFrame*, %struct.AVFrame*, [3 x i8*], [3 x i8*], %struct.HEVCParamSets, %struct.HEVCSEI, %struct.AVMD5*, %struct.AVBufferPool*, %struct.AVBufferPool*, [5 x %struct.RefPicList], %struct.SliceHeader, %struct.SAOParams*, %struct.DBParams*, i32, i32, %struct.HEVCFrame*, [32 x %struct.HEVCFrame], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.HEVCPredContext, %struct.HEVCDSPContext, %struct.VideoDSPContext, %struct.BswapDSPContext, i8*, i8*, i8*, i32*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i16, i16, i32, i32, i8*, %struct.H2645Packet, i32, i8, i32, i32, i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!959 = !DIEnumerator(name: "HEVC_NAL_UNSPEC48", value: 48)
!960 = !DIEnumerator(name: "HEVC_NAL_UNSPEC49", value: 49)
!961 = !DIEnumerator(name: "HEVC_NAL_UNSPEC50", value: 50)
!962 = !DIEnumerator(name: "HEVC_NAL_UNSPEC51", value: 51)
!963 = !DIEnumerator(name: "HEVC_NAL_UNSPEC52", value: 52)
!964 = !DIEnumerator(name: "HEVC_NAL_UNSPEC53", value: 53)
!965 = !DIEnumerator(name: "HEVC_NAL_UNSPEC54", value: 54)
!966 = !DIEnumerator(name: "HEVC_NAL_UNSPEC55", value: 55)
!967 = !DIEnumerator(name: "HEVC_NAL_UNSPEC56", value: 56)
!968 = !DIEnumerator(name: "HEVC_NAL_UNSPEC57", value: 57)
!969 = !DIEnumerator(name: "HEVC_NAL_UNSPEC58", value: 58)
!970 = !DIEnumerator(name: "HEVC_NAL_UNSPEC59", value: 59)
!971 = !DIEnumerator(name: "HEVC_NAL_UNSPEC60", value: 60)
!972 = !DIEnumerator(name: "HEVC_NAL_UNSPEC61", value: 61)
!973 = !DIEnumerator(name: "HEVC_NAL_UNSPEC62", value: 62)
!974 = !DIEnumerator(name: "HEVC_NAL_UNSPEC63", value: 63)
!975 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RPSType", file: !888, line: 82, size: 32, align: 32, elements: !976)
!976 = !{!977, !978, !979, !980, !981, !982}
!977 = !DIEnumerator(name: "ST_CURR_BEF", value: 0)
!978 = !DIEnumerator(name: "ST_CURR_AFT", value: 1)
!979 = !DIEnumerator(name: "ST_FOLL", value: 2)
!980 = !DIEnumerator(name: "LT_CURR", value: 3)
!981 = !DIEnumerator(name: "LT_FOLL", value: 4)
!982 = !DIEnumerator(name: "NB_RPS_TYPE", value: 5)
!983 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !904, line: 101, size: 32, align: 32, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004}
!985 = !DIEnumerator(name: "HEVC_MAX_LAYERS", value: 63)
!986 = !DIEnumerator(name: "HEVC_MAX_SUB_LAYERS", value: 7)
!987 = !DIEnumerator(name: "HEVC_MAX_LAYER_SETS", value: 1024)
!988 = !DIEnumerator(name: "HEVC_MAX_VPS_COUNT", value: 16)
!989 = !DIEnumerator(name: "HEVC_MAX_SPS_COUNT", value: 16)
!990 = !DIEnumerator(name: "HEVC_MAX_PPS_COUNT", value: 64)
!991 = !DIEnumerator(name: "HEVC_MAX_DPB_SIZE", value: 16)
!992 = !DIEnumerator(name: "HEVC_MAX_REFS", value: 16)
!993 = !DIEnumerator(name: "HEVC_MAX_SHORT_TERM_REF_PIC_SETS", value: 64)
!994 = !DIEnumerator(name: "HEVC_MAX_LONG_TERM_REF_PICS", value: 32)
!995 = !DIEnumerator(name: "HEVC_MIN_LOG2_CTB_SIZE", value: 4)
!996 = !DIEnumerator(name: "HEVC_MAX_LOG2_CTB_SIZE", value: 6)
!997 = !DIEnumerator(name: "HEVC_MAX_CPB_CNT", value: 32)
!998 = !DIEnumerator(name: "HEVC_MAX_LUMA_PS", value: 35651584)
!999 = !DIEnumerator(name: "HEVC_MAX_WIDTH", value: 16888)
!1000 = !DIEnumerator(name: "HEVC_MAX_HEIGHT", value: 16888)
!1001 = !DIEnumerator(name: "HEVC_MAX_TILE_ROWS", value: 22)
!1002 = !DIEnumerator(name: "HEVC_MAX_TILE_COLUMNS", value: 20)
!1003 = !DIEnumerator(name: "HEVC_MAX_SLICE_SEGMENTS", value: 600)
!1004 = !DIEnumerator(name: "HEVC_MAX_ENTRY_POINT_OFFSETS", value: 2700)
!1005 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !35, line: 5085, size: 32, align: 32, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1010}
!1007 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!1008 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!1009 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!1010 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!1011 = !{!1012, !1013, !1037, !1271, !1767, !1785, !1786, !1808}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "RefPicList", file: !888, line: 236, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RefPicList", file: !888, line: 231, size: 2112, align: 64, elements: !1016)
!1016 = !{!1017, !1804, !1806, !1807}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1015, file: !888, line: 232, baseType: !1018, size: 1024, align: 64)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1019, size: 1024, align: 64, elements: !1802)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCFrame", file: !888, line: 311, size: 1024, align: 64, elements: !1021)
!1021 = !{!1022, !1135, !1766, !1783, !1784, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !1020, file: !888, line: 312, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1026)
!1026 = !{!1027, !1035, !1038, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1053, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1087, !1089, !1090, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1123, !1124, !1125, !1126, !1127, !1128, !1131, !1132, !1133, !1134}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1025, file: !758, line: 282, baseType: !1028, size: 512, align: 64)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 512, align: 64, elements: !1033)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1031, line: 48, baseType: !1032)
!1031 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1032 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1033 = !{!1034}
!1034 = !DISubrange(count: 8)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1025, file: !758, line: 299, baseType: !1036, size: 256, align: 32, offset: 512)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 256, align: 32, elements: !1033)
!1037 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1025, file: !758, line: 315, baseType: !1039, size: 64, align: 64, offset: 768)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1025, file: !758, line: 326, baseType: !1037, size: 32, align: 32, offset: 832)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1025, file: !758, line: 326, baseType: !1037, size: 32, align: 32, offset: 864)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1025, file: !758, line: 334, baseType: !1037, size: 32, align: 32, offset: 896)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1025, file: !758, line: 341, baseType: !1037, size: 32, align: 32, offset: 928)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1025, file: !758, line: 346, baseType: !1037, size: 32, align: 32, offset: 960)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1025, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1025, file: !758, line: 356, baseType: !1047, size: 64, align: 32, offset: 1024)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1048, line: 61, baseType: !1049)
!1048 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1048, line: 58, size: 64, align: 32, elements: !1050)
!1050 = !{!1051, !1052}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1049, file: !1048, line: 59, baseType: !1037, size: 32, align: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1049, file: !1048, line: 60, baseType: !1037, size: 32, align: 32, offset: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1025, file: !758, line: 361, baseType: !1054, size: 64, align: 64, offset: 1088)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1055, line: 197, baseType: !1056)
!1055 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1056 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1025, file: !758, line: 369, baseType: !1054, size: 64, align: 64, offset: 1152)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1025, file: !758, line: 377, baseType: !1054, size: 64, align: 64, offset: 1216)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1025, file: !758, line: 382, baseType: !1037, size: 32, align: 32, offset: 1280)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1025, file: !758, line: 386, baseType: !1037, size: 32, align: 32, offset: 1312)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1025, file: !758, line: 391, baseType: !1037, size: 32, align: 32, offset: 1344)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1025, file: !758, line: 396, baseType: !1012, size: 64, align: 64, offset: 1408)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1025, file: !758, line: 403, baseType: !1064, size: 512, align: 64, offset: 1472)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 512, align: 64, elements: !1033)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1031, line: 55, baseType: !1066)
!1066 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1025, file: !758, line: 410, baseType: !1037, size: 32, align: 32, offset: 1984)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1025, file: !758, line: 415, baseType: !1037, size: 32, align: 32, offset: 2016)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1025, file: !758, line: 420, baseType: !1037, size: 32, align: 32, offset: 2048)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1025, file: !758, line: 425, baseType: !1037, size: 32, align: 32, offset: 2080)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1025, file: !758, line: 435, baseType: !1054, size: 64, align: 64, offset: 2112)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1025, file: !758, line: 440, baseType: !1037, size: 32, align: 32, offset: 2176)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1025, file: !758, line: 445, baseType: !1065, size: 64, align: 64, offset: 2240)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1025, file: !758, line: 459, baseType: !1075, size: 512, align: 64, offset: 2304)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1076, size: 512, align: 64, elements: !1033)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1078, line: 94, baseType: !1079)
!1078 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1078, line: 81, size: 192, align: 64, elements: !1080)
!1080 = !{!1081, !1085, !1086}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1079, file: !1078, line: 82, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1078, line: 73, baseType: !1084)
!1084 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1078, line: 73, flags: DIFlagFwdDecl)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1079, file: !1078, line: 89, baseType: !1029, size: 64, align: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1079, file: !1078, line: 93, baseType: !1037, size: 32, align: 32, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1025, file: !758, line: 473, baseType: !1088, size: 64, align: 64, offset: 2816)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1025, file: !758, line: 477, baseType: !1037, size: 32, align: 32, offset: 2880)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1025, file: !758, line: 479, baseType: !1091, size: 64, align: 64, offset: 2944)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1094)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1095)
!1095 = !{!1096, !1097, !1098, !1099, !1104}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1094, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1094, file: !758, line: 203, baseType: !1029, size: 64, align: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1094, file: !758, line: 204, baseType: !1037, size: 32, align: 32, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1094, file: !758, line: 205, baseType: !1100, size: 64, align: 64, offset: 192)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1102, line: 86, baseType: !1103)
!1102 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1102, line: 86, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1094, file: !758, line: 206, baseType: !1076, size: 64, align: 64, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1025, file: !758, line: 480, baseType: !1037, size: 32, align: 32, offset: 3008)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1025, file: !758, line: 505, baseType: !1037, size: 32, align: 32, offset: 3040)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1025, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1025, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1025, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1025, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1025, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1025, file: !758, line: 532, baseType: !1054, size: 64, align: 64, offset: 3264)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1025, file: !758, line: 539, baseType: !1054, size: 64, align: 64, offset: 3328)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1025, file: !758, line: 547, baseType: !1054, size: 64, align: 64, offset: 3392)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1025, file: !758, line: 554, baseType: !1100, size: 64, align: 64, offset: 3456)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1025, file: !758, line: 563, baseType: !1037, size: 32, align: 32, offset: 3520)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1025, file: !758, line: 572, baseType: !1037, size: 32, align: 32, offset: 3552)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1025, file: !758, line: 581, baseType: !1037, size: 32, align: 32, offset: 3584)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1025, file: !758, line: 588, baseType: !1120, size: 64, align: 64, offset: 3648)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1055, line: 194, baseType: !1122)
!1122 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1025, file: !758, line: 593, baseType: !1037, size: 32, align: 32, offset: 3712)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1025, file: !758, line: 596, baseType: !1037, size: 32, align: 32, offset: 3744)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1025, file: !758, line: 599, baseType: !1076, size: 64, align: 64, offset: 3776)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1025, file: !758, line: 605, baseType: !1076, size: 64, align: 64, offset: 3840)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1025, file: !758, line: 616, baseType: !1076, size: 64, align: 64, offset: 3904)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1025, file: !758, line: 626, baseType: !1129, size: 64, align: 64, offset: 3968)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1130, line: 216, baseType: !1066)
!1130 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1025, file: !758, line: 627, baseType: !1129, size: 64, align: 64, offset: 4032)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1025, file: !758, line: 628, baseType: !1129, size: 64, align: 64, offset: 4096)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1025, file: !758, line: 629, baseType: !1129, size: 64, align: 64, offset: 4160)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1025, file: !758, line: 645, baseType: !1076, size: 64, align: 64, offset: 4224)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "tf", scope: !1020, file: !888, line: 313, baseType: !1136, size: 256, align: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFrame", file: !1137, line: 40, baseType: !1138)
!1137 = !DIFile(filename: "libavcodec/thread.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadFrame", file: !1137, line: 34, size: 256, align: 64, elements: !1139)
!1139 = !{!1140, !1141, !1765}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1138, file: !1137, line: 35, baseType: !1023, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1138, file: !1137, line: 36, baseType: !1142, size: 128, align: 64, offset: 64)
!1142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1143, size: 128, align: 64, elements: !1763)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1146)
!1146 = !{!1147, !1191, !1192, !1193, !1361, !1362, !1363, !1364, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1517, !1521, !1522, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1701, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1145, file: !35, line: 1561, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1150)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1151)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1152)
!1152 = !{!1153, !1157, !1161, !1165, !1166, !1167, !1168, !1172, !1178, !1180, !1184}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1151, file: !4, line: 72, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1156)
!1156 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1151, file: !4, line: 78, baseType: !1158, size: 64, align: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!1154, !1012}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1151, file: !4, line: 85, baseType: !1162, size: 64, align: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1164)
!1164 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1151, file: !4, line: 93, baseType: !1037, size: 32, align: 32, offset: 192)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1151, file: !4, line: 99, baseType: !1037, size: 32, align: 32, offset: 224)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1151, file: !4, line: 108, baseType: !1037, size: 32, align: 32, offset: 256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1151, file: !4, line: 113, baseType: !1169, size: 64, align: 64, offset: 320)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!1012, !1012, !1012}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1151, file: !4, line: 123, baseType: !1173, size: 64, align: 64, offset: 384)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!1176, !1176}
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1151)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1151, file: !4, line: 130, baseType: !1179, size: 32, align: 32, offset: 448)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1151, file: !4, line: 136, baseType: !1181, size: 64, align: 64, offset: 512)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!1179, !1012}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1151, file: !4, line: 142, baseType: !1185, size: 64, align: 64, offset: 576)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!1037, !1188, !1012, !1154, !1037}
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1145, file: !35, line: 1562, baseType: !1037, size: 32, align: 32, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1145, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1145, file: !35, line: 1565, baseType: !1194, size: 64, align: 64, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1196)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1197)
!1197 = !{!1198, !1199, !1200, !1201, !1202, !1203, !1206, !1209, !1212, !1215, !1218, !1219, !1220, !1228, !1229, !1230, !1232, !1236, !1242, !1253, !1257, !1258, !1303, !1333, !1337, !1338, !1342, !1346, !1350, !1354, !1355, !1356}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1196, file: !35, line: 3475, baseType: !1154, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1196, file: !35, line: 3480, baseType: !1154, size: 64, align: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1196, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1196, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1196, file: !35, line: 3487, baseType: !1037, size: 32, align: 32, offset: 192)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1196, file: !35, line: 3488, baseType: !1204, size: 64, align: 64, offset: 256)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1047)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1196, file: !35, line: 3489, baseType: !1207, size: 64, align: 64, offset: 320)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1196, file: !35, line: 3490, baseType: !1210, size: 64, align: 64, offset: 384)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1196, file: !35, line: 3491, baseType: !1213, size: 64, align: 64, offset: 448)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1196, file: !35, line: 3492, baseType: !1216, size: 64, align: 64, offset: 512)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1065)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1196, file: !35, line: 3493, baseType: !1030, size: 8, align: 8, offset: 576)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1196, file: !35, line: 3494, baseType: !1148, size: 64, align: 64, offset: 640)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1196, file: !35, line: 3495, baseType: !1221, size: 64, align: 64, offset: 704)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1223)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1224)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1225)
!1225 = !{!1226, !1227}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1224, file: !35, line: 3402, baseType: !1037, size: 32, align: 32)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1224, file: !35, line: 3403, baseType: !1154, size: 64, align: 64, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1196, file: !35, line: 3507, baseType: !1154, size: 64, align: 64, offset: 768)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1196, file: !35, line: 3516, baseType: !1037, size: 32, align: 32, offset: 832)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1196, file: !35, line: 3517, baseType: !1231, size: 64, align: 64, offset: 896)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1196, file: !35, line: 3527, baseType: !1233, size: 64, align: 64, offset: 960)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!1037, !1143}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1196, file: !35, line: 3535, baseType: !1237, size: 64, align: 64, offset: 1024)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!1037, !1143, !1240}
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1144)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1196, file: !35, line: 3541, baseType: !1243, size: 64, align: 64, offset: 1088)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1245)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1246)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1247, line: 223, size: 128, align: 64, elements: !1248)
!1247 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1248 = !{!1249, !1252}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1246, file: !1247, line: 224, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1030)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1246, file: !1247, line: 225, baseType: !1250, size: 64, align: 64, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1196, file: !35, line: 3549, baseType: !1254, size: 64, align: 64, offset: 1152)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{null, !1231}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1196, file: !35, line: 3551, baseType: !1233, size: 64, align: 64, offset: 1216)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1196, file: !35, line: 3552, baseType: !1259, size: 64, align: 64, offset: 1280)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!1037, !1143, !1029, !1037, !1262}
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1265)
!1265 = !{!1266, !1269, !1272, !1273, !1274, !1302}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1264, file: !35, line: 3921, baseType: !1267, size: 16, align: 16)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1031, line: 49, baseType: !1268)
!1268 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1264, file: !35, line: 3922, baseType: !1270, size: 32, align: 32, offset: 32)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1031, line: 51, baseType: !1271)
!1271 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1264, file: !35, line: 3923, baseType: !1270, size: 32, align: 32, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1264, file: !35, line: 3924, baseType: !1271, size: 32, align: 32, offset: 96)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1264, file: !35, line: 3925, baseType: !1275, size: 64, align: 64, offset: 128)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1278)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1279)
!1279 = !{!1280, !1281, !1282, !1283, !1284, !1285, !1291, !1295, !1297, !1298, !1300, !1301}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1278, file: !35, line: 3886, baseType: !1037, size: 32, align: 32)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1278, file: !35, line: 3887, baseType: !1037, size: 32, align: 32, offset: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1278, file: !35, line: 3888, baseType: !1037, size: 32, align: 32, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1278, file: !35, line: 3889, baseType: !1037, size: 32, align: 32, offset: 96)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1278, file: !35, line: 3890, baseType: !1037, size: 32, align: 32, offset: 128)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1278, file: !35, line: 3897, baseType: !1286, size: 768, align: 64, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1287)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1288)
!1288 = !{!1289, !1290}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1287, file: !35, line: 3855, baseType: !1028, size: 512, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1287, file: !35, line: 3857, baseType: !1036, size: 256, align: 32, offset: 512)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1278, file: !35, line: 3903, baseType: !1292, size: 256, align: 64, offset: 960)
!1292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 256, align: 64, elements: !1293)
!1293 = !{!1294}
!1294 = !DISubrange(count: 4)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1278, file: !35, line: 3904, baseType: !1296, size: 128, align: 32, offset: 1216)
!1296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 128, align: 32, elements: !1293)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1278, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1278, file: !35, line: 3908, baseType: !1299, size: 64, align: 64, offset: 1408)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1278, file: !35, line: 3915, baseType: !1299, size: 64, align: 64, offset: 1472)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1278, file: !35, line: 3917, baseType: !1037, size: 32, align: 32, offset: 1536)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1264, file: !35, line: 3926, baseType: !1054, size: 64, align: 64, offset: 192)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1196, file: !35, line: 3564, baseType: !1304, size: 64, align: 64, offset: 1344)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{!1037, !1143, !1307, !1330, !1332}
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1309)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1310)
!1310 = !{!1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1326, !1327, !1328, !1329}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1309, file: !35, line: 1451, baseType: !1076, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1309, file: !35, line: 1461, baseType: !1054, size: 64, align: 64, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1309, file: !35, line: 1467, baseType: !1054, size: 64, align: 64, offset: 128)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1309, file: !35, line: 1468, baseType: !1029, size: 64, align: 64, offset: 192)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1309, file: !35, line: 1469, baseType: !1037, size: 32, align: 32, offset: 256)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1309, file: !35, line: 1470, baseType: !1037, size: 32, align: 32, offset: 288)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1309, file: !35, line: 1474, baseType: !1037, size: 32, align: 32, offset: 320)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1309, file: !35, line: 1479, baseType: !1319, size: 64, align: 64, offset: 384)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1321)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1322)
!1322 = !{!1323, !1324, !1325}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1321, file: !35, line: 1412, baseType: !1029, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1321, file: !35, line: 1413, baseType: !1037, size: 32, align: 32, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1321, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1309, file: !35, line: 1480, baseType: !1037, size: 32, align: 32, offset: 448)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1309, file: !35, line: 1486, baseType: !1054, size: 64, align: 64, offset: 512)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1309, file: !35, line: 1488, baseType: !1054, size: 64, align: 64, offset: 576)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1309, file: !35, line: 1497, baseType: !1054, size: 64, align: 64, offset: 640)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1024)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1196, file: !35, line: 3566, baseType: !1334, size: 64, align: 64, offset: 1408)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DISubroutineType(types: !1336)
!1336 = !{!1037, !1143, !1012, !1332, !1307}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1196, file: !35, line: 3567, baseType: !1233, size: 64, align: 64, offset: 1472)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1196, file: !35, line: 3576, baseType: !1339, size: 64, align: 64, offset: 1536)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DISubroutineType(types: !1341)
!1341 = !{!1037, !1143, !1330}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1196, file: !35, line: 3577, baseType: !1343, size: 64, align: 64, offset: 1600)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{!1037, !1143, !1307}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1196, file: !35, line: 3584, baseType: !1347, size: 64, align: 64, offset: 1664)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{!1037, !1143, !1023}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1196, file: !35, line: 3589, baseType: !1351, size: 64, align: 64, offset: 1728)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{null, !1143}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1196, file: !35, line: 3594, baseType: !1037, size: 32, align: 32, offset: 1792)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1196, file: !35, line: 3600, baseType: !1154, size: 64, align: 64, offset: 1856)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1196, file: !35, line: 3609, baseType: !1357, size: 64, align: 64, offset: 1920)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1360)
!1360 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1145, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1145, file: !35, line: 1581, baseType: !1271, size: 32, align: 32, offset: 224)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1145, file: !35, line: 1583, baseType: !1012, size: 64, align: 64, offset: 256)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1145, file: !35, line: 1591, baseType: !1365, size: 64, align: 64, offset: 320)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1247, line: 129, size: 1664, align: 64, elements: !1367)
!1367 = !{!1368, !1369, !1370, !1371, !1372, !1390, !1391, !1397, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1366, file: !1247, line: 136, baseType: !1037, size: 32, align: 32)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1366, file: !1247, line: 151, baseType: !1037, size: 32, align: 32, offset: 32)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1366, file: !1247, line: 157, baseType: !1037, size: 32, align: 32, offset: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1366, file: !1247, line: 159, baseType: !1023, size: 64, align: 64, offset: 128)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1366, file: !1247, line: 161, baseType: !1373, size: 64, align: 64, offset: 192)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1247, line: 117, baseType: !1375)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1247, line: 100, size: 832, align: 64, elements: !1376)
!1376 = !{!1377, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1375, file: !1247, line: 105, baseType: !1378, size: 256, align: 64)
!1378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1379, size: 256, align: 64, elements: !1293)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1078, line: 238, baseType: !1381)
!1381 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1078, line: 238, flags: DIFlagFwdDecl)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1375, file: !1247, line: 110, baseType: !1037, size: 32, align: 32, offset: 256)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1375, file: !1247, line: 111, baseType: !1037, size: 32, align: 32, offset: 288)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1375, file: !1247, line: 111, baseType: !1037, size: 32, align: 32, offset: 320)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1375, file: !1247, line: 112, baseType: !1036, size: 256, align: 32, offset: 352)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1375, file: !1247, line: 113, baseType: !1296, size: 128, align: 32, offset: 608)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1375, file: !1247, line: 114, baseType: !1037, size: 32, align: 32, offset: 736)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1375, file: !1247, line: 115, baseType: !1037, size: 32, align: 32, offset: 768)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1375, file: !1247, line: 116, baseType: !1037, size: 32, align: 32, offset: 800)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1366, file: !1247, line: 163, baseType: !1012, size: 64, align: 64, offset: 256)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1366, file: !1247, line: 165, baseType: !1392, size: 128, align: 64, offset: 320)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1247, line: 122, baseType: !1393)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1247, line: 119, size: 128, align: 64, elements: !1394)
!1394 = !{!1395, !1396}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1393, file: !1247, line: 120, baseType: !1307, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1393, file: !1247, line: 121, baseType: !1023, size: 64, align: 64, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1366, file: !1247, line: 166, baseType: !1398, size: 128, align: 64, offset: 448)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1247, line: 127, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1247, line: 124, size: 128, align: 64, elements: !1400)
!1400 = !{!1401, !1474}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1399, file: !1247, line: 125, baseType: !1402, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1405)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1406)
!1406 = !{!1407, !1408, !1432, !1436, !1437, !1471, !1472, !1473}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1405, file: !35, line: 5751, baseType: !1148, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1405, file: !35, line: 5756, baseType: !1409, size: 64, align: 64, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1411)
!1411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1412)
!1412 = !{!1413, !1414, !1417, !1418, !1419, !1423, !1427, !1431}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1411, file: !35, line: 5797, baseType: !1154, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1411, file: !35, line: 5804, baseType: !1415, size: 64, align: 64, offset: 64)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1411, file: !35, line: 5815, baseType: !1148, size: 64, align: 64, offset: 128)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1411, file: !35, line: 5825, baseType: !1037, size: 32, align: 32, offset: 192)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1411, file: !35, line: 5826, baseType: !1420, size: 64, align: 64, offset: 256)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DISubroutineType(types: !1422)
!1422 = !{!1037, !1403}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1411, file: !35, line: 5827, baseType: !1424, size: 64, align: 64, offset: 320)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DISubroutineType(types: !1426)
!1426 = !{!1037, !1403, !1307}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1411, file: !35, line: 5828, baseType: !1428, size: 64, align: 64, offset: 384)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{null, !1403}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1411, file: !35, line: 5829, baseType: !1428, size: 64, align: 64, offset: 448)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1405, file: !35, line: 5762, baseType: !1433, size: 64, align: 64, offset: 128)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1435)
!1435 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1405, file: !35, line: 5768, baseType: !1012, size: 64, align: 64, offset: 192)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1405, file: !35, line: 5775, baseType: !1438, size: 64, align: 64, offset: 256)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1440)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1441)
!1441 = !{!1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1440, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1440, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1440, file: !35, line: 3948, baseType: !1270, size: 32, align: 32, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1440, file: !35, line: 3958, baseType: !1029, size: 64, align: 64, offset: 128)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1440, file: !35, line: 3962, baseType: !1037, size: 32, align: 32, offset: 192)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1440, file: !35, line: 3968, baseType: !1037, size: 32, align: 32, offset: 224)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1440, file: !35, line: 3973, baseType: !1054, size: 64, align: 64, offset: 256)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1440, file: !35, line: 3986, baseType: !1037, size: 32, align: 32, offset: 320)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1440, file: !35, line: 3999, baseType: !1037, size: 32, align: 32, offset: 352)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1440, file: !35, line: 4004, baseType: !1037, size: 32, align: 32, offset: 384)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1440, file: !35, line: 4005, baseType: !1037, size: 32, align: 32, offset: 416)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1440, file: !35, line: 4010, baseType: !1037, size: 32, align: 32, offset: 448)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1440, file: !35, line: 4011, baseType: !1037, size: 32, align: 32, offset: 480)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1440, file: !35, line: 4020, baseType: !1047, size: 64, align: 32, offset: 512)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1440, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1440, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1440, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1440, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1440, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1440, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1440, file: !35, line: 4039, baseType: !1037, size: 32, align: 32, offset: 768)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1440, file: !35, line: 4046, baseType: !1065, size: 64, align: 64, offset: 832)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1440, file: !35, line: 4050, baseType: !1037, size: 32, align: 32, offset: 896)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1440, file: !35, line: 4054, baseType: !1037, size: 32, align: 32, offset: 928)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1440, file: !35, line: 4061, baseType: !1037, size: 32, align: 32, offset: 960)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1440, file: !35, line: 4065, baseType: !1037, size: 32, align: 32, offset: 992)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1440, file: !35, line: 4073, baseType: !1037, size: 32, align: 32, offset: 1024)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1440, file: !35, line: 4080, baseType: !1037, size: 32, align: 32, offset: 1056)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1440, file: !35, line: 4084, baseType: !1037, size: 32, align: 32, offset: 1088)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1405, file: !35, line: 5781, baseType: !1438, size: 64, align: 64, offset: 320)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1405, file: !35, line: 5787, baseType: !1047, size: 64, align: 32, offset: 384)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1405, file: !35, line: 5793, baseType: !1047, size: 64, align: 32, offset: 448)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1399, file: !1247, line: 126, baseType: !1037, size: 32, align: 32, offset: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1366, file: !1247, line: 172, baseType: !1307, size: 64, align: 64, offset: 576)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1366, file: !1247, line: 177, baseType: !1029, size: 64, align: 64, offset: 640)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1366, file: !1247, line: 178, baseType: !1271, size: 32, align: 32, offset: 704)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1366, file: !1247, line: 180, baseType: !1012, size: 64, align: 64, offset: 768)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1366, file: !1247, line: 185, baseType: !1037, size: 32, align: 32, offset: 832)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1366, file: !1247, line: 190, baseType: !1012, size: 64, align: 64, offset: 896)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1366, file: !1247, line: 195, baseType: !1037, size: 32, align: 32, offset: 960)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1366, file: !1247, line: 200, baseType: !1307, size: 64, align: 64, offset: 1024)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1366, file: !1247, line: 201, baseType: !1037, size: 32, align: 32, offset: 1088)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1366, file: !1247, line: 202, baseType: !1023, size: 64, align: 64, offset: 1152)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1366, file: !1247, line: 203, baseType: !1037, size: 32, align: 32, offset: 1216)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1366, file: !1247, line: 205, baseType: !1037, size: 32, align: 32, offset: 1248)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1366, file: !1247, line: 206, baseType: !1037, size: 32, align: 32, offset: 1280)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1366, file: !1247, line: 209, baseType: !1129, size: 64, align: 64, offset: 1344)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1366, file: !1247, line: 212, baseType: !1129, size: 64, align: 64, offset: 1408)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1366, file: !1247, line: 213, baseType: !1023, size: 64, align: 64, offset: 1472)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1366, file: !1247, line: 215, baseType: !1037, size: 32, align: 32, offset: 1536)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1366, file: !1247, line: 217, baseType: !1037, size: 32, align: 32, offset: 1568)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1366, file: !1247, line: 220, baseType: !1037, size: 32, align: 32, offset: 1600)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1145, file: !35, line: 1598, baseType: !1012, size: 64, align: 64, offset: 384)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1145, file: !35, line: 1606, baseType: !1054, size: 64, align: 64, offset: 448)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1145, file: !35, line: 1614, baseType: !1037, size: 32, align: 32, offset: 512)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1145, file: !35, line: 1622, baseType: !1037, size: 32, align: 32, offset: 544)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1145, file: !35, line: 1628, baseType: !1037, size: 32, align: 32, offset: 576)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1145, file: !35, line: 1636, baseType: !1037, size: 32, align: 32, offset: 608)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1145, file: !35, line: 1643, baseType: !1037, size: 32, align: 32, offset: 640)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1145, file: !35, line: 1657, baseType: !1029, size: 64, align: 64, offset: 704)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1145, file: !35, line: 1658, baseType: !1037, size: 32, align: 32, offset: 768)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1145, file: !35, line: 1679, baseType: !1047, size: 64, align: 32, offset: 800)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1145, file: !35, line: 1688, baseType: !1037, size: 32, align: 32, offset: 864)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1145, file: !35, line: 1712, baseType: !1037, size: 32, align: 32, offset: 896)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1145, file: !35, line: 1729, baseType: !1037, size: 32, align: 32, offset: 928)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1145, file: !35, line: 1729, baseType: !1037, size: 32, align: 32, offset: 960)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1145, file: !35, line: 1744, baseType: !1037, size: 32, align: 32, offset: 992)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1145, file: !35, line: 1744, baseType: !1037, size: 32, align: 32, offset: 1024)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1145, file: !35, line: 1751, baseType: !1037, size: 32, align: 32, offset: 1056)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1145, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1145, file: !35, line: 1791, baseType: !1513, size: 64, align: 64, offset: 1152)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{null, !1516, !1330, !1332, !1037, !1037, !1037}
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1145, file: !35, line: 1808, baseType: !1518, size: 64, align: 64, offset: 1216)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{!494, !1516, !1207}
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1145, file: !35, line: 1816, baseType: !1037, size: 32, align: 32, offset: 1280)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1145, file: !35, line: 1825, baseType: !1523, size: 32, align: 32, offset: 1312)
!1523 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1145, file: !35, line: 1830, baseType: !1037, size: 32, align: 32, offset: 1344)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1145, file: !35, line: 1838, baseType: !1523, size: 32, align: 32, offset: 1376)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1145, file: !35, line: 1846, baseType: !1037, size: 32, align: 32, offset: 1408)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1145, file: !35, line: 1851, baseType: !1037, size: 32, align: 32, offset: 1440)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1145, file: !35, line: 1861, baseType: !1523, size: 32, align: 32, offset: 1472)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1145, file: !35, line: 1868, baseType: !1523, size: 32, align: 32, offset: 1504)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1145, file: !35, line: 1875, baseType: !1523, size: 32, align: 32, offset: 1536)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1145, file: !35, line: 1882, baseType: !1523, size: 32, align: 32, offset: 1568)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1145, file: !35, line: 1889, baseType: !1523, size: 32, align: 32, offset: 1600)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1145, file: !35, line: 1896, baseType: !1523, size: 32, align: 32, offset: 1632)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1145, file: !35, line: 1903, baseType: !1523, size: 32, align: 32, offset: 1664)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1145, file: !35, line: 1910, baseType: !1037, size: 32, align: 32, offset: 1696)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1145, file: !35, line: 1915, baseType: !1037, size: 32, align: 32, offset: 1728)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1145, file: !35, line: 1926, baseType: !1332, size: 64, align: 64, offset: 1792)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1145, file: !35, line: 1935, baseType: !1047, size: 64, align: 32, offset: 1856)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1145, file: !35, line: 1942, baseType: !1037, size: 32, align: 32, offset: 1920)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1145, file: !35, line: 1948, baseType: !1037, size: 32, align: 32, offset: 1952)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1145, file: !35, line: 1954, baseType: !1037, size: 32, align: 32, offset: 1984)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1145, file: !35, line: 1960, baseType: !1037, size: 32, align: 32, offset: 2016)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1145, file: !35, line: 1984, baseType: !1037, size: 32, align: 32, offset: 2048)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1145, file: !35, line: 1991, baseType: !1037, size: 32, align: 32, offset: 2080)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1145, file: !35, line: 1996, baseType: !1037, size: 32, align: 32, offset: 2112)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1145, file: !35, line: 2004, baseType: !1037, size: 32, align: 32, offset: 2144)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1145, file: !35, line: 2011, baseType: !1037, size: 32, align: 32, offset: 2176)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1145, file: !35, line: 2018, baseType: !1037, size: 32, align: 32, offset: 2208)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1145, file: !35, line: 2027, baseType: !1037, size: 32, align: 32, offset: 2240)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1145, file: !35, line: 2034, baseType: !1037, size: 32, align: 32, offset: 2272)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1145, file: !35, line: 2044, baseType: !1037, size: 32, align: 32, offset: 2304)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1145, file: !35, line: 2054, baseType: !1553, size: 64, align: 64, offset: 2368)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1145, file: !35, line: 2061, baseType: !1553, size: 64, align: 64, offset: 2432)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1145, file: !35, line: 2066, baseType: !1037, size: 32, align: 32, offset: 2496)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1145, file: !35, line: 2070, baseType: !1037, size: 32, align: 32, offset: 2528)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1145, file: !35, line: 2078, baseType: !1037, size: 32, align: 32, offset: 2560)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1145, file: !35, line: 2085, baseType: !1037, size: 32, align: 32, offset: 2592)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1145, file: !35, line: 2092, baseType: !1037, size: 32, align: 32, offset: 2624)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1145, file: !35, line: 2099, baseType: !1037, size: 32, align: 32, offset: 2656)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1145, file: !35, line: 2106, baseType: !1037, size: 32, align: 32, offset: 2688)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1145, file: !35, line: 2113, baseType: !1037, size: 32, align: 32, offset: 2720)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1145, file: !35, line: 2120, baseType: !1037, size: 32, align: 32, offset: 2752)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1145, file: !35, line: 2125, baseType: !1037, size: 32, align: 32, offset: 2784)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1145, file: !35, line: 2133, baseType: !1037, size: 32, align: 32, offset: 2816)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1145, file: !35, line: 2140, baseType: !1037, size: 32, align: 32, offset: 2848)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1145, file: !35, line: 2145, baseType: !1037, size: 32, align: 32, offset: 2880)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1145, file: !35, line: 2153, baseType: !1037, size: 32, align: 32, offset: 2912)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1145, file: !35, line: 2158, baseType: !1037, size: 32, align: 32, offset: 2944)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1145, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1145, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1145, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1145, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1145, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1145, file: !35, line: 2203, baseType: !1037, size: 32, align: 32, offset: 3136)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1145, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1145, file: !35, line: 2212, baseType: !1037, size: 32, align: 32, offset: 3200)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1145, file: !35, line: 2213, baseType: !1037, size: 32, align: 32, offset: 3232)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1145, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1145, file: !35, line: 2232, baseType: !1037, size: 32, align: 32, offset: 3296)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1145, file: !35, line: 2243, baseType: !1037, size: 32, align: 32, offset: 3328)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1145, file: !35, line: 2249, baseType: !1037, size: 32, align: 32, offset: 3360)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1145, file: !35, line: 2256, baseType: !1037, size: 32, align: 32, offset: 3392)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1145, file: !35, line: 2263, baseType: !1065, size: 64, align: 64, offset: 3456)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1145, file: !35, line: 2270, baseType: !1065, size: 64, align: 64, offset: 3520)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1145, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1145, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1145, file: !35, line: 2367, baseType: !1589, size: 64, align: 64, offset: 3648)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DISubroutineType(types: !1591)
!1591 = !{!1037, !1516, !1023, !1037}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1145, file: !35, line: 2383, baseType: !1037, size: 32, align: 32, offset: 3712)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1145, file: !35, line: 2386, baseType: !1523, size: 32, align: 32, offset: 3744)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1145, file: !35, line: 2387, baseType: !1523, size: 32, align: 32, offset: 3776)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1145, file: !35, line: 2394, baseType: !1037, size: 32, align: 32, offset: 3808)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1145, file: !35, line: 2401, baseType: !1037, size: 32, align: 32, offset: 3840)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1145, file: !35, line: 2408, baseType: !1037, size: 32, align: 32, offset: 3872)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1145, file: !35, line: 2415, baseType: !1037, size: 32, align: 32, offset: 3904)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1145, file: !35, line: 2422, baseType: !1037, size: 32, align: 32, offset: 3936)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1145, file: !35, line: 2423, baseType: !1601, size: 64, align: 64, offset: 3968)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1603)
!1603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1604)
!1604 = !{!1605, !1606, !1607, !1608}
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1603, file: !35, line: 827, baseType: !1037, size: 32, align: 32)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1603, file: !35, line: 828, baseType: !1037, size: 32, align: 32, offset: 32)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1603, file: !35, line: 829, baseType: !1037, size: 32, align: 32, offset: 64)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1603, file: !35, line: 830, baseType: !1523, size: 32, align: 32, offset: 96)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1145, file: !35, line: 2430, baseType: !1054, size: 64, align: 64, offset: 4032)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1145, file: !35, line: 2437, baseType: !1054, size: 64, align: 64, offset: 4096)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1145, file: !35, line: 2444, baseType: !1523, size: 32, align: 32, offset: 4160)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1145, file: !35, line: 2451, baseType: !1523, size: 32, align: 32, offset: 4192)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1145, file: !35, line: 2458, baseType: !1037, size: 32, align: 32, offset: 4224)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1145, file: !35, line: 2469, baseType: !1037, size: 32, align: 32, offset: 4256)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1145, file: !35, line: 2475, baseType: !1037, size: 32, align: 32, offset: 4288)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1145, file: !35, line: 2481, baseType: !1037, size: 32, align: 32, offset: 4320)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1145, file: !35, line: 2485, baseType: !1037, size: 32, align: 32, offset: 4352)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1145, file: !35, line: 2489, baseType: !1037, size: 32, align: 32, offset: 4384)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1145, file: !35, line: 2493, baseType: !1037, size: 32, align: 32, offset: 4416)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1145, file: !35, line: 2501, baseType: !1037, size: 32, align: 32, offset: 4448)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1145, file: !35, line: 2506, baseType: !1037, size: 32, align: 32, offset: 4480)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1145, file: !35, line: 2510, baseType: !1037, size: 32, align: 32, offset: 4512)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1145, file: !35, line: 2514, baseType: !1054, size: 64, align: 64, offset: 4544)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1145, file: !35, line: 2528, baseType: !1625, size: 64, align: 64, offset: 4608)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DISubroutineType(types: !1627)
!1627 = !{null, !1516, !1012, !1037, !1037}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1145, file: !35, line: 2534, baseType: !1037, size: 32, align: 32, offset: 4672)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1145, file: !35, line: 2545, baseType: !1037, size: 32, align: 32, offset: 4704)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1145, file: !35, line: 2547, baseType: !1037, size: 32, align: 32, offset: 4736)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1145, file: !35, line: 2549, baseType: !1037, size: 32, align: 32, offset: 4768)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1145, file: !35, line: 2551, baseType: !1037, size: 32, align: 32, offset: 4800)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1145, file: !35, line: 2553, baseType: !1037, size: 32, align: 32, offset: 4832)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1145, file: !35, line: 2555, baseType: !1037, size: 32, align: 32, offset: 4864)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1145, file: !35, line: 2557, baseType: !1037, size: 32, align: 32, offset: 4896)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1145, file: !35, line: 2559, baseType: !1037, size: 32, align: 32, offset: 4928)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1145, file: !35, line: 2563, baseType: !1037, size: 32, align: 32, offset: 4960)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1145, file: !35, line: 2571, baseType: !1299, size: 64, align: 64, offset: 4992)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1145, file: !35, line: 2579, baseType: !1299, size: 64, align: 64, offset: 5056)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1145, file: !35, line: 2586, baseType: !1037, size: 32, align: 32, offset: 5120)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1145, file: !35, line: 2615, baseType: !1037, size: 32, align: 32, offset: 5152)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1145, file: !35, line: 2627, baseType: !1037, size: 32, align: 32, offset: 5184)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1145, file: !35, line: 2637, baseType: !1037, size: 32, align: 32, offset: 5216)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1145, file: !35, line: 2681, baseType: !1037, size: 32, align: 32, offset: 5248)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1145, file: !35, line: 2709, baseType: !1054, size: 64, align: 64, offset: 5312)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1145, file: !35, line: 2716, baseType: !1647, size: 64, align: 64, offset: 5376)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1649)
!1649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1650)
!1650 = !{!1651, !1652, !1653, !1654, !1655, !1656, !1657, !1661, !1665, !1666, !1667, !1668, !1674, !1675, !1676, !1677, !1678}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1649, file: !35, line: 3642, baseType: !1154, size: 64, align: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1649, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1649, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1649, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1649, file: !35, line: 3669, baseType: !1037, size: 32, align: 32, offset: 160)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1649, file: !35, line: 3682, baseType: !1347, size: 64, align: 64, offset: 192)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1649, file: !35, line: 3698, baseType: !1658, size: 64, align: 64, offset: 256)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{!1037, !1143, !1250, !1270}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1649, file: !35, line: 3712, baseType: !1662, size: 64, align: 64, offset: 320)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DISubroutineType(types: !1664)
!1664 = !{!1037, !1143, !1037, !1250, !1270}
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1649, file: !35, line: 3726, baseType: !1658, size: 64, align: 64, offset: 384)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1649, file: !35, line: 3737, baseType: !1233, size: 64, align: 64, offset: 448)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1649, file: !35, line: 3746, baseType: !1037, size: 32, align: 32, offset: 512)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1649, file: !35, line: 3757, baseType: !1669, size: 64, align: 64, offset: 576)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DISubroutineType(types: !1671)
!1671 = !{null, !1672}
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1649, file: !35, line: 3766, baseType: !1233, size: 64, align: 64, offset: 640)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1649, file: !35, line: 3774, baseType: !1233, size: 64, align: 64, offset: 704)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1649, file: !35, line: 3780, baseType: !1037, size: 32, align: 32, offset: 768)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1649, file: !35, line: 3785, baseType: !1037, size: 32, align: 32, offset: 800)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1649, file: !35, line: 3795, baseType: !1679, size: 64, align: 64, offset: 832)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DISubroutineType(types: !1681)
!1681 = !{!1037, !1143, !1076}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1145, file: !35, line: 2728, baseType: !1012, size: 64, align: 64, offset: 5440)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1145, file: !35, line: 2735, baseType: !1064, size: 512, align: 64, offset: 5504)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1145, file: !35, line: 2742, baseType: !1037, size: 32, align: 32, offset: 6016)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1145, file: !35, line: 2755, baseType: !1037, size: 32, align: 32, offset: 6048)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1145, file: !35, line: 2776, baseType: !1037, size: 32, align: 32, offset: 6080)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1145, file: !35, line: 2783, baseType: !1037, size: 32, align: 32, offset: 6112)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1145, file: !35, line: 2791, baseType: !1037, size: 32, align: 32, offset: 6144)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1145, file: !35, line: 2802, baseType: !1023, size: 64, align: 64, offset: 6208)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1145, file: !35, line: 2811, baseType: !1037, size: 32, align: 32, offset: 6272)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1145, file: !35, line: 2821, baseType: !1037, size: 32, align: 32, offset: 6304)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1145, file: !35, line: 2830, baseType: !1037, size: 32, align: 32, offset: 6336)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1145, file: !35, line: 2840, baseType: !1037, size: 32, align: 32, offset: 6368)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1145, file: !35, line: 2851, baseType: !1695, size: 64, align: 64, offset: 6400)
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64, align: 64)
!1696 = !DISubroutineType(types: !1697)
!1697 = !{!1037, !1516, !1698, !1012, !1332, !1037, !1037}
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DISubroutineType(types: !1700)
!1700 = !{!1037, !1516, !1012}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1145, file: !35, line: 2871, baseType: !1702, size: 64, align: 64, offset: 6464)
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
!1703 = !DISubroutineType(types: !1704)
!1704 = !{!1037, !1516, !1705, !1012, !1332, !1037}
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64, align: 64)
!1706 = !DISubroutineType(types: !1707)
!1707 = !{!1037, !1516, !1012, !1037, !1037}
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1145, file: !35, line: 2878, baseType: !1037, size: 32, align: 32, offset: 6528)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1145, file: !35, line: 2885, baseType: !1037, size: 32, align: 32, offset: 6560)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1145, file: !35, line: 3005, baseType: !1037, size: 32, align: 32, offset: 6592)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1145, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1145, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1145, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1145, file: !35, line: 3037, baseType: !1029, size: 64, align: 64, offset: 6720)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1145, file: !35, line: 3038, baseType: !1037, size: 32, align: 32, offset: 6784)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1145, file: !35, line: 3050, baseType: !1065, size: 64, align: 64, offset: 6848)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1145, file: !35, line: 3065, baseType: !1037, size: 32, align: 32, offset: 6912)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1145, file: !35, line: 3083, baseType: !1037, size: 32, align: 32, offset: 6944)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1145, file: !35, line: 3092, baseType: !1047, size: 64, align: 32, offset: 6976)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1145, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1145, file: !35, line: 3106, baseType: !1047, size: 64, align: 32, offset: 7072)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1145, file: !35, line: 3113, baseType: !1723, size: 64, align: 64, offset: 7168)
!1723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1724, size: 64, align: 64)
!1724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1725)
!1725 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1726)
!1726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1727)
!1727 = !{!1728, !1729, !1730, !1731, !1732, !1733, !1736}
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1726, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1726, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1726, file: !35, line: 720, baseType: !1154, size: 64, align: 64, offset: 64)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1726, file: !35, line: 724, baseType: !1154, size: 64, align: 64, offset: 128)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1726, file: !35, line: 728, baseType: !1037, size: 32, align: 32, offset: 192)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1726, file: !35, line: 734, baseType: !1734, size: 64, align: 64, offset: 256)
!1734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1735, size: 64, align: 64)
!1735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1154)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1726, file: !35, line: 739, baseType: !1737, size: 64, align: 64, offset: 320)
!1737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1738, size: 64, align: 64)
!1738 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1224)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1145, file: !35, line: 3129, baseType: !1054, size: 64, align: 64, offset: 7232)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1145, file: !35, line: 3130, baseType: !1054, size: 64, align: 64, offset: 7296)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1145, file: !35, line: 3131, baseType: !1054, size: 64, align: 64, offset: 7360)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1145, file: !35, line: 3132, baseType: !1054, size: 64, align: 64, offset: 7424)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1145, file: !35, line: 3139, baseType: !1299, size: 64, align: 64, offset: 7488)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1145, file: !35, line: 3147, baseType: !1037, size: 32, align: 32, offset: 7552)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1145, file: !35, line: 3165, baseType: !1037, size: 32, align: 32, offset: 7584)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1145, file: !35, line: 3172, baseType: !1037, size: 32, align: 32, offset: 7616)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1145, file: !35, line: 3180, baseType: !1037, size: 32, align: 32, offset: 7648)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1145, file: !35, line: 3191, baseType: !1553, size: 64, align: 64, offset: 7680)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1145, file: !35, line: 3199, baseType: !1029, size: 64, align: 64, offset: 7744)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1145, file: !35, line: 3207, baseType: !1299, size: 64, align: 64, offset: 7808)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1145, file: !35, line: 3214, baseType: !1271, size: 32, align: 32, offset: 7872)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1145, file: !35, line: 3224, baseType: !1319, size: 64, align: 64, offset: 7936)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1145, file: !35, line: 3225, baseType: !1037, size: 32, align: 32, offset: 8000)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1145, file: !35, line: 3249, baseType: !1076, size: 64, align: 64, offset: 8064)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1145, file: !35, line: 3256, baseType: !1037, size: 32, align: 32, offset: 8128)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1145, file: !35, line: 3271, baseType: !1037, size: 32, align: 32, offset: 8160)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1145, file: !35, line: 3279, baseType: !1054, size: 64, align: 64, offset: 8192)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1145, file: !35, line: 3301, baseType: !1076, size: 64, align: 64, offset: 8256)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1145, file: !35, line: 3310, baseType: !1037, size: 32, align: 32, offset: 8320)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1145, file: !35, line: 3337, baseType: !1037, size: 32, align: 32, offset: 8352)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1145, file: !35, line: 3351, baseType: !1037, size: 32, align: 32, offset: 8384)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1145, file: !35, line: 3359, baseType: !1037, size: 32, align: 32, offset: 8416)
!1763 = !{!1764}
!1764 = !DISubrange(count: 2)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1138, file: !1137, line: 39, baseType: !1076, size: 64, align: 64, offset: 192)
