; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--prompeg.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--prompeg.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }

!46 = !{!47, !56, !63, !62, !64, !65, !66, !93}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !50, line: 222, size: 16, align: 8, elements: !51)
!50 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!51 = !{!52}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !49, file: !50, line: 222, baseType: !53, size: 16, align: 16)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !54, line: 49, baseType: !55)
!54 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!55 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !50, line: 221, size: 32, align: 8, elements: !59)
!59 = !{!60}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !58, file: !50, line: 221, baseType: !61, size: 32, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !54, line: 51, baseType: !62)
!62 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!63 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "av_alias64", file: !50, line: 34, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !50, line: 27, size: 64, align: 64, elements: !70)
!70 = !{!71, !74, !78, !82, !88, !90}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !69, file: !50, line: 28, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !54, line: 55, baseType: !73)
!73 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !69, file: !50, line: 29, baseType: !75, size: 64, align: 32)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 64, align: 32, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 2)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "u16", scope: !69, file: !50, line: 30, baseType: !79, size: 64, align: 16)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 64, align: 16, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 4)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !69, file: !50, line: 31, baseType: !83, size: 64, align: 8)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 64, align: 8, elements: !86)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !54, line: 48, baseType: !85)
!85 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!86 = !{!87}
!87 = !DISubrange(count: 8)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "f64", scope: !69, file: !50, line: 32, baseType: !89, size: 64, align: 64)
!89 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "f32", scope: !69, file: !50, line: 33, baseType: !91, size: 64, align: 32)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 64, align: 32, elements: !76)
!92 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!94 = !{!95, !301, !302}
!95 = distinct !DIGlobalVariable(name: "ff_prompeg_protocol", scope: !0, file: !96, line: 473, type: !97, isLocal: false, isDefinition: true, variable: { i8*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }* @ff_prompeg_protocol)
!96 = !DIFile(filename: "libavformat/prompeg.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !99, line: 100, baseType: !100)
!99 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !99, line: 54, size: 1600, align: 64, elements: !101)
!101 = !{!102, !106, !219, !228, !233, !237, !242, !248, !252, !253, !257, !261, !262, !268, !269, !270, !271, !272, !273, !274, !275, !294, !295, !296, !300}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !100, file: !99, line: 55, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !100, file: !99, line: 56, baseType: !107, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!63, !110, !103, !63}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !99, line: 52, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !99, line: 38, size: 768, align: 64, elements: !113)
!113 = !{!114, !195, !198, !199, !201, !202, !203, !204, !205, !215, !216, !217, !218}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !112, file: !99, line: 39, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !119)
!119 = !{!120, !121, !126, !154, !155, !156, !157, !161, !167, !169, !173}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !118, file: !26, line: 72, baseType: !103, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !118, file: !26, line: 78, baseType: !122, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!103, !125}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !118, file: !26, line: 85, baseType: !127, size: 64, align: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !150, !151, !152, !153}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !129, file: !4, line: 247, baseType: !103, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !129, file: !4, line: 253, baseType: !103, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !129, file: !4, line: 259, baseType: !63, size: 32, align: 32, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !129, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !129, file: !4, line: 271, baseType: !136, size: 64, align: 64, offset: 192)
!136 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !4, line: 265, size: 64, align: 64, elements: !137)
!137 = !{!138, !141, !142, !143}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !136, file: !4, line: 266, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !54, line: 40, baseType: !140)
!140 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !136, file: !4, line: 267, baseType: !89, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !136, file: !4, line: 268, baseType: !103, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !136, file: !4, line: 270, baseType: !144, size: 64, align: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !145, line: 61, baseType: !146)
!145 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !145, line: 58, size: 64, align: 32, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !146, file: !145, line: 59, baseType: !63, size: 32, align: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !146, file: !145, line: 60, baseType: !63, size: 32, align: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !129, file: !4, line: 272, baseType: !89, size: 64, align: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !129, file: !4, line: 273, baseType: !89, size: 64, align: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !129, file: !4, line: 275, baseType: !63, size: 32, align: 32, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !129, file: !4, line: 300, baseType: !103, size: 64, align: 64, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !118, file: !26, line: 93, baseType: !63, size: 32, align: 32, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !118, file: !26, line: 99, baseType: !63, size: 32, align: 32, offset: 224)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !118, file: !26, line: 108, baseType: !63, size: 32, align: 32, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !118, file: !26, line: 113, baseType: !158, size: 64, align: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!125, !125, !125}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !118, file: !26, line: 123, baseType: !162, size: 64, align: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!165, !165}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !118, file: !26, line: 130, baseType: !168, size: 32, align: 32, offset: 448)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !118, file: !26, line: 136, baseType: !170, size: 64, align: 64, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!168, !125}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !118, file: !26, line: 142, baseType: !174, size: 64, align: 64, offset: 576)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!63, !177, !125, !103, !63}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !180)
!180 = !{!181, !193, !194}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !179, file: !4, line: 360, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !186)
!186 = !{!187, !188, !189, !190, !191, !192}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !185, file: !4, line: 307, baseType: !103, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !185, file: !4, line: 313, baseType: !89, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !185, file: !4, line: 313, baseType: !89, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !185, file: !4, line: 318, baseType: !89, size: 64, align: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !185, file: !4, line: 318, baseType: !89, size: 64, align: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !185, file: !4, line: 323, baseType: !63, size: 32, align: 32, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !179, file: !4, line: 364, baseType: !63, size: 32, align: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !179, file: !4, line: 368, baseType: !63, size: 32, align: 32, offset: 96)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !112, file: !99, line: 40, baseType: !196, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !112, file: !99, line: 41, baseType: !125, size: 64, align: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !112, file: !99, line: 42, baseType: !200, size: 64, align: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !112, file: !99, line: 43, baseType: !63, size: 32, align: 32, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !112, file: !99, line: 44, baseType: !63, size: 32, align: 32, offset: 288)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !112, file: !99, line: 45, baseType: !63, size: 32, align: 32, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !112, file: !99, line: 46, baseType: !63, size: 32, align: 32, offset: 352)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !112, file: !99, line: 47, baseType: !206, size: 128, align: 64, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !207, line: 61, baseType: !208)
!207 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !207, line: 58, size: 128, align: 64, elements: !209)
!209 = !{!210, !214}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !208, file: !207, line: 59, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!63, !125}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !208, file: !207, line: 60, baseType: !125, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !112, file: !99, line: 48, baseType: !139, size: 64, align: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !112, file: !99, line: 49, baseType: !103, size: 64, align: 64, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !112, file: !99, line: 50, baseType: !103, size: 64, align: 64, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !112, file: !99, line: 51, baseType: !63, size: 32, align: 32, offset: 704)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !100, file: !99, line: 62, baseType: !220, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!63, !110, !103, !63, !223}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !226, line: 86, baseType: !227)
!226 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !226, line: 86, flags: DIFlagFwdDecl)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !100, file: !99, line: 63, baseType: !229, size: 64, align: 64, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!63, !110, !232}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !100, file: !99, line: 64, baseType: !234, size: 64, align: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!63, !110}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !100, file: !99, line: 78, baseType: !238, size: 64, align: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!63, !110, !241, !63}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !100, file: !99, line: 79, baseType: !243, size: 64, align: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!63, !110, !246, !63}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !100, file: !99, line: 80, baseType: !249, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!139, !110, !139, !63}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !100, file: !99, line: 81, baseType: !234, size: 64, align: 64, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !100, file: !99, line: 82, baseType: !254, size: 64, align: 64, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!63, !110, !63}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !100, file: !99, line: 83, baseType: !258, size: 64, align: 64, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!139, !110, !63, !139, !63}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !100, file: !99, line: 85, baseType: !234, size: 64, align: 64, offset: 704)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !100, file: !99, line: 86, baseType: !263, size: 64, align: 64, offset: 768)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!63, !110, !266, !267}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !100, file: !99, line: 88, baseType: !234, size: 64, align: 64, offset: 832)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !100, file: !99, line: 89, baseType: !254, size: 64, align: 64, offset: 896)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !100, file: !99, line: 90, baseType: !63, size: 32, align: 32, offset: 960)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !100, file: !99, line: 91, baseType: !115, size: 64, align: 64, offset: 1024)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !100, file: !99, line: 92, baseType: !63, size: 32, align: 32, offset: 1088)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !100, file: !99, line: 93, baseType: !254, size: 64, align: 64, offset: 1152)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !100, file: !99, line: 94, baseType: !234, size: 64, align: 64, offset: 1216)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !100, file: !99, line: 95, baseType: !276, size: 64, align: 64, offset: 1280)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!63, !110, !279}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !207, line: 101, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !207, line: 86, size: 576, align: 64, elements: !283)
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291, !292, !293}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !282, file: !207, line: 87, baseType: !200, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !282, file: !207, line: 88, baseType: !63, size: 32, align: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !282, file: !207, line: 89, baseType: !63, size: 32, align: 32, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !282, file: !207, line: 91, baseType: !139, size: 64, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !282, file: !207, line: 92, baseType: !139, size: 64, align: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !282, file: !207, line: 94, baseType: !139, size: 64, align: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !282, file: !207, line: 96, baseType: !139, size: 64, align: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !282, file: !207, line: 98, baseType: !139, size: 64, align: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !282, file: !207, line: 99, baseType: !139, size: 64, align: 64, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !282, file: !207, line: 100, baseType: !139, size: 64, align: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !100, file: !99, line: 96, baseType: !234, size: 64, align: 64, offset: 1344)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !100, file: !99, line: 97, baseType: !234, size: 64, align: 64, offset: 1408)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !100, file: !99, line: 98, baseType: !297, size: 64, align: 64, offset: 1472)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!63, !110, !110}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !100, file: !99, line: 99, baseType: !103, size: 64, align: 64, offset: 1536)
!301 = distinct !DIGlobalVariable(name: "prompeg_class", scope: !0, file: !96, line: 130, type: !116, isLocal: true, isDefinition: true, variable: %struct.AVClass* @prompeg_class)
!302 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !96, line: 123, type: !303, isLocal: true, isDefinition: true, variable: [4 x %struct.AVOption]* @options)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 2048, align: 64, elements: !80)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !129)
!306 = !{i32 2, !"Dwarf Version", i32 4}
!307 = !{i32 2, !"Debug Info Version", i32 3}
!308 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!309 = distinct !DISubprogram(name: "prompeg_open", scope: !96, file: !96, line: 270, type: !108, isLocal: true, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !310)
!310 = !{}
!311 = !DILocalVariable(name: "h", arg: 1, scope: !309, file: !96, line: 270, type: !110)
!312 = !DIExpression()
!313 = !DILocation(line: 270, column: 37, scope: !309)
!314 = !DILocalVariable(name: "uri", arg: 2, scope: !309, file: !96, line: 270, type: !103)
!315 = !DILocation(line: 270, column: 52, scope: !309)
!316 = !DILocalVariable(name: "flags", arg: 3, scope: !309, file: !96, line: 270, type: !63)
!317 = !DILocation(line: 270, column: 61, scope: !309)
!318 = !DILocalVariable(name: "s", scope: !309, file: !96, line: 271, type: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrompegContext", file: !96, line: 118, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PrompegContext", file: !96, line: 102, size: 896, align: 64, elements: !322)
!322 = !{!323, !324, !325, !326, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !321, file: !96, line: 103, baseType: !115, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "fec_col_hd", scope: !321, file: !96, line: 104, baseType: !110, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "fec_row_hd", scope: !321, file: !96, line: 104, baseType: !110, size: 64, align: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "fec_arr", scope: !321, file: !96, line: 105, baseType: !327, size: 64, align: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrompegFec", file: !96, line: 100, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PrompegFec", file: !96, line: 96, size: 128, align: 64, elements: !331)
!331 = !{!332, !333, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "sn", scope: !330, file: !96, line: 97, baseType: !53, size: 16, align: 16)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !330, file: !96, line: 98, baseType: !61, size: 32, align: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "bitstring", scope: !330, file: !96, line: 99, baseType: !335, size: 64, align: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "fec_col_tmp", scope: !321, file: !96, line: 105, baseType: !327, size: 64, align: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "fec_col", scope: !321, file: !96, line: 105, baseType: !327, size: 64, align: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fec_row", scope: !321, file: !96, line: 105, baseType: !328, size: 64, align: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !321, file: !96, line: 106, baseType: !63, size: 32, align: 32, offset: 448)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !321, file: !96, line: 107, baseType: !84, size: 8, align: 8, offset: 480)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !321, file: !96, line: 107, baseType: !84, size: 8, align: 8, offset: 488)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_buf", scope: !321, file: !96, line: 108, baseType: !335, size: 64, align: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_col_sn", scope: !321, file: !96, line: 109, baseType: !53, size: 16, align: 16, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_row_sn", scope: !321, file: !96, line: 109, baseType: !53, size: 16, align: 16, offset: 592)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "length_recovery", scope: !321, file: !96, line: 110, baseType: !53, size: 16, align: 16, offset: 608)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "packet_size", scope: !321, file: !96, line: 111, baseType: !63, size: 32, align: 32, offset: 640)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "packet_idx", scope: !321, file: !96, line: 112, baseType: !63, size: 32, align: 32, offset: 672)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "packet_idx_max", scope: !321, file: !96, line: 112, baseType: !63, size: 32, align: 32, offset: 704)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "fec_arr_len", scope: !321, file: !96, line: 113, baseType: !63, size: 32, align: 32, offset: 736)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "bitstring_size", scope: !321, file: !96, line: 114, baseType: !63, size: 32, align: 32, offset: 768)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_buf_size", scope: !321, file: !96, line: 115, baseType: !63, size: 32, align: 32, offset: 800)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !321, file: !96, line: 116, baseType: !63, size: 32, align: 32, offset: 832)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !321, file: !96, line: 117, baseType: !63, size: 32, align: 32, offset: 864)
!354 = !DILocation(line: 271, column: 21, scope: !309)
!355 = !DILocation(line: 271, column: 25, scope: !309)
!356 = !DILocation(line: 271, column: 28, scope: !309)
!357 = !DILocalVariable(name: "udp_opts", scope: !309, file: !96, line: 272, type: !224)
!358 = !DILocation(line: 272, column: 19, scope: !309)
!359 = !DILocalVariable(name: "rtp_port", scope: !309, file: !96, line: 273, type: !63)
!360 = !DILocation(line: 273, column: 9, scope: !309)
!361 = !DILocalVariable(name: "hostname", scope: !309, file: !96, line: 274, type: !362)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 2048, align: 8, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 256)
!365 = !DILocation(line: 274, column: 10, scope: !309)
!366 = !DILocalVariable(name: "buf", scope: !309, file: !96, line: 275, type: !367)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 8192, align: 8, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 1024)
!370 = !DILocation(line: 275, column: 10, scope: !309)
!371 = !DILocation(line: 277, column: 5, scope: !309)
!372 = !DILocation(line: 277, column: 8, scope: !309)
!373 = !DILocation(line: 277, column: 19, scope: !309)
!374 = !DILocation(line: 278, column: 5, scope: !309)
!375 = !DILocation(line: 278, column: 8, scope: !309)
!376 = !DILocation(line: 278, column: 19, scope: !309)
!377 = !DILocation(line: 280, column: 9, scope: !378)
!378 = distinct !DILexicalBlock(scope: !309, file: !96, line: 280, column: 9)
!379 = !DILocation(line: 280, column: 12, scope: !378)
!380 = !DILocation(line: 280, column: 16, scope: !378)
!381 = !DILocation(line: 280, column: 19, scope: !378)
!382 = !DILocation(line: 280, column: 14, scope: !378)
!383 = !DILocation(line: 280, column: 21, scope: !378)
!384 = !DILocation(line: 280, column: 9, scope: !309)
!385 = !DILocation(line: 281, column: 16, scope: !386)
!386 = distinct !DILexicalBlock(scope: !378, file: !96, line: 280, column: 28)
!387 = !DILocation(line: 281, column: 9, scope: !386)
!388 = !DILocation(line: 282, column: 9, scope: !386)
!389 = !DILocation(line: 285, column: 35, scope: !309)
!390 = !DILocation(line: 286, column: 21, scope: !309)
!391 = !DILocation(line: 285, column: 5, scope: !309)
!392 = !DILocation(line: 288, column: 9, scope: !393)
!393 = distinct !DILexicalBlock(scope: !309, file: !96, line: 288, column: 9)
!394 = !DILocation(line: 288, column: 18, scope: !393)
!395 = !DILocation(line: 288, column: 22, scope: !393)
!396 = !DILocation(line: 288, column: 25, scope: !397)
!397 = !DILexicalBlockFile(scope: !393, file: !96, discriminator: 1)
!398 = !DILocation(line: 288, column: 34, scope: !397)
!399 = !DILocation(line: 288, column: 9, scope: !397)
!400 = !DILocation(line: 289, column: 16, scope: !401)
!401 = distinct !DILexicalBlock(scope: !393, file: !96, line: 288, column: 51)
!402 = !DILocation(line: 289, column: 53, scope: !401)
!403 = !DILocation(line: 289, column: 9, scope: !401)
!404 = !DILocation(line: 290, column: 9, scope: !401)
!405 = !DILocation(line: 293, column: 9, scope: !406)
!406 = distinct !DILexicalBlock(scope: !309, file: !96, line: 293, column: 9)
!407 = !DILocation(line: 293, column: 12, scope: !406)
!408 = !DILocation(line: 293, column: 16, scope: !406)
!409 = !DILocation(line: 293, column: 9, scope: !309)
!410 = !DILocation(line: 294, column: 18, scope: !411)
!411 = distinct !DILexicalBlock(scope: !406, file: !96, line: 293, column: 21)
!412 = !DILocation(line: 294, column: 43, scope: !411)
!413 = !DILocation(line: 294, column: 46, scope: !411)
!414 = !DILocation(line: 294, column: 9, scope: !411)
!415 = !DILocation(line: 295, column: 39, scope: !411)
!416 = !DILocation(line: 295, column: 9, scope: !411)
!417 = !DILocation(line: 296, column: 5, scope: !411)
!418 = !DILocation(line: 298, column: 17, scope: !309)
!419 = !DILocation(line: 298, column: 48, scope: !309)
