; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libswresample--swresample.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libswresample--swresample.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Resampler = type { %struct.ResampleContext* (%struct.ResampleContext*, i32, i32, i32, i32, i32, double, i32, i32, double, double, i32, i32)*, void (%struct.ResampleContext**)*, i32 (%struct.ResampleContext*, %struct.AudioData*, i32, %struct.AudioData*, i32, i32*)*, i32 (%struct.SwrContext*)*, i32 (%struct.ResampleContext*, i32, i32)*, i64 (%struct.SwrContext*, i64)*, i32 (%struct.ResampleContext*, %struct.AudioData*, %struct.AudioData*, i32, i32*, i32*)*, i64 (%struct.SwrContext*, i32)* }
%struct.ResampleContext = type opaque
%struct.AudioData = type { [64 x i8*], i8*, i32, i32, i32, i32, i32 }

!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88}
!76 = !DIEnumerator(name: "SWR_DITHER_NONE", value: 0)
!77 = !DIEnumerator(name: "SWR_DITHER_RECTANGULAR", value: 1)
!78 = !DIEnumerator(name: "SWR_DITHER_TRIANGULAR", value: 2)
!79 = !DIEnumerator(name: "SWR_DITHER_TRIANGULAR_HIGHPASS", value: 3)
!80 = !DIEnumerator(name: "SWR_DITHER_NS", value: 64)
!81 = !DIEnumerator(name: "SWR_DITHER_NS_LIPSHITZ", value: 65)
!82 = !DIEnumerator(name: "SWR_DITHER_NS_F_WEIGHTED", value: 66)
!83 = !DIEnumerator(name: "SWR_DITHER_NS_MODIFIED_E_WEIGHTED", value: 67)
!84 = !DIEnumerator(name: "SWR_DITHER_NS_IMPROVED_E_WEIGHTED", value: 68)
!85 = !DIEnumerator(name: "SWR_DITHER_NS_SHIBATA", value: 69)
!86 = !DIEnumerator(name: "SWR_DITHER_NS_LOW_SHIBATA", value: 70)
!87 = !DIEnumerator(name: "SWR_DITHER_NS_HIGH_SHIBATA", value: 71)
!88 = !DIEnumerator(name: "SWR_DITHER_NB", value: 72)
!89 = !{!90, !93, !94, !95, !96}
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !91, line: 40, baseType: !92)
!91 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!92 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!93 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!95 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !91, line: 48, baseType: !100)
!100 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!101 = !{!102}
!102 = distinct !DIGlobalVariable(name: "swr_ffversion", scope: !0, file: !103, line: 33, type: !104, isLocal: false, isDefinition: true, variable: [32 x i8]* @swr_ffversion)
!103 = !DIFile(filename: "libswresample/swresample.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 256, align: 8, elements: !107)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!106 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!107 = !{!108}
!108 = !DISubrange(count: 32)
!109 = !{i32 2, !"Dwarf Version", i32 4}
!110 = !{i32 2, !"Debug Info Version", i32 3}
!111 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!112 = distinct !DISubprogram(name: "swresample_version", scope: !103, file: !103, line: 35, type: !113, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!113 = !DISubroutineType(types: !114)
!114 = !{!115}
!115 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!116 = !{}
!117 = !DILocation(line: 37, column: 5, scope: !112)
!118 = distinct !{!118, !117}
!119 = !DILocation(line: 37, column: 103, scope: !120)
!120 = !DILexicalBlockFile(scope: !121, file: !103, discriminator: 1)
!121 = distinct !DILexicalBlock(scope: !112, file: !103, line: 37, column: 8)
!122 = !DILocation(line: 38, column: 5, scope: !112)
!123 = distinct !DISubprogram(name: "swresample_configuration", scope: !103, file: !103, line: 41, type: !124, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!124 = !DISubroutineType(types: !125)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!127 = !DILocation(line: 43, column: 5, scope: !123)
!128 = distinct !DISubprogram(name: "swresample_license", scope: !103, file: !103, line: 46, type: !124, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!129 = !DILocation(line: 49, column: 5, scope: !128)
!130 = distinct !DISubprogram(name: "swr_set_channel_mapping", scope: !103, file: !103, line: 52, type: !131, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!131 = !DISubroutineType(types: !132)
!132 = !{!133, !134, !233}
!133 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwrContext", file: !136, line: 95, size: 687232, align: 64, elements: !137)
!136 = !DIFile(filename: "libswresample/swresample_internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!137 = !{!138, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !338, !339, !340, !343, !393, !396, !398, !399, !400, !401, !402, !405, !409, !417, !418, !423, !424}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !135, file: !136, line: 96, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !143)
!143 = !{!144, !145, !149, !175, !176, !177, !178, !182, !188, !190, !194}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !142, file: !26, line: 72, baseType: !126, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !142, file: !26, line: 78, baseType: !146, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!126, !94}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !142, file: !26, line: 85, baseType: !150, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !153)
!153 = !{!154, !155, !156, !157, !158, !171, !172, !173, !174}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !4, line: 247, baseType: !126, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !152, file: !4, line: 253, baseType: !126, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !152, file: !4, line: 259, baseType: !133, size: 32, align: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !152, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !152, file: !4, line: 271, baseType: !159, size: 64, align: 64, offset: 192)
!159 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !4, line: 265, size: 64, align: 64, elements: !160)
!160 = !{!161, !162, !163, !164}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !159, file: !4, line: 266, baseType: !90, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !159, file: !4, line: 267, baseType: !93, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !159, file: !4, line: 268, baseType: !126, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !159, file: !4, line: 270, baseType: !165, size: 64, align: 32)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !166, line: 61, baseType: !167)
!166 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !166, line: 58, size: 64, align: 32, elements: !168)
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !167, file: !166, line: 59, baseType: !133, size: 32, align: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !167, file: !166, line: 60, baseType: !133, size: 32, align: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !152, file: !4, line: 272, baseType: !93, size: 64, align: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !152, file: !4, line: 273, baseType: !93, size: 64, align: 64, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !152, file: !4, line: 275, baseType: !133, size: 32, align: 32, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !152, file: !4, line: 300, baseType: !126, size: 64, align: 64, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !142, file: !26, line: 93, baseType: !133, size: 32, align: 32, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !142, file: !26, line: 99, baseType: !133, size: 32, align: 32, offset: 224)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !142, file: !26, line: 108, baseType: !133, size: 32, align: 32, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !142, file: !26, line: 113, baseType: !179, size: 64, align: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!94, !94, !94}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !142, file: !26, line: 123, baseType: !183, size: 64, align: 64, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!186, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !142, file: !26, line: 130, baseType: !189, size: 32, align: 32, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !142, file: !26, line: 136, baseType: !191, size: 64, align: 64, offset: 512)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!189, !94}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !142, file: !26, line: 142, baseType: !195, size: 64, align: 64, offset: 576)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!133, !198, !94, !126, !133}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !201)
!201 = !{!202, !214, !215}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !200, file: !4, line: 360, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !207)
!207 = !{!208, !209, !210, !211, !212, !213}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !206, file: !4, line: 307, baseType: !126, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !206, file: !4, line: 313, baseType: !93, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !206, file: !4, line: 313, baseType: !93, size: 64, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !206, file: !4, line: 318, baseType: !93, size: 64, align: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !206, file: !4, line: 318, baseType: !93, size: 64, align: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !206, file: !4, line: 323, baseType: !133, size: 32, align: 32, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !200, file: !4, line: 364, baseType: !133, size: 32, align: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !200, file: !4, line: 368, baseType: !133, size: 32, align: 32, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !135, file: !136, line: 97, baseType: !133, size: 32, align: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !135, file: !136, line: 98, baseType: !94, size: 64, align: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "in_sample_fmt", scope: !135, file: !136, line: 99, baseType: !46, size: 32, align: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "int_sample_fmt", scope: !135, file: !136, line: 100, baseType: !46, size: 32, align: 32, offset: 224)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "out_sample_fmt", scope: !135, file: !136, line: 101, baseType: !46, size: 32, align: 32, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "in_ch_layout", scope: !135, file: !136, line: 102, baseType: !90, size: 64, align: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "out_ch_layout", scope: !135, file: !136, line: 103, baseType: !90, size: 64, align: 64, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "in_sample_rate", scope: !135, file: !136, line: 104, baseType: !133, size: 32, align: 32, offset: 448)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "out_sample_rate", scope: !135, file: !136, line: 105, baseType: !133, size: 32, align: 32, offset: 480)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !135, file: !136, line: 106, baseType: !133, size: 32, align: 32, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "slev", scope: !135, file: !136, line: 107, baseType: !95, size: 32, align: 32, offset: 544)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "clev", scope: !135, file: !136, line: 108, baseType: !95, size: 32, align: 32, offset: 576)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "lfe_mix_level", scope: !135, file: !136, line: 109, baseType: !95, size: 32, align: 32, offset: 608)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_volume", scope: !135, file: !136, line: 110, baseType: !95, size: 32, align: 32, offset: 640)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_maxval", scope: !135, file: !136, line: 111, baseType: !95, size: 32, align: 32, offset: 672)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_encoding", scope: !135, file: !136, line: 112, baseType: !133, size: 32, align: 32, offset: 704)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "channel_map", scope: !135, file: !136, line: 113, baseType: !233, size: 64, align: 64, offset: 768)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "used_ch_count", scope: !135, file: !136, line: 114, baseType: !133, size: 32, align: 32, offset: 832)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !135, file: !136, line: 115, baseType: !133, size: 32, align: 32, offset: 864)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "user_in_ch_count", scope: !135, file: !136, line: 117, baseType: !133, size: 32, align: 32, offset: 896)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "user_out_ch_count", scope: !135, file: !136, line: 118, baseType: !133, size: 32, align: 32, offset: 928)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "user_used_ch_count", scope: !135, file: !136, line: 119, baseType: !133, size: 32, align: 32, offset: 960)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "user_in_ch_layout", scope: !135, file: !136, line: 120, baseType: !90, size: 64, align: 64, offset: 1024)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "user_out_ch_layout", scope: !135, file: !136, line: 121, baseType: !90, size: 64, align: 64, offset: 1088)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "user_int_sample_fmt", scope: !135, file: !136, line: 122, baseType: !46, size: 32, align: 32, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "user_dither_method", scope: !135, file: !136, line: 123, baseType: !133, size: 32, align: 32, offset: 1184)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !135, file: !136, line: 125, baseType: !245, size: 91584, align: 64, offset: 1216)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DitherContext", file: !136, line: 55, size: 91584, align: 64, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !255, !259, !264, !278, !279}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !245, file: !136, line: 56, baseType: !133, size: 32, align: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "noise_pos", scope: !245, file: !136, line: 57, baseType: !133, size: 32, align: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !245, file: !136, line: 58, baseType: !95, size: 32, align: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "noise_scale", scope: !245, file: !136, line: 59, baseType: !95, size: 32, align: 32, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ns_taps", scope: !245, file: !136, line: 60, baseType: !133, size: 32, align: 32, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ns_scale", scope: !245, file: !136, line: 61, baseType: !95, size: 32, align: 32, offset: 160)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ns_scale_1", scope: !245, file: !136, line: 62, baseType: !95, size: 32, align: 32, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ns_pos", scope: !245, file: !136, line: 63, baseType: !133, size: 32, align: 32, offset: 224)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ns_coeffs", scope: !245, file: !136, line: 64, baseType: !256, size: 640, align: 32, offset: 256)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 640, align: 32, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 20)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ns_errors", scope: !245, file: !136, line: 65, baseType: !260, size: 81920, align: 32, offset: 896)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 81920, align: 32, elements: !261)
!261 = !{!262, !263}
!262 = !DISubrange(count: 64)
!263 = !DISubrange(count: 40)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "noise", scope: !245, file: !136, line: 66, baseType: !265, size: 4352, align: 64, offset: 82816)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "AudioData", file: !136, line: 53, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AudioData", file: !136, line: 45, size: 4352, align: 64, elements: !267)
!267 = !{!268, !272, !273, !274, !275, !276, !277}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !266, file: !136, line: 46, baseType: !269, size: 4096, align: 64)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 4096, align: 64, elements: !271)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!271 = !{!262}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !266, file: !136, line: 47, baseType: !270, size: 64, align: 64, offset: 4096)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ch_count", scope: !266, file: !136, line: 48, baseType: !133, size: 32, align: 32, offset: 4160)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !266, file: !136, line: 49, baseType: !133, size: 32, align: 32, offset: 4192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !266, file: !136, line: 50, baseType: !133, size: 32, align: 32, offset: 4224)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "planar", scope: !266, file: !136, line: 51, baseType: !133, size: 32, align: 32, offset: 4256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !266, file: !136, line: 52, baseType: !46, size: 32, align: 32, offset: 4288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !245, file: !136, line: 67, baseType: !265, size: 4352, align: 64, offset: 87168)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "output_sample_bits", scope: !245, file: !136, line: 68, baseType: !133, size: 32, align: 32, offset: 91520)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "filter_size", scope: !135, file: !136, line: 127, baseType: !133, size: 32, align: 32, offset: 92800)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "phase_shift", scope: !135, file: !136, line: 128, baseType: !133, size: 32, align: 32, offset: 92832)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "linear_interp", scope: !135, file: !136, line: 129, baseType: !133, size: 32, align: 32, offset: 92864)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "exact_rational", scope: !135, file: !136, line: 130, baseType: !133, size: 32, align: 32, offset: 92896)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !135, file: !136, line: 131, baseType: !93, size: 64, align: 64, offset: 92928)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !135, file: !136, line: 132, baseType: !133, size: 32, align: 32, offset: 92992)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "kaiser_beta", scope: !135, file: !136, line: 133, baseType: !93, size: 64, align: 64, offset: 93056)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !135, file: !136, line: 134, baseType: !93, size: 64, align: 64, offset: 93120)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "cheby", scope: !135, file: !136, line: 135, baseType: !133, size: 32, align: 32, offset: 93184)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "min_compensation", scope: !135, file: !136, line: 137, baseType: !95, size: 32, align: 32, offset: 93216)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "min_hard_compensation", scope: !135, file: !136, line: 138, baseType: !95, size: 32, align: 32, offset: 93248)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "soft_compensation_duration", scope: !135, file: !136, line: 139, baseType: !95, size: 32, align: 32, offset: 93280)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "max_soft_compensation", scope: !135, file: !136, line: 140, baseType: !95, size: 32, align: 32, offset: 93312)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "async", scope: !135, file: !136, line: 141, baseType: !95, size: 32, align: 32, offset: 93344)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "firstpts_in_samples", scope: !135, file: !136, line: 142, baseType: !90, size: 64, align: 64, offset: 93376)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "resample_first", scope: !135, file: !136, line: 144, baseType: !133, size: 32, align: 32, offset: 93440)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix", scope: !135, file: !136, line: 145, baseType: !133, size: 32, align: 32, offset: 93472)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "rematrix_custom", scope: !135, file: !136, line: 146, baseType: !133, size: 32, align: 32, offset: 93504)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !135, file: !136, line: 148, baseType: !265, size: 4352, align: 64, offset: 93568)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "postin", scope: !135, file: !136, line: 149, baseType: !265, size: 4352, align: 64, offset: 97920)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "midbuf", scope: !135, file: !136, line: 150, baseType: !265, size: 4352, align: 64, offset: 102272)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "preout", scope: !135, file: !136, line: 151, baseType: !265, size: 4352, align: 64, offset: 106624)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !135, file: !136, line: 152, baseType: !265, size: 4352, align: 64, offset: 110976)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer", scope: !135, file: !136, line: 153, baseType: !265, size: 4352, align: 64, offset: 115328)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "silence", scope: !135, file: !136, line: 154, baseType: !265, size: 4352, align: 64, offset: 119680)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "drop_temp", scope: !135, file: !136, line: 155, baseType: !265, size: 4352, align: 64, offset: 124032)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer_index", scope: !135, file: !136, line: 156, baseType: !133, size: 32, align: 32, offset: 128384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer_count", scope: !135, file: !136, line: 157, baseType: !133, size: 32, align: 32, offset: 128416)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "resample_in_constraint", scope: !135, file: !136, line: 158, baseType: !133, size: 32, align: 32, offset: 128448)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flushed", scope: !135, file: !136, line: 159, baseType: !133, size: 32, align: 32, offset: 128480)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "outpts", scope: !135, file: !136, line: 160, baseType: !90, size: 64, align: 64, offset: 128512)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "firstpts", scope: !135, file: !136, line: 161, baseType: !90, size: 64, align: 64, offset: 128576)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "drop_output", scope: !135, file: !136, line: 162, baseType: !133, size: 32, align: 32, offset: 128640)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_samples_fixup", scope: !135, file: !136, line: 163, baseType: !93, size: 64, align: 64, offset: 128704)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "in_convert", scope: !135, file: !136, line: 165, baseType: !315, size: 64, align: 64, offset: 128768)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AudioConvert", file: !317, line: 39, size: 384, align: 64, elements: !318)
!317 = !DIFile(filename: "libswresample/audioconvert.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!318 = !{!319, !320, !321, !322, !327, !333, !334}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !316, file: !317, line: 40, baseType: !133, size: 32, align: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "in_simd_align_mask", scope: !316, file: !317, line: 41, baseType: !133, size: 32, align: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "out_simd_align_mask", scope: !316, file: !317, line: 42, baseType: !133, size: 32, align: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "conv_f", scope: !316, file: !317, line: 43, baseType: !323, size: 64, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "conv_func_type", file: !317, line: 36, baseType: !325)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !270, !97, !133, !133, !270}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "simd_f", scope: !316, file: !317, line: 44, baseType: !328, size: 64, align: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "simd_func_type", file: !317, line: 37, baseType: !330)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !332, !96, !133}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ch_map", scope: !316, file: !317, line: 45, baseType: !233, size: 64, align: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "silence", scope: !316, file: !317, line: 46, baseType: !335, size: 64, align: 8, offset: 320)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 64, align: 8, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 8)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "out_convert", scope: !135, file: !136, line: 166, baseType: !315, size: 64, align: 64, offset: 128832)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "full_convert", scope: !135, file: !136, line: 167, baseType: !315, size: 64, align: 64, offset: 128896)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "resample", scope: !135, file: !136, line: 168, baseType: !341, size: 64, align: 64, offset: 128960)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "ResampleContext", file: !136, line: 71, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "resampler", scope: !135, file: !136, line: 169, baseType: !344, size: 64, align: 64, offset: 129024)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Resampler", file: !136, line: 81, size: 512, align: 64, elements: !347)
!347 = !{!348, !353, !359, !366, !371, !376, !381, !388}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !346, file: !136, line: 82, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_init_func", file: !136, line: 71, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!341, !341, !133, !133, !133, !133, !133, !93, !46, !63, !93, !93, !133, !133}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !346, file: !136, line: 83, baseType: !354, size: 64, align: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_free_func", file: !136, line: 73, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "multiple_resample", scope: !346, file: !136, line: 84, baseType: !360, size: 64, align: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiple_resample_func", file: !136, line: 74, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!133, !341, !364, !133, !364, !133, !365}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !346, file: !136, line: 85, baseType: !367, size: 64, align: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "resample_flush_func", file: !136, line: 75, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!133, !134}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "set_compensation", scope: !346, file: !136, line: 86, baseType: !372, size: 64, align: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "set_compensation_func", file: !136, line: 76, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!133, !341, !133, !133}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "get_delay", scope: !346, file: !136, line: 87, baseType: !377, size: 64, align: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_delay_func", file: !136, line: 77, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!90, !134, !90}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "invert_initial_buffer", scope: !346, file: !136, line: 88, baseType: !382, size: 64, align: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "invert_initial_buffer_func", file: !136, line: 78, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!133, !341, !364, !386, !133, !365, !365}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "get_out_samples", scope: !346, file: !136, line: 89, baseType: !389, size: 64, align: 64, offset: 448)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_out_samples_func", file: !136, line: 79, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!90, !134, !133}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !135, file: !136, line: 171, baseType: !394, size: 262144, align: 64, offset: 129088)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 262144, align: 64, elements: !395)
!395 = !{!262, !262}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_flt", scope: !135, file: !136, line: 172, baseType: !397, size: 131072, align: 32, offset: 391232)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 131072, align: 32, elements: !395)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "native_matrix", scope: !135, file: !136, line: 173, baseType: !270, size: 64, align: 64, offset: 522304)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "native_one", scope: !135, file: !136, line: 174, baseType: !270, size: 64, align: 64, offset: 522368)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "native_simd_one", scope: !135, file: !136, line: 175, baseType: !270, size: 64, align: 64, offset: 522432)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "native_simd_matrix", scope: !135, file: !136, line: 176, baseType: !270, size: 64, align: 64, offset: 522496)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "matrix32", scope: !135, file: !136, line: 177, baseType: !403, size: 131072, align: 32, offset: 522560)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 131072, align: 32, elements: !395)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !91, line: 38, baseType: !133)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_ch", scope: !135, file: !136, line: 178, baseType: !406, size: 33280, align: 8, offset: 653632)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 33280, align: 8, elements: !407)
!407 = !{!262, !408}
!408 = !DISubrange(count: 65)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "mix_1_1_f", scope: !135, file: !136, line: 179, baseType: !410, size: 64, align: 64, offset: 686912)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_1_1_func_type", file: !136, line: 40, baseType: !412)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !94, !414, !94, !416, !416}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "integer", file: !136, line: 35, baseType: !90)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mix_1_1_simd", scope: !135, file: !136, line: 180, baseType: !410, size: 64, align: 64, offset: 686976)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "mix_2_1_f", scope: !135, file: !136, line: 182, baseType: !419, size: 64, align: 64, offset: 687040)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_2_1_func_type", file: !136, line: 41, baseType: !421)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !94, !414, !414, !94, !416, !416, !416}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mix_2_1_simd", scope: !135, file: !136, line: 183, baseType: !419, size: 64, align: 64, offset: 687104)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mix_any_f", scope: !135, file: !136, line: 185, baseType: !425, size: 64, align: 64, offset: 687168)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "mix_any_func_type", file: !136, line: 43, baseType: !427)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !332, !96, !94, !416}
!429 = !DILocalVariable(name: "s", arg: 1, scope: !130, file: !103, line: 52, type: !134)
!430 = !DIExpression()
!431 = !DILocation(line: 52, column: 48, scope: !130)
!432 = !DILocalVariable(name: "channel_map", arg: 2, scope: !130, file: !103, line: 52, type: !233)
!433 = !DILocation(line: 52, column: 62, scope: !130)
!434 = !DILocation(line: 53, column: 9, scope: !435)
!435 = distinct !DILexicalBlock(scope: !130, file: !103, line: 53, column: 8)
!436 = !DILocation(line: 53, column: 11, scope: !435)
!437 = !DILocation(line: 53, column: 14, scope: !438)
!438 = !DILexicalBlockFile(scope: !435, file: !103, discriminator: 1)
!439 = !DILocation(line: 53, column: 17, scope: !438)
!440 = !DILocation(line: 53, column: 8, scope: !438)
!441 = !DILocation(line: 54, column: 9, scope: !435)
!442 = !DILocation(line: 55, column: 22, scope: !130)
!443 = !DILocation(line: 55, column: 5, scope: !130)
!444 = !DILocation(line: 55, column: 8, scope: !130)
!445 = !DILocation(line: 55, column: 20, scope: !130)
!446 = !DILocation(line: 56, column: 5, scope: !130)
!447 = !DILocation(line: 57, column: 1, scope: !130)
!448 = distinct !DISubprogram(name: "swr_alloc_set_opts", scope: !103, file: !103, line: 59, type: !449, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!449 = !DISubroutineType(types: !450)
!450 = !{!134, !134, !90, !46, !133, !90, !46, !133, !133, !94}
!451 = !DILocalVariable(name: "s", arg: 1, scope: !448, file: !103, line: 59, type: !134)
!452 = !DILocation(line: 59, column: 58, scope: !448)
!453 = !DILocalVariable(name: "out_ch_layout", arg: 2, scope: !448, file: !103, line: 60, type: !90)
!454 = !DILocation(line: 60, column: 47, scope: !448)
!455 = !DILocalVariable(name: "out_sample_fmt", arg: 3, scope: !448, file: !103, line: 60, type: !46)
!456 = !DILocation(line: 60, column: 82, scope: !448)
!457 = !DILocalVariable(name: "out_sample_rate", arg: 4, scope: !448, file: !103, line: 60, type: !133)
!458 = !DILocation(line: 60, column: 102, scope: !448)
!459 = !DILocalVariable(name: "in_ch_layout", arg: 5, scope: !448, file: !103, line: 61, type: !90)
!460 = !DILocation(line: 61, column: 47, scope: !448)
!461 = !DILocalVariable(name: "in_sample_fmt", arg: 6, scope: !448, file: !103, line: 61, type: !46)
!462 = !DILocation(line: 61, column: 81, scope: !448)
!463 = !DILocalVariable(name: "in_sample_rate", arg: 7, scope: !448, file: !103, line: 61, type: !133)
!464 = !DILocation(line: 61, column: 100, scope: !448)
!465 = !DILocalVariable(name: "log_offset", arg: 8, scope: !448, file: !103, line: 62, type: !133)
!466 = !DILocation(line: 62, column: 43, scope: !448)
!467 = !DILocalVariable(name: "log_ctx", arg: 9, scope: !448, file: !103, line: 62, type: !94)
!468 = !DILocation(line: 62, column: 61, scope: !448)
!469 = !DILocation(line: 63, column: 9, scope: !470)
!470 = distinct !DILexicalBlock(scope: !448, file: !103, line: 63, column: 8)
!471 = !DILocation(line: 63, column: 8, scope: !448)
!472 = !DILocation(line: 63, column: 15, scope: !473)
!473 = !DILexicalBlockFile(scope: !470, file: !103, discriminator: 1)
!474 = !DILocation(line: 63, column: 13, scope: !473)
!475 = !DILocation(line: 63, column: 12, scope: !473)
!476 = !DILocation(line: 64, column: 9, scope: !477)
!477 = distinct !DILexicalBlock(scope: !448, file: !103, line: 64, column: 8)
!478 = !DILocation(line: 64, column: 8, scope: !448)
!479 = !DILocation(line: 64, column: 12, scope: !480)
!480 = !DILexicalBlockFile(scope: !477, file: !103, discriminator: 1)
!481 = !DILocation(line: 66, column: 26, scope: !448)
