; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavutil--audio_fifo.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavutil--audio_fifo.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVAudioFifo = type { %struct.AVFifoBuffer**, i32, i32, i32, i32, i32, i32 }
%struct.AVFifoBuffer = type { i8*, i8*, i8*, i8*, i32, i32 }

; Function Attrs: nounwind uwtable
define void @av_audio_fifo_free(%struct.AVAudioFifo* %af) #0 !dbg !26 {
entry:
  %af.addr = alloca %struct.AVAudioFifo*, align 8
  %i = alloca i32, align 4
  store %struct.AVAudioFifo* %af, %struct.AVAudioFifo** %af.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.AVAudioFifo** %af.addr, metadata !60, metadata !61), !dbg !62
  %0 = load %struct.AVAudioFifo*, %struct.AVAudioFifo** %af.addr, align 8, !dbg !63
  %tobool = icmp ne %struct.AVAudioFifo* %0, null, !dbg !63
  br i1 %tobool, label %if.then, label %if.end5, !dbg !65

if.then:                                          ; preds = %entry
  %1 = load %struct.AVAudioFifo*, %struct.AVAudioFifo** %af.addr, align 8, !dbg !66
  %buf = getelementptr inbounds %struct.AVAudioFifo, %struct.AVAudioFifo* %1, i32 0, i32 0, !dbg !69
  %2 = load %struct.AVFifoBuffer**, %struct.AVFifoBuffer*** %buf, align 8, !dbg !69
  %tobool1 = icmp ne %struct.AVFifoBuffer** %2, null, !dbg !66
  br i1 %tobool1, label %if.then2, label %if.end, !dbg !70


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !20)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavutil--audio_fifo.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSampleFormat", file: !4, line: 58, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavutil/samplefmt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!6 = !DIEnumerator(name: "AV_SAMPLE_FMT_NONE", value: -1)
!7 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8", value: 0)
!8 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16", value: 1)
!9 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32", value: 2)
!10 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLT", value: 3)
!11 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBL", value: 4)
!12 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8P", value: 5)
!13 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16P", value: 6)
!14 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32P", value: 7)
!15 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLTP", value: 8)
!16 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBLP", value: 9)
!17 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64", value: 10)
!18 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!19 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!20 = !{!21, !22}
!21 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!22 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!23 = !{i32 2, !"Dwarf Version", i32 4}
!24 = !{i32 2, !"Debug Info Version", i32 3}
!25 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!26 = distinct !DISubprogram(name: "av_audio_fifo_free", scope: !27, file: !27, line: 45, type: !28, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !59)
!27 = !DIFile(filename: "libavutil/audio_fifo.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!28 = !DISubroutineType(types: !29)
!29 = !{null, !30}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVAudioFifo", file: !32, line: 49, baseType: !33)
!32 = !DIFile(filename: "libavutil/audio_fifo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVAudioFifo", file: !27, line: 34, size: 256, align: 64, elements: !34)
!34 = !{!35, !53, !54, !55, !56, !57, !58}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !33, file: !27, line: 35, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFifoBuffer", file: !39, line: 35, baseType: !40)
!39 = !DIFile(filename: "libavutil/fifo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFifoBuffer", file: !39, line: 31, size: 320, align: 64, elements: !41)
!41 = !{!42, !47, !48, !49, !50, !52}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !40, file: !39, line: 32, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !45, line: 48, baseType: !46)
!45 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!46 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "rptr", scope: !40, file: !39, line: 33, baseType: !43, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "wptr", scope: !40, file: !39, line: 33, baseType: !43, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !40, file: !39, line: 33, baseType: !43, size: 64, align: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "rndx", scope: !40, file: !39, line: 34, baseType: !51, size: 32, align: 32, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !45, line: 51, baseType: !22)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "wndx", scope: !40, file: !39, line: 34, baseType: !51, size: 32, align: 32, offset: 288)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "nb_buffers", scope: !33, file: !27, line: 36, baseType: !21, size: 32, align: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !33, file: !27, line: 37, baseType: !21, size: 32, align: 32, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_samples", scope: !33, file: !27, line: 38, baseType: !21, size: 32, align: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !33, file: !27, line: 40, baseType: !21, size: 32, align: 32, offset: 160)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !33, file: !27, line: 41, baseType: !3, size: 32, align: 32, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "sample_size", scope: !33, file: !27, line: 42, baseType: !21, size: 32, align: 32, offset: 224)
!59 = !{}
!60 = !DILocalVariable(name: "af", arg: 1, scope: !26, file: !27, line: 45, type: !30)
!61 = !DIExpression()
!62 = !DILocation(line: 45, column: 38, scope: !26)
!63 = !DILocation(line: 47, column: 9, scope: !64)
!64 = distinct !DILexicalBlock(scope: !26, file: !27, line: 47, column: 9)
!65 = !DILocation(line: 47, column: 9, scope: !26)
!66 = !DILocation(line: 48, column: 13, scope: !67)
!67 = distinct !DILexicalBlock(scope: !68, file: !27, line: 48, column: 13)
!68 = distinct !DILexicalBlock(scope: !64, file: !27, line: 47, column: 13)
!69 = !DILocation(line: 48, column: 17, scope: !67)
!70 = !DILocation(line: 48, column: 13, scope: !68)
!71 = !DILocalVariable(name: "i", scope: !72, file: !27, line: 49, type: !21)
!72 = distinct !DILexicalBlock(scope: !67, file: !27, line: 48, column: 22)
!73 = !DILocation(line: 49, column: 17, scope: !72)
!74 = !DILocation(line: 50, column: 20, scope: !75)
!75 = distinct !DILexicalBlock(scope: !72, file: !27, line: 50, column: 13)
!76 = !DILocation(line: 50, column: 18, scope: !75)
!77 = !DILocation(line: 50, column: 25, scope: !78)
!78 = !DILexicalBlockFile(scope: !79, file: !27, discriminator: 1)
!79 = distinct !DILexicalBlock(scope: !75, file: !27, line: 50, column: 13)
!80 = !DILocation(line: 50, column: 29, scope: !78)
!81 = !DILocation(line: 50, column: 33, scope: !78)
!82 = !DILocation(line: 50, column: 27, scope: !78)
!83 = !DILocation(line: 50, column: 13, scope: !78)
!84 = !DILocation(line: 51, column: 40, scope: !85)
!85 = distinct !DILexicalBlock(scope: !79, file: !27, line: 50, column: 50)
!86 = !DILocation(line: 51, column: 32, scope: !85)
!87 = !DILocation(line: 51, column: 36, scope: !85)
!88 = !DILocation(line: 51, column: 17, scope: !85)
!89 = !DILocation(line: 52, column: 13, scope: !85)
!90 = !DILocation(line: 50, column: 46, scope: !91)
!91 = !DILexicalBlockFile(scope: !79, file: !27, discriminator: 2)
!92 = !DILocation(line: 50, column: 13, scope: !91)
!93 = distinct !{!93, !94}
!94 = !DILocation(line: 50, column: 13, scope: !72)
!95 = !DILocation(line: 53, column: 23, scope: !72)
!96 = !DILocation(line: 53, column: 27, scope: !72)
!97 = !DILocation(line: 53, column: 22, scope: !72)
!98 = !DILocation(line: 53, column: 13, scope: !72)
!99 = !DILocation(line: 54, column: 9, scope: !72)
!100 = !DILocation(line: 55, column: 17, scope: !68)
!101 = !DILocation(line: 55, column: 9, scope: !68)
!102 = !DILocation(line: 56, column: 5, scope: !68)
!103 = !DILocation(line: 57, column: 1, scope: !26)
!104 = distinct !DISubprogram(name: "av_audio_fifo_alloc", scope: !27, file: !27, line: 59, type: !105, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !59)
!105 = !DISubroutineType(types: !106)
!106 = !{!30, !3, !21, !21}
!107 = !DILocalVariable(name: "sample_fmt", arg: 1, scope: !104, file: !27, line: 59, type: !3)
!108 = !DILocation(line: 59, column: 54, scope: !104)
!109 = !DILocalVariable(name: "channels", arg: 2, scope: !104, file: !27, line: 59, type: !21)
!110 = !DILocation(line: 59, column: 70, scope: !104)
!111 = !DILocalVariable(name: "nb_samples", arg: 3, scope: !104, file: !27, line: 60, type: !21)
!112 = !DILocation(line: 60, column: 38, scope: !104)
!113 = !DILocalVariable(name: "af", scope: !104, file: !27, line: 62, type: !30)
!114 = !DILocation(line: 62, column: 18, scope: !104)
!115 = !DILocalVariable(name: "buf_size", scope: !104, file: !27, line: 63, type: !21)
!116 = !DILocation(line: 63, column: 9, scope: !104)
!117 = !DILocalVariable(name: "i", scope: !104, file: !27, line: 63, type: !21)
!118 = !DILocation(line: 63, column: 19, scope: !104)
!119 = !DILocation(line: 66, column: 47, scope: !120)
!120 = distinct !DILexicalBlock(scope: !104, file: !27, line: 66, column: 9)
!121 = !DILocation(line: 66, column: 57, scope: !120)
