; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--opusenc_psy.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--opusenc_psy.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.OpusPsyContext = type { %struct.AVCodecContext*, %struct.AVFloatDSPContext*, %struct.FFBufQueue*, %struct.OpusEncOptions*, [128 x %struct.PsyChain], i32, [2 x [21 x %struct.OpusBandExcitation]], [2 x [21 x %struct.FFBesselFilter]], [2 x [21 x %struct.FFBesselFilter]], [146 x %struct.OpusPsyStep*], i32, [4 x float*], [4 x %struct.MDCT15Context*], i32, [20 x i8], [2048 x float], float, float, i64, i64, %struct.FFBesselFilter, %struct.OpusPacketInfo, i32, i32, i32, i32, float, i32*, i32, [12 x i8] }

!923 = !DIEnumerator(name: "CELT_SPREAD_LIGHT", value: 1)
!924 = !DIEnumerator(name: "CELT_SPREAD_NORMAL", value: 2)
!925 = !DIEnumerator(name: "CELT_SPREAD_AGGRESSIVE", value: 3)
!926 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "WindowFunc", file: !927, line: 28, size: 32, align: 32, elements: !928)
!927 = !DIFile(filename: "./libavfilter/window_func.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!928 = !{!929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949}
!929 = !DIEnumerator(name: "WFUNC_RECT", value: 0)
!930 = !DIEnumerator(name: "WFUNC_HANNING", value: 1)
!931 = !DIEnumerator(name: "WFUNC_HAMMING", value: 2)
!932 = !DIEnumerator(name: "WFUNC_BLACKMAN", value: 3)
!933 = !DIEnumerator(name: "WFUNC_BARTLETT", value: 4)
!934 = !DIEnumerator(name: "WFUNC_WELCH", value: 5)
!935 = !DIEnumerator(name: "WFUNC_FLATTOP", value: 6)
!936 = !DIEnumerator(name: "WFUNC_BHARRIS", value: 7)
!937 = !DIEnumerator(name: "WFUNC_BNUTTALL", value: 8)
!938 = !DIEnumerator(name: "WFUNC_SINE", value: 9)
!939 = !DIEnumerator(name: "WFUNC_NUTTALL", value: 10)
!940 = !DIEnumerator(name: "WFUNC_BHANN", value: 11)
!941 = !DIEnumerator(name: "WFUNC_LANCZOS", value: 12)
!942 = !DIEnumerator(name: "WFUNC_GAUSS", value: 13)
!943 = !DIEnumerator(name: "WFUNC_TUKEY", value: 14)
!944 = !DIEnumerator(name: "WFUNC_DOLPH", value: 15)
!945 = !DIEnumerator(name: "WFUNC_CAUCHY", value: 16)
!946 = !DIEnumerator(name: "WFUNC_PARZEN", value: 17)
!947 = !DIEnumerator(name: "WFUNC_POISSON", value: 18)
!948 = !DIEnumerator(name: "WFUNC_BOHMAN", value: 19)
!949 = !DIEnumerator(name: "NB_WFUNC", value: 20)
!950 = !{!951, !952, !953, !954}
!951 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!952 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!953 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!955 = !{i32 2, !"Dwarf Version", i32 4}
!956 = !{i32 2, !"Debug Info Version", i32 3}
!957 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!958 = distinct !DISubprogram(name: "ff_opus_psy_process", scope: !959, file: !959, line: 223, type: !960, isLocal: false, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1929)
!959 = !DIFile(filename: "libavcodec/opusenc_psy.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!960 = !DISubroutineType(types: !961)
!961 = !{!952, !962, !1928}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "OpusPsyContext", file: !964, line: 92, baseType: !965)
!964 = !DIFile(filename: "libavcodec/opusenc_psy.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OpusPsyContext", file: !964, line: 54, size: 118784, align: 256, elements: !966)
!966 = !{!967, !1697, !1742, !1753, !1760, !1769, !1770, !1781, !1796, !1797, !1821, !1822, !1824, !1903, !1904, !1908, !1909, !1910, !1911, !1912, !1913, !1921, !1922, !1923, !1924, !1925, !1926, !1927}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !965, file: !964, line: 55, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !971)
!971 = !{!972, !1016, !1017, !1018, !1296, !1297, !1298, !1299, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1452, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1635, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !970, file: !35, line: 1561, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !977)
!977 = !{!978, !982, !986, !990, !991, !992, !993, !997, !1003, !1005, !1009}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !976, file: !4, line: 72, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !976, file: !4, line: 78, baseType: !983, size: 64, align: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!979, !954}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !976, file: !4, line: 85, baseType: !987, size: 64, align: 64, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !976, file: !4, line: 93, baseType: !952, size: 32, align: 32, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !976, file: !4, line: 99, baseType: !952, size: 32, align: 32, offset: 224)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !976, file: !4, line: 108, baseType: !952, size: 32, align: 32, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !976, file: !4, line: 113, baseType: !994, size: 64, align: 64, offset: 320)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!954, !954, !954}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !976, file: !4, line: 123, baseType: !998, size: 64, align: 64, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!1001, !1001}
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !976, file: !4, line: 130, baseType: !1004, size: 32, align: 32, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !976, file: !4, line: 136, baseType: !1006, size: 64, align: 64, offset: 512)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!1004, !954}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !976, file: !4, line: 142, baseType: !1010, size: 64, align: 64, offset: 576)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!952, !1013, !954, !979, !952}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !970, file: !35, line: 1562, baseType: !952, size: 32, align: 32, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !970, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !970, file: !35, line: 1565, baseType: !1019, size: 64, align: 64, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028, !1037, !1040, !1043, !1046, !1052, !1055, !1056, !1064, !1065, !1066, !1068, !1072, !1078, !1089, !1093, !1094, !1146, !1267, !1271, !1272, !1276, !1280, !1285, !1289, !1290, !1291}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1021, file: !35, line: 3475, baseType: !979, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1021, file: !35, line: 3480, baseType: !979, size: 64, align: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1021, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1021, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1021, file: !35, line: 3487, baseType: !952, size: 32, align: 32, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1021, file: !35, line: 3488, baseType: !1029, size: 64, align: 64, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1032, line: 61, baseType: !1033)
!1032 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1032, line: 58, size: 64, align: 32, elements: !1034)
!1034 = !{!1035, !1036}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1033, file: !1032, line: 59, baseType: !952, size: 32, align: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1033, file: !1032, line: 60, baseType: !952, size: 32, align: 32, offset: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1021, file: !35, line: 3489, baseType: !1038, size: 64, align: 64, offset: 320)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1021, file: !35, line: 3490, baseType: !1041, size: 64, align: 64, offset: 384)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1021, file: !35, line: 3491, baseType: !1044, size: 64, align: 64, offset: 448)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1021, file: !35, line: 3492, baseType: !1047, size: 64, align: 64, offset: 512)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1049)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1050, line: 55, baseType: !1051)
!1050 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1051 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1021, file: !35, line: 3493, baseType: !1053, size: 8, align: 8, offset: 576)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1050, line: 48, baseType: !1054)
!1054 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1021, file: !35, line: 3494, baseType: !973, size: 64, align: 64, offset: 640)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1021, file: !35, line: 3495, baseType: !1057, size: 64, align: 64, offset: 704)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1061)
!1061 = !{!1062, !1063}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1060, file: !35, line: 3402, baseType: !952, size: 32, align: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1060, file: !35, line: 3403, baseType: !979, size: 64, align: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1021, file: !35, line: 3507, baseType: !979, size: 64, align: 64, offset: 768)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1021, file: !35, line: 3516, baseType: !952, size: 32, align: 32, offset: 832)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1021, file: !35, line: 3517, baseType: !1067, size: 64, align: 64, offset: 896)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1021, file: !35, line: 3527, baseType: !1069, size: 64, align: 64, offset: 960)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!952, !968}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1021, file: !35, line: 3535, baseType: !1073, size: 64, align: 64, offset: 1024)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!952, !968, !1076}
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1021, file: !35, line: 3541, baseType: !1079, size: 64, align: 64, offset: 1088)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1083, line: 223, size: 128, align: 64, elements: !1084)
!1083 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1084 = !{!1085, !1088}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1082, file: !1083, line: 224, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1082, file: !1083, line: 225, baseType: !1086, size: 64, align: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1021, file: !35, line: 3549, baseType: !1090, size: 64, align: 64, offset: 1152)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{null, !1067}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1021, file: !35, line: 3551, baseType: !1069, size: 64, align: 64, offset: 1216)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1021, file: !35, line: 3552, baseType: !1095, size: 64, align: 64, offset: 1280)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!952, !968, !1098, !952, !1099}
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1102)
!1102 = !{!1103, !1106, !1109, !1110, !1111, !1143}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1101, file: !35, line: 3921, baseType: !1104, size: 16, align: 16)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1050, line: 49, baseType: !1105)
!1105 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1101, file: !35, line: 3922, baseType: !1107, size: 32, align: 32, offset: 32)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1050, line: 51, baseType: !1108)
!1108 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1101, file: !35, line: 3923, baseType: !1107, size: 32, align: 32, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1101, file: !35, line: 3924, baseType: !1108, size: 32, align: 32, offset: 96)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1101, file: !35, line: 3925, baseType: !1112, size: 64, align: 64, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1115)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1116)
!1116 = !{!1117, !1118, !1119, !1120, !1121, !1122, !1132, !1136, !1138, !1139, !1141, !1142}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1115, file: !35, line: 3886, baseType: !952, size: 32, align: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1115, file: !35, line: 3887, baseType: !952, size: 32, align: 32, offset: 32)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1115, file: !35, line: 3888, baseType: !952, size: 32, align: 32, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1115, file: !35, line: 3889, baseType: !952, size: 32, align: 32, offset: 96)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1115, file: !35, line: 3890, baseType: !952, size: 32, align: 32, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1115, file: !35, line: 3897, baseType: !1123, size: 768, align: 64, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1124)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1125)
!1125 = !{!1126, !1130}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1124, file: !35, line: 3855, baseType: !1127, size: 512, align: 64)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1098, size: 512, align: 64, elements: !1128)
!1128 = !{!1129}
!1129 = !DISubrange(count: 8)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1124, file: !35, line: 3857, baseType: !1131, size: 256, align: 32, offset: 512)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 256, align: 32, elements: !1128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1115, file: !35, line: 3903, baseType: !1133, size: 256, align: 64, offset: 960)
!1133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1098, size: 256, align: 64, elements: !1134)
!1134 = !{!1135}
!1135 = !DISubrange(count: 4)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1115, file: !35, line: 3904, baseType: !1137, size: 128, align: 32, offset: 1216)
!1137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 128, align: 32, elements: !1134)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1115, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1115, file: !35, line: 3908, baseType: !1140, size: 64, align: 64, offset: 1408)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1115, file: !35, line: 3915, baseType: !1140, size: 64, align: 64, offset: 1472)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1115, file: !35, line: 3917, baseType: !952, size: 32, align: 32, offset: 1536)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1101, file: !35, line: 3926, baseType: !1144, size: 64, align: 64, offset: 192)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1050, line: 40, baseType: !1145)
!1145 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1021, file: !35, line: 3564, baseType: !1147, size: 64, align: 64, offset: 1344)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!952, !968, !1150, !1184, !1266}
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1153)
!1153 = !{!1154, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1180, !1181, !1182, !1183}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1152, file: !35, line: 1451, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1157, line: 94, baseType: !1158)
!1157 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1157, line: 81, size: 192, align: 64, elements: !1159)
!1159 = !{!1160, !1164, !1165}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1158, file: !1157, line: 82, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1157, line: 73, baseType: !1163)
!1163 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1157, line: 73, flags: DIFlagFwdDecl)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1158, file: !1157, line: 89, baseType: !1098, size: 64, align: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1158, file: !1157, line: 93, baseType: !952, size: 32, align: 32, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1152, file: !35, line: 1461, baseType: !1144, size: 64, align: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1152, file: !35, line: 1467, baseType: !1144, size: 64, align: 64, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1152, file: !35, line: 1468, baseType: !1098, size: 64, align: 64, offset: 192)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1152, file: !35, line: 1469, baseType: !952, size: 32, align: 32, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1152, file: !35, line: 1470, baseType: !952, size: 32, align: 32, offset: 288)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1152, file: !35, line: 1474, baseType: !952, size: 32, align: 32, offset: 320)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1152, file: !35, line: 1479, baseType: !1173, size: 64, align: 64, offset: 384)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1176)
!1176 = !{!1177, !1178, !1179}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1175, file: !35, line: 1412, baseType: !1098, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1175, file: !35, line: 1413, baseType: !952, size: 32, align: 32, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1175, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1152, file: !35, line: 1480, baseType: !952, size: 32, align: 32, offset: 448)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1152, file: !35, line: 1486, baseType: !1144, size: 64, align: 64, offset: 512)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1152, file: !35, line: 1488, baseType: !1144, size: 64, align: 64, offset: 576)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1152, file: !35, line: 1497, baseType: !1144, size: 64, align: 64, offset: 640)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1186)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1188)
!1188 = !{!1189, !1190, !1191, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1218, !1220, !1221, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1254, !1255, !1256, !1257, !1258, !1259, !1262, !1263, !1264, !1265}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1187, file: !758, line: 282, baseType: !1127, size: 512, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1187, file: !758, line: 299, baseType: !1131, size: 256, align: 32, offset: 512)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1187, file: !758, line: 315, baseType: !1192, size: 64, align: 64, offset: 768)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1187, file: !758, line: 326, baseType: !952, size: 32, align: 32, offset: 832)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1187, file: !758, line: 326, baseType: !952, size: 32, align: 32, offset: 864)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1187, file: !758, line: 334, baseType: !952, size: 32, align: 32, offset: 896)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1187, file: !758, line: 341, baseType: !952, size: 32, align: 32, offset: 928)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1187, file: !758, line: 346, baseType: !952, size: 32, align: 32, offset: 960)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1187, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1187, file: !758, line: 356, baseType: !1031, size: 64, align: 32, offset: 1024)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1187, file: !758, line: 361, baseType: !1144, size: 64, align: 64, offset: 1088)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1187, file: !758, line: 369, baseType: !1144, size: 64, align: 64, offset: 1152)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1187, file: !758, line: 377, baseType: !1144, size: 64, align: 64, offset: 1216)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1187, file: !758, line: 382, baseType: !952, size: 32, align: 32, offset: 1280)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1187, file: !758, line: 386, baseType: !952, size: 32, align: 32, offset: 1312)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1187, file: !758, line: 391, baseType: !952, size: 32, align: 32, offset: 1344)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1187, file: !758, line: 396, baseType: !954, size: 64, align: 64, offset: 1408)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1187, file: !758, line: 403, baseType: !1208, size: 512, align: 64, offset: 1472)
!1208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 512, align: 64, elements: !1128)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1187, file: !758, line: 410, baseType: !952, size: 32, align: 32, offset: 1984)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1187, file: !758, line: 415, baseType: !952, size: 32, align: 32, offset: 2016)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1187, file: !758, line: 420, baseType: !952, size: 32, align: 32, offset: 2048)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1187, file: !758, line: 425, baseType: !952, size: 32, align: 32, offset: 2080)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1187, file: !758, line: 435, baseType: !1144, size: 64, align: 64, offset: 2112)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1187, file: !758, line: 440, baseType: !952, size: 32, align: 32, offset: 2176)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1187, file: !758, line: 445, baseType: !1049, size: 64, align: 64, offset: 2240)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1187, file: !758, line: 459, baseType: !1217, size: 512, align: 64, offset: 2304)
!1217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1155, size: 512, align: 64, elements: !1128)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1187, file: !758, line: 473, baseType: !1219, size: 64, align: 64, offset: 2816)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1187, file: !758, line: 477, baseType: !952, size: 32, align: 32, offset: 2880)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1187, file: !758, line: 479, baseType: !1222, size: 64, align: 64, offset: 2944)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1226)
!1226 = !{!1227, !1228, !1229, !1230, !1235}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1225, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1225, file: !758, line: 203, baseType: !1098, size: 64, align: 64, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1225, file: !758, line: 204, baseType: !952, size: 32, align: 32, offset: 128)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1225, file: !758, line: 205, baseType: !1231, size: 64, align: 64, offset: 192)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1233, line: 86, baseType: !1234)
!1233 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1234 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1233, line: 86, flags: DIFlagFwdDecl)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1225, file: !758, line: 206, baseType: !1155, size: 64, align: 64, offset: 256)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1187, file: !758, line: 480, baseType: !952, size: 32, align: 32, offset: 3008)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1187, file: !758, line: 505, baseType: !952, size: 32, align: 32, offset: 3040)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1187, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1187, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1187, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1187, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1187, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1187, file: !758, line: 532, baseType: !1144, size: 64, align: 64, offset: 3264)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1187, file: !758, line: 539, baseType: !1144, size: 64, align: 64, offset: 3328)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1187, file: !758, line: 547, baseType: !1144, size: 64, align: 64, offset: 3392)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1187, file: !758, line: 554, baseType: !1231, size: 64, align: 64, offset: 3456)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1187, file: !758, line: 563, baseType: !952, size: 32, align: 32, offset: 3520)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1187, file: !758, line: 572, baseType: !952, size: 32, align: 32, offset: 3552)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1187, file: !758, line: 581, baseType: !952, size: 32, align: 32, offset: 3584)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1187, file: !758, line: 588, baseType: !1251, size: 64, align: 64, offset: 3648)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1050, line: 36, baseType: !1253)
!1253 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1187, file: !758, line: 593, baseType: !952, size: 32, align: 32, offset: 3712)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1187, file: !758, line: 596, baseType: !952, size: 32, align: 32, offset: 3744)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1187, file: !758, line: 599, baseType: !1155, size: 64, align: 64, offset: 3776)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1187, file: !758, line: 605, baseType: !1155, size: 64, align: 64, offset: 3840)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1187, file: !758, line: 616, baseType: !1155, size: 64, align: 64, offset: 3904)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1187, file: !758, line: 626, baseType: !1260, size: 64, align: 64, offset: 3968)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1261, line: 216, baseType: !1051)
!1261 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1187, file: !758, line: 627, baseType: !1260, size: 64, align: 64, offset: 4032)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1187, file: !758, line: 628, baseType: !1260, size: 64, align: 64, offset: 4096)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1187, file: !758, line: 629, baseType: !1260, size: 64, align: 64, offset: 4160)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1187, file: !758, line: 645, baseType: !1155, size: 64, align: 64, offset: 4224)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1021, file: !35, line: 3566, baseType: !1268, size: 64, align: 64, offset: 1408)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!952, !968, !954, !1266, !1150}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1021, file: !35, line: 3567, baseType: !1069, size: 64, align: 64, offset: 1472)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1021, file: !35, line: 3576, baseType: !1273, size: 64, align: 64, offset: 1536)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!952, !968, !1184}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1021, file: !35, line: 3577, baseType: !1277, size: 64, align: 64, offset: 1600)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!952, !968, !1150}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1021, file: !35, line: 3584, baseType: !1281, size: 64, align: 64, offset: 1664)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{!952, !968, !1284}
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1021, file: !35, line: 3589, baseType: !1286, size: 64, align: 64, offset: 1728)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{null, !968}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1021, file: !35, line: 3594, baseType: !952, size: 32, align: 32, offset: 1792)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1021, file: !35, line: 3600, baseType: !979, size: 64, align: 64, offset: 1856)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1021, file: !35, line: 3609, baseType: !1292, size: 64, align: 64, offset: 1920)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1295)
!1295 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !970, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !970, file: !35, line: 1581, baseType: !1108, size: 32, align: 32, offset: 224)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !970, file: !35, line: 1583, baseType: !954, size: 64, align: 64, offset: 256)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !970, file: !35, line: 1591, baseType: !1300, size: 64, align: 64, offset: 320)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1083, line: 129, size: 1664, align: 64, elements: !1302)
!1302 = !{!1303, !1304, !1305, !1306, !1307, !1325, !1326, !1332, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1301, file: !1083, line: 136, baseType: !952, size: 32, align: 32)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1301, file: !1083, line: 151, baseType: !952, size: 32, align: 32, offset: 32)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1301, file: !1083, line: 157, baseType: !952, size: 32, align: 32, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1301, file: !1083, line: 159, baseType: !1284, size: 64, align: 64, offset: 128)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1301, file: !1083, line: 161, baseType: !1308, size: 64, align: 64, offset: 192)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1083, line: 117, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1083, line: 100, size: 832, align: 64, elements: !1311)
!1311 = !{!1312, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1310, file: !1083, line: 105, baseType: !1313, size: 256, align: 64)
!1313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1314, size: 256, align: 64, elements: !1134)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1157, line: 238, baseType: !1316)
!1316 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1157, line: 238, flags: DIFlagFwdDecl)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1310, file: !1083, line: 110, baseType: !952, size: 32, align: 32, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1310, file: !1083, line: 111, baseType: !952, size: 32, align: 32, offset: 288)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1310, file: !1083, line: 111, baseType: !952, size: 32, align: 32, offset: 320)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1310, file: !1083, line: 112, baseType: !1131, size: 256, align: 32, offset: 352)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1310, file: !1083, line: 113, baseType: !1137, size: 128, align: 32, offset: 608)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1310, file: !1083, line: 114, baseType: !952, size: 32, align: 32, offset: 736)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1310, file: !1083, line: 115, baseType: !952, size: 32, align: 32, offset: 768)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1310, file: !1083, line: 116, baseType: !952, size: 32, align: 32, offset: 800)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1301, file: !1083, line: 163, baseType: !954, size: 64, align: 64, offset: 256)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1301, file: !1083, line: 165, baseType: !1327, size: 128, align: 64, offset: 320)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1083, line: 122, baseType: !1328)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1083, line: 119, size: 128, align: 64, elements: !1329)
!1329 = !{!1330, !1331}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1328, file: !1083, line: 120, baseType: !1150, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1328, file: !1083, line: 121, baseType: !1284, size: 64, align: 64, offset: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1301, file: !1083, line: 166, baseType: !1333, size: 128, align: 64, offset: 448)
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1083, line: 127, baseType: !1334)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1083, line: 124, size: 128, align: 64, elements: !1335)
!1335 = !{!1336, !1409}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1334, file: !1083, line: 125, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1340)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1341)
!1341 = !{!1342, !1343, !1367, !1371, !1372, !1406, !1407, !1408}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1340, file: !35, line: 5751, baseType: !973, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1340, file: !35, line: 5756, baseType: !1344, size: 64, align: 64, offset: 64)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1346)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1347)
!1347 = !{!1348, !1349, !1352, !1353, !1354, !1358, !1362, !1366}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1346, file: !35, line: 5797, baseType: !979, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1346, file: !35, line: 5804, baseType: !1350, size: 64, align: 64, offset: 64)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1346, file: !35, line: 5815, baseType: !973, size: 64, align: 64, offset: 128)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1346, file: !35, line: 5825, baseType: !952, size: 32, align: 32, offset: 192)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1346, file: !35, line: 5826, baseType: !1355, size: 64, align: 64, offset: 256)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!952, !1338}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1346, file: !35, line: 5827, baseType: !1359, size: 64, align: 64, offset: 320)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{!952, !1338, !1150}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1346, file: !35, line: 5828, baseType: !1363, size: 64, align: 64, offset: 384)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DISubroutineType(types: !1365)
!1365 = !{null, !1338}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1346, file: !35, line: 5829, baseType: !1363, size: 64, align: 64, offset: 448)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1340, file: !35, line: 5762, baseType: !1368, size: 64, align: 64, offset: 128)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1370)
!1370 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1340, file: !35, line: 5768, baseType: !954, size: 64, align: 64, offset: 192)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1340, file: !35, line: 5775, baseType: !1373, size: 64, align: 64, offset: 256)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1375)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1376)
!1376 = !{!1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1375, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1375, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1375, file: !35, line: 3948, baseType: !1107, size: 32, align: 32, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1375, file: !35, line: 3958, baseType: !1098, size: 64, align: 64, offset: 128)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1375, file: !35, line: 3962, baseType: !952, size: 32, align: 32, offset: 192)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1375, file: !35, line: 3968, baseType: !952, size: 32, align: 32, offset: 224)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1375, file: !35, line: 3973, baseType: !1144, size: 64, align: 64, offset: 256)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1375, file: !35, line: 3986, baseType: !952, size: 32, align: 32, offset: 320)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1375, file: !35, line: 3999, baseType: !952, size: 32, align: 32, offset: 352)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1375, file: !35, line: 4004, baseType: !952, size: 32, align: 32, offset: 384)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1375, file: !35, line: 4005, baseType: !952, size: 32, align: 32, offset: 416)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1375, file: !35, line: 4010, baseType: !952, size: 32, align: 32, offset: 448)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1375, file: !35, line: 4011, baseType: !952, size: 32, align: 32, offset: 480)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1375, file: !35, line: 4020, baseType: !1031, size: 64, align: 32, offset: 512)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1375, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1375, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1375, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1375, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1375, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1375, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1375, file: !35, line: 4039, baseType: !952, size: 32, align: 32, offset: 768)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1375, file: !35, line: 4046, baseType: !1049, size: 64, align: 64, offset: 832)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1375, file: !35, line: 4050, baseType: !952, size: 32, align: 32, offset: 896)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1375, file: !35, line: 4054, baseType: !952, size: 32, align: 32, offset: 928)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1375, file: !35, line: 4061, baseType: !952, size: 32, align: 32, offset: 960)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1375, file: !35, line: 4065, baseType: !952, size: 32, align: 32, offset: 992)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1375, file: !35, line: 4073, baseType: !952, size: 32, align: 32, offset: 1024)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1375, file: !35, line: 4080, baseType: !952, size: 32, align: 32, offset: 1056)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1375, file: !35, line: 4084, baseType: !952, size: 32, align: 32, offset: 1088)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1340, file: !35, line: 5781, baseType: !1373, size: 64, align: 64, offset: 320)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1340, file: !35, line: 5787, baseType: !1031, size: 64, align: 32, offset: 384)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1340, file: !35, line: 5793, baseType: !1031, size: 64, align: 32, offset: 448)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1334, file: !1083, line: 126, baseType: !952, size: 32, align: 32, offset: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1301, file: !1083, line: 172, baseType: !1150, size: 64, align: 64, offset: 576)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1301, file: !1083, line: 177, baseType: !1098, size: 64, align: 64, offset: 640)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1301, file: !1083, line: 178, baseType: !1108, size: 32, align: 32, offset: 704)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1301, file: !1083, line: 180, baseType: !954, size: 64, align: 64, offset: 768)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1301, file: !1083, line: 185, baseType: !952, size: 32, align: 32, offset: 832)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1301, file: !1083, line: 190, baseType: !954, size: 64, align: 64, offset: 896)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1301, file: !1083, line: 195, baseType: !952, size: 32, align: 32, offset: 960)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1301, file: !1083, line: 200, baseType: !1150, size: 64, align: 64, offset: 1024)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1301, file: !1083, line: 201, baseType: !952, size: 32, align: 32, offset: 1088)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1301, file: !1083, line: 202, baseType: !1284, size: 64, align: 64, offset: 1152)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1301, file: !1083, line: 203, baseType: !952, size: 32, align: 32, offset: 1216)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1301, file: !1083, line: 205, baseType: !952, size: 32, align: 32, offset: 1248)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1301, file: !1083, line: 206, baseType: !952, size: 32, align: 32, offset: 1280)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1301, file: !1083, line: 209, baseType: !1260, size: 64, align: 64, offset: 1344)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1301, file: !1083, line: 212, baseType: !1260, size: 64, align: 64, offset: 1408)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1301, file: !1083, line: 213, baseType: !1284, size: 64, align: 64, offset: 1472)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1301, file: !1083, line: 215, baseType: !952, size: 32, align: 32, offset: 1536)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1301, file: !1083, line: 217, baseType: !952, size: 32, align: 32, offset: 1568)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1301, file: !1083, line: 220, baseType: !952, size: 32, align: 32, offset: 1600)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !970, file: !35, line: 1598, baseType: !954, size: 64, align: 64, offset: 384)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !970, file: !35, line: 1606, baseType: !1144, size: 64, align: 64, offset: 448)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !970, file: !35, line: 1614, baseType: !952, size: 32, align: 32, offset: 512)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !970, file: !35, line: 1622, baseType: !952, size: 32, align: 32, offset: 544)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !970, file: !35, line: 1628, baseType: !952, size: 32, align: 32, offset: 576)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !970, file: !35, line: 1636, baseType: !952, size: 32, align: 32, offset: 608)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !970, file: !35, line: 1643, baseType: !952, size: 32, align: 32, offset: 640)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !970, file: !35, line: 1657, baseType: !1098, size: 64, align: 64, offset: 704)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !970, file: !35, line: 1658, baseType: !952, size: 32, align: 32, offset: 768)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !970, file: !35, line: 1679, baseType: !1031, size: 64, align: 32, offset: 800)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !970, file: !35, line: 1688, baseType: !952, size: 32, align: 32, offset: 864)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !970, file: !35, line: 1712, baseType: !952, size: 32, align: 32, offset: 896)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !970, file: !35, line: 1729, baseType: !952, size: 32, align: 32, offset: 928)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !970, file: !35, line: 1729, baseType: !952, size: 32, align: 32, offset: 960)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !970, file: !35, line: 1744, baseType: !952, size: 32, align: 32, offset: 992)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !970, file: !35, line: 1744, baseType: !952, size: 32, align: 32, offset: 1024)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !970, file: !35, line: 1751, baseType: !952, size: 32, align: 32, offset: 1056)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !970, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !970, file: !35, line: 1791, baseType: !1448, size: 64, align: 64, offset: 1152)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{null, !1451, !1184, !1266, !952, !952, !952}
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !970, file: !35, line: 1808, baseType: !1453, size: 64, align: 64, offset: 1216)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{!494, !1451, !1038}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !970, file: !35, line: 1816, baseType: !952, size: 32, align: 32, offset: 1280)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !970, file: !35, line: 1825, baseType: !951, size: 32, align: 32, offset: 1312)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !970, file: !35, line: 1830, baseType: !952, size: 32, align: 32, offset: 1344)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !970, file: !35, line: 1838, baseType: !951, size: 32, align: 32, offset: 1376)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !970, file: !35, line: 1846, baseType: !952, size: 32, align: 32, offset: 1408)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !970, file: !35, line: 1851, baseType: !952, size: 32, align: 32, offset: 1440)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !970, file: !35, line: 1861, baseType: !951, size: 32, align: 32, offset: 1472)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !970, file: !35, line: 1868, baseType: !951, size: 32, align: 32, offset: 1504)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !970, file: !35, line: 1875, baseType: !951, size: 32, align: 32, offset: 1536)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !970, file: !35, line: 1882, baseType: !951, size: 32, align: 32, offset: 1568)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !970, file: !35, line: 1889, baseType: !951, size: 32, align: 32, offset: 1600)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !970, file: !35, line: 1896, baseType: !951, size: 32, align: 32, offset: 1632)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !970, file: !35, line: 1903, baseType: !951, size: 32, align: 32, offset: 1664)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !970, file: !35, line: 1910, baseType: !952, size: 32, align: 32, offset: 1696)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !970, file: !35, line: 1915, baseType: !952, size: 32, align: 32, offset: 1728)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !970, file: !35, line: 1926, baseType: !1266, size: 64, align: 64, offset: 1792)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !970, file: !35, line: 1935, baseType: !1031, size: 64, align: 32, offset: 1856)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !970, file: !35, line: 1942, baseType: !952, size: 32, align: 32, offset: 1920)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !970, file: !35, line: 1948, baseType: !952, size: 32, align: 32, offset: 1952)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !970, file: !35, line: 1954, baseType: !952, size: 32, align: 32, offset: 1984)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !970, file: !35, line: 1960, baseType: !952, size: 32, align: 32, offset: 2016)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !970, file: !35, line: 1984, baseType: !952, size: 32, align: 32, offset: 2048)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !970, file: !35, line: 1991, baseType: !952, size: 32, align: 32, offset: 2080)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !970, file: !35, line: 1996, baseType: !952, size: 32, align: 32, offset: 2112)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !970, file: !35, line: 2004, baseType: !952, size: 32, align: 32, offset: 2144)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !970, file: !35, line: 2011, baseType: !952, size: 32, align: 32, offset: 2176)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !970, file: !35, line: 2018, baseType: !952, size: 32, align: 32, offset: 2208)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !970, file: !35, line: 2027, baseType: !952, size: 32, align: 32, offset: 2240)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !970, file: !35, line: 2034, baseType: !952, size: 32, align: 32, offset: 2272)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !970, file: !35, line: 2044, baseType: !952, size: 32, align: 32, offset: 2304)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !970, file: !35, line: 2054, baseType: !1487, size: 64, align: 64, offset: 2368)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !970, file: !35, line: 2061, baseType: !1487, size: 64, align: 64, offset: 2432)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !970, file: !35, line: 2066, baseType: !952, size: 32, align: 32, offset: 2496)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !970, file: !35, line: 2070, baseType: !952, size: 32, align: 32, offset: 2528)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !970, file: !35, line: 2078, baseType: !952, size: 32, align: 32, offset: 2560)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !970, file: !35, line: 2085, baseType: !952, size: 32, align: 32, offset: 2592)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !970, file: !35, line: 2092, baseType: !952, size: 32, align: 32, offset: 2624)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !970, file: !35, line: 2099, baseType: !952, size: 32, align: 32, offset: 2656)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !970, file: !35, line: 2106, baseType: !952, size: 32, align: 32, offset: 2688)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !970, file: !35, line: 2113, baseType: !952, size: 32, align: 32, offset: 2720)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !970, file: !35, line: 2120, baseType: !952, size: 32, align: 32, offset: 2752)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !970, file: !35, line: 2125, baseType: !952, size: 32, align: 32, offset: 2784)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !970, file: !35, line: 2133, baseType: !952, size: 32, align: 32, offset: 2816)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !970, file: !35, line: 2140, baseType: !952, size: 32, align: 32, offset: 2848)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !970, file: !35, line: 2145, baseType: !952, size: 32, align: 32, offset: 2880)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !970, file: !35, line: 2153, baseType: !952, size: 32, align: 32, offset: 2912)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !970, file: !35, line: 2158, baseType: !952, size: 32, align: 32, offset: 2944)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !970, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !970, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !970, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !970, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !970, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !970, file: !35, line: 2203, baseType: !952, size: 32, align: 32, offset: 3136)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !970, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !970, file: !35, line: 2212, baseType: !952, size: 32, align: 32, offset: 3200)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !970, file: !35, line: 2213, baseType: !952, size: 32, align: 32, offset: 3232)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !970, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !970, file: !35, line: 2232, baseType: !952, size: 32, align: 32, offset: 3296)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !970, file: !35, line: 2243, baseType: !952, size: 32, align: 32, offset: 3328)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !970, file: !35, line: 2249, baseType: !952, size: 32, align: 32, offset: 3360)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !970, file: !35, line: 2256, baseType: !952, size: 32, align: 32, offset: 3392)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !970, file: !35, line: 2263, baseType: !1049, size: 64, align: 64, offset: 3456)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !970, file: !35, line: 2270, baseType: !1049, size: 64, align: 64, offset: 3520)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !970, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !970, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !970, file: !35, line: 2367, baseType: !1523, size: 64, align: 64, offset: 3648)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DISubroutineType(types: !1525)
!1525 = !{!952, !1451, !1284, !952}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !970, file: !35, line: 2383, baseType: !952, size: 32, align: 32, offset: 3712)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !970, file: !35, line: 2386, baseType: !951, size: 32, align: 32, offset: 3744)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !970, file: !35, line: 2387, baseType: !951, size: 32, align: 32, offset: 3776)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !970, file: !35, line: 2394, baseType: !952, size: 32, align: 32, offset: 3808)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !970, file: !35, line: 2401, baseType: !952, size: 32, align: 32, offset: 3840)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !970, file: !35, line: 2408, baseType: !952, size: 32, align: 32, offset: 3872)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !970, file: !35, line: 2415, baseType: !952, size: 32, align: 32, offset: 3904)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !970, file: !35, line: 2422, baseType: !952, size: 32, align: 32, offset: 3936)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !970, file: !35, line: 2423, baseType: !1535, size: 64, align: 64, offset: 3968)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1537)
!1537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1538)
!1538 = !{!1539, !1540, !1541, !1542}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1537, file: !35, line: 827, baseType: !952, size: 32, align: 32)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1537, file: !35, line: 828, baseType: !952, size: 32, align: 32, offset: 32)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1537, file: !35, line: 829, baseType: !952, size: 32, align: 32, offset: 64)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1537, file: !35, line: 830, baseType: !951, size: 32, align: 32, offset: 96)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !970, file: !35, line: 2430, baseType: !1144, size: 64, align: 64, offset: 4032)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !970, file: !35, line: 2437, baseType: !1144, size: 64, align: 64, offset: 4096)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !970, file: !35, line: 2444, baseType: !951, size: 32, align: 32, offset: 4160)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !970, file: !35, line: 2451, baseType: !951, size: 32, align: 32, offset: 4192)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !970, file: !35, line: 2458, baseType: !952, size: 32, align: 32, offset: 4224)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !970, file: !35, line: 2469, baseType: !952, size: 32, align: 32, offset: 4256)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !970, file: !35, line: 2475, baseType: !952, size: 32, align: 32, offset: 4288)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !970, file: !35, line: 2481, baseType: !952, size: 32, align: 32, offset: 4320)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !970, file: !35, line: 2485, baseType: !952, size: 32, align: 32, offset: 4352)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !970, file: !35, line: 2489, baseType: !952, size: 32, align: 32, offset: 4384)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !970, file: !35, line: 2493, baseType: !952, size: 32, align: 32, offset: 4416)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !970, file: !35, line: 2501, baseType: !952, size: 32, align: 32, offset: 4448)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !970, file: !35, line: 2506, baseType: !952, size: 32, align: 32, offset: 4480)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !970, file: !35, line: 2510, baseType: !952, size: 32, align: 32, offset: 4512)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !970, file: !35, line: 2514, baseType: !1144, size: 64, align: 64, offset: 4544)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !970, file: !35, line: 2528, baseType: !1559, size: 64, align: 64, offset: 4608)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64, align: 64)
!1560 = !DISubroutineType(types: !1561)
!1561 = !{null, !1451, !954, !952, !952}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !970, file: !35, line: 2534, baseType: !952, size: 32, align: 32, offset: 4672)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !970, file: !35, line: 2545, baseType: !952, size: 32, align: 32, offset: 4704)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !970, file: !35, line: 2547, baseType: !952, size: 32, align: 32, offset: 4736)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !970, file: !35, line: 2549, baseType: !952, size: 32, align: 32, offset: 4768)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !970, file: !35, line: 2551, baseType: !952, size: 32, align: 32, offset: 4800)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !970, file: !35, line: 2553, baseType: !952, size: 32, align: 32, offset: 4832)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !970, file: !35, line: 2555, baseType: !952, size: 32, align: 32, offset: 4864)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !970, file: !35, line: 2557, baseType: !952, size: 32, align: 32, offset: 4896)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !970, file: !35, line: 2559, baseType: !952, size: 32, align: 32, offset: 4928)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !970, file: !35, line: 2563, baseType: !952, size: 32, align: 32, offset: 4960)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !970, file: !35, line: 2571, baseType: !1140, size: 64, align: 64, offset: 4992)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !970, file: !35, line: 2579, baseType: !1140, size: 64, align: 64, offset: 5056)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !970, file: !35, line: 2586, baseType: !952, size: 32, align: 32, offset: 5120)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !970, file: !35, line: 2615, baseType: !952, size: 32, align: 32, offset: 5152)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !970, file: !35, line: 2627, baseType: !952, size: 32, align: 32, offset: 5184)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !970, file: !35, line: 2637, baseType: !952, size: 32, align: 32, offset: 5216)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !970, file: !35, line: 2681, baseType: !952, size: 32, align: 32, offset: 5248)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !970, file: !35, line: 2709, baseType: !1144, size: 64, align: 64, offset: 5312)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !970, file: !35, line: 2716, baseType: !1581, size: 64, align: 64, offset: 5376)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1583)
!1583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1584)
!1584 = !{!1585, !1586, !1587, !1588, !1589, !1590, !1591, !1595, !1599, !1600, !1601, !1602, !1608, !1609, !1610, !1611, !1612}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1583, file: !35, line: 3642, baseType: !979, size: 64, align: 64)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1583, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1583, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1583, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1583, file: !35, line: 3669, baseType: !952, size: 32, align: 32, offset: 160)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1583, file: !35, line: 3682, baseType: !1281, size: 64, align: 64, offset: 192)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1583, file: !35, line: 3698, baseType: !1592, size: 64, align: 64, offset: 256)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DISubroutineType(types: !1594)
!1594 = !{!952, !968, !1086, !1107}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1583, file: !35, line: 3712, baseType: !1596, size: 64, align: 64, offset: 320)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{!952, !968, !952, !1086, !1107}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1583, file: !35, line: 3726, baseType: !1592, size: 64, align: 64, offset: 384)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1583, file: !35, line: 3737, baseType: !1069, size: 64, align: 64, offset: 448)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1583, file: !35, line: 3746, baseType: !952, size: 32, align: 32, offset: 512)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1583, file: !35, line: 3757, baseType: !1603, size: 64, align: 64, offset: 576)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DISubroutineType(types: !1605)
!1605 = !{null, !1606}
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1583, file: !35, line: 3766, baseType: !1069, size: 64, align: 64, offset: 640)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1583, file: !35, line: 3774, baseType: !1069, size: 64, align: 64, offset: 704)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1583, file: !35, line: 3780, baseType: !952, size: 32, align: 32, offset: 768)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1583, file: !35, line: 3785, baseType: !952, size: 32, align: 32, offset: 800)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1583, file: !35, line: 3795, baseType: !1613, size: 64, align: 64, offset: 832)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{!952, !968, !1155}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !970, file: !35, line: 2728, baseType: !954, size: 64, align: 64, offset: 5440)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !970, file: !35, line: 2735, baseType: !1208, size: 512, align: 64, offset: 5504)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !970, file: !35, line: 2742, baseType: !952, size: 32, align: 32, offset: 6016)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !970, file: !35, line: 2755, baseType: !952, size: 32, align: 32, offset: 6048)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !970, file: !35, line: 2776, baseType: !952, size: 32, align: 32, offset: 6080)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !970, file: !35, line: 2783, baseType: !952, size: 32, align: 32, offset: 6112)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !970, file: !35, line: 2791, baseType: !952, size: 32, align: 32, offset: 6144)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !970, file: !35, line: 2802, baseType: !1284, size: 64, align: 64, offset: 6208)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !970, file: !35, line: 2811, baseType: !952, size: 32, align: 32, offset: 6272)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !970, file: !35, line: 2821, baseType: !952, size: 32, align: 32, offset: 6304)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !970, file: !35, line: 2830, baseType: !952, size: 32, align: 32, offset: 6336)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !970, file: !35, line: 2840, baseType: !952, size: 32, align: 32, offset: 6368)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !970, file: !35, line: 2851, baseType: !1629, size: 64, align: 64, offset: 6400)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DISubroutineType(types: !1631)
!1631 = !{!952, !1451, !1632, !954, !1266, !952, !952}
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{!952, !1451, !954}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !970, file: !35, line: 2871, baseType: !1636, size: 64, align: 64, offset: 6464)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DISubroutineType(types: !1638)
!1638 = !{!952, !1451, !1639, !954, !1266, !952}
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{!952, !1451, !954, !952, !952}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !970, file: !35, line: 2878, baseType: !952, size: 32, align: 32, offset: 6528)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !970, file: !35, line: 2885, baseType: !952, size: 32, align: 32, offset: 6560)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !970, file: !35, line: 3005, baseType: !952, size: 32, align: 32, offset: 6592)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !970, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !970, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !970, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !970, file: !35, line: 3037, baseType: !1098, size: 64, align: 64, offset: 6720)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !970, file: !35, line: 3038, baseType: !952, size: 32, align: 32, offset: 6784)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !970, file: !35, line: 3050, baseType: !1049, size: 64, align: 64, offset: 6848)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !970, file: !35, line: 3065, baseType: !952, size: 32, align: 32, offset: 6912)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !970, file: !35, line: 3083, baseType: !952, size: 32, align: 32, offset: 6944)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !970, file: !35, line: 3092, baseType: !1031, size: 64, align: 32, offset: 6976)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !970, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !970, file: !35, line: 3106, baseType: !1031, size: 64, align: 32, offset: 7072)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !970, file: !35, line: 3113, baseType: !1657, size: 64, align: 64, offset: 7168)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1659)
!1659 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1660)
!1660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1661)
!1661 = !{!1662, !1663, !1664, !1665, !1666, !1667, !1670}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1660, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1660, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1660, file: !35, line: 720, baseType: !979, size: 64, align: 64, offset: 64)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1660, file: !35, line: 724, baseType: !979, size: 64, align: 64, offset: 128)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1660, file: !35, line: 728, baseType: !952, size: 32, align: 32, offset: 192)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1660, file: !35, line: 734, baseType: !1668, size: 64, align: 64, offset: 256)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1660, file: !35, line: 739, baseType: !1671, size: 64, align: 64, offset: 320)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !970, file: !35, line: 3129, baseType: !1144, size: 64, align: 64, offset: 7232)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !970, file: !35, line: 3130, baseType: !1144, size: 64, align: 64, offset: 7296)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !970, file: !35, line: 3131, baseType: !1144, size: 64, align: 64, offset: 7360)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !970, file: !35, line: 3132, baseType: !1144, size: 64, align: 64, offset: 7424)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !970, file: !35, line: 3139, baseType: !1140, size: 64, align: 64, offset: 7488)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !970, file: !35, line: 3147, baseType: !952, size: 32, align: 32, offset: 7552)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !970, file: !35, line: 3165, baseType: !952, size: 32, align: 32, offset: 7584)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !970, file: !35, line: 3172, baseType: !952, size: 32, align: 32, offset: 7616)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !970, file: !35, line: 3180, baseType: !952, size: 32, align: 32, offset: 7648)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !970, file: !35, line: 3191, baseType: !1487, size: 64, align: 64, offset: 7680)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !970, file: !35, line: 3199, baseType: !1098, size: 64, align: 64, offset: 7744)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !970, file: !35, line: 3207, baseType: !1140, size: 64, align: 64, offset: 7808)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !970, file: !35, line: 3214, baseType: !1108, size: 32, align: 32, offset: 7872)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !970, file: !35, line: 3224, baseType: !1173, size: 64, align: 64, offset: 7936)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !970, file: !35, line: 3225, baseType: !952, size: 32, align: 32, offset: 8000)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !970, file: !35, line: 3249, baseType: !1155, size: 64, align: 64, offset: 8064)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !970, file: !35, line: 3256, baseType: !952, size: 32, align: 32, offset: 8128)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !970, file: !35, line: 3271, baseType: !952, size: 32, align: 32, offset: 8160)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !970, file: !35, line: 3279, baseType: !1144, size: 64, align: 64, offset: 8192)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !970, file: !35, line: 3301, baseType: !1155, size: 64, align: 64, offset: 8256)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !970, file: !35, line: 3310, baseType: !952, size: 32, align: 32, offset: 8320)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !970, file: !35, line: 3337, baseType: !952, size: 32, align: 32, offset: 8352)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !970, file: !35, line: 3351, baseType: !952, size: 32, align: 32, offset: 8384)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !970, file: !35, line: 3359, baseType: !952, size: 32, align: 32, offset: 8416)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "dsp", scope: !965, file: !964, line: 56, baseType: !1698, size: 64, align: 64, offset: 64)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFloatDSPContext", file: !1700, line: 192, baseType: !1701)
!1700 = !DIFile(filename: "./libavutil/float_dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFloatDSPContext", file: !1700, line: 24, size: 704, align: 64, elements: !1702)
!1702 = !{!1703, !1710, !1714, !1721, !1722, !1723, !1727, !1728, !1729, !1734, !1738}
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul", scope: !1701, file: !1700, line: 38, baseType: !1704, size: 64, align: 64)
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1705, size: 64, align: 64)
!1705 = !DISubroutineType(types: !1706)
!1706 = !{null, !1707, !1708, !1708, !952}
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!1708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1709, size: 64, align: 64)
!1709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmac_scalar", scope: !1701, file: !1700, line: 54, baseType: !1711, size: 64, align: 64, offset: 64)
!1711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1712, size: 64, align: 64)
!1712 = !DISubroutineType(types: !1713)
!1713 = !{null, !1707, !1708, !951, !952}
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmac_scalar", scope: !1701, file: !1700, line: 70, baseType: !1715, size: 64, align: 64, offset: 128)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1716 = !DISubroutineType(types: !1717)
!1717 = !{null, !1718, !1719, !953, !952}
!1718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64, align: 64)
!1720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_scalar", scope: !1701, file: !1700, line: 85, baseType: !1711, size: 64, align: 64, offset: 192)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmul_scalar", scope: !1701, file: !1700, line: 100, baseType: !1715, size: 64, align: 64, offset: 256)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_window", scope: !1701, file: !1700, line: 119, baseType: !1724, size: 64, align: 64, offset: 320)
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1725, size: 64, align: 64)
!1725 = !DISubroutineType(types: !1726)
!1726 = !{null, !1707, !1708, !1708, !1708, !952}
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_add", scope: !1701, file: !1700, line: 137, baseType: !1724, size: 64, align: 64, offset: 384)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_reverse", scope: !1701, file: !1700, line: 154, baseType: !1704, size: 64, align: 64, offset: 448)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "butterflies_float", scope: !1701, file: !1700, line: 164, baseType: !1730, size: 64, align: 64, offset: 512)
!1730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1731, size: 64, align: 64)
!1731 = !DISubroutineType(types: !1732)
!1732 = !{null, !1733, !1733, !952}
!1733 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1707)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "scalarproduct_float", scope: !1701, file: !1700, line: 175, baseType: !1735, size: 64, align: 64, offset: 576)
!1735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64, align: 64)
