; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--hlsproto.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--hlsproto.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }
%struct.URLProtocol = type { i8*, {}*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }
%struct.AVIOInterruptCB = type { i32 (i8*)*, i8* }
%struct.AVDictionary = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !33, globals: !48)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--hlsproto.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3, !24}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 29, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!6 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!7 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!8 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!9 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!10 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!11 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!12 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!13 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!14 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!15 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!16 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!17 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!18 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!19 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!20 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!21 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!22 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!23 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVIODataMarkerType", file: !25, line: 111, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!26 = !{!27, !28, !29, !30, !31, !32}
!27 = !DIEnumerator(name: "AVIO_DATA_MARKER_HEADER", value: 0)
!28 = !DIEnumerator(name: "AVIO_DATA_MARKER_SYNC_POINT", value: 1)
!29 = !DIEnumerator(name: "AVIO_DATA_MARKER_BOUNDARY_POINT", value: 2)
!30 = !DIEnumerator(name: "AVIO_DATA_MARKER_UNKNOWN", value: 3)
!31 = !DIEnumerator(name: "AVIO_DATA_MARKER_TRAILER", value: 4)
!32 = !DIEnumerator(name: "AVIO_DATA_MARKER_FLUSH_POINT", value: 5)
!33 = !{!34, !35, !36}
!34 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!35 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ff_parse_key_val_cb", file: !37, line: 366, baseType: !38)
!37 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !41, !42, !34, !45, !47}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!44 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!48 = !{!49}
!49 = distinct !DIGlobalVariable(name: "ff_hls_protocol", scope: !0, file: !50, line: 313, type: !51, isLocal: false, isDefinition: true, variable: { i8*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }* @ff_hls_protocol)
!50 = !DIFile(filename: "libavformat/hlsproto.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !53, line: 100, baseType: !54)
!53 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !53, line: 54, size: 1600, align: 64, elements: !55)
!55 = !{!56, !57, !131, !140, !145, !149, !155, !161, !165, !166, !170, !174, !175, !180, !181, !182, !183, !184, !185, !186, !187, !206, !207, !208, !212}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !54, file: !53, line: 55, baseType: !42, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !54, file: !53, line: 56, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!34, !61, !42, !34}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !53, line: 52, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !53, line: 38, size: 768, align: 64, elements: !64)
!64 = !{!65, !106, !109, !110, !111, !112, !113, !114, !115, !124, !128, !129, !130}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !63, file: !53, line: 39, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !70)
!70 = !{!71, !72, !76, !80, !81, !82, !83, !87, !93, !95, !99}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !69, file: !4, line: 72, baseType: !42, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !69, file: !4, line: 78, baseType: !73, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!42, !41}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !69, file: !4, line: 85, baseType: !77, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !69, file: !4, line: 93, baseType: !34, size: 32, align: 32, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !69, file: !4, line: 99, baseType: !34, size: 32, align: 32, offset: 224)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !69, file: !4, line: 108, baseType: !34, size: 32, align: 32, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !69, file: !4, line: 113, baseType: !84, size: 64, align: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!41, !41, !41}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !69, file: !4, line: 123, baseType: !88, size: 64, align: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!91, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !69, file: !4, line: 130, baseType: !94, size: 32, align: 32, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !69, file: !4, line: 136, baseType: !96, size: 64, align: 64, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!94, !41}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !69, file: !4, line: 142, baseType: !100, size: 64, align: 64, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!34, !103, !41, !42, !34}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !63, file: !53, line: 40, baseType: !107, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !63, file: !53, line: 41, baseType: !41, size: 64, align: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !63, file: !53, line: 42, baseType: !46, size: 64, align: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !63, file: !53, line: 43, baseType: !34, size: 32, align: 32, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !63, file: !53, line: 44, baseType: !34, size: 32, align: 32, offset: 288)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !63, file: !53, line: 45, baseType: !34, size: 32, align: 32, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !63, file: !53, line: 46, baseType: !34, size: 32, align: 32, offset: 352)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !63, file: !53, line: 47, baseType: !116, size: 128, align: 64, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !25, line: 61, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !25, line: 58, size: 128, align: 64, elements: !118)
!118 = !{!119, !123}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !117, file: !25, line: 59, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!34, !41}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !117, file: !25, line: 60, baseType: !41, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !63, file: !53, line: 48, baseType: !125, size: 64, align: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !126, line: 40, baseType: !127)
!126 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!127 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !63, file: !53, line: 49, baseType: !42, size: 64, align: 64, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !63, file: !53, line: 50, baseType: !42, size: 64, align: 64, offset: 640)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !63, file: !53, line: 51, baseType: !34, size: 32, align: 32, offset: 704)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !54, file: !53, line: 62, baseType: !132, size: 64, align: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!34, !61, !42, !34, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !138, line: 86, baseType: !139)
!138 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !138, line: 86, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !54, file: !53, line: 63, baseType: !141, size: 64, align: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!34, !61, !144}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !54, file: !53, line: 64, baseType: !146, size: 64, align: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!34, !61}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !54, file: !53, line: 78, baseType: !150, size: 64, align: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!34, !61, !153, !34}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !54, file: !53, line: 79, baseType: !156, size: 64, align: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!34, !61, !159, !34}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !54, file: !53, line: 80, baseType: !162, size: 64, align: 64, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!125, !61, !125, !34}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !54, file: !53, line: 81, baseType: !146, size: 64, align: 64, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !54, file: !53, line: 82, baseType: !167, size: 64, align: 64, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!34, !61, !34}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !54, file: !53, line: 83, baseType: !171, size: 64, align: 64, offset: 640)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!125, !61, !34, !125, !34}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !54, file: !53, line: 85, baseType: !146, size: 64, align: 64, offset: 704)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !54, file: !53, line: 86, baseType: !176, size: 64, align: 64, offset: 768)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!34, !61, !179, !47}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !54, file: !53, line: 88, baseType: !146, size: 64, align: 64, offset: 832)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !54, file: !53, line: 89, baseType: !167, size: 64, align: 64, offset: 896)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !54, file: !53, line: 90, baseType: !34, size: 32, align: 32, offset: 960)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !54, file: !53, line: 91, baseType: !66, size: 64, align: 64, offset: 1024)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !54, file: !53, line: 92, baseType: !34, size: 32, align: 32, offset: 1088)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !54, file: !53, line: 93, baseType: !167, size: 64, align: 64, offset: 1152)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !54, file: !53, line: 94, baseType: !146, size: 64, align: 64, offset: 1216)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !54, file: !53, line: 95, baseType: !188, size: 64, align: 64, offset: 1280)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!34, !61, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !25, line: 101, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !25, line: 86, size: 576, align: 64, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204, !205}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !25, line: 87, baseType: !46, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !194, file: !25, line: 88, baseType: !34, size: 32, align: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !194, file: !25, line: 89, baseType: !34, size: 32, align: 32, offset: 96)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !194, file: !25, line: 91, baseType: !125, size: 64, align: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !194, file: !25, line: 92, baseType: !125, size: 64, align: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !194, file: !25, line: 94, baseType: !125, size: 64, align: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !194, file: !25, line: 96, baseType: !125, size: 64, align: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !194, file: !25, line: 98, baseType: !125, size: 64, align: 64, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !194, file: !25, line: 99, baseType: !125, size: 64, align: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !194, file: !25, line: 100, baseType: !125, size: 64, align: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !54, file: !53, line: 96, baseType: !146, size: 64, align: 64, offset: 1344)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !54, file: !53, line: 97, baseType: !146, size: 64, align: 64, offset: 1408)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !54, file: !53, line: 98, baseType: !209, size: 64, align: 64, offset: 1472)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!34, !61, !61}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !54, file: !53, line: 99, baseType: !42, size: 64, align: 64, offset: 1536)
!213 = !{i32 2, !"Dwarf Version", i32 4}
!214 = !{i32 2, !"Debug Info Version", i32 3}
!215 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!216 = distinct !DISubprogram(name: "hls_open", scope: !50, file: !50, line: 185, type: !59, isLocal: true, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !217)
!217 = !{}
!218 = !DILocalVariable(name: "h", arg: 1, scope: !216, file: !50, line: 185, type: !61)
!219 = !DIExpression()
!220 = !DILocation(line: 185, column: 33, scope: !216)
!221 = !DILocalVariable(name: "uri", arg: 2, scope: !216, file: !50, line: 185, type: !42)
!222 = !DILocation(line: 185, column: 48, scope: !216)
!223 = !DILocalVariable(name: "flags", arg: 3, scope: !216, file: !50, line: 185, type: !34)
!224 = !DILocation(line: 185, column: 57, scope: !216)
!225 = !DILocalVariable(name: "s", scope: !216, file: !50, line: 187, type: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "HLSContext", file: !50, line: 70, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HLSContext", file: !50, line: 58, size: 33344, align: 64, elements: !229)
!229 = !{!230, !234, !235, !236, !237, !238, !245, !246, !253, !254, !255}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "playlisturl", scope: !228, file: !50, line: 59, baseType: !231, size: 32768, align: 8)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 32768, align: 8, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 4096)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "target_duration", scope: !228, file: !50, line: 60, baseType: !125, size: 64, align: 64, offset: 32768)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "start_seq_no", scope: !228, file: !50, line: 61, baseType: !34, size: 32, align: 32, offset: 32832)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "finished", scope: !228, file: !50, line: 62, baseType: !34, size: 32, align: 32, offset: 32864)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "n_segments", scope: !228, file: !50, line: 63, baseType: !34, size: 32, align: 32, offset: 32896)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !228, file: !50, line: 64, baseType: !239, size: 64, align: 64, offset: 32960)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "segment", file: !50, line: 48, size: 32832, align: 64, elements: !242)
!242 = !{!243, !244}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !241, file: !50, line: 49, baseType: !125, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !241, file: !50, line: 50, baseType: !231, size: 32768, align: 8, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "n_variants", scope: !228, file: !50, line: 65, baseType: !34, size: 32, align: 32, offset: 33024)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "variants", scope: !228, file: !50, line: 66, baseType: !247, size: 64, align: 64, offset: 33088)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "variant", file: !50, line: 53, size: 32800, align: 32, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth", scope: !249, file: !50, line: 54, baseType: !34, size: 32, align: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !249, file: !50, line: 55, baseType: !231, size: 32768, align: 8, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "cur_seq_no", scope: !228, file: !50, line: 67, baseType: !34, size: 32, align: 32, offset: 33152)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "seg_hd", scope: !228, file: !50, line: 68, baseType: !61, size: 64, align: 64, offset: 33216)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "last_load_time", scope: !228, file: !50, line: 69, baseType: !125, size: 64, align: 64, offset: 33280)
!256 = !DILocation(line: 187, column: 17, scope: !216)
!257 = !DILocation(line: 187, column: 21, scope: !216)
!258 = !DILocation(line: 187, column: 24, scope: !216)
!259 = !DILocalVariable(name: "ret", scope: !216, file: !50, line: 188, type: !34)
!260 = !DILocation(line: 188, column: 9, scope: !216)
!261 = !DILocalVariable(name: "i", scope: !216, file: !50, line: 188, type: !34)
!262 = !DILocation(line: 188, column: 14, scope: !216)
!263 = !DILocalVariable(name: "nested_url", scope: !216, file: !50, line: 189, type: !42)
!264 = !DILocation(line: 189, column: 17, scope: !216)
!265 = !DILocation(line: 191, column: 9, scope: !266)
!266 = distinct !DILexicalBlock(scope: !216, file: !50, line: 191, column: 9)
!267 = !DILocation(line: 191, column: 15, scope: !266)
!268 = !DILocation(line: 191, column: 9, scope: !216)
!269 = !DILocation(line: 192, column: 9, scope: !266)
!270 = !DILocation(line: 194, column: 5, scope: !216)
!271 = !DILocation(line: 194, column: 8, scope: !216)
!272 = !DILocation(line: 194, column: 20, scope: !216)
!273 = !DILocation(line: 196, column: 21, scope: !274)
!274 = distinct !DILexicalBlock(scope: !216, file: !50, line: 196, column: 9)
!275 = !DILocation(line: 196, column: 9, scope: !274)
!276 = !DILocation(line: 196, column: 9, scope: !216)
!277 = !DILocation(line: 197, column: 20, scope: !278)
!278 = distinct !DILexicalBlock(scope: !274, file: !50, line: 196, column: 48)
!279 = !DILocation(line: 197, column: 23, scope: !278)
!280 = !DILocation(line: 197, column: 36, scope: !278)
!281 = !DILocation(line: 197, column: 9, scope: !278)
!282 = !DILocation(line: 198, column: 5, scope: !278)
!283 = !DILocation(line: 198, column: 28, scope: !284)
!284 = !DILexicalBlockFile(scope: !285, file: !50, discriminator: 1)
!285 = distinct !DILexicalBlock(scope: !274, file: !50, line: 198, column: 16)
!286 = !DILocation(line: 198, column: 16, scope: !284)
!287 = !DILocation(line: 199, column: 16, scope: !288)
!288 = distinct !DILexicalBlock(scope: !285, file: !50, line: 198, column: 57)
!289 = !DILocation(line: 201, column: 16, scope: !288)
!290 = !DILocation(line: 199, column: 9, scope: !288)
!291 = !DILocation(line: 202, column: 13, scope: !288)
!292 = !DILocation(line: 203, column: 9, scope: !288)
!293 = !DILocation(line: 205, column: 16, scope: !294)
!294 = distinct !DILexicalBlock(scope: !285, file: !50, line: 204, column: 12)
!295 = !DILocation(line: 205, column: 47, scope: !294)
!296 = !DILocation(line: 205, column: 9, scope: !294)
!297 = !DILocation(line: 206, column: 13, scope: !294)
!298 = !DILocation(line: 207, column: 9, scope: !294)
!299 = !DILocation(line: 209, column: 12, scope: !216)
!300 = !DILocation(line: 214, column: 12, scope: !216)
!301 = !DILocation(line: 214, column: 15, scope: !216)
!302 = !DILocation(line: 209, column: 5, scope: !216)
!303 = !DILocation(line: 216, column: 31, scope: !304)
!304 = distinct !DILexicalBlock(scope: !216, file: !50, line: 216, column: 9)
!305 = !DILocation(line: 216, column: 34, scope: !304)
!306 = !DILocation(line: 216, column: 37, scope: !304)
!307 = !DILocation(line: 216, column: 16, scope: !304)
!308 = !DILocation(line: 216, column: 14, scope: !304)
!309 = !DILocation(line: 216, column: 51, scope: !304)
!310 = !DILocation(line: 216, column: 9, scope: !216)
!311 = !DILocation(line: 217, column: 9, scope: !304)
!312 = !DILocation(line: 219, column: 9, scope: !313)
!313 = distinct !DILexicalBlock(scope: !216, file: !50, line: 219, column: 9)
!314 = !DILocation(line: 219, column: 12, scope: !313)
!315 = !DILocation(line: 219, column: 23, scope: !313)
!316 = !DILocation(line: 219, column: 28, scope: !313)
!317 = !DILocation(line: 219, column: 31, scope: !318)
!318 = !DILexicalBlockFile(scope: !313, file: !50, discriminator: 1)
!319 = !DILocation(line: 219, column: 34, scope: !318)
!320 = !DILocation(line: 219, column: 45, scope: !318)
!321 = !DILocation(line: 219, column: 9, scope: !318)
!322 = !DILocalVariable(name: "max_bandwidth", scope: !323, file: !50, line: 220, type: !34)
!323 = distinct !DILexicalBlock(scope: !313, file: !50, line: 219, column: 50)
!324 = !DILocation(line: 220, column: 13, scope: !323)
!325 = !DILocalVariable(name: "maxvar", scope: !323, file: !50, line: 220, type: !34)
!326 = !DILocation(line: 220, column: 32, scope: !323)
!327 = !DILocation(line: 221, column: 16, scope: !328)
!328 = distinct !DILexicalBlock(scope: !323, file: !50, line: 221, column: 9)
!329 = !DILocation(line: 221, column: 14, scope: !328)
!330 = !DILocation(line: 221, column: 21, scope: !331)
!331 = !DILexicalBlockFile(scope: !332, file: !50, discriminator: 1)
!332 = distinct !DILexicalBlock(scope: !328, file: !50, line: 221, column: 9)
!333 = !DILocation(line: 221, column: 25, scope: !331)
!334 = !DILocation(line: 221, column: 28, scope: !331)
!335 = !DILocation(line: 221, column: 23, scope: !331)
!336 = !DILocation(line: 221, column: 9, scope: !331)
!337 = !DILocation(line: 222, column: 29, scope: !338)
!338 = distinct !DILexicalBlock(scope: !339, file: !50, line: 222, column: 17)
!339 = distinct !DILexicalBlock(scope: !332, file: !50, line: 221, column: 45)
!340 = !DILocation(line: 222, column: 17, scope: !338)
!341 = !DILocation(line: 222, column: 20, scope: !338)
!342 = !DILocation(line: 222, column: 33, scope: !338)
!343 = !DILocation(line: 222, column: 45, scope: !338)
!344 = !DILocation(line: 222, column: 43, scope: !338)
!345 = !DILocation(line: 222, column: 59, scope: !338)
!346 = !DILocation(line: 222, column: 62, scope: !347)
!347 = !DILexicalBlockFile(scope: !338, file: !50, discriminator: 1)
!348 = !DILocation(line: 222, column: 64, scope: !347)
!349 = !DILocation(line: 222, column: 17, scope: !347)
!350 = !DILocation(line: 223, column: 45, scope: !351)
!351 = distinct !DILexicalBlock(scope: !338, file: !50, line: 222, column: 70)
!352 = !DILocation(line: 223, column: 33, scope: !351)
!353 = !DILocation(line: 223, column: 36, scope: !351)
!354 = !DILocation(line: 223, column: 49, scope: !351)
!355 = !DILocation(line: 223, column: 31, scope: !351)
!356 = !DILocation(line: 224, column: 26, scope: !351)
!357 = !DILocation(line: 224, column: 24, scope: !351)
!358 = !DILocation(line: 225, column: 13, scope: !351)
!359 = !DILocation(line: 226, column: 9, scope: !339)
!360 = !DILocation(line: 221, column: 41, scope: !361)
!361 = !DILexicalBlockFile(scope: !332, file: !50, discriminator: 2)
!362 = !DILocation(line: 221, column: 9, scope: !361)
!363 = distinct !{!363, !364}
!364 = !DILocation(line: 221, column: 9, scope: !323)
!365 = !DILocation(line: 227, column: 20, scope: !323)
!366 = !DILocation(line: 227, column: 23, scope: !323)
!367 = !DILocation(line: 227, column: 48, scope: !323)
!368 = !DILocation(line: 227, column: 36, scope: !323)
!369 = !DILocation(line: 227, column: 39, scope: !323)
!370 = !DILocation(line: 227, column: 57, scope: !323)
!371 = !DILocation(line: 227, column: 9, scope: !323)
!372 = !DILocation(line: 229, column: 35, scope: !373)
!373 = distinct !DILexicalBlock(scope: !323, file: !50, line: 229, column: 13)
!374 = !DILocation(line: 229, column: 38, scope: !373)
!375 = !DILocation(line: 229, column: 41, scope: !373)
!376 = !DILocation(line: 229, column: 20, scope: !373)
!377 = !DILocation(line: 229, column: 18, scope: !373)
!378 = !DILocation(line: 229, column: 55, scope: !373)
!379 = !DILocation(line: 229, column: 13, scope: !323)
!380 = !DILocation(line: 230, column: 13, scope: !373)
!381 = !DILocation(line: 231, column: 5, scope: !323)
!382 = !DILocation(line: 233, column: 9, scope: !383)
!383 = distinct !DILexicalBlock(scope: !216, file: !50, line: 233, column: 9)
!384 = !DILocation(line: 233, column: 12, scope: !383)
!385 = !DILocation(line: 233, column: 23, scope: !383)
!386 = !DILocation(line: 233, column: 9, scope: !216)
!387 = !DILocation(line: 234, column: 16, scope: !388)
!388 = distinct !DILexicalBlock(scope: !383, file: !50, line: 233, column: 29)
!389 = !DILocation(line: 234, column: 9, scope: !388)
!390 = !DILocation(line: 235, column: 13, scope: !388)
!391 = !DILocation(line: 236, column: 9, scope: !388)
!392 = !DILocation(line: 238, column: 21, scope: !216)
!393 = !DILocation(line: 238, column: 24, scope: !216)
!394 = !DILocation(line: 238, column: 5, scope: !216)
!395 = !DILocation(line: 238, column: 8, scope: !216)
!396 = !DILocation(line: 238, column: 19, scope: !216)
!397 = !DILocation(line: 239, column: 10, scope: !398)
!398 = distinct !DILexicalBlock(scope: !216, file: !50, line: 239, column: 9)
!399 = !DILocation(line: 239, column: 13, scope: !398)
!400 = !DILocation(line: 239, column: 22, scope: !398)
!401 = !DILocation(line: 239, column: 25, scope: !402)
!402 = !DILexicalBlockFile(scope: !398, file: !50, discriminator: 1)
!403 = !DILocation(line: 239, column: 28, scope: !402)
!404 = !DILocation(line: 239, column: 39, scope: !402)
!405 = !DILocation(line: 239, column: 9, scope: !402)
!406 = !DILocation(line: 240, column: 25, scope: !398)
!407 = !DILocation(line: 240, column: 28, scope: !398)
!408 = !DILocation(line: 240, column: 43, scope: !398)
!409 = !DILocation(line: 240, column: 46, scope: !398)
!410 = !DILocation(line: 240, column: 41, scope: !398)
!411 = !DILocation(line: 240, column: 57, scope: !398)
!412 = !DILocation(line: 240, column: 9, scope: !398)
!413 = !DILocation(line: 240, column: 12, scope: !398)
!414 = !DILocation(line: 240, column: 23, scope: !398)
!415 = !DILocation(line: 242, column: 5, scope: !216)
!416 = !DILocation(line: 245, column: 15, scope: !216)
!417 = !DILocation(line: 245, column: 5, scope: !216)
!418 = !DILocation(line: 246, column: 12, scope: !216)
!419 = !DILocation(line: 246, column: 5, scope: !216)
!420 = !DILocation(line: 247, column: 1, scope: !216)
!421 = distinct !DISubprogram(name: "hls_read", scope: !50, file: !50, line: 249, type: !422, isLocal: true, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !217)
!422 = !DISubroutineType(types: !423)
!423 = !{!34, !61, !424, !34}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !126, line: 48, baseType: !154)
!426 = !DILocalVariable(name: "h", arg: 1, scope: !421, file: !50, line: 249, type: !61)
!427 = !DILocation(line: 249, column: 33, scope: !421)
!428 = !DILocalVariable(name: "buf", arg: 2, scope: !421, file: !50, line: 249, type: !424)
!429 = !DILocation(line: 249, column: 45, scope: !421)
!430 = !DILocalVariable(name: "size", arg: 3, scope: !421, file: !50, line: 249, type: !34)
!431 = !DILocation(line: 249, column: 54, scope: !421)
!432 = !DILocalVariable(name: "s", scope: !421, file: !50, line: 251, type: !226)
!433 = !DILocation(line: 251, column: 17, scope: !421)
!434 = !DILocation(line: 251, column: 21, scope: !421)
!435 = !DILocation(line: 251, column: 24, scope: !421)
!436 = !DILocalVariable(name: "url", scope: !421, file: !50, line: 252, type: !42)
!437 = !DILocation(line: 252, column: 17, scope: !421)
!438 = !DILocalVariable(name: "ret", scope: !421, file: !50, line: 253, type: !34)
!439 = !DILocation(line: 253, column: 9, scope: !421)
!440 = !DILocalVariable(name: "reload_interval", scope: !421, file: !50, line: 254, type: !125)
!441 = !DILocation(line: 254, column: 13, scope: !421)
!442 = !DILocation(line: 254, column: 5, scope: !421)
!443 = !DILocation(line: 257, column: 9, scope: !444)
!444 = distinct !DILexicalBlock(scope: !421, file: !50, line: 257, column: 9)
!445 = !DILocation(line: 257, column: 12, scope: !444)
!446 = !DILocation(line: 257, column: 9, scope: !421)
!447 = !DILocation(line: 258, column: 26, scope: !448)
!448 = distinct !DILexicalBlock(scope: !444, file: !50, line: 257, column: 20)
!449 = !DILocation(line: 258, column: 29, scope: !448)
!450 = !DILocation(line: 258, column: 37, scope: !448)
!451 = !DILocation(line: 258, column: 42, scope: !448)
!452 = !DILocation(line: 258, column: 15, scope: !448)
!453 = !DILocation(line: 258, column: 13, scope: !448)
!454 = !DILocation(line: 259, column: 13, scope: !455)
!455 = distinct !DILexicalBlock(scope: !448, file: !50, line: 259, column: 13)
!456 = !DILocation(line: 259, column: 17, scope: !455)
!457 = !DILocation(line: 259, column: 13, scope: !448)
!458 = !DILocation(line: 260, column: 20, scope: !455)
!459 = !DILocation(line: 260, column: 13, scope: !455)
!460 = !DILocation(line: 261, column: 5, scope: !448)
!461 = !DILocation(line: 262, column: 9, scope: !462)
!462 = distinct !DILexicalBlock(scope: !421, file: !50, line: 262, column: 9)
!463 = !DILocation(line: 262, column: 12, scope: !462)
!464 = !DILocation(line: 262, column: 9, scope: !421)
!465 = !DILocation(line: 263, column: 21, scope: !466)
!466 = distinct !DILexicalBlock(scope: !462, file: !50, line: 262, column: 20)
!467 = !DILocation(line: 263, column: 24, scope: !466)
!468 = !DILocation(line: 263, column: 9, scope: !466)
!469 = !DILocation(line: 264, column: 9, scope: !466)
!470 = !DILocation(line: 264, column: 12, scope: !466)
!471 = !DILocation(line: 264, column: 19, scope: !466)
!472 = !DILocation(line: 265, column: 9, scope: !466)
!473 = !DILocation(line: 265, column: 12, scope: !466)
!474 = !DILocation(line: 265, column: 22, scope: !466)
!475 = !DILocation(line: 266, column: 5, scope: !466)
!476 = !DILocation(line: 267, column: 23, scope: !421)
!477 = !DILocation(line: 267, column: 26, scope: !421)
!478 = !DILocation(line: 267, column: 37, scope: !421)
!479 = !DILocation(line: 268, column: 35, scope: !421)
!480 = !DILocation(line: 268, column: 38, scope: !421)
!481 = !DILocation(line: 268, column: 49, scope: !421)
!482 = !DILocation(line: 268, column: 23, scope: !421)
!483 = !DILocation(line: 268, column: 26, scope: !421)
!484 = !DILocation(line: 268, column: 55, scope: !421)
!485 = !DILocation(line: 267, column: 23, scope: !486)
!486 = !DILexicalBlockFile(scope: !421, file: !50, discriminator: 1)
!487 = !DILocation(line: 269, column: 23, scope: !421)
!488 = !DILocation(line: 269, column: 26, scope: !421)
!489 = !DILocation(line: 267, column: 23, scope: !490)
!490 = !DILexicalBlockFile(scope: !421, file: !50, discriminator: 2)
!491 = !DILocation(line: 267, column: 23, scope: !492)
!492 = !DILexicalBlockFile(scope: !421, file: !50, discriminator: 3)
!493 = !DILocation(line: 267, column: 21, scope: !492)
!494 = !DILocation(line: 267, column: 5, scope: !492)
!495 = !DILocation(line: 271, column: 10, scope: !496)
!496 = distinct !DILexicalBlock(scope: !421, file: !50, line: 271, column: 9)
!497 = !DILocation(line: 271, column: 13, scope: !496)
!498 = !DILocation(line: 271, column: 9, scope: !421)
!499 = !DILocalVariable(name: "now", scope: !500, file: !50, line: 272, type: !125)
!500 = distinct !DILexicalBlock(scope: !496, file: !50, line: 271, column: 23)
!501 = !DILocation(line: 272, column: 17, scope: !500)
!502 = !DILocation(line: 272, column: 23, scope: !500)
!503 = !DILocation(line: 273, column: 13, scope: !504)
!504 = distinct !DILexicalBlock(scope: !500, file: !50, line: 273, column: 13)
!505 = !DILocation(line: 273, column: 19, scope: !504)
!506 = !DILocation(line: 273, column: 22, scope: !504)
!507 = !DILocation(line: 273, column: 17, scope: !504)
!508 = !DILocation(line: 273, column: 40, scope: !504)
!509 = !DILocation(line: 273, column: 37, scope: !504)
!510 = !DILocation(line: 273, column: 13, scope: !500)
!511 = !DILocation(line: 274, column: 39, scope: !512)
!512 = distinct !DILexicalBlock(scope: !513, file: !50, line: 274, column: 17)
!513 = distinct !DILexicalBlock(scope: !504, file: !50, line: 273, column: 57)
!514 = !DILocation(line: 274, column: 42, scope: !512)
!515 = !DILocation(line: 274, column: 45, scope: !512)
!516 = !DILocation(line: 274, column: 24, scope: !512)
!517 = !DILocation(line: 274, column: 22, scope: !512)
!518 = !DILocation(line: 274, column: 59, scope: !512)
!519 = !DILocation(line: 274, column: 17, scope: !513)
!520 = !DILocation(line: 275, column: 24, scope: !512)
!521 = !DILocation(line: 275, column: 17, scope: !512)
!522 = !DILocation(line: 279, column: 31, scope: !513)
!523 = !DILocation(line: 279, column: 34, scope: !513)
!524 = !DILocation(line: 279, column: 50, scope: !513)
!525 = !DILocation(line: 279, column: 29, scope: !513)
!526 = !DILocation(line: 280, column: 9, scope: !513)
!527 = !DILocation(line: 281, column: 5, scope: !500)
!528 = !DILocation(line: 282, column: 9, scope: !529)
!529 = distinct !DILexicalBlock(scope: !421, file: !50, line: 282, column: 9)
!530 = !DILocation(line: 282, column: 12, scope: !529)
!531 = !DILocation(line: 282, column: 25, scope: !529)
!532 = !DILocation(line: 282, column: 28, scope: !529)
!533 = !DILocation(line: 282, column: 23, scope: !529)
!534 = !DILocation(line: 282, column: 9, scope: !421)
!535 = !DILocation(line: 283, column: 16, scope: !536)
!536 = distinct !DILexicalBlock(scope: !529, file: !50, line: 282, column: 42)
!537 = !DILocation(line: 285, column: 16, scope: !536)
!538 = !DILocation(line: 285, column: 19, scope: !536)
!539 = !DILocation(line: 285, column: 34, scope: !536)
!540 = !DILocation(line: 285, column: 37, scope: !536)
!541 = !DILocation(line: 285, column: 32, scope: !536)
!542 = !DILocation(line: 283, column: 9, scope: !536)
!543 = !DILocation(line: 286, column: 25, scope: !536)
!544 = !DILocation(line: 286, column: 28, scope: !536)
!545 = !DILocation(line: 286, column: 9, scope: !536)
!546 = !DILocation(line: 286, column: 12, scope: !536)
!547 = !DILocation(line: 286, column: 23, scope: !536)
!548 = !DILocation(line: 287, column: 5, scope: !536)
!549 = !DILocation(line: 288, column: 9, scope: !550)
!550 = distinct !DILexicalBlock(scope: !421, file: !50, line: 288, column: 9)
!551 = !DILocation(line: 288, column: 12, scope: !550)
!552 = !DILocation(line: 288, column: 25, scope: !550)
!553 = !DILocation(line: 288, column: 28, scope: !550)
!554 = !DILocation(line: 288, column: 23, scope: !550)
!555 = !DILocation(line: 288, column: 44, scope: !550)
!556 = !DILocation(line: 288, column: 47, scope: !550)
!557 = !DILocation(line: 288, column: 41, scope: !550)
!558 = !DILocation(line: 288, column: 9, scope: !421)
!559 = !DILocation(line: 289, column: 13, scope: !560)
!560 = distinct !DILexicalBlock(scope: !561, file: !50, line: 289, column: 13)
!561 = distinct !DILexicalBlock(scope: !550, file: !50, line: 288, column: 59)
!562 = !DILocation(line: 289, column: 16, scope: !560)
!563 = !DILocation(line: 289, column: 13, scope: !561)
!564 = !DILocation(line: 290, column: 13, scope: !560)
!565 = !DILocation(line: 291, column: 9, scope: !561)
!566 = !DILocation(line: 291, column: 16, scope: !567)
!567 = !DILexicalBlockFile(scope: !561, file: !50, discriminator: 1)
!568 = !DILocation(line: 291, column: 40, scope: !567)
!569 = !DILocation(line: 291, column: 43, scope: !567)
!570 = !DILocation(line: 291, column: 38, scope: !567)
!571 = !DILocation(line: 291, column: 60, scope: !567)
!572 = !DILocation(line: 291, column: 58, scope: !567)
!573 = !DILocation(line: 291, column: 9, scope: !567)
!574 = !DILocation(line: 292, column: 37, scope: !575)
!575 = distinct !DILexicalBlock(scope: !576, file: !50, line: 292, column: 17)
!576 = distinct !DILexicalBlock(scope: !561, file: !50, line: 291, column: 77)
!577 = !DILocation(line: 292, column: 40, scope: !575)
!578 = !DILocation(line: 292, column: 17, scope: !575)
!579 = !DILocation(line: 292, column: 17, scope: !576)
!580 = !DILocation(line: 293, column: 17, scope: !575)
!581 = !DILocation(line: 294, column: 13, scope: !576)
!582 = !DILocation(line: 291, column: 9, scope: !583)
!583 = !DILexicalBlockFile(scope: !561, file: !50, discriminator: 2)
!584 = distinct !{!584, !565}
!585 = !DILocation(line: 296, column: 9, scope: !561)
!586 = !DILocation(line: 298, column: 23, scope: !421)
!587 = !DILocation(line: 298, column: 26, scope: !421)
!588 = !DILocation(line: 298, column: 39, scope: !421)
!589 = !DILocation(line: 298, column: 42, scope: !421)
!590 = !DILocation(line: 298, column: 37, scope: !421)
!591 = !DILocation(line: 298, column: 11, scope: !421)
!592 = !DILocation(line: 298, column: 14, scope: !421)
!593 = !DILocation(line: 298, column: 57, scope: !421)
!594 = !DILocation(line: 298, column: 9, scope: !421)
!595 = !DILocation(line: 299, column: 12, scope: !421)
!596 = !DILocation(line: 299, column: 35, scope: !421)
!597 = !DILocation(line: 299, column: 5, scope: !421)
!598 = !DILocation(line: 300, column: 33, scope: !421)
!599 = !DILocation(line: 300, column: 36, scope: !421)
!600 = !DILocation(line: 300, column: 44, scope: !421)
!601 = !DILocation(line: 301, column: 33, scope: !421)
!602 = !DILocation(line: 301, column: 36, scope: !421)
!603 = !DILocation(line: 302, column: 32, scope: !421)
!604 = !DILocation(line: 302, column: 35, scope: !421)
!605 = !DILocation(line: 302, column: 55, scope: !421)
!606 = !DILocation(line: 302, column: 58, scope: !421)
!607 = !DILocation(line: 302, column: 78, scope: !421)
!608 = !DILocation(line: 300, column: 11, scope: !421)
!609 = !DILocation(line: 300, column: 9, scope: !421)
!610 = !DILocation(line: 303, column: 9, scope: !611)
!611 = distinct !DILexicalBlock(scope: !421, file: !50, line: 303, column: 9)
!612 = !DILocation(line: 303, column: 13, scope: !611)
!613 = !DILocation(line: 303, column: 9, scope: !421)
!614 = !DILocation(line: 304, column: 33, scope: !615)
!615 = distinct !DILexicalBlock(scope: !616, file: !50, line: 304, column: 13)
!616 = distinct !DILexicalBlock(scope: !611, file: !50, line: 303, column: 18)
!617 = !DILocation(line: 304, column: 36, scope: !615)
!618 = !DILocation(line: 304, column: 13, scope: !615)
!619 = !DILocation(line: 304, column: 13, scope: !616)
!620 = !DILocation(line: 305, column: 13, scope: !615)
!621 = !DILocation(line: 306, column: 16, scope: !616)
!622 = !DILocation(line: 306, column: 46, scope: !616)
!623 = !DILocation(line: 306, column: 9, scope: !616)
!624 = !DILocation(line: 307, column: 9, scope: !616)
!625 = !DILocation(line: 307, column: 12, scope: !616)
!626 = !DILocation(line: 307, column: 22, scope: !616)
!627 = !DILocation(line: 308, column: 9, scope: !616)
!628 = !DILocation(line: 310, column: 5, scope: !421)
!629 = !DILocation(line: 311, column: 1, scope: !421)
!630 = distinct !DISubprogram(name: "hls_close", scope: !50, file: !50, line: 175, type: !147, isLocal: true, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !217)
!631 = !DILocalVariable(name: "h", arg: 1, scope: !630, file: !50, line: 175, type: !61)
!632 = !DILocation(line: 175, column: 34, scope: !630)
!633 = !DILocalVariable(name: "s", scope: !630, file: !50, line: 177, type: !226)
!634 = !DILocation(line: 177, column: 17, scope: !630)
!635 = !DILocation(line: 177, column: 21, scope: !630)
!636 = !DILocation(line: 177, column: 24, scope: !630)
!637 = !DILocation(line: 179, column: 23, scope: !630)
!638 = !DILocation(line: 179, column: 5, scope: !630)
!639 = !DILocation(line: 180, column: 23, scope: !630)
!640 = !DILocation(line: 180, column: 5, scope: !630)
!641 = !DILocation(line: 181, column: 17, scope: !630)
!642 = !DILocation(line: 181, column: 20, scope: !630)
!643 = !DILocation(line: 181, column: 5, scope: !630)
!644 = !DILocation(line: 182, column: 5, scope: !630)
!645 = distinct !DISubprogram(name: "parse_playlist", scope: !50, file: !50, line: 103, type: !646, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !217)
!646 = !DISubroutineType(types: !647)
!647 = !{!34, !61, !42}
!648 = !DILocalVariable(name: "h", arg: 1, scope: !645, file: !50, line: 103, type: !61)
!649 = !DILocation(line: 103, column: 39, scope: !645)
!650 = !DILocalVariable(name: "url", arg: 2, scope: !645, file: !50, line: 103, type: !42)
!651 = !DILocation(line: 103, column: 54, scope: !645)
!652 = !DILocalVariable(name: "s", scope: !645, file: !50, line: 105, type: !226)
!653 = !DILocation(line: 105, column: 17, scope: !645)
!654 = !DILocation(line: 105, column: 21, scope: !645)
!655 = !DILocation(line: 105, column: 24, scope: !645)
!656 = !DILocalVariable(name: "in", scope: !645, file: !50, line: 106, type: !657)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !25, line: 352, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !25, line: 161, size: 2112, align: 64, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !671, !672, !676, !677, !678, !679, !680, !682, !683, !689, !690, !694, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !712, !713, !714, !715, !716, !717, !718}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !659, file: !25, line: 174, baseType: !66, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !659, file: !25, line: 226, baseType: !153, size: 64, align: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !659, file: !25, line: 227, baseType: !34, size: 32, align: 32, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !659, file: !25, line: 228, baseType: !153, size: 64, align: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !659, file: !25, line: 229, baseType: !153, size: 64, align: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !659, file: !25, line: 233, baseType: !41, size: 64, align: 64, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !659, file: !25, line: 235, baseType: !668, size: 64, align: 64, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!34, !41, !424, !34}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !659, file: !25, line: 236, baseType: !668, size: 64, align: 64, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !659, file: !25, line: 237, baseType: !673, size: 64, align: 64, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64, align: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!125, !41, !125, !34}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !659, file: !25, line: 238, baseType: !125, size: 64, align: 64, offset: 576)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !659, file: !25, line: 239, baseType: !34, size: 32, align: 32, offset: 640)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !659, file: !25, line: 240, baseType: !34, size: 32, align: 32, offset: 672)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !659, file: !25, line: 241, baseType: !34, size: 32, align: 32, offset: 704)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !659, file: !25, line: 242, baseType: !681, size: 64, align: 64, offset: 768)
!681 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !659, file: !25, line: 243, baseType: !153, size: 64, align: 64, offset: 832)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !659, file: !25, line: 244, baseType: !684, size: 64, align: 64, offset: 896)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, align: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!681, !681, !687, !35}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !659, file: !25, line: 245, baseType: !34, size: 32, align: 32, offset: 960)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !659, file: !25, line: 249, baseType: !691, size: 64, align: 64, offset: 1024)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64, align: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!34, !41, !34}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !659, file: !25, line: 255, baseType: !695, size: 64, align: 64, offset: 1088)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!125, !41, !34, !125, !34}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !659, file: !25, line: 260, baseType: !34, size: 32, align: 32, offset: 1152)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !659, file: !25, line: 266, baseType: !125, size: 64, align: 64, offset: 1216)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !659, file: !25, line: 273, baseType: !34, size: 32, align: 32, offset: 1280)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !659, file: !25, line: 279, baseType: !125, size: 64, align: 64, offset: 1344)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !659, file: !25, line: 285, baseType: !34, size: 32, align: 32, offset: 1408)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !659, file: !25, line: 291, baseType: !34, size: 32, align: 32, offset: 1440)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !659, file: !25, line: 298, baseType: !34, size: 32, align: 32, offset: 1472)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !659, file: !25, line: 304, baseType: !34, size: 32, align: 32, offset: 1504)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !659, file: !25, line: 309, baseType: !42, size: 64, align: 64, offset: 1536)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !659, file: !25, line: 314, baseType: !42, size: 64, align: 64, offset: 1600)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !659, file: !25, line: 319, baseType: !709, size: 64, align: 64, offset: 1664)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!34, !41, !424, !34, !24, !125}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !659, file: !25, line: 326, baseType: !34, size: 32, align: 32, offset: 1728)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !659, file: !25, line: 331, baseType: !24, size: 32, align: 32, offset: 1760)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !659, file: !25, line: 332, baseType: !125, size: 64, align: 64, offset: 1792)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !659, file: !25, line: 338, baseType: !120, size: 64, align: 64, offset: 1856)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !659, file: !25, line: 340, baseType: !125, size: 64, align: 64, offset: 1920)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !659, file: !25, line: 346, baseType: !153, size: 64, align: 64, offset: 1984)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !659, file: !25, line: 351, baseType: !34, size: 32, align: 32, offset: 2048)
!719 = !DILocation(line: 106, column: 18, scope: !645)
!720 = !DILocalVariable(name: "ret", scope: !645, file: !50, line: 107, type: !34)
!721 = !DILocation(line: 107, column: 9, scope: !645)
!722 = !DILocalVariable(name: "is_segment", scope: !645, file: !50, line: 107, type: !34)
!723 = !DILocation(line: 107, column: 18, scope: !645)
!724 = !DILocalVariable(name: "is_variant", scope: !645, file: !50, line: 107, type: !34)
!725 = !DILocation(line: 107, column: 34, scope: !645)
!726 = !DILocalVariable(name: "bandwidth", scope: !645, file: !50, line: 107, type: !34)
!727 = !DILocation(line: 107, column: 50, scope: !645)
!728 = !DILocalVariable(name: "duration", scope: !645, file: !50, line: 108, type: !125)
!729 = !DILocation(line: 108, column: 13, scope: !645)
!730 = !DILocalVariable(name: "line", scope: !645, file: !50, line: 109, type: !731)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8192, align: 8, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 1024)
!734 = !DILocation(line: 109, column: 10, scope: !645)
!735 = !DILocalVariable(name: "ptr", scope: !645, file: !50, line: 110, type: !42)
!736 = !DILocation(line: 110, column: 17, scope: !645)
!737 = !DILocation(line: 112, column: 41, scope: !738)
!738 = distinct !DILexicalBlock(scope: !645, file: !50, line: 112, column: 9)
!739 = !DILocation(line: 113, column: 37, scope: !738)
!740 = !DILocation(line: 113, column: 40, scope: !738)
!741 = !DILocation(line: 114, column: 36, scope: !738)
!742 = !DILocation(line: 114, column: 39, scope: !738)
!743 = !DILocation(line: 114, column: 59, scope: !738)
!744 = !DILocation(line: 114, column: 62, scope: !738)
!745 = !DILocation(line: 112, column: 16, scope: !738)
!746 = !DILocation(line: 112, column: 14, scope: !738)
!747 = !DILocation(line: 114, column: 83, scope: !738)
!748 = !DILocation(line: 112, column: 9, scope: !645)
!749 = !DILocation(line: 115, column: 16, scope: !738)
!750 = !DILocation(line: 115, column: 9, scope: !738)
!751 = !DILocation(line: 117, column: 23, scope: !645)
!752 = !DILocation(line: 117, column: 27, scope: !645)
!753 = !DILocation(line: 117, column: 5, scope: !645)
!754 = !DILocation(line: 118, column: 16, scope: !755)
!755 = distinct !DILexicalBlock(scope: !645, file: !50, line: 118, column: 9)
!756 = !DILocation(line: 118, column: 9, scope: !755)
!757 = !DILocation(line: 118, column: 9, scope: !645)
!758 = !DILocation(line: 119, column: 13, scope: !759)
!759 = distinct !DILexicalBlock(scope: !755, file: !50, line: 118, column: 34)
!760 = !DILocation(line: 120, column: 9, scope: !759)
!761 = !DILocation(line: 123, column: 23, scope: !645)
!762 = !DILocation(line: 123, column: 5, scope: !645)
!763 = !DILocation(line: 124, column: 5, scope: !645)
!764 = !DILocation(line: 124, column: 8, scope: !645)
!765 = !DILocation(line: 124, column: 17, scope: !645)
!766 = !DILocation(line: 125, column: 5, scope: !645)
!767 = !DILocation(line: 125, column: 23, scope: !768)
!768 = !DILexicalBlockFile(scope: !645, file: !50, discriminator: 1)
!769 = !DILocation(line: 125, column: 13, scope: !768)
!770 = !DILocation(line: 125, column: 12, scope: !768)
!771 = !DILocation(line: 125, column: 5, scope: !768)
!772 = !DILocation(line: 126, column: 27, scope: !773)
!773 = distinct !DILexicalBlock(scope: !645, file: !50, line: 125, column: 28)
!774 = !DILocation(line: 126, column: 31, scope: !773)
!775 = !DILocation(line: 126, column: 9, scope: !773)
!776 = !DILocation(line: 127, column: 25, scope: !777)
!777 = distinct !DILexicalBlock(scope: !773, file: !50, line: 127, column: 13)
!778 = !DILocation(line: 127, column: 13, scope: !777)
!779 = !DILocation(line: 127, column: 13, scope: !773)
!780 = !DILocalVariable(name: "info", scope: !781, file: !50, line: 128, type: !782)
!781 = distinct !DILexicalBlock(scope: !777, file: !50, line: 127, column: 60)
