; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--gxfenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--gxfenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVOutputFormat = type { i8*, i8*, i8*, i8*, i32, i32, i32, i32, %struct.AVCodecTag**, %struct.AVClass*, %struct.AVOutputFormat*, i32, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*, %struct.AVPacket*, i32)*, i32 (i32, i32)*, void (%struct.AVFormatContext*, i32, i64*, i64*)*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i32 (%struct.AVFormatContext*, i32, %struct.AVFrame**, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32, i32 (%struct.AVFormatContext*)*, void (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }

!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 25, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "libavformat/gxf.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!940 = !{!941, !942, !943, !944, !945}
!941 = !DIEnumerator(name: "PKT_MAP", value: 188)
!942 = !DIEnumerator(name: "PKT_MEDIA", value: 191)
!943 = !DIEnumerator(name: "PKT_EOS", value: 251)
!944 = !DIEnumerator(name: "PKT_FLT", value: 252)
!945 = !DIEnumerator(name: "PKT_UMF", value: 253)
!946 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 33, size: 32, align: 32, elements: !947)
!947 = !{!948, !949, !950, !951, !952, !953}
!948 = !DIEnumerator(name: "MAT_NAME", value: 64)
!949 = !DIEnumerator(name: "MAT_FIRST_FIELD", value: 65)
!950 = !DIEnumerator(name: "MAT_LAST_FIELD", value: 66)
!951 = !DIEnumerator(name: "MAT_MARK_IN", value: 67)
!952 = !DIEnumerator(name: "MAT_MARK_OUT", value: 68)
!953 = !DIEnumerator(name: "MAT_SIZE", value: 69)
!954 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 42, size: 32, align: 32, elements: !955)
!955 = !{!956, !957, !958, !959, !960, !961, !962}
!956 = !DIEnumerator(name: "TRACK_NAME", value: 76)
!957 = !DIEnumerator(name: "TRACK_AUX", value: 77)
!958 = !DIEnumerator(name: "TRACK_VER", value: 78)
!959 = !DIEnumerator(name: "TRACK_MPG_AUX", value: 79)
!960 = !DIEnumerator(name: "TRACK_FPS", value: 80)
!961 = !DIEnumerator(name: "TRACK_LINES", value: 81)
!962 = !DIEnumerator(name: "TRACK_FPF", value: 82)
!963 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVRounding", file: !964, line: 79, size: 32, align: 32, elements: !965)
!964 = !DIFile(filename: "./libavutil/mathematics.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!965 = !{!966, !967, !968, !969, !970, !971}
!966 = !DIEnumerator(name: "AV_ROUND_ZERO", value: 0)
!967 = !DIEnumerator(name: "AV_ROUND_INF", value: 1)
!968 = !DIEnumerator(name: "AV_ROUND_DOWN", value: 2)
!969 = !DIEnumerator(name: "AV_ROUND_UP", value: 3)
!970 = !DIEnumerator(name: "AV_ROUND_NEAR_INF", value: 5)
!971 = !DIEnumerator(name: "AV_ROUND_PASS_MINMAX", value: 8192)
!972 = !{!973, !974, !975, !979}
!973 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !977, line: 48, baseType: !978)
!977 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!978 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !980, line: 197, baseType: !981)
!980 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!981 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!982 = !{!983, !2225, !2231, !2240}
!983 = distinct !DIGlobalVariable(name: "ff_gxf_muxer", scope: !0, file: !984, line: 1020, type: !985, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_gxf_muxer)
!984 = !DIFile(filename: "libavformat/gxfenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !987)
!987 = !{!988, !992, !993, !994, !995, !996, !997, !998, !1000, !1011, !1090, !1092, !1093, !2190, !2191, !2192, !2196, !2200, !2204, !2205, !2210, !2211, !2212, !2213, !2214, !2215, !2219}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !986, file: !919, line: 498, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !986, file: !919, line: 504, baseType: !989, size: 64, align: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !986, file: !919, line: 505, baseType: !989, size: 64, align: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !986, file: !919, line: 506, baseType: !989, size: 64, align: 64, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !986, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !986, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !986, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !986, file: !919, line: 517, baseType: !999, size: 32, align: 32, offset: 352)
!999 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !986, file: !919, line: 523, baseType: !1001, size: 64, align: 64, offset: 384)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1006, line: 44, size: 64, align: 32, elements: !1007)
!1006 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1005, file: !1006, line: 45, baseType: !3, size: 32, align: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1005, file: !1006, line: 46, baseType: !1010, size: 32, align: 32, offset: 32)
!1010 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !986, file: !919, line: 526, baseType: !1012, size: 64, align: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1016)
!1016 = !{!1017, !1018, !1022, !1049, !1050, !1051, !1052, !1056, !1062, !1064, !1068}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1015, file: !486, line: 72, baseType: !989, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1015, file: !486, line: 78, baseType: !1019, size: 64, align: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!989, !974}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1015, file: !486, line: 85, baseType: !1023, size: 64, align: 64, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030, !1031, !1045, !1046, !1047, !1048}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1025, file: !464, line: 247, baseType: !989, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1025, file: !464, line: 253, baseType: !989, size: 64, align: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1025, file: !464, line: 259, baseType: !999, size: 32, align: 32, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1025, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1025, file: !464, line: 271, baseType: !1032, size: 64, align: 64, offset: 192)
!1032 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1025, file: !464, line: 265, size: 64, align: 64, elements: !1033)
!1033 = !{!1034, !1035, !1037, !1038}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1032, file: !464, line: 266, baseType: !979, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1032, file: !464, line: 267, baseType: !1036, size: 64, align: 64)
!1036 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1032, file: !464, line: 268, baseType: !989, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1032, file: !464, line: 270, baseType: !1039, size: 64, align: 32)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1040, line: 61, baseType: !1041)
!1040 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1040, line: 58, size: 64, align: 32, elements: !1042)
!1042 = !{!1043, !1044}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1041, file: !1040, line: 59, baseType: !999, size: 32, align: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1041, file: !1040, line: 60, baseType: !999, size: 32, align: 32, offset: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1025, file: !464, line: 272, baseType: !1036, size: 64, align: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1025, file: !464, line: 273, baseType: !1036, size: 64, align: 64, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1025, file: !464, line: 275, baseType: !999, size: 32, align: 32, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1025, file: !464, line: 300, baseType: !989, size: 64, align: 64, offset: 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1015, file: !486, line: 93, baseType: !999, size: 32, align: 32, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1015, file: !486, line: 99, baseType: !999, size: 32, align: 32, offset: 224)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1015, file: !486, line: 108, baseType: !999, size: 32, align: 32, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1015, file: !486, line: 113, baseType: !1053, size: 64, align: 64, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!974, !974, !974}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1015, file: !486, line: 123, baseType: !1057, size: 64, align: 64, offset: 384)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!1060, !1060}
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1015, file: !486, line: 130, baseType: !1063, size: 32, align: 32, offset: 448)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1015, file: !486, line: 136, baseType: !1065, size: 64, align: 64, offset: 512)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!1063, !974}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1015, file: !486, line: 142, baseType: !1069, size: 64, align: 64, offset: 576)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!999, !1072, !974, !989, !999}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1075)
!1075 = !{!1076, !1088, !1089}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1074, file: !464, line: 360, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1085, !1086, !1087}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1080, file: !464, line: 307, baseType: !989, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1080, file: !464, line: 313, baseType: !1036, size: 64, align: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1080, file: !464, line: 313, baseType: !1036, size: 64, align: 64, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1080, file: !464, line: 318, baseType: !1036, size: 64, align: 64, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1080, file: !464, line: 318, baseType: !1036, size: 64, align: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1080, file: !464, line: 323, baseType: !999, size: 32, align: 32, offset: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1074, file: !464, line: 364, baseType: !999, size: 32, align: 32, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1074, file: !464, line: 368, baseType: !999, size: 32, align: 32, offset: 96)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !986, file: !919, line: 535, baseType: !1091, size: 64, align: 64, offset: 512)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !986, file: !919, line: 539, baseType: !999, size: 32, align: 32, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !986, file: !919, line: 541, baseType: !1094, size: 64, align: 64, offset: 640)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!999, !1097}
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1099)
!1099 = !{!1100, !1101, !1196, !1197, !1198, !1264, !1265, !1266, !2044, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2098, !2099, !2100, !2101, !2102, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2153, !2154, !2157, !2158, !2159, !2160, !2161, !2162, !2167, !2168, !2169, !2170, !2178, !2179, !2183, !2187, !2188, !2189}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1098, file: !919, line: 1342, baseType: !1012, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1098, file: !919, line: 1349, baseType: !1102, size: 64, align: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1128, !1129, !1167, !1168, !1172, !1177, !1178, !1179, !1183, !1189, !1195}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1103, file: !919, line: 638, baseType: !989, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1103, file: !919, line: 645, baseType: !989, size: 64, align: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1103, file: !919, line: 652, baseType: !999, size: 32, align: 32, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1103, file: !919, line: 659, baseType: !989, size: 64, align: 64, offset: 192)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1103, file: !919, line: 661, baseType: !1001, size: 64, align: 64, offset: 256)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1103, file: !919, line: 663, baseType: !1012, size: 64, align: 64, offset: 320)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1103, file: !919, line: 670, baseType: !989, size: 64, align: 64, offset: 384)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1103, file: !919, line: 679, baseType: !1102, size: 64, align: 64, offset: 448)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1103, file: !919, line: 684, baseType: !999, size: 32, align: 32, offset: 512)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1103, file: !919, line: 689, baseType: !999, size: 32, align: 32, offset: 544)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1103, file: !919, line: 696, baseType: !1116, size: 64, align: 64, offset: 576)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!999, !1119}
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1122)
!1122 = !{!1123, !1124, !1126, !1127}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1121, file: !919, line: 449, baseType: !989, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1121, file: !919, line: 450, baseType: !1125, size: 64, align: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1121, file: !919, line: 451, baseType: !999, size: 32, align: 32, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1121, file: !919, line: 452, baseType: !989, size: 64, align: 64, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1103, file: !919, line: 703, baseType: !1094, size: 64, align: 64, offset: 640)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1103, file: !919, line: 714, baseType: !1130, size: 64, align: 64, offset: 704)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!999, !1097, !1133}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1136)
!1136 = !{!1137, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1163, !1164, !1165, !1166}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1135, file: !4, line: 1451, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1140, line: 94, baseType: !1141)
!1140 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1140, line: 81, size: 192, align: 64, elements: !1142)
!1142 = !{!1143, !1147, !1148}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1141, file: !1140, line: 82, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1140, line: 73, baseType: !1146)
!1146 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1140, line: 73, flags: DIFlagFwdDecl)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1141, file: !1140, line: 89, baseType: !975, size: 64, align: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1141, file: !1140, line: 93, baseType: !999, size: 32, align: 32, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1135, file: !4, line: 1461, baseType: !979, size: 64, align: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1135, file: !4, line: 1467, baseType: !979, size: 64, align: 64, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1135, file: !4, line: 1468, baseType: !975, size: 64, align: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1135, file: !4, line: 1469, baseType: !999, size: 32, align: 32, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1135, file: !4, line: 1470, baseType: !999, size: 32, align: 32, offset: 288)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1135, file: !4, line: 1474, baseType: !999, size: 32, align: 32, offset: 320)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1135, file: !4, line: 1479, baseType: !1156, size: 64, align: 64, offset: 384)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1159)
!1159 = !{!1160, !1161, !1162}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1158, file: !4, line: 1412, baseType: !975, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1158, file: !4, line: 1413, baseType: !999, size: 32, align: 32, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1158, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1135, file: !4, line: 1480, baseType: !999, size: 32, align: 32, offset: 448)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1135, file: !4, line: 1486, baseType: !979, size: 64, align: 64, offset: 512)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1135, file: !4, line: 1488, baseType: !979, size: 64, align: 64, offset: 576)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1135, file: !4, line: 1497, baseType: !979, size: 64, align: 64, offset: 640)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1103, file: !919, line: 720, baseType: !1094, size: 64, align: 64, offset: 768)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1103, file: !919, line: 730, baseType: !1169, size: 64, align: 64, offset: 832)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!999, !1097, !999, !979, !999}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1103, file: !919, line: 737, baseType: !1173, size: 64, align: 64, offset: 896)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!979, !1097, !999, !1176, !979}
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1103, file: !919, line: 744, baseType: !1094, size: 64, align: 64, offset: 960)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1103, file: !919, line: 750, baseType: !1094, size: 64, align: 64, offset: 1024)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1103, file: !919, line: 758, baseType: !1180, size: 64, align: 64, offset: 1088)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!999, !1097, !999, !979, !979, !979, !999}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1103, file: !919, line: 764, baseType: !1184, size: 64, align: 64, offset: 1152)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!999, !1097, !1187}
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1103, file: !919, line: 770, baseType: !1190, size: 64, align: 64, offset: 1216)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!999, !1097, !1193}
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1103, file: !919, line: 776, baseType: !1190, size: 64, align: 64, offset: 1280)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1098, file: !919, line: 1356, baseType: !1091, size: 64, align: 64, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1098, file: !919, line: 1365, baseType: !974, size: 64, align: 64, offset: 192)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1098, file: !919, line: 1379, baseType: !1199, size: 64, align: 64, offset: 256)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1202)
!1202 = !{!1203, !1204, !1205, !1206, !1207, !1208, !1209, !1213, !1214, !1218, !1219, !1220, !1221, !1222, !1224, !1225, !1231, !1232, !1236, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1254, !1255, !1256, !1257, !1261, !1262, !1263}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1201, file: !537, line: 174, baseType: !1012, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1201, file: !537, line: 226, baseType: !1125, size: 64, align: 64, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1201, file: !537, line: 227, baseType: !999, size: 32, align: 32, offset: 128)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1201, file: !537, line: 228, baseType: !1125, size: 64, align: 64, offset: 192)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1201, file: !537, line: 229, baseType: !1125, size: 64, align: 64, offset: 256)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1201, file: !537, line: 233, baseType: !974, size: 64, align: 64, offset: 320)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1201, file: !537, line: 235, baseType: !1210, size: 64, align: 64, offset: 384)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!999, !974, !975, !999}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1201, file: !537, line: 236, baseType: !1210, size: 64, align: 64, offset: 448)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1201, file: !537, line: 237, baseType: !1215, size: 64, align: 64, offset: 512)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!979, !974, !979, !999}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1201, file: !537, line: 238, baseType: !979, size: 64, align: 64, offset: 576)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1201, file: !537, line: 239, baseType: !999, size: 32, align: 32, offset: 640)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1201, file: !537, line: 240, baseType: !999, size: 32, align: 32, offset: 672)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1201, file: !537, line: 241, baseType: !999, size: 32, align: 32, offset: 704)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1201, file: !537, line: 242, baseType: !1223, size: 64, align: 64, offset: 768)
!1223 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1201, file: !537, line: 243, baseType: !1125, size: 64, align: 64, offset: 832)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1201, file: !537, line: 244, baseType: !1226, size: 64, align: 64, offset: 896)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!1223, !1223, !1229, !1010}
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1201, file: !537, line: 245, baseType: !999, size: 32, align: 32, offset: 960)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1201, file: !537, line: 249, baseType: !1233, size: 64, align: 64, offset: 1024)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!999, !974, !999}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1201, file: !537, line: 255, baseType: !1237, size: 64, align: 64, offset: 1088)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!979, !974, !999, !979, !999}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1201, file: !537, line: 260, baseType: !999, size: 32, align: 32, offset: 1152)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1201, file: !537, line: 266, baseType: !979, size: 64, align: 64, offset: 1216)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1201, file: !537, line: 273, baseType: !999, size: 32, align: 32, offset: 1280)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1201, file: !537, line: 279, baseType: !979, size: 64, align: 64, offset: 1344)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1201, file: !537, line: 285, baseType: !999, size: 32, align: 32, offset: 1408)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1201, file: !537, line: 291, baseType: !999, size: 32, align: 32, offset: 1440)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1201, file: !537, line: 298, baseType: !999, size: 32, align: 32, offset: 1472)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1201, file: !537, line: 304, baseType: !999, size: 32, align: 32, offset: 1504)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1201, file: !537, line: 309, baseType: !989, size: 64, align: 64, offset: 1536)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1201, file: !537, line: 314, baseType: !989, size: 64, align: 64, offset: 1600)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1201, file: !537, line: 319, baseType: !1251, size: 64, align: 64, offset: 1664)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!999, !974, !975, !999, !536, !979}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1201, file: !537, line: 326, baseType: !999, size: 32, align: 32, offset: 1728)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1201, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1201, file: !537, line: 332, baseType: !979, size: 64, align: 64, offset: 1792)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1201, file: !537, line: 338, baseType: !1258, size: 64, align: 64, offset: 1856)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!999, !974}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1201, file: !537, line: 340, baseType: !979, size: 64, align: 64, offset: 1920)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1201, file: !537, line: 346, baseType: !1125, size: 64, align: 64, offset: 1984)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1201, file: !537, line: 351, baseType: !999, size: 32, align: 32, offset: 2048)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1098, file: !919, line: 1386, baseType: !999, size: 32, align: 32, offset: 320)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1098, file: !919, line: 1393, baseType: !1010, size: 32, align: 32, offset: 352)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1098, file: !919, line: 1405, baseType: !1267, size: 64, align: 64, offset: 384)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1271)
!1271 = !{!1272, !1273, !1274, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1830, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1930, !1936, !1937, !1941, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1973, !1974, !1975, !1976, !1977, !1978}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1270, file: !919, line: 866, baseType: !999, size: 32, align: 32)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1270, file: !919, line: 872, baseType: !999, size: 32, align: 32, offset: 32)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1270, file: !919, line: 878, baseType: !1275, size: 64, align: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1278)
!1278 = !{!1279, !1280, !1281, !1282, !1506, !1507, !1508, !1509, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1535, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1718, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1277, file: !4, line: 1561, baseType: !1012, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1277, file: !4, line: 1562, baseType: !999, size: 32, align: 32, offset: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1277, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1277, file: !4, line: 1565, baseType: !1283, size: 64, align: 64, offset: 128)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1285)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1286)
!1286 = !{!1287, !1288, !1289, !1290, !1291, !1292, !1295, !1298, !1301, !1304, !1308, !1309, !1310, !1318, !1319, !1320, !1322, !1326, !1332, !1337, !1341, !1342, !1390, !1477, !1481, !1482, !1486, !1490, !1495, !1499, !1500, !1501}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1285, file: !4, line: 3475, baseType: !989, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1285, file: !4, line: 3480, baseType: !989, size: 64, align: 64, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1285, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1285, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1285, file: !4, line: 3487, baseType: !999, size: 32, align: 32, offset: 192)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1285, file: !4, line: 3488, baseType: !1293, size: 64, align: 64, offset: 256)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1285, file: !4, line: 3489, baseType: !1296, size: 64, align: 64, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1285, file: !4, line: 3490, baseType: !1299, size: 64, align: 64, offset: 384)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1285, file: !4, line: 3491, baseType: !1302, size: 64, align: 64, offset: 448)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1285, file: !4, line: 3492, baseType: !1305, size: 64, align: 64, offset: 512)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1307)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !977, line: 55, baseType: !1223)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1285, file: !4, line: 3493, baseType: !976, size: 8, align: 8, offset: 576)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1285, file: !4, line: 3494, baseType: !1012, size: 64, align: 64, offset: 640)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1285, file: !4, line: 3495, baseType: !1311, size: 64, align: 64, offset: 704)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1313)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1314)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1315)
!1315 = !{!1316, !1317}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1314, file: !4, line: 3402, baseType: !999, size: 32, align: 32)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1314, file: !4, line: 3403, baseType: !989, size: 64, align: 64, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1285, file: !4, line: 3507, baseType: !989, size: 64, align: 64, offset: 768)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1285, file: !4, line: 3516, baseType: !999, size: 32, align: 32, offset: 832)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1285, file: !4, line: 3517, baseType: !1321, size: 64, align: 64, offset: 896)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1285, file: !4, line: 3527, baseType: !1323, size: 64, align: 64, offset: 960)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!999, !1275}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1285, file: !4, line: 3535, baseType: !1327, size: 64, align: 64, offset: 1024)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!999, !1275, !1330}
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1276)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1285, file: !4, line: 3541, baseType: !1333, size: 64, align: 64, offset: 1088)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1335)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1336)
!1336 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1285, file: !4, line: 3549, baseType: !1338, size: 64, align: 64, offset: 1152)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{null, !1321}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1285, file: !4, line: 3551, baseType: !1323, size: 64, align: 64, offset: 1216)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1285, file: !4, line: 3552, baseType: !1343, size: 64, align: 64, offset: 1280)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{!999, !1275, !975, !999, !1346}
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1348)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1349)
!1349 = !{!1350, !1353, !1355, !1356, !1357, !1389}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1348, file: !4, line: 3921, baseType: !1351, size: 16, align: 16)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !977, line: 49, baseType: !1352)
!1352 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1348, file: !4, line: 3922, baseType: !1354, size: 32, align: 32, offset: 32)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !977, line: 51, baseType: !1010)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1348, file: !4, line: 3923, baseType: !1354, size: 32, align: 32, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1348, file: !4, line: 3924, baseType: !1010, size: 32, align: 32, offset: 96)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1348, file: !4, line: 3925, baseType: !1358, size: 64, align: 64, offset: 128)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1362)
!1362 = !{!1363, !1364, !1365, !1366, !1367, !1368, !1378, !1382, !1384, !1385, !1387, !1388}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1361, file: !4, line: 3886, baseType: !999, size: 32, align: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1361, file: !4, line: 3887, baseType: !999, size: 32, align: 32, offset: 32)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1361, file: !4, line: 3888, baseType: !999, size: 32, align: 32, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1361, file: !4, line: 3889, baseType: !999, size: 32, align: 32, offset: 96)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1361, file: !4, line: 3890, baseType: !999, size: 32, align: 32, offset: 128)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1361, file: !4, line: 3897, baseType: !1369, size: 768, align: 64, offset: 192)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1370)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1371)
!1371 = !{!1372, !1376}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1370, file: !4, line: 3855, baseType: !1373, size: 512, align: 64)
!1373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 512, align: 64, elements: !1374)
!1374 = !{!1375}
!1375 = !DISubrange(count: 8)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1370, file: !4, line: 3857, baseType: !1377, size: 256, align: 32, offset: 512)
!1377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 256, align: 32, elements: !1374)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1361, file: !4, line: 3903, baseType: !1379, size: 256, align: 64, offset: 960)
!1379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 256, align: 64, elements: !1380)
!1380 = !{!1381}
!1381 = !DISubrange(count: 4)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1361, file: !4, line: 3904, baseType: !1383, size: 128, align: 32, offset: 1216)
!1383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 128, align: 32, elements: !1380)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1361, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1361, file: !4, line: 3908, baseType: !1386, size: 64, align: 64, offset: 1408)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1361, file: !4, line: 3915, baseType: !1386, size: 64, align: 64, offset: 1472)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1361, file: !4, line: 3917, baseType: !999, size: 32, align: 32, offset: 1536)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1348, file: !4, line: 3926, baseType: !979, size: 64, align: 64, offset: 192)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1285, file: !4, line: 3564, baseType: !1391, size: 64, align: 64, offset: 1344)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DISubroutineType(types: !1393)
!1393 = !{!999, !1275, !1133, !1394, !1476}
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1396)
!1396 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1397)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1398)
!1398 = !{!1399, !1400, !1401, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1428, !1430, !1431, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1464, !1465, !1466, !1467, !1468, !1469, !1472, !1473, !1474, !1475}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1397, file: !789, line: 282, baseType: !1373, size: 512, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1397, file: !789, line: 299, baseType: !1377, size: 256, align: 32, offset: 512)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1397, file: !789, line: 315, baseType: !1402, size: 64, align: 64, offset: 768)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1397, file: !789, line: 326, baseType: !999, size: 32, align: 32, offset: 832)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1397, file: !789, line: 326, baseType: !999, size: 32, align: 32, offset: 864)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1397, file: !789, line: 334, baseType: !999, size: 32, align: 32, offset: 896)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1397, file: !789, line: 341, baseType: !999, size: 32, align: 32, offset: 928)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1397, file: !789, line: 346, baseType: !999, size: 32, align: 32, offset: 960)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1397, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1397, file: !789, line: 356, baseType: !1039, size: 64, align: 32, offset: 1024)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1397, file: !789, line: 361, baseType: !979, size: 64, align: 64, offset: 1088)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1397, file: !789, line: 369, baseType: !979, size: 64, align: 64, offset: 1152)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1397, file: !789, line: 377, baseType: !979, size: 64, align: 64, offset: 1216)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1397, file: !789, line: 382, baseType: !999, size: 32, align: 32, offset: 1280)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1397, file: !789, line: 386, baseType: !999, size: 32, align: 32, offset: 1312)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1397, file: !789, line: 391, baseType: !999, size: 32, align: 32, offset: 1344)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1397, file: !789, line: 396, baseType: !974, size: 64, align: 64, offset: 1408)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1397, file: !789, line: 403, baseType: !1418, size: 512, align: 64, offset: 1472)
!1418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1307, size: 512, align: 64, elements: !1374)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1397, file: !789, line: 410, baseType: !999, size: 32, align: 32, offset: 1984)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1397, file: !789, line: 415, baseType: !999, size: 32, align: 32, offset: 2016)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1397, file: !789, line: 420, baseType: !999, size: 32, align: 32, offset: 2048)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1397, file: !789, line: 425, baseType: !999, size: 32, align: 32, offset: 2080)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1397, file: !789, line: 435, baseType: !979, size: 64, align: 64, offset: 2112)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1397, file: !789, line: 440, baseType: !999, size: 32, align: 32, offset: 2176)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1397, file: !789, line: 445, baseType: !1307, size: 64, align: 64, offset: 2240)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1397, file: !789, line: 459, baseType: !1427, size: 512, align: 64, offset: 2304)
!1427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1138, size: 512, align: 64, elements: !1374)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1397, file: !789, line: 473, baseType: !1429, size: 64, align: 64, offset: 2816)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1397, file: !789, line: 477, baseType: !999, size: 32, align: 32, offset: 2880)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1397, file: !789, line: 479, baseType: !1432, size: 64, align: 64, offset: 2944)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1435)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1436)
!1436 = !{!1437, !1438, !1439, !1440, !1445}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1435, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1435, file: !789, line: 203, baseType: !975, size: 64, align: 64, offset: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1435, file: !789, line: 204, baseType: !999, size: 32, align: 32, offset: 128)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1435, file: !789, line: 205, baseType: !1441, size: 64, align: 64, offset: 192)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1443, line: 86, baseType: !1444)
!1443 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1444 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1443, line: 86, flags: DIFlagFwdDecl)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1435, file: !789, line: 206, baseType: !1138, size: 64, align: 64, offset: 256)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1397, file: !789, line: 480, baseType: !999, size: 32, align: 32, offset: 3008)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1397, file: !789, line: 505, baseType: !999, size: 32, align: 32, offset: 3040)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1397, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1397, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1397, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1397, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1397, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1397, file: !789, line: 532, baseType: !979, size: 64, align: 64, offset: 3264)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1397, file: !789, line: 539, baseType: !979, size: 64, align: 64, offset: 3328)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1397, file: !789, line: 547, baseType: !979, size: 64, align: 64, offset: 3392)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1397, file: !789, line: 554, baseType: !1441, size: 64, align: 64, offset: 3456)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1397, file: !789, line: 563, baseType: !999, size: 32, align: 32, offset: 3520)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1397, file: !789, line: 572, baseType: !999, size: 32, align: 32, offset: 3552)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1397, file: !789, line: 581, baseType: !999, size: 32, align: 32, offset: 3584)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1397, file: !789, line: 588, baseType: !1461, size: 64, align: 64, offset: 3648)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !980, line: 194, baseType: !1463)
!1463 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1397, file: !789, line: 593, baseType: !999, size: 32, align: 32, offset: 3712)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1397, file: !789, line: 596, baseType: !999, size: 32, align: 32, offset: 3744)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1397, file: !789, line: 599, baseType: !1138, size: 64, align: 64, offset: 3776)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1397, file: !789, line: 605, baseType: !1138, size: 64, align: 64, offset: 3840)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1397, file: !789, line: 616, baseType: !1138, size: 64, align: 64, offset: 3904)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1397, file: !789, line: 626, baseType: !1470, size: 64, align: 64, offset: 3968)
!1470 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1471, line: 216, baseType: !1223)
!1471 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1397, file: !789, line: 627, baseType: !1470, size: 64, align: 64, offset: 4032)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1397, file: !789, line: 628, baseType: !1470, size: 64, align: 64, offset: 4096)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1397, file: !789, line: 629, baseType: !1470, size: 64, align: 64, offset: 4160)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1397, file: !789, line: 645, baseType: !1138, size: 64, align: 64, offset: 4224)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1285, file: !4, line: 3566, baseType: !1478, size: 64, align: 64, offset: 1408)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{!999, !1275, !974, !1476, !1133}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1285, file: !4, line: 3567, baseType: !1323, size: 64, align: 64, offset: 1472)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1285, file: !4, line: 3576, baseType: !1483, size: 64, align: 64, offset: 1536)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DISubroutineType(types: !1485)
!1485 = !{!999, !1275, !1394}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1285, file: !4, line: 3577, baseType: !1487, size: 64, align: 64, offset: 1600)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DISubroutineType(types: !1489)
!1489 = !{!999, !1275, !1133}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1285, file: !4, line: 3584, baseType: !1491, size: 64, align: 64, offset: 1664)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!999, !1275, !1494}
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1285, file: !4, line: 3589, baseType: !1496, size: 64, align: 64, offset: 1728)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{null, !1275}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1285, file: !4, line: 3594, baseType: !999, size: 32, align: 32, offset: 1792)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1285, file: !4, line: 3600, baseType: !989, size: 64, align: 64, offset: 1856)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1285, file: !4, line: 3609, baseType: !1502, size: 64, align: 64, offset: 1920)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1505)
!1505 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1277, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1277, file: !4, line: 1581, baseType: !1010, size: 32, align: 32, offset: 224)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1277, file: !4, line: 1583, baseType: !974, size: 64, align: 64, offset: 256)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1277, file: !4, line: 1591, baseType: !1510, size: 64, align: 64, offset: 320)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1277, file: !4, line: 1598, baseType: !974, size: 64, align: 64, offset: 384)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1277, file: !4, line: 1606, baseType: !979, size: 64, align: 64, offset: 448)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1277, file: !4, line: 1614, baseType: !999, size: 32, align: 32, offset: 512)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1277, file: !4, line: 1622, baseType: !999, size: 32, align: 32, offset: 544)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1277, file: !4, line: 1628, baseType: !999, size: 32, align: 32, offset: 576)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1277, file: !4, line: 1636, baseType: !999, size: 32, align: 32, offset: 608)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1277, file: !4, line: 1643, baseType: !999, size: 32, align: 32, offset: 640)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1277, file: !4, line: 1657, baseType: !975, size: 64, align: 64, offset: 704)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1277, file: !4, line: 1658, baseType: !999, size: 32, align: 32, offset: 768)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1277, file: !4, line: 1679, baseType: !1039, size: 64, align: 32, offset: 800)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1277, file: !4, line: 1688, baseType: !999, size: 32, align: 32, offset: 864)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1277, file: !4, line: 1712, baseType: !999, size: 32, align: 32, offset: 896)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1277, file: !4, line: 1729, baseType: !999, size: 32, align: 32, offset: 928)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1277, file: !4, line: 1729, baseType: !999, size: 32, align: 32, offset: 960)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1277, file: !4, line: 1744, baseType: !999, size: 32, align: 32, offset: 992)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1277, file: !4, line: 1744, baseType: !999, size: 32, align: 32, offset: 1024)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1277, file: !4, line: 1751, baseType: !999, size: 32, align: 32, offset: 1056)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1277, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1277, file: !4, line: 1791, baseType: !1531, size: 64, align: 64, offset: 1152)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DISubroutineType(types: !1533)
!1533 = !{null, !1534, !1394, !1476, !999, !999, !999}
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1277, file: !4, line: 1808, baseType: !1536, size: 64, align: 64, offset: 1216)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{!555, !1534, !1296}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1277, file: !4, line: 1816, baseType: !999, size: 32, align: 32, offset: 1280)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1277, file: !4, line: 1825, baseType: !973, size: 32, align: 32, offset: 1312)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1277, file: !4, line: 1830, baseType: !999, size: 32, align: 32, offset: 1344)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1277, file: !4, line: 1838, baseType: !973, size: 32, align: 32, offset: 1376)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1277, file: !4, line: 1846, baseType: !999, size: 32, align: 32, offset: 1408)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1277, file: !4, line: 1851, baseType: !999, size: 32, align: 32, offset: 1440)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1277, file: !4, line: 1861, baseType: !973, size: 32, align: 32, offset: 1472)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1277, file: !4, line: 1868, baseType: !973, size: 32, align: 32, offset: 1504)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1277, file: !4, line: 1875, baseType: !973, size: 32, align: 32, offset: 1536)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1277, file: !4, line: 1882, baseType: !973, size: 32, align: 32, offset: 1568)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1277, file: !4, line: 1889, baseType: !973, size: 32, align: 32, offset: 1600)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1277, file: !4, line: 1896, baseType: !973, size: 32, align: 32, offset: 1632)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1277, file: !4, line: 1903, baseType: !973, size: 32, align: 32, offset: 1664)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1277, file: !4, line: 1910, baseType: !999, size: 32, align: 32, offset: 1696)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1277, file: !4, line: 1915, baseType: !999, size: 32, align: 32, offset: 1728)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1277, file: !4, line: 1926, baseType: !1476, size: 64, align: 64, offset: 1792)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1277, file: !4, line: 1935, baseType: !1039, size: 64, align: 32, offset: 1856)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1277, file: !4, line: 1942, baseType: !999, size: 32, align: 32, offset: 1920)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1277, file: !4, line: 1948, baseType: !999, size: 32, align: 32, offset: 1952)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1277, file: !4, line: 1954, baseType: !999, size: 32, align: 32, offset: 1984)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1277, file: !4, line: 1960, baseType: !999, size: 32, align: 32, offset: 2016)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1277, file: !4, line: 1984, baseType: !999, size: 32, align: 32, offset: 2048)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1277, file: !4, line: 1991, baseType: !999, size: 32, align: 32, offset: 2080)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1277, file: !4, line: 1996, baseType: !999, size: 32, align: 32, offset: 2112)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1277, file: !4, line: 2004, baseType: !999, size: 32, align: 32, offset: 2144)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1277, file: !4, line: 2011, baseType: !999, size: 32, align: 32, offset: 2176)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1277, file: !4, line: 2018, baseType: !999, size: 32, align: 32, offset: 2208)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1277, file: !4, line: 2027, baseType: !999, size: 32, align: 32, offset: 2240)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1277, file: !4, line: 2034, baseType: !999, size: 32, align: 32, offset: 2272)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1277, file: !4, line: 2044, baseType: !999, size: 32, align: 32, offset: 2304)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1277, file: !4, line: 2054, baseType: !1570, size: 64, align: 64, offset: 2368)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1277, file: !4, line: 2061, baseType: !1570, size: 64, align: 64, offset: 2432)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1277, file: !4, line: 2066, baseType: !999, size: 32, align: 32, offset: 2496)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1277, file: !4, line: 2070, baseType: !999, size: 32, align: 32, offset: 2528)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1277, file: !4, line: 2078, baseType: !999, size: 32, align: 32, offset: 2560)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1277, file: !4, line: 2085, baseType: !999, size: 32, align: 32, offset: 2592)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1277, file: !4, line: 2092, baseType: !999, size: 32, align: 32, offset: 2624)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1277, file: !4, line: 2099, baseType: !999, size: 32, align: 32, offset: 2656)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1277, file: !4, line: 2106, baseType: !999, size: 32, align: 32, offset: 2688)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1277, file: !4, line: 2113, baseType: !999, size: 32, align: 32, offset: 2720)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1277, file: !4, line: 2120, baseType: !999, size: 32, align: 32, offset: 2752)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1277, file: !4, line: 2125, baseType: !999, size: 32, align: 32, offset: 2784)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1277, file: !4, line: 2133, baseType: !999, size: 32, align: 32, offset: 2816)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1277, file: !4, line: 2140, baseType: !999, size: 32, align: 32, offset: 2848)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1277, file: !4, line: 2145, baseType: !999, size: 32, align: 32, offset: 2880)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1277, file: !4, line: 2153, baseType: !999, size: 32, align: 32, offset: 2912)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1277, file: !4, line: 2158, baseType: !999, size: 32, align: 32, offset: 2944)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1277, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1277, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1277, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1277, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1277, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1277, file: !4, line: 2203, baseType: !999, size: 32, align: 32, offset: 3136)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1277, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1277, file: !4, line: 2212, baseType: !999, size: 32, align: 32, offset: 3200)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1277, file: !4, line: 2213, baseType: !999, size: 32, align: 32, offset: 3232)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1277, file: !4, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1277, file: !4, line: 2232, baseType: !999, size: 32, align: 32, offset: 3296)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1277, file: !4, line: 2243, baseType: !999, size: 32, align: 32, offset: 3328)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1277, file: !4, line: 2249, baseType: !999, size: 32, align: 32, offset: 3360)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1277, file: !4, line: 2256, baseType: !999, size: 32, align: 32, offset: 3392)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1277, file: !4, line: 2263, baseType: !1307, size: 64, align: 64, offset: 3456)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1277, file: !4, line: 2270, baseType: !1307, size: 64, align: 64, offset: 3520)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1277, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1277, file: !4, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1277, file: !4, line: 2367, baseType: !1606, size: 64, align: 64, offset: 3648)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DISubroutineType(types: !1608)
!1608 = !{!999, !1534, !1494, !999}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1277, file: !4, line: 2383, baseType: !999, size: 32, align: 32, offset: 3712)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1277, file: !4, line: 2386, baseType: !973, size: 32, align: 32, offset: 3744)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1277, file: !4, line: 2387, baseType: !973, size: 32, align: 32, offset: 3776)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1277, file: !4, line: 2394, baseType: !999, size: 32, align: 32, offset: 3808)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1277, file: !4, line: 2401, baseType: !999, size: 32, align: 32, offset: 3840)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1277, file: !4, line: 2408, baseType: !999, size: 32, align: 32, offset: 3872)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1277, file: !4, line: 2415, baseType: !999, size: 32, align: 32, offset: 3904)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1277, file: !4, line: 2422, baseType: !999, size: 32, align: 32, offset: 3936)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1277, file: !4, line: 2423, baseType: !1618, size: 64, align: 64, offset: 3968)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1620)
!1620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1621)
!1621 = !{!1622, !1623, !1624, !1625}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1620, file: !4, line: 827, baseType: !999, size: 32, align: 32)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1620, file: !4, line: 828, baseType: !999, size: 32, align: 32, offset: 32)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1620, file: !4, line: 829, baseType: !999, size: 32, align: 32, offset: 64)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1620, file: !4, line: 830, baseType: !973, size: 32, align: 32, offset: 96)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1277, file: !4, line: 2430, baseType: !979, size: 64, align: 64, offset: 4032)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1277, file: !4, line: 2437, baseType: !979, size: 64, align: 64, offset: 4096)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1277, file: !4, line: 2444, baseType: !973, size: 32, align: 32, offset: 4160)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1277, file: !4, line: 2451, baseType: !973, size: 32, align: 32, offset: 4192)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1277, file: !4, line: 2458, baseType: !999, size: 32, align: 32, offset: 4224)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1277, file: !4, line: 2469, baseType: !999, size: 32, align: 32, offset: 4256)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1277, file: !4, line: 2475, baseType: !999, size: 32, align: 32, offset: 4288)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1277, file: !4, line: 2481, baseType: !999, size: 32, align: 32, offset: 4320)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1277, file: !4, line: 2485, baseType: !999, size: 32, align: 32, offset: 4352)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1277, file: !4, line: 2489, baseType: !999, size: 32, align: 32, offset: 4384)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1277, file: !4, line: 2493, baseType: !999, size: 32, align: 32, offset: 4416)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1277, file: !4, line: 2501, baseType: !999, size: 32, align: 32, offset: 4448)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1277, file: !4, line: 2506, baseType: !999, size: 32, align: 32, offset: 4480)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1277, file: !4, line: 2510, baseType: !999, size: 32, align: 32, offset: 4512)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1277, file: !4, line: 2514, baseType: !979, size: 64, align: 64, offset: 4544)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1277, file: !4, line: 2528, baseType: !1642, size: 64, align: 64, offset: 4608)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{null, !1534, !974, !999, !999}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1277, file: !4, line: 2534, baseType: !999, size: 32, align: 32, offset: 4672)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1277, file: !4, line: 2545, baseType: !999, size: 32, align: 32, offset: 4704)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1277, file: !4, line: 2547, baseType: !999, size: 32, align: 32, offset: 4736)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1277, file: !4, line: 2549, baseType: !999, size: 32, align: 32, offset: 4768)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1277, file: !4, line: 2551, baseType: !999, size: 32, align: 32, offset: 4800)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1277, file: !4, line: 2553, baseType: !999, size: 32, align: 32, offset: 4832)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1277, file: !4, line: 2555, baseType: !999, size: 32, align: 32, offset: 4864)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1277, file: !4, line: 2557, baseType: !999, size: 32, align: 32, offset: 4896)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1277, file: !4, line: 2559, baseType: !999, size: 32, align: 32, offset: 4928)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1277, file: !4, line: 2563, baseType: !999, size: 32, align: 32, offset: 4960)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1277, file: !4, line: 2571, baseType: !1386, size: 64, align: 64, offset: 4992)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1277, file: !4, line: 2579, baseType: !1386, size: 64, align: 64, offset: 5056)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1277, file: !4, line: 2586, baseType: !999, size: 32, align: 32, offset: 5120)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1277, file: !4, line: 2615, baseType: !999, size: 32, align: 32, offset: 5152)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1277, file: !4, line: 2627, baseType: !999, size: 32, align: 32, offset: 5184)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1277, file: !4, line: 2637, baseType: !999, size: 32, align: 32, offset: 5216)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1277, file: !4, line: 2681, baseType: !999, size: 32, align: 32, offset: 5248)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1277, file: !4, line: 2709, baseType: !979, size: 64, align: 64, offset: 5312)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1277, file: !4, line: 2716, baseType: !1664, size: 64, align: 64, offset: 5376)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1666)
!1666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1667)
!1667 = !{!1668, !1669, !1670, !1671, !1672, !1673, !1674, !1678, !1682, !1683, !1684, !1685, !1691, !1692, !1693, !1694, !1695}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1666, file: !4, line: 3642, baseType: !989, size: 64, align: 64)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1666, file: !4, line: 3649, baseType: !545, size: 32, align: 32, offset: 64)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1666, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1666, file: !4, line: 3663, baseType: !555, size: 32, align: 32, offset: 128)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1666, file: !4, line: 3669, baseType: !999, size: 32, align: 32, offset: 160)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1666, file: !4, line: 3682, baseType: !1491, size: 64, align: 64, offset: 192)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1666, file: !4, line: 3698, baseType: !1675, size: 64, align: 64, offset: 256)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DISubroutineType(types: !1677)
!1677 = !{!999, !1275, !1229, !1354}
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1666, file: !4, line: 3712, baseType: !1679, size: 64, align: 64, offset: 320)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DISubroutineType(types: !1681)
!1681 = !{!999, !1275, !999, !1229, !1354}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1666, file: !4, line: 3726, baseType: !1675, size: 64, align: 64, offset: 384)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1666, file: !4, line: 3737, baseType: !1323, size: 64, align: 64, offset: 448)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1666, file: !4, line: 3746, baseType: !999, size: 32, align: 32, offset: 512)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1666, file: !4, line: 3757, baseType: !1686, size: 64, align: 64, offset: 576)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64, align: 64)
!1687 = !DISubroutineType(types: !1688)
!1688 = !{null, !1689}
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1690 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1666, file: !4, line: 3766, baseType: !1323, size: 64, align: 64, offset: 640)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1666, file: !4, line: 3774, baseType: !1323, size: 64, align: 64, offset: 704)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1666, file: !4, line: 3780, baseType: !999, size: 32, align: 32, offset: 768)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1666, file: !4, line: 3785, baseType: !999, size: 32, align: 32, offset: 800)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1666, file: !4, line: 3795, baseType: !1696, size: 64, align: 64, offset: 832)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!999, !1275, !1138}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1277, file: !4, line: 2728, baseType: !974, size: 64, align: 64, offset: 5440)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1277, file: !4, line: 2735, baseType: !1418, size: 512, align: 64, offset: 5504)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1277, file: !4, line: 2742, baseType: !999, size: 32, align: 32, offset: 6016)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1277, file: !4, line: 2755, baseType: !999, size: 32, align: 32, offset: 6048)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1277, file: !4, line: 2776, baseType: !999, size: 32, align: 32, offset: 6080)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1277, file: !4, line: 2783, baseType: !999, size: 32, align: 32, offset: 6112)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1277, file: !4, line: 2791, baseType: !999, size: 32, align: 32, offset: 6144)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1277, file: !4, line: 2802, baseType: !1494, size: 64, align: 64, offset: 6208)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1277, file: !4, line: 2811, baseType: !999, size: 32, align: 32, offset: 6272)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1277, file: !4, line: 2821, baseType: !999, size: 32, align: 32, offset: 6304)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1277, file: !4, line: 2830, baseType: !999, size: 32, align: 32, offset: 6336)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1277, file: !4, line: 2840, baseType: !999, size: 32, align: 32, offset: 6368)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1277, file: !4, line: 2851, baseType: !1712, size: 64, align: 64, offset: 6400)
!1712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1713, size: 64, align: 64)
!1713 = !DISubroutineType(types: !1714)
!1714 = !{!999, !1534, !1715, !974, !1476, !999, !999}
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1716 = !DISubroutineType(types: !1717)
!1717 = !{!999, !1534, !974}
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1277, file: !4, line: 2871, baseType: !1719, size: 64, align: 64, offset: 6464)
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64, align: 64)
!1720 = !DISubroutineType(types: !1721)
!1721 = !{!999, !1534, !1722, !974, !1476, !999}
!1722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1723, size: 64, align: 64)
!1723 = !DISubroutineType(types: !1724)
!1724 = !{!999, !1534, !974, !999, !999}
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1277, file: !4, line: 2878, baseType: !999, size: 32, align: 32, offset: 6528)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1277, file: !4, line: 2885, baseType: !999, size: 32, align: 32, offset: 6560)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1277, file: !4, line: 3005, baseType: !999, size: 32, align: 32, offset: 6592)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1277, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1277, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1277, file: !4, line: 3027, baseType: !909, size: 32, align: 32, offset: 6688)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1277, file: !4, line: 3037, baseType: !975, size: 64, align: 64, offset: 6720)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1277, file: !4, line: 3038, baseType: !999, size: 32, align: 32, offset: 6784)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1277, file: !4, line: 3050, baseType: !1307, size: 64, align: 64, offset: 6848)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1277, file: !4, line: 3065, baseType: !999, size: 32, align: 32, offset: 6912)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1277, file: !4, line: 3083, baseType: !999, size: 32, align: 32, offset: 6944)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1277, file: !4, line: 3092, baseType: !1039, size: 64, align: 32, offset: 6976)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1277, file: !4, line: 3099, baseType: !555, size: 32, align: 32, offset: 7040)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1277, file: !4, line: 3106, baseType: !1039, size: 64, align: 32, offset: 7072)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1277, file: !4, line: 3113, baseType: !1740, size: 64, align: 64, offset: 7168)
!1740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1741, size: 64, align: 64)
!1741 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1742)
