; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavdevice--fbdev_enc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavdevice--fbdev_enc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!870 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!871 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!872 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!873 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!874 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!875 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!876 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!877 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!878 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!879 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !554, line: 538, size: 32, align: 32, elements: !880)
!880 = !{!881, !882, !883, !884, !885, !886, !887, !888}
!881 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!882 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!883 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!884 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!885 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!886 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!887 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!888 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "./libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !{!939}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!940 = !{!941, !2132, !2133}
!941 = distinct !DIGlobalVariable(name: "ff_fbdev_muxer", scope: !0, file: !942, line: 208, type: !943, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_fbdev_muxer)
!942 = !DIFile(filename: "libavdevice/fbdev_enc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !945)
!945 = !{!946, !950, !951, !952, !953, !954, !955, !956, !958, !964, !1046, !1048, !1049, !2097, !2098, !2099, !2103, !2107, !2111, !2112, !2117, !2118, !2119, !2120, !2121, !2122, !2126}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !944, file: !919, line: 498, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !944, file: !919, line: 504, baseType: !947, size: 64, align: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !944, file: !919, line: 505, baseType: !947, size: 64, align: 64, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !944, file: !919, line: 506, baseType: !947, size: 64, align: 64, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !944, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !944, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !944, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !944, file: !919, line: 517, baseType: !957, size: 32, align: 32, offset: 352)
!957 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !944, file: !919, line: 523, baseType: !959, size: 64, align: 64, offset: 384)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !919, line: 443, flags: DIFlagFwdDecl)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !944, file: !919, line: 526, baseType: !965, size: 64, align: 64, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !969)
!969 = !{!970, !971, !975, !1005, !1006, !1007, !1008, !1012, !1018, !1020, !1024}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !968, file: !486, line: 72, baseType: !947, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !968, file: !486, line: 78, baseType: !972, size: 64, align: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!947, !939}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !968, file: !486, line: 85, baseType: !976, size: 64, align: 64, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !979)
!979 = !{!980, !981, !982, !983, !984, !1001, !1002, !1003, !1004}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !978, file: !464, line: 247, baseType: !947, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !978, file: !464, line: 253, baseType: !947, size: 64, align: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !978, file: !464, line: 259, baseType: !957, size: 32, align: 32, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !978, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !978, file: !464, line: 271, baseType: !985, size: 64, align: 64, offset: 192)
!985 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !978, file: !464, line: 265, size: 64, align: 64, elements: !986)
!986 = !{!987, !991, !993, !994}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !985, file: !464, line: 266, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !989, line: 40, baseType: !990)
!989 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!990 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !985, file: !464, line: 267, baseType: !992, size: 64, align: 64)
!992 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !985, file: !464, line: 268, baseType: !947, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !985, file: !464, line: 270, baseType: !995, size: 64, align: 32)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !996, line: 61, baseType: !997)
!996 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !996, line: 58, size: 64, align: 32, elements: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !997, file: !996, line: 59, baseType: !957, size: 32, align: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !997, file: !996, line: 60, baseType: !957, size: 32, align: 32, offset: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !978, file: !464, line: 272, baseType: !992, size: 64, align: 64, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !978, file: !464, line: 273, baseType: !992, size: 64, align: 64, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !978, file: !464, line: 275, baseType: !957, size: 32, align: 32, offset: 384)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !978, file: !464, line: 300, baseType: !947, size: 64, align: 64, offset: 448)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !968, file: !486, line: 93, baseType: !957, size: 32, align: 32, offset: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !968, file: !486, line: 99, baseType: !957, size: 32, align: 32, offset: 224)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !968, file: !486, line: 108, baseType: !957, size: 32, align: 32, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !968, file: !486, line: 113, baseType: !1009, size: 64, align: 64, offset: 320)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!939, !939, !939}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !968, file: !486, line: 123, baseType: !1013, size: 64, align: 64, offset: 384)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!1016, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !968, file: !486, line: 130, baseType: !1019, size: 32, align: 32, offset: 448)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !968, file: !486, line: 136, baseType: !1021, size: 64, align: 64, offset: 512)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!1019, !939}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !968, file: !486, line: 142, baseType: !1025, size: 64, align: 64, offset: 576)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!957, !1028, !939, !947, !957}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1031)
!1031 = !{!1032, !1044, !1045}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1030, file: !464, line: 360, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1041, !1042, !1043}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1036, file: !464, line: 307, baseType: !947, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1036, file: !464, line: 313, baseType: !992, size: 64, align: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1036, file: !464, line: 313, baseType: !992, size: 64, align: 64, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1036, file: !464, line: 318, baseType: !992, size: 64, align: 64, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1036, file: !464, line: 318, baseType: !992, size: 64, align: 64, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1036, file: !464, line: 323, baseType: !957, size: 32, align: 32, offset: 320)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1030, file: !464, line: 364, baseType: !957, size: 32, align: 32, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1030, file: !464, line: 368, baseType: !957, size: 32, align: 32, offset: 96)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !944, file: !919, line: 535, baseType: !1047, size: 64, align: 64, offset: 512)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !944, file: !919, line: 539, baseType: !957, size: 32, align: 32, offset: 576)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !944, file: !919, line: 541, baseType: !1050, size: 64, align: 64, offset: 640)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!957, !1053}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1055)
!1055 = !{!1056, !1057, !1184, !1185, !1186, !1253, !1254, !1255, !1971, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2025, !2026, !2027, !2028, !2029, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2060, !2061, !2064, !2065, !2066, !2067, !2068, !2069, !2074, !2075, !2076, !2077, !2085, !2086, !2090, !2094, !2095, !2096}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1054, file: !919, line: 1342, baseType: !965, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1054, file: !919, line: 1349, baseType: !1058, size: 64, align: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1060)
!1060 = !{!1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1085, !1086, !1126, !1127, !1131, !1136, !1137, !1138, !1142, !1161, !1183}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1059, file: !919, line: 638, baseType: !947, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1059, file: !919, line: 645, baseType: !947, size: 64, align: 64, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1059, file: !919, line: 652, baseType: !957, size: 32, align: 32, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1059, file: !919, line: 659, baseType: !947, size: 64, align: 64, offset: 192)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1059, file: !919, line: 661, baseType: !959, size: 64, align: 64, offset: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1059, file: !919, line: 663, baseType: !965, size: 64, align: 64, offset: 320)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1059, file: !919, line: 670, baseType: !947, size: 64, align: 64, offset: 384)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1059, file: !919, line: 679, baseType: !1058, size: 64, align: 64, offset: 448)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1059, file: !919, line: 684, baseType: !957, size: 32, align: 32, offset: 512)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1059, file: !919, line: 689, baseType: !957, size: 32, align: 32, offset: 544)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1059, file: !919, line: 696, baseType: !1072, size: 64, align: 64, offset: 576)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!957, !1075}
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1078)
!1078 = !{!1079, !1080, !1083, !1084}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1077, file: !919, line: 449, baseType: !947, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1077, file: !919, line: 450, baseType: !1081, size: 64, align: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1077, file: !919, line: 451, baseType: !957, size: 32, align: 32, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1077, file: !919, line: 452, baseType: !947, size: 64, align: 64, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1059, file: !919, line: 703, baseType: !1050, size: 64, align: 64, offset: 640)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1059, file: !919, line: 714, baseType: !1087, size: 64, align: 64, offset: 704)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!957, !1053, !1090}
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1093)
!1093 = !{!1094, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1122, !1123, !1124, !1125}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1092, file: !4, line: 1451, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1097, line: 94, baseType: !1098)
!1097 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1097, line: 81, size: 192, align: 64, elements: !1099)
!1099 = !{!1100, !1104, !1107}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1098, file: !1097, line: 82, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1097, line: 73, baseType: !1103)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1097, line: 73, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1098, file: !1097, line: 89, baseType: !1105, size: 64, align: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !989, line: 48, baseType: !1082)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1098, file: !1097, line: 93, baseType: !957, size: 32, align: 32, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1092, file: !4, line: 1461, baseType: !988, size: 64, align: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1092, file: !4, line: 1467, baseType: !988, size: 64, align: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1092, file: !4, line: 1468, baseType: !1105, size: 64, align: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1092, file: !4, line: 1469, baseType: !957, size: 32, align: 32, offset: 256)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1092, file: !4, line: 1470, baseType: !957, size: 32, align: 32, offset: 288)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1092, file: !4, line: 1474, baseType: !957, size: 32, align: 32, offset: 320)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1092, file: !4, line: 1479, baseType: !1115, size: 64, align: 64, offset: 384)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1118)
!1118 = !{!1119, !1120, !1121}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1117, file: !4, line: 1412, baseType: !1105, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1117, file: !4, line: 1413, baseType: !957, size: 32, align: 32, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1117, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1092, file: !4, line: 1480, baseType: !957, size: 32, align: 32, offset: 448)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1092, file: !4, line: 1486, baseType: !988, size: 64, align: 64, offset: 512)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1092, file: !4, line: 1488, baseType: !988, size: 64, align: 64, offset: 576)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1092, file: !4, line: 1497, baseType: !988, size: 64, align: 64, offset: 640)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1059, file: !919, line: 720, baseType: !1050, size: 64, align: 64, offset: 768)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1059, file: !919, line: 730, baseType: !1128, size: 64, align: 64, offset: 832)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!957, !1053, !957, !988, !957}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1059, file: !919, line: 737, baseType: !1132, size: 64, align: 64, offset: 896)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!988, !1053, !957, !1135, !988}
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1059, file: !919, line: 744, baseType: !1050, size: 64, align: 64, offset: 960)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1059, file: !919, line: 750, baseType: !1050, size: 64, align: 64, offset: 1024)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1059, file: !919, line: 758, baseType: !1139, size: 64, align: 64, offset: 1088)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!957, !1053, !957, !988, !988, !988, !957}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1059, file: !919, line: 764, baseType: !1143, size: 64, align: 64, offset: 1152)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!957, !1053, !1146}
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !1148, line: 460, size: 128, align: 64, elements: !1149)
!1148 = !DIFile(filename: "libavdevice/avdevice.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1149 = !{!1150, !1159, !1160}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "devices", scope: !1147, file: !1148, line: 461, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDeviceInfo", file: !1148, line: 455, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfo", file: !1148, line: 452, size: 128, align: 64, elements: !1155)
!1155 = !{!1156, !1158}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "device_name", scope: !1154, file: !1148, line: 453, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "device_description", scope: !1154, file: !1148, line: 454, baseType: !1157, size: 64, align: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_devices", scope: !1147, file: !1148, line: 462, baseType: !957, size: 32, align: 32, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "default_device", scope: !1147, file: !1148, line: 463, baseType: !957, size: 32, align: 32, offset: 96)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1059, file: !919, line: 770, baseType: !1162, size: 64, align: 64, offset: 1216)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!957, !1053, !1165}
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !1148, line: 400, size: 576, align: 64, elements: !1167)
!1167 = !{!1168, !1169, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1166, file: !1148, line: 401, baseType: !965, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "device_context", scope: !1166, file: !1148, line: 402, baseType: !1170, size: 64, align: 64, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !919, line: 1947, baseType: !1054)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1166, file: !1148, line: 403, baseType: !3, size: 32, align: 32, offset: 128)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "sample_format", scope: !1166, file: !1148, line: 404, baseType: !536, size: 32, align: 32, offset: 160)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_format", scope: !1166, file: !1148, line: 405, baseType: !553, size: 32, align: 32, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1166, file: !1148, line: 406, baseType: !957, size: 32, align: 32, offset: 224)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1166, file: !1148, line: 407, baseType: !957, size: 32, align: 32, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1166, file: !1148, line: 408, baseType: !988, size: 64, align: 64, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "window_width", scope: !1166, file: !1148, line: 409, baseType: !957, size: 32, align: 32, offset: 384)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "window_height", scope: !1166, file: !1148, line: 410, baseType: !957, size: 32, align: 32, offset: 416)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !1166, file: !1148, line: 411, baseType: !957, size: 32, align: 32, offset: 448)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !1166, file: !1148, line: 412, baseType: !957, size: 32, align: 32, offset: 480)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "fps", scope: !1166, file: !1148, line: 413, baseType: !995, size: 64, align: 32, offset: 512)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1059, file: !919, line: 776, baseType: !1162, size: 64, align: 64, offset: 1280)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1054, file: !919, line: 1356, baseType: !1047, size: 64, align: 64, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1054, file: !919, line: 1365, baseType: !939, size: 64, align: 64, offset: 192)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1054, file: !919, line: 1379, baseType: !1187, size: 64, align: 64, offset: 256)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !754, line: 352, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !754, line: 161, size: 2112, align: 64, elements: !1190)
!1190 = !{!1191, !1192, !1193, !1194, !1195, !1196, !1197, !1201, !1202, !1206, !1207, !1208, !1209, !1210, !1212, !1213, !1220, !1221, !1225, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1243, !1244, !1245, !1246, !1250, !1251, !1252}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1189, file: !754, line: 174, baseType: !965, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1189, file: !754, line: 226, baseType: !1081, size: 64, align: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1189, file: !754, line: 227, baseType: !957, size: 32, align: 32, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1189, file: !754, line: 228, baseType: !1081, size: 64, align: 64, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1189, file: !754, line: 229, baseType: !1081, size: 64, align: 64, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1189, file: !754, line: 233, baseType: !939, size: 64, align: 64, offset: 320)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1189, file: !754, line: 235, baseType: !1198, size: 64, align: 64, offset: 384)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!957, !939, !1105, !957}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1189, file: !754, line: 236, baseType: !1198, size: 64, align: 64, offset: 448)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1189, file: !754, line: 237, baseType: !1203, size: 64, align: 64, offset: 512)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!988, !939, !988, !957}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1189, file: !754, line: 238, baseType: !988, size: 64, align: 64, offset: 576)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1189, file: !754, line: 239, baseType: !957, size: 32, align: 32, offset: 640)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1189, file: !754, line: 240, baseType: !957, size: 32, align: 32, offset: 672)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1189, file: !754, line: 241, baseType: !957, size: 32, align: 32, offset: 704)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1189, file: !754, line: 242, baseType: !1211, size: 64, align: 64, offset: 768)
!1211 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1189, file: !754, line: 243, baseType: !1081, size: 64, align: 64, offset: 832)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1189, file: !754, line: 244, baseType: !1214, size: 64, align: 64, offset: 896)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!1211, !1211, !1217, !1219}
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1106)
!1219 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1189, file: !754, line: 245, baseType: !957, size: 32, align: 32, offset: 960)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1189, file: !754, line: 249, baseType: !1222, size: 64, align: 64, offset: 1024)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!957, !939, !957}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1189, file: !754, line: 255, baseType: !1226, size: 64, align: 64, offset: 1088)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!988, !939, !957, !988, !957}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1189, file: !754, line: 260, baseType: !957, size: 32, align: 32, offset: 1152)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1189, file: !754, line: 266, baseType: !988, size: 64, align: 64, offset: 1216)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1189, file: !754, line: 273, baseType: !957, size: 32, align: 32, offset: 1280)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1189, file: !754, line: 279, baseType: !988, size: 64, align: 64, offset: 1344)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1189, file: !754, line: 285, baseType: !957, size: 32, align: 32, offset: 1408)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1189, file: !754, line: 291, baseType: !957, size: 32, align: 32, offset: 1440)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1189, file: !754, line: 298, baseType: !957, size: 32, align: 32, offset: 1472)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1189, file: !754, line: 304, baseType: !957, size: 32, align: 32, offset: 1504)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1189, file: !754, line: 309, baseType: !947, size: 64, align: 64, offset: 1536)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1189, file: !754, line: 314, baseType: !947, size: 64, align: 64, offset: 1600)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1189, file: !754, line: 319, baseType: !1240, size: 64, align: 64, offset: 1664)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!957, !939, !1105, !957, !753, !988}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1189, file: !754, line: 326, baseType: !957, size: 32, align: 32, offset: 1728)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1189, file: !754, line: 331, baseType: !753, size: 32, align: 32, offset: 1760)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1189, file: !754, line: 332, baseType: !988, size: 64, align: 64, offset: 1792)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1189, file: !754, line: 338, baseType: !1247, size: 64, align: 64, offset: 1856)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!957, !939}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1189, file: !754, line: 340, baseType: !988, size: 64, align: 64, offset: 1920)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1189, file: !754, line: 346, baseType: !1081, size: 64, align: 64, offset: 1984)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1189, file: !754, line: 351, baseType: !957, size: 32, align: 32, offset: 2048)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1054, file: !919, line: 1386, baseType: !957, size: 32, align: 32, offset: 320)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1054, file: !919, line: 1393, baseType: !1219, size: 32, align: 32, offset: 352)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1054, file: !919, line: 1405, baseType: !1256, size: 64, align: 64, offset: 384)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1259)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1260)
!1260 = !{!1261, !1262, !1263, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1819, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1919, !1925, !1926, !1930, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1962, !1963, !1964, !1965, !1966, !1967}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1259, file: !919, line: 866, baseType: !957, size: 32, align: 32)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1259, file: !919, line: 872, baseType: !957, size: 32, align: 32, offset: 32)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1259, file: !919, line: 878, baseType: !1264, size: 64, align: 64, offset: 64)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1266)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1267)
!1267 = !{!1268, !1269, !1270, !1271, !1494, !1495, !1496, !1497, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1523, !1527, !1528, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1707, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1266, file: !4, line: 1561, baseType: !965, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1266, file: !4, line: 1562, baseType: !957, size: 32, align: 32, offset: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1266, file: !4, line: 1564, baseType: !762, size: 32, align: 32, offset: 96)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1266, file: !4, line: 1565, baseType: !1272, size: 64, align: 64, offset: 128)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1275)
!1275 = !{!1276, !1277, !1278, !1279, !1280, !1281, !1284, !1287, !1290, !1293, !1297, !1298, !1299, !1307, !1308, !1309, !1311, !1315, !1321, !1326, !1330, !1331, !1378, !1465, !1469, !1470, !1474, !1478, !1483, !1487, !1488, !1489}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1274, file: !4, line: 3475, baseType: !947, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1274, file: !4, line: 3480, baseType: !947, size: 64, align: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1274, file: !4, line: 3481, baseType: !762, size: 32, align: 32, offset: 128)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1274, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1274, file: !4, line: 3487, baseType: !957, size: 32, align: 32, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1274, file: !4, line: 3488, baseType: !1282, size: 64, align: 64, offset: 256)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1274, file: !4, line: 3489, baseType: !1285, size: 64, align: 64, offset: 320)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !553)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1274, file: !4, line: 3490, baseType: !1288, size: 64, align: 64, offset: 384)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1274, file: !4, line: 3491, baseType: !1291, size: 64, align: 64, offset: 448)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1274, file: !4, line: 3492, baseType: !1294, size: 64, align: 64, offset: 512)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1296)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !989, line: 55, baseType: !1211)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1274, file: !4, line: 3493, baseType: !1106, size: 8, align: 8, offset: 576)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1274, file: !4, line: 3494, baseType: !965, size: 64, align: 64, offset: 640)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1274, file: !4, line: 3495, baseType: !1300, size: 64, align: 64, offset: 704)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1302)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1304)
!1304 = !{!1305, !1306}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1303, file: !4, line: 3402, baseType: !957, size: 32, align: 32)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1303, file: !4, line: 3403, baseType: !947, size: 64, align: 64, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1274, file: !4, line: 3507, baseType: !947, size: 64, align: 64, offset: 768)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1274, file: !4, line: 3516, baseType: !957, size: 32, align: 32, offset: 832)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1274, file: !4, line: 3517, baseType: !1310, size: 64, align: 64, offset: 896)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1274, file: !4, line: 3527, baseType: !1312, size: 64, align: 64, offset: 960)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!957, !1264}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1274, file: !4, line: 3535, baseType: !1316, size: 64, align: 64, offset: 1024)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{!957, !1264, !1319}
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1265)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1274, file: !4, line: 3541, baseType: !1322, size: 64, align: 64, offset: 1088)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1324)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1325)
!1325 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1274, file: !4, line: 3549, baseType: !1327, size: 64, align: 64, offset: 1152)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{null, !1310}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1274, file: !4, line: 3551, baseType: !1312, size: 64, align: 64, offset: 1216)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1274, file: !4, line: 3552, baseType: !1332, size: 64, align: 64, offset: 1280)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!957, !1264, !1105, !957, !1335}
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1337)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1338)
!1338 = !{!1339, !1342, !1344, !1345, !1346, !1377}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1337, file: !4, line: 3921, baseType: !1340, size: 16, align: 16)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !989, line: 49, baseType: !1341)
!1341 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1337, file: !4, line: 3922, baseType: !1343, size: 32, align: 32, offset: 32)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !989, line: 51, baseType: !1219)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1337, file: !4, line: 3923, baseType: !1343, size: 32, align: 32, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1337, file: !4, line: 3924, baseType: !1219, size: 32, align: 32, offset: 96)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1337, file: !4, line: 3925, baseType: !1347, size: 64, align: 64, offset: 128)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1350)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1351)
!1351 = !{!1352, !1353, !1354, !1355, !1356, !1357, !1367, !1371, !1373, !1374, !1375, !1376}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1350, file: !4, line: 3886, baseType: !957, size: 32, align: 32)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1350, file: !4, line: 3887, baseType: !957, size: 32, align: 32, offset: 32)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1350, file: !4, line: 3888, baseType: !957, size: 32, align: 32, offset: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1350, file: !4, line: 3889, baseType: !957, size: 32, align: 32, offset: 96)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1350, file: !4, line: 3890, baseType: !957, size: 32, align: 32, offset: 128)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1350, file: !4, line: 3897, baseType: !1358, size: 768, align: 64, offset: 192)
!1358 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1359)
!1359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1360)
!1360 = !{!1361, !1365}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1359, file: !4, line: 3855, baseType: !1362, size: 512, align: 64)
!1362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1105, size: 512, align: 64, elements: !1363)
!1363 = !{!1364}
!1364 = !DISubrange(count: 8)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1359, file: !4, line: 3857, baseType: !1366, size: 256, align: 32, offset: 512)
!1366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 256, align: 32, elements: !1363)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1350, file: !4, line: 3903, baseType: !1368, size: 256, align: 64, offset: 960)
!1368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1105, size: 256, align: 64, elements: !1369)
!1369 = !{!1370}
!1370 = !DISubrange(count: 4)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1350, file: !4, line: 3904, baseType: !1372, size: 128, align: 32, offset: 1216)
!1372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 128, align: 32, elements: !1369)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1350, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1350, file: !4, line: 3908, baseType: !1157, size: 64, align: 64, offset: 1408)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1350, file: !4, line: 3915, baseType: !1157, size: 64, align: 64, offset: 1472)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1350, file: !4, line: 3917, baseType: !957, size: 32, align: 32, offset: 1536)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1337, file: !4, line: 3926, baseType: !988, size: 64, align: 64, offset: 192)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1274, file: !4, line: 3564, baseType: !1379, size: 64, align: 64, offset: 1344)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DISubroutineType(types: !1381)
!1381 = !{!957, !1264, !1090, !1382, !1464}
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1384)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1385)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1386)
!1386 = !{!1387, !1388, !1389, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1416, !1418, !1419, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1452, !1453, !1454, !1455, !1456, !1457, !1460, !1461, !1462, !1463}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1385, file: !789, line: 282, baseType: !1362, size: 512, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1385, file: !789, line: 299, baseType: !1366, size: 256, align: 32, offset: 512)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1385, file: !789, line: 315, baseType: !1390, size: 64, align: 64, offset: 768)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1385, file: !789, line: 326, baseType: !957, size: 32, align: 32, offset: 832)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1385, file: !789, line: 326, baseType: !957, size: 32, align: 32, offset: 864)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1385, file: !789, line: 334, baseType: !957, size: 32, align: 32, offset: 896)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1385, file: !789, line: 341, baseType: !957, size: 32, align: 32, offset: 928)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1385, file: !789, line: 346, baseType: !957, size: 32, align: 32, offset: 960)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1385, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1385, file: !789, line: 356, baseType: !995, size: 64, align: 32, offset: 1024)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1385, file: !789, line: 361, baseType: !988, size: 64, align: 64, offset: 1088)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1385, file: !789, line: 369, baseType: !988, size: 64, align: 64, offset: 1152)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1385, file: !789, line: 377, baseType: !988, size: 64, align: 64, offset: 1216)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1385, file: !789, line: 382, baseType: !957, size: 32, align: 32, offset: 1280)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1385, file: !789, line: 386, baseType: !957, size: 32, align: 32, offset: 1312)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1385, file: !789, line: 391, baseType: !957, size: 32, align: 32, offset: 1344)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1385, file: !789, line: 396, baseType: !939, size: 64, align: 64, offset: 1408)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1385, file: !789, line: 403, baseType: !1406, size: 512, align: 64, offset: 1472)
!1406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1296, size: 512, align: 64, elements: !1363)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1385, file: !789, line: 410, baseType: !957, size: 32, align: 32, offset: 1984)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1385, file: !789, line: 415, baseType: !957, size: 32, align: 32, offset: 2016)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1385, file: !789, line: 420, baseType: !957, size: 32, align: 32, offset: 2048)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1385, file: !789, line: 425, baseType: !957, size: 32, align: 32, offset: 2080)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1385, file: !789, line: 435, baseType: !988, size: 64, align: 64, offset: 2112)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1385, file: !789, line: 440, baseType: !957, size: 32, align: 32, offset: 2176)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1385, file: !789, line: 445, baseType: !1296, size: 64, align: 64, offset: 2240)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1385, file: !789, line: 459, baseType: !1415, size: 512, align: 64, offset: 2304)
!1415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1095, size: 512, align: 64, elements: !1363)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1385, file: !789, line: 473, baseType: !1417, size: 64, align: 64, offset: 2816)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1385, file: !789, line: 477, baseType: !957, size: 32, align: 32, offset: 2880)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1385, file: !789, line: 479, baseType: !1420, size: 64, align: 64, offset: 2944)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1423)
!1423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1424)
!1424 = !{!1425, !1426, !1427, !1428, !1433}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1423, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1423, file: !789, line: 203, baseType: !1105, size: 64, align: 64, offset: 64)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1423, file: !789, line: 204, baseType: !957, size: 32, align: 32, offset: 128)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1423, file: !789, line: 205, baseType: !1429, size: 64, align: 64, offset: 192)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1431, line: 86, baseType: !1432)
!1431 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1432 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1431, line: 86, flags: DIFlagFwdDecl)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1423, file: !789, line: 206, baseType: !1095, size: 64, align: 64, offset: 256)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1385, file: !789, line: 480, baseType: !957, size: 32, align: 32, offset: 3008)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1385, file: !789, line: 505, baseType: !957, size: 32, align: 32, offset: 3040)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1385, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1385, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1385, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1385, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1385, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1385, file: !789, line: 532, baseType: !988, size: 64, align: 64, offset: 3264)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1385, file: !789, line: 539, baseType: !988, size: 64, align: 64, offset: 3328)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1385, file: !789, line: 547, baseType: !988, size: 64, align: 64, offset: 3392)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1385, file: !789, line: 554, baseType: !1429, size: 64, align: 64, offset: 3456)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1385, file: !789, line: 563, baseType: !957, size: 32, align: 32, offset: 3520)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1385, file: !789, line: 572, baseType: !957, size: 32, align: 32, offset: 3552)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1385, file: !789, line: 581, baseType: !957, size: 32, align: 32, offset: 3584)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1385, file: !789, line: 588, baseType: !1449, size: 64, align: 64, offset: 3648)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !989, line: 36, baseType: !1451)
!1451 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1385, file: !789, line: 593, baseType: !957, size: 32, align: 32, offset: 3712)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1385, file: !789, line: 596, baseType: !957, size: 32, align: 32, offset: 3744)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1385, file: !789, line: 599, baseType: !1095, size: 64, align: 64, offset: 3776)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1385, file: !789, line: 605, baseType: !1095, size: 64, align: 64, offset: 3840)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1385, file: !789, line: 616, baseType: !1095, size: 64, align: 64, offset: 3904)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1385, file: !789, line: 626, baseType: !1458, size: 64, align: 64, offset: 3968)
!1458 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1459, line: 216, baseType: !1211)
!1459 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1385, file: !789, line: 627, baseType: !1458, size: 64, align: 64, offset: 4032)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1385, file: !789, line: 628, baseType: !1458, size: 64, align: 64, offset: 4096)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1385, file: !789, line: 629, baseType: !1458, size: 64, align: 64, offset: 4160)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1385, file: !789, line: 645, baseType: !1095, size: 64, align: 64, offset: 4224)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1274, file: !4, line: 3566, baseType: !1466, size: 64, align: 64, offset: 1408)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{!957, !1264, !939, !1464, !1090}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1274, file: !4, line: 3567, baseType: !1312, size: 64, align: 64, offset: 1472)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1274, file: !4, line: 3576, baseType: !1471, size: 64, align: 64, offset: 1536)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{!957, !1264, !1382}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1274, file: !4, line: 3577, baseType: !1475, size: 64, align: 64, offset: 1600)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!957, !1264, !1090}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1274, file: !4, line: 3584, baseType: !1479, size: 64, align: 64, offset: 1664)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{!957, !1264, !1482}
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1274, file: !4, line: 3589, baseType: !1484, size: 64, align: 64, offset: 1728)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{null, !1264}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1274, file: !4, line: 3594, baseType: !957, size: 32, align: 32, offset: 1792)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1274, file: !4, line: 3600, baseType: !947, size: 64, align: 64, offset: 1856)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1274, file: !4, line: 3609, baseType: !1490, size: 64, align: 64, offset: 1920)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1493)
!1493 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1266, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1266, file: !4, line: 1581, baseType: !1219, size: 32, align: 32, offset: 224)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1266, file: !4, line: 1583, baseType: !939, size: 64, align: 64, offset: 256)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1266, file: !4, line: 1591, baseType: !1498, size: 64, align: 64, offset: 320)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1266, file: !4, line: 1598, baseType: !939, size: 64, align: 64, offset: 384)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1266, file: !4, line: 1606, baseType: !988, size: 64, align: 64, offset: 448)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1266, file: !4, line: 1614, baseType: !957, size: 32, align: 32, offset: 512)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1266, file: !4, line: 1622, baseType: !957, size: 32, align: 32, offset: 544)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1266, file: !4, line: 1628, baseType: !957, size: 32, align: 32, offset: 576)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1266, file: !4, line: 1636, baseType: !957, size: 32, align: 32, offset: 608)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1266, file: !4, line: 1643, baseType: !957, size: 32, align: 32, offset: 640)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1266, file: !4, line: 1657, baseType: !1105, size: 64, align: 64, offset: 704)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1266, file: !4, line: 1658, baseType: !957, size: 32, align: 32, offset: 768)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1266, file: !4, line: 1679, baseType: !995, size: 64, align: 32, offset: 800)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1266, file: !4, line: 1688, baseType: !957, size: 32, align: 32, offset: 864)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1266, file: !4, line: 1712, baseType: !957, size: 32, align: 32, offset: 896)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1266, file: !4, line: 1729, baseType: !957, size: 32, align: 32, offset: 928)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1266, file: !4, line: 1729, baseType: !957, size: 32, align: 32, offset: 960)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1266, file: !4, line: 1744, baseType: !957, size: 32, align: 32, offset: 992)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1266, file: !4, line: 1744, baseType: !957, size: 32, align: 32, offset: 1024)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1266, file: !4, line: 1751, baseType: !957, size: 32, align: 32, offset: 1056)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1266, file: !4, line: 1766, baseType: !553, size: 32, align: 32, offset: 1088)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1266, file: !4, line: 1791, baseType: !1519, size: 64, align: 64, offset: 1152)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DISubroutineType(types: !1521)
!1521 = !{null, !1522, !1382, !1464, !957, !957, !957}
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1266, file: !4, line: 1808, baseType: !1524, size: 64, align: 64, offset: 1216)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DISubroutineType(types: !1526)
!1526 = !{!553, !1522, !1285}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1266, file: !4, line: 1816, baseType: !957, size: 32, align: 32, offset: 1280)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1266, file: !4, line: 1825, baseType: !1529, size: 32, align: 32, offset: 1312)
!1529 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1266, file: !4, line: 1830, baseType: !957, size: 32, align: 32, offset: 1344)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1266, file: !4, line: 1838, baseType: !1529, size: 32, align: 32, offset: 1376)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1266, file: !4, line: 1846, baseType: !957, size: 32, align: 32, offset: 1408)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1266, file: !4, line: 1851, baseType: !957, size: 32, align: 32, offset: 1440)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1266, file: !4, line: 1861, baseType: !1529, size: 32, align: 32, offset: 1472)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1266, file: !4, line: 1868, baseType: !1529, size: 32, align: 32, offset: 1504)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1266, file: !4, line: 1875, baseType: !1529, size: 32, align: 32, offset: 1536)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1266, file: !4, line: 1882, baseType: !1529, size: 32, align: 32, offset: 1568)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1266, file: !4, line: 1889, baseType: !1529, size: 32, align: 32, offset: 1600)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1266, file: !4, line: 1896, baseType: !1529, size: 32, align: 32, offset: 1632)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1266, file: !4, line: 1903, baseType: !1529, size: 32, align: 32, offset: 1664)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1266, file: !4, line: 1910, baseType: !957, size: 32, align: 32, offset: 1696)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1266, file: !4, line: 1915, baseType: !957, size: 32, align: 32, offset: 1728)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1266, file: !4, line: 1926, baseType: !1464, size: 64, align: 64, offset: 1792)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1266, file: !4, line: 1935, baseType: !995, size: 64, align: 32, offset: 1856)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1266, file: !4, line: 1942, baseType: !957, size: 32, align: 32, offset: 1920)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1266, file: !4, line: 1948, baseType: !957, size: 32, align: 32, offset: 1952)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1266, file: !4, line: 1954, baseType: !957, size: 32, align: 32, offset: 1984)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1266, file: !4, line: 1960, baseType: !957, size: 32, align: 32, offset: 2016)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1266, file: !4, line: 1984, baseType: !957, size: 32, align: 32, offset: 2048)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1266, file: !4, line: 1991, baseType: !957, size: 32, align: 32, offset: 2080)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1266, file: !4, line: 1996, baseType: !957, size: 32, align: 32, offset: 2112)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1266, file: !4, line: 2004, baseType: !957, size: 32, align: 32, offset: 2144)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1266, file: !4, line: 2011, baseType: !957, size: 32, align: 32, offset: 2176)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1266, file: !4, line: 2018, baseType: !957, size: 32, align: 32, offset: 2208)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1266, file: !4, line: 2027, baseType: !957, size: 32, align: 32, offset: 2240)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1266, file: !4, line: 2034, baseType: !957, size: 32, align: 32, offset: 2272)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1266, file: !4, line: 2044, baseType: !957, size: 32, align: 32, offset: 2304)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1266, file: !4, line: 2054, baseType: !1559, size: 64, align: 64, offset: 2368)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1266, file: !4, line: 2061, baseType: !1559, size: 64, align: 64, offset: 2432)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1266, file: !4, line: 2066, baseType: !957, size: 32, align: 32, offset: 2496)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1266, file: !4, line: 2070, baseType: !957, size: 32, align: 32, offset: 2528)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1266, file: !4, line: 2078, baseType: !957, size: 32, align: 32, offset: 2560)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1266, file: !4, line: 2085, baseType: !957, size: 32, align: 32, offset: 2592)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1266, file: !4, line: 2092, baseType: !957, size: 32, align: 32, offset: 2624)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1266, file: !4, line: 2099, baseType: !957, size: 32, align: 32, offset: 2656)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1266, file: !4, line: 2106, baseType: !957, size: 32, align: 32, offset: 2688)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1266, file: !4, line: 2113, baseType: !957, size: 32, align: 32, offset: 2720)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1266, file: !4, line: 2120, baseType: !957, size: 32, align: 32, offset: 2752)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1266, file: !4, line: 2125, baseType: !957, size: 32, align: 32, offset: 2784)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1266, file: !4, line: 2133, baseType: !957, size: 32, align: 32, offset: 2816)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1266, file: !4, line: 2140, baseType: !957, size: 32, align: 32, offset: 2848)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1266, file: !4, line: 2145, baseType: !957, size: 32, align: 32, offset: 2880)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1266, file: !4, line: 2153, baseType: !957, size: 32, align: 32, offset: 2912)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1266, file: !4, line: 2158, baseType: !957, size: 32, align: 32, offset: 2944)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1266, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1266, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1266, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1266, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1266, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1266, file: !4, line: 2203, baseType: !957, size: 32, align: 32, offset: 3136)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1266, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1266, file: !4, line: 2212, baseType: !957, size: 32, align: 32, offset: 3200)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1266, file: !4, line: 2213, baseType: !957, size: 32, align: 32, offset: 3232)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1266, file: !4, line: 2220, baseType: !536, size: 32, align: 32, offset: 3264)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1266, file: !4, line: 2232, baseType: !957, size: 32, align: 32, offset: 3296)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1266, file: !4, line: 2243, baseType: !957, size: 32, align: 32, offset: 3328)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1266, file: !4, line: 2249, baseType: !957, size: 32, align: 32, offset: 3360)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1266, file: !4, line: 2256, baseType: !957, size: 32, align: 32, offset: 3392)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1266, file: !4, line: 2263, baseType: !1296, size: 64, align: 64, offset: 3456)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1266, file: !4, line: 2270, baseType: !1296, size: 64, align: 64, offset: 3520)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1266, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1266, file: !4, line: 2285, baseType: !536, size: 32, align: 32, offset: 3616)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1266, file: !4, line: 2367, baseType: !1595, size: 64, align: 64, offset: 3648)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64, align: 64)
!1596 = !DISubroutineType(types: !1597)
!1597 = !{!957, !1522, !1482, !957}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1266, file: !4, line: 2383, baseType: !957, size: 32, align: 32, offset: 3712)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1266, file: !4, line: 2386, baseType: !1529, size: 32, align: 32, offset: 3744)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1266, file: !4, line: 2387, baseType: !1529, size: 32, align: 32, offset: 3776)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1266, file: !4, line: 2394, baseType: !957, size: 32, align: 32, offset: 3808)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1266, file: !4, line: 2401, baseType: !957, size: 32, align: 32, offset: 3840)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1266, file: !4, line: 2408, baseType: !957, size: 32, align: 32, offset: 3872)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1266, file: !4, line: 2415, baseType: !957, size: 32, align: 32, offset: 3904)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1266, file: !4, line: 2422, baseType: !957, size: 32, align: 32, offset: 3936)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1266, file: !4, line: 2423, baseType: !1607, size: 64, align: 64, offset: 3968)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1609)
!1609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1610)
!1610 = !{!1611, !1612, !1613, !1614}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1609, file: !4, line: 827, baseType: !957, size: 32, align: 32)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1609, file: !4, line: 828, baseType: !957, size: 32, align: 32, offset: 32)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1609, file: !4, line: 829, baseType: !957, size: 32, align: 32, offset: 64)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1609, file: !4, line: 830, baseType: !1529, size: 32, align: 32, offset: 96)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1266, file: !4, line: 2430, baseType: !988, size: 64, align: 64, offset: 4032)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1266, file: !4, line: 2437, baseType: !988, size: 64, align: 64, offset: 4096)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1266, file: !4, line: 2444, baseType: !1529, size: 32, align: 32, offset: 4160)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1266, file: !4, line: 2451, baseType: !1529, size: 32, align: 32, offset: 4192)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1266, file: !4, line: 2458, baseType: !957, size: 32, align: 32, offset: 4224)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1266, file: !4, line: 2469, baseType: !957, size: 32, align: 32, offset: 4256)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1266, file: !4, line: 2475, baseType: !957, size: 32, align: 32, offset: 4288)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1266, file: !4, line: 2481, baseType: !957, size: 32, align: 32, offset: 4320)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1266, file: !4, line: 2485, baseType: !957, size: 32, align: 32, offset: 4352)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1266, file: !4, line: 2489, baseType: !957, size: 32, align: 32, offset: 4384)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1266, file: !4, line: 2493, baseType: !957, size: 32, align: 32, offset: 4416)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1266, file: !4, line: 2501, baseType: !957, size: 32, align: 32, offset: 4448)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1266, file: !4, line: 2506, baseType: !957, size: 32, align: 32, offset: 4480)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1266, file: !4, line: 2510, baseType: !957, size: 32, align: 32, offset: 4512)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1266, file: !4, line: 2514, baseType: !988, size: 64, align: 64, offset: 4544)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1266, file: !4, line: 2528, baseType: !1631, size: 64, align: 64, offset: 4608)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64, align: 64)
!1632 = !DISubroutineType(types: !1633)
!1633 = !{null, !1522, !939, !957, !957}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1266, file: !4, line: 2534, baseType: !957, size: 32, align: 32, offset: 4672)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1266, file: !4, line: 2545, baseType: !957, size: 32, align: 32, offset: 4704)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1266, file: !4, line: 2547, baseType: !957, size: 32, align: 32, offset: 4736)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1266, file: !4, line: 2549, baseType: !957, size: 32, align: 32, offset: 4768)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1266, file: !4, line: 2551, baseType: !957, size: 32, align: 32, offset: 4800)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1266, file: !4, line: 2553, baseType: !957, size: 32, align: 32, offset: 4832)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1266, file: !4, line: 2555, baseType: !957, size: 32, align: 32, offset: 4864)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1266, file: !4, line: 2557, baseType: !957, size: 32, align: 32, offset: 4896)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1266, file: !4, line: 2559, baseType: !957, size: 32, align: 32, offset: 4928)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1266, file: !4, line: 2563, baseType: !957, size: 32, align: 32, offset: 4960)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1266, file: !4, line: 2571, baseType: !1157, size: 64, align: 64, offset: 4992)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1266, file: !4, line: 2579, baseType: !1157, size: 64, align: 64, offset: 5056)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1266, file: !4, line: 2586, baseType: !957, size: 32, align: 32, offset: 5120)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1266, file: !4, line: 2615, baseType: !957, size: 32, align: 32, offset: 5152)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1266, file: !4, line: 2627, baseType: !957, size: 32, align: 32, offset: 5184)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1266, file: !4, line: 2637, baseType: !957, size: 32, align: 32, offset: 5216)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1266, file: !4, line: 2681, baseType: !957, size: 32, align: 32, offset: 5248)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1266, file: !4, line: 2709, baseType: !988, size: 64, align: 64, offset: 5312)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1266, file: !4, line: 2716, baseType: !1653, size: 64, align: 64, offset: 5376)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1655)
!1655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1656)
!1656 = !{!1657, !1658, !1659, !1660, !1661, !1662, !1663, !1667, !1671, !1672, !1673, !1674, !1680, !1681, !1682, !1683, !1684}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1655, file: !4, line: 3642, baseType: !947, size: 64, align: 64)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1655, file: !4, line: 3649, baseType: !762, size: 32, align: 32, offset: 64)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1655, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1655, file: !4, line: 3663, baseType: !553, size: 32, align: 32, offset: 128)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1655, file: !4, line: 3669, baseType: !957, size: 32, align: 32, offset: 160)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1655, file: !4, line: 3682, baseType: !1479, size: 64, align: 64, offset: 192)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1655, file: !4, line: 3698, baseType: !1664, size: 64, align: 64, offset: 256)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DISubroutineType(types: !1666)
!1666 = !{!957, !1264, !1217, !1343}
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1655, file: !4, line: 3712, baseType: !1668, size: 64, align: 64, offset: 320)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{!957, !1264, !957, !1217, !1343}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1655, file: !4, line: 3726, baseType: !1664, size: 64, align: 64, offset: 384)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1655, file: !4, line: 3737, baseType: !1312, size: 64, align: 64, offset: 448)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1655, file: !4, line: 3746, baseType: !957, size: 32, align: 32, offset: 512)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1655, file: !4, line: 3757, baseType: !1675, size: 64, align: 64, offset: 576)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DISubroutineType(types: !1677)
!1677 = !{null, !1678}
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1655, file: !4, line: 3766, baseType: !1312, size: 64, align: 64, offset: 640)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1655, file: !4, line: 3774, baseType: !1312, size: 64, align: 64, offset: 704)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1655, file: !4, line: 3780, baseType: !957, size: 32, align: 32, offset: 768)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1655, file: !4, line: 3785, baseType: !957, size: 32, align: 32, offset: 800)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1655, file: !4, line: 3795, baseType: !1685, size: 64, align: 64, offset: 832)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DISubroutineType(types: !1687)
!1687 = !{!957, !1264, !1095}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1266, file: !4, line: 2728, baseType: !939, size: 64, align: 64, offset: 5440)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1266, file: !4, line: 2735, baseType: !1406, size: 512, align: 64, offset: 5504)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1266, file: !4, line: 2742, baseType: !957, size: 32, align: 32, offset: 6016)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1266, file: !4, line: 2755, baseType: !957, size: 32, align: 32, offset: 6048)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1266, file: !4, line: 2776, baseType: !957, size: 32, align: 32, offset: 6080)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1266, file: !4, line: 2783, baseType: !957, size: 32, align: 32, offset: 6112)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1266, file: !4, line: 2791, baseType: !957, size: 32, align: 32, offset: 6144)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1266, file: !4, line: 2802, baseType: !1482, size: 64, align: 64, offset: 6208)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1266, file: !4, line: 2811, baseType: !957, size: 32, align: 32, offset: 6272)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1266, file: !4, line: 2821, baseType: !957, size: 32, align: 32, offset: 6304)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1266, file: !4, line: 2830, baseType: !957, size: 32, align: 32, offset: 6336)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1266, file: !4, line: 2840, baseType: !957, size: 32, align: 32, offset: 6368)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1266, file: !4, line: 2851, baseType: !1701, size: 64, align: 64, offset: 6400)
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DISubroutineType(types: !1703)
!1703 = !{!957, !1522, !1704, !939, !1464, !957, !957}
